[{"keywords": "Gozo", "author": "", "article_body": "The January issue of Il-Ħajja f’Għawdex is just out with its characteristic variety of articles related to everything Gozitan. This issue is the first in full colour and this asset isskilfully exploited especially in the cover, showing the hilltop figure of Christ the Saviour rising above an argosy of winter colours gracing the Gozitan countryside.\n\nThe diocesan chronicles reveal an incredibly active Church in all spheres of society, while we can also read, among others, scholarly articles on the linguisting features of the Gozitan dialect, herbal medicine and invasive flora and fauna found in Gozo.\nIn terms of history, what stands out is a sober article on the greatest single tragic event in Maltese history, which stole away 23 Gozitan victims in one fell swoop.\nThe photo of the month shows a postcard showing Mġarr Harbour published in around 1900.\nilhajjafghawdex@gozodiocese.org", "comment_count": 0, "id": 0}, {"keywords": "Education", "author": "Ognjen Pantovic, Leon Buttigieg, Aleksandrs Andrejevs and Zeno Kohan", "article_body": "Science students at St Margaret College Senior Secondary School Verdala, Cospicua, recently undertook research about oranges. The study was linked with the study unit Body Basic Needs.\nOranges contain vitamins A and C, as  well as calcium, potassium and pectin. Their phytochemicals and limonoids help the body fight against skin, lung, breast, stomach, liver and colon cancers, viral infections and promotes heart and eye health. Drinking orange juice regularly helps lower cholesterol, prevents kidney diseases, reduces the risk of kidney stones and relieves constipation.\nHowever, a balanced diet is recommended and orange juice must be taken in moderation. Fruit juices’ high sugar content can cause tooth decay. Also, oranges should always be washed to remove any insecticide sprayed on them.\nOranges are the largest citrus crop in the world and Brazil is the top producer. The two most common varieties of oranges are Navel and Valencia. Orange is considered the world’s third favourite flavour after chocolate and vanilla.\nOranges were first grown in southeast Asia, northeastern India and in southern China around 2,500 BC. Young orange trees were first brought to Rome from India in the 1st century AD and oranges began being grown in North Africa in the 1st century AD.\nIn 1493, Christopher Columbus carried orange seeds across the Atlantic to Haiti, where he planted orange or­chards. By 1518 they were introduced to Panama and Mexico, and later to Brazil.\nIn America, orange trees were first planted in Florida in 1513 by Spanish explorer Juan Ponce de Leon. Today the US produces  25 billion oranges a year.\nIn the 1780s, Queen Marie Antoinette of France used to enjoy eating Maltese oranges at Versailles Palace shipped via the port of Marseille.\nThe students’ research was supervised by their science teacher Martin Azzopardi.\nThe authors are students at St Margaret College Senior Secondary School, Verdala, Cospicua.", "comment_count": 0, "id": 1}, {"keywords": "Gozo", "author": "", "article_body": "• Gozo Bishop Mario Grech will mark the feast of St Paul’s Shipwreck with a Pontifical Mass at Munxar parish church today at 8.30am.\n• Fantastic Beasts: The Crimes of Grindelwald (12A) will be screened at the Don Bosco Oratory, Victoria, today at 5.30pm.\n• Diocesan Vicar General Mgr Tarcisio Camilleri will concelebrate Mass at Lourdes church in Għajnsielem to mark the apparition of Our Lady of Lourdes and the World Day of the Sick tomorrow at 5pm. Masses will be celebrated at 5.15 and 9am and at 1 and 3.30pm. There will be Mass in Italian for the Italian comunity residing in Gozo at 6pm.\n• The Oasi Foundation bazaar is open in St Francis Square, Victoria, until March 1, Monday to Friday from 8.30am to noon and from 4.30 until 7pm; on Saturday it will be open until noon.\n• The Catholic Action Movement (Gozo) is organising a two-day stay at Stella Maris Home in Żebbuġ. Fr Norbert Bonavia will lead a programme adapted for the Diocesan Marian Year on Tuesday from 9am until 5pm the following day. The programme includes Mass, prayers, talks and reflections. Participants are free to choose their suitable time. More details from antvassallo@gmail.com or on 9988 1878.\n• A blood donation session will be held at Xewkija District Health Centre on Tuesday from 1pm to 5pm.\n• Il-Fergħa Ewkaristika (Gozo) will hold an hour of adoration at Our Lady of Pompeii church, Victoria, on Thursday from 9am until 10am. The Rosary will be recited at 8.45am. Everyone is invited.\n• The Aurora Theatre will be screening Saturday Night Fever on Saturday at 7pm as part of Valentine’s Day programme. Entrance is free.\n• The Victoria Scout Group will be holding a Founder’s Day lunch at its headquarters in Victoria next Sunday at 12.30pm. Tickets can be obtained from the Group Scout Leader Lorrie Saliba (tel: 7955 5844) or the Scouts headquarters on 2155 6497 until Thursday.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 2}, {"keywords": "Education", "author": "", "article_body": "A call for applications has been issued for a grant to sponsor participation in SciCulture, a new, intensive five-day course in Greece in April that aims to bring together students and professionals from artistic, scientific and entrepreneurial backgrounds to learn how to work together in diverse teams to solve complex problems.\nParticipants will be able to focus on a range of topics during the course, including climate change issues, the Antropocene concept, artificial intelligence, the future of food, genetics and communications, science theatre, performance arts merged with science and the design thinking process.\nThese topics will be tackled by trainers and speakers from all over Europe through short lectures and hands-on workshops. Participants will also be mentored to go through a design thinking process to find the best solution to the address issues of concern to the EU.\nThe course is organised by the University of Malta, the University of Exeter, the University of Bergen, TU Delft and Science View as part of a project funded with support from the European Commission under the ErasmusPlus programme.\nApplications for the grant are to be submitted by Thursday. For further information visit the website below.\nwww.sciculture.eu", "comment_count": 0, "id": 3}, {"keywords": "Education", "author": "", "article_body": "University lecturer Charles Xuereb will lead a course of five lectures in Maltese entitled Memorja Kollettiva u Identità f’Eks-Kolonja (collective memory and identity in an ex-colony), organised by the Philosophy Sharing Foundation, at the Volunteer Centre, 181, Melita Street, Valletta, every Monday between February 18 and March 18 from 6.30 to 8pm.\nIn public discussions there are often references to the collective memory and identity of the Maltese, but not enough reflection to discover who are we, where we come from and why we behave the way we do. And despite sharing the same past, present and future, there is even less reflection on where we are going as a nation.\nNo community can truly discover itself without taking responsibility for its past. In the case of Malta, colonialism has formed what we are today, often through a defective formation of our identity. This occurred with the support of sections of society that only sought their own limited self-interest. This can still be seen today in the colonial mentality that still exists in people, in the way foreigners still occupy memory in our public spaces and the confused way we project ourselves to foreigners.\nWere our forefathers mistaken? Are we a complete nation? Did the Church help or hinder us?\nThe course aims to tackle questions on this theme and substantiate answers on the basis of historical, social and philosophical research and visual facts.\nDr Xuereb has had a 45-year career as a teacher of French, and in educational and journalistic broadcasting. In 2011 he was awarded the title of Chevalier de la Légion d’Honneur by France in recognition of his continuous efforts to promote French culture in Malta.\nFor further information and to book a place, visit the Foundation’s website below.\nwww.philosophysharing.org", "comment_count": 0, "id": 4}, {"keywords": "", "author": "Keith Micallef", "article_body": "A landmark judgment which left the competition watchdog toothless could have wider repercussions as other regulators might also be stripped of their ability to impose fines if challenged in court, Times of Malta has learnt.\nThe alarm bells were initially sounded by Times of Malta following a tip-off by a competition law expert who preferred to remain anonymous.\n“One by one, each public authority with the power to impose administrative fines will end up being challenged,” the expert remarked.\nKevin Aquilina, Dean of the Faculty of Laws at the University of Malta, shared such concerns. “There is no doubt that the judgment has repercussions on all those administrative bodies in Malta that impose administrative sanctions,” he said. \nSuch entities include the Regulator for Energy and Water Services, the Malta Communications Authority and even the Broadcasting Authority.\nThe issue goes back to a 2016 Court of Appeal judgment, which had found that certain provisions of the Competition Act were unconstitutional.\nThe case had been instituted by the Federation of Estate Agents, which had felt aggrieved by the decision of the Director for Competition to proceed against it over alleged breaches of the law. The federation argued that only a proper court could deliver a decision on the matter given that, in case of ‘guilt’, it could be fined up to €1.25 million.\nFollowing the judgment, the Competition Office had announced it would be refraining from imposing any fines until the situation was remedied. Attempts to address the matter through an amendment to the Constitution failed due to lack of cooperation by the Opposition. The government has yet to present amendments to the law in Parliament.\nA Bill was published for public consultation in August last year but the government was forced to go back to the drawing board following another judgment in November. \nThe judge, hearing a case involving a fuel station owner and an oil company, ruled that the Competition Office could not even carry out its own investigation to determine if a breach has been committed.\nAsked about the way forward, Prof. Aquilina warned against adopting a piecemeal approach.\n“A more holistic strategy needs to be adopted, while bearing in mind European Court of Human Rights case law,” he said.\nProf. Aquilina said the “easiest solution” would be to make provisions whereby the decisions of such administrative bodies might be appealed before the Administrative Review Tribunal.\nHe also suggested the establishment of a new panel within the tribunal whose remit would be to hear appeals from administrative sanctions imposed by administrative bodies. \nHowever, he pointed out, this would only offer a stop-gap solution and the way forward should be the setting up of an Administrative Court to handle such appeals.\nThe competition law expert who had originally flagged the issue to this newspaper said one option would be to have every infringement prosecuted by the public authority concerned before a court. But this could possibly lead to more pressure on the courts and more delays, he acknowledged.\nAnother alternative was to amend article 39(1) of the Constitution (provisions to secure protection of law), which is the basis of the 2016 court judgment.\nAnswering a parliamentary question on the matter recently, the Justice Minister refused to commit himself on when the law amendments would be tabled in the House, only saying this would happen “sometime this year”.", "comment_count": 8, "id": 5}, {"keywords": "", "author": "Claire Caruana", "article_body": "High patient numbers at Mater Dei Hospital have continued to persist in the past days, with the hospital operating at “above normal” activity levels, Times of Malta has learnt.\nDespite this, hospital CEO Ivan Falzon is convinced that the number could soon return to normal as temperatures start to rise and stabilise.\nIn recent weeks, the government confirmed to the newspaper that the hospital was operating “very close to full capacity”. While in recent years the cold winter months have often led to an influx in the number of patients at the hospital, the problem was even worse this year as aside from the seasonal influenza there was also an outbreak of the potentially deadly swine flu.\nIn comments to Times of Malta, the CEO noted that despite the increase in numbers, the hospital did not have to reschedule any surgeries.  \nDedicated team ready to go the extra mile when asked\n“We managed to retain elective activity thus avoiding patient inconvenience when scheduled interventions are postponed. All this couldn’t have been achieved without the input of a dedicated team of professionals ready to go the extra mile when asked,” the CEO noted.\nIn recent years, the winter months have been the busiest for the health system, with the hospital dealing with greater influxes of patients suffering from the seasonal influenza.\nFears have also been raised by sources in the medical sector that an ageing population coupled with an increase in the number of foreigners moving to the island could prove to be problematic for the entire health system, expressing concerns there might soon not be enough beds in hospitals and centres to treat all patients.\nAsked about this recently, Health Minister Chris Fearne told Times of Malta that once the plans to build a new outpatients department came to fruition, there would be more beds available.\nAsked whether the government had any immediate plans to address the issue, in light of the fact that the past two winters had already resulted in hospitals being jam-packed, Mr Fearne insisted that works on the new department would commence this year. He did not say when these would be completed.\n ", "comment_count": 17, "id": 6}, {"keywords": "", "author": "", "article_body": "The recipient of Drew Abela’s heart, the 20-year-old who passed away in 2016, talks to Pink about living half her life with a sick heart, and having a second chance to care for a special one when the “superhero” donated his organs on his death.  \nThe story in the February issue of Malta’s magazine for women, out with The Sunday Times of Malta tomorrow, is not only deeply moving, but also raises awareness of the need for more people to register for organ donation – a nationwide campaign the young man’s brave and exemplary family has now launched. With only three per cent of the population in Malta being registered donors, they are focusing their energy on this cause.\n“When our family shrank after the loss of Drew, it actually expanded as we now have a kind of extended family,” Drew’s mother tells Pink, referring to the seven recipients of Drew’s organs and the seven saved lives.\nMeanwhile, the recipient of his heart, Christine Grixti, opens up to Pink about learning she needed a transplant; the moment she received the anticipated call that a heart was available and the anxiety that took over; the mixed feelings of discovering who her donor was; and the eventual emotional encounter with his family.\nThe touching story is fitting for the Valentine’s Day issue, taking the idea of giving your heart to someone to another level, with the recipient saying how beautiful she feels with Drew’s heart beating inside her, how she is caring for it, and her strong encouragement, together with his parents, not to waste organs, but to be a hero like their son and let them live in someone else’s body.\nThe idea of coping and moving ahead is also found in the story about life after divorce for a family whose world could have fallen apart when the parents went their separate ways.\nA change management consultant and mum of three, Sharon Cusens, talks about how she wrote a story to help her children deal with the trauma that was about to befall them, designing an “emotional navigation system” to guide her children towards a new life with a positive attitude. The family’s healing journey began – and later evolved into a three-book project co-created with her children.\nOn the subject of children, teen love takes centre stage, with clinical psychologist Edward Curmi saying that although the prospect of their kids dating could make most parents cringe, it is actually a very natural process that has to take its course.\nAnd for a touch more romance – with a twist – the joys of a ‘ticket for one’ and dressing up for a date night alone at the theatre bring out the importance of independence, me time and escapades for a married mum, who promotes the freedom of solo travel and how liberating it can be to dine in her own company at times.\nPink is a monthly magazine, published by Allied Newspapers Ltd.", "comment_count": 1, "id": 7}, {"keywords": "", "author": "", "article_body": "A Malta-based operator is in the process of setting up a new airline focusing on Libya, according to a report. \nMedavia is applying for an Air Operator’s Certificate from the Libyan Civil Aviation Authority, paving the way for scheduled flights to begin in 2020, according to a report in Forbes.\n“The overall idea is to offer more frequent, reliable services between the Libyan cities,” chief executive Rammah Ettir told Forbes during an interview. “The services that are being offered at the moment are not really good and the Libyan travellers deserve much better.”\nMr Ettir expects the AOC to be granted in the second half of this year. He is evaluating the Bombardier Dash-8 Q400 and the ATR 72 for Medlib’s fleet, both models that Medavia Technics, the company’s technical arm, is certified to conduct maintenance work on.\nMedlib plans to initially focus on domestic connectivity, with flights operating from Tripoli to all the main cities in Libya. Its fleet will be based in Mitiga International Airport, the capital’s main gateway since Tripoli International Airport was destroyed by fighting in 2014.\nLibya is currently served by two state-owned flag-carriers – Afriqiyah Airways and Libyan Airlines – as well as privately owned Libyan Wings and Buraq Air.\n“If we manage to succeed in the domestic [market, I’m] sure there will be a request to go for regional routes,” Ettir said, identifying Malta, Djerba (Tunisia), and Alexandria and Luxor (Egypt) as possible targets.\"\nMedavia operates five flights per week from Malta to Mitiga with its own fleet, deploying a 19-seat Beech 1900 and a 37-seat Dash-8 100.\nAll of Libya’s airlines have been banned from flying to the European Union since 2012 owing to perceived shortcomings in regulatory oversight in the war-torn country.", "comment_count": 13, "id": 8}, {"keywords": "", "author": "", "article_body": "Low-rise houses in whole streets in Attard are being demolished turning the locality into a concrete jungle, Alternattiva Demokratika warned on Saturday.\nAttard is choked with traffic and unbridled construction, AD chairman Carmel Cacopardo told a news conference, blaming especially the rationalisation scheme approved in 2006.\nThe massive increase in building density is also leading to a large increase in cars in a small area and consequently an increase in traffic and the degradation of air quality.\nIn the past week, AD submitted its views during the public consultation exercise for the cycling strategy but claimed that Transport Malta is \"not keen or helpful\" when it comes to this kind of transport.\nAttard is situated in an area of Malta in which travel from one locality to another on foot or by bicycle is rather easy. \nReducing the maximum speed in residential areas to 30 kilometres per hour, as well as investment in widespread infrastructure to encourage the use of bicycles would help cushion the problem, he said. ", "comment_count": 37, "id": 9}, {"keywords": "", "author": "", "article_body": "Updated 12.30pm with supplier's statement\nA supplier has assured the public its water was safe to drink after the health authorities earlier issued a warning about 'H2 Only Purified Drinking Water' due to the possible presence of fragments of black rubber inside.\nIn a statement on Saturday, the Environmental Health Directorate within the Superintendence of Public Health said it had carried out the necessary investigations after receiving information from the public.\nThe two-litre bottles in question c, has a 'durability date' of June 2020, and is from 'Lot: 4 02, 4 03'.\nIn a Facebook post, Island Beverages Ltd said the two batches were being collected due to a machine fault. \nIt said the move was a precautionary one and that suspected bottles have already been collected and destroyed.\n\"Laboratory tests have been carried out and water is still of excellent quality.\"\nFor further information, the public is requested to contact the Health Inspectorate Services on 2133 7333 between 8am and 2.30 pm or by calling personally at its offices at Continental Business Centre, Old Railway Track, Santa Venera or by email mhi@gov.mt.\nThe public is also being invited to access the directorate’s Facebook page.", "comment_count": 8, "id": 10}, {"keywords": "", "author": "Keith Micallef", "article_body": "Taxpayers will have to fork out €20,107 after State agency Infrastructure Malta was fined for carrying out roadworks without a permit, the second time it was penalised in under seven months.\nThis latest fine was imposed by the Planning Authority as “sanctioning fee” in connection with a project carried out last year to widen a traffic junction in Ħal Farruġ, limits of Luqa.\nOnly last August, Infrastructure Malta was slapped with a €42,454 fine over the controversial Tal-Balal road-widening project, which started even before a permit was issued.\nThe agency opted to sanction the work\nIn both instances, the agency opted to “sanction” the work, the term used in applications to regularise illegal development.\nIn the case of Ħal Farruġ, the sanctioning application was filed as part of a second phase of the same project, which has just commenced. The latter phase comprises the widening of the upper part of this 1.7-kilometre road all the way to Triq l-Avjazzjoni Ċivili near the old airport. Though the application is still pending, it is being recommended for approval by the PA case officer.\nIn his report, he points out that the sanctioning applies for work carried out last year that involved the removal of a boundary wall next to St Vincent de Paul Residence, removal of soil, relocation of trees and light posts and the shifting of a central strip.\nThe project aims to remove the bottlenecks at either end of the road in Qormi and Luqa respectively.\nFrom an environmental perspective, the case officer noted that the main concern was the uptake of agricultural land to increase the overall footprint of the road.\nIt transpires that this will require the expropriation of 9,000 square metres of land, 6,000 square metres of which are of an agricultural nature. Moreover, 69 trees will have to be uprooted, 76 transplanted, 117 would be undisturbed and a further 45 planted.", "comment_count": 27, "id": 11}, {"keywords": "", "author": "", "article_body": "Updated 9pm, adds Nature Trust statement\nThe authorities and developers need to get to the source of construction waste problem before proposing land reclamation, the Interdiocesan Environment Commission (KA) said in a strongly-worded statement on Saturday.\nThe authorities have for many years shirked their responsibility to plan long term, and have allowed some enterprises to become rich to the detriment of all and sundry.\n\"And now that those who have been having it so good are feeling the pinch, they are expecting Malta to shoulder the brunt of their excesses,\" the commission said. \nLast December, the environmental watchdog singled out the coast of Xgħajra as the only viable location for a “major” land reclamation project.\nLast week, the Malta Developers Association called for an area at sea to be reclaimed by construction waste as there was a lack of land facilities for its disposal.\nRead: Nowhere to dump construction waste, say people responsible for it\nWhat has long been crystal clear to people with a strategic vision, does not seem to have been so obvious to whoever was or is responsible for generating such waste and to the authorities who should have long devised plans to avoid ending up in the situation we are in today, the commission said.\nAccording to the polluter pays principle, the onus should fall on those, who for years on end have used unsustainable means of construction to generate wealth, sending a great quantity of Maltese stone to the landfills.\n\"When it comes to spaces available for dumping waste, it is being said that “the demand is far greater than the supply”. If this were true, we have a clear admission that the current development is anything but sustainable, and that we have gone beyond the carrying capacity of our country.\"We, the common citizens, are expected, without any consideration, to cast it aside by literally dumping it into the sea, so construction can continue unabated\nUnsustainable practices have carried on in spite of repeated warnings from various sectors on the need to exercise some form of control in this industry.\n\"We, the common citizens, are expected, without any consideration, to cast it aside by literally dumping it into the sea, so construction can continue unabated.\"\nThe commission insisted on the need to protect the marine biodiversity.\n\"If we are to treat it as a new dumping site to cover up what we wouldn’t like to see, we would once again be deluding ourselves into thinking we have found a solution to the problem of excessive waste resulting from the unsustainable activity of the building industry, and gradually induce a localised or total collapse in our marine ecosystem.\"\nRead: Just one place in Malta is suitable for major land reclamation, experts say\nThe dimensions of the reclamation has to be meticulously calculated and should not be determined simply by the quantity of rubble which needs to be disposed of.\nThe criteria for the choice of the site should not be dictated by the commercial interests of whoever would like to develop reclaimed land, of whoever stands to gain from reclamation in a particular zone or by anyone who may have a personal interest of whatever nature.\nConstruction waste should primarily be reduced. On the other hand, it should not be seen as a problem to be tackled by someone else, sooner or later, but as a responsibility to be borne also by the developers themselves.\n\"We need to apply set standards for controlled demolition, with the aim of separating and recycling material, and promote practices that are more sustainable and discourage waste. We also need to explore the potential of construction and demolition waste as a resource.\"\nAs proposals for huge projects and spacious structures are being approved (or put aside until a technical detail justifying their approval is found) one must be sensitive to the cry of the majority of the Maltese who can no longer bear to witness the destruction of their homeland through uncontrolled construction, the KA said.\n\"The basic issue still remains: Whose interests will be safeguarded? Those of the common citizen who is obliged to pay for the abuse of others? Or those of irresponsible egoists who think that they are above the law and that their money can buy anything and anyone?\"\nTake action without further delay - Nature Trust\nNature Trust welcomed the statement and said that if this administration sincerely endorsed what past administrations have been stating for these last 15 years, namely that they would apply the polluter pays principle, it should move to take action without further delay.\nConstruction activity was a polluter so anyone connected with to it had to shoulder responsibility and pay for the pollution generated.\nNature Trust also welcomed the announcement made by the Ministry for Sustainable Development and the Malta Developers Association that unused quarries would be utilised to take in this waste.\nThis was a short term solution and the national authorities should immediately embark on planning a long-term strategy to address the issue.\nThey should also apply the reduction, re-use and recycling principle rather than go for crisis management actions such as dumping at sea to hide their incompetence.", "comment_count": 102, "id": 12}, {"keywords": "", "author": "Denise Grech ", "article_body": "An influx of foreigners left the primary school in St Paul’s Bay with no option but to turn to mobile rooms to provide additional classroom space, the college principal admitted.\nThe classrooms, called “prefabricated rooms”, are a type of structure that seeks to provide quick and temporary additional classroom space where there is a shortage of capacity.\nSpeaking to Times of Malta on a site visit to the school, college principal Patrick Decelis said it became clear more space was needed to contain the issue of over-crowding. Ten prefabricated classrooms were installed in the playground in order to cope with the demand, he added.\nSome 15 students stay in each classroom. Students in their fifth and sixth year and in Kinder 1 and 2 also stay in the prefabricated rooms, he said. Mr Decelis insisted he refused to have any more pre-fabricated classrooms installed.\nThere needs to be a new school\nTimes of Malta reported earlier this week that children in some State schools may have to attend classes in mobile classrooms because of lack of space. Arrangements have been made to install mobile classrooms at St Paul’s Bay primary and Żejtun’s secondary schools as from the next academic year, sources said.\nRead: Mobile classrooms under consideration for some overcrowded state schools\nParents who spoke to Times of Malta had mixed reactions to the rooms. One parent said the mobile rooms already installed were comfortable, “although small”, while another said they were too cold.\nMany, including some who spoke to this newspaper on condition of anonymity, said the need for a new school at St Paul’s Bay had been evident for years, after an influx of people to the locality.\n“You can’t blame the school because there’s clearly a problem with a lot of students,” one parent said. “From September there needs to be a new school,” she added.\nSchools have had to install “pre-fabricated classrooms” in order to cope with the influx of students. Photo: Chris Sant Fournier\nFamilies in St Paul’s Bay and Qawra have been waiting since 2015 for the opening of a new State primary school. The project was meant to address the rapid rise in population in the area, which has exceeded 20,000.\nA tract of land close to the Qawra church was chosen for the new school by the Foundation for Tomorrow Schools, a State agency responsible for large capital projects falling under the responsibility of the Education Ministry.", "comment_count": 139, "id": 13}, {"keywords": "", "author": "Jacob Borg", "article_body": "Former Opposition leader Simon Busuttil has vowed to summon Nexia BT’s Karl Cini to testify in a libel case linked to the Panama Papers and 17 Black.\nIn an e-mail to Panama law firm Mossack Fonseca, Mr Cini had said 17 Black would send up to $2 million to the companies owned by the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi.\nMr Cini had been summoned to testify in a libel suit by Dr Mizzi against Dr Busuttil but, a few days ago, the minister unexpectedly decided to drop all libel proceedings he had initiated linked to the Panama Papers.\nRead: 'I was damn right. Konrad Mizzi is corrupt': Busuttil says as minister drops libel cases\nDr Mizzi has testified in court he had absolutely no link to 17 Black.\nIn comments to the Times of Malta, Dr Busuttil said Mr Cini’s testimony was crucial to expose Dr Mizzi’s “lies”.\n“It is not over. We will still summon Cini to court in the separate libel cases the Prime Minister’s chief of staff, Keith Schembri, had filed against me. Unless, of course, Schembri will follow the lead of his fellow Cabinet member and business partner Konrad Mizzi and run away from justice too,” Dr Busuttil said. Mr Schembri did not respond to a request for comment.\nA joint investigation by the Times of Malta and Reuters found that power station investor Yorgen Fenech owned 17 Black. Mr Schembri has admitted to having “draft business plans” with 17 Black but denies knowing who owned the company. The Prime Minister never answered questions about whether he quizzed his top aide about such “draft plans”.\nDr Busuttil said Dr Mizzi’s latest antics were just some in a long line of actions spanning three years. He said Mr Schembri and Dr Mizzi had done everything possible to resist, stall, oppose, block and run away from justice, with the full complicity of the Prime Minister.\nDr Busuttil said the two men were using their position of power to protect themselves from investigation and prosecution.\n“Sooner or later, justice will catch up with them,” he said.", "comment_count": 183, "id": 14}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta says the number of working people unable to afford a roof over theirhead was on the rise, according to the head of a Valletta shelter. It also reports the bizarre court case of a young man who raped the mother of his 15-year-oldgirlfriend by saying that she had brought the devil into the house.\nIn-Nazzjon reports that the people emerged as winners after the government was forced to withdraw the controversial Corinthia deal. It also says that Evarist Bartolo had admitted the government had failed in the environment sector. \nL-orizzont quotes President Marie-Louise Coleiro Preca saying workers should be enrolled in trade unions. It also cites Minister Konrad Mizzi calling for more investment where it came to the management of visas.\nThe Malta Independent reports that forner MP Franco Debono does rule out a return to politics, including as an independent. \n ", "comment_count": 0, "id": 15}, {"keywords": "", "author": "Denise Grech ", "article_body": "The number of working people unable to afford a roof over their head was on the rise, the head of a Valletta shelter told experts attending a conference on homelessness yesterday.\nUntil 2017, of the 30 people living at the YMCA shelter, 20 would be unemployed. That  has now changed: at least 20 of the residents would either have a full-time or a part-time job but could not afford to rent accommodation, CEO Anthony Camilleri told the Times of Malta.\nHe also witnessed a rise in the “phenomenon” of the working homeless through his work with Dar Papa Franġisku and Dar Maria Dolores, two other shelters. Both foreigners and Maltese were feeling the brunt of higher rent prices, he warned.\nThe issue highlighted the need for a higher minimum wage. It was impossible for those earning €762, the minimum wage, to afford an average rent of €400 or €500, Mr Camilleri said. The Times of Malta reported last week the minimum wage in Malta was well below the European Union average of €924.\nRead: Malta’s minimum wage below EU average\nAt least 20 of the residents would either have a full-time or a part-time job\nMr Camilleri said the YMCA and other charities were turning homeless people down daily because shelters were full.\n“What is common among these people is the feeling of emptiness, repression and an unclear identity,” he said.\nAddressing 120 experts on the “hidden scandal” of homelessness during the conference, he encouraged social workers and the Housing Authority to make a difference.\nSociologist Ann Marie Cutajar noted there was no clear definition of homelessness in Malta. The figures usually quoted referred to those sleeping outdoors but that did not present an accurate picture, she pointed out.\nFigures tabled in Parliament last year show that 27 people had been found sleeping rough between 2013 and 2017. However, charities that provide shelter to the homeless were quick to dismiss the figure, saying the data only reflected cases known to the police. In fact, Dar Papa Franġisku and Dar Maria Dolores hosted an average of 23 people daily, said a Caritas spokeswoman.\n“What about the person who is informally staying with friends and family but who cannot afford a place of his/her own,” Ms Cutajar asked. “What about those who are living in ‘overshared’ apartments, with five other people,” she added.\nHousing rights were also a vague issue under Maltese legislation, leading many to resort to inadequate or insecure housing, she complained.\nCaritas CEO Anthony Gatt also warned that homelessness was on the rise, saying his organisation was “scrambling” to find more places for people at Dar Papa Franġisku. Mr Gatt paid tribute to late activist Charles Miceli, who had campaigned for the rights of the poor and vulnerable throughout his life. Mr Miceli had called for the regularisation of rent prices and an increase in the minimum wage, insisting that cheap labour and precarious work was prevalent on the island.", "comment_count": 84, "id": 16}, {"keywords": "", "author": "", "article_body": "Huge flames ravaged a garage in Triq Ignazio Saverio Mifsud in Birkirkara. An eyewitness described the dramatic ball of fire that lit up the street.\nThe fire has since been brought under control but the surrounding properties were affected, Mark Theuma told the Times of Malta.\nAnother eyewitness said that the car inside the garage had been completely destroyed.", "comment_count": 0, "id": 17}, {"keywords": "", "author": "Jacob Borg", "article_body": "Malta’s veto would not protect the island forever from tax harmonisation, Nationalist MEP candidate Peter Agius has warned.\nHe dubbed proposals by the European socialists to harmonise corporate tax rates as a very dangerous one for Malta’s competitiveness, particularly if they gained traction during the forthcoming MEP election campaign across the EU.\nIn a policy document launched ahead of the European Parliament elections in May, the Socialists and Democrats (S&D) are proposing a minimum effective tax rate of 18 per cent on corporate profits.\nThe document also calls for the removal of the unanimity required on certain tax issues to ensure that “no single member state can veto much-needed tax reform to its own benefit”.\nDr Agius insisted that Malta’s veto should not be used as an antidote to all of this.\n“Our veto will not protect us forever from tax harmonisation. Suffice to say that, with the Lisbon Treaty, nine or more member states may proceed with an initiative of their own in a field where other member states are opposing progress through veto,”he noted.\nHe said such enhanced cooperation was already being envisioned for the introduction of a financial transaction tax, with large member states like Germany, France and Italy proposing a tax on share and bond transactions of 0.1 per cent.\nDr Agius said the “radical” proposal by the European Socialists could become another opportunity for enhanced cooperation which, although not directly applying to Maltese companies in Malta, would still be applicable to their operations in the continent, hence effectively eroding the competitive advantage of Malta-based firms.\nHe noted that while Labour MEPs had consistently opposed similar proposals, they were evidently “losing clout” within the S&D group.\nDr Agius said defending Malta’s tax competitiveness in the European institutions required a closer coordination of all Maltese efforts in Brussel, starting from essential gestures of teamwork and responsibility from the Labour Party, which must first reconsider its propaganda of branding all voices not toeing its line in Brussels as traitors in Malta.", "comment_count": 15, "id": 18}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The husband of a woman who is a mother of six children fathered by different men was arrested and arraigned over an alleged case of domestic abuse.\nThe unemployed Syrian national, residing at Marsascala, pleaded not guilty on Friday to having allegedly beaten his partner and their child, inflicting slight injuries, causing the woman to fear violence as well as misusing telecommunications equipment. He was further charged with escaping from police custody.\nSenior prosecuting Inspector Trevor Micallef explained in court how the man had allegedly turned violent and had hit out at the woman and his son.\nThe victim took the witness stand to declare that she had since forgiven the accused, so long as there was no further harassment on his part.\nThe man pleaded not guilty to the charges.\nWhen making submissions on bail, defence lawyers Franco Galea and Lucio Sciriha pointed out that although the man had escaped from police custody after his interrogation, he had been returned to police custody by his family, one hour after his escape.\nMoreover, it was argued that the man had a clean criminal sheet and resided apart from the victims, at a different locality altogether.\nThe prosecution countered that the man was in Malta illegally and always came up with excuses when summoned by the police, prompting the defence to rebut that their client had valid documents in Malta.\nIn the light of these submissions, the court, presided over by magistrate Rachel Montebello, upheld the request for bail against a deposit of €300 and a personal guarantee of €3,000.", "comment_count": 0, "id": 19}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Czech man, who had undergone extradition proceedings last year, has been targeted by a fresh European Arrest Warrant.\nMarek Drga, 40, was arrested and arraigned on Friday, declaring he was not voluntarily surrendering to the second warrant issued against him by the Czech authorities, demanding his removal back to his homeland to face charges of tax evasion, tax fraud and complicity in crime.\nLawyer George Camilleri, from the Office of the Attorney General, explained that Mr Drga had not consented to the first EAW served upon him in November 2017, but had been extradited under court order, duly prosecuted and sentenced.\nThe man had filed an appeal and had returned to Malta pending final judgment, the court was told. A second warrant had been issued whereby, in keeping with the rule of speciality, he was to be tried only for those offences mentioned in the warrant.\nA request for bail was made by defence lawyer Roberto Montalto who claimed that the Czech authorities were “abusing the system.”\n“Mr Drga was tried,” said the lawyer, and “all throughout proceedings, he was being coerced to renounce to his right under the rule of speciality and pressured to testify against third parties, which is the real reason for the request.”\nThe man had appealed the judgment, being granted bail and being allowed to travel by those same authorities who were now demanding his “forceful return,” Dr Montalto argued.\nHowever, Dr Camilleri countered that this was a “high profile case in the Czech Republic,” and that the prosecution feared that the requested person could attempt to abscond, pointing out that Mr Drga had filed an application to retrieve his ID card from the records of the previous case.\nThis was a “tell-tale sign” which, coupled with his resistance to the extradition, rendered the fear of absconding a tangible and real one, Dr Camilleri went on.\n“He’s been in Malta since October 2018, having returned to the same job he had in Malta before his extradition. He went to the police in order to obtain his ID card so as to regulate his position,” the man’s lawyer explained.\n“I want to show that I am here legally,” the man himself remarked.\nAlthough the AG’s office had deemed the second EAW rather “unsavoury”, they were bound to adhere to it since it involved new charges and new circumstances.\nAfter hearing submissions on bail, the court, presided over by Magistrate Rachel Montebello, rejected the request in view of the fact that it was not convinced that Mr Drga could offer sufficient guarantees and also because of the possible risk of absconding.The case continues next week.", "comment_count": 0, "id": 20}, {"keywords": "", "author": "", "article_body": "Former Gozo Minister Anton Refalo has been cleared of domestic violence charges after a magistrate dismissed a police officer’s testimony as “hearsay”.\nDr Refalo, a long-standing MP who also serves as chairman of Heritage Malta, stood accused of having beaten his son.\nIn his judgement, magistrate Joseph Mifsud noted that a doctor had confirmed Dr Refalo’s son had suffered slight injuries.\nHe also noted that Dr Refalo’s wife, who was present during the incident, had asked to be exempt from testifying – a request he granted, citing case law. The teenage victim was also exempted from testifying.\nDomestic violence laws empower the police to press charges without a victim’s consent.\nNevertheless, magistrate Mifsud dismissed claims made by a police officer, saying that nobody who testified had witnessed the alleged events. \n“Apart from the police officer’s testimony, which is mere hearsay, and is therefore inadmissible as evidence, this case is marked by a lack of proof which can substantiate the claim,” the magistrate noted.\nHe cited legal notes on criminal procedure, which noted that evidence should be rejected as hearsay if “first, that the person originally stating the facts does not state them on oath, and secondly, that the person against whom the evidence is offered had not the opportunity of cross-examining that other person as to his recollection, veracity or means of knowledge”.\nIn 2016, Times of Malta had reported that magistrate Mifsud had served as a consultant to the Gozo Ministry prior to being nominated to the bench.", "comment_count": 0, "id": 21}, {"keywords": "", "author": "Ivan Martin", "article_body": "The “scandalous” Corinthia mega-development deal had been withdrawn by the government only after opposition from the Nationalist Party, Opposition leader Adrian Delia said on Friday.\nAddressing a press conference, Dr Delia said he was satisfied to read that the government had gone back to the drawing board on the proposed development in St George’s Bay.\nA draft deal to hand over hundreds of thousands of square metres of land to the Corinthia Group to develop into a six-star hotel, apartments and retail space in St Julian’s is being redrafted.\n\nTourism Minister Konrad Mizzi was forced to withdraw the plans, which were only presented to parliament last December, following vociferous opposition from the Opposition, business leaders and environmental activists.\nIn a letter sent to deputy prime minister Chris Fearne, who also chairs parliament’s National Audit Office accounts committee, Dr Mizzi said he was withdrawing those plans and would be presenting fresh ones “in the coming days”.\nDr Delia said that while he was pleased with this development, this was only the start of the fight.\n“We will continue to fight and resist any deal that abuses of public land and does not go through proper procedures,” he said.\nAsked what lines in the sand the Opposition was drawing on the proposed project, Dr Delia said he was not against the touristic element of the project.\nHowever, he said he could not be onboard with any project that was handing over public land for the purposes of property speculation.\n“This is the red line for us,” he said.\nAsked whether the PN would be taking similar stands on other contentious land grabs - such as that involving the DB Group - Dr Delia said he would always stand up against abuse of public assets.\nThe db Group is planning to build a five-star hotel and a residential 38-storey tower on 24,000 square metres of public land at the former ITS site.", "comment_count": 6, "id": 22}, {"keywords": "", "author": "", "article_body": "Workers should always be members of a trade union as this would result in better work conditions and their rights being protected, President Marie-Louise Coleiro Preca has said. \nShe was speaking at the signing of a collective agreement between the General Workers’ Union and the Community Chest Foundation for workers at the Kitchen Garden.\nThe GWU has been campaigning for mandatory trade union membership. It formally called on social partners to kickstart a discussion on its proposal for all employees in Malta to be obliged to join a trade union of their choice.\nIn a letter to the Malta Council for Economic and Social Development (MCESD), union secretary-general Josef Bugeja said it had received positive feedback from Prime Minister Joseph Muscat and Opposition leader Adrian Delia when first announced in October.\nRead: GWU wants discussion on compulsory union membership\nPresident Coleiro Preca said: “Workers must always be organised into a trade union, not only when things are not going well, but also when they are, as this is the way to ensure their welfare.”\nIn 2014, President Coleiro Preca had launched the National Forum of Trade Unions. ", "comment_count": 13, "id": 23}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man raped the mother of his 15-year-old girlfriend by saying that she had brought the devil into the house, according to testimony that has left defence lawyers shaking their heads.\n“Neither I, nor my colleagues, have ever met such a case in over 22 years,” lawyer Jason Azzopardi said, telling about an exorcism which he said had resulted in objects flying around the house.\nThe 18-year old unemployed Cospicua resident, whose name publication was banned under court order, was remanded in custody after pleading not guilty to rape and other charges of a sexual nature mingled with alleged occult phenomena.\nHe was also charged with the rape of his mother’s girlfriend, besides holding her and her daughter against their will, forcing both women to perform indecent acts, slightly injuring them and causing them to fear violence.He would order the girl to have sex with her mother\nHe was further charged with having engaged in sexual acts with his 15-year old girlfriend, with whom he had been living at her mother’s home. \nProsecuting inspector Eman Hayman explained how the police had been contacted by the 15-year-old, who complained of the young man’s violent treatment and controlling behaviour.\n“The mother practised the occult. The accused would play on the girl’s superstitions by saying that she had opened the door to the devil. He took advantage of her. He would use a particular voice. This was all done to satisfy the man’s sexual fantasies. He would manipulate the woman, giving her all types of commands, ranging from the simple to the sexual,” the inspector explained.\n“He would order the girl to have sex with her mother,” the inspector went on, delving into further gruesome details of the way the accused controlled his victims.\n“We believe it is vital to establish the true chronology and nature of the facts. One woman was in Mount Carmel Hospital several times,” Dr Azzopardi intervened, requesting the court to appoint a psychiatric expert to examine the victims before these were summoned to testify.\nThe other defence lawyer, Kris Busietta, explained further that they had been informed that the mother had “been admitted to Mount Carmel Hospital around 20-25 times, but we don’t know why.\"\n\"They are the primary witnesses in this case: in order to be able to question the witnesses we need to know the condition of the witness,” he argued.\nThe prosecution objected, however, stating that the lawyers were attempting to intimidate the witnesses and question their credibility, adding that the court could appoint an expert if it ever perceived the need for this.\nAfter hearing submissions on this request, the court, presided over by magistrate Rachel Montebello turned down the request, pointing out that the court could appoint an expert if it felt this was necessary, to assist the alleged victims when testifying.\nA request by the prosecution for a technological expert to preserve video graphic evidence brought about further contestations. Inspector Hayman explained that the victim had claimed that some of the activity had been filmed, on the instructions of the accused.\nThe request was not objected to by the defence who stated that they did not fear the truth being revealed.Objects flew, voices in strange languages were heard. This is why there are certain injuries\n“It requires particular attention because the occult is involved. This was not a mere hobby: an exorcist had been summoned and had to celebrate Mass in the property. Objects flew, voices in strange languages were heard. This is why there are certain injuries,” Dr Azzopardi said.\n“The accused has been on police bail since last month; had he wanted to speak to one of the witnesses, he had ample time to do that, even though he does not need to.”\nThe accused was still presumed innocent, Dr Azzopardi went on, explaining that the charges were not to be taken at face value, further pointing out that no magisterial inquiry had been requested by the police, although this case carried a possible jail term of 11 years.\nHowever, the request for bail was denied by the court in view of a real risk of tampering with evidence, the fact that no evidence appeared to have been preserved as well as in view of the vulnerability of the alleged victims in whose favour the court also issued a Protection Order.\nInspectors Eman Hayman and Oriana Spiteri prosecuted. Lawyers Jason Azzopardi, Kris Busietta and Julian Farrugia were defence counsel.", "comment_count": 0, "id": 24}, {"keywords": "", "author": "Ivan Martin", "article_body": "The war on single-use plastic needed drastic action, MEP Roberta Metsola said on Friday, as she detailed why she pushed for an outright ban by 2021.\n“This is a close deadline, but we cannot afford to waste any more time. Too much time has already been lost,” she said.\nDr Metsola was speaking at a public dialogue meeting organised by the European Parliament Office in Valletta.\nRead: Join our war on single-use plastic.\nSingle-use plastic items such as plates, cutlery, straws, balloon sticks or cotton buds, will be banned in the EU under plans adopted last year.\nThese products, which make up over 70 per cent of marine litter, will be banned from the EU market in the next two years.\nDuring this morning’s meeting, Dr Metsola called on the public to do their bit and “join the war on plastic”.\n“Single-use plastics are clogging our seas, killing our marine life and causing irreparable damage to Malta and Gozo’s natural environment,” MEP Metsola said.\nShe hailed the EU wide-ban on single-use plastic products like non-biodegradable straws & polystyrene cups that will finally come into force by 2021, saying Malta and Gozo were being negatively impacted by plastic marine pollution.\nMost of this, she said, was single-use, un-biodegradable, plastic that remained in the eco-systems for centuries, “harming public health, choking fish and throttling our turtles”.\n\n“It simply cannot continue at the current rate. It is time for change – and it’s not only plastics, it’s our entire waste management system that needs updating and enforcing,” she said.\nAside from single-use plastics, MEPs have also moved to ban a number of other products from the EU market by 2021.\nProducts made of oxo-degradable plastics, such as bags or packaging and fast-food containers made of expanded polystyrene, are among those that will be phased out.\nThe consumption of several other items, for which no alternative exists, will have to be reduced by member states by least 25 per cent by 2025. This includes single-use burger boxes, sandwich boxes or food containers for fruits, vegetables, desserts or ice creams.\nIn order to comply with these new requirements Malta will have to draft national plans to encourage the use of products suitable for multiple use, as well as re-using and recycling.\nOther plastics, such as beverage bottles, will have to be collected separately and recycled at a rate of 90 per cent by 2025.\n“Imagine if instead of the usual plastic bags we still see everywhere, we use boxes or cloth; or if we stopped purchasing products covered in excessive, unnecessary, plastic packaging; or if instead of throwing away a coffee cup every time we have a hot drink we use re-usable asks; if instead of the usual plastic straws we give our children paper straws or ones made out of bamboo; if instead of plastic confetti during our festi we go back to using paper.”\n“My point is that miniscule – almost unnoticeable - differences in our lifestyles could make a massive difference,” she said.", "comment_count": 6, "id": 25}, {"keywords": "", "author": "", "article_body": "Malta’s heritage, including Valletta’s landscape, was being destroyed for “cursed money”, Archbishop Charles Scicluna has said.\nSpeaking during the launch of a book on a collection of 18th century statues adorning the Mdina Metropolitan Cathedral museum, Mgr Scicluna denounced those who were destroying the country’s heritage for a few euros.\n“If there’s anyone who is hearing me and has a part in this destruction of our heritage to make money, I implore him to think twice and say no, at least for the benefit of our landscapes. We are going to architecturally destroy Valletta for a few euros. And once we’re destroying, the money is cursed,” the Archbishop said.\n“I beg all Maltese, especially the younger generations, to remain attached to our rich cultural heritage,” he added.\nI beg all Maltese to remain attached to our rich cultural heritage\nThe collection of 15 silver statues featured in the new publication date back to between 1741 and 1743. They were made by Roman silversmith Antonio Arrighi and can be found in the first hall of the Mdina museum, known also as the ‘apostolato’.\nThe statues, portraying the Apostles, John the Baptist, St Paul and Our Lady, had been commissioned by the Order of St John to embellish the main altar of St John’s conventual church in Valletta during the titular feast. Their design is based on the marble statues found at San Giovanni Laterano in Rome.\nRead: ‘Do not neglect cultural and historical heritage’\nDuring their brief stay on the island between 1798 and 1800, the French cleared several churches of their silverware to mint coins to pay salaries to their troops. In 1798, when the statues were still at St John’s, Canon Salvatore Susano informed the Cathedral Chapter about them and said it would be a great loss if they were to be melted with the rest of the silver confiscated from that church by the French. He proposed that, in exchange, the Mdina Cathedral would give the French silver and gold articles belonging to the cathedral equivalent in value to the statues.\nAn agreement was reached on June 22, 1798 and two government officials accompanied an armed guard to the cathedral to take to Valletta six sealed chests containing gold and silver objects in lieu of the statues.\nThe statues, however, had to be redeemed a second time after they were taken again by the French when they were exhibited in August 1799, when 449 pounds worth of silver articles, valued at 11,563 scudi, about €260,000 in today’s money, were handed over to the French instead of the statues.\nThroughout the year, the statues are exhibited in the museum but are displayed on the main altar of the Mdina cathedral on three occasions: Christmas, the Conversion of St Paul and L-Mnarja, the feast of St Peter and St Paul.\nMgr Scicluna drew a parallel on the way heritage had been exchanged for cash in the 18th century and how this also applied to the present day, when, in his view, the same thing was happening.", "comment_count": 45, "id": 26}, {"keywords": "", "author": "Denise Grech ", "article_body": "Homelessness is the country’s \"best-kept secret\" and is on the rise, psychologist Paulann Grech told experts on Friday.\nDuring a conference in memory of activist Charles Miceli, Dr Grech said that homelessness often led to mental health concerns, shame and anger.\nSociologist Ann Marie Cutajar noted there was no clear definition for homeless people in Malta. The data available looked at those who were found sleeping rough, but did not present an accurate picture, she added.\nRead: Number of officially homeless in Malta is 'not a reality’\nData presented in Parliament showed that 27 people were reportedly found sleeping rough over the past five years. However, leading charities who worked with the homeless said this was a far cry from reality.\n\"What about the person who is informally staying with friends and family but who cannot afford a place of their own? What about those who are living in ‘overshared’ apartments?\" Ms Cutajar asked.\nHousing rights were also a vague issue under Maltese legislation, leading many to resort to inadequate or insecure housing, Ms Cutajar said.\nRead: Don't blame the housing market for homelessness - Housing Authority boss\nYMCA CEO Anthony Camilleri warned the country was not giving homelessness the value it deserved.\nHe also warned of the emergence of the “working homeless”- people who had a job but who could not afford a roof over their heads.\n\"We receive five referrals a day and we have to turn them down because we are full,\" he said. \"Where are these people going,\" he asked.", "comment_count": 29, "id": 27}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Direct orders and payments amounting to about €5 million were issued by Transport Malta during the second semester last year, Times of Malta is informed.\nAccording to the Finance Ministry, direct orders should be limited and only used for emergency matters, however, the transport regulator made hundreds of payments for the procurement of supplies and services, which, industry sources remarked, could have easily been obtained through a public contract.\nMany of the services/supplies were procured through companies or figures connected to the Labour administration, it was noted.\nRead: Despite warning, ministry gave €4.5m direct orders in six months\nA notice published in The Malta Government Gazette shows that Transport Malta paid lawyer Aron Mifsud Bonnici about €50,000 in legal fees between June and December.\nDr Mifsud Bonnici, who regularly handles legal issues on behalf of the General Workers’ Union and is Tourism Minister Konrad Mizzi’s personal lawyer, is receiving tens of thousands of euros in fees and remuneration for serving rendered to various boards of government entities, mostly falling under Dr Mizzi’s political remit.\nGWU-owned Paola Estates Ltd, which gets €500,000 a year for leasing premises in Paola to Transport Malta, last year was also paid over €26,000 for work related to the lease of part of the A3 towers, situated opposite the Addolorata Cemetery. The transport watchdog paid the GWU for extra mechanical and engineering works at the premises.\nRead: €600,000 in six months: direct orders to ‘friends’\nTransport Malta pays over €10,000 a year to Magro Brothers, owners of the Tiġrija Palazz  shopping complex in Victoria for the use of an office.\nLabour’s organisational secretary, William Lewis, and his wife, Odette, both former employees of Transport Malta, were given a €38,000 assignment to produce a cost-benefit analysis on the Marsa junction project.\nThe two architects are often on Transport Malta’s direct orders list, the latest being work related to the Central Link project, in Attard.\nFormer Nationalist Party journalist Karl Stagno Navarra, now a part-time employee at Labour’s One TV, was paid €21,000 as a media adviser by Transport Malta.\nFollowing Labour’s return to power in 2013, Mr Stagno Navarra had also been employed at Malta Enterprise’s PR office.\nNo call inviting applications for the post had been made. Festivals Malta, a commercial entity embracing a number of companies that provide services for Labour Party mass activities, received €35,000 from Transport Malta as sponsorship for a “Tomorrowland event”.\nThe list of direct orders and payments included road contractors, architects, the operator of Malta’s public transport system, PBS, Virtu Ferries and security companies.\nSome of TM’s direct order payments\n\n\n\nDirect Order\nTask\nValue\n\n\nBonnici Brothers\nRoad works, Mellieħa\n€384,560\n\n\nWilliam and Odette Lewis\nCost benefit analyses for Marsa project\n€38,000\n\n\n356 Entertainment Group\nPublic awareness campaign\n€35,400\n\n\nAron Mifsud Bonnici\nLegal fees\n€50,000\n\n\nBurmarrad Commercials\nCar leases \n€19,000\n\n\nClaude Mallia\nConsultancy – Monaco stand\n€8,260\n\n\nFestivals Malta Ltd\nTomorrowland Event 2018\n€35,400\n\n\nFrank Muscat\nArchitect services\n€11,564\n\n\nHalo Pictures\nVideo clips\n€5,605\n\n\nKarl Stagno-Navarra\nMedia consultancy\n€21,200\n\n\nMalta Community Chest Fund\nDonation\n€15,000\n\n\nOne TV\nAds on One Radio\n€6,136\n\n\nGWU (Paola Estates)\nWorks at A3 towers\n€26,354\n\n\nSandro Kitcher (One TV)\nTV adverts\n€5,000\n\n\nTiġrija Developments Ltd\nRent of Gozo office\n€10,552\n\n\n\nivan.camilleri@timesofmalta.com", "comment_count": 48, "id": 28}, {"keywords": "", "author": "Claire Caruana", "article_body": "Educators in schools where violent incidents occurred were feeling a “certain amount of apprehension”, teachers’ union president Marco Bonnici told Times of Malta.\nHe spoke to the newspaper after it emerged that, apart from the two incidents that made the headlines involving students, parents and school officials earlier this week, there were also at least two other similar cases that have since been reported to the authorities.\nThough Mr Bonnici would not give details on the latest incidents, saying those involved did not consent to information being disseminated, he pointed out that the authorities were “aware of everything”.\nThe Malta Union of Teachers, he continued, was defending the rights of its members and representing them accordingly. In many cases, he added, “personal specific directives” had also been issued.\nTeachers have complained that such incidents had gone from being a rare occurrence to becoming quite common occurrence and that, as result, they were dreading going to work.\nMr Bonnici noted that being apprehensive was only natural, especially in the schools where incidents occurred. However, the union had not yet received any specific reports of educators actually fearing going to school, he pointed out.\nPriority should be ensuring security and safety\nSince the two incidents reported by the press earlier this week, several teachers vented their frustration on social media, complaining about aggression in schools.\nSome argued that instead of going to work and focusing on the education of their students they were often more preoccupied with ensuring such incidents are avoided.\nTeachers have also warned in recent days that understaffing and trickle-down of institutional frustration was leading to growing tension between students.\nEducation Ministry sources expressed concern at the increase in the number of violent incidents occurring at schools, saying more teachers were reporting instances of aggression.\nTwo men were arraigned on Wednesday in connection with an incident at the Pembroke secondary school on Monday that allegedly occurred after a 15-year-old boy had to be hospitalised following an assault by another student. A student and a school official were involved in a fight at St Ignatius College secondary school, in Qormi, the day after.\nTeachers’ union officials met with Education Minister Evarist Bartolo and made a series of proposals. These included stepping up security at schools, reviewing physical access and ensuring concrete intervention in situations caused by mental health issues and substance abuse, among other things.\nThe government has said it would be fast-tracking the introduction of harsher penalties for violence in schools. Fines could be as high as €5,000.\nAsked whether the union was considering requesting “danger money”, additional pay for those working in dangerous situations, Mr Bonnici said priority should be on ensuring security and safety of schools that would benefit both educators and students and prevent cases and situations “which no amount of money can justify”.\n ", "comment_count": 57, "id": 29}, {"keywords": "", "author": "", "article_body": "A historic baroque villa in Pieta’ will be operated and maintained by an NGO, Heritage Malta announced on Friday. The partnership agreement – the first of its kind – will see Villa Frère promoted, maintained, opened to the public and run by the NGO Friends of Villa Frère.In a statement, Heritage Malta said it had plans for other such agreements in the future. \nThe villa has been in the news recently as it is threatened by an application to build a 10-storey retirement home at Giardino Zamitello, which is adjacent to the villa's gardens.\nVilla Frère has been in the news recently as it is threatened by an application to build a 10-storey retirement home at Giardino Zamitello, which is adjacent to the villa's gardens.\nIt also risks being compromised by a six-storey touristic development replacing a two-storey house in a stepped alleyway off the Pietà marina, close to the villa.\nFriends of Villa Frère was set up in 2013 by heritage architect Edward Said, who specialises in building conservation.\nHe was introduced to the historical villa’s upper gardens during his architectural studies, when the site was in a state of complete abandonment.\nDeeply captivated by the beauty of the place and intrigued by its history, he felt compelled to act and to increase awareness, saving it from utter destruction.\nRead: Beyond the walls of Villa Frère\nThe history of the villa\nThe 12-acre estate was created by British diplomat, poet, scholar and philanthropist John Hookham Frère, who dedicated much of his energy to create its garden following his wife's death in 1831. \nIts vantage point offered views spanning from Mdina right across to Valletta, as well as the Msida Bastion Cemetery, where his wife was buried.\nVilla Frère became a sanctuary for numerous academics, poets and authors. Mikiel Anton Vassalli reportedly spent ample time there discussing the Maltese language and how to establish it as a written and taught language with Hookham Frère.\nHookham Frère died in 1846, and the site fell into neglect until forty years later, when it became the residence of Captain Edward Price.\nA notable garden enthusiast, he gave life back to the property, introducing a selection of exotic plants from around the world and creating different planting sections. Earning it the title of a botanic garden, the place became a prominent attraction, both to locals and foreigners.\nRenowned artists, painters, scholars and even three monarchs have walked inside these lush grounds. In 1930, the gardens were featured in Country Life magazine, a world-leading landscaping periodical, and attained international fame.\nVilla Frère sustained only minor bomb damage during the Second World War.\nHowever, in subsequent years a primary school, nursing school, a helipad for St Luke’s hospital and a parking area all ate away at its once-sprawling grounds.\nToday, just over a third of the original area survives (including the house), yet their mystique is still there.\nMr Said is dedicating himself to the restoration of the structures in the gardens while his colleague Fernando Mifsud, a landscaper and garden designer, is focusing on the regeneration of the gardens. They are helped by volunteers and sponsors.\nThe gardens of the villa are open to the public every first Saturday of the month.", "comment_count": 10, "id": 30}, {"keywords": "", "author": "", "article_body": "Updated at 2.10pm \nA draft deal to hand over hundreds of thousands of square metres of land to the Corinthia Group to develop into a six-star hotel, apartments and retail space in St Julian’s has been sent back to the drawing board.\nTourism Minister Konrad Mizzi was forced to withdraw the plans, which were only presented to parliament last December, following vociferous opposition from the Opposition, business leaders and environmental activists.\nIn a letter sent to deputy prime minister Chris Fearne, who also chairs parliament’s National Audit Office accounts committee, Dr Mizzi said he was withdrawing those plans and would be presenting fresh ones “in the coming days”.\nRead: Corinthia to pay just €17m for peninsula\nThe original plans would have seen Corinthia Group receive the huge tract of prime real estate on a 99-year lease for just €17 million, and allowed the group to develop parts of it for speculation purposes.\nJust two weeks ago, Prime Minister Joseph Muscat told Labour supporters that the proposal would be part of a “giant leap ” for Malta and its tourism offering.\nVociferous critics\nBut the plans were received far less enthusiastically by other sectors of society.\nNationalist Party leader Adrian Delia said the land was being given away for a pittance, and called for the deal to be renegotiated.In a statement issued on Friday afternoon, the PN said its pressure had paid off. \n\"We won't let thee government rob the people and give this land away for nothing. This is money which could be used for social housing, pensions or transport infrastructure,\" the party said. \nThe Labour Party reacted by saying that the government had listened to critics and would be \"improving its proposal\", while Opposition leader Adrian Delia was just not credible. \n\"He criticises the government if it moves forward, and criticises if it consults,\" the PL said. \nEnvironmental groups vocally opposed the project, and the Church’s environment commission issued a statement warning against “vain promises” of progress made by developers – a pointed reference to Corinthia Group chairman Alfred Pisani, who had defended the plans on state TV.\nAn anonymous group of entrepreneurs wrote to all MPs to argue that the deal would confer an unfair advantage on the Corinthia Group’s parent company and violate EU state aid rules.\nMinister Mizzi presented an overview of the government’s plans during a meeting of parliament’s environment committee last week, revealing that land reclamation rights – which The Sunday Times of Malta had revealed were part of the draft deal – were no longer being considered.\nThe government has so far resisted calls to publish a Memorandum of Understanding it signed with the Corinthia Group for the project back in 2015.\nMoviment Graffiti hails partial success\nIn a statement, activist group Moviment Graffiti - which is among the groups leading the charge against the proposed project - celebrated the news. \n“We are fully aware this is not a final decision, but this remains an important milestone”. “We will fight on against the theft of public land by the private sector that will endanger not only the environment, but also the Maltese people’s quality of life,” the group added. Moviment Graffiti struck an optimistic note. “Today’s events have yet again proven that a movement of people united together, beyond partisan divisions, can be an important force in the fight against those who want to turn Malta into their private fiefdom,” it said.", "comment_count": 60, "id": 31}, {"keywords": "", "author": "Keith Micallef", "article_body": "Aggrieved that the government’s decision to pay €15,000 for a painting of his was questioned in Parliament, artist Patrick Dalli contacted the MP who raised the matter to tell her nobody “had the right” to value his works.\nMr Dalli, the husband of Equality Minister Helena Dalli, made this controversial assertion in a text message sent to Nationalist MP Therese Comodini Cachia soon after her intervention in Parliament on Monday.\n\nSpeaking during the debate on the Culture Ministry’s financial estimates, she referred to the controversial acquisition of an oil on canvas painting by Mr Dalli in 2017.\nRead: €15,000 painting treated like a State secret\nEndorsed by State agency Heritage Malta, the purchase was made by the Office of the Prime Minister and the painting was hung at the Girgenti summer residence in Siġġiewi. The painting was bought through a fund intended for the acquisition of contemporary Maltese works of art. A photograph of the painting and its location were only revealed after this newspaper made a request under the Freedom of Information Act.\nApart from the €15,000 price tag, which was deemed excessive by some art critics, eyebrows were also raised because the Office of the Prime Minister bought the painting directly from Mr Dalli.\nIn her address, Dr Comodini Cachia noted that the money in the special fund used to purchase the painting amounted to just €60,000 and had not been increased for the past three years.\nDeclaring she would not enter into the artistic merits of the painting, she insisted it was her duty to raise certain issues. “Who did the valuation? Can the minister table in Parliament the criteria [used to value this painting]? For many families, €15,000 exceeds a year’s salary,” she commented.\n“I expect an explanation from the minister on why choose this painting and not one by other artists and also how the price was established,” Dr Comodini Cachia added.\nShe called for more transparency and better governance of the fund.\nEvidently aggrieved by what she said, Mr Dalli sent an SMS to Dr Comodini Cachia and did not mince words to make his point. The issue went public after the MP published the text on her Facebook wall yesterday.\nBranding her questions “partisan” in nature, Mr Dalli insisted he was the only one who set the prices for his own paintings. “Nobody has the right to estimate the value of my works,” he declared.\nThe artist also invited the MP to contact the “international art galleries”, which, he said, had asked him to exhibit his works.\nDr Comodini Cachia interpreted the outburst as an endorsement of the status quo, saying Mr Dalli wanted to decide for himself how much taxpayers’ money the government should spend on his painting.", "comment_count": 84, "id": 32}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The only surviving Roman catacombs in Gozo, which had recently been threatened by new development, will be rehabilitated and opened to the public.\nHowever, NGO Wirt Għawdex is concerned that the area in front of the paleochristian hypogea, known as Għar Gerduf, will remain in private hands and, therefore, development attempts could be made there in the future.\nPart of the area around and above the catacombs is being expropriated, something that Wirt Għawdex had called for in the past.\nIts efforts were boosted in June 2017, after excavation work started on foundation trenches for a two-storey house planned to be built in front of the catacombs. The area around the catacombs was spared development after the Planning Authority revoked the planning permission that same month.\nWirt Għawdex was concerned that if the land was not expropriated, there would be a repeat of the development threat in the future, executive secretary Giovanni Zammit told Times of Malta.\nThe paleochristian hypogea, known as Għar Gerduf.\nAs announced in Parliament and also reiterated during meetings between the Gozo Ministry and the NGO, the plan was to build a visitors’ centre and open the catacombs to the public, he noted. However, Wirt Għawdex has not yet been informed of any finalised plans and it was worried there was not enough expropriated land to build the visitors’ centre.\nThe conservation of the catacombs was specifically mentioned in the Labour Party’s manifesto and 766 square metres is being expropriated at a cost of more than €400,000, according to a notice in The Malta Government Gazette.\nWirt Għawdex is calling for the catacombs to be protected until the restoration on the site started.\nRead: 'Unrecorded historical remains in Gozo is worrying'\nIn a letter to Times of Malta in 2017, Mario Buhagiar, from the University’s Department of History of Art, noted that the site was a vitally important archaeological zone and any disturbance, unless for research purposes, would be “an unpardonable crime against Malta’s much-vaunted cultural heritage”.\nThe catacombs, which featured in several of his publications, were of crucial importance to Malta’s late Roman and early Christian history, despite the “mutilations” they were subjected to at several stages of their long history, he had noted.\nIn another letter, heritage architect Edward Said echoed Prof. Buhagiar’s pleas. He had noted that the late historian, Mgr Anton Gauci, had, in 1966, mentioned the possibility of underground spaces beneath the present floor of the site as well as the presence of Roman baths and an ancient church in the vicinity.", "comment_count": 1, "id": 33}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 4.19pm with Curia statement\nThe Church will be looking at introducing a pastoral plan that includes more assistance to the most vulnerable in society in an attempt to address Mass attendance problems, Times of Malta has learnt.\nThe Sunday Times of Malta reported last month that Sunday Mass attendance was projected to decline further over the coming years until it hits just 10% of Malta’s Catholic population by 2040.\nThe data emerged from a census taken in 2017 and which showed that a mere 37% of the population attends Mass on Sunday.\nIn comments to Times of Malta following the publication of the census results, a Church spokesman said the research was one of the main topics discussed during a recent priests’ live-in.\n“Together with the members of the parish pastoral councils, parish priests will now analyse the situation in their parish, based on the results of the census as well the survey which also reached out to those who do not attend Mass,” the spokesman said.\nOpinion: Mass attendance figures are a reality check - Auxiliary Bishop \n\n \nChurch pastorally effective collectively\n“Factors to be considered include whether the celebration of Mass and other sacraments are held at the most convenient times for families and individuals in their communities.”\nAnother step to ensure that the Church was “pastorally effective collectively” in light of the findings would be to include a pastoral plan that called for new ways to bring its message across to people and which was supported by works of charity.\nOpinion: That shocking Mass statistic - Fr Joe Borg\n“These include several Church initiatives that assist the poor, the sick and the most vulnerable in society,” the spokesman said, adding that the focus on the younger generations would also be stepped up.\nAccording to the census, more than half of the attendees were over 50 years old, confirming the perception that those who adhere to the Sunday Mass obligation are an aging population. The number of Catholic youngsters up to 14 years who go to Sunday Mass has halved from 42% in 2005 to a mere 22% in 2017.\nThe figure is even worse for those in the slightly older age group where a drop from 40% to 19% among those aged 15 to 24 was noticed.\n'We are not targeting the poor' - Curia\nIn a statement, the Curia said that its reply had been misinterpreted. \n\"The Church will not be targeting the poor,\" a Curia spokesperson said. \n\"One of the steps to reach out to people will be a pastoral plan focusing on a new evangelisation which is supported by works of charity. These works include several church initiatives which assist the poor, the sick and the most vulnerable in society. The Church will continue to assist the poor irrespective of whether they attend Mass or not, as it has been doing over the centuries.\"\nThe spokesman said that the Church's main focus would be younger generations, \"as witnessed during the last Synod of Bishops dedicated entirely to young people and faith, as well as the recent World Youth Day celebrations in Panama led by Pope Francis.\" ", "comment_count": 86, "id": 34}, {"keywords": "", "author": "", "article_body": "These are the main stories in Friday’s newspapers.\nTimes of Malta says that according to the Malta Union of Teachers, educators in schools where violent incidents occurred were feeling a “certain amount of apprehension”. In another story, the newspaper says Opposition leader Adrian Delia has proposed three Nationalist ‘stalwarts’ for the post of President.\nThe Malta Independent quotes Tourism Minister Konrad Mizzi saying that the land Corinthia wants to develop is big enough for the development not to affect residents.\nIn-Nazzjon quotes the Labour mayor of Rabat saying that if one is a good person and acts in a correct manner, his place is not in the Labour Party.\nL-Orizzont says Malta tops EU countries in economic expansion.", "comment_count": 0, "id": 35}, {"keywords": "", "author": "", "article_body": "Padlocks attached to the fence surrounding Daphne’s memorial at the Great Siege Monument in Valletta have been defaced.\nThe padlocks started being left by activists as candles, plants and photos left at the site are cleared away almost immediately.\n\nActivists then started leaving their messages on padlocks attached to the fencing around the monument.\nThe clearing of the memorial has even ended up in court, and has generated a number of aggressive outbursts.\nRead: Daphne portrait returned to Great Siege Monument, hours after official ceremony\nRead: Another layer of defence added to Great Siege Monument", "comment_count": 170, "id": 36}, {"keywords": "", "author": "", "article_body": "Opposition leader Adrian Delia has proposed three Nationalist ‘stalwarts’ for the post of President, Times of Malta has learnt.\nThough neither the government nor the Nationalist Party would comment on the matter, bar that Prime Minister Joseph Muscat and Dr Delia met a few days ago, it is believed Lawrence Gonzi, Tonio Borg and Louis Galea were the names proposed.\nA spokesman for the Office of the Prime Minister said that, in line with the Constitution, Dr Muscat had embarked on consultations with the Opposition leader in connection with the appointment of a new President.\nLikewise, a spokesman for Dr Delia would only say that the two had met to discuss the appointment of the next President.\nAccording to the Constitution, the President is appointed by resolution of the House of Representatives for a period of five years. President Marie-Louise Coleiro Preca’s term of office ends in April.\nVarious names have been mentioned over the past weeks and months as speculation increased on who could succeed Dr Coleiro Preca. Recent press reports have consistently indicated that the most likely candidate is former Labour deputy prime minister George Vella.\nHowever, sources close to Castille said the Prime Minister had still to officially communicate his choice to the Labour parliamentary group, which was expected to meet “soon”.\nThe Prime Minister had still to officially communicate his choice\nPolitical observers from both sides of the political divide deem it highly unlikely that Dr Muscat would ultimately go for any of the three names suggested by Dr Delia, even though such a move would not be unprecedented.\nIn fact, when he was prime minister, Dr Gonzi had successfully moved the appointment of former Labour deputy leader George Abela for the Presidency.\nIt was also pointed out that, to his credit, Dr Muscat had managed to convince his MPs when Dr Delia nominated George Hyzler, a former Nationalist parliamentary secretary, for the post of Commissioner for Standards in Public Life.\nSome observers argued that doing the same in the case of the new President could earn the Prime Minister brownie points among traditional PN voters at a time when the party was rife with internal dissent.\nRead: President starts her goodbyes in final Republic Day address\nOn the other hand, it was also pointed out that Dr Muscat was also facing some internal criticism, especially among Labour diehards who were complaining that loyal party supporters were being given second preference vis-a-vis switchers who joined Labour when it was returned to power in 2013.\nA move towards appointing a President from the PN camp could create more problems for Dr Muscat, even risking negatively affecting the very strong electoral majority Labour enjoyed, just four months from the local and European elections, the observers noted.\n“Choosing a President nominated by Adrian Delia and discarding George Vella may be too big a blow for Joseph Muscat notwithstanding his record trust rate among cross-party voters,” a veteran political pundit remarked.", "comment_count": 187, "id": 37}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta’s freedom ranking has again been downgraded by a Washington-based democracy monitor, with researchers blaming the “inefficacy of the country’s anti-corruption institutions”.\nAccording to Freedom House’s latest report, released this week, although still regarded as free, Malta’s score dropped one point to 91 out of 100. The country’s score has been on a downward trend for the past couple of years, dropping to 92 points in 2018 from 96 in the previous year.\nThere were 35 countries that obtained better scores than Malta and another five – Costa Rica, Lithuania, the Czech Republic, St Vincent and Grenadines and Bahamas – being awarded the same points.\nRead: Malta falls from 17th to 33rd in world freedom ranking\nWhile country-specific reports have yet to be published, a spokeswoman for the US organisation told Times of Malta Freedom House noted “a number of developments related to corruption in Malta”.\nDevelopments related to corruption\n“While Prime Minister Joseph Muscat was exonerated in an investigation related to his alleged ownership in an offshore company, we echoed the European Commission’s concerns over limitations in anti-corruption measures and rule of law,” she said.\n“Though there is generally a free and independent media, journalists still face safety concerns and other restrictions.\n“We also continue to watch the case against Daphne Caruana Galizia’s alleged killers,” she added.\nSweden, Norway and Finland again rank at the top of the list, scoring full marks.\nOn the other end of the scale, Syria scored no points and Tibet was given a single point. The two countries were also at the bottom of the list last year.\nAccording to the spokeswoman, the organisation decided to downgrade Malta’s score on corruption from three out of four to two out of four due to “the inefficacy of the country’s anti-corruption institutions”.\n“This stems from the fragmentation of different agencies, limited resources devoted to anti-corruption efforts and the lack of safeguards to ensure independence,” she pointed out.\nFirst published in 1973, the ranking, considered a world institution in the sector, provides a tracking of global freedom trends. Freedom House says its ranking is often cited by academics, journalists, activists and even policymakers.\n ", "comment_count": 31, "id": 38}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A public cleansing contractor accused of bribing a former Rabat mayor as well as underhandedly influencing the award of a tender issued by the San Ġwann council, has been cleared of all criminal liability.\nJohn Borg, 56, had been targeted by criminal prosecution for allegedly bribing former Labour mayor of Rabat Frank Fabri back in 2006 and trading in influence to secure, in favour of his colleague, the award of a public cleansing contract tendered by the San Ġwann council in September 2009.\nIt all began when confidential information reached the police regarding the son of a former Nationalist mayor of San Ġwann, who had allegedly been soliciting bribes from bidders, hoping to secure the award of the public cleansing contract.\nEarlier on, Mr Borg had been awarded a tender for manual sweeping at Rabat, being targeted by default notices a while later when his services were deemed not to have been up to scratch.\nIt was some three years later when Mr Borg’s colleague, Sammy Borg, was asked to fork out money in favour of Noel Agius, the son of the former San Ġwann mayor, by way of securing favourable treatment in a public cleansing tendering process at the locality, that the matter was brought to the notice of the police.\nIn a series of conversations, underhandedly recorded by John Borg, the latter was allegedly heard stating that, at the time when he was offering his services at Rabat, the then mayor Fabri had demanded a monthly payment of Lm150, later upped to some Lm250.\nCriminal proceedings kicked off against Mr Borg, with the case landing before the Court, presided by magistrate Donatella Frendo Dimech, in January 2017.\nWhen delivering judgment, the court observed that the former mayor of Rabat had chosen to not answer questions about this case, while no other witnesses were summoned to shed light upon the alleged bribery.\nMoreover, in line with current jurisprudence, the statement released by the accused, without the assistance of a lawyer, was to be discarded as evidence against him.\nThe audio recordings exhibited by the prosecution failed to prove that the accused was in fact the person who spoke of how he had allegedly bribed the Rabat mayor, leading to the conclusion that the bribery accusation had not been sufficiently proven.\nNor had the prosecution proven that the accused had been involved in influencing the award of the San Ġwann contract in favour of his partner, Sammy Borg, by handing money to the mayor’s son.\nIndeed, Noel Agius, the mayor’s son, had later declared under oath that Sammy Borg had won the tender “without any help since he obtained the majority of votes”.\nThe same witness had declared “I led them to believe that I would help them win the tender as my father was the mayor of San Ġwann during that period. My father had no clue that I was dealing with John Borg and Sammy Borg and I insist that my father had no involvement in anything related to these events”.\n“It was amply proved that Agius never intended to influence his father,” the Court observed.\nNor had John Borg’s involvement in the San Ġwann affair been proven, the court concluded after noting that all documents referred to “Sammy Borg Enterprises Ltd or Sammy Borg,” never mentioning the accused.\nWhat did emerge was that John Borg had only entered the scene after the agreement between Sammy Borg and Noel Agius had been sealed, the court said, adding that there was no proof that he had been present when the money was handed over.\nIn the light of all evidence, the accused could have been no more than an “accessory after the fact,” a concept yet totally alien under Maltese law, the court declared, pronouncing an acquittal.", "comment_count": 0, "id": 39}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "When Environment Minister José Herrera unveiled new recycling laws late last year, he boasted that they were the “best ever” in Malta’s history.\nStatistics released on Wednesday are further evidence that is not exactly a high benchmark.\nMunicipal waste statistics gathered by the National Statistics Office reveal just how far Malta is from the “circular economy” model which the government has set the country as a target.\nAmong other things, the figures reveal that just a slither of Malta’s municipal waste was recycled until 2017, and that far from cutting down on waste volumes, the amount of rubbish generated by the average citizen actually shot up dramatically in 2017, after an encouraging dip the previous year.\nThe figures, which were provided to the NSO by WasteServ and the Environment and Resources Authority, shed light on the types – and amounts – of waste we throw away each year, as well as what we are recycling.\n\nThe lion’s share of municipal waste is mixed waste – black bag rubbish, in other words. Bulky waste’s very nature means that it is, unsurprisingly, second on the list when calculated by weight. Wood and mixed packaging vie for third place.\nThe share of mixed municipal waste will most likely dip significantly in the coming years, with the minute share of biodegradable waste growing, as the effects of the 2018 waste reform come into play.\nAmong other things, the reform introduced separate collections of organic waste, which will be churned into compost. It also sets fines for people caught not separating their waste, though questions about how such laws can be implemented remain. \n\nMore than 90% of our municipal waste was still going to landfill in 2017. Even more worrying, the percentage share of municipal waste being recycled was actually lower that year – 8.6% - than in 2013, when 9.8% was recycled.\n\nThe vast majority of our recycling is of paper and cardboard, which until 2017 made up more than the combined totals of all other recycling categories. In 2017, metal recycling picked up steam. Other categories also improved.\nThis breakdown will also likely change in the coming years, once a bottle and beverage can refund scheme comes into effect.\n\nThe total volume of municipal waste being generated is growing year-on-year, which is to be expected as Malta’s population continues to grow. What is likely to concern planners is that the amount of waste being generated per capita is also growing.\nTo put things in context, the average EU citizen generates 480kg of municipal waste every year. The lower end of the scale is dominated by eastern member states – Romania, Poland and Czech Republic generate the least municipal waste per capita – with only Danes generating more than the Maltese.\nSweden and Belgium would appear to be role models in this respect, marrying lower than average municipal waste generation rates with above-average GDP per capita.", "comment_count": 60, "id": 40}, {"keywords": "", "author": "", "article_body": "A 44-year-old Czech national was arrested by the police in Gozo under a European Arrest Warrant.\nThe police said he will be arraigned in the next 48 hours. \nInvestigations are continuing.", "comment_count": 0, "id": 41}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man was cleared of harassing and threatening his former partner after relations between the two turned sour with the court urging both parties to seek to resolve their pending civil issues, thereby ending this chapter in their life.\nSalvatore La Rocca, 42, was accused of harassing and threatening his ex, demanding money for jobs he had done at her salon, verbally insulting her in front of customers and hacking her email and Facebook accounts.\nVarious issues of a civil nature were left unsolved when the couple broke up and attempts to reach an amicable solution failed.\nFinally, the woman filed a harassment report, telling the police how her ex used to allegedly drive past her home and salon, revving his motorbike to signal his presence. He even allegedly sent her invoices for unsettled dues. All this had left her feeling intimidated and scared, the woman had told the police.\nHowever, when delivering judgment against the accused, the court, presided over by magistrate Joseph Mifsud, observed that the issues between the parties were civil rather than criminal ones, adding that this detracted from time better spent in resolving other matters which were “truly criminal and much more serious”.\nFaced with conflicting versions, the court observed that the evidence led to “serious doubts” as to the veracity of the allegations.\nThe woman had never seen the accused “face to face” when he allegedly revved his bike outside her salon, stating that she had only heard “the particular sound” of the engine.\nAfter this incident, the estranged couple had continued to exchange emails which seemed to contradict the woman’s claims of being stressed and alarmed by her ex’s behaviour.\nAt the time when attempts to settle the pending issues between them were still ongoing, the woman had never shown any reluctance to meet her alleged harasser, even publicly thanking him when he landed her with a magazine interview.\nAs for her claims that the accused had threatened to report her to the VAT authorities and Jobsplus, the court declared that no evidence of such reports had been produced.\nNor had the prosecution proved the source of the e-mails and text messages allegedly received by the woman, basing its charges on the sole declaration of the alleged victim. “Investigations should have been undertaken before charges were issued, rather than pending proceedings,” the court said.\nFollowing the couple’s split, the accused still had access to her online accounts, the court noted, adding that the least the woman could have done was change her passwords.\nIn light of all evidence put forward, the court concluded that the charges had not been proven, thereby acquitting the accused, while urging the former couple to iron out their differences with the help of their lawyers and bring this chapter of their lives to an end.", "comment_count": 0, "id": 42}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The body of Paul Anthony Formosa, the Maltese port manager murdered in Somalia, will be repatriated by his employer, P&O Ports.\nA Foreign Affairs Ministry spokeswoman said the Dubai government-owned company was making all arrangements and the ministry had offered its support.\nThe company could not be reached for comment.\nMr Formosa, 52, from Marsascala, was killed by two gunmen on Monday in the port of Bosaso in the semi-autonomous Puntland state.\nAccording to media reports, the gunmen, who had disguised themselves as fishermen, were armed with pistols and shot Mr Formosa several times in the head.\nOne of the assailants was shot dead by security forces on the spot and another was shot and captured but died later of his wounds. Three other port employees were injured in the attack and were receiving treatment, according to the Dubai government.\nDeal sparked violent protests\nTerrorist group Al Shabaab claimed responsibility for the attack and said it was “part of broader operations targeting the mercenary companies that loot the Somali resources”.\nP&O Ports, where Mr Formosa had worked as a construction project manager since August 2017, was granted a controversial concession in April 2017 to develop and operate the port.\nRead: Murdered Maltese port manager remembered\nThe deal, declared void by the central Somali government, sparked violent protests during which at least one person was killed.\nRegional experts told Times of Malta the Puntland region had largely been spared the chaos that engulfed the rest of Somalia and that the attack was intended as a message against Dubai’s economic interests in the region.\nMr Formosa had worked at the Malta Freeport between 1993 and 2011 before leaving to take up a post in Lattakia, Syria. His career also included stints in Saudi Arabia, India and Sudan.", "comment_count": 1, "id": 43}, {"keywords": "", "author": "", "article_body": "Two groups of immigrants who disembarked in Malta following their rescue by the Armed Forces in Malta at the end of December departed Malta for relocation in France and Luxembourg, respectively, early on Thursday.\nThe immigrants were assisted by local authorities, the International Organisation for Migration authorities, and officials from the Embassy of France and the Consulate of Luxembourg in Malta.\nThese relocation processes are the result of an ad hoc agreement struck between the European Commission, Malta and other EU states following the Sea Watch III and Albrecht Penck saga in early January of this year.", "comment_count": 0, "id": 44}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Manuel Delia’s juridical interest in the case he had personally instituted against the government over the persistent dismantling of the makeshift memorial to Daphne Caruana Galizia is being challenged.\nThis was the latest twist in the constitutional proceedings filed by the activist and blogger against Justice Minister Owen Bonnici, after flowers, candles and photos placed at Valletta’s Great Siege monument following the assassination of Ms Caruana Galizia were repeatedly cleared away.\nMr Delia claimed this amounted to a breach of his fundamental right to free expression, a right he sought to enforce by taking his constitutional grievance to court.\nYet, a number of sittings and several witnesses down the line, the applicant’s continued juridical interest in the case is being questioned.\nHours before proceedings were due to continue on Thursday afternoon, the applicant’s lawyers filed a note to declare they had no further witnesses to summon.\nHowever, as the sitting kicked off, the same lawyers had to change plans, seeking the court’s authorisation to withdraw their earlier note.\nWhat brought about that change of mind was a recent application filed by the respondents challenging Mr Delia’s juridical interest.\nIt was argued that it had clearly emerged throughout the proceedings so far, that third parties, rather than Mr Delia, had personally placed mementos at the Great Siege monument.\nReference was made to the testimony of Karol Aquilina, recalling how he had purchased candles to light at the memorial as a sign of protest. Another witness, Ann DeMarco had testified as to how she visited the site on a daily basis as one of a group of protesters who replenished items left there in protest.\nMr Delia did not form part of that group, the respondents observed.\nWatch: Authorities 'determined' to eradicate Daphne's memory - world-renowned author\nA party in a suit had to prove he had an ‘actual and personal’ interest that existed not only when proceedings were instituted but also subsisted throughout the hearing of the case, the respondents said, arguing that this appeared not to be the case with respect to Mr Delia.\nIn view of this fresh application filed on February 4, the First Hall, Civil Court, presided over by Mr Justice Joseph Zammit McKeon, adjourned the case to February 19 for a decree to resolve this matter.\nLawyers Paul Borg Olivier, Jason Azzopardi, Therese Comodini Cachia and Eve Borg Costanzi are assisting Mr Delia. Lawyers Victoria Buttigieg and Chris Cilia are assisting the respondents.", "comment_count": 0, "id": 45}, {"keywords": "", "author": "", "article_body": "Malta International Airport continued to register growth in January but at an expected slower pace, serving 366,015 passengers.\nIn a company announcement, the airport said that following several months of robust growth, January’s modest 4% increase in passenger numbers was observed alongside a 9.9% increase in aircraft movements and a rise of 7.9% in seat capacity. Seat load factor (SLF) for the month stood at 69%.\nWithin the top five markets, Spain registered an increase of 87.2% and France grew by a healthy 12%.\nThe performance of the Spanish and French markets indicated that the joint traffic diversification strategy of Malta International Airport, the Tourism Ministry for Tourism and the Malta Tourism Authority was bearing fruit, in that it stimulated newer markets to gain momentum just as legacy markets were reaching maturity.\nJanuary in numbers.\nThe Iberian Peninsula constituted one such new market and, in fact, the Seville, Malaga and Barcelona routes, which were introduced by two airlines in summer, were all being operated during the winter months.\nIn January, Malta International Airport’s traditional top driver of passenger traffic, the United Kingdom (-3.2%) was outperformed by the Italian market (-0.8%), by 604 passenger movements, and followed by the German market (-8.3%).\nOutside the top five markets, traffic from Hungary was up a noteworthy 42.4%. This surge could be attributed to the extension of the Budapest route from summer into winter. The encouraging results being registered by the Hungarian market were expected to be further reinforced through the introduction of a flight to Debrecen in summer.", "comment_count": 5, "id": 46}, {"keywords": "", "author": "Ivan Martin", "article_body": "Chronic understaffing and a “trickle-down” of institutional frustration was leading to growing tension between students across the public schooling system, teachers warned.\n“Do we need to have a full-blown school shooting or some other kind of major incident for people to realise we have a staffing problem in our schools today?” one frustrated teacher complained to Times of Malta.\n“Teachers are overworked and, as a result, students are not getting the attention they need. This is happening at a time when schools are being put under increased pressure, with many more students than in previous years.”\nEducators were contacted by Times of Malta in the aftermath of media reports of a violent schoolyard altercation that saw a 15-year-old boy hospitalised with head injuries. \nThe incident, at the Pembroke secondary school on Monday, started when two teen students – a third and a fifth former – got into a fight. Shortly afterwards, the younger student’s father arrived at the school, accompanied by two other men. Two staff members, understood to be an assistant head and a teacher, were hurt as they tried to break up the fight that involved the father, his friends and the two students.\nThe altercation involved a Maltese and Libyan student. \nA teacher who spoke on condition of anonymity blamed the incident on bubbling tensions between students from the two countries.\nTeachers on Tuesday said such incidents had gone from being a rarity to becoming increasingly common. \nAuthorities’ lack of foresight is making schools unsafe\n“It’s not just the Pembroke school, it happens in others as well. Multiculturalism is a complex issue to deal with in a classroom. Add to that teachers who are unmotivated and frustrated and the results are what we are seeing in our schools,” a teacher said.\nRead: Pembroke school incident - Pupil's father, uncle, remanded in custody after arraignment\nThe incident on Monday was, in fact, followed by another violent altercation between a student and a school official on Tuesday. \nThe police confirmed that a 15-year-old female student and a school official were involved in a fight at the St Ignatius College secondary school, in Qormi. \nNo one was injured or arrested but the police said they had questioned both the student and the official and investigations were ongoing.\nThe Malta Union of Teachers condemned Monday’s incident, saying it was having to say the “same things over and over” and was being proved right.\nIt reiterated its appeal “for the umpteenth time” for the government to equip schools with adequate security measures to ensure that similar incidents are avoided. The Union of Professional Educators pointed its fingers at the education authorities, saying their lack of foresight was making schools unsafe.\nThe Education Ministry said it would be fast-tracking the introduction of harsher penalties for violence in schools. Fines could be as high as €5,000.\nMeanwhile, teachers are calling for a safe work environment, deeming it “a given” for educators.\n“Security guards, proper CCTV systems and so on, these should be a given. We need more staff to be able to give students more attention and deal with the complexities of a changing classroom,” a teacher said.", "comment_count": 42, "id": 47}, {"keywords": "", "author": "Denise Grech ", "article_body": "Works on a €70 million project that will shift Enemed's fuel storage operations from the 31st March 1979 tanks in the heart of Birżebbuġa to Ħas Saptan are well underway, Energy Minister Joe Mizzi said.\nThe Birżebbuġa plant will be decommissioned by the end of this year due to its non-conformity with the EU standards. Enemed had filed a planning application for the project in 2015.\nThe project has been in the making since 2014. \nThe Ħas Saptan fuel storage complex, near Ħal-Għaxaq, was built in the 1950s for Nato use. In the 1980s parts of it were leased for use by civilian vessels of the Soviet Union. Since then some of the tanks have been leased to private operators and Enemed itself.\nThe complex consists of a number of tunnels dug at a depth of 45 meters at the head of the Has-Saptan valley. It is connected by tunnels and pipelines to Grand Harbour and Marsaxlokk.\nA modern tanker-truck loading facility is currently being built.\nEnemed officials said tankers will still discharge their cargo at Marsaxlokk but it will be pumped directly to Ħas Saptan instead of the Birzebbugia tanks.\nDuring a site visit to Ħas Saptan, Mr Mizzi said the project would help give Birzebbugia a fresh look. \nVarious environmental organisations had called for a thorough environmental impact assessment when the project was announced.\n\"The consequences for the natural environment, designated as an area of High Landscape Value, which is in regular use for recreation, should not be taken lightly,\" BirdLife Malta, Din l-Art Ħelwa and Nature Trust (Malta) had said.\nEnemed CEO Kevin Chircop sought to allay those fears, saying the project sought to minimise any negative environmental impact.\nThe NGOs had also stressed risks to people’s health had to be considered, especially since there could be hazardous waste and possible leakage from the fuel storage tanks.\nAsked about this, Enemed chief operations officer Philip Borg said the tanks were equipped with sensors that would notify workers of any problems. They would also go into emergency shut down should any problems persist, he said.\nIn case of a fire, areas of the facility were equipped with sensors that would be isolated and flooded, he added.", "comment_count": 6, "id": 48}, {"keywords": "", "author": "", "article_body": "Two men are behind bars after allegedly making thousands of euros by selling 'hand-made Persian carpets' which were actually machine-made.\nThe two Portuguese bothers, born in Brazil, pleaded not guilty when they were arraigned on Thursday morning.\nProsecuting inspectors Mario Xiberras and Shaun Friggieri told the court how a number of persons, some highly prominent, had been targeted by the suspect swindlers who posed as sellers of ‘hand-made Persian carpets of high quality,’ only for their unsuspecting customers to discover later that the goods were no more than machine-made goods.\nThe men allegedly raked in thousands through the scam over the past couple of months, as attested by the list of clients and the receipt books found in their possession.\nThe men also handed false product certificates to their victims, the court heard.\nThe brothers, aged 32 and 37, were accused of criminal conspiracy, using false means to defraud their victims, making use of false documents besides various breaches of fiscal regulations.\nOne of the men was separately charged with having driven without a valid insurance cover.\nIn view of the fact that investigations are still ongoing, with the possibility of further arraignments, Magistrate Francesco Depasquale, upheld a request by the prosecution for a ban on the publication of the names of the accused.\nNo request for bail was made at this stage, although defence lawyer Helen Caruana did point out that the arrest and arraignment were premature.\nThe men would now have to remain in jail until investigations continued, the lawyer observed, prompting the prosecution to rebut that the case had been well investigated before today’s arraignment.\nLawyers Shazoo Ghaznavi and Helen Caruana were defence counsel.", "comment_count": 0, "id": 49}, {"keywords": "", "author": "", "article_body": "Updated 1pm\nWater Services Corporation has managed to avert a crisis, finding an alternative distribution system to prevent widespread water cuts.\nConsumers were advised earlier on Thursday that they may experience no water or low water pressure for the next 24 hours after a private contractor damaged a major pipe at the area known as Tal-Balal.\nA spokesman for the corporation said it was investigating the damage and was not yet able to say which areas might be affected, or how long it would take to resolve. \n\"If things go as planned no interruptions will be necessary until repairs are fully completed,\" the spokesman added.\nIf you are experiencing problems write to us on mynews@timesofmalta.com or in the comments section below. ", "comment_count": 20, "id": 50}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man, facing criminal proceedings for having allegedly raped and harassed a work colleague, has been granted bail on his second attempt – the first having been turned down.\nMarcel Andreas Ekvall Parada, a 24-year old Swedish national, residing at Sliema, working in the local financial sector, had been remanded in custody after pleading not guilty upon his arraignment almost a month ago.\nThe man had been further charged with the unauthorised possession of cocaine.\nA first request for bail had been turned down by the court after strong objections by the prosecution on the grounds that the alleged victim was still to testify, besides the fact that the woman and her alleged aggressor shared the same workplace and common friends.\nAfter hearing the victim testify via video conference, the court, presided over by magistrate Marse-Ann Farrugia, appointed another sitting to hear the testimony of a housemate of the victim.\nA fresh request for bail was upheld against a deposit of €8,000 and a personal guarantee of €22,000.\nThe court also issued a protection order in favour of the alleged victim and her housemate, prohibiting the accused from approaching Swieqi and the alleged victim’s workplace.\nInspectors Paula Ciantar and Joseph Xerri prosecuted. Lawyers Alfred Abela, Arthur Azzopardi and Rene Darmanin were defence counsel.", "comment_count": 0, "id": 51}, {"keywords": "", "author": "", "article_body": "In spite of energy targets, the EU has seen demand for energy for energy rise for the third consecutive year, and the highest increase was seen in Malta.\nEurostat reported on Thursday that the total energy demand in Malta in 2017 went up by 12.9 per cent in Malta, followed by Romania (5.8%) and Spain (5.4%).\n\nDemand fell in eight member states, lead by Estonia (-4.2%), the United Kingdom (-1.6%), and Ireland (-1.4%).\nIn 2017, primary energy consumption in the EU was 5.3% above the efficiency target for 2020. Since 1990, the first year for which data are available, consumption has fallen by 0.4%.\nHowever, over the years, the primary energy consumption has fluctuated greatly. It peaked in 2006 (a 16.6% gap from the 2020 target), while a record low was reached in 2014 (a 1.9% gap from the 2020 target).\n\nThe EU has committed itself to reducing energy consumption by 20 per cent by 2020, representing a primary energy consumption of no more than 1.483 units. The revised Energy Efficiency Directive provides a new energy efficiency target for 2030: of no more than 1.273 Mtoe.", "comment_count": 13, "id": 52}, {"keywords": "", "author": "", "article_body": "Malta's economy is projected to grow the fastest in the European Union, according to the European Commission's Winter 2019 Economic Forecast.\nThe report says the European economy is expected to grow for the seventh year in a row in 2019 but forecasts have been slashed as an unexpected slowdown in Germany and protests in France weighed on the economy in Europe.\nBut there is wind in Malta's sails, with growth project at 5.2 per cent this year and 6.4 per cent next year, by far the best among EU member states. Next up is Ireland with a growth forecast of 4.1% this year and 3.7% next year. \nThe commission, the EU's executive arm, is now expecting growth of 1.3 percent in the eurozone this year, a significant cut from 1.9 percent predicted in November.\n\n\n\nStarting from the second quarter of 2018, domestic demand replaced net exports as the main driver of growth.\nPrivate consumption has been buoyant, reflecting strong employment growth, increasing disposable income and a large accumulation of savings in recent years. Investment remained subdued in the first three quarters of 2018,especially in non-residential construction and transport.\nExport growth slowed down from the high rates registered in recent years due to a weaker external environment and a drop in goods exports, while imports havestarted to recover, supported by strong domestic demand.\nGrowth is expected to continue over the forecast horizon, albeit at a slower pace.  \nInvestment growth is expected to pick up on the back of large-scale infrastructure projects in the health, tourism and real estate sectors. The current account surplus is projected to remain large, reflecting the significant tradesurplus of the internationally-oriented services sector.\nThe Commission said consumer price inflation began to accelerate in Malta in the second quarter of 2018 and reached 1.7% by the end of the year. In part, the acceleration reflected the statistical impact of the increase in the weight of accommodation services in the price index basket for 2018.\nDespite tighter labour market conditions, wage pressures have yet tofully materialise. As wage growth starts gaining pace, inflation should gradually rise to 1.9% in 2020, it warned.\n ", "comment_count": 20, "id": 53}, {"keywords": "", "author": "Keith Micallef", "article_body": "A ‘mysterious’ structure unearthed during excavation works at Tal-Balal, in the limits of Naxxar, turned out to be an underground reservoir, Infrastructure Malta confirmed.\nWhile the state agency would not say if this was of historical importance or not, it pointed out that steps had been taken to preserve it. However, evidence on the ground suggests otherwise as part of it seems to have been lost.\nDiscovered last September during work to widen this arterial road, the underground structure with its vaulted ceiling had aroused curiosity and fuelled questions. At the time, Times of Malta tried to establish whether it had any historical importance but no reply was ever received from the Superintendence of Cultural Heritage.\nHowever, the cultural watchdog had officially complained it had been completed ignored by Infrastructure Malta, saying it had not been consulted on the possibility of any heritage discoveries prior to the start of work.\nInterest in the matter was reignited recently when the site was covered with debris and the surface flattened.\n\nAn Infrastructure Malta spokesman said the structure was a reservoir built in one of the several disused quarries in the area.\nPointing out that only “a small part” was located within the road’s new footprint, he added that the rest of the structure was built within the limits of a plot of agricultural land that had been earmarked for development in 2006.\nHowever, the agency declined to say if the discovery had any heritage value or not. In his reply, the spokesman said a survey was carried out following consultation with the “applicable authorities”, none of which was mentioned by name.\nWhile the findings of the survey were not divulged, the agency said it was subsequently decided to “incorporate” that part of the structure within the road’s footprint. Such operation involved filling up the reservoir with debris “without dismantling it”.\nWhen Times of Malta visited the site, there was no trace of the vaults even though part of the excavated area was still exposed.", "comment_count": 16, "id": 54}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Retailers are in favour of phasing out the 1c and 2c coins, a move that could have a “negligible” impact on inflation.\nThe Malta Chamber of SMEs – GRTU, which represents the sector, is in favour of a system whereby the final total bill at the till, not the individual items, would be rounded up to the nearest 5c, meaning the most a customer would find added to his/her bill would be 4c.\n“This means there would be negligible inflationary impact... many customers do not even want to receive the small coins as change,” the GRTU chief executive, Abigail Mamo, told the Times of Malta.\nOnly rounding up the final bill would mean the coins could be phased out without retailers having to re-label items and allowing them to offer competitive prices, especially in the price-sensitive world of groceries, she pointed out. Card transactions would, however, still charge the exact amount.\nA spokesman for the European Central Bank said there were many ways to phase out the two small coins.\n“Ceasing the issuance of 1c and 2c coins would not be likely to have a noticeable impact on inflation, provided that the rounding is done to total payments in cash and to the nearest 5c, as currently applied in some member states,” he noted.\nRetailers are not the only ones who find the handling of the smaller denominations to be more trouble than they are worth, literally.\nMalta Today reported in 2014 it costs 4.5c to mint a 1c coin and the European Commission reported that producing coins cost €1.4 billion more than their face value.\nThe brunt of the work if the two coins were to be dropped would fall on the banks, with the Malta Bankers’ Association noting that handling coins was a costly process, involving carriage, counting, packing, security and insurance.\nIn addition, there were also the costs incurred for the Eurosystem’s processes to ensure the coins in circulation are always fit for use.\nThe MBA has not taken an official stand on the use of 1c and 2c coins in Malta but said it was clear the costs to banks to handle such coins “outweighed the advantages (if any)” for customers.\nIt said the resultant cost savings would be beneficial for its members, although it expressed doubts on whether the long-term savings would be significant.\nCould there be any losers?\nThe small denomination coins very often end up in charity collection canisters near the till. They are also very popular when collections are made among schoolchildren.\nA spokesman for Bank of Valletta, which organises the annual Piggy Bank campaign in aid of L-Istrina, said the smaller coins amounted to quite a contribution.\n“A very rough estimate is that €5,500 in 1c and 2c coins are packed and sent to the Central Bank from the campaign out of a total of €58,000. That’s almost 10 per cent of the total collection,” he said.\n\n\n\n\nChange in the air?\n• The 1c and 2c coins make up half of the 130 billion euro coins in circulation across the eurozone as at the beginning of this year. However, in terms of value, they only account for €900 million of the total coin value of €29 billion.\n• Unlike banknotes, the issue of euro coins is a national competence, meaning it is in the hands of the Central Bank of Malta.\n• When Malta adopted the euro in 2008, the Central Bank of Malta minted €23 million worth of coins, a stock which had increased to €84.4 million by the end of 2018.\n• Five eurozone countries have already phased out 1c and 2c coins.These are: Finland (2002), the Netherlands (2004), Belgium (2014), Ireland (2015) and Italy (2018), although they are still legal tender.", "comment_count": 79, "id": 55}, {"keywords": "", "author": "", "article_body": "Last updated Thursday 12.50pm with Busuttil's reaction\nFormer Opposition leader Simon Busuttil has stood by his accusations of corruption against Konrad Mizzi as the minister dropped libel cases against the Nationalist MP as well as other MPs and Times of Malta.\n\"Bottom line: when I said that Konrad Mizzi is corrupt, I was damn right,\" Dr  Busuttil said in a tweet on Thursday.\nDr Mizzi on Wednesday said he would be withdrawing several libel cases relating to allegations of money laundering in connection with the Panama Papers revelations.\nThe minister said that he had decided to withdraw the suits after the courts had ruled against Dr Busuttil and MEP David Casa in January, finding that there were no grounds to launch an inquiry related to Panama Papers revelations.\n\n\n\nDr Busuttil had sought a magisterial inquiry into Dr Mizzi and others in July 2017. Magistrate Ian Farrugia had found that there was enough reason to justify an inquiry, but appeals had been immediately filed against that decision by Prime Minister Joseph Muscat, Tourism Minister Konrad Mizzi, OPM chief of Staff Keith Schembri, Nexia BT’s Brian Tonna and Karl Cini, and businessmen Malcolm Scerri and Adrian Hillman.\nThose appeals were successful, with an appeals court ruling last month that there were no grounds to launch an inquiry and saying Dr Busuttil had failed to present evidence to back his claims.\nDr Busuttil and Mr Casa had subsequently sought to re-launch a separate legal bid to place Dr Mizzi under investigation, but that attempt had also faltered, with magistrate Francesco Depasquale dismissing the second request and declaring there was no uncertainty in the prevailing legal situation.", "comment_count": 236, "id": 56}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta discusses whether the 1c and 2c coins should be dropped and says there would be little impact in inflation. It also reports on a slight drop in Malta's Freedom House ranking, attributed to “inefficacy of the country’s anti-corruption institutions”.\nThe Malta Independent says Justice Minister Owen Bonnici would not comment on whether there was a contradiction in the way the prime minister reacted to comments by Daphne Caruana Galizia and Franco Debono, who both said he owned the secret Panama company Egrant. The newspaper also says former minister Anton Refalo is refusing to comment on reports that he had assaulted his son. \nIn-Nazzjon quotes PN leader Adrian Delia saying the direct orders at St Vincent de Paule Home were symptomatic of bad governance.\nl-orizzont highlights the government's new social housing project and the prime minister's remarks that such housing should not be a barrier to social mobility. The newspaper also reports on a major drug bust by the Customs Department, announced on Wednesday.  ", "comment_count": 0, "id": 57}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated 2.30pm with decisions\nHugo Chetcuti’s plans for a new 12-storey hotel in Paceville, one of the last applications he filed before his death last year, are likely to be approved despite exceeding the height limitation. \nThe proposal to demolish an existing villa in Triq Elija Zammit and build a 74-room hotel over 12 floors was submitted last April, three months before Mr Chetcuti was stabbed outside another of his Paceville establishments.\nIt was recommended for refusal due to a breach of the area’s height limitation policy. The proposed height of 42 metres is above the limit set by planning policy, which amounts to 32 metres even after the addition of the two extra floors allowed to hotels.\nHowever, at a PA board hearing on Thursday, the project architect argued that the hotel would nevertheless be lower than another approved hotel directly adjacent. \nIn a preliminary vote, the board stated their intention to approve the application, overturning the recommendation. A formal decision will be taken in the coming weeks. \nThe proposed hotel had drawn no objections from the public or consulting entities, with the Malta Tourism Authority describing it as an “upgrade” on the existing touristic product.\nThe PA case officer praised the architectural design, described as “a very contemporary and interesting architectural statement” complementing the area’s designation as a hotel development zone.\nLarge Bengħisa solar farm approved\nArtist's impression of the approved solar farm in what is now a disused landfill.\nThe PA also approved a 29,000-square-metre solar farm in a disused landfill in Bengħisa, in the limits of Birżebbuġa.\nThe site, outside development zones, was once a quarry and is now used for bird trapping activities and fly-tipping of vehicle parts.\nUnder the approved plans, the site will be cleared, including the demolition of a garage and other structures, and solar panels installed over an area nearly the size of three football pitches, while the rest of the area will be landscaped. \nThe project was approved under the 2017 solar farms policy, which encourages the development of such facilities as part of the government’s strategy for reaching its renewable energy targets.\nThe policy prioritises disused landfills, large-scale rooftops, industrial areas and quarries and specifically excludes open countryside, protected or scenic areas, Natura 2000 sites and land registered for agricultural purposes.\nThe Environment and Resources Authority said the development was not expected to have any significant impacts on the adjacent Natura 2000 sites.\nIn line with the policy, the development will have to be decommissioned and the site restored to an acceptable use within 30 years.", "comment_count": 9, "id": 58}, {"keywords": "", "author": "", "article_body": "Opposition leader Adrian Delia accused the government of “admitting failure” on social housing, lambasting the Prime Minister for suggesting that people should move on if their life situation improves.Speaking at a political event in Lija, he said Joseph Muscat saw people as numbers and was offering no tangible solutions for people struggling with rising property costs. “Today is the day the government admitted it has failed on social housing. In six years it has done absolutely nothing,” Dr Delia said.“Now it has us between a rock and a hard place: more people are coming in, and property prices are going up.“The government’s only guarantee is that things are going to get worse, that property prices will continue to rise and that even those who have access to social housing cannot expect to keep it,” he said. The Prime Minister said earlier on Wednesday that people could not expect social housing “for life” and should make way for others in greater need if their circumstances improved. The remarks were made at the announcement of a €50 million project that will see the building of 500 new social housing units financed by the National Development and Social Fund.The Opposition leader also took aim at Dr Muscat for suggesting that longer life expectancies were exacerbating the housing situation.“Joseph Muscat is lamenting the fact that our elderly are living longer,” he said. “This is chilling. It is a declaration that the government has utterly lost its soul.”", "comment_count": 23, "id": 59}, {"keywords": "", "author": "", "article_body": "Finance Minister Edward Scicluna called for an end to the EU’s dependence on the International Monetary Fund, arguing that Europe was rich enough to sustain its own “rainy-day fund”.\nThis became obvious when the IMF and the European Commission problematically diverged on how to react to the Greek crisis.\nHowever, he emphasised Malta’s position that such a fund should be managed cautiously, and that it should not make up for the inefficiencies of the spend-thrifty at the expense of those who managed their finances well.\nProf. Scicluna was speaking in Parliament in the context of a meeting of the Economic and Financial Affairs Committee, which discussed the European Stability Mechanism (ESM). Finance Ministry Permanent Secretary Alfred Camilleri explained how the ESM had been developed through an intergovernmental treaty between countries forming part of the Eurozone as a replacement to earlier, temporary mechanisms.\nMr Camilleri said that the present economic calm provided an opportune moment for the role of the ESM and of related institutions to be re-evaluated, potentially widening the mechanism’s remit.\nEarlier, the minister rubbished claims that Malta’s good performance with rating agencies had to do with the amounts that these agencies were being paid.\nRating agencies, such as Standard and Poor’s, were not being paid any more than they had been paid during previous administrations, including when Malta had a negative outlook, he said. However, the country had engaged the services of additional agencies in line with an EU recommendation.\nThe positive scores awarded by the agencies were simply a reflection of the performance of the economy, he said.", "comment_count": 20, "id": 60}, {"keywords": "", "author": "", "article_body": "The Attard council said on Wednesday that the creation of a node in lieu of the former railway station waiting room, giving a suitable and community-focused use of an otherwise vacant site, does not attempt to fully replicate the former building.\nThe Malta Railway Foundation is objecting to the proposed design saying it had nothing to do with the old station. It said the outside of the building should at least be as close as possible to the original Victorian one.\nThe council said on Wednesday it had worked over the past years to provide a much needed cultural information centre which sought to provide a focal point for tourists visiting the locality.\nIt would provide information on the Three Villages with the scope of enhancing the tourists’ cultural experience within the area in line with the focus of the Malta Tourism Authority’s Three Villages Heritage trail. The building would also have a dedicated area for a public library.\nWatch: Restored railway carriage is back at Birkirkara station\nIt said that on the advice of the architect tasked with piloting the project, and with the full support of the council, the approved design did not attempt to fully replicate the former waiting room building and this was clearly stated on the application.\n“It is felt that given the total disappearance of the defunct building with absolutely no remnants during WWII provides little scope for reconstruction. This is totally in line with internationally recognised guidelines,” it said.\nThe council said that although this was not a world heritage site, the philosophy put forward in the guidelines for the implementation of the World Heritage Convention was applied.\nRead: Attard railway embankment to be restored\nIt said it was proud to finally provide a functional space with modern amenities and with a design that made the best use of the available space and which was accessible to all.\nThe approved pavilion would still recall the character of the railway waiting room.\nThe main part of the building would occupy the identical footprint, while the height of the main part and the overall dimensions would also match the 19th century counterpart.\n“The council makes no apologies for choosing a modern language for the community building and is proud that sustainability is at the core of the chosen and approved design – double-walls, a cantilever/shading device and large double-glazed surfaces to maximise natural lighting.\n“The building is designed to serve its new function as a cultural information centre, as a cultural space and to house a community library. It will not serve any commercial function. Ħ’Attard local council puts the community first when it comes to the use of public spaces it manages. The building respects the past and its surroundings without any conflict with its surroundings,” it said.", "comment_count": 17, "id": 61}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Although the Tourism Minister said in Parliament the Corinthia Group would have a six-star property at St George’s Bay, the law did not allow a hotel to have more than five stars, Times of Malta was told.\nAcross Europe, hotels were classified up to five stars and there was no such thing as a six-star property, “irrespective of what the government and Corinthia have been harping on in a bid to market and justify their project on public land”, a seasoned hotelier told Times of Malta.\nThe Corinthia Hotel London, touted as the ultimate in luxury, has a five-star classification.\nAnother noted that the only hotels marketed as being six- or seven-star were those in the Gulf, mainly Dubai and Abu Dhabi, though they were not recognised internationally as such. “It’s just a marketing ploy to justify higher room rates,” the hotelier said.\nRead: Land reclamation dropped from Corinthia project, Konrad Mizzi says\nA spokesman for Hotrec, the EU’s umbrella organisation for hotels and restaurants, confirmed that six-star hotels “do not exist”.\n“There are no six-star hotels in Europe and, across the continent, hotel classification is from one- to five-star,” he said, adding that even the common European hotel classification of the Hotelstars Union ranged from one to five stars.\nThe Malta Hotels and Restaurants Association is affiliated to Hotrec.\nThe Tourism Ministry was asked whether, in view of the minister’s declarations in Parliament, the Tourism Ministry was considering changing the law on hotel classification to accommodate Corinthia’s new project but no replies were forthcoming.\nRead:Corinthia MOU signed in 2015 remains hidden\nA spokesman for Corinthia agreed there was no six-star hotel classification in Malta. However, he quickly added that it did not mean such hotels did not exist, referring to the French Palace Hotels, which, he said, “are a class above five-star hotels”.\n“Ultimately, however, there is the true test of room rates. The aim, indeed the justification for the investment being proposed, is for Corinthia to charge room rates that are far superior to those being achieved in Malta’s market today,” the Corinthia spokesman said.\nAs part of its upgrading project for its three existing hotels on the St George’s Bay peninsula, Corinthia is proposing that the government authorises it to build 100,000 square metres of apartments and offices for sale on public land.\nRead:Corinthia to pay just €17m for peninsula\nAccording to a draft deed presented to Parliament, the government is asking for a premium payment of €17 million from Corinthia although estate agents estimate the land in question could fetch over €700 million at current market prices.\nIn view of harsh criticism, the government and the Corinthia Group are renegotiating the terms of the proposed deal.\n ", "comment_count": 27, "id": 62}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The heirs of three workers who died after contracting an asbestos-induced illness have been awarded €45,000 in three separate lawsuits wherein the court declared that their right to life had been breached.\nSurviving relatives of the three men, two former Dockyard workers and a welder deployed by his private employer to carry out works at St Luke’s Hospital in Guardamangia, instituted proceedings against the Chief Government Medical Officer and the Attorney General.\nOne of the men had taken up a job at the Drydocks in his youth and had worked there until his retirement in 1998. However, some 17 years later, he developed a persistent cough and a shortness of breath which doctors certified as symptoms of asbestosis and mesothelioma.\nHe was placed under palliative care until his death in May 2016.\nThe second worker had served as a shipwright at the Drydocks and had likewise developed symptoms of malignant mesothelioma some 20 years after retirement, succumbing to his illness at the age of 76.\nThe scenario surrounding the third victim was somewhat different. The man had been a welder working in a private company when he was deployed for a long number of years to the former St Luke’s Hospital where he assisted in the dismantling of asbestos pipes.\nSince the early 1980s, the worker spent days on end working in the basement of the hospital, removing the old pipes which placed him in close contact with asbestos fragments and dust.\nEventually, he developed similar symptoms, passing away two years later aged 67. The cause of his death was put down as “malignant mesothelioma with brain and lung metastasis”.\nUpon the evidence put forward, the First Hall, Civil Court, in its constitutional jurisdiction, concluded that the medical file of each patient had left no doubt as to the fact that their illness had been a consequence of such contact with asbestos.\nIn spite of the harmful effects caused through exposure to asbestos, which effects had long been known in the scientific and medical fields, the authorities had dragged their feet in taking “effective precautionary measures” as well as implementing laws to safeguard workers, the court observed.\nMoreover, in view of the argument raised by the respondents that the State was not to be held responsible for the work conditions of Dockyard employees, the court deemed this “somewhat ironical”, given that “for several years, the dockyard fell under state or parastatal responsibility”, the court continued.\nIn the light of all evidence, the court, presided over by Mr Justice Joseph R. Micallef, declared that the right of the applicants to the protection of life had been breached since they had suffered in more ways than one on account of the illness which afflicted their loved ones.\nIn such cases, monetary compensation was “more adequate” than a mere declaration of such breach of rights, the court said, awarding the three families €10,000, €15,000 and €20,000 respectively.\nLawyer Juliette Galea assisted the families.", "comment_count": 1, "id": 63}, {"keywords": "", "author": "Claire Caruana", "article_body": "Tourism Minister Konrad Mizzi went on 30 trips abroad last year, spending some €78,000 on them.\nAsked in Parliament by Nationalist Party MP Claudette Buttigieg for details about his trips abroad, Dr Mizzi said that last year he made 30 official visits abroad, with the average cost of each one averaging €2,600.\nIn 2017, the year he was appointed Tourism Minister after the Labour Party was re-elected to government in June, Dr Mizzi went on eight such trips abroad.\nIn her question, Ms Buttigieg asked for a breakdown of all the trips that Dr Mizzi went on since Labour first came to power in 2013.\nThe PN MP also asked for details of each trip, namely the reason for each trip, the length of each trip and who accompanied the minister. She also asked whether the trips were booked through travel agencies and if so, which were these and were they selected via a direct order.\nDr Mizzi provided none of these details in his reply, stating however that the trips abroad were in conformity with the established procedures and were approved by the Cabinet.\nAccording to information also tabled in Parliament recently, Dr Mizzi missed 48 parliamentary sittings last year because he was away on government business.", "comment_count": 53, "id": 64}, {"keywords": "", "author": "", "article_body": "A 50-year-old man was grievously injured in a fall while carrying out construction work at the Police headquarters on Wednesday.\nThe police said the accident happened at 11.30am. The victim, who is Italian, lives in St Paul’s Bay.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 65}, {"keywords": "", "author": "Ivan Martin", "article_body": "A 21-year-old Gozitan police constable was arrested last weekend after he was caught in possession of six sachets of suspected cocaine, police sources confirmed.\nThe sources said the young constable, who had only recently joined the Corp, was watching a football match at the Gozo Football Stadium on Sunday between Nadur Youngsters and Xewkija Tigers.\nHe was being monitored by officers of the recently bolstered Gozo Drug Squad who followed him into the men’s bathrooms where they discovered he was in possession of what is believed to be the drug.\nThe officer allegedly resisted arrest, sources said, but was eventually placed under custody.\n\"I think the drugs went to his head,\" one source said. \nHe was made to resign from the police force earlier this week, top brass said.\nAnother police source said the officer in question was expected to be arraigned in court in the coming days and charged with aggravated possession.\n“It is a crying shame that a young member of the Corp would be involved in drugs, it can give such a bad name to the whole police force,\" he said. \nGozo stadium hotspot\nSources said the Gozo stadium was one of a number of places the drug squad had been monitoring in recent months as part of an attempt to clamp down on narcotics on the sister isle.\nOther people were arrested as part of the crackdown, a senior source said. \n“I’m quite pleased to see that even though this young man was a police officer, the drug squad still arrested him and didn’t give him any preferential treatment,” they added.\nLast year, Times of Malta had reported how three police officers had been caught in possession of cocaine in a Paceville nightclub.\nEarlier on Wednesday, the Customs Department said its officers had seized cocaine worth some €11 million after homing in on a container in transit at Malta Freeport.", "comment_count": 0, "id": 66}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Environmental NGO Nature Trust is in touch with the Environment and Resources Authority, trying to find out what happened to a dolphin carcass which allegedly washed up in Msida on Tuesday.\nMEP candidate Cami Appelgren said she was informed about the case by her sources, and had been told that the carcass was removed – but that the normal procedure was not followed.\n“Crimes against these creatures shouldn't be taken lightly. They are protected on paper, but with no proper transparent enforcement,” she fumed to the Times of Malta, after posting news of the find on her Facebook page.\n\nNature Trust head Vincent Attard told the Times of Malta that dolphins are a protected species – even when dead – and that it should have been notified.\n“We normally go on site to evaluate the situation and to collect data about the species and the size, among other details. And sometimes, we are asked to organised a necropsy to determine the cause of death: it is important to rule out disease but also to ensure that there was no foul play.\n“Without a carcass, we cannot rule that out,” he stressed, adding that there are also set procedures for the carcass disposal.\nMs Appelgren, who has made protection of marine areas and species a cornerstone of her MEP campaign, said it was still not clear who removed the carcass, but that it was not Animal Welfare.", "comment_count": 5, "id": 67}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government’s Engineering Profession Board has turned down a request by Times of Malta to publish an audit of the course offered at Mcast, insisting this was a “working document”.\nThe board was replying to questions by the newspaper in the wake of reports that a group of some 150 engineers were mulling legal action against the government body over the refusal to publish a report auditing the Mcast programme. \nAccording to a spokesman for the board, both Mcast and the body were in the process of “implementing the recommendations made in the report”.\n“Mcast, together with the board, are also seeking to commission external recognised reviewers to ascertain that the new course structure and content is fully in line with the recommendations made in that report,” the spokesman said.\nThis is an ongoing process that needs to be given time to be implemented\nA similar request for the report by university students to the board, which is the regulating authority, was turned down in November. Both the programmes of the Faculty of Engineering at the University and at Mcast were subject to evaluation by the Accreditation Agency Specialised in Accrediting Degree Programmes in Engineering, Informatics, the Natural Sciences and Mathematics (ASIIN).\nAccording to the spokesman, once the review of both the new course by the college and the bridging studies course for past graduates is completed, the board would then “discuss the possibility of the publication of the report”. \n“This is an ongoing process that needs to be given time to be implemented to enable all the recognised stakeholders to eliminate the lacuna that existed in the previous Mcast course and this for the benefit of past graduates and new students at this tertiary educational institution. \n“As this document is an internal working document, it would not be of benefit to the whole process to publish this report,” the spokesman went on. \nIn an attempt to get hold of a copy of the report, Times of Malta also filed a Freedom of Information request asking for it, but this too was turned down.\nUntil last year, Mcast students who followed the course in engineering could not apply for the engineering warrant as the programme was deemed to be a vocational one by the board. As from this year, however, graduates from both the University and the college could apply for a warrant.\nPrior to the change, Mcast students had repeatedly insisted that they were being discriminated against, often claiming that their course was the same as that offered at the University.\nOn their part, both the University students and the group of engineers questioning the eligibility of the Mcast students had insisted that their issue was not about the fact that a warrant is issued but they wanted to be sure that those graduating from the college were equipped with the same skills as their University counterparts. ", "comment_count": 6, "id": 68}, {"keywords": "", "author": "", "article_body": "The government agency that handles funds from the sale of passports has allocated €50 million for the building of 500 social housing units.\nA memorandum of understanding for the purpose was signed on Wednesday by the National Development and Social Fund (NDSF) and the Housing Authority in the presence of the prime minister.\nThe Prime Minister said the building of the 500 units was part of the biggest social housing project ever and reflected the state’s commitment to help the under-privileged.\nDr Muscat had first announced the project during a Labour Day public meeting last year.\nSocial housing, he said, was a means to help people improve their situation. The government, he said, was trying to change mentalities and people who managed to advance should not necessarily continue to stay in social housing.\n“We need to fight the sense of entitlement and look towards social mobility,” the Prime Minister said, adding, however, that what had already been done would not be changed.\nDr Muscat said the government was promoting social integration and building social housing units within development zones, while not disturbing ODZ areas.\nHe also referred to the white paper on rents, saying a balance had to be struck between those who had invested in the property market and young people who often had to take 40-year loans for their house purchases.\nParliamentary Secretary Roderick Galdes said the new housing units would be built on 22 sites in 12 localities: Paola, Kirkop, Rabat, Żabbar, Mellieħa, Luqa, Żurrieq, Żebbuġ, Qormi, Siġġiewi, Qrendi and Marsaskala. Some 680 units are separately being built in 16 localities.", "comment_count": 65, "id": 69}, {"keywords": "", "author": "Denise Grech ", "article_body": "Hippopotamus, elephant and wolf bones dating back to the ice age were all accidentally unearthed during the creation of a heritage trail across three caves, a senior curator said.\nSpeaking on the fringes of a press conference, John Borg said a lot of small bones were discovered in a room close to Għar Dalam that had previously been shrouded by reeds.\n\"When we started removing the trees around it, we discovered a lot of small bones that had been deposited there in the early 20th Century,\" Mr Borg explained.\nAt the time, excavators had been looking for \"spectacular\" bones, dumping small remains in the room along the way.\nThe discovery was made while clearing a path to create a trail which will lead from Għar Dalam, to the Roman Villa at ta' Kaċċatura and the prehistoric temples at Borg in-Nadur.\n\"We realised we found material that had been excavated and dumped in the room over the years,\" Mr Borg explained.\nOne of the particularly interesting findings are wolf bones, he added, explaining remains of carnivorous animals were rarely found.\nThe findings will now be cleaned and catalogued at the Natural History Museum in Mdina. \nSpeaking during a press conference announcing the findings, Culture minister Owen Bonnici said a lot of discoveries were yet to be made at Għar Dalam.\nThe findings helped shed light on Għar Dalam, Dr Bonnici said.\nChildren were also visiting the area to learn more about the historic site, Heritage Malta chairman Anton Refalo said.\n\"One of our biggest duties is to teach children about culture,\" Mr Refalo said.", "comment_count": 17, "id": 70}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The father and uncle of a 13-year old pupil were accused in court on Wednesday of having injured two school officials and a boy in an incident at Pembroke school last Monday.\nThe arraignment took place at the same time as an urgent meeting was held between Education Minister Evarist Bartolo and the Malta Union of Teachers on ways to beef up security at schools.\nThe MUT presented the Education Ministry with several proposals to improve security in schools. \nFeliciano Camilleri, 35, from Floriana, and his brother Alexander Camilleri , an AFM soldier, turned up at the school where the former’s son had allegedly been bullied by another student.\nThe two brothers were charged with having slightly injured a boy and two school officers, threatened the officials, uttered foul language in public and breaching the peace.\nA request for bail was objected to by the prosecution in view of the gravity of the offence and the risk of tampering with evidence.\nDefence lawyer Alfred Abela countered that the men had turned up at the school after receiving a call that Feliciano’s son, 13, was being bullied by another student, 15, who was some “6 ft tall”. He said  the bullying had been ongong for quite a while and his client’s son had suffered injuries.\nHowever, in a decree delivered after a brief adjournment of the hearing Magistrate Joseph Mifsud turned down the request for bail, saying that while the presumption of innocence was a fundamental principle at law, “violence was never acceptable, let alone in schools.”\nEducators, he said, had a right “rather a duty” to discipline their students and they should do so without incurring the risk of being violently taken to task, ending up assaulted and injured.\nSociety would be at risk if it were to permit its younger generation to adopt a nonchalant attitude, getting away without discipline when this is due.He therefore turned down the request for bail, declaring that the court had a duty to ensure a balance between protecting society and the rights of the accused.\nThe court also issued a ban on the names of both minors, parents of the alleged victim and all school staff, further issuing a Temporary Protection Order which, if breached, carried a maximum penalty of €7,000 or a maximum jail term of 2 years.", "comment_count": 0, "id": 71}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A French student is being held in custody after relieving himself in public, with his lawyer lamenting that his client would be missing his upcoming exams.\nTitouan Robin Malo Billaud, 21, residing at Buġibba, was arraigned just hours after his arrest after being spotted answering nature’s call in St Julian’s at around 5.45am on Wednesday.\nRealising that he had been spotted by officers, the man allegedly took to his heels, with a constable giving chase. When the officer finally caught up with the young man, the latter allegedly resisted arrest and fractured the policeman’s finger.\nThe subdued man pleaded not guilty to involuntary grievous bodily harm, as well as to having threatened and violently resisted the public officer.\nNo request for bail was made.\nThe court, presided over by magistrate Joseph Mifsud, expressed concern over the rise in incidents of violence against public officers, reiterating his message delivered in an earlier decree on Wednesday when presiding over an arraignment regarding a case of domestic violence which ended up with two officers suffering slight injuries.\nInspector Joseph Xerri prosecuted. Lawyer Raisa Colombo was legal aid counsel.", "comment_count": 0, "id": 72}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Maltese women had been enjoying equal pay for decades, but the widening gender pay gap has caught up with the island, President Marie Louise Coleiro warned.\nLegislation alone was not enough, and achieving full gender equality required political will, she said on Wednesday.\n\"These disparities are a new form of the same old discrimination and inequalities,\" President Coleiro Preca said at a conference called Empowering Gender Equality on the occasion of the state visit by Tunisian President Beji Caid Essebsi.\nNearly half of local council positions in Tunisia are held by women, and the North African country has also become the first Arab nation to approve gender equality in inheritance law.\nIn light of rapid changes in the Mediterranean, President Coleiro Preca said \"we must be brave\" and implement our vision for the future of women and their empowerment.\n\"We are living at a time when we must respond to the complex phenomena facing our families and communities within our region. Unfortunately, these phenomena include conflict, poor working conditions, environmental degradation, and increasing flows of migrants seeking hope and safety.\"\nNoting that increasing the social and political visibility of women was essential, she commended her Tunisian counterpart Mr Essebsi for the \"impressive achievement\" of 47 per cent of the local council positions in Tunisia being held by women.\nShe referred to Mr Essebsi as a \"stalwart of equality\" who had also set up the Individual Freedoms and Equality Committee to propose reforms for the Tunisian legislative system.\nMs Coleiro Preca meanwhile referred to improvements in Malta, including the 16 per cent increase in female participation within the workforce and gender parity in the Judiciary.\nHowever, there were still disparities reflected in a widening gender pay gap, she said.\nAlthough Maltese women have enjoyed equal pay for decades, this phenomenon, present throughout the Euro-Mediterranean Region, had caught up with us too, she noted.\nThe President insisted that one could not afford to ignore such inequalities and injustices.\nWomen played a vital role in a country’s socioeconomic growth - when women’s contributions were undervalued, the whole socioeconomic life of the country suffered, she said.\nIn this context, Ms Coleiro Preca referred to a \"very telling indicator\" from the Organisation for Economic Co-operation and Development, which showed that gender equality in the economic sector could increase the GDP of the Mediterranean Region by more than 25 per cent.\nGender-based challenges such as violence against women could not be allowed to continue preventing us from reaching our full democratic goals, she added, noting that according to the Euro-Mediterranean Women’s Foundation, femicide was a “silent scourge” in the Mediterranean.\nBoth Malta and Tunisia had the proper legislation in place to combat violence against women, however, it was essential to take these strategies further.\n\"We cannot sit on our laurels. We need to endeavour further.\n\"It is time to address the underlying mentality and stereotyping, which are constraining many girls and women, and excluding them from active participation in economic, social, and political life.\"\nThe conference is being co-facilitated by the Mediterranean Academy of Diplomatic Studies at the University of Malta, the Embassy of the Republic of Tunisia, and the Office of the President of Malta.\nRead: Quotas for women in parliament: PD says women are not tuna\nPublic consultation on representative democracy 'soon'\nDespite the different electoral systems, Malta’s 14 per cent female representation in parliament pales against Tunisia’s 47 per cent in local councils.\nPro-Rector Carmen Sammut, who sits on a committee exploring legal and technical aspects ahead of a public consultation on improving female participation in Malta’s democracy said Parliament should act as a model for the rest of society.\nUnless we “shook the tree”, Malta will not manage to reach the UN goal of 50 per cent male and 50 per cent female representation by 2030, she said.\nHowever, she pointed out that while Maltese female candidates have been running on the spot for decades, they broke the ceiling when it comes to MEP elections.\nProf. Sammut noted that women had to achieve what is known as the ‘critical mass’ of 33 per cent representation in order for them to start being elected on their own steam.", "comment_count": 4, "id": 73}, {"keywords": "", "author": "", "article_body": "A worker suffered serious injuries while working on machinery at Malta Freeport on Wednesday morning.\nThe police said the incident happened shortly before 11am.\nThe worker, 60 from Qormi is being treated in hospital.", "comment_count": 0, "id": 74}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Mater Dei visitors will be relieved to hear that the notoriously unreliable parking payment machines have been replaced by more robust ones and the out-of-service time has been cut by 95 per cent.\nKIS Service JV consortium began running the hospital car park last August, after a 10-year deal signed back in January 2008 ended.\nHealth Minister Chris Fearne said in reply to a Parliamentary Question by MP Godfrey Farrugia that the new operator has added more machines at various strategic locations to cut down the queue of people waiting to pay their parking tickets at the ground floor level.\nA monitor has also been installed at the entrance to the car-park which shows how many spaces are available, meaning people do not need to drive around and around in the hope of finding a vacant spot.\nAnother innovation – part of the mandatory investment by the new operator – is the introduction of a tidal system at the entrance, allowing two of the three lanes to be allocated to those going into the car park during the busiest hours of the morning, and then reversed in the afternoons.\nHowever, the minister gave no information on plans to increase public parking. The ministry had said last September that discussions were at an advanced stage with the Planning Authority for the development of a new underground 500-slot car park to complement the current 1,900 ones.\nMater Dei receives roughly half a million outpatient visits every year – which works out to approximately 2,000 every working day. In addition, the car park is used by inpatients’ visitors.\nKIS Service JV won the concession after beating four other bidders in a tender application process, and has signed a five-year deal with an option to extend the contract by two further years.\nAfter winning the concession, it had immediately revised the rates and cut fees from 10c per parking spot (from 80c to 70c) for visitors who stay up to one hour, to 60c (from €4.10 to €3.50) for visits of four hours or more. Parking will remain free for visits of 30 minutes or less.", "comment_count": 9, "id": 75}, {"keywords": "", "author": "", "article_body": "A 22-year-old from Marsascala angrily stormed out of a courtroom on Wednesday morning after a magistrate denied him permission to speak.The young man shrugged off police officers and paced out of Magistrate Joseph Mifsud’s courtroom. He was subsequently brought back in and told off by the magistrate, but continued to try and get a word in and insisted the court had been given the wrong facts. The young man was in the dock for having allegedly attacked two police officers who had shown up at his house to arrest him over domestic violence charges. Both officers were slightly injured in that scuffle.\nThe court heard on Wednesday that the young man had issues with his mother and had been arguing with his parents all day when police showed up.The youth pleaded not guilty to a litany of charges, from threatening his parents to injuring the officers and violently resisting arrest, but did not request bail. As Magistrate Mifsud gave him a scolding – “you haven’t shown any remorse”, he said – the accused kept answering back.“The police officer hurt himself,” he told the court, as his lawyer, Raisa Colombo, tried to calm her client, to no avail.\nThe magistrate reiterated the importance of police officers being protected as they went about their duties. Violence against police was on the rise and the court did not want officers to end up demoralised, the magistrate saidThe young man was remanded in custody and led out of the courtroom.\nInspectors Eman Hayman and Oriana Spiteri prosecuted.", "comment_count": 0, "id": 76}, {"keywords": "", "author": "", "article_body": "The European Union's Council of Ministers has given its approval to a proposed Work Life Balance directive, of which Maltese MEP David Casa was one of the main negotiators.\nThe final remaining phases for the directive to become law are votes in the European Parliament, first in the Committee on Employment and Social Affairs followed by a vote in the plenary, possibly in March.\nMr Casa hailed Wednesday morning's approval.\n“We are demonstrating that it is possible to succeed in enacting ambitious laws that address social issues at EU level. Exploiting our full economic potential requires policies and laws that reflect the reality of our societies. It means ensuring that workers are given every opportunity to reach their full potential. The new Work Life Balance Directive will play an important role in reaching these objectives across Europe, and especially in Malta.”\nThe directive will introduce 10 days of paid leave for fathers upon the birth of a new child, two months of paid leave for each parent that can be used until the child is eight years old, the introduction of five days of annual carer’s leave for workers to care for sick relatives, and the right for employees to request flexible working arrangements.\nThe Malta Business Bureau, the Malta Chamber and the Malta Hotels and Restaurants Association earlier this month said that while they agreed with work-life balance initiatives, these should not increase the cost burden on companies that would otherwise impact their competitiveness and ability to create more jobs. ", "comment_count": 4, "id": 77}, {"keywords": "", "author": "", "article_body": "Customs officers have seized drugs worth some €11 million after homing in on a container in transit at Malta Freeport. \nThe huge discovery was made on Monday night but was only announced on Wednesday.\nThe Customs Department said its inspectors had flagged a container for inspection due to its suspicious route. The container was dispatched from a South American country and stopped in Malta en-route to the Middle East.\nIt was declared to be carrying 532 drums of waterproofing compound. Officials from the Customs Scanning Team scanned the container and noticed irregularities.\nManual inspection confirmed that six drums contained plastic bags full of white substance, in paste form, submerged in an oily liquid. 10kgs of this paste were found in each drum, for a total amount of 60kgs which turned out to be cocaine.\nTesting on Tuesday showed it to have a purity of 100%.\n\"Due to its level of purity, the seizure is conservatively calculated to have a street value between €9 million and €11 million when added with other agents,\" the department said.\nIt said this seizure was unique in its intricate nature. \"It is definitely the first of its kind in Malta, probably in Europe too.\"\nInvestigations are continuing. ", "comment_count": 27, "id": 78}, {"keywords": "", "author": "", "article_body": "Partit Demokratiku said Wednesday it will be objecting to a development application which will Giardino Zammitello in Pieta replaced by a nine-storey hotel.\nThe site is adjacent to the gardens of Villa Frere.\nThe party said it had noted reports of leaked emails which implied that the Prime Minister bypassed the planning process to promise the development of the site. It said it expected the police to investigate. \nThe new hotel, it said, would ruin all the voluntary work carried out over the past years by the Friends of Villa Frere to restore one of the most undervalued heritage sites in Malta.\nAt a time when guardianship legislation has been rolled out to encourage agreements between NGOs and government, this development would run completely contrary to the direction otherwise being encouraged. It would not only ruin the work of volunteers but also destroy priceless heritage in the process, the party said.  ", "comment_count": 2, "id": 79}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A contract for a new Gozo-Malta fibre optic cable should be signed soon, Economy Minister Chris Cardona confirmed in Parliament.\nResponding to a parliamentary question by MP Chris Said, he said that the Contracts Department was finalising administrative procedures which would allow it to sign the contract with the successful bidder, Elettra.\nThe journey to this stage has taken over four years. Funds for a feasibility study had been allocated in 2014, and the €250,000 government-commissioned report concluded that a second link between the islands could lure up to 200 high-skilled workers seeking better opportunities in IT, gaming and the digital creative industry.\nMalta Enterprise then issued a call for tenders in December 2017 for the €3.5 million project, to be completed within nine months of the contract being signed.\nThe tender closed on March 8, 2018, with two bids: Elettra’s for €3.99 million, and Huawei’s for €3.75 million.\nAn appeal had been filed following the identification of the preferred bidder last August.\nThe link will take the form of a submarine part and land-based sections on both the Malta and Gozo ends. The proposed route outlined in the tender commences at the Xewkija industrial estate, proceeds 3.6 kilometres to the shore at Tal-Fessej, limits of Mġarr ix-Xini, then under water for a distance of 13 kilometres, landing at Golden Bay before terminating 4.3 kilometres away at Żebbiegħ.", "comment_count": 4, "id": 80}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Children in some state schools may have to attend lessons in mobile classrooms because no more space is available since a planned building programme has so far failed to materialise.\nEducation Ministry sources said the government prefers to remain silent on the “growing crisis” hitting the State education system, primarily because of overcrowding, lack of resources and bad planning. \nArrangements have been made to install mobile classrooms at St Paul’s Bay primary and Żejtun’s secondary schools as from the next academic year, they added.\n“There is also the possibility that this ‘solution’ will also be extended to schools in other locations, where new school-building programmes have fallen significantly behind schedule and student populations continue to rise at an alarming rate,” the sources warned.\nThe Education Ministry was asked about the mobile classrooms plans and for details on how many children these temporary structures would accommodate but no replies were forthcoming at the time of writing.\nSuch emergency measures demonstrate that the education sector is in crisis\nThe largest of the mobile classrooms are expected to be installed at the St Paul’s Bay primary school, where about eight such units are likely to be used.\nThe secondary school in Żejtun, part of the St Thomas Moore College, is expected to take about six mobile classrooms, the source added.\nThe need to build a new school at St Paul’s Bay has been evident for years now as the locality became home to about 100 different nationalities, mostly migrants. \nTo cope with the increasing demands for State education there, the government had planned to build a new primary school in Qawra by 2015. However, long delays, lack of planning and claims of corruption at the government’s school building agency, the Foundation for Tomorrow’s Schools, pushed target dates significantly off the mark. The completion date of the new school is also expected to miss the latest target date, this coming September.\nBased on recent statistics, the population of St Paul’s Bay grew by 26 per cent between 2015 and 2018, with over 26,000 residents living in the seaside locality.\nIn Żejtun, the mobile units are expected to substitute the classrooms that were planned to form part of an additional new floor, which also had to be ready by September but has been delayed. Apart from Żejtun itself, the secondary school also caters for the Marsascala area, which is also experiencing a boom in population.\nŻejtun’s population stood at 13,726 last year, up 12 per cent over 2015.\nSenior education officials told Times of Malta that the fact that the government was resorting to such emergency measures demonstrated that the education sector was in crisis and that the government had no real plan on how to cope with the increasing population, mostly through imported labour.\nPrime Minister Joseph Muscat warned last Sunday that Malta’s future prosperity depended on the importation of more labour, in line with the government’s economic plan. \n“If you don’t want more foreigners, say goodbye to pensions,” he warned.", "comment_count": 59, "id": 81}, {"keywords": "", "author": "", "article_body": "A 58-year-old man who had been badly burned in a fire near a Żebbuġ fireworks factory died in hospital on Wednesday, police confirmed.\nThe man, Joe Attard, had been burning some material alongside a 26-year-old man two weeks ago when a fire broke out just outside the factory in Wied Qirda.\nBoth men were grievously burned and hospitalised following the incident.\nOn Wednesday, messages of sympathy for Mr Attard's family poured in on social media, with the De Rohan band club thanking Mr Attard, known as il-Germaniz, for his work throughout the years.\nMagistrate Audrey Demicoli is leading an inquiry into the incident.", "comment_count": 0, "id": 82}, {"keywords": "", "author": "", "article_body": "An 85-year-old man slept in his locked bedroom while the rest of his house was ransacked, a court has been told.\n\"I got the biggest shock of my life,\" Carmelo Calleja recounted in court as he described how he locked his bedroom at 8pm on March 25, 2012 and went to sleep. When he got up the following morning, he was shocked to find his house ransacked, with drawers and clothes thrown to the floor in a room near his bedroom and the rooms downstairs.\nThe front door had been forced open and a carpenter charged him €100 to repair it.\nNothing was stolen however.\n\"There was nothing to take, I live off my pension,\" Mr Calleja told Magistrate Claire Stafrace Zammit. He said he had not heard anything through the night. \nThe accused, Victor Fenech, a 47-year-old unemployed man, denied involvement and insisted he had never gone to Mr Calleja's house.\nPolice, however, produced evidence showing Mr Fenech's palm print on the back of one of Mr Calleja's armchairs.\nThe court, on the basis of the scientific evidence, found Mr Fenech guilty of the attempted theft and of being a recidivist, having been convicted of a previous theft.\nHe was sentenced to 18 months imprisonment and ordered to pay court costs of €745.45.", "comment_count": 0, "id": 83}, {"keywords": "", "author": "", "article_body": "Inviting selected journalists to events attended by ministers did not amount to good practice and should be discouraged, the Commissioner for Standards in Public Life, George Hyzler, said in his first decision on Tuesday.\nThe Times of Malta had complained last November that Tourism Minister Konrad Mizzi failed to inform it and, possibly, other media houses, about an event at the Malta Film Commission where he gave interviews only to One News and PBS.\nThis newspaper considered such conduct to breach the ministerial code of conduct. Article 10 lays down that “ministers shall inform the public and the media of ministerial activities on a regular basis and in an organised manner.”\n\n\n\nAmong other things, the minister argued that the article in question did not require ministers “to invite the Times of Malta, or any other specific organisation, to all events attended or hosted by ministers”. He also noted that the Times of Malta “has been openly and persistently hostile in his regard”.\nDr Mizzi said that if ministers were bound to inform all media equally at all times, then answering media questions (other than by official press statements) would also be prohibited.\nRead: Konrad Mizzi - how to avoid the press \nIn his considerations, Dr Hyzler noted that what constituted information “on a regular basis” and “in an organised manner” gave rise to ambiguity and uncertainty.\nReferring to the case raised by Times of Malta in its complaint, Dr Hyzler noted that the two media houses present were the State broadcasting station and another affiliated to the political party in government. \n“This, apart from other considerations, raises the question of unfair advantage that was given to PBS and, more relevantly, to One News, over other media houses in terms of real-time reporting,” he remarked.\nThe commissioner did not find Dr Mizzi in breach of the ministerial code of ethics. However, he let it be known that, in a meeting with the minister, he “openly” expressed his concerns on the practice adopted.\nDr Hyzler said the minister insisted the complaint made by Times of Malta had no basis in fact or at law. \nDr Mizzi also declared that, “in a spirit of collaboration and thankful for the mediation by the Commissioner for Standards in Public Life”, he “shall seek that the ministry’s communication team maintains an open line of dialogue with a wide representation of the local media and shall, as far as practical, invite such representation to all official major events organised by the ministry”.\nThe commissioner expressed the view that, as a matter of good practice, ministers and parliamentary secretaries should adopt “a non-discriminatory approach in dealing with the press and that a more transparent system of invitations should be put in place on a formal basis in order to avoid any further equivocality”.\nDr Hyzler said that, in line with the mission of his office to promote the raising of standards by people in public life, he proposed to issue in due course guidelines on the application of article 10 of the ministerial code of ethics.", "comment_count": 24, "id": 84}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated after arraignment\nThe Malta Union of Teachers on Wednesday presented proposals for improved security in schools, following two incidents which saw teachers being slightly injured.\nTwo persons were arraigned in connection with an assault at Pembroke secondary school on Monday.\nA 15-year-old boy was hospitalised after he was attacked by another student. The latter’s father later allegedly showed up to the school accompanied by two other men.\nTwo staff members, understood to be an assistant head and a teacher, were hurt as they tried to break up the fight.\nThe brawl was followed by another incident on Tuesday, when a student and a school official got into a fight at the St Ignatius College secondary school in Qormi. The incidents are not related.\nThe union said its officials had a meeting with Education Minister Evarist Bartolo and presented nine proposals.\nThe union's proposals are: \nA review of the physical access to schools to ensure there was only controlled access;\nAllocation of a fund for security in schools and deployment of security personnel; \nA revision of the allocation of Prefects of Discipline with an increase in personnel;\nA ban on mobile phones in schools and respective enforcement;\nDiscussion about particular schools whose catchement and student population is affecting order and discipline;\nConsultation with educators to address the respective needs of specific schools;\nConcrete intervention in situations caused by mental health issues and substance abuse;\nAll schools to have a police/security presence in the morning and afternoon;\nColleges and the ministry to back all decisions of teaching grades. \nAudit report to be completed soon\nThe union said ministry officials said a company specialising in security shall be presenting a report about its audit in schools later this week.\nA tender for security services is being finalised and talks will be held between MUT and the ministry about its implementation, the union said. \nAs for the allocation of Prefects of Discipline, the ministry said the situation is being analysed.\nOn mobile phones, the officials said a discussion should follow on the way the policy is being implemented in schools.\nThe situation of students of out of locality and the size of some schools would also be discussed.\nEducation authorities would also hold talks with health authorities on the situation caused by mental health issues and substance abuse.\nThe ministry would also hold talks with the police on increased presence at schools.", "comment_count": 17, "id": 85}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Al Shabaab killing of a Maltese port manager in Somalia was not typical of the terrorist group and pointed to economic, rather than political, motives, regional experts told the Times of Malta.\nPaul Anthony Formosa, 52, from Marsascala, was killed by gunmen on Monday in the port of Bosaso, in the semi-autonomous Puntland state, in an attack which Al Shabaab said was “part of broader operations targeting the mercenary companies that loot the Somali resources”.\nMr Formosa worked at P&O ports, a subsidiary of the Dubai-based global operator DP World, which was granted a controversial concession in April 2017 to develop and operate the port.\n“Al Shabaab have traditionally gone for spectacular attacks, aimed at demolishing the credibility of the government,” Nicola Pedde, director of the Institute of Global Studies in Rome, told this newspaper.\n“This was a Mafia-style execution. They have occasionally carried out these activities in the past but usually against journalists and those affecting them directly. This was economic and a message to the Emirates: your interests here are detrimental to us,” he added.\nDr Pedde said the Puntland region had for years been one of the most secure and stable in Somalia, with the semi-autonomous authorities governing without much of the chaos that plagued the rest of the country.\nThe last few years, however, experienced a deterioration in security, prompted in part by a clash of economic interests between China and the United Arab Emirates, as Dubai set about acquiring and developing several ports, as in Bosaso, dealing with local authorities and bypassing the central Somali government.\nThe presence of Al Shabaab in Puntland, Dr Pedde continued, was itself a relatively recent development and pointed to an evolution within the group, with new factions trying to widen its scope from solely domestic causes to a more global approach.\n“This idea of defending Somalia from outside influence is part of their ideological vision. Al Shabaab is mostly getting its money from illegal commerce and controlling ports,” he said. \n“They may be accusing these companies of looting Somalia but the real motivation is that they need the ports to get money. These companies have hijacked one of their most important sources of economic income on the ground,” Dr Peddle said.\nDonald Brownrigg, a private security contractor with experience of the region, agreed that, while still volatile, Puntland was generally safer than the rest of Somalia and not a region where Al Shabaab was traditionally active.\nThe group, he said, was known to demand protection money or threaten attacks as a means of extortion.\nCompanies like P&O often had to rely on Somali State security forces or local private security companies, with Western operators limited by local regulations to unarmed roles such as information gathering, he noted\n“What surprises me is that an attack like this must have taken some planning, which suggests a failure of intelligence on the side of P&O,” Mr Brownrigg said. \n“If they had good intelligence, they would have taken him out of the country until they could find a solution.”", "comment_count": 6, "id": 86}, {"keywords": "", "author": "", "article_body": "At least one Maltese expat was forced to leave her home after entire neighbourhoods were evacuated due to heavy rainfall and flash flooding that devastated parts of northeast Australia for nearly two weeks.\nJohn Dougall told the Times of Malta his 30-year-old daughter, Ilona, was forced to climb into a military boat that picked her from where the road once lay and leave her house behind as a third evacuation warning was sounded in her neighbourhood of Rosslea in a matter of days.\nThe woman is now living in a military base with her husband, sleeping on stretchers, having also spent some time in an emergency evacuation centre in a school gymnasium.\n“We were worried when we started hearing about how bad the situation really was. Luckily, our daughter is okay but many in the area lost everything,” Mr Dougall said.\nA monsoon ravaged parts of north Queensland, particularly the coastal city of Townsville where Mr Dougall’s daughter has lived for some two years.\nIn the space of 10 days, Townsville received more than its annual average rainfall and broke records in terms of successive days of rain exceeding 50mm.\nI’m just happy she is safe. Now it is a matter of taking it day by day\nImages of roofs of family homes barely breaking over the surface of the murky brown flood water made the international headlines in recent days and Mr Dougall said he felt lucky his daughter had bought her home on rather high ground.\n“Unlike many in Townsville, my daughter’s home is not on low ground, so it took only about 60cm of water rather than several metres,” he said. \nStill, the water that had entered her house was mixed with affluent and had damaged power points and furniture.\n“The rain and wind started to die down, so my daughter could head back to the house to check the damage. You could say that, unlike others, Ilona  is lucky that she maintained her home insurance, which means she is covered for the damages,” Mr Dougall said.\nThe Insurance Council of Australia said on Monday it had revised upwards its estimate of insurance losses. This was now put at about €29 million, involving some 3,500 claims.\nThe council expects that figure to rise significantly as people return to their homes. This has been occurring gradually throughout the week, although the authorities insist many homes are still unsafe.\nSome banks have even suspended home loan repayments for three months for those im-pacted by the floods and had to make emergency works.\nWaiting to hear from his daughter, with whom he has maintained contact through online messaging apps, Mr Dougall said the whole experience of watching the news and seeing an entire suburb underwater was “quite surreal”.\n“I’m just happy she is safe. Now it is a matter of taking it day by day,” he said.", "comment_count": 1, "id": 87}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta reports that the Al Shabaab killing of a Maltese port manager in Somalia was not typical of the terrorist group and pointed to economic, rather than political, motives, according to regional experts.\nThe Malta Independent says former minister George Vella has not denied being approached to become the next President of Malta. It also reports that the Gozo channel will be for cars, not rail. \nIn-Nazzjon says the PN has made proposals to facilitate the transfer of title of agricultural land. The newspaper also gives prominence to another assault on a teacher. \nl-orizzont in its lead focuses on cancer research being carried out in Malta. In its second story, it says 20 gaming companies are planning to operate from Malta.  ", "comment_count": 0, "id": 88}, {"keywords": "", "author": "", "article_body": "A 56-year-old man from St Julians was rushed to hospital on Tuesday evening after he was involved in a car crash on the Santa Venera bypass. \nPolice said a 26-year-old Indian man who lives in Siġġiewi was driving a Peugeot Viper that crashed into a Mitsubishi L200 that was being driven by the 56-year-old Maltese driver.  The accident happened at around 6.30pm. \nThe victim's condition is not yet known.   ", "comment_count": 0, "id": 89}, {"keywords": "", "author": "Jacob Borg", "article_body": "A probe by the Auditor General into alleged irregularities in the issuing of visas to Algerians was hampered by certain historical data held by the Foreign Ministry being “purged”. \nThe probe sought to establish if there were irregularities in the way Malta’s consul in Algeria issued visas in 2014 and 2015. \nIn a report published last week, the Auditor General found that comparisons with Algerian visa data from 2010 to 2013 held by the Foreign Ministry could not be made, as the data had been “purged”. \nPrior to Malta establishing a consulate in 2014, applications were processed through a representation agreement with France. \nThe National Audit Office (NAO) said the Foreign Ministry’s failure to retain this data was “extremely anomalous”, more so when the data should have served as a basis for the government’s decision to establish a consular presence in Algeria. \nThe NAO said the “ambiguity” in failing to keep the data was further accentuated when one considers that data for 2008 and 2009 was retained. \n“Even if data retention for these years was not required in terms of regulatory compliance, the Office is of the understanding that such information was essential in terms of operational considerations,” the NAO said. \nIn a statement reacting to the report, the Nationalist Party said the report confirmed that it was an “unexplained decision by Castille” in 2013, which led to the setting up the consulate, at a time when the consul was the Prime Minister’s cousin. \nThe NAO’s analysis found that 484 of the 6,779, visas issued between March 2014 and September 2015, were not recommended for approval by the immigration police, yet the visas were subsequently approved by the consul. \nPolice recommended these visas for refusal because the applicants’ intentions to leave EU territory before the expiry of their visa could not be ascertained and justification for the purpose and conditions of the intended stay was not provided, the report said. \nConversely, it was also discovered that there were 865 applications where the police posted no adverse remarks yet the consul refused the issuance of a visa. \nMalta mentioned in alerts issued by Frontex about possible illegal immigration\nWhen requested to comment by the NAO, the consul maintained that the decision was ultimately his responsibility yet acknowledged the instances of “incongruence”. \nThe consul told the NAO that the frequencies of divergence between the police’s recommendations and his actions lessened with time. \nIn the report, the NAO acknowledged that the consul’s decision was final and not determined by the police recommendation. \nIt also noted the competing interests that the consul was to consider in attempting to balance national security, commercial considerations and bilateral relations when coming to the granting or otherwise of visas. \nE-mail correspondence obtained by the NAO led auditors to “note” that the consul initially lacked the necessary experience for the running of a Consulate. \nAnother limitation noted by the NAO related to difficulties experienced by the consul in view of his “limited knowledge” of languages spoken in Algeria. \n“In this regard, this Office traced correspondence wherein the consul requested the LEP [locally engaged person] to translate e-mails from French to English,” the NAO said. \nThe report also revealed that Malta was mentioned in two alerts issued by Frontex about the possible illegal immigration of Algerian nationals and Maltese visas obtained fraudulently in Algiers.\nAccording to the Frontex alerts, Algerian women and children were departing Algiers with a transit through Marseille in France to the final destination in Malta. \nHowever, their intention was to stay in the EU territory, possibly France, given that at times they only had tickets to Marseille and without money to justify their stay as tourists in Malta. \nThe NAO said in its concluding remarks that the investigation of alleged payments to government officials for preferential treatment in the obtaining of visas did not fall within its remit.", "comment_count": 25, "id": 90}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat’s own political family at the European Parliament has taken aim at tax systems like Malta’s which allow foreign-owned companies to legally reduce their tax burden.\nIn a policy document launched ahead of the European Parliament elections in May, the Socialists and Democrats (S&D) are proposing a minimum effective tax rate of 18% on corporate profits.\nWhile Malta’s headline corporate tax rate is 35%, foreign-owned companies can apply for refunds which can potentially reduce their tax burden to just 5%.\nWithout naming specific countries, the S&D fair tax report notes that tax havens are no longer only “palm-fringed islands with zero taxes”.\n“As shown once again in Paradise Papers, the most recent leak from the ICIJ, companies and individuals are able to exploit the differences between national tax systems to reduce their overall tax contributions,” the report says.\nThis is not the first time that the S&D has taken aim at Malta’s tax system.\nIn December 2017, the country narrowly avoided being labelled as a tax haven upon a proposal by the S&D in a report about the Panama Papers drawn up by the European Parliament.\nMalta still retains veto power over these proposals\nThe Socialists and Democrats’ ambitious policy document also calls for the removal of the unanimity in council required on certain tax issues to ensure that “no single member state can veto much needed tax reform to its own benefit”.\nReplying to questions by Times of Malta, Labour MEPs Alfred Sant and Miriam Dalli expressed their opposition to the socialists’ proposals.\n“As my colleagues at S&D well know, I am completely against the ideas that have been launched in the S&D ‘fair tax’ study that they have commissioned and just published,” Dr Sant said.\n“My position is well known inside the group and outside it. Were I a French or German MEP, I would have perhaps been in favour. But as a Maltese MEP I am definitely against the proposals being made.\n“I fully agree that there should be full transparency in tax matters across Europe and that tough and reasonable steps should be taken to ensure that all taxes due are being paid in the jurisdictions where they fall due.”\nDr Dalli expressed her belief that taxation should remain the full competence of member states.\n“As an MEP, I have defended and will continue to defend forcefully the need for unanimity on all decisions related to tax. The Maltese electorate can also rest assured that, if re-elected, I will strongly oppose all proposals that can hinder Malta’s competitiveness.\n“Our tax system, which does not promote secrecy in any way, is a system that works and fully compliant with EU current rules and I will continue to promote it in all fora that I am and will be participant,” she said.\nQuestions sent to MEP Marlene Mizzi, who is not seeking re-election, were not answered by the time of writing.\nA Brussels-based source told Times of Malta that although these tax proposals will be one of the main planks on which the S&D platforms during the upcoming elections, the likelihood of their proposals ever being adopted were remote.\n“You need unanimity to change how decisions that need unanimity are taken, so Malta still retains veto power over these proposals,” the source said.\n ", "comment_count": 73, "id": 91}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two of four people granted bail upon his arraignment over their alleged involvement in an arson attack on a vehicle at Mellieħa on Monday had their freedom from preventive arrest confirmed by a superior court.\nJoel Falzon, 23, from Safi, had been arrested and arraigned last week alongside Paul Farrugia, a 28-year-old Siġġiewi resident, together with siblings Danica and Silvan Cilia, 22 and 20, from Rabat, after leading the police on a movie-like car chase that followed an arson attack on a vehicle at Selmun.\nAll four had been granted bail against a deposit of €1,000 and a €10,000 personal guarantee each, under orders to sign the bail book and abide by a curfew.\nThe Attorney General filed a request before the Criminal Court asking for bail to be revoked in respect of Mr Falzon, in view of the fact that proceedings were still at an early stage, there was a real risk of tampering with evidence and the accused failed to satisfy the legal requisites for bail.\nDefence lawyer Joseph Giglio, however, countered that the facts of the case had not been contested with his client admitting to most of the charges. Moreover, the magisterial inquiry guaranteed the preservation of evidence, eliminating the risk of tampering.\nWhen delivering its decree on Monday, the court, presided over by Madam Justice Edwina Grima, declared that there was no reason for varying the discretion exercised by the Magistrates’ Court which had imposed stringent bail conditions.\nMoreover, so far, the accused appeared to have been abiding by the set conditions, the Court observed, adding that pending contestations were to be resolved on the basis of court expert reports and the testimony of police witnesses.\nFor these reasons, the court turned down the AG’s request, declaring that bail was not to be revoked.\nIn a separate decree, Mr Farrugia also had his bail confirmed by the Criminal Court.", "comment_count": 0, "id": 92}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An air passenger heading out to Sudan on Monday morning was stopped and taken to court on Tuesday for having €502 above the maximum €10,000 limit allowed by law in his possession.\nEritrean national Haji Mehamednur Salih, 42, who lives in Ħamrun, admitted to the breach of cash control regulations, landing a fine of €2,625, the statutory 25% fine calculated upon the total sum.\nThe excess amount of €502, consisting of €415 and US$100, was also confiscated in favour of the State coffers.\nAssisted by an interpreter, the accused signalled his wish to pay part of the fine today, settling the remaining balance at a later date.\nHowever, the court, presided over by magistrate Claire Stafrace Zammit, informed the man that he was to settle the full amount immediately, forking the money out of the €10,000 which had already been returned to him, as attested by customs officers who were present in court.\nInspector Lianne Bonello prosecuted. Lawyer Christopher Chircop was legal aid counsel.", "comment_count": 0, "id": 93}, {"keywords": "", "author": "", "article_body": "A student and school official got into a fight at the St Ignatius College secondary school in Qormi today, with the police eventually having to intervene. \nThe police told Times of Malta they had been informed at around 11.30am that a fight had broken out between a school official and a 15-year-old female Maltese student. \nNo one was injured or arrested, but police said they had questioned both the student and the official involved.\nThis is the second such incident in as many days. \nPolice on Monday had to intervene after a fight between two students, a Maltese and a Libyan, at St Clare’s College in Pembroke, escalated.\nA 15-year-old boy was hospitalised as a result of Monday's incident.\nIn a statement on Tuesday the Nationalist Party urged the government to take steps to ensure schools were safe for students, teachers and other staff.  ", "comment_count": 59, "id": 94}, {"keywords": "", "author": "", "article_body": "A three-year project seeking to reduce food waste was launched Tuesday as part of the EU Life Foster project.\nThe project, a collaboration between the Malta Business Bureau and the Institute for Tourism Studies, will see professionals attending seminars on waste management and will educate trainee chefs, kitchen staff and front-of house restaurant personnel. \nWorkshops will also be held to target restaurant staff and owners, the Malta Business Bureau said in a statement.\n\"The project focuses mainly on training and prevention,\" ITS corporate services director Claire Briffa said. \"ITS will identify lecturers who will attend food waste management training in Italy, being trained in methods of food waste reduction in restaurant environments,\" she added.\nThe project will culminate in a food waste 'hackathon' in the final year, where three ITS students will compete against students of the other partner countries in designing and cooking the most food-efficient menu.\n“Food waste is a challenging environmental topic which also very tangibly affects businesses’ bottom line,\" MBB President Simon De Cesare said.\n\"The capacity building element of this project leaves us very hopeful that not only can we support Malta’s achievements in food waste reduction, but also contribute to the continuous professional development of Malta’s largest economic sector, the hospitality industry,\" he added.\n ", "comment_count": 8, "id": 95}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two warring neighbours, whose differences erupted into a full blown argument on Sunday following the untimely sounding of an air horn were let out on bail after claiming to have forgiven each other in open court.\nAntoine Galea, 23, and Edward Buhagiar, 37, both residing at the same Żabbar street, sat at the far ends of the bench throughout their arraignment on Tuesday afternoon while the prosecution shed light upon the circumstances which led to Sunday’s events.\nIt all began when Mr Buhagiar was apparently rudely woken up by the unwelcome sound of an air horn emanating from his neighbour’s direction, soon prompting a verbal slinging match between the two men.\nMatters escalated when, some time later, the two met on the street. Mr Buhagiar drove his BMW at his neighbour, who was riding his motorbike at the time.\nThe court heard how Mr Buhagiar ended up slightly injured while his son suffered a grievous injury after being punched on the nose by Mr Galea.\nThe families appear to have long been at loggerheads, prosecuting Inspector Eman Hayman explained, referring to a court order imposed upon Mr Buhagiar 10 years ago, barring him from approaching Mr Galea’s father.\nMr Galea was charged with grievously injuring Mr Buhagiar’s son, slighly injuring Mr Buhagiar.\nHis neighbour was charged with attempting to grievously injur Mr Galea, driving recklessly and dangerously, slightly injuring Mr Galea.\nBoth men were charged with breaching the peace and swearing in public.\nHowever, when the two neighbours were taken to court on Tuesday after having spent two days under preventive arrest, the court, presided over by magistrate Claire Stafrace Zammit, was informed by defence lawyers Jason Grima and Graziella Attard that their clients had forgiven each other and were openly agreeing not to testify against each other.\nNonetheless, in view of certain charges being prosecutable ex officio by the police, irrespective of the forgiveness by the injured party, a request for bail was made, defence lawyers pointing out that they had sought to calm matters in an attempt to restore neighbourly relations.\nIn view of the circumstances of the case, the court upheld the request, granting bail against a deposit of €300, a personal guarantee of €5,000 and a duty to sign the bail book twice a week, though on different dates, while also abiding by a curfew.", "comment_count": 0, "id": 96}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 6.20pm, adds government's reaction\n“Restrictive” new rules on the transfer of agricultural leases (qbiela) should be amended to better support farmers and ensure the sector’s sustainability, the Nationalist Party said on Tuesday.\nOpposition MPs said they would move amendments to a legal notice introduced last December, and which they argue brought about unnecessary levels of bureaucracy and obstacles for farmers working government-owned land.\nMP Marthese Portelli told a press conference on Tuesday that while both parties had agreed on the need to ease the transfer of agricultural leases between farmers, the government’s legal notice did not achieve that aim.\nThe PN is proposing the removal of a new restriction on transferring land which is within the development zone and on which there is already a building of more than 40 square metres.\nIt is also calling for the definition of a family member to be extended to include siblings and nephews or nieces, as well as for the definition of a “farmer” to include registration with the Agriculture Department.\nMoreover, the MPs call for a provision allowing the government to grant agricultural land to anyone who has completed an academic course in agricultural studies to be extended from five to 10 years.\nThey also call for the introduction of a right of appeal for individuals judged by the authorities not to be bona fide farmers, and therefore barred from transfers.\nMP Edwin Vassallo said the new regulations opened the door to land speculation by creating obstacles for genuine farmers interested in retaining the land for agricultural use.\nThe existing checks and balances, he said, were already sufficient to prevent abuse, and that the PN was proposing to control be put into the hands of the Agriculture Department, which best understood the sector.\nHe added that government land should no longer be placed on the market by tender, arguing that farmers could not manage the related expenses while developers could.\nThe motion was also signed by MPs Ryan Callus, Robert Cutajar, Toni Bezzina and Karol Aquilina.\nGovernment's reaction\nIn a statement, the government said the Opposition was acknowledging that the challenge of agricultural land transfer has been an issue for several years and action was never taken.\nIt was this Government that listened to and understood farmers and was now fully addressing this issue.\nThis confirmed that the publication of the national agricultural strategy in 2018 was an important decision for the sustainability of the sector.\nIt looked forward to the Parliamentary debate to continue illustrating the benefits of the legal notice.\nThe government remained committed to continue to improve conditions for Maltese and Gozitan farmers. ", "comment_count": 11, "id": 97}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Grand Harbour Regeneration Corporation has issued a tender asking for the removal of 13 mature trees from along the fortifications at Marsamxett – but the entity has promised that its refurbishment project would eventually result in more being planted.\nGHRC is upgrading the pavement along the bastion side of Marsamxett and St Sebastian roads in Valletta over the coming months, as part of the regeneration of Valletta.\nThe trees are described in the tender as being between four and five metres. They run along the fortifications leading up to the gun post. The tender, which was issued recently, closes on February 11 and rather chillingly asks for quotes to include “the removal, felling and stump grinding” of the trees.\nEnvironmentalists have been vociferously objecting to the sacrificing of trees for various road extensions and projects. But the GHRC insists that before the tender was issued, it had consulted experts and acquired a permit from the Environment and Resources Authority for the works.\nIt also said that by the end of the project, overall more trees would stand than before, having a new irrigation system and new tree grilles.\n“Of the existing 54 olive trees, 11 will be transplanted to Hastings Garden together with three tamarisk trees, as per an agreement with the Valletta council,” a spokesman for GHRC told Times of Malta.\n“The 11 olive trees were earmarked specifically because they have been felled in the past and have grown outwards – making pedestrian flow difficult,” it said, adding that 11 trees, mainly alien species – not 13 as specified in the tender – would be removed.\nThe ERA regulations say that any tree lost must be ‘compensated for’. The GHRC said that 12 new Judas trees and 18 tamarisk trees would be placed there – but in new planters, rather than in the pavement itself, complete with a new irrigation system.\n“Species were selected which are suitable for such a harsh environment. These species are both indigenous and have an added benefit of having a limited root structure so as to limit inconvenience,” it added.\n“The new tree pits have also been designed of suitable size and with a specific root barrier to preserve integrity of both bastions and road.”\nThe project will take one week from start to finish.", "comment_count": 45, "id": 98}, {"keywords": "", "author": "Anthony Manduca", "article_body": "Tunisian President Beji Caid Essebsi arrived in Malta on Tuesday on a two-day State visit. He talks to Anthony Manduca about a wide range of issues, including Maltese-Tunisian bilateral relations, migration and the situation in Libya.\nTunisian President Beji Caid Essebsi is hopeful his visit to Malta will give a new impetus to the “excellent” bilateral relations between the two countries.\nHe points to the 2005 Treaty of Friendship, Good Neighbourhood and Cooperation between the two countries and says the already strong bilateral legal framework should be strengthened, particularly in the areas of early childhood, the elderly, culture and employment.\n“Indeed, due to the growing need in Malta for foreign labour, we think there is a niche of opportunities for the Maltese private sector for the recruitment of skilled and qualified Tunisian youths,” he says with reference to the recent declaration by the JobsPlus chairman that Malta will need another 13,000 foreigners this year if it is to maintain its economic growth.\nPresident Essebsi says he looked forward to addressing the third Tunisian-Maltese Business Forum.\n“We have huge opportunities to enhance trade between our two partner countries, which still remains below potential. In this regard I would like to highlight the quality and resilience of Maltese foreign direct investment in Tunisia and we invite Maltese companies to strengthen their presence in Tunisia in sectors that interest them, taking advantage of our proximity, both geographical and cultural, as well as the multiple financial and fiscal incentives offered.\n“The Tunisian market could serve as a platform for Maltese companies to access other markets in the region as well as African regional groupings, particularly COMESA [Common Market for Eastern and Southern Africa, a free trade area with 21 Member States], of which Tunisia became a full member in July 2018, as well as the African Continental Free Trade Area [a planned free trade area among 49 of the 55 African Union nations],” he says.\nHe also says his visit will highlight the role that Malta, an EU member, can play in supporting Tunisia’s positions and bringing Tunisian requests to the EU and its institutions to a successful conclusion.\nHow concerned is he about the situation in Libya?\n“Tunisia has always called for better dialogue on the situation in Libya. We reaffirm Tunisia’s concern not to interfere in the internal affairs of Libya and to keep equidistant from the various Libyan actors. This forms the basis of our contacts with our Libyan brothers and sisters and of the Tunisian initiative for the settlement of the crisis in Libya, to which Algeria and Egypt have joined.\n“In this regard Tunisia and neighbouring countries are content to facilitate dialogue and encourage the Libyan people, in collaboration with the United Nations, to sit down at the negotiating table to end the crisis that is shaking the country and to the implementation of the political process.\n“The stability of Libya is sine qua non for the stability of Tunisia,” he stresses.\nHe describes what is happening in the Mediterranean vis-à-vis migration as “a real tragedy”. \n“Thousands of lives lost in the waters of our Mare Nostrum is not acceptable and we border countries and beyond have a role to play is tackling this issue.”\nPresident Essebsi says Tunisia is making a great effort to combat illegal migration and to protect and control its land and sea borders.\n“A tremendous effort by the security apparatus is deployed to prevent the departure of makeshift boats. The efforts of the security forces have made it possible to frustrate several attempts at illegal emigration and to arrest several inter-mediaries and members of trafficking networks.”\nHe says that an important law was passed in Tunisia specifically aimed at preventing the trafficking of persons and a National Anti-Trafficking Body has been set up within the Ministry of Justice.\nTunisia, the President says, believes that migration needs to be addressed as part of a comprehensive approach that tackles the root causes of irregular migration and focuses, in particular, on the development of regions with high migration potential.\nWe think there is a niche for the Maltese private sector for the recruitment of skilled and qualified Tunisian youths\n“We should be guided by the need of solidarity with the countries of origin,” he says, adding that this should be combined with making more of an effort at stabilising Libya and facilitating a political settlement under the aegis of the UN.\nAsked why Tunisia is the only success story of the Arab Spring, and how feasible is it for democracy and real political reform to spread to other Arab countries, President Essebsi replies: “There is no such thing as an ‘Arab Spring!’ There could be a beginning of a Tunisian Spring in the aftermath of January 11, 2011.”\nHe adds: “We in Tunisia have the irrevocable political will to continue on the road to democracy and the establishment of constitutional institutions guaranteeing fundamental freedoms and the rule of law, but we have no intention to export this experience to anywhere else in the world. Those who are interested are most welcome to look at our achievements.”\nTunisia has progressed well politically but still faces a number of challenges on the economic front. Does he believe the international community can do more to help Tunisia’s economy?\n“Our major challenges, for which we are called upon to provide urgent solutions, include unemployment, especially young graduates, regional socio-economic imbalances, social demands as well as security challenges. In this ‘Global Village’ nobody is able independently to find the proper solution, and looking at what could be the consequences of Tunisia failing on the way to its transition, I do believe there is much at stake for the international community in enhancing its commitments to my country.”\nAlthough the security situation since the 2015 terror attacks seems to have improved, Tunisia still faces attacks from Islamist militants and Isis-affiliated groups. Is Tunisia capable of defeating these terrorists?\n“Yes we are. I am reinforced in my conviction by the many successes we have achieved thanks to the unwavering commitment of our security forces,” he says.\n“Violence, obscurantism and extremism are all plagues we must fight together, and we must be more vigilant so that our younger generations are not attracted to radicalism. Hence the need for the implementation of a preventive approach.\n“Tunisia has adopted a national strategy, an organic law that led to the creation of a National Commission for the Prevention and Fight against Violent Extremism and Terrorism. An action plan is being developed.”\nRegarding Tunisia’s position on Syria and whether there can be a future for the country with Bashar al-Assad as President, Mr Essebsi says his country’s position is based on the principle of giving the highest priority to the preservation of the Syrian State and the security and stability of its people.\n“The way to achieve all this is an urgent and comprehensive political settlement that brings together all factions and components of the Syrian people except terrorist groups,” he says.\n“Our country supports the political negotiations aimed at finding a way out of the crisis away from bias towards any party as the regime in Syria remains an internal sovereign matter for the Syrian people.\n“The Tunisian diplomacy’s priority is currently to focus on continuing efforts in various regional and international fora to push for a political settlement in this brotherly country.”\nBeji Caid Essebsi is the founder of the Nidaa Tounes (Call of Tunisia) political party, a secular centrist party which won a plurality of seats in the October 2014 parliamentary election.\nIn December 2014, he won the first regular presidential election following the Tunisian Revolution, becoming Tunisia’s first freely and directly elected president. The Tunisian President is directly responsible for foreign and defence policy.\nMr Essebsi previously served as Foreign Minister from 1981 to 1986 and as Prime Minister from February 2011 to December 2011.", "comment_count": 7, "id": 99}]