[{"keywords": "", "author": "Edwina Brincat", "article_body": "Two judicial acts were filed on Tuesday afternoon by Repubblika, following upon Monday’s first hearing in the case instituted by the civil society organisation against the Prime Minister and the Justice Minister, explaining why it was requesting a preliminary reference to the European Court of Justice.\nDrawing parallels with a similar scenario in Poland, the applicants pointed out that the discretion exercised by the Maltese Prime Minister, who held the final say in the appointment of members of the judiciary, was even more dangerous than that exercised by the Polish President.\nWhereas the latter was a constitutional figurehead with limited powers, the Maltese Prime Minister was effectively the head of the executive and the government of the day.\nReference was made to recent judicial reforms in Poland lowering the age of retirement of members of the Supreme Court from 70 to 65, thereby automatically landing one-third of the judges on the way out, unless granted an extension of their term by the President who exercised sole discretion in this regard.\nThe discretion exercised by the Prime Minister when appointing members of the judiciary was “more extensive and hence problematic,” the applicants argued, citing the opinion of Advocate General Tanchev in Commission vs Poland who declared that “Appearances are of a certain importance, so that ‘justice must not only be done, it must also be seen to be done.’ What is at stake is the confidence which courts in a democratic society must inspire in the public.”\nWithin the short lapse of six years, the PM had appointed 23 judges and magistrates, half of the current full judicial complement, six of which, meaning 13% of the total number, in one day, namely last Thursday.\nMoreover, certain elevations of magistrates to judges “cast serious doubts” upon the exercise of such discretion, the applicants continued, mentioning three specific instances.\nThe first was the magistrate tasked with investigating the murder of Daphne Caruana Galizia, whose task had to be handed over to another magistrate, upon his promotion.\nThe second promotion was that of the magistrate who, less than a year ago, had conducted the inquiry against the Prime Minister himself.\nThe third instance concerned a magistrate who was soon expected to decide whether or not Karl Cini was to testify under oath about “the alleged involvement in corruption by the Prime Minister’s chief of staff”.\nSuch hasty appointments, “defying the recommendations of the Venice Commission” indicated “bad faith” on the part of the Prime Minister who appointed 13 per cent of the judiciary all in one go, the applicants continued.\nWhilst acknowledging that the recommendations of the Venice Commission were not binding upon the State, they doubtlessly constituted “an authoritative and weighty opinion”.\nAs for the respondents’ plea that the applicants lacked juridical interest, the applicants countered that “this seemed to have become an easy escape route adopted by the Attorney General in Malta to shrug off State responsibility in cases involving fundamental rights,” as was the case in question.\nIn the light of such scenario, Repubblika was making a three-fold request: that the First Hall, Civil Court was to make a reference for a preliminary ruling by the ECJ; that this was to be handled with urgency; and to provide for interim measures until the ECJ ruling.\nThe reference was to focus upon whether the Prime Minister’s discretion breached the principle of independence of the judiciary; whether the Maltese courts were to declare such system as irregular and order its suspension pending change; to declare appointments made under current system as null and void; and, finally, that future appointments be blocked until a final decision on the merits of this case was taken.\nThe second act rebutted eight preliminary pleas raised by the respondents, with further oral arguments saved for the next hearing on Monday.\n \nThe two judicial acts were signed by lawyers Simon Busuttil and Jason Azzopardi.", "comment_count": 0, "id": 2819}, {"keywords": "", "author": "", "article_body": "Updated 9.25pm, adds owner's reaction\nA large quantity of tuna and other fish believed to be ready for sale on the black market have been seized by the health authorities following a raid at a location in Żabbar.\nThe fish, which is believed to be worth thousands of euros, were missing vital traceability documents which certify their origin. Some of the fish was also being stored in a room which does not meet environmental health standards.\nSources told Times of Malta that the haul ran to around 1,200 kilogrammes. \nThe owner is, however, arguing, that there was nothing irregular with the consignment.\nRaids of the location in Żabbar’s Ta’ Maġġi industrial zone took place over the past days and involved officers from the Department of Fisheries and Aquaculture with the involvement of the Directorate of Veterinary Regulations and the Directorate of Environmental Health.\nIn a statement, authorities said that the fish and tuna were sealed and confiscated and that the investigation was expected to continue in the coming days.\nRepresenting the owner, lawyer Franco Debono said his client had acquired the fish legally and would be providing the authorities with the relevant relative receipts and documentation.\nMoreover, the authorities were fully aware, that he had been waiting for clearance from the department for the consignment to be destroyed.\nThe seizure comes as Malta’s fishing enforcement is under scrutiny, following a high-profile court case in Spain in which prosecutors alleged that corruption in that country’s tuna farming sector stretched across the Mediterranean to Malta’s fisheries department.\nThe head of that department was suspended and replaced after Spanish media released transcripts of phone conversations in which she allegedly demanded payment from a major player in the sector. \nSources had subsequently told Times of Malta that those claims were \"just the tip of the iceberg\". \nTwo inquiries into the sector are currently under way. \n ", "comment_count": 30, "id": 2820}, {"keywords": "", "author": "", "article_body": "Five men have been arrested after they were found in possession of drugs upon their arrival from a flight from Luton. \nThe police said the men, all British, aged between 21 and 27, were found in possession of ketamine, MDMA and cocaine.\nSome of them are expected to be arraigned in the coming hours charged with the importation and aggravated possession of drugs.\nAn inquiry is being held.\nPolice investigations are continuing.", "comment_count": 4, "id": 2821}, {"keywords": "", "author": "Jacob Borg", "article_body": "Wild rabbits look set for more protection and the palm weevil’s days could be numbered, judging by a “confidential” agenda left lying in plain view during the initial minutes of a Cabinet meeting on Tuesday morning.\nThe government has taken to holding Cabinet meetings in various localities every few months as part of an initiatives to bring decision-making closer to the public.\nClint Camilleri, the parliamentary secretary for farming, looked to have been a busy man on Tuesday, as he spearheaded discussions on saving the wild rabbits, keeping the palm weevil in check and controlling xylella fastidiosa, a bacteria that attacks plants.\nThe detox centre near St Luke’s hospital appears to be on the move as its relocation was the fourth item on Tuesday's agenda.\nPrior to that, ministers discussed progress about (unspecified) expressions of interest.\nThe Xrobb l-Għaġin Temple could be in a spot of bother as “rescue excavations” are needed, according to the Cabinet agenda.\nThe meeting agenda shed light on ministers' workload. Photo: Chris Sant Fournier\nAs the meeting progressed, ministers were spied nipping out for a toilet and coffee break.\nThe coffee would have held them in good stead for the final part of the Cabinet meeting, which discussed Lifts (amendments regulations 2019 and inspection of lifts) and amendments to the Occupational Health and Safety Act 2000.\nFinance Minister Edward Scicluna closed the meeting with a 2019-2020 budgetary projections update.\nSadly, the Times of Malta has no information about the “other affairs” discussed at the very end of the meeting.", "comment_count": 4, "id": 2822}, {"keywords": "", "author": "", "article_body": "A 79-year-old woman from Ħamrun was grievously injured on Tuesday when she was hit by a car in Marsa.\nThe police said the accident happened in Triq Qormi at 1pm.\nThe woman was hit by a Citroen that was being driven by a 43-year-old man from Ħamrun. The victim was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2823}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "What Jeffrey Pullicino Orlando did in his private life was not in the public interest provided that it did not affect his public role, a court ruled on Tuesday in case concerning photos published by Daphne Caruana Galizia.\nAn appeals court confirmed a decision by the Information and Data Protection Appeals Tribunal, that news reports purely intended to satisfy the curiosity of people who thirsted for details of a person’s private life did not qualify as matters of public interest and could not be afforded protection under a claim of freedom of expression.\nDr Pullicino Orlando, a former Nationalist MP who currently chairs the Malta Council of Science and Technology, had filed the case against Ms Caruana Galizia, claiming that five images about his private life which the late journalist had published on her blog Running Commentary breached data protection laws.\nThe images were included in six blog posts Ms Caruana Galizia uploaded between 2010 and 2016 when Dr Pullicino Orlando had been dining out at a St Paul’s Bay restaurant, signing a deed at a notarial office, accompanying his girlfriend on a Valentine’s trip to Sicily, travelling with the same girlfriend to London and Sicily and also attending a local song contest.\nWatch: 'Very few mourn her', Pullicino Orlando says of Caruana Galizia\nDr Pullicino Orlando’s original complaint had been rejected by the Information and Data Protection Commissioner, who had concluded that he was “a public person and the reported activities did not happen in a secluded place which is exclusively available to the data subject.”\nPublication impacted 'right to privacy'\nFurthermore, “the blog posts did not reveal or expose any pieces of personal data which the general public could have never become aware of,” the Commissioner had declared, while acknowledging that the publications could “affect the data subject’s right to privacy”.\nThe former MP had appealed to the Information and Data Protection Appeals Tribunal, which overturned the earlier decision and sent the case back to the Commissioner, who must now act on that decision.\nThe tribunal had concluded that “the information published by the blogger was a mere curiosity and nothing more,” pointing out that what Dr Pullicino Orlando did in his private life was not in the public interest, since it did not impinge upon his public role.\nAll the activities captured in the photos were not public information but mere curiosities, and reporting them was not safeguarded under the Data Protection Act nor the Press Act.\nReporting the activities could also not be safeguarded under the right to freedom of expression, the court, presided over by Mr Justice Anthony Ellul, declared, adding that a balance had to be struck between this right and the right to privacy.\nCiting from a judgment by the ECHR in Falzon vs Malta, it was stated that “A fundamental distinction needs to be made between reporting details of the private life of an individual and reporting facts capable of contributing to a debate in a democratic society – relating to politicians in the exercise of their official functions.”In this case, the blog posts amounted to mere gossip of interest to those who had nothing better to do and who thirsted for news about the private affairs of others, the Court said, concluding “without hesitation” that such news were not matters of public interest.", "comment_count": 0, "id": 2824}, {"keywords": "", "author": "", "article_body": "A 30-year-old man from Pietà was hospitalised on Tuesday after he was involved in a traffic collision in his hometown.\nThe police said the man was riding a motorbike that collided with a car.  The accident took place just outside Appoġġ offices in Gwardamanġa, limits of Pietà.\nNo information about the victim's medical condition was available at the time of writing. The police said they are investigating further ", "comment_count": 0, "id": 2825}, {"keywords": "", "author": "Keith Micallef", "article_body": "A €5 million rehabilitation of Chadwick Lakes will begin in the coming weeks, with the project expected to take two years to complete.\nNamed after British engineer Sir Osbert Chadwick, who designed most of the existing water dams dating back to the end the 19th century, this popular spot  at Wied il-Qlejgħa, limits of Rabat has been left neglected for decades.\nDetails about the rehabilitation project, which is being managed by the Energy and Water Agency and was first announced in January, were revealed on Tuesday afternoon in a news conference.\nWhat will works involve?\nWorks will include restoring existing dams' storage capacity and removing debris and silt deposits which have accumulated over the years.\nBanks and retaining walls will be rebuilt in an environmentally-friendly manner, while intrusive development such as a playground in the valley bed, constructed during the 1990s, will be removed.\nHow will the project help the area?\nEnergy and Water Agency CEO Manuel Sapiano noted that a number of studies had already been carried out as part of the permitting process. The project aims to cleanse the valley of various invasive flora, so that endemic species can flourish in the long term.\nMr Sapiano pointed out that the benefits of having rainwater dams was currently lost, as most were full of silt, thus reducing the overall capacity.\nHe added that the project would also restore access to the inner part of the valley, while insisting that all of these works would be carried out within the existing footprint.\n“Our objective is to tap EU funds for the continuous maintenance of the Chadwick Lakes as it would be pointless rehabilitating and allow it to fall in a state of neglect once again,” he said.\nAccess to parts of the valley will be closed during the works.\nEU funds Parliamentary Secretary Aaron Farrugia noted that this project was partly financed through the European Regional Development Funds and was part of government’s efforts to upgrade recreational facilities.\nOn his part Energy Minister Joe Mizzi noted that this project would contribute to less extraction of water from the aquifer, as farmers would be able to make better use of the rainwater dams.", "comment_count": 12, "id": 2826}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat on Tuesday declined to say if he had ever asked his top aide and close friend Keith Schembri what his plans for 17 Black were.\nSpeaking to the media, Dr Muscat said that was a question for an inquiry to ask, and not simply something to ask out of curiosity.\nDr Muscat has kept Mr Schembri by his side ever since the Panama Papers scandal broke in 2016. The massive data leak revealed Mr Schembri’s 2015 plans to receive large payments using complex offshore structures that disguised his financial interests in them.\nDubai-based company 17 Black was mentioned in a leaked e-mail as being one of two companies that would feed up to $2 million into Mr Schembri’s secret offshore holdings.\nSince 2016, Mr Schembri has always maintained that the money from his offshore holdings was going to come from his business earnings before taking office.\nHe only volunteered that he had “draft business plans” with 17 Black in April 2018, and only after the Daphne Project revealed the e-mail link between the Dubai company and his Panama company.\nA joint investigation by the Times of Malta and Reuters would later reveal that 17 Black was owned by power station investor Yorgen Fenech.\nMr Schembri claims not to know that 17 Black was owned by the Tumas Group CEO.\nTourism Minister Konrad Mizzi, whose Panama firm was mentioned in the same e-mail as a potential beneficiary of funds from 17 Black, also claims not to know who was behind the company.\nExplainer: The roadmap to 17 Black\nThe Prime Minister said on Tuesday that nothing had changed in Mr Schembri’s regard.\nHe said the points raised by former Opposition leader Simon Busuttil in a request for an inquiry overlapped with another inquiry that was already ongoing.\nA court on Monday ordered evidence from the Panama Papers scandal to be preserved, saying that a crime may have been committed by Mr Schembri and Dr Mizzi.\nDr Muscat said that if nothing else, Monday's court decision confirmed that an inquiry was already ongoing.\nApart from the 17 Black inquiry, the Prime Minister’s top aide is also facing two other separate inquiry about money-laundering.\nThose inquiries have been ongoing for two years.\njacob.borg@timesofmalta.com", "comment_count": 129, "id": 2827}, {"keywords": "", "author": "", "article_body": "A former police sergeant has been fined €10,000 for leaking police information involving Adrian Delia to Daphne Caruana Galizia. \nA court was told that an investigation was launched by the police after a blog by the late journalist under the headline 'Nationalist Party leadership contender Adrian Delia replies to questions about anonymous report to the police' included a photo of a police report. The blog was uploaded on August 16, 2017.\nAs part of their investigations, the police established who had sought information from PIRS, the National Police System.\nIt was found that then-sergeant Roderick Sammut, stationed at Qormi, had accessed the system four times between June 14 and August 13, 2017, and searched for particulars about Dr Delia.\nTwo screenshots of a police report were discovered among the 'sent' items on the former sergeant's WhatsApp folder, after his mobile phone was examined.\nOne of those pictures was identical to the one posted by Caruana Galizia although it was not determined whether any calls or messages had ever been exchanged between the accused and Ms Caruana Galizia, the court was told.\nService providers asked to report on this had returned a negative reply.\nAn officer from the police IT Department had however confirmed that the computer used to access the report had been located at the Qormi police station.\nMoreover, IT expert Martin Bajada had confirmed that the two screenshots had been on the accused’s mobile, had been “definitely sent” and were “definitely the same” as those on Caruana Galizia's Running Commentary. \nMagistrate Donatella Frendo Dimech, concluded that there was no doubt that it was the accused, and him alone, who had used his mobile phone to take a screenshot of the report and subsequently sent the same image to a third party.\nThe court said it was “immaterial” that the prosecution had not proved that it was the accused who had actually sent the image to the journalist, pointing out further that there was “not the slightest proof” that the accused had needed to access the report in relation to his duties.\nNor was it proved that his phone had been used by someone else or that the accused had leaked his exclusive username and password to someone else.\nEven the times when the accused allegedly accessed the report tallied with expert conclusions, further leading the court to declare him guilty of the unlawful use of the computer data, software or supporting documentation and the disclosure of officially secret material.\n“The accused passed on information to third parties and hence revealed that which ought to have been protected,” thus betraying not merely the trust of the Corps but also of citizens at large.\nAlthough his wrongdoing was liable to a maximum fine of €23,293 or a 4-year jail term or both, in view of the accused’s clean criminal record and “impeccable service” to the Corps, the court fined Mr Sammut €10,000, pointing out that unfortunately, he had shown “no remorse” for this sole transgression.\nThe court also ordered him to pay €1,091 in court expert expenses and ordered the confiscation of his mobile phone.\nInspector Justin Camilleri prosecuted.", "comment_count": 0, "id": 2828}, {"keywords": "", "author": "", "article_body": "A driver made a quick exit when his car caught fire on the Rabat road on Tuesday.\nThe incident happened at about 1.20pm near the junction to San Anton Gardens as the car, a BMW, was being driven towards Rabat.\nThe flames quickly spread all over the car. A fire engine was called to the scene, with firefighters quickly controlling the fire. \n\nThe car was completely burnt by the time firefighters put out the flames.", "comment_count": 1, "id": 2829}, {"keywords": "", "author": "Denise Grech ", "article_body": "Residents of what used to be a quiet street in Mqabba are considering moving out of their homes, having been exhausted by the noise and danger of construction trucks driving through.\n“Our houses shake each time a heavy truck drives by and, since the street has no pavement, we cannot step out of the house for fear a truck will run us over,” one resident said.\nNarrow Triq Valletta has signs that ban heavy vehicles from driving through, and there is a speed limit of 25 kilometres an hour.\nBoth are repeatedly ignored and trucks drive through for hours on end throughout the week.\nThe residents said they repercussions if they speak up. Last week, two facades were defaced with black liquid and residents expressed fears that the vandalism stemmed from complaints they had already made about the situation.\nRead - Vandals attack historic buildings following residents' construction complaints\n“It seems someone is trying to pass on a message, to instil fear but they got the opposite reaction from the public as people have united to support those affected,” Mqabba mayor Charlene Muscat told Times of Malta. \nOne resident said that when he tried to talk sense to a driver he reacted with threats of violence.\nDrivers could easily hit someone walking in the street given the speed at which the trucks are driven, another resident said. “Are we just waiting for another tragedy to happen?”  \nThe trucks have also caused damage to property and cars.\n“The majority of them are breaking around five laws each time they drive through this area – include breaching speed limits and not covering the debris from waste properly,” a resident said.\nResidents also lamented the dust being caused by the trucks is affecting family members who suffer from frequent asthma attacks. \nThe police are investigating the reports of last week’s vandalism.", "comment_count": 34, "id": 2830}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat on Tuesday morning signalled generous pension raises, saying at a rally that what had been given to pensioners so far was nothing compared to what was in store, in the interests of social justice.\nDr Muscat told elderly supporters that his government had already done a lot for pensioners, having raised pensions in successive years and removed tax on income from pensions. Still, he said, more remained to be done.\nSome categories of pensioners, particularly some women, were at risk of poverty, he admitted.\nMore also needed to be done to help elderly people who could not live on their own. The elderly would be helped, as far as possible, to continue to live in their communities. It was in this context that schemes were being set up to provide financial assistance for the provision of carers.\nAll this, however, underlined the need for a strong economy and a healthy surplus. Those who wished to continue to work would be encouraged to do so, but those who opted to retire should have the means to keep up with the cost of living.", "comment_count": 73, "id": 2831}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat said on Tuesday that the government wanted to shift people away from the mentality that social housing was inherited by successive generations.\nSpeaking during a Cabinet meeting, the first part of which was open to the press, Dr Muscat made it clear that this was not aimed at changing the rules for those already in social housing.\nDr Muscat said the idea was to track a person’s means throughout his or her lifetime, and cater for their housing requirements accordingly.\nThe Prime Minister has hinted at a shift in social housing policy in previous years, having said that the culture of entitlement that went with such benefits needed to be done away with.\nMinisters during Tuesday's cabinet meeting. Photo: Chris Sant Fournier\nOn Tuesday, the Prime Minister said one in every three euros of public funds was spent on the social sector. \nAt the same time, the government had managed to decrease the amount of people who were dependent on social benefits, Dr Muscat said.\nDr Muscat said the main aim remained the eradication of poverty. He said those classified as living in property had decreased from 43,000 people in 2013 to 14,000.\nTurning to the rental market, Dr Muscat said the government would help those in need in a manner that did not disrupt the market.", "comment_count": 8, "id": 2832}, {"keywords": "", "author": "Sarah Carabott", "article_body": "When a woman leaves an abusive relationship, she most often ends up with no financial means, a weak CV and a disheartened spirit. \nBut a survivor-run hub, the first of its sort in Malta, will provide the space and support for women to be trained and learn new skills that will hopefully open their door to gainful employment.\nA townhouse in Tarxien is currently going through refurbishment to host, among others, a shop, an industrial kitchen and a clinic for probono and government agency practitioners. The work is already under way, but a further €69,000 is needed to complete the project.\nThe hub will not be a shelter, but more like a day centre providing long-term peer-to-peer support, explained Elaine Compagno, who leads SOAR, a service provided by the Jeanne Antide Foundation.\nShe said that the hub will house a social enterprise, initially involving the making of bath cosmetics and candle products by the women themselves. This will support SOAR’s sustainability, and the foundation will also go for a permaculture approach and grow crops in the house’s garden. \nWomen can contribute much better when they are living, and not just surviving\nThe produce will be given to survivors facing food poverty, who will also be involved in growing the fruit and vegetables. \nThe hub will be spearheaded by a team of trained survivors as SOAR is a pioneer in the area of domestic violence peer-support in Malta where survivors are considered experts by experience. \nFor domestic survivor Katie*, the hub will be a secure space for women like her and their children where they can slowly start rebuilding their damaged self-confidence.\n“When women feel happy and accepted by others, their children and society automatically benefit. This is so as women can contribute much better when they are living, and not just surviving,” she said.\nThe hub gives Katie hope as it allows her to believe she is worthy. \nA lot of structural work has been carried out on the townhouse, but at the moment the support service needs funds for the testing and repairs of ceiling beams, which is expected to cost more than €10,000. \nCorporate partners have provided support in kind, including QP Management, Fidem Foundation and HSBC Foundation. APS Bank directly supports the SOAR Support Service and other companies and entities have supported the cleaning up work at the hub through CSR initiatives.\n*Name has been changed\n\nHow to help\nDonations to the St Jeanne Antide Foundation can be made by dropping by at Ċentru Antida, 51, Tarxien Road, Tarxien TXN 1092, or by sending a cheque issued to St Jeanne Antide Foundation to Ċentru Antida.\nThey can also be done through bank transfer: APS 2000 0681886; HSBC 0131 75021 001; BOV 4002 003379-0 or BNF 002 10404 101.\nGo, Vodafone or Redtouch subscribers can donate by sending a blank SMS on 5061 7371 to donate €2.33; 5061 8095 to donate €4.66, 5061 8909 to donate €6.99 or 5061 9217 to donate €11.65.\nBank transfers from overseas can be done to  APS Bank, 146/147, Antoine De Paule Square, Paola PLA1260, bank code (Swift) APSBMTMT and Iban number MT03 APSB 7708 0005 5047 2000 0681 886.\nMore information on 2180 9011, 2180 8981 or 2767 2367.", "comment_count": 2, "id": 2833}, {"keywords": "", "author": "", "article_body": "Updated at 10.25am\nAn activist group that has campaigned to revise planning policies for fuel stations said on Tuesday that the new policy issued for consultation on Monday is an improvement \"if loopholes are removed\".\nMoviment Graffitti said it welcomed the long-awaited review and was pleased that pressure it and other NGOs had applied had had its desired effect.\n\"This shows that when people band together, positive change can be achieved,\" it said.\nThe group said it is \"cautiously optimistic\" about the changes proposed, but there were several points of concern which it would be raising in its feedback to the Planning Authority during the public consultation period.\nRevised policy\nReleased this week, the revised policy - which must go through a public consultation process and be approved by the Planning Authority, cabinet and parliament before becoming law - amends various aspects of the original fuel station policy.\nAccording to the amended proposal, relocated fuel stations must be sited in designated industrial areas, small and medium enterprise sites, areas of containment or open storage sites.\nAreas in Outside Development Zones may also be considered, provided they already have a permitted or legal commitment and are not related to agriculture or animal husbandry. \nFuel stations cannot be larger than 1,000 square metres, down from the 3,000 square metres currently permitted, although activists say that that size restriction is loosely worded and open to interpretation. Any station that remains unused for three years must be demolished, the new policy is proposing. \nGraffiti notes concerns\nIn its reaction, Graffiti noted that although the revised policy states that pending fuel station applications should be decided on the basis of this revised policy, \"there is no mention of the applications due to be heard in the period up to the approval of the new policy. There is no sense in proposing a change while allowing applications already submitted to continue being decided according to the old policy,\" the group said.\nSince it may take many months before any changes are made, the group said the PA should halt any and all applications for fuel service stations until the proposed policy comes into effect.\nIt observed that the draft revised policy features several improvements over the one currently in force. The options for take-up of ODZ land are significantly more limited. \nGraffiti said however, that the proposed policy \"requires no limit on size and no minimum distance between fuel stations\", including those in Areas of Containment - ODZ sites that have already been subjected to development. \n\"This may open the door to massive complexes of commercial services for cars, using the excuse of dispensing fuel to justify the take up of large parcels of land,\" it warned.\n\"Fuel stations should be limited in size, with other commercial activities related to car servicing operating under a commercial policy. The current and proposed policies both allow this abuse,\" it said. \nThe proposed policy also allows for the upgrading of facilities for ancillary services. This seems to open the door for fuel stations to expand for reasons unrelated to the fuel dispensing function, again providing a loophole that can be exploited.\n\"The fact that ODZ land remains available for development, notwithstanding the increased constraints in that regard, continues to devalue the ODZ classification. Moviment Graffitti stresses that ODZ should remain ODZ, and land already committed should not continue to be degraded, but should be returned to its natural state or used for agriculture. A similar loophole has led to the loss of a lot of ODZ land for residential purposes. We can expect the same if the proposed policy goes through. To err is human, to persist is criminal,\" the group said.  ", "comment_count": 6, "id": 2834}, {"keywords": "", "author": "", "article_body": "Malta has the highest visa applications rejection rate amongst all Schengen area countries, despite being one of the countries with the lowest number of applications received, data issued on Tuesday shows.\nMaltese authorities in charge of processing visa applications turned down 20.4% of the 32,331 applications received last year. In addition, only 30.5% of the approved applications were granted with a multiple-entry visa.\nYet, this was the lowest rejection rate for Malta in the last years. In 2015, Malta rejected 25.2% of the applications, 21.1% in 2016, and 25.2% in 2017.\nIn 2018, the second and third countries with high rejection rates were Belgium with a rejection rate of 16.8% and Portugal with 16.6% of the applications denied.\nFormer Soviet countries part of Schengen had the lowest rejection rates with Lithuania leading the table in this regard. Only 1.3% of the applications for a Schengen visa to Lithuania and 1.6% to Estonia were rejected. Finland and Iceland had both a low rejection rate of only 1.7%.\nThe countries with the highest rates of rejected applications filed by their nationals and citizens were Nigeria at 49.8%, Iraq, 47.8%, Guinea, 46.8%, Democratic Republic of Congo, 46% and Algeria, 45.5%.", "comment_count": 9, "id": 2835}, {"keywords": "", "author": "", "article_body": "The Maltese are still very fond of cheques, writing almost 4.8 million of them in 2018 – roughly 12 for each and every man, woman and child.\nOut of all the payment transactions, 17.3 per cent are done by cheque, over 10 times the European Union percentage. And the influx of new payment methods has not really dented people’s love of cheques: quite the contrary – there were 591 more issued in 2018 compared with 2017.\nAnd the government is not helping to cut down on the number handled: figures for 2018 were 20 per cent higher, mainly because of 200,000 tax rebate cheques sent out as a Budget measure. Had it not been for these cheques, the number would actually have gone down by 11.2 per cent.\nThe survey was carried out during the first quarter of 2018 by the Central Bank of Malta, assisted by the National Statistics Office.\nIt found that there has been a significant increase in alternative forms of payment over the past five years – the last time that the survey was carried out. There were considerably more people who had access to online payments, direct debits and prepaid cards. However, people still prefer debit cards, credit cards – and yes, cheques.\nCash is used to pay for 59.3 per cent of all bills\nThe CBM study, conducted by Charles Saliba and Mary Ann Muscat, stressed that cheques are not an efficient way to pay, with a long clearing cycle, and very labour intensive and costs processing. However, since this is ‘free’ to the user, they remain an attractive form of payment.\nThere is another problem, however: the business community might not be too keen on accepting “non-paper means of payment”, it said.\nPeople also seem very resistant to change, with over half the respondents saying that they had not changed the ways in which they pay for things – excluding cash and cheques – over the past five years.\nThe method of payment chosen is mostly driven by convenience (60.2 per cent) followed by efficiency (36.7 per cent) and safety and security (30.7 per cent), but the CBM report said an education campaign was sorely needed to compare the features, advantages and risks of each form.\nCash remains king, and is used by 86.7 per cent of households for groceries, 69.1 per cent for consumables and 46 per cent of non-consumables.\nAnd in spite of all the different payments methods being recommended by the utilities company, cash is still used to pay for 59.3 per cent of all bills. However, inroads are being made with 37.1 per cent paying these bills online.\nWill things change? Asked how they anticipate making payments in the future, a significant percentage said that they intended to make more use of debt and credit cards in the future.\nThere was also a major difference when the responses were analysed by age group with the younger much more predisposed towards online payment and direct debits than those over 55.", "comment_count": 24, "id": 2836}, {"keywords": "", "author": "", "article_body": "Qatar Airways will start a direct Malta-Doha service on June 4.\nThere will be daily flights throughout the summer, and four-times-weekly in winter.\nThe new route will be served by an A320 aircraft.\nQatar Airways, which has a global network of more than 160 destinations, has launched a website for the Maltese market – www.qatarairways.mt – enabling customers to book flights online.\nQatar Airways Country Manager for Italy and Malta, Mate Hoffmann, said: “We are very much looking forward to the launch of the direct services from Malta, one of Europe’s architectural gems and a key new addition to our European network. The new route will provide both business and leisure passengers travelling from Malta access to Qatar Airways’ extensive global route network.”\nThe new Malta service opens up a world of new connectivity options for Qatar Airways’ customers to destinations across Africa, Asia and Australia, such as Capetown, Hong Kong, Bali, Maldives, Bangkok, Sydney, among others.\nHamad International Airport (HIA) in Doha has more than 100 retail and dining options and unique services such as a swimming pool, hotel and spa, designed exclusively for those in transit.\nQatar Airways was named ‘World’s Best Business Class’ by the 2018 World Airline Awards, managed by international air transport rating organisation Skytrax. It was also named ‘Best Business Class Seat’, ‘Best Airline in the Middle East’, and ‘World’s Best First Class Airline Lounge’.\nIt has a modern fleet of more than 250 aircraft flying to more than 160 destinations worldwide.\nRecently-added destinations were Gothenburg, Sweden; Mombasa, Kenya and Da Nang, Vietnam. Qatar\nAlso due to be added this year are Izmir, Turkey; Lisbon, Portugal; Rabat, Morocco; Langkawi, Malaysia; Davao, Philippines; and Mogadishu, Somalia.\nFlight Schedule:\nDoha (DOH) to Malta (MLA) QR381 departs 01:05 arrives 06:45 (Mon, Wed, Fri, Sun)\nMalta (MLA) to Doha (DOH) QR 382 departs 09:20 arrives 15:55 (Mon, Wed, Fri, Sun)\nDoha (DOH) to Malta (MLA) QR383 departs 08:05 arrives 13:25 (Tues, Thurs, Sat)\nMalta (MLA) to Doha (DOH) QR384 departs 17:45 arrives 00:20 +1 (Tues, Thurs, Sat)", "comment_count": 4, "id": 2837}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Investigators have concluded that fuel was used to burn down Floriana’s historic arch early on Saturday morning, in a case that was ‘definitely arson’.\nSources close to the investigations said that the probe is well under way and investigators are combing closed-circuit television footage to identify the perpetrators. \nThe 120-year-old wooden arch was erected for the feast of St Publius this weekend. It was destroyed in a fire that raged for 90 minutes and also destroyed four parked cars.\n\nThe fire on Triq San Tumas was reported at 1.30am.  \nA magisterial inquiry, led by Magistrate Claire Stafrace Zammit, is still under way.\nIt was destroyed in a fire that raged for 90 minutes \nTests on the remains have so far pointed towards the use of a type of fuel, probably petrol. \nAccording to the Floriana parish priest, Fr Charles Cini, it looked like the fire had risen through the arch’s right column, which had a door and access shaft.\nHe vowed to have the arch rebuilt: “We have the original plans, and we have the determination to do it. Hopefully, we will get the financial aid needed to make that possible.”\nBuilt in 1899, the arch was used regularly until 1939, when the outbreak of World War II forced organisers to put it into long-term storage. \nIt gradually deteriorated until a thorough restoration project was undertaken and it was assembled again in 1999. It has been in use ever since on the feast days. ", "comment_count": 45, "id": 2838}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday.\nTimes of Malta says a court upheld a request by former Opposition leader Simon Busuttil for evidence in the Panama Papers scandal to be preserved, in the process acknowledging that a crime could have taken place. The newspaper also reports that fuel was used in the fire that burnt down the historic Floriana festive arch. \nThe Malta Independent quotes the justice minister as saying that the people's confidence in the judiciary is strong, despite what is written in the newspapers.  It also reports that the Planning Authority has finally published the fuel stations policy review for consultation.\nIn-Nazzjon says Joseph Muscat wants people to vote for his candidates on May 25 when, for him, Europe was never 'super favourite'. It also reports that a magistrate has upheld a request by Simon Busuttil for a Panama Papers inquiry, and there has been no Labour condemnation for Alfred Sant's threatening language about 'an eye for an eye'.\nl-orizzont says Prime Minister Joseph Muscat has excluded the possibility of Labour getting a 50,000-vote majority in the forthcoming elections. ", "comment_count": 0, "id": 2839}, {"keywords": "", "author": "", "article_body": "A 49-year motorcyclist from St Paul's Bay was grievously injured in a traffic accident in Burmarrad on Monday evening.\nPolice said the person, who was riding a Honda motorcycle, collided with a Hyundai Getz being driven by a 73-year old person from Mosta at around 5.45pm in Triq Burmarrad.\nA medical team was called to the site and the motorcyclist's injuries were later certified as grievous.\nPolice investigations are ongoing.", "comment_count": 0, "id": 2840}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta is regressing in its fight against corruption, the lead candidate for the European People’s Party (EPP) Manfred Weber fears.\n“I feel Malta is going backwards in its fight against corruption. This is a threat to democracy and impoverishes the Maltese citizens,” Mr Weber said in comments to the Times of Malta following a short visit to attend the Nationalist Party’s General Council.\n“The European way of life is what we Europeans have in common, what defines us. It is our common values of democracy, freedom, freedom of the press and the respect of the rule of law. We are seeing with concern the developments in Malta. This is damaging the image of the country European-wide.\n“The government should  implement the recommendations made by the Council of Europe, the Venice Commission and the European Parliament,” the EPP candidate insisted.\nHe also reiterated calls for the launch of a public and independent inquiry into the murder of journalist Daphne Caruana Galizia, stressing that it was not acceptable that those who are responsible for her assassination “are still not behind bars”. \nRead: Roberta Metsola is Malta's most active MEP \nMore efforts need to be done in the investigation, he said, insisting on the launch of an independent investigation into the Panama Papers scandal that was also needed.\nMr Weber also urged the government to stop its cash-for-passports scheme, saying that there was no room for such programmes in the EU.\n“European citizenship should never be for sale. It is the common good of all Europeans. It is our identity. It is what makes us European. It is what makes us one – we are different but the same.\n“Passport-for-sale schemes do not only increase Europe’s vulnerability towards organised crime activities, corruption and money-laundering. They also put our unity at risk,” he argued.\nAcknowledging that Malta was not the only country in the EU where the rule of law was at risk, Mr Weber said that if elected president of the European Commission, he would set up a “strengthened rule of law mechanism”, with an independent body composed of former judges who will be in charge of evaluating the rule of law, corruption, independence of the judiciary and the freedom of the press on a regular basis, in every member state.\nOn the future of the party and the EU as a whole in light of the increasing popularity of populist parties across Europe, Mr Weber said that the EPP “believes in Europe” and that such a stance would allow the party to ensure people are brought closer to-gether and not further apart.\n“In the EPP we bring concrete solutions to the people’s problems,” he said.\n“This is why I am proposing a Europe that is strong, smart and kind. I have put forward 12 concrete proposals, my 12 pledges to the European citizens.”", "comment_count": 13, "id": 2841}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat reframed the forthcoming European Parliament elections as a choice between himself and Opposition leader Adrian Delia during his party’s first campaign event on Monday.Dr Muscat insisted that while his counterpart argued that the election was not a choice between parties but MEP candidates, voters would in fact be choosing between the two party leaders.“I have full faith in each of our candidates, so I am putting my name alongside theirs,” he said during an interview at the Labour Party event in Marsa.In the wide-ranging interview, the Prime Minister also took aim at the Opposition’s stance on migration, referring specifically to images circulated by the PN accusing the government of having “filled Malta with foreigners” (fqajtu Malta bil-barranin).“This is the rhetoric of far-right parties,” he said, arguing that the PN was contradicting itself by stoking these fears while at the same time proposing in its electoral manifesto that Malta could become what he called a “centre for migration”. He said the government had been clear that Malta could not bear the burden of irregular migration alone, and that while Malta was ready to be “part of the solution”, it could not itself be the solution.We can draw together a group of countries willing to help each other“We can draw together a group of countries willing to help each other,” he said. “We will give help where it is required, but we can’t bear all Europe’s burden.”\nIn a statement in response, the PN said its representatives at the European Parliament had negotiated and approved a law aimed at strengthening the EU's borders, and that its manifesto included clear proposals to overcome the challenge of migration in full cooperation with other European countries. \n\"The PN was and remains in favour of fundamental human rights, particularly the protection of a person's life and dignity, irrespective of who the person is,\" the party said. Dr Muscat, meanwhile, also continued to drip-feed information about the previously-announced ‘open spaces project’, saying that the land identified for the project - which he did not provide details on - could have instead been used for a factory development that would have generated millions in income. “We are already doing a lot for the economy; it is now time to start shifting the scales back towards giving people more free time and open space,” he said.", "comment_count": 88, "id": 2842}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A wanted man, who landed back in police custody last week, has been handed a 10-month effective jail term and forfeiture of bail bonds totaling almost €20,000, upon his arraignment on Monday.\nClive Agius, a 34-year old Floriana resident, had been the subject of a public request for information launched by the police following a court order for the re-arrest of the man who was facing ongoing drug-related proceedings.\nThe man was tracked down two days after publication of that police request, landing back in court on Monday where he admitted to having committed an offence punishable with imprisonment during the operative period of a suspended sentence.\nThe accused was also charged with having breached two bail decrees, handed down in March and May, 2018 respectively, and with relapsing.\nThe court, presided over by magistrate Josette Demicoli, was informed that the accused had allegedly failed to sign the bail book for the last month or so, sparking the police search for his whereabouts.\nUpon the accused’s own admission, the court declared him guilty and condemned him to a seven-month jail terms for the breach of two bail decrees and a further three months in terms of the suspended sentence which was rendered operative.\nIn addition to this 10-month jail term, the Court also ordered the forfeiture of two bail deposits totaling €2750 and two personal guarantees totaling €17,000.\nSenior Inspector Frank Anthony Tabone prosecuted. Lawyer George Anton Buttigieg was defence counsel.", "comment_count": 0, "id": 2843}, {"keywords": "", "author": "", "article_body": "Two cars collided in Attard on Monday afternoon in a crash which left one person hospitalised.\nThe crash on Triq il-Ħafur was reported at around 5pm, the police said.\nAn ambulance was called to the area and took a person who was in one of the cars to hospital. No information about the victim or their medical condition was available at the time of writing.\nPolice temporarily closed the street to traffic while they worked to clear the scene.", "comment_count": 0, "id": 2844}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An Italian man with suspected ties to the mafia, arrested on the strength of a European Arrest Warrant by police on Easter Sunday, had been living in Malta for the past 10 years and had strong family ties on the island.\nAntonio Ricci, whose name had been banned from publication upon his arraignment last week, was back in court on Monday as extradition proceedings got underway.\nA note by his defence team, making reference to local media reports which had breached the ban by publishing the man’s name, was turned down by the court assigned the hearing of the extradition proceedings.\nThat court, presided over by magistrate Donatella Frendo Dimech, pointed out that the order banning publication had not been in terms of a particular provision of law which required such orders “to be signed by the registrar and posted up at the door” of the law courts.\nHence there was no order in force banning publication of Mr Ricci’s name, the court ruled.\nThe man, wanted by the Italian authorities for association with the mafia, as well as management and collection of illegal betting on behalf of a mafia organisation, had been residing in Malta for the past 10 years, defence lawyer Arthur Azzopardi pointed out when making submissions on bail.\nThe Italian had family ties on the island, the lawyer continued, adding that had the man wanted to abscond he had ample time to do so given that he had been aware since November that authorities back in his homeland had kicked off investigations in his regard.\nMoreover, the man was willing to submit to house arrest, even though such a measure had been declared by our courts as breaching fundamental human rights, the lawyer argued, adding that Mr Ricci was even willing to cover the expense of police surveillance outside his residence were he to be granted bail.\nFinally, the court was informed that there were two third parties who were willing to step in as guarantors for the arrested man to be released from preventive arrest.\nThe court said that it would decree upon the issue of bail in chambers, whilst adjourning the case to next week for the parties to put forward their arguments regarding the dual issues of extraditability and bars to extradition, “the merits of the entire EAW proceedings,” as pointed out by defence lawyer Stephen Tonna Lowell.\nLawyer Alfred Abela was also defence counsel. Lawyers Matthew Xuereb and Charles Mercieca from the AG’s Office prosecuted alongside Inspector Mark Galea.", "comment_count": 0, "id": 2845}, {"keywords": "", "author": "", "article_body": "More than 3,500 contraband cigarettes and 272 bottles of unlicensed alcohol were seized from bars, shops and restaurants across Malta last week in a series of raids by Customs officials. The searches of establishments in Gżira, Qormi, St Julian’s, Valletta and Paola yielded a variety of illicit items, from contraband cigarettes to wine bottles which had no excise paid and hundreds of unused excise stamps. In a statement, Customs warned shop and establishment owners that it would be adopting a zero tolerance approach to anyone caught dodging excise dues. In total, the searches yielded: · 3,580 contraband cigarettes;· 14 kilos of shisha tobacco· 272 bottles of alcoholic beverages, including whisky, gin, rum, brandy and several liqueurs· 221 bottles of wine which did not have their excise tax paid· 1,230 non-alcoholic drinks· 2,393 plastic bags· 725 unused excise stamps", "comment_count": 5, "id": 2846}, {"keywords": "", "author": "Keith Micallef", "article_body": "Three out of every five appeals filed last year with the Public Contracts Review Board were upheld, due to shortcomings in tender specifications and lack of technical expertise by the evaluation board.Despite such worrying trend, Finance Minister Edward Scicluna insisted there was no cause for alarm in public procurement process, but remarked that the government had taken note of the matter.Prof. Scicluna made this remark during the presentation of the 2018 report on the working of the Public Contracts Review Board.It transpires that last year, there was a 30 per cent increase in the number of appeals filed, which totalled 134. The overall value of these contracts issued by public authorities was of €288 million.Board chairman Anthony Cassar remarked that last year 57 per cent of appeals were upheld which was double the usual norm which hovers around the 33 per cent mark.“Most of these cases were related to lack of attention in the tender specifications and secondly, due to the composition of the evaluation committees,” he said.Dr Cassar added that members appointed on these committees lacked the technical expertise in the respective fields, and consequently their decision was being challenged.Most of these cases were related to lack of attention in the tender specifications and secondly, due to the composition of the evaluation committeesIn view of this, the Contracts Review Board approached the respective contracting authorities and warned them that unless they would appoint competent members on the selection board, more appeals would be lost. “In turn this would result in delays for the delivery of the requested supplies,” Dr Cassar remarked.Asked for his reaction, the Finance Minister play down the trend saying it was no cause for alarm. He insisted that the government was taking steps to train more staff in order to have better qualified selection board members across the board. “We take note of these findings in order to seek ways to minimise such instances,” the finance minister said. Another particular trend observed last year was an “alarming increase” in pre-contractual appeals, which are filed before the tendering period closes. Such development was noticed in the health sector, where once again the main cause was lack of expertise by the selection board.However, Dr Cassar acknowledged that in this case, there were constraints due to the lack of independent qualified people on the island. “You cannot have surgeons deciding on contracts, while they are urgently required in the operating theatres,” he said. On a positive note, last year the number of appeals filed with respect to contracts by local councils declined. Such trend was attributed to a stricter adherence to public procurement regulations.", "comment_count": 13, "id": 2847}, {"keywords": "", "author": "", "article_body": "Travel arrangements are being made for those living abroad to vote in Malta during the MEP elections on May 25.\nAir Malta will be making return tickets available at €90 each, including taxes and other charges, to those who are eligible to vote in Malta.\nReservations can be made on 2141 8214 from Monday to Saturday between 8am and 10pm, and on Sunday from 8am to 5pm as from Tuesday (April 30).\nInbound travel to Malta is possible from May 13 to May 25, while return travel is from May 25 until June 6.\nThose who opt for early voting on May 18 can travel to Malta from May 13 till May 17 and apply at the Electoral Office, Naxxar Counting Complex by noon on May 17.\nThey can fly back from May 18 but not later than June 6.\nThese travel arrangements are available for eligible voters, including those married to foreigners, studying, working or undergoing medical treatment abroad and dependents of such people.", "comment_count": 21, "id": 2848}, {"keywords": "", "author": "", "article_body": "Two people were taken to hospital on Monday afternoon after they lost control of a car, flipping it over on Tal-Barrani road. The two, aged 28 and 23 and who live in Marsascala and Żejtun respectively, were taken to Mater Dei Hospital following the crash, which was reported to the police at around 2.20pm. Police said that no vehicles other than the Mitsubishi Colt were involved in the crash. No information about the pair's medical condition was available at the time of writing.", "comment_count": 0, "id": 2849}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 4.15pm with OPM response\nA court on Monday upheld a request by former Opposition leader Simon Busuttil for evidence in the Panama Papers scandal to be preserved.In a decree by magistrate Doreen Clarke, the court said the documents presented by Dr Busuttil and NGO Repubblika gave credence to the request for an inquiry to preserve evidence.The magistrate said a series of facts were presented that could indicate a crime took place.The court said the list of potential crimes presented to it were not fully covered by another inquiry being led by magistrate Charmaine Galea. For this purpose, the court ordered that the evidence presented to it form part of the inquiry being led by Dr Galea.The inquiry by Dr Galea is looking into the ownership of the Dubai company 17 Black.\nEvidence implicating Tourism Minister Konrad Mizzi, the Prime Minister’s chief of staff Keith Schembri, Nexia BT’s Brian Tonna and Karl Cini as well as LNG tanker agent Mario Pullicino will now form part of this inquiry.A joint investigation by Times of Malta and Reuters last year revealed that 17 Black is owned by Tumas Group CEO Yorgen Fenech, who forms part of the Electrogas power station consortium.\nThe Office of the Prime Minister said in a statement that the ruling meant there would be no new inquiry as a result of Dr Busuttil's request but merely an addition to the existing inquiry. The OPM said the magistrate had described a \"large overlap\" between the issues raised in this request and the inquiry being led by Magistrate Charmaine Galea.A previous request for a broad inquiry into the Panama Papers filed in 2017 was turned down on appeal in January.\n\n\n\nUsing such shares was a classic layering technique used in money-laundering to guarantee the company’s owner absolute secrecy, Dr Busuttil argues in the application.The use of bearer shares means the only evidence linking a person to the company is the physical share certificate. Nexia BT, the financial advisory firm that set up the three companies, negated the use of such shares.\nDr Busuttil said in the application that German journalist Bastian Obermayer, who received the Panama Papers leak, is willing to vouch for the authenticity of the e-mails that outed Mr Schembri’s and Dr Mizzi’s plans to receive payments of up to $2 million from 17 Black.\nFellow PN MP Jason Azzopardi represented Dr Busuttil and Repubblika in court.", "comment_count": 161, "id": 2850}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Roberta Metsola was Malta’s most active MEP during the past five years, and the popular party’s fourth most engaged, according to an online ranking site.\nThe PN MEP is the only Maltese one to make it with the top 30 parliamentarians – placing 27th most active overall.\nThe ranking was made public following the last European Parliament plenary session for the 2014-2019 legislature.\nIt takes into account every activity undertaken by all MEPs, including drafted laws, voting records, legal amendments, speeches, voting transparency and parliamentary roles.\nDr Metsola’s ranking places her at the very top of the EPP Group, just after President Antonio Tajani, Group Chairman Manfred Weber and British MEP Julie Girling.\nDuring this past legislature, Dr Metsola won the MEP of the Year award twice and was named as one of the top 10 young leaders of the world in 2017.\nHer office said that the PN MEP has also been “at the forefront of pushing forward a European agenda that suits the reality in Malta and Gozo”, keeping in touch with different stakeholders.\nShe recently managed to pass a new EU border security law that will see 10,000 additional border guards at Europe’s external borders.\nFor Dr Metsola it was always nice to receive acknowledgement for her work.\n\"To be recognised by such an authoritative forum is an honour, but even if we may not always agree, every Maltese MEP works hard for the people we represent.”\n“When I was elected as an MEP, I promised Maltese and Gozitans that I will represent all their interests, work hard and always stand up for the values that distinguish us as Maltese – and I’m pleased that this has been recognised. Now it’s back to work.”", "comment_count": 19, "id": 2851}, {"keywords": "", "author": "", "article_body": "Maltese singing sensation Giorgia Borg, 10, continues to stir up excitement in the UK, with video of her Britain’s Got Talent performance seen more than 3.4 million times on YouTube in just three days.\nYoung Giorgia was sent straight to the semi-final of the British reality TV show after wowing judges with a powerful performance of a song she co-wrote with local songwriter Muxu.\nHer Golden Buzzer-worthy appearance and precocious talent have proven popular with online audiences too, who have rushed to watch and share video of her performance.\nA YouTube video of Giorgia’s performance uploaded by Britain’s Got Talent has been seen more than 3.4 million times, with that same video also getting more than half a million views on the show’s official Facebook page.\n\nThe singer is also the youngest-ever performer to get a Golden Buzzer on Britain’s Got Talent. A Golden Buzzer allows an act to go straight through to the semi-finals of the competition. Each of the show’s five judges is given one Golden Buzzer per series.\nSour grapes?\nGiorgia’s sudden fame seems to have rubbed some viewers the wrong way, however.  \nA vocal minority took to Twitter to complain that the talented Maltese singer was not really a new star.\n\"So annoying when they pull the old 'This is a shock routine' she's already being on Junior Eurovision,” one wrote, in a comment which was echoed by a number of others along similar lines.\n\n\n\nAnother called the 10-year-old sensation an “established act” who “was on Eurovision”.  \nContrary to those claims, Giorgia Borg never represented Malta in the Junior Eurovision. She took part in the national competition to nominate a winner, but placed third.\nGiorgia has been performing on stage since she was a young girl and has won singing competitions for children in Malta and Sweden, which featured far smaller audiences and less pressure to perform.\nLocal viewers will now be waiting for the Britain’s Got Talent semi-finals with bated breath, in the hope of seeing a successful repeat of Giorgia’s performance.", "comment_count": 13, "id": 2852}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Some ODZ sites that do not host agriculture or animal husbandry could be considered for the relocation of fuel stations, according to the proposed policy which has been launched for public consultation.\nThe new policy will guide the future evaluation of applications related only to the relocation of existing fuel stations that are currently having an adverse impact on urban areas.\nOnce approved, this proposed policy framework, will repeal the 2015 Fuel Service Stations Policy.\nThe new proposed policy has long been pending, sparking protests from NGOs, who argued that other contested applications were given the green light in the process.\nRead: Activists camp outside PA offices in protest\nAccording to the proposal, relocated fuel stations must be sited in designated industrial areas, small and medium enterprise sites, areas of containment or open storage sites.\nOther areas designated for development in the local plan, excluding residential, residential priority and urban conservation areas, which are deemed safe by the authorities will also be considered.\nThe planning authority may also consider areas within ODZ that already have a permitted or legal commitment and which are not related to agriculture or animal husbandry.\nSuch sites will only be considered if a wider environmental benefit is achieved and the development is compatible with the context of the area.\nIn such cases, the total footprint shall not exceed the existing permitted or legally committed footprint, which in turn should not be larger than 1,000m².\nThe site of a new petrol station recently approved in Burmarrad.\nCurrent sites will be allowed up upgrade\nMeanwhile, sites already occupied by permitted fuel stations will be allowed to upgrade.\nShould a permitted fuel station be in an ODZ, upgrading works may not exceed the existing footprint or 1,000 m², whichever is larger.\nAllowed upgrades will be limited to statutory and regulatory obligations, ancillary facilities and/or the introduction of dispensing facilities for alternative fuels such as CNG, LPG and electric charging stations.\nThere will be no footprint limit if the permitted fuel station is within the development boundary, subject to neighbourhood safety and compatibility.\nExisting fuel station, which, following consultations with Transport Malta and Malta Resources Authority, are not deemed to create issues of amenity, safety or transport, will meanwhile not be eligible for relocation.\nExisting fuel stations located partially or fully in ODZ will also not be eligible for relocation and the redevelopment or change-of-use of existing fuel stations located partially or fully in ODZ will also not be considered.\nThe height of a proposed fuel station would not exceed seven metres.\nThe new policy is also proposing that any fuel station that is not used for its permitted purpose for three consecutive years will be demolished at the expense of the owner, and the site has to return to agricultural state.\nThose interested can send in writing to the Planning Authority, Director of Planning, St Francis Ravelin, Floriana FRN1234 or by email on FSSP_review@pa.org.mt by not later than June 14.\nRead: Fuel stations review: Quo vadis?", "comment_count": 15, "id": 2853}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Government measures meant to ensure equality between working men and women are ineffective according to the PN.\nEquality spokesperson Claudette Buttigieg referred to Eurostat data which placed Malta at the top of the European list of the gender employment gap.\nIn March, the European Commission’s statistics office flagged data showing that the largest employment gap between men and women was registered in Malta with 24.1 percentage points, followed by Italy and Greece with 19.8 and 19.7 percentage points respectively.\nMs Buttigieg said that while the gender gap did exist in the past, the situation has become much worse.\nShe noted that some professions are faring particularly bad. During an initiative chaired by former president Marie Louise Coleiro Preca, accountants had noted that the discrepancy between women’s and men’s salaries stood at 20 per cent, she added.\n“This is unacceptable and has to be addressed by a government which cares. The current government doesn’t care about women’s situation.\n“Had the government cared, it would have taken measures to improve the situation,” she said during a press conference ahead of the May MEP elections.\nInternational secretary Roselyn Borg Knight said that the World Economic Forum’s report on equality between women and men in the EU, had highlighted the issue of pensions.\nWomen’s lower wages when compared to men’s will also negatively affect their pensions – for every €100 that a man receives, a woman will get €55.20, she said.\nThe fact that equality between men and women was now worse off was of concern not just for the Nationalist Party, but all men and women, she said.\nShe referred to the PN’s European Parliament electoral manifesto, which states that elected representatives will work on improving this situation.\n“When speaking of equality, we need to speak about equal opportunities and there are already current MEPs working on such issues, such as transparent working conditions and the work-life balance directives.\nMalta remains worse than EU average for gender equality\nIt was disappointing that women’s situation has gotten worse rather than better. Although we lived in a country where equality should be a top priority, the measures taken by a socialist government was not reflected in the statistics, she added.", "comment_count": 7, "id": 2854}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A court has been asked to issue an interim measure to stop the assignment of duties to newly-appointed members of the judiciary, with a lawyer arguing that there would be 'judicial Armageddon' if their decisions were to be eventually annulled.\nThe civil society NGO Repubblika is contesting the appointments, arguing that the government should first implement the recommendations of the Venice Commission on rule of law to ensure the judges and magistrates are truly independent.\nThe case contesting the appointments was filed on Thursday, hours before the appointments were actually made. Three new judges and three magistrates were appointed.\nLawyers (and Nationalist MPs) Jason Azzopardi and Simon Busuttil, who filed the application, on Monday traded arguments with Attorney General Peter Grech, assisted by lawyer Victoria Buttigieg.\nRead: PM slams ‘absurd’ request asking for courts to be ‘paralysed’\nDr Grech said an interim measure had already been requested by the NGO last Thursday, referring to the request for the court to order the government not to appoint the new judges and magistrates until the current system of appointment was changed.\nSuch a request was repetitive and ran counter to the principles of “ne bis in idem” (no legal action can be instituted twice) and “res judicata,” (a matter that has been adjudicated) Dr Grech continued.\nMr Justice Mark Chetcuti said this was not quite the same. One was subject to executive discretion.\nDr Grech said that once a person was appointed to the bench, one would expect that person to perform the judicial duties assigned accordingly.\nDr Azzopardi said one had to imagine the ramifications if all decisions taken by these newly-appointed members of the judiciary were to be annulled. It would be like a “judicial Armageddon.”\nDr Busuttil also argued for a preliminary reference to the European Court of Justice, pointing out that a similar request had been made and upheld in a case concerning Poland.\n“I don’t see why we are to be treated any differently to Poland,” remarked Dr Busuttil.\nAfter hearing arguments made by both sides, the court minuted that the request for an interim measure to stop the newly-appointed members of the judiciary from being assigned their duties was “substantially different” to that put forward last Thursday.\nAs for the preliminary reference to the European Court, it said that such a request could be submitted before the First Hall, Civil Court, in its constitutional jurisdiction and it was up to that court to decide whether the circumstances were such as to merit the reference.\nThe court granted the NGO time to file two separate applications clearly stating “the precise requests and legal basis” for the said interim measure.\nThe case was adjourned to Monday.\n ", "comment_count": 0, "id": 2855}, {"keywords": "", "author": "Ivan Martin", "article_body": "A new task force should be set up to coordinate the fight against human trafficking and support the victims, a new legal paper on the subject recommends. \nPublished by the Malta Law Students’ Society (GħSL), the position paper says a specialised team could provide a much needed “clear cut” approach to tackling this issue including victim protection, prevention, prosecution, international cooperation and national coordination. \nThe sad reality, the aspiring lawyers argue, was that Malta had been known to house European women who have been subject to human trafficking, particularly for prostitution purposes. \nHowever, women were not the only victims. One such case referenced in the paper dates back to 2009, and had involved three men from Pakistan who were being forced to work in an Indian restaurant. \nThis was further compounded by irregular migration from North Africa. These were highlighted as being at risk of falling victim to the island’s informal labour market.\nQuoting the latest Trafficking in Persons report, the position paper details how Malta was considered by human traffickers as an “ideal” destination for labour and sex trafficking, with women being notable victims of the latter. \nAccording to the report, victims in Malta typically originated from China, with the aim of being exploited as massage parlour employees – a sector linked to the black market sex trade.  \nVictims are often comparable to slaves\nVictims from central and eastern Europe, were being exploited as football players in questionable work contracts or being employed in Paceville nightclubs. \nVictims from south-east Asia, on the other hand, were mostly being made to work as domestic care workers. \nGrace Attard, the vice president of the National Council of Women, told the law students society that victims of human trafficking in Malta were often comparable to slaves, as they were denied the most basic of freedoms, such as mobility, or the freedom to enjoy the majority of their earnings. \nShe also questioned whether the apparent lack of perpetrators being charged for human trafficking offences was due to a lack of evidence against them or because of shortcomings in the law.\nThe position paper encourages enforcement authorities not to hold back in administering heavy penalties to traffickers. \nLeniency, the paper says, only served to embolden criminals involved in these networks, “with the number of victims seemingly only increasing as time elapses”.\nThe paper also called for NGOs involved in this sector to be supported through funding, resources and access. \nMalta had made significant efforts in recent years, mostly by making specialised training available to law enforcement agencies, allocating more funds to the prevention of human trafficking and increasing the capacity of shelters. \nThis, however, was not enough.\nTraining currently offered to law enforcement should be extended to cover people who worked in high-risk areas such as airports. \nFinally, the paper also suggests awareness raising campaigns as a way to inform the public about the risks and prevalence of human trafficking in the country.\nThis, the society believes, could help weed out the spread of the crime on the island.", "comment_count": 1, "id": 2856}, {"keywords": "", "author": "Claire Caruana", "article_body": "Physiotherapists at the outpatient department at the old hospital are struggling to treat patients as a result of sub-standard facilities, forcing their union to threaten “serious action”.\nExposed wires can be seen in the majority of lighting fixtures at the physiotherapy department in St Luke’s Hospital.\nSituated at St Luke’s Hospital and run by Steward Health Care, the US company that took over the 30-year government concession to manage three hospitals, the outpatient physiotherapy department is the only one of its kind on the island.\nPatients from Mater Dei Hospital, and some from Karin Grech Hospital wards, are all treated at this department. While the migration to the Mater Dei Hospital took place in 2007, the physiotherapy department remained situated at the old hospital and was first taken over by Vitals, the previous concessionaire, and then Steward.\nSources described how despite the changeover, the department has not seen an upgrade in years, with physiotherapists being forced to make the best of what is available – including having to use a corridor riddled with broken tiles during sessions with patients learning to walk again.\nTimes of Malta is also informed that the only treadmill available in the department has now not worked for months.\nContacted about the issue, Malta Union of Nurses and Midwives president Paul Pace said that despite years of promises that the department would be upgraded, this has yet to materialise.\nMr Pace said that the physiotherapists have had enough of working in the sub-standard conditions. Many, he said, felt that while they had the skills to provide their patients with the necessary treatment, the facilities available to them limited their professional development and often compromised the quality of the interventions.\n“The building is like something out of a horror movie. There are broken tiles everywhere and a lot of the equipment is not working. The floors above the department have not been used in years and are now full of dead pigeons and walls on the brink of collapse.\n“The physios cannot take it anymore,” he said.\n“There is no privacy and so, for instance, a stroke patient who requires not only physical help but also psychological support, has to be treated in an open corridor.”\nMaster plan not yet unveiled\nAccording to Mr Pace, Steward has promised a so-called “master plan” which would outline the improvements planned for the department, however this has yet to be unveiled.\nMr Pace said patients often complained about the dire state of the building. While the government spoke of the public health system being the best in the world, hundreds of patients were being treated in such conditions on a daily basis.\nThe concerns over the department come just over a week since similar worries were expressed over another public hospital, Mount Carmel, after it emerged that around three-quarters of the wards have condemned ceilings, with beds crammed so close that patients are being forced to place their personal belongings on the floor.\nHe said the union would also be threatening action over the problems at the department, pointing out that it would be “even harsher”.\n“Things just cannot go on as they are. The department was abandoned the moment everyone moved to Mater Dei and not a single upgrade was carried out since,” he said.\nSteward promises 'interim solution'\nContacted about the matter, a spokeswoman for Steward said that the management was in regular discussions with the staff who, she said, provide excellent care “despite the long standing limitations in the physical environment”.\n“In view of the wider project to regenerate Karin Grech and St Luke’s into a fully-fledged holistic rehabilitation hospital with new outpatient facilities, it was agreed with staff and union representatives that an interim solution would be identified, which would improve the working conditions at the current physiotherapy department without diverting significant funding from the comprehensive new construction plans and long-term solutions,” she said.\n“This proposal reflects an upgrade to the existing premises: waterproofing, plastering, curtains, air-conditioning, new PCs, additional HR and replacement of equipment. Additional space has been identified and works will progress in short order,” the spokeswoman added.\nPrior to the commencement of works, she went on, plans will again be reviewed with the union, which has been engaged in the process throughout as well as with the Health Ministry.\n“Steward is currently working with local and international planning experts on a master plan that will establish exactly how the new hospital will be built, and is involving stakeholders to ensure that what is built is a facility that meets the needs of current and future patients and provides a work environment supportive of our staff,” the spokeswoman said.\nDetails on work time frames were not provided.\nclaire.caruana@timesofmalta.com", "comment_count": 28, "id": 2857}, {"keywords": "", "author": "", "article_body": "A 25-year-old from Swieqi was seriously injured late on Sunday when his motorcycle was involved in a collision with a Ford Transit van in Sliema.\nThe police said the crash took place at 10.15pm in Tower Road.\nThe van was being driven by a 57-year-old resident in Marsaskala.", "comment_count": 0, "id": 2858}, {"keywords": "", "author": "Ivan Martin", "article_body": "Fringe party Alleanza Bidla has started online streaming its own political station after its discussion TV programme was cancelled by the Broadcasting Authority until after next month’s local and European elections.\nParty co-leader Ivan Grech Mintoff told the Times of Malta that his current affairs show Exodus, which until a few weeks ago used to be broadcast on F-Living TV, had been banned until after the European Parliament and local council elections set for the end of May.\n“We refuse to abide by the BA's undemocratic decision. Exodus will therefore be broadcasting as Exodus DGT TV transmitting 24 hours-a-day, every day, on the internet and via IPTV,” he said. \nMr Grech Mintoff said the BA was insisting that its decision was meant to ensure fair media coverage in the run-up to the local council and European elections.\nHowever, the Eurosceptic Grech Mintoff does not see it that way.\n“The two major parties have their own TV and radio stations and can transmit their political message all day without being limited by the Broadcasting Authority,” he said.\nAll other minor parties, Mr Grech Mintoff added, were merely given a few minutes each on the public service channel during the five-week campaign period.\nHe later accused the BA of going against the values of free speech and democracy, insisting the lopsided media landscape raised concerns over the legitimacy of the upcoming elections in the first place. \n“Exodus will not be silenced. We have broken the PN and PL’s media duopoly once and for all and is now louder than ever before.\n“Now, everyone can see us and we hope to get a larger audience than before,” he said.\nAnd he plans to use this new channel to further “address the present imbalance in political media” by offering time to all the other parties and individual candidates on the TV station.\n“We insist that the Maltese voter be given the right to hear from all parties in the elections. We will practise the democracy that we believe in,” he said.\nThis is not the first time Mr Grech Mintoff has taken to the internet to circumvent attempts to block his programme from being aired. \nBack in 2016 he uploaded one of his more controversial epi-sodes on YouTube after it was not allowed to air.\nAt the time, Mr Grech Mintoff had been discussing allegations, first reported by this newspaper, that an official in the office of the Prime Minister was involved in a Libyan medical visas racket. ", "comment_count": 40, "id": 2859}, {"keywords": "", "author": "", "article_body": "The following are the stories making the headlines in Malta's newspapers.\nTimes of Malta reports that physiotherapists at the outpatients departmentof the old hospital are struggling to treat patients as a result of sub-standard facilities, forcing their union to threaten “serious action.”\nThe Malta Independent says a Maltese passport-holder has been arrested in New York on fraud charges. \nIn-Nazzjon quotes PN leader Adrian Delia saying the PN was and remains the best bulwark of what makes Malta Maltese and European.\nl-orizzont leads with a comment by Prime Minister Joseph Muscat that he will not 'stop abruptly', a comment interpreted as related to his plan not to contest another general election.", "comment_count": 0, "id": 2860}, {"keywords": "", "author": "", "article_body": "A 35-year-old man was on Sunday jailed 18 months and fined €800 after he was found guilty of theft.\nThe accused, a Libyan, was charged of stealing from a shop in Valletta. The police said that he was also found to be carrying items that had been stolen from other shops.\nThe man was also accused of resisting arrest, insulting the police, and being a relapser.\nPolice investigations are continuing.", "comment_count": 0, "id": 2861}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Lucie Nottingham has supported hundreds of charities over the years, mostly in the Cornwall region where she lives, but a love for Malta and a long friendship have also made her one of Din L-Art Ħelwa’s most prolific backers.\nThrough the Tanner Trust, a family-run charitable trust set up 25 years ago, Ms Nottingham has supported countless projects by organisations in the fields of conservation and preservation, as well as hospice care and several others.\nShe was drawn to Malta and Din L-Art Ħelwa by her longstanding friendship with the NGO’s former president and current council member Martin Scicluna, and his wife Lorie, whom she first met in university.\n“Din L-Art Ħelwa has made a huge difference to Malta,” she told The Sunday Times of Malta. “Their contribution has been vital to the whole attitude of taking an interest in the history and conservation of buildings, which is essential both for Malta’s own pride and future generations but also for tourism.\nIt’s about keeping things in their context, and changing things sensitively\n“And of course, it’s so important to encourage people to visit these sites and to ensure they have a good experience when they do.”\nAt the Msida Bastion Historic Garden in Floriana, which she visited during a recent stay in Malta, Ms Nottingham has provided funding for a new system which allows water to be drawn directly from nearby cisterns to feed the gardens.\nShe is unwilling to discuss figures, but since 2000, she has also supported restoration and upgrading projects by Din L-Art Ħelwa at the Argotti Gardens in Floriana and the Our Lady of Victories church in Valletta, as well as purchasing a Land Rover to help park management around the Red Tower in Mellieħa, among other projects.\nShe has also contributed to the Save Valletta Skyline’s appeal, which aims to restore and protect St Paul’s Anglican Pro-Cathedral and its iconic spire.\nShe stressed that the trust donated only to charities, and only through personal recommendations, choosing good causes that mainly related to the trustees’ personal interests.\n“Conservation adds to the beauty and history of the place but also supports its economics and quality of life,” she said when asked what drew her towards these projects.\n“It’s about keeping things in their context, and changing things sensitively. I think Din L-Art Ħelwa are so important for that reason.”", "comment_count": 2, "id": 2862}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "In his first interview since his appointment as Din l-Art Ħelwa president, Prof. Alex Torpiano points his finger squarely at the Planning Authority and at politicians as the biggest culprits of the mess the country is in.\nMalta’s heritage and environment are in an abysmal state and architects are also responsible for this. You are an architect yourself, at the helm of Malta’s most prominent heritage and environment NGO. How much do you feel your profession is to blame for the state of the country and how can your role within Din l-Art Ħelwa be even more effective because of what you do?\nIn my last speech as president of the Kamra tal-Periti, I told my colleagues that the ugliness we are seeing around us is also our doing. However, that is only part of the problem, and not necessarily the bigger part. In order to create the urban and rural environment that we aspire to, we need much better legislative tools to protect what we have inherited and to promote a better quality of what we are building today.\nThese legislative tools need to come from politicians who are sensitive, or sensitised, to the issues, and frankly, where are they? It is often argued that politicians have to respond to the wishes of their electorate, but good political leadership also means that one convinces one’s constituents that more restraint, higher urban quality, less demolition of old houses, etc… are actually in their economic interest as well as that of their well-being.\nIn my view, the biggest culprit in the mess is the Planning Authority, and the politicians who are unwilling to let go of the attraction of controlling it – because their patronage depends on this. This is the real reason for the state of Malta’s built and natural heritage.\nPA has many design guidelines, but not a single one of them requires developments to be beautiful\nWhether my background as an architect can help DLĦ to be more effective now remains to be seen. I will certainly do my best.\nHave you ever found yourself having to pander to a client’s needs, which may not necessarily fit into your values and standards when it comes to quality architecture and a respect for the environment? Do you understand this predicament many architects may find themselves in?\nYes, I certainly understand the predicament. It is very difficult, especially for a young professional, wishing to enter the market, after long years at university, to take a stand against what the client wants, especially if the client is a seasoned developer. It is, indeed, not even fair to expect this.\nWhat we really need is that values and standards are not just personal choices but national requirements. Therefore, architects are not left on their own when they are not comfortable with what is being demanded of them – particularly if these client needs are allowed by policy and are, therefore, legitimate.\nOf course, this means that the architect has to have the moral courage to reject any ‘twisting’ of policy to suit the client. It is not correct professional behaviour to plot a route through the many gaps in our myriad policies and guidelines in order to achieve this objective. The problem is that the planning process has become a legal process – it is all about whether a particular comma allows or prohibits a particular proposal. It is rarely about the quality of the product itself.\nI have been in this predicament myself and I must say there were a couple, very early, of minor projects that I am not, in hindsight, particularly proud of. I can also state that, when my practice was established, I could refuse, for example, to take on at least two lucrative high-rise projects that I believed were wrong – even if, with some stretching, one could say they were within ‘policy’.\nAs the Dean of the Faculty of the Built Environment at the University of Malta, lecturing on architecture and urban design, what are you seeing in the next generation of architects? What are you teaching them? What is the most important lesson you want them to learn?\nI think there are two important lessons we need to impart. The first is to be critical and the second to have integrity.\nDesign talent needs a fertile base in which to flourish and this base is constituted by the environmental and cultural context in which students grow up. The students who register for our courses, with the ambition of becoming periti, always carry with them the baggage of what they have seen in their home towns and villages; this is what forms their likes and dislikes. They are often, I have found, immune to the ugliness that pervades. However, once we break through that ‘shell’, we find that there is a lot of talent, a lot of awareness of what is wrong and what could be better.\nNot all students are, of course, of the same ability. The question, therefore, is how to ensure that the better students, and hence young professionals, get the more important commissions. Interestingly enough, private clients, wishing to build houses for themselves, do seek out such talented professionals, but for public projects this does not happen. It is mostly about political patronage, or on the basis of who is cheapest.\nThis is why I have militated, within the KTP, for Malta to adopt an Architectural Policy which, for example, would require that commissions for publicly funded projects are invariably awarded after design contests.\nOver the last years, we have presented final year students with local sites that need attention, such as Marsa, Qawra, Gozo, and invited them to collectively study their problems, propose strategies and then formulate their thesis project within those strategies. The Marsa project was a particularly important and successful one – and we even mounted a presentation to the Planning Authority and the local community in the old power station. As a whole, it was a beautiful proposal – which, unfortunately, was ignored. A few months afterwards, the power station started to be demolished!\nYou’ve just stepped out of the role of president of the KTP. How much do these two roles overlap and how much can you continue the work of one within the other, or work together?\nI have stepped down as president of KTP because, as per our statute, the term of office is two years. I am still past president on the council, for the next two years, albeit with much less duties. My role as DLĦ president, therefore, does overlap with that in the KTP.\nHowever, in my view, the positions taken by the KTP council that I led, and the direction we tried to give to the profession, coincide perfectly with the objectives and philosophy of DLĦ. We want a better Malta, and this comes from preserving the good that we have, and from promoting contemporary architecture that will be our legacy for future generations.\nAmong your concerns in your previous position was the PA and, to mention just one issue, the impact its interpretation of policies is having on the country’s built heritage. Do you feel you can battle this monster, responsible for some of the most despicable decisions, better now? Or have you lost some strength? Can it ever be tamed?\nIn the 1980s, the Malta Planning and Environment Authority was the result of a brave political attempt to introduce real planning processes and to combat the free-for-all that resulted from laws such as the infamous Building Development Act. Back then, I was a young professional, active in promoting the Development Planning Act.\n Over the years, it was tweaked by successive legislatures and now it has evolved into a monster, remotely controlled by specific ‘political’ interests, and certainly not effective in promoting the common good. It has developed into an ‘efficient’ machine, where the measure of success is how fast the process of determination of applications is.\nIn fact, the PA is now a misnomer, since it does not actually do any ‘planning’, it only processes applications. In other words, it does development control. It can hardly be otherwise, when the Prime Minister himself has expressed his lack of faith in planning.\nThe drafting of policies is the main tool by which the PA determines applications. These policies are rarely site specific and are also vague enough to be interpreted as is convenient. I once had a case of a planning officer arguing in favour of my client’s proposal on the basis of a specific policy and then, when the Commission indicated its intention to vote otherwise, he used the same policy to argue for refusal!  \nThe system is all wrong. Take the issue of scheduling of iconic heritage buildings. How is it possible for scheduling proposals by the Superintendence of Cultural Heritage to depend on the votes in the executive council in the PA, where the SCH is a very small minority? And how does the PA interpret scheduling? One is required to retain the façade but then ‘policies’ allow you to build a number of floors above. It takes a tour de force, if not a miracle, to make good architecture out of that policy. PA has many design guidelines but not a single one of them requires developments to be beautiful.\nYou ask me whether it can be changed. My answer is: do politicians want it to change?\nThe KTP council had noted that the many NGOs, scattered all over the islands, did not have the clout the development lobby has with politicians and the PA, so a loose alliance was formed to speak with a strong unified voice about heritage management and protection concerns. As president of DLĦ, will you be taking this idea of a cross-party platform further, despite an initial lack of success? And what will it actually take to get the powers that be to listen to you, despite the strong but ineffective public interest?\nI remain of the same opinion and will continue to work in this sense. The initiative that you refer to is just over a year old. It brought together a platform of over 20 NGOs, concerned about what was happening to our built heritage, to collectively launch a Declaration of Concern. We talked to all political groups about it and, as expected, the ones in opposition supported it eagerly.\nIt took us about six months to get to talk to the Prime Minister, and two ministers, about it, and although the meeting was very cordial, with a degree of consensus too, nothing has come out of it yet. We are not done with this initiative!\nThe collaboration between NGOs has, however, continued to grow. DLĦ, and KTP, have worked with other NGOs on a number of issues. For example, we supported Graffiti on their stand on petrol stations. Another grouping of NGOs has collectively filed a judicial letter demanding the publication of the various reports on the proposed Malta-Gozo tunnel, as well as a Strategic Environmental Assessment, as per European and local legislation.\nSome of these demands seem to have been echoed by politicians in Parliament, with, apparently, an approved commitment to publish forthwith the reports that have already been completed, and to publish promptly those that still need to be completed.\nWe will now see whether the Executive faithfully implements what Parliament has decided. However, it is symptomatic of the way things are done in this country. We have a bipartisan agreement to undertake a mega project even when critical reports, supporting or contradicting it, have not been published, and some not yet concluded.\nThe Prime Minister has gone on record saying that the PA will have the last say in approving the project; seriously, though, how on earth could the people, whom the Prime Minister himself appoints, ever contradict his stated desire to build a tunnel?\nAnd what if the consequences are not what we are being promised? Can we delete and start again? \nDLĦ needs more resources, not least someone who would attend PA meetings and make a strong case against certain development applications. Many are fought but few are won. Do you feel this is a necessary tool and do you have a solution?\nThe role of DLĦ, and other NGOs, in attending PA meetings and presenting objections, is a very important one. To a certain extent, it is generally expected that we take up the fight against all sorts of projects.\nDLĦ receives a regular stream of complaints and alerts about proposals to the PA, even from people who are not members of the organisation. And it is difficult to undertake this work solely on the basis of volunteers – no member of the DLĦ council receives a cent of remuneration for their work; and to employ somebody requires funds and resources, which are hard to come by.\nI feel the fact that we, and others such as Flimkien għal Ambjent Aħjar, receive so many of these complaints and worries from the general public is a clear indication they have no faith in the organisations, principally the PA, to act in defence of our built and natural heritage, as it ought to. It is a further measure of the failure of this institution.\nDLĦ will continue in this role, in spite of what could be perceived as a relatively poor rate of success. But we have had successes. DLĦ, with others, was successful in getting the Environment and Planning Review Tribunal to send the Townsquare proposals back for re-design. The court has also recently upheld DLĦ’s action in the case of the Villa St Ignatius debacle.\nThe Zaha Hadid Tower is a really ugly building, crushing an iconic historic building…\nWhen KTP pointed its finger at the PA for breaking its own regulations by allowing the ex-NAAFI (Sea Malta) building to be demolished, the Ombudsman ruled that KTP was right. The PA ignored the Ombudsman and, once again, three NGOs together, DLĦ, KTP and FAA, had to take the PA to court. If we did not continue in this role, who would?\nHow would you describe the state of the Malta you have ‘inherited’ and have you ever felt it was pointless taking on this cause?\nThe state of the visual environment is in a terrible shape. It is not only about ugly buildings, or even buildings that are too high in the context of their location, or even about ODZ. It is about the shabbiness of the places where we live, the ugly hanging electricity wires, the broken pavements, the proliferation of signage poles, the exaggerated photovoltaic panel structures. It is about the acceptance that billboards are an acceptable intrusion in our landscape.\nWhen the late Judge Maurice Caruana Curran set up DLĦ in 1965, the situation in Malta was risking degeneration. The context was a young Malta, suddenly needing, and wanting, to become a modern nation. It was, therefore, also a politically difficult situation. How could development be balanced against preservation? Was it pointless for DLĦ to be set up? Where would we be today if DLĦ had not been set up?\nSo, how can I even accept to think that taking on this cause is pointless.\nWhat are the main goals you set out to achieve during your term of office? What do you consider to be most challenging – from the Gozo tunnel to mega projects, land reclamation and the destruction of more historical buildings and gardens as outlined by your predecessor Maria Grazia Cassar? And the most crucial?\nThere are so many issues, and it is unrealistic to expect that we will be able to fight on all fronts. It is not productive to always have to be the ones to say no. In fact, DLĦ has never been against development – only against ugly and out-of-scale development, unnecessary speculation, and destruction of our built and natural heritage.\nDLĦ has also endeavoured to undertake what it preached. From the first project of the Ħal Millieri Chapel in the 1970s, it has been given, by the government, the guardianship of a number of properties, which it has restored, thanks to the support of its sponsors, and opened them to the public.\nDLĦ and its volunteers have saved 51 national monuments and landmarks since 1965, and all with funds raised without any help from the State. DLĦ was, and remains, a protagonist in the promotion and management of the Park Majjistral.\nI would dearly like to see DLĦ take an even more proactive role in the defence of other areas of high landscape value, not just to promote leisure and amenity, but also to promote, for example, heritage agriculture. DLĦ will work to promote the preparation of professional landscape plans for our countryside. We will also work to promote green open spaces in our urban areas.\nDLĦ also has to make better use of the media to promote its message that our well-being in the future depends on how we look after our built and natural inheritance.\nAt the end of it all, what is the one project you would want to have stopped, contained, or achieved?\nOne project I really believe is a mistake, which I wish could be undone, is the Zaha Hadid Tower. The building was designed by a ‘great’ architectural firm – Zaha Hadid was already dead when it was designed. The PA even reduced its planning gain fees because of the additional ‘costs’ to the developer, given his engagement of a top firm.\nThis, therefore, seems to inhibit us from saying that it is a really ugly building, out of scale with its surroundings, and crushing, in the ugliest way possible, an iconic historic building, Mercury House, which the PA believes is being preserved for posterity!\nIs there any way that some of the damage already done can be undone? Can ugly architecture be torn down? Or have we reached a point of no return?\nOther countries have shown that it is possible to undo damage caused by building mistakes. Whether or not this could be done in Malta depends on how strongly future governments would wish to take it through.\nI think that, in some areas, this will be inevitable. We have a limited land area and, therefore, we cannot afford under-utilised or badly utilised land. By this, I do not mean land where the density of habitation is low but areas where the quality of life is poor, and poor because of the urban environment. Fragmented ownership issues obviously make this process complex and fraught with difficulties.\nNevertheless, I cannot accept that there is any area in Malta that is beyond redemption.\nHowever, we must act now to preserve what has not yet been ruined. It is necessary to radically change our collective approach. Instead of paying lip service to the concept of sustainability, we must really ensure that what we build today is a worthwhile legacy for our children.\nThis requires, in the words of Fiona Reynolds, an almighty “Fight for Beauty”. I believe that one first step ought to be to give the voice of civil society, and NGOs such as ours, a strength enshrined within the Constitution, for matters relating to the protection and promotion of the built, cultural and natural heritage. And we will certainly be campaigning for this.", "comment_count": 44, "id": 2863}, {"keywords": "", "author": "Anthony Manduca", "article_body": "A number of politicians and experts were asked for their thoughts on Malta’s EU membership as the 15th anniversary of accession, on May 1, approaches.\nQuestion asked“Fifteen years after Malta joined the EU, what do you consider to be the major gains of our accession and where has the EU fallen short of meeting the country’s needs?”\n‘What makes us ‘European’ are the EU values we have embraced’\n\nJoseph MuscatPrime Minister and Labour Party leader\n“Although Malta has been a member of the European Union for 15 years, what truly makes us Maltese ‘European’ are the common EU values we have embraced: human rights, democracy and peace. And our dedication to equality for all our citizens, which is why we have introduced gay marriage, given our 16-year-olds the right to vote, plus free childcare for women wanting to return to work.\nBy joining the EU, Malta gained access to its internal market – a market of over 500 million people. People who are free to study and work in Malta, like many Maltese have done in other Member States. This has given many of us invaluable work experience, and our students the chance to learn about other cultures through programmes like ERASMUS, making friends for life from all over the EU.\nWe also benefit from trade deals with countries like Japan, which we would not be able to enjoy outside of the EU. And EU funding: Malta has one of the highest project selection rates in Europe. Projects that are benefitting the whole population, from improving our roads and infrastructure, to the restoration of our historic buildings.\nHowever, more can always be done to communicate the benefits of membership to combat the rise in extreme views and another Member State opting for a Brexit-style EU exit. More especially needs to be done to address the current migration situation, from tackling its root causes to devising a fairer system of distribution amongst all Member States.”\n‘A success story, but expected more support over migration’\n\nLawrence GonziFormer Prime Minister and Nationalist Party leader\n“Malta’s accession to the European Union and our subsequent decision to join the eurozone have both proved to be a success story in all aspects. The crucial test was faced and overcome during the 2007-2013 financial crisis when Malta outperformed some other EU and non-EU States economically, financially and socially.\nOur accession has seen unprecedented investment in services, manufacturing, infrastructure, environment, heritage and education – all of which continues to generate results to this very day.\nNotwithstanding our disadvantages as the smallest Member State, our size and our location were leveraged thanks to our integration in the internal market and, of course, the Mediterranean dimension we bring to the table.\nEddie Fenech Adami speaking in Athens after signing Malta’s EU Accession Treaty in April 2003.\nIn the meantime, our younger generations (today 15 years older) have enjoyed new and exciting opportunities in European universities, European business and European institutions, all of which feeds into our national realities every single day.\nThis did not happen by chance or because we were lucky. It happened thanks to a lot of hard work and most importantly thanks to our reputation as a vibrant, young and honest democracy.\nThere are, of course, areas where some of us expected more from our membership. I personally expected more support and understanding when Malta faced a major European migration crisis – much larger than what we are facing today. This was not always a failure of the European Commission and its institutions.\nThe Commission, the European Parliament and most of the other crucial agencies did indeed provide some support. But some other Prime Ministers sitting around the European Council table decided that their national political realities were more important than the value of solidarity among European peoples – an issue that continues to disappoint everyone to this very day and that will undoubtedly play a crucial role in the forthcoming European Parliament elections.”\n‘The single most important event, but there have been let-downs’\n\nSimon BusuttilFormer Nationalist Party leader\n“Just last week we learnt from a Eurobarometer survey that just 12 per cent of Maltese would vote to leave the EU.\nThis is proof, if any was needed, that EU membership has changed our country for the better and laid the foundations for the prosperity that we enjoy today. Our prosperity did not come from thin air. It came from EU membership. \nThe gains of accession have been so substantial that they beg the question of why we had to endure more than 10 years of political bickering over whether we should join. \nThe daily lives of countless people have changed since 2004 as a result of membership. \nToday, thousands of people work in a sector that did not even exist before accession. Others work abroad because EU membership gave us a right to do so. Consumers benefit from internet-shopping, mobile-telephony and low-cost travel as a result of EU laws. Society benefits from infrastructure built with EU money. \nYou can go on and on. \nBut most importantly, membership gave us EU citizenship and we now have citizenship rights in a continent of half a billion, rather than just in a country of half a million. EU citizenship is truly priceless. \nThere have also been let-downs and I expected more help from the EU on immigration and the scandalous sale-of-citizenship scheme. Most regrettably, I expected the EU to be quicker and stronger in helping us fight the corruption, the wholesale hijacking of our institutions and the gradual erosion of democracy that we have witnessed in Malta since 2013. \nThat said, there is no doubt in my mind that EU membership has been the single most important event in our country since independence and that it has truly changed the course of our history.”\n‘Will tourism, financial services, construction and e-gaming share the fate of manufacturing and farming?’\n\nAlfred SantFormer Prime Minister and Labour Party leader\n“The promise in economic terms, was that EU membership would greatly enhance Malta’s attractiveness as a location for new investment and improve competitiveness among local operators. Transition periods would allow Maltese enterprises to achieve EU standards painlessly, while Maltese consumers would get better quality at cheaper prices.\nMoreover, Malta would acquire significant EU funds. These would pay for infrastructural investments and contain the initial tough adaptations that firms would undergo.\nThe 15 years subsequent to EU membership can be split into two phases. One ran for practically 10 years, while economic growth rates remained low to very low. During the second phase, covering the following five years or so, growth really took off.\nDuring phase 1, promised EU funds were received, sometimes with lags that disrupted project outcomes. They featured prominently in the government budget, fuelling infrastructural projects, and temporary support programmes for sectors like agriculture.\nYet, the government’s budgetary performance constantly risked breaching EU rules that cover public debt and financial deficits of Member States.\nArguably, this became more pronounced when eventually EU funds were limited to project allocations, that excluded grants-in-aid. Meanwhile too, Malta was paying into the EU budget its own membership dues which though rarely mentioned, increased progressively over the years.\nStill, the expected surge in private investment hardly materialised. For an initial three years, financial services performed dully. Similarly tourism.\nBy contrast in phase 2, post-2013, economic activity surged to unprecedented growth rates that still prevail. The shift was effected because Maltese economic policy stopped only emphasising the need to satisfy the EU’s budgetary strictures and went beyond them to stimulate foreign investment, especially in services.\nTourism, financial, maritime and freeport services, construction, e-gaming have become the name of the game. Ironically, up to now these sectors are subject to minimal EU regulation, which is bound to change.  Will they then share the fate of manufacturing and farming?”\n‘Malta’s EU and eurozone membership provides safeguards to investors’\n\nLawrence ZammitEconomist and chairman of Misco\n“Malta has made significant gains since joining the European Union in 2004. I strongly believe that we have managed to exploit all the benefits that were envisaged at the time we applied for membership and during the negotiations phase. One way of looking at this is by seeking to understand how our country would have performed economically, socially and politically had we not joined the European Union in 2004 and the eurozone in 2008. It is easy to mention the funds that Malta has benefitted from as a result of joining the EU.\nHowever we should also mention other things. We form an integral part of the European project, to which Maltese have generally aspired. The fact that Malta is a member of the EU and the eurozone provides safeguards to foreign investors, on which our economy depends significantly. The seeds of the economic growth we enjoy today were sown when we took the decision to join the European Union.\nOur integration into Europe has also brought about a greater realisation of the principles of freedom that we cherish. Our EU membership has also made our society more willing to embrace diversity. It has strengthened our democracy.\nHas the EU fallen short of Malta’s needs? I do not really think so. We need to appreciate that there are certain issues that we need to resolve and we cannot expect the EU to resolve them for us. It is important to note that at the time of the EU referendum 54 per cent had voted in favour of EU membership. Today surveys show that around 75 per cent of the population in Malta believe that the country will be worse off outside the EU.”\n‘Security a major concern’\n\nMandy FalzonHead of Malta-EU Steering and Action Committee (MEUSAC)\n“Overall, I think Malta’s accession to the EU had a positive impact on Malta’s economy, the quality of life of Maltese citizens and the opportunities brought about by the single market, particularly the freedom of movement of goods, services, people and capital.\nThe EU has contributed towards improving the quality standards of the food we consume, the toys our children play with, the possibility to study and work in other EU Member States and the major investment carried out on Malta’s infrastructure and human capital as a result of EU funding.\nMaltese citizens have consistently shown they are in favour of EU membership, however security remains a major concern for them. The EU has often been rebuked by citizens for failing to find a common European response to this problem. \nAnother issue is the one-size-fits-all approach which, at times, is not always appropriate for a Union of 500 million citizens. As the smallest EU Member State, Malta has advocated frequently on the need to have policies that take into account the different characteristics and size of different EU Member States particularly for certain sectors of the economy such as agriculture.\nMEUSAC will continue to act as a bridge between the citizens and the EU to ensure that EU membership remains a success story.”\n‘EU has changed our mindset’\n\nSimon De CesarePresident, Malta Business Bureau\n“Malta has gained substantially from EU membership. The most visible is the investment in capital projects that were accomplished thanks to the co-financing from the EU budget, whereby EU cohesion funds contributed heavily among others towards upgrading the road infrastructure, new health and education facilities, and renovating our cultural heritage.\nThis enabled industry and commerce to flourish, our tourism product became more attractive, and the wellbeing of citizens improved. But EU membership has enabled much more than what meets the eye. It consolidated Malta on the map of the developed world; it opened internationalisation prospects to our businesses with market access to third countries worldwide; and it improved the general standard of living.\nMost of all and more importantly, I believe the EU has changed the mindset of the Maltese, who are now a people that is more open and ambitious to travel, study, live and do business abroad.\nOn the other hand, the EU has undoubtedly let Malta down on the issue of migration. It is true that this is mostly due to the lack of solidarity of several Member States, but ultimately it remains an EU failure. Facing a reality of ageing population in Europe and an immediate skills crisis, one would have expected that the EU is able to turn the migration challenge into an opportunity, primarily through fair burden-sharing, and secondly, with a strong vision of integrating migrants in the labour market, as well as their second generation in formal education and training.\nThis way, Europe would increase productivity, and also spreads the weight of social contributions on a larger pool of people, while relieving stress from our current systems that are not sustainable in the long term.”", "comment_count": 11, "id": 2864}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government has committed to giving the nurses’ union Mount Carmel Hospital renovation time frames by next week, Tiems of Malta has learnt.\nMalta Union of Midwives and Nurses (MUMN) president Paul Pace said that the nurses were promised by the Health Ministry that the time frames would be supplied by “next week”.\nOn Wednesday, the newspaper reported that the union had threatened the government with industrial action if it did not provide time frames that outline the work planned for the hospital.\nIn comments to the newspaper following the meeting, Mr Pace confirmed that the ministry had indeed agreed to provide the union with the timeframes. The union head, however, was quick to point out that nurses would only be assured once the time frames were actually in hand.\n“We’ve been here before. The government promises things and then fails to deliver them. So we have to wait and see whether these will actually be supplied,” Mr Pace said.\nUnion not highly optimistic promises would be kept\nThe move comes in the wake of reports in the Times of Malta that most of the wards at the country’s only mental health hospital have condemned ceilings. As a result, patients have been crammed into a few wards, with beds lined up too close to each other.\nAccording to Mr Pace, during a meeting on Wednesday, the government had also committed to bringing in more contractors in order to carry out the much-needed work at the hospital. On this aspect too, he said, the union was somewhat sceptical and was “still not highly optimistic” that the promises would be kept.\nAccording to the Health Ministry, the hospital “today is a safer place” since all structures have been reviewed and dangerous areas have been closed off.\nA ministry spokeswoman has also said that the project to renovate the hospital is proceeding according to plan and “by summer” two wards would be completely refurbished and ready to house patients. \n ", "comment_count": 1, "id": 2865}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prosecutors in the United States have hit back at claims that a reference to Seyed Ali Sadr Hashemenijad’s link to Malta made in the criminal case built against him forms part of a misleading and irrelevant narrative.\nLawyers for the former Pilatus Bank chairman last month asked the US courts to dismiss the “vague and overbroad allegations” against him.\nMr Sadr, whose wedding guests in 2015 included Prime Minister Joseph Muscat and his top aide Keith Schembri, was last year charged with money-laundering and sanction busting by US prosecutors.\nRead: US prosecutors gained warrant to search Sadr e-mails in 2014\nHe stands accused of having disguised the origins of $115 million worth of transfers for an Iranian-Venezuelan housing project, in violation of US sanctions against Iran.\nDr Muscat has insisted the charges against him have no link to Malta.\nApart from the oblique references to Mr Hashemenijad’s role in Malta, no direct evidence has emerged from prosecutors linking Pilatus Bank or Malta to the case.\nPilatus Bank’s licence was formally withdrawn by the European Central Bank in November 2018.\nAs part of his motion to dismiss the charges against him, Mr Hashemenijad’s lawyers complained about the description of his leadership position “at a Maltese bank” and references to how the US financial intelligence and enforcement agency had sanctioned Maltese entities for acting as fronts for sanctioned Iranian entities.\nThe lawyers also attacked references to incidents unrelated to the project in Venezuela.\nIn a reply to Mr Sadr’s motion, prosecutors said these references made in a warrant affidavit outlined a “sprawling, multinational criminal scheme to illicitly move US dollars through banks located in New York, and which involved the governments of Iran and Venezuela, entities and individuals in each country, and entities and bank accounts located in offshore jurisdictions like Switzerland, Saint Kitts & Nevis, and Malta”.\nCourt filings indicate that Mr Hashemenijad, who bought a Saint Kitts & Nevis passport, wanted to distance himself from Iran while setting up Pilatus Bank.\nIn an August 2012 e-mail to a certain Linet Estiroti, Mr Hashemenijad said that “bank accounts are needed, with a new bank, and no one should mention any ties from me to Iran. This is only to own Pilatus and the bank in Malta”.\nLinet Estiroti is also mentioned in a leaked FIAU report as having received communication from Nexia BT’s Karl Cini to set up a Pilatus Bank account for Cheng Chen, one of the negotiators in the €320 million part-sale of Enemalta to Shanghai Electric.\nAccording to the 2015 e-mail correspondence, Mr Chen was expecting to receive €1 million in the account. No such transactions ever took place.\n ", "comment_count": 46, "id": 2866}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Valletta 2018 and the run-up to the European Capital of Culture year led to an estimated €167 million in public and private investment in the capital, according to a new study.\nBut while investment rose dramatically since the title was announced in 2013, the Valletta 2018-commissioned study also pinpointed another trend: homes being sold off to become commercial establishments, the large part tourist-focused, lending credence to residents’ fears over the change in the city’s social fabric.\nThe Investment Survey, carried out by researchers at the Economic Policy Department of the Finance Ministry, aimed to quantify the magnitude of investment and the extent of development in Valletta across different sectors.\nNearly half of the €167 million investment it found was in cultural heritage, including the Valletta 2018 flagship projects: the art museum Muża, the Valletta Design Cluster at the Old Civil Abattoir, and works at Strait Street.\nAnother €20 million were spent on squares and gardens such as Tritons’ Square, Castille Square and the recently inaugurated Ġnien Laparelli.\nThe major spin-off of this investment was in hospitality services: more than a fifth of all investment – around €35 million – was in hotels, restaurants and bars, which is more than was invested in homes, offices and retail outlets combined.\nAs a result, employment in the Valletta hospitality sector rose by 62% between 2012 and 2018, compared to just 19 per cent across the whole of Malta. The growth was equivalent to 250 additional jobs in Valletta.\nMoreover, the study estimated that this investment added €72 million in economic activity – €89 million in nominal GDP – and generated around 153 full-time jobs in the construction sector.\nWhile construction was a major winner out of the sky-high investment, even larger benefits were reaped by the IT and communications industries, while the sales, art and heritage and machinery and equipment industries also experienced significant positive impacts.\nHowever, the study authors do acknowledge that not all these impacts can be directly traced to Valletta 2018: for a start, the study assumes the investment in cultural heritage would not have taken place regardless, which the authors say “is not necessarily completely true though it is reasonable to assume that it is true to a large extent”.\nThey also accept that other factors, such as the 2017 EU Presidency, could have impacted the capital in the same time period, and that Valletta 2018 also had an effect on the rest of the country, meaning a straight comparison between Valletta and the rest of Malta could be less than perfect.\n“There are no perfect experiments in real life and the following results should thus be considered indicative,” they acknowledge.\nGraphics: Design Studio\nHomes become hotels\nThe number of residential permits issued for Valletta doubled between 2012 and 2017, although this was far lower than the rate of growth in the rest of the country, “possibly indicative of planning constraints in Valletta as a world heritage site”, according to the study.\nAt the same time, demand – as measured by contracts of sale negotiated in Valletta – far outstripped the rest of the country, and prices similarly rose quicker than elsewhere around Malta.\nHowever, when it came to commercial properties, there was no such price spike, despite a substantial increase in demand that was stronger than in the rest of Malta.\nThe authors suggest that this is “probably due to an overall shift in residential properties converted into commercial properties, particularly in the accommodation sector”.\nThis trend is particularly noteworthy. Other research commissioned by the Valletta 2018 Foundation, an anthropological study, found widespread complaints among residents that the capital was being “depopulated” even as more boutique hotels and commercial establishments opened.", "comment_count": 6, "id": 2867}, {"keywords": "", "author": "Denise Grech ", "article_body": "Prime Minister Joseph Muscat appeared to hint about his future plans on Sunday when he told Labour Party delegates that \"Joseph Muscat will not stop abruptly\".\nDr Muscat has repeatedly declared since the last general election that he will not contest another general election, and two terms as Prime Minister are enough.\nHe has not, however, said when he will step down and whether he will step down from both the government and the party leadership. He has not ruled out seeking a top EU post. \nHis remark on Sunday was greeted by long applause by the delegates, many of whom have been calling for him to stay on.\n'Biggest open space' project\nEarlier in his address, Dr Muscat said the government will be allocating land for the \"biggest open space project\" in a generation.\nHe did not mention where the area will be, but said more information will be given in the coming days.\nThe space would be for people to spend quality of time with their family, he said.\nClosing off the Labour party general conference, Dr Muscat said people's priorities had changed amid vast economic progress.\nTheir priority is no longer making money, but spending quality of time with their family, he said. People could now afford to look at their quality of life instead of worrying only about making ends meet.\nThe government will also be implementing other plans to improve the environment, such as giving incentives to those charging their electric vehicles at home and making Gozo the first island to shift to electric cars.\nIt might seem ambitious to make such drastic shifts, but when has the Labour party ever ran away from a challenge, the Prime Minister said to applause.\nThis mentality, he said, needed to be echoed in the country. It also needed to be echoed in other sectors, such as in sports.\nDr Muscat encouraged a \"winner's attitude\", saying people to be disciplined to achieve their goals. \"We need a winner's attitude because we are a country of winners,\" he said.\nAffordable housing initiatives\nAffordable housing has become an issue, with those who did not own property struggling to rent or buy, the Prime Minister acknowledged.\nA project giving a leg up to those who truly could not afford proper housing, and could help provide another layer of stability and protection to those who need it.\n\"We want to help people who need to work two jobs to make ends meet,\" Dr Muscat said. \"We need to give positive measures so those who feel left behind can be given a boost\", he added.\nThe government wanted to do this because it never forgot its roots and always thought of those that needed help.\n'Who is more competent: Joseph or Delia?'\nDr Muscat said he did not speak about the upcoming May elections during his speech, despite the annual general conference marking the start of the Labour party European Parliament and local council campaign.\nThis was because he did not believe in simply speaking about matters during election campaigns, only to later forget them. \"Elections come and go. Politicians come and go,\" he said.\nThe Prime Minister ended his speech by encouraging people to make a choice, between which of the two party leaders is more competent and who delivers.\n\"Who is [the person] you know where you stand with? Joseph or Delia,\" he asked.\n\"Who can offer solutions: Joseph or Delia? Who has a vision for our children: Joseph or Delia,\" he asked supporters as the audience erupted into chants of \"Joseph, Joseph\".\n\"I can assure you that Joseph will not stop abruptly,\" he told the crowd gathered at the Labour party headquarters.\nForeigners in Malta\nIn a clear dig at PN leader Adrian Delia’s warnings over foreigners working in Malta, Dr Muscat asked: “Can someone explain how it is a problem that EU members are coming to work here instead of the other way around?”\nInternational companies were saying they could not find Maltese people to work despite offering decent wages and so needed to turn to foreigners, Dr Muscat said. “I would much rather have an international company to stay in Malta but bring in foreign workers rather than shut down and leave,” he added.\nEight years ago, you would hear stories of 200 people who lost their job because a factory shut down and the Prime Minister at the time would try to console them. The present government, on the other hand, needed to console employers because they could not find enough people, he said.", "comment_count": 244, "id": 2868}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta’s economy is only stronger because of the rapid growth in population, Opposition leader Adrian Delia insisted this morning.\nAddressing delegates during the Nationalist Party’s general council held at the party headquarters, Dr Delia iterated the claim that the government “did not have a plan” and that it was only interested in attracting “big business”.\n“Instead of the middle class doing better, as promised by Prime Minister Joseph Muscat, this government is only looking out for the ‘big business’ and so only the ‘big guys’ are favoured. Direct orders for the select few now run into the millions.\n“All the while, the government continues to import slavery with workers brought here to live in containers and live off €400,” Dr Delia said.\nThe PN leader also insisted that the party would always seek to protect life from conception, unlike the Labour Party who he said was onboard with the European socialists’ pro-choice stance.\n“The European socialists believe that there should be choice over life and the Labour Party agreed. The PN thinks differently. We will never change our view on this and we will continue to protect life from conception,” Dr Delia said.\nOn Malta’s reputation abroad, Dr Delia said that the government was tarnishing it and was only interest in “secret contracts” that benefit the few.\n“The MoneyVal report says that we are at risk of getting blacklisted and that the serious investors who are truly interested in investment will start avoiding us.\nThe Venice Commission also flagged serious concerns. Here, again, the government says that it agrees with the conclusions but then it goes ahead and appoints new members to the judiciary anyway.\n“We have an arrogant government that does not care about anything,” the PN leader went on.\nOn the party’s vision ahead of the May elections for both the European Parliament and local councils, Dr Delia said that the PN did not want to practice politics of hate but that of hope.\nThe party, he said, believed in the energy sector and the positive impact this can have on the country if managed properly.\n“We believe that the energy sector is an opportunity. We are currently at the bottom of the energy targets list. We haven’t even reached our own targets.\n“We believe that we can be ambitious and that Malta really can be the best in Europe. We are blessed with resources – sun, wind, waves. We can show Europe that even in a sector corrupted by this government, we can bring about change,” he said.\nOn environment and transport, Dr Delia accused the government of taking the people for a ride, again claiming that the Labour government did not have a plan.\nUnlike the Labour Party, the PN would ensure that the people’s quality of life is improved and that its politicians were putting themselves out there to serve and not to destroy, he said.\nMeanwhile, speaking ahead of the PN leader, the lead candidate for the European People's Party (EPP) Manfred Weber said that party embodied what it meant to be party of the European Union. The EPP, he said, had fundamental convictions that it believed in and that were all about “the European way of life”.\n“We see the challenges but we have a proper answer. You can trust in the EPP. We have a good idea of the fundamental principles and we are not a populist party,” he said.\nAcknowledging that the bloc faced certain challenges, Mr Weber said that the EU is not about small countries or big countries, or those coming from the north or the south, but about values based on freedom.", "comment_count": 30, "id": 2869}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Valletta foodbank is bracing itself for a tough summer as donations cannot keep up with demand, and it has also branched outside of the capital to be more accessible to people in need.\nAs the demand for food continues to increase, the foodbank this week opened three distribution centres in Paola, St Paul’s Bay and Birkirkara, and is planning on opening another one in Gozo next month.\nWhen the bank first opened in 2015, it distributed 240 packs of food. It is now feeding 100 families per week with numbers still on the increase, administrator Reverend Kim Hurst told the Times of Malta.\nBy the beginning of the week, 27 families had already signed up with the Paola centre alone.\nRun by the St Andrew’s Scots Church, the bank provides food for a few weeks to those facing a crisis, including people who are suddenly made redundant and others who have their benefits halted when admitted to hospital.\nThe foodbank will remain centrally administered from the capital and beneficiaries will still have to go there first in order to ensure they have all documentation in order. They can then pick up food packs from their nearest centre after informing the administrators.\n2,150 packs distributed by the foodbank in eight months\nIn Paola, the bank is working alongside the parish church, after the parish priest offered premises for the distribution of the food packs.\nThe foodbank meanwhile has common clients with Dar Papa Franġisku in Birkirkara, which runs a shelter and a soup kitchen, so it has also started operating from there.\nIt initially struggled to find premises in the St Paul’s Bay Area until the British Residents’ Association, with the support of the landlord, allowed the bank to use its premises.\nThe number of people depending on the food handouts continues to increase, with data showing that 2,150 packs were distributed by the foodbank between January and August of 2018 – more food than the bank had distributed throughout all of 2017.\nThe bulk of the food distributed last year was collected through the 2017 Reverse Advent Calendar campaign.\nWhile this year the foodbank had a “wonderful response” to the calendar campaign and its stockrooms were full to capacity, supplies are running out.\n“With so many mouths to feed, the stock goes down quickly and we are now having to purchase about €500 worth of food a week out of our reserve funds just to keep going.” This was worrying as the amount of food donations was nowhere near enough to cover the demand on the services, Rev Hurst added.\n“The bank always gets a few extra donations around Lent and Easter but we are worried that the number of donations will continue to decline and we are indeed bracing ourselves for a tough summer.”\nThose interested in helping out can log on www.foodbanklifeline.com or look up the Facebook page called Foodbank Lifeline Foundation. More information on help@foodbanklifeline.com or 9950 5425.", "comment_count": 26, "id": 2870}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "Malta is in the “worst constitutional mess” that it has faced since Independence, the Dean of the University of Malta’s Faculty of Laws, Kevin Aquilina, has told The Sunday Times of Malta in reaction to last Thursday’s judicial appointments and the lawsuit that challenged the selection system.\nIt is a sentiment echoed by other legal experts, who also raised the spectre of the appointees’ judgments being tested in the future on human rights grounds.\nThursday’s rushed judicial appointments fly in the face of a report by the Council of Europe’s Venice Commission that says the mechanism of appointments “falls short of ensuring judicial independence”. \nThe government continues to defy international and European human rights instruments, the case law of the European Court of Human Rights and the various bodies which pen negative reports\nCivil society organisation Repubblika latched onto the report by the world’s most eminent constitutional body to mount the unprecedented challenge in the constitutional court. In a day of legal drama, the urgent lawsuit reached the constitutional court at 12.30pm on Thursday, which led to Mr Justice Mark Chetcuti giving the Prime Minister 24 hours to reply and appointing an urgent hearing for Monday morning.\nNinety minutes later another urgent application requested a stay of the appointments but this was rejected by the judge on the basis that the “prejudice [caused by the appointments] is not irremediable”.\nThis allowed the appointments to go ahead an hour later at the Palace in Valletta just down the road from the law courts.  \nBut according to Prof. Aquilina, “Prudence should have dictated that the judicial appointments should not have been rushed through bearing in mind that there were a number of factors which militated against such appointments.”\nAside from the constitutional challenge itself, he cites various factors: failure to revamp the judicial selection mechanism as recommended by the Venice Commission and Bonello Commission; the fact that the current mechanism has been deemed flawed within the context of Strasbourg case law and expert reports; and the cascade of other recent reports “in the same vein as the Venice Commission report that there is a serious rule of law problem in Malta”.\nYet another factor is that the Justice Minister moved first readings of bills inspired by aspects of the Venice Commission report without publishing the bills in the Government Gazette.\n“By its inaction, the Maltese government continues to defy these international and European human rights instruments, the case law of the European Court of Human Rights as well as the various bodies which are, and will continue, to pen negative reports,” Prof. Aquilina said.\n“Malta is currently being disgraced all over the world through such governmental conduct, reaping serious reputational harm to the country.”\nThe dean sat on the Bonello Commission in 2013, which advised the government on comprehensive reform of the justice system, including judicial appointments. But he has since become a strident critic of the government for ignoring its own commissioned report and instead ushering amendments on judicial appointments in 2016 which he says are in breach of human rights.\nHe blames the government for the current fix, saying it has “acted, and continues to act, in bad faith”.\nHe is also critical of the judge’s decision to reject the request for a stay of last Thursday’s judicial appointments. He points out that although he “understands” that the court “formulated” its decision on a specific article in law, 873(3) of the COCP, “the issue here was not of a purely civil law nature but relates to a more fundamental matter – a constitutional human rights law issue”.\n“If the judicial appointments were to take place, as they have now done, that would have been another breach of Article 39 of the Constitution and Article 6 of the European Convention on Human Rights,” he elaborates. “I say ‘would have been’ not ‘could have been’ because there is case law of the European Court of Human Rights (ECtHR) to this effect.\n“The irremediable harm,” he adds, referring to the judge’s take that the appointments do not constitute ‘irremediable’ prejudice, “lies in the fact that the Constitution is being breached, the European Convention on Human Rights is being breached, and any person who has a pending court case before a judge or magistrate can attack the validity of the decree or decision or judgment on the basis that the appointment made by the government runs counter to the case law of the ECtHR in relation to the impartiality of a judge or magistrate. For the Strasbourg Court all the judiciary appointed since 2013 (and before) lack impartiality.”\nAlthough the judiciary has long been appointed at the choice and discretion of the Prime Minister, the recent evolutions of case law in the ECtHR as well as publication of the Bonello Commission report in 2013, and more significantly the Venice Commission report last December, have all provided points of departure to implement changes to the mechanism of judicial appointments.\nThe significance of Venice Commission reports is that they are often cited in judgments of the ECtHR. And Repubblika’s lawyers Simon Busuttil and Jason Azzopardi are arguing that the Venice Commission report created a point of reference prior to the latest appointments – an argument that has traction in constitutional level courts, according to analysts.\nA European expert in human rights issues who has worked at the ECtHR told The Sunday Times of Malta on condition of anonymity that he cannot foresee the Reppublika constitutional suit progressing directly to the ECtHR because of “procedural issues”. He added: “But the case of judicial appointments being in breach of the right to fair trial is a valid legal argument in a domestic constitutional court, where this is playing out.”\nPointing out that any appointments since 2013 do not comply with Strasbourg case law, Prof. Aquilina adds that there is “no guarantee” that the constitutional court will follow ECtHR judgments on the matter. The constitutional court does not have a good track record, he says: nine out of 10 of constitutional court cases taken to the ECtHR are overturned on human rights violations.\n“The government’s lawyer, the Attorney General, will typically raise all possible conceivable dilatory pleas to delay and cause procrastination on a decision being taken in this case. The courts may embrace the idea of deciding the case on a procedural point so that the substantive points are never decided as they would end up opening a pandora’s box.\nFor the Strasbourg Court all the judiciary appointed since 2013 lack impartiality\n“The outcome would be that the government wins the case and injustice is meted out. It would have to be the ECtHR to eventually be called upon to make things right. By that time the only solution left would be to replace all the judiciary and to rewrite the constitutional provisions on judicial appointment.”\nWill the appointees be suspended? \nIn the context of the constitutional court considering a request to nullify last Thursday’s appointments, an immediate complication is whether the appointees shall serve in the interim.\nA senior source in the legal system who did not wish to be named said: “If the Chief Justice allows them to serve, that would amount to putting pressure on the constitutional court to decide to allow the appointments to stay.”\nAsked to comment on this point, and whether he would be withholding any work to the new appointees until the constitutional case decides on the matter, the Chief Justice said that in view of “pending lawsuit I cannot answer your question”.\nThe president of the Chamber of Commerce, Louis de Gabriele, also declined to comment on these questions for the same reason.\nProf. Aquilina said that “the Chief Justice has no right to suspend them for it is not the fault of the appointees if the government has decided to rush through their appointments”. He added that “once appointed they [the appointees] have to carry out the duties of office”.\nMr Justice Chetcuti’s decision not to put a stay on the appointments last Thursday, on the rationale that the “prejudice” from the appointments is not “irremediable”, implies that the court may decide to suspend or nullify the appointments.\nThe lawsuit itself requests interim measures, primary among them the possible suspension of the appointments until final judgment is delivered.\n\nThe constitutional lawsuit in brief\nThe unprecedented constitutional suit filed by Repubblika posits that the judicial appointments are in breach of right-to-fair-trial provisions of the European Convention on Human Rights, right to effective remedy and fair trial of the EU’s fundamental charter of rights, as well as the Maltese Constitution – independence and impartiality of courts, and the first article, “respect for the fundamental rights and freedoms of the individual”. Another point is that the appointments additionally flout the Treaty of the European Union.\nThe application quotes extensively from last December’s report on Malta by the Venice Commission – this is the point of departure for the lawsuit, and its strongest anchor – and then additionally invokes the EU’s treaty and charter of fundamental rights of EU citizens.\nMuch is made on the precedent set by the European Court of Justice which imposed interim measures on Poland in a case also involving the judiciary, an exposition that raises the possibility that this may be a viable waypoint for Reppublika’s case.\nIn its response, the government draws the battle lines by attacking the lawsuit on various technical and procedural points, including the argument – dismissed in the past by the ECtHR – that the parties have no direct juridical claim to breaches of the right to fair hearing. An argument is also put forward that the Venice Commission makes recommendations in the context of an ‘opinion’, and that these are non-binding.\nThe applicants, the Justice Minister argues, are “absurd” in their requests, which would amount to “paralysing the courts and certainly this is not in the better interest of the administration of justice”.\nThe lawsuit’s confluence of requests seems designed to annul last Thursday’s judicial appointments and ensure that any appointments for the duration of the case, as well as all future appointments, can only be made under a new system devised on the recommendations of the Venice Commission.", "comment_count": 130, "id": 2871}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Changing the culture with regards to construction safety was as important as changing the legislation, according to Catherine Halpin, the CEO of Quad Business Towers.\n“There is definitely no legislation and no health and safety practice that could not be improved in some way. No one should ever be afraid of review. So if we need to look at the legislation, by all means, let us do so, but it should not just be changed for the sake of change,” she told the Times of Malta.\n“There is legislation, there are competent people, and there are plenty of examples of things being done professionally. But unless there is the right culture with regards to safety – from the client to the managers and the employees – all the legislation in the world will not help.”\nFollowing the collapse of an apartment block in Gwardamanġa on Wednesday night, the Chamber of Architects on Thursday had lamented that there was too much fragmentation of responsibilities, and that there were no clear lines of responsibility.\nThere has been a spate of recent accidents over the past months, but these were linked to safety of the workers – a matter that falls under the remit of the Occupational Health and Safety Authority.\nThe recent case was different as it deals with damage to third party property – which falls under the Building Regulation Office, which had not replied to questions sent to it by the time of going to print.\nThe OHSA has a register of ‘competent people’ for employee safety, but the KTP singled out the role of the site manager under the BRO’s legislation, saying that the regulations do not establish “minimum basic training or competencies” – not even that a site manager must be literate.\nCatherine Halpin, the CEO of Quad Business Towers, and Aldo Busuttil, head of AME and site manager for Quad Business Towers. Photo: Chris Sant Fournier\nIf no site manager is identified by the developer/client, then by default the latter must shoulder the liability.\nAldo Busuttil, the head of AME and site manager for Quad Business Towers in Mrieħel, says he has seen considerable improvements over the years. He gave as an example the requirement for hoarding around a building site, which has been a legal requirement for decades but has only been enforced for the past few years.\nHowever, although more developers are taking on safety consultants and appointing professional site managers, he still sees too many projects – often smaller ones – where the role of site manager is done ‘in house’.\nWhat is holding them back? Is it the cost?\n“I can assure you that it does not cost more to do things properly, since if there is proper planning, logistics and preparation, then there are fewer setbacks,” Ms Halpin stressed.\nMr Busuttil is concerned, as was the KTP, that the pressure on contractors to finish a project as quickly as possible may lead them to cut corners – what the KTP described as “the current frenzy to turn around projects as quickly as possible”.\n“A building project is like a pregnant woman – it is going to take nine months and there is nothing you can do to make that time any shorter. But this is what some people are trying to do. The attitude of ‘don’t worry; it’s just for a minute’ should not prevail when just one second can cost someone their life,” he said.\nMr Busuttil quoted from a dozen different pieces of legislation, pointing out anomalies and shortcomings in many of them, but when it comes to tightening it up as the KTP is recommending, while both he and Ms Halpin were all in favour of improvements, they were reluctant to go overboard.\n“The competence required of the site manager depends a great deal on what type of project it is, as there are so many factors – but at the end of the day, having a degree or some other qualification is never going to be as important as having the right culture. You need to have a framework where an employee can come to you if he or she has a concern – and the manager has to be ready to listen,” Ms Halpin said.\nAvoidance of Damage Regulations\nThe developer must identify a site manager to the Building Regulation Office (BRO), or be considered as undertaking the role themselves.\nThe site manager must submit a method statement to the BRO which should be available on the latter’s website, as well as via hard copy.\nDemolition, excavation and construction works must be adequately insured, and cover must be at least €500,000.\nThe developer also has to submit a bank guarantee to the director of the BRO of €3,000 for each storey of developed third party properties contiguous to his site, for the first five properties, and a further €1,000 for each additional one, up to a maximum of €40,000.", "comment_count": 22, "id": 2872}, {"keywords": "", "author": "", "article_body": "Lucky escape\nNo one was hurt when an apartment block in Guardamangia collapsed on Wednesday night moments after the residents fled when they noticed large cracks forming in the walls. An entire corner of the three-storey block, situated on Guardamangia hill, came down at about 10.40pm.\nWhat made the headlines\nIllegal slaughter of horses raises black market sales fears: Reports of horses being slaughtered illegally have given rise to concerns meat could be reaching Maltese consumers via the black market, according to law enforcement and Veterinary Department sources. The sources said the police had been tipped off about the illegal activity possibly taking place at a secluded farm in Siġġiewi. In a subsequent story, the Times of Malta reported that a growing need to feed exotic big cats could be among the main reasons retired racehorses were being illegally slaughtered.\nGeorge Vella.\nPresident’s appeal on judges’ selection: President George Vella on Thursday urged the government to implement “as soon as possible” the Venice Commission’s recommendations on the appointment of the judiciary to ensure their independence. Speaking at the end of a ceremony during which six new members of the judiciary were sworn in, Dr Vella said that, although 2016 constitutional changes – setting up the Judicial Appointments Committee – were recognised positively by the Venice Commission, further changes recommended recently should also be introduced “as soon as possible”. Earlier, NGO Repubblika filed a court application asking it to halt the appointment of new members of the judiciary until the changes recommended by the Venice Commission were implemented. Mr Justice Mark Chetcuti upheld Repubblika’s request to hear the case with urgency, setting the first hearing for tomorrow. As reported by the Times of Malta last month, three sitting magistrates – Francesco Depasquale, Aaron Bugeja and Joanna Vella Cuschieri – were promoted to judges. Lawyers Nadine Lia, Victor Asciak and Bridgette Sultana were appointed magistrates.\nFearne says patients not in danger at Mount Carmel: Parts of Mount Carmel mental health hospital have been evacuated due to serious infrastructural problems, Health Minister Chris Fearne said. He said these parts of the hospital had been sealed off, and the remaining wards did not pose a danger to patients. The Times of Malta reported last week how around three-quarters of the wards at Mount Carmel have condemned ceilings. The Health Minister said the government had decided to commission a study into these infrastructural problems instead of just patching them up, adding that problems in the 150-year-old hospital had not occurred overnight. Meanwhile the nurses’ union (MUMN) said the government must provide it with timelines for the Mount Carmel renovations or risk being faced with industrial action.\nPM ignores Ombudsman on ‘vitiated’ army promotions: Prime Minister Joseph Muscat is refusing to implement recommendations made by the Ombudsman to remedy a “vitiated” army promotions exercise in 2013. A spokesman for the Office of the Ombudsman told the Times of Malta the government had not yet implemented the recommendations made more than a year ago to correct the injustice suffered.\nSenior principals’ exam rules changed during electoral campaign: Civil servants who did not achieve the set pass mark in an examination for senior principals were still promoted after this was lowered following the intervention of the Office of the Prime Minister, the Times of Malta reported. The sudden change of rules, since condemned by the Office of the Ombudsman, took place during the last electoral campaign and the final interviews were held just three weeks before the country went to the polls.\nWorker injured in building collapse: A 24-year-old Senegalese worker was hurt when part of the Swieqi building he was working on collapsed on Wednesday. Neighbourhood residents claimed repeated warnings about the state of the site to health and safety authorities fell on deaf ears until the incident. The authorities, however, insisted officers visited the area twice within the space of a week, issuing stop orders for works on two adjacent sites.\nOne in six students quitting school early: Malta has the second largest number of early school leavers in Europe, with one out of every six students quitting school in their teenage years. The island topped the list with Spain and Romania, however it has managed to halve the share of early school leavers between 2006 and 2018, according to Eurostat. Early school leavers are those aged between 18 and 24 with, at most, lower secondary education and who are not in further education or training. In 2006, a third of Maltese students left school early, a figure that dropped to 17.5 per cent in 2018.\nWhat trended\nMoggi can vote in Malta\nThere was a mixed reaction online to the news that Luciano Moggi, the disgraced former manager of Italian giants Juventus, is eligible to vote in Malta’s local elections and owns a flat in Gżira.\nThe information came to light after a photo of Mr Moggi’s purported voting document was leaked on social media. \n“Everything is for sale for a few years of a surplus which is not benefitting the people except for some miserable wage increases and a €50 cheque every year,” Thomas remarked.\nTo which Anthony replied: “If the Italian Court in its sentence didn’t give him a general interdiction Mr Moggi can vote because he’s an EU citizen. Therefore, don’t write rubbish such as “for sale”, “surplus” and “a €50 cheque”, they have nothing to do with the rights of an EU citizen.\n“What a joke of a country we have become,” Joseph said.\nR referred to the Times of Malta report which stated: “Mr Moggi drew universal condemnation for his purported underhand manoeuvres” and commented: “He must certainly feel at home living here!”\nHowever, Fanny replied: “You forgot to mention that Inter Milan did the same and their sponsors withheld wiretaps to prove it.”\nJennifer perhaps summed up the feelings of many: “I think he feels at home here.”\nJohn, an obvious admirer, exclaimed: “So, I was right! It was him! I see him every morning walking on the Gżira front, and then stopping for Turkish. He has been living in Malta for ages, paying taxes, declaring everything, Grande Moggi!”\nBut Jessica thought the whole thing was a storm in a teacup: “And we should care why exactly? It’ not like he is Toto Rina.”\nThat tunnel\nThere was quite a bit of online support for the 13 NGOs who called the parliamentary resolution in support of a Malta Gozo tunnel “irresponsible” and a “non-starter” as the benefits and impacts of the tunnel were not yet known.\n“All our 69 MPs are in cahoots with each other. Malta needs a clean slate. When will this ever happen?” Joseph asked.\n“You do not pass a motion in Parliament and then conduct studies or wait for the resultsof the studies. First you should finalise all the studies and then you go to Parliament,” K said.\nFrank said the economic and environmental costs of such a project do not justify it.\n“The way forward is to open up the ferry market and include more links with a fast service.”\nWhat they said\n\n“No one is prejudiced by the gathering of evidence.”\nFormer Nationalist Party leader Simon Busuttil speaking in court in reply to Tourism Minister Konrad Mizzi’s request to postpone an inquiry into the Panama Papers until his arguments about a human rights breach before the Constitutional Court were heard.\n“People elected to govern, even if with lopsided majorities, are not exempt from their preeminent duty of dealing openly with the truth.”\nNationalist Party foreign affairs spokesman Carmelo Mifsud Bonnici writing in the Times of Malta about the government’s disregard for the truth.\n\n“The people I’ve spoken to talk about her as Aunty Liz. There’s a kind of familiarity that people feel towards her, especially those who worked with her.”\nRoyal biographer Andrew Morton, who is writing a new book, and who was in Malta to meet people who knew Queen Elizabeth from her time living here.\n“I still remember the day when Air Malta started its first flights in 1974, with scheduled services to London, Birmingham, Manchester, Rome, Frankfurt, Paris and Tripoli.”\nTourism Minister Konrad Mizzi, recalling, in an interview in  Il-Bizzilla, Air Malta’s inflight magazine, the national airline’s first flights in 1974, despite the fact that he was born in November 1977.\n“Malta’s neutrality does not mean closing our eyes and ears to situations.”\nPrime Minister Joseph Muscat defending the government’s decision to reject a Russian request to use Malta’s airspace for military aircraft en route to Venezuela.", "comment_count": 0, "id": 2873}, {"keywords": "", "author": "Denise Grech ", "article_body": "Dumbfounded residents gathered at the foot of Gwardamanġa hill on Saturday, watching as the rest of the unsafe building they once lived in was destroyed.\n“We are still in shock at what happened,” one of the residents told The Sunday Times of Malta.\nThe seven residents of the apartment block were slowly recovering belongings from their apartments after being forced to evacuate with nothing but the clothes on their back. \nPart of the building collapsed late on Wednesday evening, in an incident which outraged the country and raised concerns over the dangers that may sometimes be posed by development works. Residents, however, were now less concerned about losing their home and simply thankful they made it out alive.\nHad the incident happened during the day, a lot of people would have been injured\nWorkers were on Saturday on site to tear down what little remained of the collapsed building, since it was all deemed unsafe.\n“Had the incident happened during the day, a lot of people would have been injured, since the site also has a driving theory testing centre underneath the apartments,” one resident pointed out.\nThe corner wall of the three-storey block came crashing down around 10.40pm, with bricks and concrete rubble spilling onto the road and into a construction site next door. \nThe seven people living in the block of apartments are now living in flats provided by the contractors.\nPublicly available information indicates the site is owned by APD Properties Limited. Developers on the site on Saturday insisted they had done nothing wrong and that it was all “an unfortunate incident”. There was nothing they could have done to prevent it from happening, representatives of the developers said.\nResidents, however, have said they had noticed cracks on the wall for some time.\nThe development had been going on intermittently, at least since 2017, with demolition and excavation works being finalised prior to May 2018. It is not yet known what caused the sudden collapse.\nOn Saturday, the environment NGO Flimkien għal Ambjent Aħjar highlighted the need for authorities to immediately rein in the issuance of building permits and enact long-overdue reforms to stamp out malpractice and restrain “cowboy developers”.\nThe Planning Authority’s “political masters” have blocked any form of planning, while the Building Regulations Office and Occupational Health and Safety Authority lack the staff and motivation to manage this tenfold workload increase and ensure developers work within regulations, the NGO said.", "comment_count": 41, "id": 2874}, {"keywords": "", "author": "", "article_body": "Two motorcyclists were grievously injured in separate accidents on Saturday night.\nIn the first, a 56-year-old Dane who lives in Swieqi was grievously injured when he lost control of his Peugeot Tweet and fell off the bike in Tower Road, Sliema at 11.45pm.\nThe second accident took place in Triq l-Imdina, Żebbuġ, at 1.45am. A 24-year-old man from Santa Venera also lost control of the Kawasaki ZR he was riding, caught the pavement and fell off the bike.\nBoth were taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2875}, {"keywords": "", "author": "Jacob Borg", "article_body": "Two separate money-laundering inquiries into the Prime Minister’s chief of staff Keith Schembri have yet to be concluded, nearly two years after being assigned to the inquiring magistrates. \nBoth inquiries are based on leaked FIAU reports sent to the police’s Economic Crimes Unit for criminal investigation in 2016.\nOne inquiry, being led by Magistrate Natasha Galea Sciberras, is gathering evidence about the reasons behind two €50,000 payments that passed between accountant Brian Tonna and Mr Schembri.\nAnalysis by the FIAU found a reasonable suspicion that the payments were intended as a kickback to Mr Schembri on passport sales to three Russians by Nexia BT, the audit firm owned by Mr Tonna.\nThe other inquiry, spearheaded by Magistrate Josette Demicoli, is analysing €600,000 worth of payments that passed from Mr Schembri to former Allied Group managing director Adrian Hillman through domestic and offshore personal accounts, bank accounts in the names of domestic and offshore companies and through a domestic investment firm.\nBoth magistrates declined to comment on their inquiries\nBoth magistrates declined to comment on the progress of their inquiries and whether they have faced any obstacles in their work when questioned by The Sunday Times of Malta.\nThe progress of the two Schembri inquiries contrasts with that of the Egrant inquiry, concluded last July within 15 months by Magistrate, now newly promoted judge, Aaron Bugeja. The Egrant inquiry started a few weeks before the two Schembri inquiries.\nExpertise initially directed towards Egrant probe\nA source familiar with the work involved said all three inquiries are dependent to varying extents on the cooperation of foreign jurisdictions.\nRequests by the courts for information from foreign jurisdictions are known to take considerable lengths of time, depending on the country involved.\nThe source said a lot of the court expertise being used for the Schembri inquiries was initially tied up in the complex evidence-gathering processes needed for the Egrant probe.\nMr Justice Aaron Bugeja said in the published conclusions for the Egrant inquiry that evidence relevant to the two other probes was obtained during his own inquiry.\nOf the two inquiries, the one being led by Josette Demicoli looks to be the more complex.\nThe money flows being traced in that inquiry involve accounts in Gibraltar and Switzerland, as well as in local financial institutions, including MFSP (since renamed as Zenith Finance), Pilatus Bank, Sparkasse Bank and HSBC.\nIt is likely that this inquiry also requires cooperation from the British Virgin Islands, which holds information about Lester Holdings, the company used by Mr Hillman to receive the payments in US dollars and euros from the Prime Minister’s chief of staff between 2010 and 2015.\nMr Hillman oversaw the award of a lucrative multi-million euro contract for Mr Schembri’s company Kasco to supply printing equipment to Progress Press, Allied Group’s printing arm.\nOn paper, the inquiry being led by Magistrate Galea Sciberras looks the simpler of the two in terms of evidence gathering, as the €100,000 payment between Mr Tonna and Mr Schembri was transferred locally via Pilatus Bank.\nHowever, information would also be needed from the British Virgin Islands, where the company used by Mr Tonna to send the two €50,000 payments was based.\nSuspicions about the purpose of these transactions were raised after the FIAU found €166,000 were sent to Mr Tonna’s Pilatus account by three Russian passport buyers.\nPart of those funds were then transferred on to Mr Schembri for what the men described as a loan repayment for money lent to Mr Tonna in 2012 to help him during his separation proceedings.\nThe Tonnas’ separation deed shows the couple jointly bought a Żejtun field 15 days after the date of the agreement for the €100,000 “loan” to help him with the separation.\nHow does this contrast with Egrant?\nAaron Bugeja was tasked with establishing whether the shell company Egrant was owned by Prime Minister Joseph Muscat’s wife Michelle.\nThe inquiry heard the testimony of 477 witnesses, requested information or assistance from authorities in five countries – Panama, Belgium, Germany, US and the UAE  – and engaged various IT experts and firms.\nThese included foreign firms, such as UK-based firms Ansec IA Ltd, Harbinson Forensics and Key Forensic Services, as well as local IT experts Godwin Caruana and inspector Timothy Zammit.\nIn the UAE’s case, which also happens to be where the mystery company 17 Black is domiciled, no official cooperation was forthcoming.\nThe Egrant inquiry also obtained assurances from Oracle Flexcube banking software experts that information on Pilatus Bank servers could be relied upon “from its first day of operation”.\nWill we know when the inquiries are concluded?\nThere is no procedure or obligation for a magistrate to inform the public that an inquiry has been concluded.\nIt is also up to the discretion of the Attorney General whether to publish the inquiry details or not after a formal request is made. Such a request can be made by any ordinary citizen.\nFor the Egrant inquiry, the Attorney General published a 49-page document containing the main conclusions from the 15-month evidence gathering process.\nJoseph Muscat said in 2017 that his top aide and close friend would have to resign if the inquiries found any wrongdoing.\n\n\n\nInquiry\nSchembri - Hillman\nSchembri - Tonna\nEgrant\n\n\nDate assigned\nMay 25, 2017 (Magistrate Josette Demicoli)\nMay 9, 2017 (Magistate Natasha Galea Sciberras)\nApril 20, 2017 (Aaron Bugeja)\n\n\nJurisdictions associated with money transfers\nMalta, BVI, Gibraltar, Switzerland\nMalta, BVI and potentially Russia\nMalta, the UAE, Panama, the US (via a correspondent bank)\n\n\nFinancial institutions involved\nPilatus Bank, Sparkasse Bank, HSBC Malta, Jskye Bank (Gibralter), unnamed Swiss Bank, MFSP (Zenith Finance) (as mentioned in FIAU report) \nPilatus Bank (as mentioned in FIAU report)\nPilatus Bank, unnamed UAE bank (as alleged by Daphne Caruana Galizia, no evidence resulting)\n\n\nCompanies involved\nKasco (Malta,), Lester Holdings (BVI), Malmos (Gibraltar) \nWillerby Trading (BVI)\nEgrant (Panama), Tillgate (Panama), Hearnville (Panama), Al Sahra FZCO (UAE), Nexia BT (intermediary), Mossack Fonseca (intermediary).\n\n\nStatus\nNot concluded\nNot concluded\nConcluded, no evidence found to support claims\n\n\n\n ", "comment_count": 123, "id": 2876}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta speaks to the dean of the University’s Faculty of Laws on Thursday’s judicial appointments and the lawsuit that challenged the selection system. In another story, it says two separate money-laundering inquiries into the Prime Minister’s chief of staff Keith Schembri have yet to be concluded, nearly two years after being assigned to the inquiring magistrates. It also says that Valletta 2018 and the run-up to the European Capital of Culture year led to an estimated €167 million in public and private investment in the capital.\nThe Malta Independent on Sunday speaks to the Customs director general who says the war on drugs can never be won.\nMaltaToday says fuel stations have been cut down to size in revised policy rules.\nIllum says Rabat mayor Charles Azzopardi is being investigated following corruption allegations.\nIt-Torċa says the Malta Hotels and Restaurants Associations wanted to reduce payment for work on Sundays and public holidays.\nIl-Mument says 112 Labour councillors including eight mayors are not re-contesting the local elections.\nKullħadd says the Labour Party launches its electoral campaign for the European and local elections on Sunday.", "comment_count": 0, "id": 2877}, {"keywords": "Environment", "author": "Alex Vella", "article_body": "The month of May has spring in full swing, with nature swaying sprightly before hot spells of weather start withering away the foliage.  It is the time to relish the joys of the outdoors – the azure skies and warm sunshine, the verdant foliage and colourful bloom, all resplendent against the contrasting deep blue of the beyond in the radiant light that only the Mediterranean clime can secure. \n\nThe ramblers get their charge out of nature in the open countryside.  They crowd the walks every Sunday morning as well as on Wednesday afternoon every fortnight to exercise and socialise in a very delightful way, with the occasional cultural content thrown in to boot. \nThe Association emphasises the benefits of walking, even more regularly, and openly invites all to join freely in the programmed walks.  It is the only way to get to know the real nature of the islands, their wealthy cultural and historical content, their lush landscapes, their weird geographical secrets, and their (alas) fading flora and fauna.\nThe Association takes some encouragement in witnessing the organisation of other walks by individuals whose sole aim is to provide guidance for roaming in the countryside of Malta. They provide safety by guiding through scouted routes.\nThese individuals have the full backing of the Ramblers as they unwittingly fulfil the mission that the Association was set up to achieve – to secure access to the coastline and the countryside, promote a healthier lifestyle, and to entertain friendly gatherings to behold the beauty of the islands’ landscape. They provide security in numbers because one still finds hot-heads who believe they have the God-given right over ages-old paths and lanes, and dare stop any lone rambler from walking through.\nIt is reprehensible that to date no government or authority has found the way of stopping such abuse of power in the countryside that is depriving honest individuals from seeking the freedom, peace and tranquillity of a simple ramble on a trodden pathway on the commons.\nIt was the Ramblers Association that gave momentum to the eventual legislation of the Public Domain Bill, but it is damning that after so many years in the making no benefit has been derived from it. On the contrary, lack of explanation about the significance and the workings of such a bill has fostered unease among landowners, resulting in the unfortunate diffusion of high walls, gates and other contraptions to prevent honest access.   With economic affluence going mostly their way, and taking advantage of the shameful lack of enforcement, land grabbers and rich land owners/tenants are continuously devising novel ways to deprive free access to the common man from large swathes of land and coastal zones. In 2013 what was that call?  Malta tagħhna lkoll!\nStunning scenery around Baħrija.\nMay walks\nMay 5: A lovely walk along valleys around Qormi, taking up Wied is-Sewda, Inċita, to Tal-Ħlas, crossing over to Wied Qirda then descending Wied il-Kbir beneath Tal-Ħandaq and near Qabar tal-Ingliża and Wied iċ-Ċawsli. The starting point is near the Park and Ride, Marsa, across from Lidl entrance.\nMay 12: No walk is scheduled on Mother’s Day.May 15: Dingli Cliffs and inland valleys, along part of the cliff road the walk heads inland towards Wied Ħażrun, Wied ir-Rum and then on to Mtaħleb. The return march will take in scenic country lanes. The easy to moderate walk starts from near Bobbyland Restaurant on Dingli Cliffs.\nMay 19: A very panoramic ramble that from Baħrija descends the valley towards Fomm ir-Riħ and on to Ras il-Pellegrin promontary, with excellent views of Ġnejna bay, Ras il-Karraba, Għajn Tuffieħa bay, and the Ta’ Ċenċ cliffs as backdrop. After a break at Ġnejna bay the ascent starts through a hidden track back up to Fomm ir-Riħ and further on to the chapel of Il-Kuċizzjoni before reaching Baħrija again. The moderate to hard and long ramble kicks off from Baħrija Square near the children’s playground.\nMay 26: A countryside ramble around the natural outskirts of Birżebbuġa taking in the cultural remains of Borgin-Nadur, the valley in Tal-Papa area and old lanes as far as Għar Ħasan, Delimara fort and Kalafrana. The meeting point for the moderate to hard walk is near Al Fresco Restaurant, in Birżebbuġa.\nMay 29: A ramble that hugs the coast between Birżebbuġa and Marsaxlokk and tracks quaint country lanes and paths, starting from near the Marsaxlokk parish church.\nhttp://www.ramblersmalta.orghttp://www.facebook.com/ramblersmalta\nAlex Vella is executive president of the Ramblers’ Association of Malta.\nThe panoramic setting of the chapel of Our Lady of Victories in Mtaħleb.", "comment_count": 0, "id": 2878}, {"keywords": "Gozo", "author": "", "article_body": "JosAnn Cutajar delivered a lecture entitled ‘A Wage for Decent Living’. Dr Cutajar, a Gozitan who lectures at the University of Malta on Gender Studies and Equality, presented demographic data and statistics on the poverty phenomena and its contributing factors in Malta and Gozo. The lecture, organised by the Oasi Foundation, was attended by social workers, doctors and university students.", "comment_count": 0, "id": 2879}, {"keywords": "Gozo", "author": "", "article_body": "On Easter Sunday, Fr Guardian Joe Caruana, OFM, celebrate Mass at St Anthony church in Għajnsielem with the participation of the St Anthony choir and singer Loredana Agius. After Mass, Fr Caruana hosted the children and their parents to a fraternity moment in the convent where he distributed figolli (Easter sweets) to children.", "comment_count": 0, "id": 2880}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Minister Justyne Caruana opened a new temporary exhibition at Il-Ħaġar Museum in Victoria. Exploring Light hosts two important Italian artists, both of whom have been at the Venice Biennale. Walter Coccetta (who lives in Malta) displays around 30 pictures on level 2, while works by Gianfranco Ferroni (protagonist in the Metacosa movement) take up most of the areas around level 0.The exhibition can be viewed all week between 9am and 5pm, until mid June. Entrance is free.", "comment_count": 0, "id": 2881}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Visual and Performing Arts School annual exhibition is on show at the Citadel Cultural Centre in Victoria. The exhibition, opened by Gozo Minister Justyne Caruana, includes works by visual art students attending various courses offered by the visual arts department. Over 400 students, who attend one or various courses, are presenting works in different media, including drawing, painting, printmaking, pyrography, sculpture and installation.\nThe Gozo Visual and Performing Arts  music chamber gave a short recital during the inauguration of the exhibition which is open today and tomorrow between 9am and 5pm.", "comment_count": 0, "id": 2882}, {"keywords": "Education", "author": "", "article_body": "De La Salle College Junior School is currently involved on a fifth Erasmusplus project together with partners from the Czech Republic, Finland, Bulgaria, Latvia and Portugal.\nThe new two-year project, called ‘It’s Time To Care’ (ITTC) aims to continue to deepen and extend the outputs and results of a previous successful international project on an environmental theme called ‘It’s Time to Help’ (ITTH).\nThe ITTC is dealing with problems related to water, energy, school environment, biodiversity, waste and eco-consumers, defined as key challenges in the former project. The aim is to concentrate on deeper analyses of the respective topics and bring forth new ideas and solutions. The topics are:\n• Sustainable use of water – availability of drinking water, its quantity and quality, life in water;\n• Sustainable energy – approach to affordably priced, secure, sustainable and modern power sources;\n• Sustainable towns – availability of quality and safe living and of essential services;\n• Sustainable society – responsible consumption and production, industry, innovation and infrastructure;\n• Climate change – combating and adapting to changes in the climate;\n• Sustainable use of land – life on land, land management and biodiversity decrease.\nThese topics are of interest not only for students and teachers but also the public, specialists in various fields, science centres, enterprises, companies and leisure centres with whom the partners are seeking to exchange experience and ideas to learn about other countries and lifestyles.\nDuring the ITTC project 20 students will be visiting the partner countries to discuss different aspects of sustainability and share successful projects run in the various schools. An integral part of the project will be teachers’ training to develop their personal and professional competences, such as in constructivist teaching methods, collaborative teaching and learning or methods of leading students to develop a conceptual framework and problem-solving skills.\nThe project will use the Science, Technology, Engineering, Art, Maths (STEAM) concept for research education with the prospect to interconnect other school subjects such as ICT, geography, languages and history. By combining work on science experiments with the foreign language learning, it is hoped the project will also improve the participating students’ communicative competences and contribute to further their career orientation and help them decide on their possible further study in technical fields.\nThe partners’ aim is to help each other to intertwine formal and informal education, increase students’ and teachers’ motivation to further their studies and compare their moves, exchange methodology  of science and language teaching, share their work with it and how it influences students’ occupational choice.\nThe ITTC project will use the seven-step methodology of the Eco School programme – analyse, plan, monitor, evaluate, inform, involve and disseminate – in line with the European 2030 Agenda for Sustainable Development Goals (SDGs). The partners are from different parts of Europe so they will have different experiences, possibilities and opportunities on how to elaborate the SDGs further in education.", "comment_count": 0, "id": 2883}, {"keywords": "Gozo", "author": "", "article_body": "A new statue of the Risen Christ, by Manuel Farrugia of Victoria, was inaugurated in Għajnsielem. The wooden plinth in the form of a tomb, supporting the statue, is the work of Anthony and Vince Galea, Frans Vella and Rudolph Cauchi. The statue, blessed by Għajnsielem archpriest Canon Frankie Bajada last Sunday, was commissioned by Salvu and Benna Grima and their family.", "comment_count": 0, "id": 2884}, {"keywords": "Gozo", "author": "", "article_body": "The sum of €2,600 in aid of Puttinu Cares was raised from donations made by people visiting Arkadia commercial centre in Victoria on Easter Saturday. As a token of appreciation visitors were given a slice of a huge Easter torte prepared by David Mercieca of David’s Bakery and his sons Manuel and Mark. To make the torte the Merciecas used 100kg of pastry, 120kg of pure almonds and five kilos of Easter eggs. The torte cost €800 and took 20 hours to complete. Picture shows Puttinu Cares (Gozo) president Carmel Camilleri (second from right) cutting the torte in the presence of Puttinu Cares Gozo committee members and volunteers (from left) Laurence Ciangura, Veronica Camilleri Cauchi, Marie Claire Cefai, secretary Carmen Cefai and Franco Ciangura.", "comment_count": 0, "id": 2885}, {"keywords": "", "author": "", "article_body": "A heart-shaped logo and a 'Malta in our hearts' slogan will be at the centre of the Labour Party's electoral campaign.\nThe party unveiled its campaign slogan, ahead of Joseph Muscat's speechat the general conference on Sunday, which will officially launch the PL's European elections and local councils campaign. \nThe slogan will go head to head with the Nationalist Party's ‘Together for our country’, which also tries to portray a patriotic message.\nThe MEP and local council elections will take place on May 25.\nMeanwhile, the Democratic Party accused the PL of plagiarising its logo and ridiculed the party's underlying message.\n\"Where does the country lie in the Prime Minister's heart when he's sold the country, destroyed the institutions and altered the natural beauty of this country,\" said PD leader and MEP hopeful Godfrey Farrugia.", "comment_count": 42, "id": 2886}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Ombudsman expressed concern and “serious doubts on the real intention of the Office of the Prime Minister” after lowering the benchmark in an examination for senior public servants in 2017.\nCorrespondence between the Ombudsman, the Public Service Commission and Principal Permanent Secretary Mario Cutajar indicates that additional information had surfaced following an investigation that upheld injustice complaints.\nThe Ombudsman noted that the request by the Office of the Prime Minster to lower the pass mark was made through an e-mail on April 20, 2017 at 6.59pm and the PSC’s approval was communicated to Castille the following day at 2.30pm.\n“This office did not find any document in the [PSC’s] file relating to a discussion within the commission itself on the OPM’s request – indeed this was a very prompt no objection,” the Ombudsman commented.\nThe Ombudsman said that during a follow-up meeting with Castille, it was found that while 89 successful candidates were offered the post of senior principal, “about six or seven did not take the appointment” for some reason or other. However, instead of offering the post to those next in line, the Office of the Prime Minister decided to lower the required complement, which the Ombudsman deemed as “juggling with numbers”.\nThe Ombudsman wondered why this happened, once Castille had previously justified the change of the examination’s pass mark to have enough candidates to fill the posts of senior principals. An official told the Ombudsman “the complement has been revised (lowered) and there were no unfilled vacancies”.\n“This sudden change in the complement casts serious doubts on the intentions of the OPM when it was the same office which had requested the [PSC] to lower the pass mark because of the number of vacancies to be filled,” the Ombudsman noted.\nHe accused Castille and the PSC of “perpetuating the injustice” with several candidates who should have been offered the promotion instead of those who refused it.\nThe Office of the Prime Minister justified the change approved by the PSC as a consequence of a sectoral agreement signed with trade unions prior to the call and insisted the lowering of the pass mark was stipulated in the agreement.\nAfter reviewing the agreement, the Ombudsman concluded that “the clause (cited by the OPM) of the agreement cannot validly be called criteria” to lower the pass mark.\nRead: Senior principals’ exam pass mark lowered close to election\nThe Times of Malta reported this week that an investigation by the Ombudsman had concluded that civil servants who did not achieve the set pass mark were still promoted after this was lowered following the intervention of the Office of the Prime Minister a few weeks before the last election.\nThe government insisted that the lowering of the benchmark was necessary to capture the right number of candidates to align with the ratios set in the sectoral agreement. It was a regular procedure and non-discriminatory, it said.\nThe Ombudsman recently complained that most of his recommendations were not being followed by the government.", "comment_count": 32, "id": 2887}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A stormy mother and son relationship spiraled out of control on Friday afternoon, landing the man in court after he allegedly smashed her front door. \nThe 44-year old man was released from preventive arrest on Saturday after denying his alleged wrongdoing.\nThe man, whose constant discord with his mother had been the cause of several incidents, was marched to court under arrest after the umpteenth incident at the family’s Msida home necessitated police intervention.\nUpon his arraignment, the man, whose name was banned from publication under court order, pleaded not guilty to the use of violence, including moral or psychological, threatening and assaulting his mother, causing her to fear violence.\nThe son was further charged with damaging his mother’s property as well as possessing cannabis.\nThe court, presided over by magistrate Monica Vella, was told that matters between the mother and her son had escalated on Friday to the point that the man, who shared his mother’s roof, allegedly smashed her front door.\nAfter hearing submissions by both parties, the court upheld the accused’s request for bail under strict orders to move out of his mother’s home and to undergo rehabilitation for his drug and anger management problems.\nBail was also granted against a personal guarantee of €5,000 and a warning not to approach his mother or her home.\nInspector Bernardette Valletta prosecuted.Lawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2888}, {"keywords": "", "author": "", "article_body": "A boat taking part in the powerboat race overturned off St Paul's Bay on Saturday, with photographer Emanuel Busuttil capturing the moment on camera.\nPolice's Administrative Law Enforcement Unit and an Armed Forces vessel rushed to the scene but nobody was injured. \nThe incident happened off the Wignacourt Tower around 11.40am. ", "comment_count": 25, "id": 2889}, {"keywords": "", "author": "", "article_body": "Eight family members who got involved in an Easter Sunday punch-up in Cospicua were marched to court on Saturday to face charges in a fight in which horse whips and a knife were used. \nThe eight, who all live on just two streets in the town and range in age from 18 to 59, allegedly assaulted various members of a different family who also live in the town. \nTwo of their alleged victims were grievously hurt in the Easter Sunday assault, with two others ending up slightly injured. \nCarmelo Dalli, 59, Fredrick Dalli, 36, Charlston Cassar, 26, Lee Julian Cassar, 25, Josloann Cassar, 25, Redent Cassar, 24, Tristan Cassar, 22 and Kurt David Azzopardi, 18, all stand accused of having breached public peace, threatened and assaulted members of the Brincat family between 2.45pm and 4pm on Easter Sunday.\nThere was already bad blood between the families, with a court having ordered Lee Julian Cassar to stay away from one of the victims, Rodrick Brincat, in a sentence passed late last year.\nFour of the accused were also charged with carrying a weapon without legitimate use. Redent Cassar was also charged with carrying an unlicensed knife and of breaching parole conditions.\nAll eight pleaded not guilty to the various charges they face.\nFredrick Dalli had been granted bail just last month in a separate case, while Charlston Cassar was also out on bail since January.\nProsecuting inspectors Oriana Spiteri and Eman Hayman asked the court to revoke bail for both those men and seize bail deposits of €6,000 and €20,000 respectively.\nThey also asked the court, presided by magistrate Monica Vella, to issue a protection order in favour of the Brincat family involved in the fight.\nAt one point commotion from the family members was heard outside the court room, prompting the magistrate to summon them inside the hall. She initially ordered them detained for one day, but revoked the order after they apologised to the court. \nCarmelo Dalli, Josloann Cassar, Tristan Cassar and Kurt David Azzopardi were granted bail against a personal guarantee of €5,000. Bail was refused for the other four. \nThe other family is expected to be arraigned in the coming days.\nLawyers Franco Debono, Arthur Azzopardi, Amadeus Cachia, Marion Camilleri and Mario Mifsud are counsel for the defence.", "comment_count": 0, "id": 2890}, {"keywords": "", "author": "", "article_body": "The Planning Board's decision to grant a permit to a new petrol station in Burmarrad was roundly condemned by Din l-Art Ħelwa.\nThis decision is especially objectionable since the government has already accepted that the fuel stations policy is flawed and requires revision. The government has failed to provide a sound and timely policy review on the relocation of fuel stations to outside development areas, the NGO said.One consequence of this failure is that Burmarrad will have two massive petrol stations, barely two kilometres apart, with another three petrol stations located within 500m of the northern most petrol station.\nRead: Burmarrad ODZ fuel station approved days before policy review\n\"It is time to end the charade of relocating a tiny roadside pump with 3000 square metre petrol station, complete with car wash, eatery, and offices, on the basis of the excuse that it is beneficial to the community to relocate petrol pumps out of the urban areas. It is not of benefit to the community to lose green areas to unnecessary uses such as more petrol stations.\"The minister responsible for the Planning Authority, Ian Borg, is long overdue in presenting this policy review, in spite of repeated protests by civil society demanding that the revised policy is published immediately.\nRead: Ministers disagree on ODZ fuel stations, but conclusion imminent\nDin l-Art Ħelwa reiterated its demand that no further permits for the relocation of fuel stations from urban to rural areas should be granted until this policy review is satisfactorily concluded, giving priority to the protection of Malta’s dwindling natural environment.The Planning Authority is enabling the destruction and over-exploitation of natural and agricultural land by fuel stations, ignoring the wider picture.", "comment_count": 15, "id": 2891}, {"keywords": "", "author": "", "article_body": "Wednesday's collapse of a block of apartments in Gwardamangia underlines the need for the authorities to immediately rein in the issuance of building permits and enact long-overdue reforms to stamp out malpractice and restrain cowboy developers, an NGO warned on Saturday.\nDevelopers are ill-equipped or uninterested in ensuring proper safety measures or skill checks of workers, Flimkien għal Ambjent Aħjar said in a harshly-worded statement.\nRead: Building collapses in Gwardamanġa, residents out in the streets\nThe real costs to society from 1,500 annual building permits to 15,000 applications are clear for all to see.\nThe Planning Authority’s \"political masters\" have blocked any form of planning, while the Building Regulations Office and Occupational Health and Safety Authority are lacking in staff and motivation to manage this tenfold workload increase and ensure developers work within regulations.\nConstruction workers’ right to work in a safe environment has been ignored for years, leaving the construction sector with an abysmal track record for the highest rate of workplace injuries and deaths. The presence of so many untrained foreigners on building sites hampers communications and has led to many dangerous situations, FAA said.Persons with no experience, training or qualifications are running building sites or operating cranes\nMinimum training standards on the part of contractors, coupled with high demand, has led to a situation where persons with no experience, training or qualifications are running building sites or operating cranes, resulting in poor standards of construction and serious accidents.\nSecond-hand imported cranes, construction vehicles and even lifts are often not adequately inspected, which leads to vehicles belching toxic emissions, or worse, to accidents.\nThe partial collapse of the building in Gwardamanġa. Photo: Matthew Mirabelli\nPoor inspection, police turning a blind eye\nThe police appear to lean towards developers, closing a blind eye to violations like works beginning before 7am, working on public holidays, failure to use vacuum attachments when grinding stone and failure to wash construction vehicles’ wheels when leaving a construction site, resulting in an increase in serious health problems triggered by dust pollution.\n\"Contractors often fail to erect scaffolding, provide safety gear and take over pavements, leaving pedestrians including mothers with strollers and wheelchair users having to risk their lives on busy roads.\"\nCranes, trucks and concrete mixers block Malta’s streets without the necessary permits. Local councils often fail to coordinate works, issuing several permits that block traffic in several adjacent streets, leading to gridlock and adding to air pollution.\nFAA said architects have contributed to the mess by caving in to developers’ demands to squeeze the maximum possible number of units into each site, benefitting in the process. \n\"Allowing developers to excavate within a metre or sometimes right up to the walls of neighbouring buildings, has resulted in several structures collapsing and even in deaths. It has contributed to untold damage to neighbours’ properties all over the islands, often not compensated by the culprits.\n\"The people have tolerated enough and the government must put the brakes on building developments until all safety and environmental rules and regulations are fully complied with.\"", "comment_count": 47, "id": 2892}, {"keywords": "", "author": "", "article_body": "Updated 5.05pm with PN statement\nThe Labour Party officially presented just under 400 candidates for local council elections on Saturday, with Prime Minister Joseph Muscat emphasising the diversity in the PL team. Speaking in Valletta and with rows of candidates on either flank, Dr Muscat highlighted the fact that the PL had candidates who were pensioners and others who have not yet turned 18. 24 per cent of the PL’s council candidates are women – up from 15 per cent last time round – with Dr Muscat saying that achieving gender parity in this respect was still some time away. Around one-third of candidates are younger than 35. The party had a good geographical spread of candidates, the Prime Minister said, with a “drastic” increase in the number of candidates fielded in Gozitan towns and villages. \n\nThe party's group of 398 candidates, he said, was the largest any party had fielded since local councils had been introduced.\nDr Muscat added that the PL would be presenting locality-specific electoral proposals in the coming days, with proposals “tailor-made” to each locality.\nThe Prime Minister and Labour leader thanked candidates from all political parties for having offered themselves for election.\nPM's 'vote of no-confidence' in councils - PN\nThe Prime Minister's declaration that local councils were not a \"super favourite\" of his showed he had no confidence in councils and all candidates, the Nationalist Party said.\nSuch declarations dented the trust in councils and in the democratic process, the PN said in a statement. \nIt was a Nationalist government that conceived local councils in Malta because it believed it was residents who should decide in the best interest of their locality. \n ", "comment_count": 12, "id": 2893}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 1.13pm with video\n“We have lost one of our brothers,” President Emeritus Marie-Louise Coleiro Preca told a crowd gathered to honour the memory of a migrant murdered earlier this month.\nLassana Cisse was walking home on the evening of April 6 when he was shot by a man driving a Toyota Starlet. Almost a month later, police have yet to find the killer or establish a motive, with investigators not ruling out the possibility of it having been a racially-motivated attack.\nSixty-four organisations and around 100 activists gathered in memory of the 44-year old man on Saturday.\nA sombre crowd met in Ħal Far, carrying flowers and holding pictures of Mr Cisse. They laid flowers on the side of the Triq il-Ġebel, where he was killed.\nPeople lay flowers at the memorial site. Video: Chris Sant Fournier\nSome migrants who joined the vigil looked on in melancholy, clearly still moved by the murder.\nWatch: A hit-and-run went unnoticed, until a murder on the same road\nAside from President Emeritus Coleiro Preca, MEP candidates Arnold Cassola, Michael Briguglio and Cyrus Engerer were also present.\n'Not a single bad word'\nFriends of Mr Cisse said he was a gentle and kind man. “You cannot say one bad thing about him,” Ousmane Dicko, who had known Mr Cisse since 2011, said.\n“He respected me like a brother,” he added. “The last I spoke to him was two weeks before, when he came to my wife’s shop to see how we are,” Mr Dicko said.\nPhoto: Denise Grech\nAddressing the vigil, reverend Kim Hurst said the activists had gathered to make peace. Change is made when people stand together, Rev. Hurst said.\nFather Mark Cachia, representing the Catholic community, said the people gathered at Triq il-Ġebel wanted to ensure those left grieving or in fear were not alone.\nThey wanted to stand tall in the face of hostility and cold-heartedness, he said.\nThe crowd held a one-minute silence in memory of Mr Cisse.", "comment_count": 0, "id": 2894}, {"keywords": "", "author": "", "article_body": "Mellieħa local council should take the lead in efforts to restore Selmun's Fort Campbell, chart an eco-tourism plan for the locality and ensure its natural beauty is shielded from rampant development, Alternattiva Demokratika said on Saturday.\nParty chairperson Carmel Cacopardo noted that the town in northern Malta was one of the few in the country where nature continued to play a predominant role.\nAD local council election candidate and Mellieħa resident Luke Caruana  argued that towns like Mellieħa needed green politics to keep development pressures at bay.\nThe proposed Malta-Gozo tunnel, he said by way of example, was a serious environmental threat to towns like Mellieħa and communities in Manikata and l-Għerien.\n“It is unacceptable that other local councillors and candidates have not voiced their concern on this significant impact on our rural communities,” Mr Caruana said.\nThe AD candidate said that he wanted Mellieħa to become greener and “prioritise people over cars”, with more pedestrian zones and the possibility of making main streets more accessible to bicycles, electric taxis and other cleaners forms of transport.", "comment_count": 10, "id": 2895}, {"keywords": "", "author": "", "article_body": "From walking to keep a mother’s memory alive to fashion on the move, the April issue of Pink is packed with action… with a cause. \nMalta’s magazine for women, fresh from The Pink Tea Garden, chronicles its recent wellness event, the first of its kind, through images that capture the essence of the day, centred around all things good, healthy, wholesome, natural and organic.It also focuses once more on the divide between female graduates and their actual take-up at top-level management by speaking to two women who have won business awards and know what it takes to occupy high positions.In the April issue, one grieving daughter manages to turn her mother’s loss into a good cause by organising a walk in her name to raise funds for her preferred charity that takes people to Lourdes.Art finds its place in this issue too, with an interview with the female director of the Maltese movie Limestone Cowboy, out in cinemas, as well as an up-and-coming artist, who has embarked on her first solo exhibition after painting behind the scenes. The leading fashion magazine continues to showcase the latest trends in its anticipated photo shoots that capture the best in the shops and ideas of what’s in store for spring.Pink is a monthly magazine, produced and published by Allied Newspapers Ltd. Get your copy with The Sunday Times of Malta.", "comment_count": 0, "id": 2896}, {"keywords": "", "author": "", "article_body": "Updated at 12.45pm \nThree people were rushed to Mater Dei Hospital by ambulance on Saturday morning after they were hurt in a car crash in Birżebbuġa.\nAn 80-year-old and 72-year-old, both from Birżebbuġa, were riding in a Toyota Vitz. A 21-year-old from Kalkara was driving a BMW 523.\nBoth cars collided on Triq Għar Dalam at around 9.10am, the police said.\nAll three were taken to hospital for further treatment. The elderly couple were both grievously injured in the crash, the police later said. The young man's medical condition remained unknown at the time of writing. ", "comment_count": 0, "id": 2897}, {"keywords": "", "author": "", "article_body": "The European Court of Human Rights has decided not to continue considering a violation claim by six property owners after the government filed a declaration and offered them €22,000 in compensation.\nThe property, a ground-floor tenement in a zone of urban conservation area of terraced houses in Żejtun, had been requisitioned by the housing secretary in June 1974 and assigned to a family as social housing. The matter eventually ended up in court and also before the Rent Regulation Board.\nYears later, in early 2016, the Constitutional Court found that the property owners had suffered a violation of their fundamental right to protection of property. They were awarded €5,000 in pecuniary and moral damages. A request for the eviction of the tenant was, however, rejected.\nRequisitioned by the housing secretary in June 1974\nAn architect last year put the current market value of the property at €200,000 and its rental value since 2014 at €7,800 annually.\nIn the circumstances, the owners still felt their right to protection of their property had not been protected for various reasons. They complained that the compensation of €5,000 was too low, the rent they received was inadequate and once the tenant had not been evicted they practically had no possibility of ever recovering their property. They, therefore, sought recourse to the Court in Strasbourg.\nAttempts were made to reach an out-of-court settlement but they were unsuccessful and, last November, the government informed the Human Rights Court it was willing to declare there had been a violation of the owners’ rights and pay them €22,000.\nHowever, the property owners did not accept, deeming the compensation too low and insisting they still suffered the consequences of the law in force.\nThe committee of three judges handling the case, including Chief Justice Emeritus Vincent De Gaetano, felt that in view of the government’s declaration and the amount of compensation proposed, which, it noted, was consistent with the amounts awarded in similar cases, there was no need to continue examining the case.", "comment_count": 11, "id": 2898}, {"keywords": "", "author": "Jacob Borg", "article_body": "Transparency International has flagged the International Monetary Fund’s failure to mention corruption in a report on Malta it published in February.\nNew IMF research shows that curbing corruption would deliver an additional $1 trillion in tax revenues yearly across the world.\nIn April 2018, the IMF unveiled a framework for enhanced engagement with countries on corruption and governance issues.\nThe international anti-corruption NGO said this week that although the IMF had undoubtedly become more outspoken about the issue since unveiling its new framework, mentions of corruption in the annual reports it compiled about member countries were unevenly distributed.\n“While country reports for South Africa, Malaysia or Brazil have 40 or more mentions of corruption, others like Portugal, Singapore and Malta have none,” Transparency International said.\nTransparency International analysed 60 IMF reports since April 2018, then compared the findings with the previous years’ reports from each country. They found IMF references to terms such as bribery, anti-corruption and money laundering had more than doubled.\nTransparency International noted that while the IMF report about Malta made numerous mentions of anti-money laundering, none were made about corruption.\n“This omission is quite remarkable considering the number of sources pointing to serious reasons for concern,” Transparency International commented.\nIt said a European Commission report, also published in February 2019, featured more than 20 references to corruption in Malta, including that “no significant steps have been taken to strengthen enforcement of the anti-corruption framework.”\nTransparency International said a detailed report by the Council of Europe’s anti-corruption monitoring body went even further, noting an “unprecedented wave of controversies concerning the integrity of senior government officials up to the highest level”.\nThe anti-corruption NGO said one of its own studies, in conjunction with Global Witness, highlighted risks in Malta’s golden visa scheme and reports by the Daphne Project had found multiple cases of suspicious high-level deals.\nAnti-corruption experts in civil society, both in Malta and beyond, could have pointed the IMF review team in the direction of these recent and ongoing reports, Transparency International remarked.\nIt cited the IMF’s omissions about corruption in Malta as an example of how civil society could contribute to its country reviews and also help hold national authorities to accounts once the IMF’s findings were made public.", "comment_count": 29, "id": 2899}, {"keywords": "", "author": "", "article_body": "A woman was grievously hurt on Friday evening when she fell from a ladder at an establishment in Sliema. The 47-year-old, who lives in Birkirkara, was doing some work at an establishment on Tower Road when she fell at around 8.30pm. She was taken to Mater Dei Hospital by ambulance. Police say they are investigating further.", "comment_count": 0, "id": 2900}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Saturday. \nThe Times of Malta reports that Mqabba residents are living in fear of vandals, after two historic buildings were damaged in recent weeks. \nThe Malta Independent writes that caravans are flaunting orders to refrain from parking in a Mellieħa car park and doing so anyway. \nL-Orizzont looks back to the general strike of 1958, saying that it merits greater recognition. \nIn-Nazzjon writes that the government bought hospital equipment before contracts with Vitals Global Health Care had even been finalised. ", "comment_count": 0, "id": 2901}, {"keywords": "", "author": "", "article_body": "Updated at 9.22am\nA man was hospitalised early on Saturday morning following a car crash on Rue d'Argens in Gżira, the police said. \nThe 5am crash involved the 31-year-old Santa Venera resident driving a Peugeot 107 and a 30-year-old Gżira man driving a Mercedes ML250. \nFour parked cars were also damaged in the collision, the police said. Rue d'Argens was closed for an extensive period of time following the crash. \nThe Santa Venera victim was seriously hurt in the incident, police said later. ", "comment_count": 0, "id": 2902}, {"keywords": "", "author": "", "article_body": "Updated at 10am\nA historic arch used to celebrate the feast of St Publius was burnt down to the ground early on Saturday morning, in a fire that raged for 90 minutes and extensively damaged four cars parked nearby. The wooden arch, which dated back to 1899, was completely destroyed in the fire, just one week before the town’s yearly feast for its patron saint. “It’s like a part of the church has fallen,” parish priest Charles Cini told Times of Malta. “It’s an immense loss”. The fire on Triq San Tumas was reported at 1.30am. Firefighters finally managed to put out the flames at 3am.\nIndications fire was intentionalPolice told Times of Malta that a magisterial inquiry led by magistrate Claire Stafrace Zammit is under way. Although officers were reluctant to attribute the fire to arson, initial indications suggest that the fire was intentional.\n\n \nFr Charles said that it looked like the fire had risen up through the arch’s right column, which contains a door and access shaft. Florianites took to Facebook to express their shock at the sudden loss. “We wake up to sad news,” one wrote. “We lost a monument and a piece of art,” feast organisers wrote on Facebook.\nValletta's Għaqda Pawlini also expressed dismay, offering Floriana's feast organisers their condolences and sympathy. \nThe feast of St Publius will go ahead despite the loss, and Fr Charles said that he would like to have the arch rebuilt. “We have the original plans, and we have the will to do so,” he said. “Hopefully we will get the financial aid needed to make that possible”.\nBuilt in 1899, the arch was used regularly until 1939, when the outbreak of World War II forced organisers to put it into long-term storage. It gradually deteriorated and was left to rot for several decades, until a thorough restoration project was undertaken and the arch was brought back out in 1999. It had been in use ever since.\n\nFour cars were also destroyed in the fire. Photo: Facebook", "comment_count": 0, "id": 2903}, {"keywords": "", "author": "Claire Caruana", "article_body": "Some foreign workers were being paid as little as €1 an hour, UĦM Voice of the Workers CEO Josef Vella revealed yesterday, insisting that the situation with precarious work in Malta was the worst it had ever been.\nSpeaking at the union’s annual Workers’ Day conference, Mr Vella said that people should not be confused into thinking that precarious work no longer existed. In actual fact, he pointed out, the situation was at its worst.\n“We recently discovered that there is a group of foreigners working in Malta who are getting paid €1 for every hour they work. And that’s not even the worst part; we also found out that the money is not paid to them but sent to an agency back home in India,” Mr Vella said.\nHe insisted that when the union expressed concerns over the fact that Malta was experiencing an influx of foreigners, who came to the island in search of work, it was not doing so to spread paranoia but because it was truly worried the situation was getting out of hand.\nRead: Migrant workers risk 'forced labour' conditions, warns Freedom House\nIn recent months, the union has often warned that the entry of non-EU nationals into Malta’s employment market should be limited to highly-qualified workers, as too much emphasis on cheap labour would negatively impact wage levels.\nUĦM Voice of the Workers CEO Josef Vella. Photo: Matthew Mirabelli\nOn the rental market, Mr Vella said that the workers the union met were constantly expressing concerns that rent prices were going through the roof and had reach unprecedented levels.\n“Some years ago, when we spoke of rent prices of around €400 we had said this was not sustainable. Fast-forward to today when prices easily reach €1,000 a month. The government has a duty to ensure that a strong economy is used to first and foremost address the needs of its people,” Mr Vella went on.\nRead: Delia lashes out against 'foreigners'\n'Shallow' Gwardamanġa reaction \nReferring to the collapse of an apartment block in Guardamangia on Thursday, Mr Vella said that instead of addressing the issues at hand, the authorities reacted to the incident by claiming all the necessary paperwork had been in order.\n“Is this what we tell people? That all the papers were filed? Is that the way to go? I think this is somewhat shallow. How can we say that this is an accident and that things like this are bound to happen?” the union chief asked, adding that in its “frantic rush” to build, the government was failing to address these real issues.", "comment_count": 140, "id": 2904}, {"keywords": "", "author": "", "article_body": "Children as young as 14 can now join the Labour Party, with the party having amended membership rules and reduced the minimum eligible age from 16. \nThe amendments were approved during the PL's general conference on Friday evening.\nIn a statement, the PL said that its youth arm Forum Żagħżagħ Laburisti had in the past year received many requests from youths under 16 who wanted to sign up with the party. \nYouth arms of political parties across Europe tend to vary between 14 and 16, with Britain's Labour Party and the German Social Democrats allowing members as young as 14, parties such as Fine Gael in Ireland or the British Tories setting a 15-year-old limit, and others, such as Spain's Popular Party, only allowing membership to youths 16 and older.\n\n\n\nThe PL move follows a decision to reduce the voting age for national elections from 18 to 16. That reduced age was introduced last year, with 16-year-olds set to vote for the first time in next month's European elections.  \nRead: 'Don't forget how much we loved you,' Cardona tells Muscat", "comment_count": 26, "id": 2905}, {"keywords": "", "author": "Claire Caruana", "article_body": "Migrant workers in Malta are vulnerable to conditions that amount to forced labour, a report on freedom has concluded.\nMigrant workers are more vulnerable to conditions that amount to forced labour, researchers say. Photo: Matthew Mirabelli\nPublished as part of the annual review by Washington-based democracy monitor, Freedom House, which issued its freedom ranking in February and a more in-depth country-specific report this month, the review showed that unlike other residents, migrants were more vulnerable to such exploitation.\n“Residents generally enjoy fair access to economic opportunity and protection from labour exploitation, though migrant workers in particular are vulnerable to labour and sex trafficking or conditions that amount to forced labour,” the researchers noted.\nAccording to Freedom House, which in its annual ranking downgraded Malta’s freedom score to 91 out of 100, Malta’s score for “safeguards against official corruption” was found to have gone down as a result of the “inefficacy of the country’s anti-corruption institutions”.\n“The score declined from three to two (out of four) due the inefficacy of the country’s anti-corruption institutions in investigating the myriad corruption scandals that have emerged from the Panama Papers and other sources,” researchers noted in the country-specific report published recently.\nThe country’s score has been on a downward trend for the past couple of years, dropping to 92 points in 2018 from 96 in the previous year.\nThirty-five countries obtained better scores than Malta and another five – Costa Rica, Lithuania, the Czech Republic, St Vincent and Grenadines and Bahamas – were awarded the same points.\nOn the rule of law, the monitor’s researchers noted that the creating of a Judicial Appointments Committee (JAC) in 2016, set up to evaluate candidates for the judiciary, the Prime Minister still maintained considerable power over judicial appointments.\nResidents generally enjoy fair access to economic opportunity\nIn its report on Malta, the Council of Europe’s Venice Commission, Europe’s highest constitutional body, had recently also recommended that “the Prime Minister should not have the power to influence the appointment of the judiciary”.\nMoving on to “personal autonomy and individual rights”, the researchers also noted that “domestic violence remains a problem despite government efforts to combat it”.\nFirst published in 1973, the ranking, considered a world institution in the sector, provides a tracking of global freedom trends.\nFreedom House says its ranking is often cited by academics, journalists, activists and even policymakers.\nclaire.caruana@timesofmalta.com", "comment_count": 0, "id": 2906}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 9.29pm with Fearne speech\nLabour Party deputy leader Chris Cardona had a heartfelt message for the Prime Minister on Friday, telling him not to forget how much the Labour Party loved him throughout his political career.\nTurning to the Prime Minister during the PL annual general conference, Dr Cardona said he was certain the Prime Minister’s decisions would always put the country first.\n“Don’t forget how much we loved you when you became leader and throughout your political career,” the deputy leader for party affairs said.\nThe Nationalist Party, on the other hand, had not managed to inspire anyone with new proposals during the nearly two years it was under the helm of leader Adrian Delia, Dr Cardona said.\n“When is this ‘new way’ coming?” he asked, playing on Dr Delia’s campaign slogan.\n\n“The only thing that came close to a new way is a “one-way”- that went on being negative as it had been for years. On election day, I’m certain the country will say: “No way,” he said to applause.\nHe could not blame the Nationalist Party, he told his audience, since it must be difficult to come up with new ideas.\nEarlier during the conference, CEO Randolph Debattista announced that the Labour Party had registered a surplus of over €900,000.\nTurning to the upcoming May elections, Dr Cardona said Nationalist MEPs had worked to tarnish Malta’s reputation abroad in the hopes this will drive away business and investment.\n“Nationalist Party MEPs realised the biggest attack they could level at our country was to threaten investment and jobs. If it weren’t for the work of Maltese MEPs, Maltese and Gozitans would have lost their jobs,” he said.\nNationalist MEPs’ performance was based on how well they could tarnish the country’s reputation, Dr Cardona told supporters, as he urged everyone to cast their vote in next month’s elections.\nFearne calls for wage equality for contract workers\nFellow deputy PL leader Chris Fearne proposed increasing wages of all contract workers, saying the Labour Party wanted to continue working to eradicate poverty.\nThere are a number of people that are engaged by contractors to work with public entities, he said. These people were already being paid as much as civil workers, following a move by the government to ensure both civil workers and those engaged privately to work with public entities received equal pay.\nHowever, those working solely with contractors are receiving lower wages, Mr Fearne told the annual general conference.\nWe need to address this anomaly slowly, after discussion with various entities such as unions, he said.\n\n“We have to do right by these people,” he added, insisting the party should be both pro-business and pro-workers.\nEncouraging Prime Minister Joseph Muscat to stay on, the deputy leader said the Labour Party should aim to spend 25 years in government, after spending 25 years in Opposition.\nThe secret to our success is competence, teamwork and sense of duty, he told supporters.\nDr Muscat had clearly been competent in leading the party, and the teamwork within the party was felt at all levels within the party, including at Cabinet level, he said.\n“I am certain that, with co-ordinated teamwork, we will continue on our success,” Mr Fearne told supporters.", "comment_count": 32, "id": 2907}, {"keywords": "", "author": "", "article_body": "Opposition leader Adrian Delia railed against foreign workers in a brief speech on Friday evening, telling his audience “clans” of low-quality foreigners were frightening children and “making society poorer”.\nSpeaking at St Paul’s Bay – the town with Malta’s highest proportion of foreign residents – Dr Delia said the government had no integration plan and was content to import workers who had nothing to offer Maltese society.\n“These are not foreigners of quality, who can teach us,” he said. “They’re practically slaves who make society poorer, not richer”.\nHe accused the government of relying on “foreigners” as a solution to its every problem.\n“Pensions? Foreigners. Tunnel? Foreigners. The economy? Foreigners,” he said.\nDr Delia has regularly drummed up concerns about foreign workers during his time as party leader and used a Freedom Day speech in March to argue that “we are being taken over by outsiders”.\nAs well being the town with the highest share of foreign residents, St Paul's Bay also ranks, alongside St Julian's, Sliema and Valletta, as one of localities where most crimes are reported. \nA short extract from Dr Delia's speech on Friday.\nVenice Commission\nThe PN leader also slammed the government for its decision to steam ahead and add six new members to the judiciary this week, despite the Venice Commission having recommended changes to the way in which judges and magistrates are appointed.\n“They say they want to implent the reccomendations, but then appoint six more,” Dr Delia told supporters.\n“This government does not care about justice or democracy”. Dr Delia contrasted his party’s electoral campaigning with that of the Labour camp.\n“The socialist party will do anything for power. We will not. We work for our country and for everyone,” he said.", "comment_count": 27, "id": 2908}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A family living next door to a dilapidated property which has been vacant for the last ten years have filed a judicial protest to force its owners to repair the dangerously run-down property.\nThe Farrugia couple, living in Triq Lapsi, St Julian’s, filed the judicial act in the wake of the recent collapse of buildings in Gwardamanġa and Swieqi.\nIn the protest, they called upon M & M Properties Ltd and co-owner Mario-Victor Attard to carry out all necessary remedial and precautionary works on the adjacent property and to do so within one week.\nThe couple’s claim was backed by architectural reports attesting to the “unsafe scenario” caused by the property next door which had been left vacant for around 10 years with little or no maintenance and was overgrown with vegetation even throughout the roof area, in spite of repeated calls by the concerned neighbours.\nPart of the property’s roof had collapsed in January and the situation was aggravated by heavy rains and storms in recent months.\nAn architect appointed by the Farrugias had said that the collapse was “predictable to say the least”, given the “inaction and lack of general maintenance” of the property.\nThe Farrugias say their family home has been damaged and suffers from damp as a result of the situation next door.\nExcavations undertaken two doors away were, moreover, making the situation even more dangerous, they have argued.\nIn spite of repeated calls by the protesting parties, two legal letters and an e-mail by one of the co-owners acknowledging that the abandoned property needed “immediate attention as it was causing potential damage to both neighbours and passers by,” the necessary works were never undertaken.\nIn the light of recent building disasters, the protesting parties granted the protested parties one week within which to make the necessary intervention to safeguard life and property, to liquidate the damages suffered by the neighbours who reserved the right to take further legal action as necessary.\nLawyers Antoine Naudi and Tyrone Grech signed the judicial protest.", "comment_count": 0, "id": 2909}, {"keywords": "", "author": "", "article_body": "Parents of adopted children could soon be spared the bureaucratic trouble of applying to obtain Maltese citizenship for their sons and daughters, with the government preparing a bill that will amend current laws.\nThe amendments, if passed, will ensure that adopted children are automatically granted Maltese citizenship once adopted.\nPlans to amend laws were made public by Prime Minister Joseph Muscat during a speech he gave at Malta’s first national conference for adoptions.\nFamily minister Michael Falzon told the conference audience that the government was committed to simplifying the adoption process, noting however that there were several international standards and regulations which Malta was duty-bound to abide by.\nThe conference was organised by the Family Ministry and Social Care Standards Authority.", "comment_count": 3, "id": 2910}, {"keywords": "", "author": "", "article_body": "Bank of Valletta has filed proceedings against Italy before the European Court of Human Rights in Strasbourg, trying to ensure a ‘fair hearing’ in the €363 million Deiulemar case.\nThe bank said in a company announcement on Friday that the proceedings were being instituted to safeguard “its fundamental right” in terms of the European Convention on Human Rights.\nRead: €363m to be frozen after BOV loses appeal in Italian case\nThe €363 million is linked to a trust opened by the owners of the collapsed shipping giant Deiulemar. The company went bankrupt in 2012 with losses of more than €800 million on its books. Seven people were jailed as a result of the collapse.The claim was filed by liquidators of the Deiulemar group and representatives of 13,000 Italian bondholders who lost all their life savings in the fraud scheme dating back to 2009.\nBank of Valletta lost its appeal last July against a €363 million precautionary warrant imposed by an Italian court at Torre Annunziata a few months earlier.\nThe actual hearing of the case hasn’t yet started and a Calamatta Cuschieri analyst had explained last August that the location of the court was a concern: \"The Tribunal of Torre Annunziata in Italy, according to bank officials, could be biased due to the majority of the creditors originating from this relatively small provincial town. The bank is in fact in the process of attempting to get the case heard in Naples to mitigate a potential unfair judgement.\"\nThe bank had put aside €75 million for any potential losses it might incur as a result of this and two other separate litigation cases – the appeal against the Financial Services Arbiter’s decision on the Property Fund; and its discussions with the Swedish Pensions Agency with regard to the Falcon Funds.", "comment_count": 11, "id": 2911}, {"keywords": "", "author": "Jacob Borg", "article_body": "Around 22 entities are involved in regulating the construction process, Kamra tal-Periti head Simone Vella Lenicker said on Friday.\nSpeaking during a meeting between the Chamber and PN leader Adrian Delia, Ms Vella Lenicker expressed concern about the “regular” incidents reported at construction sites over the past months.\nThe most recent major incident was reported on Wednesday night, when an apartment block in Gwardamanġa collapsed. \nMs Vella Lenicker said reactions to the Gwardamanġa collapse had highlighted the “fragmented” way in which the construction industry was regulated.\nThe Kamra tal-Periti had already highlighted \"excessive fragmentation\" within the sector on Thursday, in a statement reacting to the collapse.\nOn Friday, Ms Vella Lenicker said the Chamber welcomed plans by the government to set up a new building and construction authority.\nThis authority will be tasked with enforcing construction rules, overhauling existing legislation and taking over responsibilities currently under the remit of various entities and boards.\nMs Vella Lenicker said the majority of issues when it came to overdevelopment were a direct result of outdated local plans.\nThe strategic plan for the environment and development remained a list of goals that had not been implemented in planning policies, she continued.\nMalta-Gozo tunnel\nOn a planned tunnel between Malta and Gozo, Ms Vella Lenicker expressed hope that a full assessment of whether a tunnel was needed would be carried out, once all the relevant studies had been published.\nThe KTP met with Opposition Leader Adrian Delia. Photo: PN\nShe said it was worrying that motions had to be passed in parliament to ensure that all the rules were adhered to when it came to the tunnel process.\nOn his part, PN leader Adrian Delia said the party had made its position on the Gozo tunnel clear.\nHe clarified that the PN’s position in favour of the tunnel was conditional on all the relevant studies and processes being carried out and showing that the benefits outweighed the costs.\nDr Delia emphasised the need for these studies to be published prior to a public consultation taking place, and not merely attached to the tender.\nTurning to the construction industry, Dr Delia said there was a need for proper planning rather than just issuing permits.\nDr Delia said political parties in government tended to think in terms of the short-term election cycles.\nThe PN leader said there was need for more forward planning and long-term master plans.\nDr Delia said there was a need to place more emphasis on enforcement rather than just looking at regulations when it came to construction.\nHe called for the formulation of architecture, landscape and skyline policies.", "comment_count": 2, "id": 2912}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta's president should be appointed by a two-thirds majority in Parliament instead of a simple majority, constitutional lawyers said on Friday. \nSpeaking during a debate as part of an annual Workers' Day conference organised by the UĦM Voice of the Workers, former European Commissioner Tonio Borg  and Constitutional lawyer Austin Bencini argued that the president should not be elected through a simple parliamentary majority. Instead, they insisted, the appointment as well as the removal of the head of state should be through a two-thirds majority. \n\"With a simple majority, even if you have just 15 people in parliament on the day, you can elect or remove a president. In my opinion, the president should be elected with two-thirds majority,\" Dr Borg argued.\nA similar call had been made by the Partit Demokratiku in January, with the party saying that Prime Minister Joseph Muscat was on record saying that the next president would be appointed through a parliamentary resolution.   \nOn the argument that such a change could lead to problems if the two sides failed to come to an agreement, Dr Borg said that if the rules were set in a way that did not allow for a 'Plan B', meaning there was no other option but to elect the president through the two-thirds majority, the two sides would eventually come to an agreement.\n\"Whenever this was introduced, it worked. We had other appointments, namely the Ombudsman, the Auditor General and now we also have the Parliamentary Commissioner for Standards, that are  elected by two-thirds majority and there haven't been any problems,\" Dr Borg insisted. ", "comment_count": 11, "id": 2913}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "A driver who allegedly told police officers “my cousin has already run over one of you, I’m not scared of running over two more” told  them he was taking a sick child to a health centre when they stopped him last weekend, a court heard on Friday. \nJustin James Grima was denied bail on Friday following an initial hearing in which the court heard from officers involved in last weekend's incident. \n \nMr Grima was arrested last Saturday after he allegedly drove towards two officers who had stopped him in Ħamrun, after they noticed his Mitsubishi Shogun was equipped with tinted glass. \n \nDuring the first hearing in the compilation of evidence against Mr Grima, a traffic sergeant recalled how a woman and child had exited the Mitsubishi after he had pulled it over by Mile End that Saturday afternoon. \nThe officer said he had told Mr Grima to follow him to the police garage, to be booked and ordered to replace his vehicle’s tinted glass. This was standard practice in such cases, he said. \n \nMr Grima first appeared to be following the police bike but suddenly made a U-turn, shouted insults towards the officer and headed towards Daniel’s Shopping Complex. His driving became reckless, the officer said. \n \nWhen Mr Grima was stopped for a second time, he said he was worried about his sick child.\n \nThe police officer admitted that Mr Grima had told him he was taking the child to a health centre. \nDefence lawyer Franco Debono repeatedly asked whether Mr Grima had asked the officer “may I take them to the polyclinic and then come straight to the garage?”\nThe officer denied this. \n \n“I assumed it was just an excuse at the time,” the traffic policeman said, pointing out that at that moment Mr Grima had been alone in his vehicle.\n \nMr Grima ignored repeated orders to switch off his car’s engine and the officer had called for backup. \n \nWhen a second traffic policeman reached the area, the first officer was still trying to get Mr Grima to hand over his key.\n \nThe first officer had parked his bike around one-and-a-half metres behind the Mitsubishi, with the second officer stopping his bike close to the front part of the vehicle, sideways on the road.\nMr Grima was on his mobile phone and was heard asking “is the girl alright?”\n \n“Hand over the key!” the first officer had repeatedly ordered, as people spilled out of the nearby shops, attracted by the commotion, taking to their mobile phones to grab footage of the incident.\n \n“You won’t take my vehicle. It’s the apple of my eye,” Mr Grima said as he got out of the van, wearing the key ring around his middle finger and pointing the key in the direction of the two officers.\n \n“My cousin has already run over one of you and I won’t mind running over two more,” he had allegedly threatened.\n \nMr Grima is a cousin of Liam Debono, who stands accused of a hit-and-run offence which which left police officer Simon Schembri without a limb. \n \nFollowing that threat, Mr Grima got back behind the wheel. That prompted the first officer to reach in through the window to try and remove the key, not knowing at the time that the SUV’s automatic transmission meant it had to be set to ‘park’ for the key to be released from the ignition switch.\n \nAs the officer wrestled for the key, Mr Grima allegedly put both hands on the policeman’s. The engine suddently switched on and the SUV moved forward, hitting and extensively damaging the police motorcycle parked in front, before stopping again. \n \nProsecuting Inspector Matthew Galea testified that following the arrest, when releasing his statement, the accused had said “Dak il-hin kont imfixkel u ma nafx.” [I was confused at the time, I don’t know]\n \nInspector Pierguido Saliba, also prosecuting, declared on the witness stand that Mr Grima had later explained that he recalled nothing of the incident and had “panicked because he did not like the attitude of the officers.”\n \nThe driver had not tested positively when subjected to a breathalyser test, Inspector Saliba told the court, presided over by magistrate Monica Vella.\n \nA search of the suspect had also yielded a key used to unlock handcuffs, the court was also told.\n \nMagistrate Vella subsequently denied Mr Grima bail, noting that he had been convicted of similar charges in the past,  seemed unwilling to refrain from such behaviour and could not be trusted to respect bail conditions. \n \nLawyers Franco Debono and Amadeus Cachia are defence counsel.\n ", "comment_count": 0, "id": 2914}, {"keywords": "", "author": "Jacob Borg", "article_body": "Halting judicial appointments until the Venice Commission’s recommendations are implemented would be tantamount to asking for the courts to be paralysed, Prime Minister Joseph Muscat said on Friday.\nIn a reply to the demand by civil society group Repubblika to halt the appointment of three magistrates and three judges, Dr Muscat said it was not in the best interest of the administration of justice and the respect for the rule of law if this request was upheld.\nDr Muscat said it was \"absurd\" to ask the court to declare appointments under the current system as null.\nThe six new members of the judiciary were sworn in on Thursday afternoon in spite of a court decree accepting to hear with urgency the application for the appointments to be halted.\nDr Muscat said in his reply that the Venice Commission had given its recommendations on how judicial appointments could be improved.\nHe said the Commission acknowledged the Judicial Appointments Committee introduced in 2016 and unanimously approved by Parliament was a good system, and like any other system it could be improved.\nNowhere in its December opinion did the Commission say the current system was compromised or that the judiciary was not guaranteed independence or impartiality, Dr Muscat said.\nRecommendations not binding\nThe Prime Minister, through the Attorney General’s office, told the court that the Commission’s recommendations were not binding, and the opinion did not mean Malta could not adopt different systems to safeguard the rule of law.\nHe said the recommendations had to be implemented by the government through a political process, whereas Repubblika’s request, if upheld, was asking the court to enforce the Commission’s recommendations, effectively turning it into a legislator.\nA request for the case to go to the European Court of Justice that was currently examining interference by the Polish government in the country’s judiciary was also dismissed by the Prime Minister and Justice Minister Owen Bonnici in their reply to the request. \nIn a statement on Thursday, Repubblika said the government had publicly acknowledged the findings of the Council of Europe’s Venice Commission, that the present method of appointing judges meant the judiciary was not independent.\nThe government had also publicly committed itself to change the method of appointing judges to guarantee judicial independence, Repubblika said.\nThe organisation said that despite its promises, the government was appointing six new people to the bench using a system it had already admitted amounted to undue interference of the government on the judicial system.", "comment_count": 80, "id": 2915}, {"keywords": "", "author": "", "article_body": "A sewage treatment plant that was forced to shut down operations after animal waste clogged it up is back up and running.\nThe Ta’ Barkat plant was cleaned of the illegally dumped waste that forced it to halt operations on Wednesday and is expected to resume creating  New Water – filtered water that is used for agriculture – by Saturday.\nThe Xgħajra plant was shut down on Wednesday after a massive influx of animal waste clogged up many of its systems, with the Water Services Corporation saying it would be reporting the damage to the police.  \nIt is not the first time the plant has suffered such damage, with a similar incident also reported back in 2015. \nTonnes of waste was removed in the clean up of sewage gallery leading to the plant, the emptying and clean up of the receiving pumping station and its five two-metre high pumps, the de-blocking of the fine screening equipment, and a general clean up of other areas that received such waste.\nThankfully, the plant’s screening equipment worked as intended and the plant’s core infrastructure was not damaged.\nIn a statement, the Water Services Corporation said that its crews had managed to restore the plant three days ahead of schedule. WSC CEO Richard Bilocca said he couldn’t thank the Barkat Sewage Plant team enough for their hard work in dangerous conditions.", "comment_count": 6, "id": 2916}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Democratic Party's deputy leader Timothy Alden will contest next month's local councils election as an independent candidate after his own party left him off their official list of candidates.   Democratic Party deputy leader Timothy Alden\nMr Alden told Times of Malta he had been \"very frustrated\" when he discovered that although he had correctly submitted his candidature to the electoral commission to run for the Sliema local council, a member of the PD team had accidentally left his name out of a list of candidates on the orange ticket. \n\"I will therefore be listed as Timothy Alden 'tal-oranġjo', but I won't be on the PD list. Naturally if elected I will represent the PD on the Sliema local council,\" he said, describing the incident as a \"cosmetic annoyance\".   \n'A clerical error' \nThe situation might actually have turned out to be far worse. He said that on Tuesday he had been contacted by the electoral commission and told he may not be allowed to contest at all. \nMr Alden said he had appealed to the electoral commission to rectify the matter, however, was informed that the lists had already been finalised by the time the matter had been brought to their attention.  \nIn the end he was allowed to run, but not as a PD candidate.  \nOn Friday the PD issued a statement informing the electorate that following \"a clerical error\", the Electoral Commission had decided that Mr Alden would be running as an independent candidate on the ballot sheet.\n\nThe PD said it remained foursquare behind its deputy leader in his election campaign.\n\"If elected, Mr Alden will act as the official representative and councillor of Partit Demokratiku in Sliema, putting the interests of the residents of the locality first,\" PD said.  ", "comment_count": 20, "id": 2917}, {"keywords": "", "author": "Denise Grech ", "article_body": "Money laundering cases take longer to be resolved in Malta than in other EU countries, the EU's 2019 Justice Scoreboard reveals. \nAccording to the figures, parties involved in money laundering cases waited an average of over 1,400 days for the court to deal with their cases 2017. Latvia was a distant second, with the court taking 800 days to deal with such cases.\nThe time needed to resolve civil, commercial and administrative cases has been on a steady decline since 2010, the scoreboard revealed. That year, Malta had one of the highest waiting time to solve legal cases, with some taking over 800 days to resolve, figures show.\nIn 2017, the time needed to resolve those cases declined to almost 400 days.\n\nHowever, Malta had the second-highest waiting time needed to resolve litigious civil and commercial cases in court of appeal. Cases there still take up to 800 days to be resolved, the figures showed.\nMalta had by far the longest waiting time for decisions on judicial review cases on electronic communications in 2016. People could wait up to 2,500 days for the review to be completed, the report noted. In 2017, the average waiting time was almost 1,000 days.\nThe scoreboard also revealed judges had received some training on communication with asylum seekers and victims of gender-based violence but had no training on dealing with children or media disinformation.\nAround 20 per cent of companies said they believed there was interference or pressure from politicians on the judiciary. The same percentage also said they believed the status and position of judges do not sufficiently guarantee their independence.\nRead: Maltese least likely Europeans to go to court\nGovernment positive about progress\nIn a statement, the government welcomed the results, saying it was positive that Maltese companies’ belief that the judiciary is independent improved compared to last year.\n\n\n\nMeasures to improve the efficiency of the court were working, it said, with the courts reducing waiting times for the civil, commercial and administrative cases between 2010 and 2017.\nHowever, challenges remained, particularly in the civil appeals court, the government said. The government established a superior appeals court to help deal with the large amount of cases in the civil appeals court, it noted.\nRead the Justice Scoreboard report here.", "comment_count": 4, "id": 2918}]