[{"keywords": "", "author": "Denise Grech ", "article_body": "The Nationalist Party’s administration should “carry political responsibility” for the two electoral defeats suffered earlier this month, the PN Żurrieq sectional committee said on Friday. \nThe Opposition lost the European Parliament elections by over 42,600 votes and local council elections by a historic margin of 47,116 votes.\nThe two defeats led to political turmoil within the PN, with calls for the resignation of embattled Nationalist party leader Adrian Delia.\nDr Delia has said he will continue to lead the party to the next general election, arguing that the defeats were smaller than those initially predicted by pollsters. \nA co-option to replace former MP David Stellini’s seat continued to expose internal rifts. A vote taken last week saw the resignation of PN executive committee president Mark Anthony Sammut and allegations that ineligible members were allowed to vote.\nThe vote had been narrowly won by Jean Pierre Debono, who declined to take up the seat following the allegations. \nThe PN Żurrieq sectional committee asked the executive and administrative branches of the party to keep the committees informed of all decisions it has taken or will be taking.\nThe committee also joined calls for the vacant parliamentary seat to be taken up by lawyer Kevin Cutajar.\nMultiple members of the party have called for Dr Cutajar to fill the seat, arguing that the Gozitan lawyer should take the seat of Mr Stellini, who is also Gozitan.\nRead: Co-option nominee ‘must hail’ from Gozo - former human rights judge\nTwo PN members have publicly declared that the party’s general secretary asked them to contest the co-option vote. Both turned down the request, expressing their support for Dr Cutajar instead.\nThe party's public spats show no signs of slowing down, when a banner reading \"We want a future: resign\" was put up outside the party's headquarters Thursday evening. \nThe party's executive committee will be meeting on Saturday to discuss who will take Mr Stellini's seat.", "comment_count": 21, "id": 819}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Constitution was only a piece of paper unless there was the political will to safeguard it, Archbishop Charles Scicluna warned on Friday.\nIn an homily during Mass commemorating the Sette Giugno bread riots, Mgr Scicluna warned the Constitution was useless without the political spirit in which it was created and the responsibility of those in government. \nThe Maltese now had no one to blame if the injustices that led to the riots were repeated.\nBack in 1919, people could tear up the British flag and say it was a flag that was not theirs. But nowadays, all the Maltese had to understand their responsibility towards ensuring a just society.\nTo commemorate the memory of the four young men who died, everyone had to work for a fairer society, Mgr Scicluna said.\n\nThe Sette Giugno events had to be remembered to ensure there would never again be class distinctions. Four men had died during the riots and their sacrifice had to be remembered.\nWhy is it that the poorest and weakest among us have to pay the biggest price?- Archbishop Charles Scicluna\nOne of them, Ġużeppi Bajada, was due to travel back to Canada where he had been living on June 8. He had come to Malta for his father's funeral but was shot before he could make his way back home, Mgr Scicluna said. \nRead: Giuseppe Bajada’s shooting on Sette Giugno\nAnother, Carmelo Abela, who was stabbed on June 8, was in a side doorway, calling for his son. Two marines proceeded to arrest him, and, when he resisted, a marine ran him through the stomach with a bayonet.\nVideo: Sarah Carabott\n\"You cannot help but feel hurt when you recall these stories,\" Mgr Scicluna said. Even the clergy had been complicit and some sat on the fence as the injustices continued. \n\"There were also some politicians who stood back and watched and others who helped,\" he said. \nOne had to continue asking why had four workers become victims. \"Why is it that the poorest and weakest among us have to pay the biggest price,\" the Archbishop asked.\nThe Maltese had to continue working towards solidarity and truth and ensure they did not create victims through hatred and injustice.  He referred to the murder of Lassana Cisse, who was allegedly shot by two soldiers in a racially-motivated attack.\nRead: Church ‘needs soul-search’ after migrant murder – Archbishop\n ", "comment_count": 47, "id": 820}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Superintendence of Cultural Heritage has opposed plans to turn the former Times of Malta building in Valletta into a luxury apartment complex, according to a representation filed with the Planning Authority.\nThe main concern is the extent of the excavation that is being planned so as to include an underground car park beneath Strickland House. According to the superintendence, the rock cutting could pose serious dangers for Auberge de Castille across the road.\nApart from this, the superintendence said it was also concerned about the complete demolition of Strickland House, due to the possibility of historical value within.\nHili Company, which acquired the St Paul’s Street property from the Allied Group in December, plans to redevelop the existing building into 50 apartments over eight floors, two of them receded, as well as a cafeteria and five levels of underground parking. \nThe company is describing the development as “Valletta’s only luxury residential complex, comprising high-end apartments, with concierge service and car parking facilities”.\nDesigns for the building’s façade, by architect Martin Xuereb, envisage a mix of open and traditional closed balconies, with timber apertures and wrought iron railings, in stark contrast to the current austere aesthetic.\nSuperintendence objects\nBut the Superintendence of Cultural Heritage said it was concerned over plans to demolish the building.\n“The total demolition as proposed will destroy any historical fabric or spaces, which may survive within the building. This destruction cannot be considered in the absence of adequate information on the extent and value of surviving historical fabric. To this end, the architect is to provide historical information on the existing building, including annotated plans and drawings identifying surviving historical fabric and its phasing,” the culture watchdog said in its statement to the Planning Authority.\nOn the proposed excavation, the superintendence said this “would permanently impact any undisturbed archaeology, historical structures or historical services underlying the area”.\nMoreover, it would pose “an unacceptable threat to the surrounding monuments” including the Grade 1 scheduled monument Auberge de Castille, the underground Lascaris War Rooms complex and related tunnels and shelters and underground services.\n“This excavation, which will involve extensive rock-cutting, is unacceptable in a UNESCO World Heritage site and should be drastically reduced or eliminated,” it said.\nThe culture regulator also commented about the considerable increase in height and volumes, saying it would have “an inevitable and negative impact on streetscapes”.\n“The Superintendence finds that the proposed design is not an acceptable replacement for the existing building and is not in harmony with the outstanding architectural value of Valletta as a UNESCO site. More specifically, the aesthetic and architectural concept of the proposal does not adequately reflect the heights, proportions and rhythms of classical architecture or the existing streetscape,” it said.\nIt said that if granted permission, the developer must take appropriate measures to ensure the stability and integrity of adjacent historical properties as well as have an archaeologist on site at all times.\nReacting to the various objections, Architect Martin Xuereb, said he planned to meet objectors and consultees to improve the development and try to obtain a general consensus befitting the capital city.\nStrickland House history\nPurchased by Lord Strickland in 1930 to host his printing press, Strickland House served as home to the Times of Malta from the newspaper’s founding in 1935 until 2017, when all operations were moved out of Valletta to the current premises in Mrieħel. \nThe original building withstood the ravages of World War II, despite being bombed twice, but was burned down by Labour Party supporters in October 1979 after a mass rally in what came to be known as Black Monday.  \nAlthough the printing press was destroyed, the newspaper was published as usual the following day from another press, retaining its record of never having missed an issue. \nA charred black wall on the building’s top floor, which most recently hosted the Times of Malta newsroom, was retained behind Perspex with a plaque marking the 1979 event.", "comment_count": 13, "id": 821}, {"keywords": "Construction, Sliema, Neighbourhood", "author": "", "article_body": "Elderly people and families living in a popular Sliema area expressed frustration on Friday, as they spent the morning of a public holiday listening to construction noise.\nAlthough legislation prohibits the continuation of construction works on Sundays or public holidays, the Building Regulations Office (BRO) issued a permit for the works to continue, police said, overriding those regulations.  \nAs a result, residents living on the corner of Pace Street and St Anthony Street spent the better half of their Sette Giugno public holiday nursing a headache due to construction noise. \nDevelopers of the site have until the end of next week to complete building works before they must stop for the summer months: the two streets both feature on a list of tourist areas where construction works will be prohibited between June 15 and September 30.\nThe ongoing works were resulting in an \"inhuman\" living situation, resident Reuben Brimmer said.\n\"Whenever you take a sick day off work, you know you will still be surrounded by construction noise,\" he said.\n\"To add insult to injury, the building site is otherwise abandoned - so much for urgency of works,\" he said. \"There is just one very noisy digger, waking up and disturbing a whole neighbourhood,\" he said. \nThe only respite residents in the area had, Mr Brimmer said, was on Sundays and public holidays. But it seemed authorities had taken that away too, Mr Brimmer said. \nSliema mayor frustrated\nHis sentiment was shared by many other Sliema residents, according to mayor Anthony Chircop.\nThe local council, he noted, could not make developers halt works and struggled to get information from the BRO, since they were often \"not receptive\" to requests for information.\nElderly people were trapped because they found it hard to move out but could not stand the construction noise, he added.\nThe BRO declined to comment when contacted. ", "comment_count": 62, "id": 822}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Just a month after the authorities descended on Mistra Bay to warn a number of caravan owners to get in line with the law, some campers are still parked there illegally.\nCaravans and campers at Mistra, some of which also have water tanks and beach furniture by the side, can only be parked on the road provided they have an inbuilt engine. Non-motorised campers and trailers can park on the road if they are secured to or towed by a vehicle.\nWatch: 'I'm packing up and leaving the island' - Mistra restaurateur gives up\nTransport Malta slapped some of them with notices at the beginning of May, calling on the owners not to “encumber the bay to the detriment of others”.\nA spokesman had said the notices allowed the regulator to take further action against those that should not be there.\nWhile the transport watchdog could issue fines for illegally-parked vehicles (motorised campers), this was not an option for non-motorised ones. The notices enabled the regulator to tow them away at a later date if the encumbering persisted, the spokesman had said.\nHowever, non-motorised caravans not secured to a vehicle remain at the bay one month on.\nThe Planning Authority had also affixed enforcement notices on caravans – motorised or not – that were not parked on the road, a spokesman confirmed.\nWhen, last month, the police were asked whether they were aware of the illegalities at Mistra Bay and whether they planned to take any action, a spokesman said inspections were being carried out on regular basis to ensure the owners observed the laws and regulations.\nAsked whether any caravan or camper owners in Mistra, Baħar iċ-Ċagħaq, Salina and Marsascala had been reprimanded, the police said inspections were being carried out on a regular basis.\nNo criminal charges were issued and any irregularities found were reported to other agencies, the police said.\nTransport Malta was also asked about towable campers without motorised vehicles in Marsascala, campers not parked on the road at Baħar iċ-Ċagħaq and others taking up parking spaces at Salina.\nQuestions sent on May 6 remained unanswered at the time of writing.\nRead: Search for owners of caravans parked illegally in Baħar iċ-Ċagħaq", "comment_count": 43, "id": 823}, {"keywords": "", "author": "", "article_body": "Malta International Airport reduced its greenhouse gas emissions intensity by 12% in 2018 to reach 0.92 kg of CO2 per passenger. A decrease of 11.6% in total water consumption was also registered.\nIn its fourth sustainability report, the airport said these drops were largely the result of several eco-friendly measures, including the installation of more efficient sanitation systems and the introduction of energy-saving lighting and air conditioning units.\nOver the past three years, the company invested more than €1 million in photovoltaic panels, and was currently determining the size of the next PV system to be installed on the airport campus.\nIn 2018, the company prioritised the development and overall wellbeing of its employees through the provision of over 8,800 hours of training and a better focus on mental health. It also supported several projects and initiatives undertaken within the community, with community investments amounting to more than €300,000.\nThe company also sought to further enhance Malta’s tourism product through the work undertaken by the Malta Airport Foundation. The foundation launched a documentary to disseminate a marine conservation message, partnered with eNGO Żibel for the procurement of two sea bins, and lent its support to an ongoing excavation of a Phoenician shipwreck.\nMIA said that these social and environmental initiatives did not detract the company from reporting another profitable year. The economic value it distributed in 2018, and which includes employee wages and benefits, payments to government, payments to providers of capital, and community investments, was in excess of €68 million.\n‹›-+Page:  /", "comment_count": 6, "id": 824}, {"keywords": "", "author": "", "article_body": "Updated at 3.50pm\nA second PN member has publicly revealed that the party’s general secretary asked her to contest a co-option vote to fill a parliamentary seat vacated by David Stellini.\nGozitan PN member Maria Portelli wrote on Facebook that she had turned down Clyde Puli’s request to take part in the ballot to replace Mr Stellini. Dr Cutajar. Photo: Facebook\n“I believe that this seat should be filled by Kevin Cutajar, because he deserves it,” she wrote. “I will be giving him my full support”.\nMs Portelli's decision to go public with her decision to rebuff Mr Puli adds further pressure to the PN administration, which has come in for internal criticism following the party's poor electoral showing.\nOn Friday afternoon, the PN's Żurrieq committee said it wanted the party's administration to \"shoulder responsibility\" for the electoral defeats, in a call that echoed ones made by the party's youth wing, MŻPN, and forum for professionals, FPPN. \nCo-option vote\nDr Cutajar came within two votes of replacing Mr Stellini when the PN’s executive committee first voted to fill the vacated seat last week.\nThat vote, which was won by Jean Pierre Debono, will now be repeated on Saturday after Mr Debono withdrew from the contest following allegations he had allowed ineligible members to cast a vote in the ballot.\nRetired judge Giovanni Bonello has since argued that Mr Stellini's seat should be filled by a Gozitan for the co-option process to respect the Constitution.\n\nMs Portelli, follows lawyer Joe Ellis in publicly revealing that the party leadership approached her to contest the co-option vote.\nOn Thursday, Dr Ellis published a letter he had sent to Mr Puli in which he told him that he felt Mr Stellini’s vacated seat should be filled by Kevin Cutajar.\nMs Portelli obtained 433 first count votes in the 2017 general election, which she contested in the 13th district on a PN ticket. Dr Cutajar obtained 901 first count votes – more than the 719 obtained by Mr Stellini himself.\nPN turmoil\nControversy over the co-option process has added to the PN's internal troubles, with Adrian Delia's leadership coming under intense scrutiny following the party's massive loss at MEP and local council elections. \nThe party's youth wing, MŻPN, has described the party's current state as \"untenable\" while its forum of professionals FPPN, has said responsibility had to be shouldered by \"all those who are refusing to view the clear electoral result as a damning one”. \nThe party's public spats continued on Thursday night, when a banner reading \"We want a future: resign\" was put up outside the party's headquarters. \nA banner put up outside the party's headquarters.", "comment_count": 143, "id": 825}, {"keywords": "", "author": "", "article_body": "Proposed amendments to temporary protection orders have led the Women's Rights Foundation to file a judicial protest against the Equality Ministry.\nThe amendments have been proposed in Bill tabled in Parliament.\nThe foundation said in a statement on Friday that the amendments would go against the spirit of the Istanbul Convention and add to the burden shouldered by victims of domestic violence. \nAmong other things, the foundation argued, the amendments would require police inspectors to carry out investigations in alleged domestic violence cases within 12 hours of a risk assessment. \nIt would also be up to police to ask the court for a temporary protection order if they felt the victim was at risk of harm. According to the amendments, these orders would only be valid for 30 days and would lapse if police chose not to file criminal charges.\nTemporary protection orders are intended to provide immediate protection to ensure the safety of victims of domestic violence without putting the burden on victims, who are often accompanied by dependent children.\nIn their statement, the Women's Rights Foundation expressed concern about the onerous requirements the amendments would introduce. Police resources were already stretched, it noted, and requiring investigations to be carried out by inspectors or officers of a higher rank would be difficult. \nAnd while the police could ask for a court order requesting the issuance of a temporary protection order, they could opt to not proceed with criminal action against the perpetrator.\nDespite the legal obligations to inform victims about any action taken or otherwise, it was often left up to the victims to chase information, possibly putting them at further risk. Victims could end up face to face with their perpetrators if the temporary protection order would have expired without their knowledge, the Foundation said. \nThe Foundation called on legislators to take into serious account the fact that the proposed amendment went against the rights of victims, especially given that domestic violence was deemed to be a serious violation of their fundamental human rights.", "comment_count": 3, "id": 826}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Friday’s newspapers.\nTimes of Malta says that according to an EU agency report, just under half of the inmates at Corradino Correctional Facility had a history of drug use prior to being jailed. In another story, it says that two of three men accused of killing blogger Daphne Caruana Galizia on Thursday asked for court authorisation to meet MEPs David Casa and Ana Gomez though it is not yet clear why.\nThe Malta Independent says the Nationalist Party’s executive will be meeting again on Saturday to decide on David Stellini’s seat.\nIn-Nazzjon says the examinations of mathematics and Maltese remain pending.\nL-Orizzont reports on a meeting the General Workers Union had with President George Vella during which unions’ duty to fight abuses was highlighted.", "comment_count": 1, "id": 827}, {"keywords": "", "author": "", "article_body": "A 25-year-old man was grievously injured on Thursday when he was attacked in Santa Venera.\nThe police said the Bangladeshi man was in Triq tal-Fawwara, when the incident happened, at around 8.30pm.\nHe was taken to hospital by ambulance.\nThe police are investigating.\nCorrection 4.30pm: The police later clarified that the man was a Bangladeshi national, not Indian.", "comment_count": 0, "id": 828}, {"keywords": "", "author": "Claire Caruana", "article_body": "Just under half of the inmates at Corradino Correctional Facility had a history of drug use prior to being jailed, according to an EU agency report.\nThe European Monitoring Centre for Drugs and Drug Addiction (EMCDDA) reported that 43% of those who were sentenced to jail had abused illicit substances before they entered prison.\nThe agency said the data made available to it by the Maltese authorities in this regard covered 2014.\nThe researchers noted that most prisoners undergoing drug therapy in prison were given opioid substitution treatment (OST). This was initiated at a hospital’s forensic unit and the inmates would then be transferred back to prison once they were stable. In addition,  protocols were in place for the transfer of inmates to selected drug rehabilitation units.\nThe analysis also showed that just under half of drug-related admissions to hospital in 2017 resulted from cocaine abuse. Although the trend was widespread across Europe, with cocaine being the drug most commonly found to be involved in hospital presentations in the year under review, Malta’s rate is the third-highest in Europe.\nIn Italy, just under 60% of those admitted to hospital because of drug use had abused cocaine, with the figure dropping to 50% in Spain. They were the only two countries to register rates higher than Malta’s.\nThe researchers also noted that differences in the drugs involved in emergency admissions appeared to reflect variations  in hospital catchment areas  and local patterns of use.  For example, emergencies  involving amphetamines were most common in the north and east of Europe, whereas admission related to cocaine were predominant in the south and west of Europe, they said.\nThe European monitoring centre reported 13 kilograms  of heroin and 0.3 kilograms  of cocaine were confiscated in 2017. Less than 0.1 kilos of amphetamines and 405 tablets of MDMA, MDA and MDEA were seized as well as 591 kilos of cannabis resin, 0.2 kilos of herbal cannabis and 11 cannabis plants.\nThe report acknowledged that cannabis was the most frequently-seized drug in Malta, pointing out it is “the only illicit drug known to be produced in the country, mostly on a small scale”.\n“Cannabis resin from Morocco is imported via Tunisia and Libya. Heroin of Afghan origin is imported via Turkey, North Africa or Western European countries and cocaine is smuggled to Malta mainly through Spain. Synthe- tic stimulant drugs such as MDMA/ecstasy and amphetamine are imported from other European countries, particularly Italy and the Netherlands. The availability of new psychoactive substances (NPS) is low but it  has grown in recent years,” the researchers reported.", "comment_count": 2, "id": 829}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Swift action by the Gudja local council led to the removal within days of tarmac illegally laid across a country lane in the historic Bir Miftuħ area, raising concerns about nearby archaeological remains.\nThe lane before the tarmac was laid.\nThe tarmac surfacing was removed by the contractor responsible at the authorities’ insistence on Tuesday, three days after it had been laid without a permit on a stretch of lane off Dawret il-Gudja, close to the airport.\nUpgrading works are being carried out in Dawret il-Gudja, the arterial road between Għaxaq and Gudja, by government agency Infrastructure Malta.\nThe illegal tarmac surfacing was first flagged by local councillor Stefan Caruana, who said the Bir Miftuħ area was the site of historic remains including a dolmen and menhir and was located close to the Ħal Resqun catacombs.\nThe lane itself, he said, was likely to have been in use since the time of the Knights of St John.\nFollowing the councillor’s complaints, the issue was taken up by newly-elected mayor Marija Sara Vella, who said she contacted the authorities to ask for the works to be reversed.\n“We insisted that, as a historical area, studies should be carried out before anything happens with that road,” she told the Times of Malta. “Infrastructure Malta understood our concerns and immediately took action: I think it was positive from both ends.”\nThe government roadworks agency recently faced controversy after concrete was laid to widen a number of country lanes in Wied l-Isqof, Rabat.\nIt was forced to reverse the works on orders from the environment authority, which said the works had led to “biodiversity destruction” and altered the physical profile of the valley.\nLast summer, Transport Malta laid asphalt on a stretch of the valley bed at Wied Qirda, near Siġġiewi, formalising an ‘illegal’ road that had been subject to an enforcement notice since 2007. The PA said earlier this year it had decided to withdraw the enforcement notice and no further action would be taken over the new road.", "comment_count": 25, "id": 830}, {"keywords": "", "author": "", "article_body": "A motorcyclist was seriously injured in a collision with a car in San Ġwann on Thursday.\nThe incident happened in Triq tal-Mensija at 4.30pm.\nThe injured man was a 44-year-old from Swieqi who had been driving a Yamaha.\nThe car was a Renault driven by a 30-year-old woman from Naxxar. ", "comment_count": 0, "id": 831}, {"keywords": "", "author": "", "article_body": "House Speaker Anglu Farrugia is to consider tabling in the House any complaints he receives in writing from people who feel wronged by what is been said about them in the chamber.\nSpeaking at a commemoration of the 1919 Sette Giugno riots, he recalled how in last year’s event, he had said that the time had come to address issues which arose when citizens felt aggrieved by statements made about them in Parliament under privilege and to establish a mechanism to grant redress.\n“Until such time that Parliament adopts such mechanism, I believe that the time has come for me to consider tabling in the House all the complaints I receive from citizens in writing when they feel wronged by what has been said about them in the House,\" Dr Farrugia said.\n\"As we commemorate the centenary of the Sette Giugno riots, I am of the opinion that without any further delay, we should move ahead with the introduction of some kind of mechanism so that whoever abuses their parliamentary privilege is made answerable for their actions. Members of Parliament represent the electorate…they should always be accountable for what they say…\nIn his address, given at the foot of the Sette Giugno monument on Valletta, Dr Farrugia spoke at length of the events 100 years ago which saw four Maltese killed by gunfire from British troops. The riots eventually led to the granting of a constitution and the setting up of the Legislative Assembly in 1921.\nDr Farrugia said he was bewildered how the troops who had opened fire in breach of their own orders, were not disciplined, whereas some civilians who  happened to be present in Valletta, were actually jailed.\nMore than 115 Maltese people were found guilty; some of them, like Salvatore Bartolo, were even sent to prison on conviction of “being present at a sedition; did not do his utmost to prevent it” and “attempting to induce members of HM’s forces to act in a manner which he knew to be in contravention of the orders of the Army” he said.\nOn September 13, after a court martial, Salvatore Bartolo was sentenced to 20 years imprisonment.\nIn another case Giovanni Miller was also accused to have “attempted to induce members of HM’s forces to act in a manner which he knew to be in contravention of the orders of the Army”. He was sent to prison for 15 years.\nAnother Maltese citizen, Francesco Debattista, was sentenced to seven years in prison simply because he was present at the riot; the charge stated that he was “present in a sedition; did not do his utmost to prevent it”.\nOther Maltese were sent to prison for between two and five years for failing to take action against those who were protesting or taking part in a demonstration.\nIn his address Dr Farrugia welcomed efforts to increase the number of women MPs.\nConcluding he said efforts must continue to ensure that democracy remained not only alive and relevant, but also more representative of society at large, so that the Maltese people truly felt well-represented in Parliament, with elected Members of Parliament who had the citizen’s best interests at heart.   ", "comment_count": 8, "id": 832}, {"keywords": "", "author": "Denise Grech", "article_body": "The Pilatus bank controversy was a lesson learnt for the Financial Intelligence Analysis Unit, its director Kenneth Farrugia said.\nSpeaking at the Finance Malta annual conference, Mr Farrugia said the FIAU did not appeal decisions by the European Banking Authority on the matter because it decided to adopt the recommendations.\nThe EBA had found the FIAU had breached the requirements of a directive on the prevention of money laundering and terrorist financing in the way it handled Pilatus Bank.\nThe Ta’ Xbiex based bank had been embroiled in controversy since its inception. Last year, the bank had its licence revoked by the European Central Bank, two years after being implicated in money-laundering breaches.\nMr Farrugia said the FIAU went on to implement most of the recommendations by the EBA. \nHe also pointed out that awareness of money-laundering and financial crime had increased. The  FIAU had already received almost 1000 reports of suspicious transactions this year, he said.\nSpeaking on a panel on combatting financial crime, Police Economic Crimes Unit head Ian Abdilla said the police were also beefing up staff and were looking at raising the number of civilian financial crime experts on the team.\nMEPs Roberta Metsola and Alfred Sant also joined the panel on the discussion of combatting financial crime.\nDr Metsola said “reputation was everything”, addingthat  Malta needed to ensure that it held on to jurisdiction over its taxation system. To do this, it needed to show that the proper due diligence mechanism was in place.\nDr Sant, on the other hand, said Malta’s systems had had trouble “catching up” with the unprecedented economic growth. However, he said, financial crime was “subjective”. What was legal in the EU was not legal in the US, he said, adding aggressive tax planning would not have been considered that 30 years ago.\nMuch of the rhetoric on financial crime in the European Parliament had also been ideologically based, he added. \nMalta seen as 'high risk'\nThe panel was preceded by an address by PwC partner and financial crime expert GianFranco Mautone, who warned that Malta is still seen as high risk for correspondent banks following scandals such as Pilatus bank.\nMr Mautone said the Pilatus bank case should not be seen in a negative light, but as a lesson for the country.\nMr Mautone recommended the country continues to assess risk on a regular basis.\nEvery country which has a significant number of banks cannot say it does not have money-laundering in its jurisdiction. The point is, what are you doing about it.- Edward Scicluna\nOver time, there had been a greater global awareness of financial crime due to international investigations such as LuxLeaks and the Panama Papers, he said, adding that investigative journalists played a role in raising awareness on the issue.\nFinance Minister Edward Scicluna said the financial watchdogs had started out with only a handful of experts.\nCorruption allegations and money-laundering scandals happened in part because “we didn’t have an EU institution which looks after money-laundering”.\nThe FIAU had started with only a few people but now there were over 50, he said, adding the government had taken issues and concerns raised in its stride.\nThe government was also looking into having a larger institution to address money-laundering that would be detected by the FIAU and the MFSA, he said.\n“Every country which has a significant number of banks cannot say it does not have money-laundering in its jurisdiction. The point is, what are you doing about it,” Prof. Scicluna said.", "comment_count": 35, "id": 833}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A court has cleared a family doctor of responsibility for the death of a female patient.\nThe 56-year old married woman fell ill after having been to the beach on a Sunday in August three years ago.\nThe following day she visited the family doctor, who attributed her complaints and localized symptoms to muscle pain and administered ordinary painkillers.\nHe had reached that diagnosis since he knew that the woman suffered from osteoporosis, lived on the top floor of a block of flats with no lift, did all the shopping and cleaning and had arthritis in her spine, the court was told.\nYet, the following day, the symptoms worsened, prompting the patient to call the doctor once again, complaining of general weakness.\nThe doctor visited the patient, carried out a general clinical examination and checking her blood pressure, pulse and heart beat. He prescribed a lower dose of her blood pressure pills, since this was low whilst her heart beat was high.\nBy Wednesday, the patient was running a fever and another medical check showed that her blood pressure was low, while her heart beat was high.\nKnowing that his patient took medication to control her anxiety and in the absence of other symptoms, the doctor advised her to get in touch with him if the situation took a turning for the worse.\nOn Thursday, the family called in another family doctor who immediately wrote a ‘ticket of referral’ to Mater Dei Hospital where the woman was admitted for emergency treatment, passing away shortly after her admission.\nAn autopsy was carried out, as was standard practice when a patient died within 24 hours of admission to hospital.\nThe cause of death was initially determined as being due to natural causes namely pneumonia and acute myocardial infarction in view of the patient’s ‘heavy’ lungs.\nHowever, further histological examination showed that the lungs were heavy and congested as a result of blood accumulated therein when the patient’s heart failed some six hours before her death and had nothing to do with pneumonia, the court was told.\nThe criminal inquiry had set off on this mistaken premise, since the inquiring magistrate had not been provided with this important clarification.\nIn the light of all medical evidence, the way that the patient’s clinical picture varied from day to day and the doctor’s detailed examination on each visit on the basis of the complaints and symptoms presented, the court concluded that “he had shown the diligence ordinarily expected of a doctor in similar circumstances.”\nGiven the patient’s medical history and the fact that the symptoms lent themselves to varying diagnoses, Magistrate Doreen Clarke said that the death had not been “necessarily foreseeable.”\nThe doctor had exercised his profession correctly and had “no link to the death,” the court held, acquitting him of involuntary homicide.\nLawyer Joseph Giglio was defence counsel. The court banned publication of names. ", "comment_count": 4, "id": 834}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Newly-elected Labour MEP, Josianne Cutajar, was given “presidential” treatment last week with two motorcycle policemen accompanying her carcade from Mġarr to her parents’ house in Nadur.\n\nGozo ferry passengers waiting to make the crossing back to Malta said the two police officers were seen waiting together with a number of cars carrying Labour Party supporters at Mġarr harbour on May 27.\n“To our surprise, as soon as the arriving ship lowered its ramp, the new 28-year-old MEP, Josianne Cutajar, disembarked, waving to her supporters and was given a hero’s welcome,” one of the passengers recalled.\nAnother commuter said what really surprised him was the fact the two police officers switched on the blue lights and sirens of their service motorcycles and escorted the “spontaneous” carcade.\nThe two policemen stayed with the carcade all the way to the residence of Dr Cutajar’s parents, where she was again warmly welcomed by neighbours and well-wishers.\nA police spokesman said that two outriders accompanied the carcade to control traffic.\n“The two police officers were only dispatched to Mġarr harbour to ascertain the smooth flow of traffic,” he said. However, given the number of vehicles gathered at Mġarr, the officers decided to lead the carcade from a distance to help with the traffic flow.\n“The officers were not there to serve as outriders or to lead the carcade but the intention was to avoid traffic jams,” the spokesman insisted.\nThe officers were only dispatched to Mġarr harbour to ascertain the smooth flow of traffic\nThe “spontaneous” carcade happened just after 8pm, when, according to Gozitan residents, the roads there were usually quiet.\nFootage shows the two motorcycle policemen leading a carcade of about 10 cars.\nPolice outriders regularly accompany the President of Malta and, on certain occasions, even the Prime Minister.\nGraduating as a lawyer in 2012, Dr Cutajar was elected as a councillor in Nadur on the same year and was immediately put on the government’s payroll in 2013 as a legal coordinator at the Office of the Prime Minister. She was also appointed as deputy chairwoman of Gozo Channel.\nDr Cutajar is the first Gozitan to make it to the European Parliament.\nivan.camilleri@timesofmalta.com", "comment_count": 95, "id": 835}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A hunter accused of shooting down three white storks last August, in an incident that caused a nation-wide media frenzy, was cleared of six out of eight charges on Thursday.\nHe ended up with a fine and 2-year licence ban for carrying a loaded weapon in breach of law.\nJames Magri, 42, from Dingli had been arraigned days after the birds were shot down near Dingli.\nA flock of some 18 of the protected birds had flown to Malta. They flew over Dingli school and some came to rest on a pole close to the accused’s property.\nEarly in the evening of August 10, two of Mr Magri’s friends had paid their habitual visit to the accused’s field in the limits of Dingli where they would meet up for a coffee and a chat.\nThe two men later testified that they had spotted the flight of storks, watching as some of the birds approached their viewpoint inside the accused’s field.\nThey suddenly heard three shots in succession. The accused had walked away a while before, taking his hunting shotgun with him.\nHe returned shortly afterwards, appearing somewhat “confused” (ftit imgerfex) telling his friends to pack up and leave.\nLater that evening, the man had called one of his friends allegedly saying, “I’ve put my foot in it,”(għaffiġtha)\nWhen testifying, both friends had said that they had not seen any dead birds, whether on the ground or in their friend’s possession.\nHowever, they did say that they had spotted a man riding his bike along the main road soon after the shooting, as the trio left the field, each going separate ways.\nThat cyclist turned out to be the man who had reportedly been observing the flight of the protected birds in the Dingli skies and had immediately alerted Birdlife when he heard the shots and watched three of the birds plummet downwards.\nCycling in the direction of the shots, the witness had recalled having caught sight of a man, armed with a rifle, a bird in one hand, just as he disappeared down some sort of country path.\nThe suspect had soon re-appeared, the bird no longer in sight, the witness had explained.\nYet, after closely analysing the footage from the cyclist’s action camera, the Court observed that the person filmed at a distance could not be identified.\nAlthough the police had searched the area of the shooting, they had only recovered one of the three storks allegedly shot down, namely the one that had landed on private property few meters away from the accused’s field.\nMoreover, the court observed that searches at the accused’s home had yielded a showcase of stuffed birds and two freezers, but “nothing irregular” in the man’s possession.\nIn the light of such lack of evidence, the court “could never find guilt with respect to the first six charges,” the judgment declared.\nHowever, the evidence proved beyond reasonable doubt that the accused had been carrying a loaded weapon without its cover and in a place not open to hunting, the court, presided over by magistrate Astrid May Grima, declared, fining him €3500 and suspending his hunting licence for two years.\nLawyer Edward Gatt was defence counsel.", "comment_count": 0, "id": 836}, {"keywords": "", "author": "", "article_body": "Maths and Maltese exams in government secondary schools will be held as usual, despite a directive by the Malta Union of Teachers to stop them, the Ministry of Education said on Thursday.\nThe MUT earlier in the week said it had directed its members not to hold the exams, in protest over a shortage of teachers which, it said, was seeing a number of teachers being required to give more lessons than provided for in the collective agreement.\nThe Ministry of Education said it had held two days of talks with the MUT over the Maths and Maltese teachers' 'load of 25 lessons'.\nIt said the exams would be held according to the timetables issued by the schools even though no agreement had been reached with the MUT. The union, it said, had rejected the latest offer made by the government.\nThe ministry did not say what the offer consisted of, but said it was willing to continue talks.\nThe MUT in a separate statement said its directive remained in force despite what it said was a desperate government attempt to 'bribe and divide' educators.\nIt said the talks showed that the Education Ministry did not realise what the problem was, and was trying to paper over it. \nThe ministry's proposal, it said, was 'indecent.'  'degrading' and an insult\nIt said the ministry had offered a once-only payment of €3000 to those who had a caseload of 25, so that the directive could be withdrawn, an offer meant to divide the teachers without solving anything. \nThe union said this issue was symptomatic of the wider problem of a shortage of teachers which needed to be addressed. \nThe union said it had also learnt that exam papers were being prepared by people who were not involved directly in schools, as had happened for the half-yearly exams. It said it had no confidence in the process, more so since the half-year exams were a shambles.  \nThe union on Wednesday criticised the government for attempting to circumvent its directive, saying it was even trying to get exam papers from Church schools.\nThe government had retorted that only 11 of the 176 teachers of Maltese and 25 per cent of Maths teachers have 25 lessons a week.\nIt pointed out that the maximum class load was laid down in the sectoral agreement and that in this context only 3.5 per cent of all the middle and secondary schools had this level of workload, which showed that it was the exception rather than the rule.\n \n ", "comment_count": 83, "id": 837}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Pro-choice groups have warned that women in Malta are being targeted with “deception and intimidation” to prevent them from accessing legal abortion care overseas.The Abortion Support Network (ASN), the British Pregnancy Advisory Service (bpas) and Voice for Choice Malta, claimed women in Malta had reported anti-abortion groups impersonating abortion service providers and providing false information about travelling to England for an abortion. In a joint statement, the groups said women had also received abusive text messages and even had people show up at their home to dissuade them from having an abortion. They warned that by attempting to block women’s access to safe, legal care overseas, women would be delayed and forced to undergo procedures at a later gestation, at an increased cost, or may resort to using abortion pills purchased online, illegally, risking up to three years imprisonment.\nRead: Abortion Support Network expands service to Malta“One group shared women’s phone numbers and e-mail addresses with an anti-abortion group in Ireland,” Abortion Support Network founder Mara Clarke said.“Another person pretended to be an employee from an abortion clinic and told a young woman she needed to delay her procedure by two months (by which time it would have been too late for her to get an abortion in England).“Another anti-abortion activist, after pretending she would help a woman get an abortion, sent her abusive text messages and visited her home trying to dissuade her from having an abortion.“Two of the women we heard from were in quite vulnerable situations and it is despicable that these organisations would prey upon women in this way.”\nRead: 'Women should have access to abortion in at least four circumstances'The groups warned women they were likely to be speaking to an anti-abortion organisation if they were told that abortion causes breast cancer, mental health issues, or infertility; if they were told to get a scan in Malta; asked for their home address; or contacted from an Irish phone number (+353). “While we respect the right of individuals and organisations to be against abortion, we draw the line at using scare tactics, lies, and intimidation,” they said.\nAbortion Support Network is a UK-based charity providing financial assistance, practical information and accommodation to those living in countries with restrictive abortion laws, and expanded its services to Malta last February.\nVoice for Choice, a Maltese coalition of pro-choice groups, was set up in March to work for reproductive rights and justice in Malta.", "comment_count": 33, "id": 838}, {"keywords": "", "author": "", "article_body": "Passenger movements at the airport grew by 4.8 per cent in May compared to the same month in 2018, MIA said on Thursday.\nIt said it handled 670,000 passengers while aircraft movements grew by 4.2 per cent.\nSeat capacity grew by 5.3 per cent and the airlines enjoyed a healthy seat load factor (SLF) of 80.2 per cent.\nThe top contributors to passenger traffic through Malta International Airport were the United Kingdom (+1.1 per cent), Italy (+4.1 per cent), Germany (+0.3 per cent), France (+4.3 per cent) and Spain (+15.3 per cent).\nThe airport’s two biggest markets are being served by a total of six new routes this summer - Exeter, Cardiff, Perugia, Lamezia, Verona and Genoa. While the first four routes were launched in April, the first flights from Verona and Genoa were welcomed earlier this week.\nMay results have brought year-to-date traffic up to 2.5 million passenger movements.", "comment_count": 1, "id": 839}, {"keywords": "", "author": "Denise Grech ", "article_body": "An estimated €100 million a year is lost to counterfeiting and piracy, according to a report by the European Union’s Intellectual Property Office.\nTaken as a whole, the total value of the lost sales was equivalent to €221 per Maltese citizen in a year, the analysis by the EU office, known as EUIPO, said.\nThe report, published yesterday, was the second sector-wide assessment of the economic impact of counterfeiting and piracy in key economic areas known to be vulnerable to intellectual property rights infringements by the EUIPO.\nLost sales in the clothing, footwear and accessories sector due to counterfeiting were estimated at about €76 million annually, or 14.1 per cent of sales, in Malta.\nThe estimated loss for the cosmetics and personal care sector is €8 million, that is, 16.6 per cent of all sales.\nThe EUIPO analysis looked at various sectors: cosmetics and personal care; clothing, footwear and accessories; sports goods; toys and games; jewellery and watches; handbags and luggage; recorded music; spirits and wine; pharmaceuticals; pesticides; and smartphones.\nThe total value of the lost sales was equivalent to €221 per Maltese citizen in a year\nThe report brings together the findings of research carried out by the EUIPO through the European Observatory on the Infringement of Intellectual Property Rights on the extent and economic consequences of intellectual property right infringement in the EU.\nBecause of the high value associated with intellectual property rights, infringement was a lucrative criminal activity, generating significant costs to the rights owners and to the economy in general, the report noted.\nThe business models adopted by counterfeiters made significant use of the internet to distribute their products and to promote the distribution and consumption of illegal digital content, it added.\nThe EUIPO also looked at people’s attitudes to purchasing goods and services infringing intellectual property rights. It found that people were likely to purchase counterfeit goods and to access copyright-protected content illegally because of lower prices, easy accessibility and a low degree of social stigma associated with such activities.\nThe study estimated that, since the first analysis in 2018, the amount of lost sales dropped at EU level in all but two of the sectors studied: clothing, accessories and footwear as well as cosmetics and personal care.\nGiven that legitimate manufacturers produced less than they would have had in the absence of counterfeiting, thus employing fewer workers, the analysis estimated that up to 468,000 jobs were directly lost in the affected sectors across the EU.", "comment_count": 2, "id": 840}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The Malta Financial Services Authority is expecting another “four to five banks” to set up in Malta over the next few years, according to its CEO Joe Cuschieri, who added that the island needed new actors in this field.\nHe was fielding questions during a panel discussion during the FinanceMalta conference, the audience of which had already heard Parliamentary Secretary Silvio Schembri say that banks were struggling to adjust to the fast-changing scenario of FinTech.\nBanks have been under fire from operators as the MFSA and government move on with legislation to make Malta a 'Blockchain Island' – while they drag their feet – or refuse outright – to open accounts for companies that move here to open up operations in both blockchain and cryptocurrencies.\nSources told Times of Malta it appears that the medical cannabis sector could face the same closed doors, with the government pushing to make Malta a destination of choice, but companies finding it impossible to get bank support.\nIn his speech to the conference, Prime Minister Joseph Muscat admitted that the banking ecosystem was not moving at par with “government and its aspirations”.“We need to move swiftly and prudently and we need to prod financial institutions to move with us,” he said.\nAsked by Times of Malta what could be done to solve this impasse, he stressed that governments could not intrude into the management of banks.\n\n“We do need to put forward the idea that banks should not be safety deposit boxes. But we need to understand that some key players in our industry face particular challenges: internationally one bank was subjected to investigations in the US, not due to a situation in Malta but due to a situation elsewhere.\n“And Bank of Valletta also has to be seen in context, not because it is doing badly – it is performing very handsomely – but because nowadays its share of the local economy is so big that, while it is a small bank at European level, it is seen as a bank with systemic impact by the Joint Supervisory Team locally.\n“We cannot just say they need to do more. We need to understand their context. Part of the solution is definitely attracting more banks to the island. We are in a unique situation where the current players themselves want more competition. And that is something that we are actively pursuing.\n“I was in London on Wednesday having talks among others with key players to pitch Malta as one of the markets they should be looking at in order to invest – because there is an opportunity to invest and because we need to expand our ecosystem,” he said.", "comment_count": 14, "id": 841}, {"keywords": "", "author": "", "article_body": "Nationalistic and Islamophobic rhetoric has “no philosophical or theological basis in Christian tradition,” the Church in Malta said on Thursday, calling on all Catholics to resist politics of hate and exclusion.The Church’s Justice and Peace Commission said in a statement it felt the need to speak out over the rise in “confrontational nationalism” that represents outsiders as a social, economic and religious menace.The commission referred an increase in support for far-right movements, some of which base their arguments on the need to protect a ‘Catholic identity’ as well as recent statements by Guardian for Future Generations Maurice Mizzi, who justified his call to exclude migrants and Muslims in particular by invoking his desire to live and die in a Catholic country. “On the contrary, Christian tradition helps shape a counter-narrative based on solidarity and hospitality as well as on our common humanity and dignity,” the commission said. “Moreover, the principle of the common good, as formulated in Catholic social teaching, fundamentally challenges a culture that prioritises personal interest over solidarity with the weak and marginalised, or narrow national interest over global concern. “Whilst it might be tempting to believe that good fences make good neighbours, history teaches us that those who build walls will become prisoners of the walls they put up.”In recent years, it said, Pope Francis had shown what it meant to foster a culture of encounter and solidarity to counter fear and exclusion, including visiting Lampedusa, travelling back to the Vatican with a group of asylum-seekers from Lesbos, and washing the feet of a group of Muslim men and women.The commission said Pope Francis had made clear that migrants were not a threat to the culture, customs and values of a receiving nation, and that duty of Christians towards migrants could be articulated around four verbs: welcome, protect, promote and integrate.", "comment_count": 27, "id": 842}, {"keywords": "", "author": "", "article_body": "President George Vella said the mistakes of one or two soldiers, great as they may be, do not reflect on the Armed Forces of Malta. \nDr Vella was speaking during a recent visit to the AFM weeks after two soldiers were arrested in relation to the murder of a man from the Ivory Coast.  The shooting is believed to be the first racially-motivated murder in the country. \nThanking the army for \"its impeccable work\" and operations to save people’s lives at sea, the President said the army was exemplary to other countries in terms of the number of rescues and humanitarian aid it provided. He thanked soldiers for putting Malta’s interests first.\nThe President also thanked soldiers' relatives for their continuous support. \"They often go through tough times while their relatives are out on a mission while waiting for them to return home,\" he said.\nBrigadier Jeffrey Curmi said the President’s visit helped give a clear picture of the roles of the AFM. These roles required hard work and dedication, he said.\n ", "comment_count": 17, "id": 843}, {"keywords": "", "author": "", "article_body": "More than three million plastic bottles, or over 253,000 kilograms of plastics were collected in just five months through theiBiN scheme.\nThe ‘intelligent bins’ are rubbish skips that gauge the volume of waste disposed and have doubled the collection of plastic waste, according to GreenPak.\nEarlier this year, iBiNs replaced all previous recycling skips in the 40 localities served by GreenPak.\nThe latest figures show that between January and May plastics recovery nearly doubled when compared to the same period in 2018. GreenPak said it also registered another highly significant increase of 39% in recovered paper and glass materials.\nFrom over 651,000 kilograms last year, the total figure for both paper and glass over the past five months increased to more than 882,000 kilograms, GreenPak added.\nThe iBiNs measure their fill-level and transmit the information to a central system using Narrowband Internet of Things (NB-IoT) technology provided by Vodafone Malta.\nA web-based application also guides people to the nearest iBiN.\n“Using our latest technological system, today we know that in 2019 there has not been a single day when citizens did not use GreenPak’s iBiNs to recycle,” CEO Mario Schembri said.\n“iBiNs are positively impacting on recycling in both Malta and Gozo as they are making it easier and more efficient for people to recycle, anytime, anywhere,” he added.", "comment_count": 7, "id": 844}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Updated 2.47pm\nMEPs Ana Gomes and David Casa have rejected a request for a meeting by two men accused of the murder of Daphne Caruana Galizia.\nAlfred and George Degiorgio on Thursday morning sought court authorisation to hold a meeting with the MEPs, saying such a meeting should be open to the foreign press.  \nBut the MEPs swiftly replied in a statement that 'politicians have no place negotiating with suspected murderers.'\nThis unexpected request was voiced by lawyer William Cuschieri at the start of the compilation of evidence against the Degiorgio brothers and co-accused Vincent Muscat.\nThe request took the prosecution and parte civile lawyers unawares. They said that this was an extraordinary request which fell beyond the scope of the judicial process.\nAssistant Attorney General Philip Galea Farrugia said he was “bewildered” by this request, stating that this case was subject to a judicial process and politicians, the media and other third parties, with all due respect, were to be left out of it.\nThe basic principle was the judicial proceedings took place before the courts and no-one else, Dr Galea Farrugia stressed.\n“The request is extraordinary and should be discussed behind closed doors,” intervened Dr Jason Azzopardi, appearing parte civile. “Why couldn’t they meet the inquiring magistrate, for instance?” he continued,\n“I’m afraid that after that meeting, once news had been divulged by press, whose duty it is to do so, the defence might then institute proceedings claiming that certain rights had been breached” continued Dr Azzopardi, implying that there was more to the request than what appeared at face value.\nNormally, Degiorgios’ defence team complained of media reports in respect of the accused, Dr Galea Farrugia added.\nHowever, Dr William Cuschieri explained that, although not yet fully aware of what his clients actually wished to discuss with the MEPs, (having only been informed of their request this morning) he had sought court authorisation since the Degiorgios were under custody.\nMoreover, “others had gone abroad before this, under the pretext that they did not trust local institutions, handing over laptops to foreign authorities,” Dr Cuschieri remarked.\n“How could I be a party to a possible breach of rights?” Magistrate Claire Stafrace Zammit said.\nAfter briefly consulting his clients, Dr Cuschieri informed the court that the Degiorgios “did not wish to add or detract anything from their request as originally framed.”\nIn the light of this unexpected twist, the Court granted the prosecution and parte civile lawyers to file their written replies to the Degiorgios request by Monday. The court would then decree on the matter accordingly.\nCasa, Gomes reply\nIn a reaction, David Casa and Ana Gomes said politicians have no place negotiating with suspected murderers being held in custody.\n\"If the accused want to make a confession, they should do so to the magistrate and if they want to make a public statement claiming innocence they can do so in court or by releasing a statement via their lawyer,\" they said in a statement.\n\"The only role that parliamentarians can play in a criminal case is to hold authorities to account. They cannot do the job of a magistrate, the police or the prosecutor. They can only see to it that those people are doing their jobs properly” they added. \nContravention photos disappear\nIn the course of Thursday’s sitting, prosecuting Inspector Keith Arnaud presented a list of reports recorded on the police system where reference was made to the assassinated journalist.\nA search via the ID card number of the victim, dating back to 2006, had returned five reports in all, of which only three were printed and presented on Thursday in the records of the compilation. The fourth involved a traffic accident, while the fifth concerned the murder itself.\nDr Cuschieri asked Inspector Arnaud whether police had taken steps over a report in 2008 claiming that two individuals intended to plant a bomb outside the Caruana Galizia home.\nAn anonymous caller had informed the control room that two persons, identified in the call, were planning to plant a bomb. The police had in fact spoken to the two persons identified by the caller, but nothing had come of it.\nA LESA enforcement officer, on the central region, took the witness stand presenting copies of two contraventions related to the car which had been leased by Alfred Degiorgio.\nA search on the authority’s system had returned two contraventions, issued by a warden, one having a photo of the car attached. The second ticket conceded parking on double yellow lines in Triq it-Tonn, St Paul’s Bay in August 2017.\nThe warden had noted that there were two photos attached to this contravention but the witness explained that “for some reason, these photos were never found on the system, nor were they ever archived. Nothing was found.”\n“Were the tickets handed to the driver or left on windscreen?” asked Dr Cuschieri.\n“Most probably, left on windscreen,” the LESA witness replied, leading the lawyer to remark that therefore the identity of the person in control of the car could not be determined 100%.\nThe compilation continues in July.", "comment_count": 0, "id": 845}, {"keywords": "", "author": "", "article_body": "Nearly all of Malta’s swimming areas met the EU’s most stringent water quality standards last year, according to a European Environment Agency report.Out of 87 reported bathing sites around the islands, 86 were given the top ‘excellent’ ranking. The remaining site, not identified in the report, is one ranking level below, although still above the minimum quality requirements.Malta’s 98.9% ‘excellent’ rating in 2018 - unchanged in three years - was the second highest in Europe, only behind Cyprus. Along with Malta and Cyprus, Greece, Latvia, Luxembourg, Malta, Romania and Slovenia all reported at least ‘sufficient’ quality at all their reported bathing.The three countries with the highest numbers of poor quality bathing water sites were Italy, France and Spain.Across Europe, just over 85% of bathing sites met the ‘excellent’ standards. An overwhelming number - 95.4% of the 21,831 bathing water sites monitored in the 28 EU states - met the minimum quality requirements. “Our report confirms that Member States’ efforts over the last 40 years, mainly in wastewater treatment, have paid off,” EEA executive director Hans Bruyninck, said. “Today, most Europeans enjoy excellent bathing water quality. However, this is only one of the many components, ranging from tackling plastic pollution to protecting marine life, we need to work on in order to achieve healthier seas, lakes and rivers.”", "comment_count": 6, "id": 846}, {"keywords": "", "author": "Keith Micallef", "article_body": "Last updated - 8.45pm - \nThe Nationalist Party’s Executive will meet again on Saturday to discuss who the party will co-opt to fill David Stellini's seat in parliament after Jean-Pierre Debono, who was controversially nominated last week, turned down the offer.\nIt was also announced on Thursday that the PN parliamentary group will be meeting on Monday afternoon, the first time since April 15.\nOpposition Whip Robert Cutajar confirmed the parliamentary group meeting in reply to questions sent by Times of Malta earlier this week when it was reported that the group had not met for almost two months.\nIn his comments, Mr Cutajar declined to say what was on the agenda. “This is never sent in advance and has been the practice under different leaderships,” he said.\nHe denied reports that this meeting was being held upon the request of a number of a number of MPs. “No such request has been ever made,” he noted as he insisted that the group was not convened this week due to the tight parliamentary schedule, and in view of the fact that some PN MPs were indisposed.\n“A number of MPs had written to me saying they would be abroad, and consequently requested not to convene the group until their return,” he added.\nAsked about the fact that the group had not met in almost two months, the Opposition whip said that the Easter break and the government’s decision to adjourn Parliament for two weeks, meant that there were no pressing parliamentary issues to debate.\nThe PN statute says that the group must meet at least once a month.\nExecutive to meet on Saturday\nMeanwhile the PN executive committee will be meeting on Saturday morning to decide who will be co-opted in Parliament to fill the seat vacated last week by David Stellini, who is returning to an old job in Brussels.\nThe agenda also includes a presentation on the result of the European and council elections held last month in which the party suffered historic defeats; and the setting up of an electoral commission to fill in the vacant seats in both the executive committee and the administrative council.\nThe notice of the meeting says that anybody unable to attend must inform the party’s political coordinator Jean Pierre Debono.\nMr Debono has been in the eye of a storm after the Executive by a majority of two, originally decided that he should be co-opted to fill Mr Stellini's seat, despite protests from many who argued that the seat should be taken by Kevin Cutajar as the next best-placed candidate in Gozo, from where Mr Stellini had been elected.\nIt then resulted that two of those who voted in the Executive were not entitled to do so, and the list of voters. It was claimed that it was Mr Debono himself who compiled the list of voters. Mr Debono denied the claim but subsequently declared he would not take up the seat in parliament. \nKevin Cutajar said on Thursday that progress has been registered in the Nationalist Party regarding the seat vacated by David Stellini.\nCandidate Joseph Ellis backs Cutajar\nIn the evening, PN election candidate Joe Ellis published a letter he had sent PN general secretary Clyde Puli. He thanked him for having invited him to declare whether he had an interest in Mr Stellini's seat, but said he felt the seat should go to Dr Cutajar, who was eminently qualified for it. ", "comment_count": 15, "id": 847}, {"keywords": "", "author": "", "article_body": "Horses were corralled out of a farm in Siġġiewi after it caught fire on Thursday.\nPolice were informed of the fire in Triq Ħal Xluq at around 11.40. There have not been reports of any injuries.\nFire engines and police are on site. \nThe cause of the fire is not yet known.\n ", "comment_count": 16, "id": 848}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A constitutional court has declared that Alfred Degiorgio’s right to a fair hearing had not been breached by a ruling of the Magistrates’ Court allowing FBI experts to testify in the Caruana Galizia murder compilation.\nThis was the crux of a judgment handed down on Thursday by the First Hall, Civil Court in its constitutional jurisdiction in proceedings instituted by Mr Degiorgio who, alongside his brother George and Vincent Muscat, is currently being accused of the murder of Daphne Caruana Galizia.\nThe Magistrates’ Court presiding over the murder compilation had allowed FBI experts to testify and present evidence last year.\nTwo requests for interim measures in similar vein, had also been turned down by the Constitutional Courts.\n“Did this amount to a breach of the applicant’s right to a fair hearing?” the Court asked. “This Court deems that the answer to this question is in the negative.”\nThe Court, presided over by Mr Justice Mark Chetcuti, observed that the testimony of the FBI witnesses, together with any documents exhibited in evidence by them, could still be removed from the records of the compilation under order of the Constitutional Court.\nMoreover, not only was the murder compilation still ongoing, but nor was that the final stage of the criminal proceedings, the Court went on, stating that proceedings had not even reached the stage of a trial by jury.\nThis meant that Mr Degiorgio could still avail himself of various ordinary remedies before the Criminal Courts, the Court declared.\nThe very fact that he had instituted this case was proof that the applicant always had an effective remedy as long as his claim was upheld, the Court concluded, rejecting the applicant’s claim of the alleged breach of rights.\nLawyer William Cuschieri assisted the applicant.", "comment_count": 0, "id": 849}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The prime minister stood firm with regards to Malta's tax scheme, saying the European Commission needed to understand that this was the country's prerogative.\nMalta had been accused in the Country Specific Report published by the European Commission on Wednesday of having a fiscal system which encouraged aggressive tax planning.\nSpeaking to journalists after delivering a speech at the FinanceMalta conference, he said that Malta was one of six or seven countries that had a recommendation about their tax system.\n\"The reaction of all of them – from Ireland, to the Netherlands and Luxembourg – was the same: that this is an issue of national competence and that we disagree with their analysis,\" he said.\nYou have to be able to run a party if you want to persuade people that you can run a country\nThe prime minister also noted that the number of recommendations made about Malta in the Country Specific Report were going down year on year, since these were being acted upon.\nHe was also asked to comment on the schisms within the Opposition, but said he only had one comment to make, anything else being inappropriate: “You have to be able to run a party if you want to persuade people that you can run a country.”", "comment_count": 16, "id": 850}, {"keywords": "", "author": "", "article_body": "The European Union's general court on Thursday dismissed action by former European Commissioner John Dalli, in which he applied for compensation for damages allegedly suffered as a result of the termination of his office.\nIn a statement, the European Court of Justice said Mr Dalli failed to show the existence of unlawful conduct on part of the European Commission or on behalf of the European Anti-Fraud Office (OLAF). He also did not establish a “sufficiently direct causal link between the conduct complained of and the alleged damage, or even the existence of the latter”.\nMr Dalli had sought compensation for the damage by the alleged “unlawful conduct of the Commission and OLAF”, connected with the termination of his office as European Commissioner in 2012.\nMr Dalli resigned the post of Commissioner following an investigation by OLAF into a complaint made in May by tobacco producer Swedish Match.\nFor the complaint to be upheld, case-law requires there have to be have been a sufficiently serious breach of a rule of law intended to confer rights on individuals, the Court said.\nIn this context, the Court rejected each of the seven complaints put forward by Mr Dalli concerning the unlawfulness of OLAF’s conduct.\nThe complaints alleged the unlawfulness of the decision to open an investigation, flaws in the characterisation of the investigation and the unlawful extension of it, the breach of the principles governing the gathering of evidence and distortion and falsification of the evidence, an infringement of the rights of the defence and of the principle of presumption of innocence and of the right to the protection of personal data.\nThe court also rejected two complaints put forward by Mr Dalli concerning the unlawfulness of the Commission’s conduct. The complaints alleged the violation of the principle of sound administration and of the duty to behave in a loyal, impartial and objective manner and to respect the principle of independence, and, secondly, the violation of OLAF’s independence.\nMr Dalli, however, failed to show the existence of unlawful conduct on the part of OLAF and the Commission. The European courts concluded that Mr Dalli “does not establish the existence of a sufficiently direct causal link between the conduct complained of and the damage alleged, or even the existence of the latter”.\nAn appeal may only be brought before the Court of Justice against thedecision of the General Court within two months and 10 days.\n‹›-+Page:  /  \n ", "comment_count": 16, "id": 851}, {"keywords": "", "author": "Claire Caruana", "article_body": "Just under half of drug-related admissions to the emergency room in Malta were a result of cocaine abuse, an annual report by the EU drug agency has revealed. \nPublished on Thursday, the annual European Drug Report by the European Monitoring Centre for Drugs and Drug Addiction (EMCDDA) showed that just under 50% of those admitted to hospital had abused of the illicit drug. \nAlthough the trend was widespread across Europe, with cocaine being the drug most commonly involved in hospital presentations in 2017, the year under review, Malta's rate is the third-highest in Europe.\nIn Italy, just under 60% of those admitted to hospital because of drug use had abused of cocaine, with the figure going down to 50% in Spain. The two countries were the only ones to register rates higher than Malta. \nThe researchers noted that differences in the drugs involved in emergencypresentations appeared to reflect variations in hospital catchments area and local patterns of use.\nFor example, emergencies involving amphetamines were most common in the north and east of Europe, whereas presentations related to cocaine were predominant in the south and west of Europe, they said.\nOn seizures by the authorities, the report shows that in 2017, 13 kilograms of heroin, 0.3 kilograms of cocaine were confiscated. On amphetamines, the report states that lest than 0.1 kilos and 405 tablets of MDMA, MDA and MDEA were also seized. \nOn cannabis, the centre said that 591 kilos of resin, 0.2 kilos of herbal cannabis and 11 cannabis plants were confiscated. \n ", "comment_count": 0, "id": 852}, {"keywords": "", "author": "", "article_body": "The Malta Union of Midwives and Nurses has threatened to issue directives to all its members unless sweets, sweet beverages and carbohydrates are reintroduced for staff in Mater Dei hospital. \nThe hospital had removed all \"non-nutritional\" and sugary drinks in an effort to encourage a change to a healthier lifestyle last year.\n\"MUMN would like to make it clear that Malta is not a dictatorship country where a person is obliged to eat only what the Health Promotion department deems fit,\" it said.\nMoreover, the starter given to staff, which was never a large portion, was also removed, it said, adding the Health Promotion Department should not \"impose\" a special diet on union members.\nIn an e-mail sent to management, the union said the change in menu was introduced without any consultation.  \nA person has every right to have glucose beverages, to eat a sweet desert or pasta - irrespective of whether that person works in Mater Dei or not, it said.\nOver time, the union had been \"bombarded\" with \"highly justifiable\" complaints on staff meals, it said, adding this was a \"cost-cutting exercise\" by the Health Promotion Department\nUnless sweets, chocolates, sweet beverages and carbohydrates were made available by June 10, directives would be issued, the union warned. \n\"If the management of Mater Dei Hospital and Sir Anthony Mamo Oncology Centre does not revert back to the previous menu with reasonable portions for all MUMN members, directives in all wards and departments, including operating theatres, Emergency and Accident department and ITU will be issued without any further notice,\" the email warned. \nHospital management should introduce a free gym in the hospital and oncology centre if it was worried about staff health, the union said.\nIt should not \"restrict our food to an antagonising meal, notwithstanding that most MUMN members have to work 12-hour shifts,\" it added.", "comment_count": 166, "id": 853}, {"keywords": "", "author": "", "article_body": "Maltese students have obtained overall second place in the 13th edition of the Supertmatik Mental Maths Challenge, which saw the participation of 257,259 students of 45 nationalities. \nThis was the best result ever achieved by Malta in this challenge. \nThe annual mental mathematics international championship is a competition for students aged between six and 15 years.\nMaltese students in different year groups, in both primary and secondary schools, have participated in one of nine categories depending on their age.\nThe competition promotes interest in mental mathematics and provides students with another opportunity to reinforce their skills in number and mental calculations through constructive play. \nIt aims at honing and celebrating talent in mental mathematics.", "comment_count": 5, "id": 854}, {"keywords": "", "author": "", "article_body": "Xagħra councillor Kevin Cutajar said on Thursday that progress has been registered in the Nationalist Party regarding the seat vacated by David Stellini.\n\nIn a post on Facebook, the lawyer, who is hoping to be co-opted to Mr Stellini’s seat, said that the issue was not yet concluded but he believed that results could be achieved with more work and Gozo would be able to hold on to what belonged to it.\nIn a heated meeting, which saw the resignation of Mark Anthony Sammut from committee President, the Nationalist Party executive on Saturday voted to co-opt Jean Pierre Debono to Mr Stellini’s seat, but Mr Debono said he would not be taking up the seat after the decision was challenged by the Nationalist Party’s own regional Gozo committee.\nBesides Mr Debono, Dr Cutajar was the only candidate to express interest in the seat.", "comment_count": 53, "id": 855}, {"keywords": "", "author": "", "article_body": "Sophie the Customs canine sniffed out another errant passenger on Wednesday, catching a man who had just landed in Malta with €16,000 in undeclared cash.\nThe man had just landed at Malta International Airport when Customs stopped him for a search. Upon questioning, he told officers he was carrying €10,000 in cash - the legal limit for undeclared cash.\nCustoms officials were not convinced, and with the help of Sophie found that he was carrying €16,000.\nThe man agreed to forfeit the excess cash, as part of an out-of-court settlement permissable by law.\nSophie has helped Customs detect thousands in undeclared cash this year and just six months in, 2019 is already a record-breaking year for undeclared cash seizures by Customs.", "comment_count": 13, "id": 856}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "Original documents providing new details on the Sette Giugno disturbances are being published for the first time in a revised second edition of a book being launched on the 100th anniversary of that fateful day.\nAuthor Paul Bartolo\nOn June 7, 1919, three Maltese protesters, Manwel Attard, Ġużeppi Bajada and Lorenzo Dyer, died when British troops fired at a rioting crowd in front of leading grain importer Anthony Cassar Torreggiani’s house in Strada Forni (Old Bakery Street), Valletta, and those attacking The Daily Malta Chronicle offices in Strada Teatro (Old Theatre Street). Another protester, Carmelo Abela, was stabbed at the palace of Colonel John Louis Francia (Palazzo Ferreria) the following day and succumbed to his injuries a few days later.\nHowever, Sette Giugno is not only about these tragic deaths but revolves around a whole series of circumstances and events that led to and followed the uprisings. \nVarious factors were at play, especially unemployment, hunger and misery under British rule, newly-introduced taxes, which mostly affected merchants and the nobility, irate university students opposed to the introduction of a British education system, and various political developments including a widespread call among the Maltese for self-government.\nBesides detailing the historical facts, the revised edition of X’kien ġara sew fis-Sette Giugno (What truly happened on June 7), first published 40 years ago, includes a new chapter that analyses a number of issues related to the events.\n\nAmong other matters, author Paul Bartolo discusses the rise in the cost of living, including the threefold increase in the price of bread, and the number of injured, dead and arrests made after the shootings. He delves into the subsequent British government’s strategy to control and calm down the crowds, how the decision to carry out a military inquiry was made and why the soldiers who shot at the Maltese were not punished.\nHe tackles the Maltese people’s request for self-government and asks whether the events of Sette Giugno amounted to a riot, a rebellion or a revolution. He chronicles how the happenings were reported by the Italian and British press and, in conclusion, goes into how all these events contributed to the development of democracy in Malta.\nThe over-500-page publication also includes copies of various original documents, which the author found at the national archives both in Malta and the UK while doing research for his Master’s dissertation on the effects of World War I.\n“The book mainly focuses on the evidence of the Sette Giugno inquiry. The aim is, however, not only to explain history but to give readers the possibility to see the original documents… as if they visited the archives themselves,” Prof. Bartolo said.\nThe publication includes chronological lists of those injured during the shootings, those who were court-martialled in England and relevant excerpts of the evidence tendered to the Commission of Inquiry, which heard the testimony of about 150 Maltese and English witnesses.\nThe funeral cortège of the first three victims of the Sette Giugno uprisings on June 9, 1919. Photo:  Giovanni Bonello  archives\nThe commission’s report is found in the appendix together with letters by social reformer Manwel Dimech and politician Nerik Mizzi, among other documents.\nThe book is complemented by various visuals, including photographs from the private archive of Giovanni Bonello, former judge of the European Court of Human Rights, that were never published before. These include images of life in Malta in the early 20th century, the first National Assembly meeting on February 25, 1919, and politicians and protagonists connected to the Sette Giugno events, including Dr Mizzi and Lord Plumer, the governor who assumed office on June 10, 1919, and recommended liberal concessions to the Maltese. \nEvery fact is documented\nThere are also pictures of thevictims’ funeral cortège from Floriana, where Mass was held, to the Addolorata Cemetery on June 9.\nAlso included are maps highlighting the venues in Valletta where the salient events happened, such as the Circolo La Giovine Malta premises where the National Assembly was sitting (St Lucy Street corner with Republic Street), Mr Cassar Torregiani’s home in Strada Forni, the offices of The Daily Malta Chronicle in Strada Teatro and the Union Club, the Britons’ hang-out in Strada Reale (now the Archaeology Museum, in Republic Street). The spots where the victims were wounded are also marked.\nIn the book’s foreword, Dr Bonello praises Prof. Bartolo’s meticulous and methodological approach to bring to light the “true facts”.\nA map of Valletta highlighting the locations where the salient Sette Giugno events took place.\n“Paul Bartolo provides a fundamental contribution so that the story of Sette Giugno is neither forgotten nor woven into fantasy and fairy tales, which, unfortunately, often happens in Malta. Every fact is documented, every opinion is anchored by evidence, with results nothing short of impressive,” he writes.\nThe hardback book is published by Klabb Kotba Maltin, the Maltese publishing arm of Midsea Books. It is available at all leading bookstores or from www.midseabooks.com.", "comment_count": 16, "id": 857}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says an estimated €100 million a year is lost to counterfeiting and piracy, according to a report by the European Union’s Intellectual Property Office.  In another story, the newspaper says more than 370 migrants disembarked in Malta on Wednesday, the largest number of survivors rescued by the Armed Forces of Malta in recent history.\nThe Malta Independent says the PN parliamentary group planned to meet, with or without PN leader Adrian Delia.\nL-Orizzont says that a screening service for babies aimed to prevent heart problems has been launched.\nIn-Nazzjon says the European Commission is requesting the independence of the Maltese judiciary.", "comment_count": 1, "id": 858}, {"keywords": "", "author": "Keith Micallef", "article_body": "The person co-opted to fill the parliamentary seat vacated by David Stellini must also hail from Gozo to be in conformity with the Constitution, according to former European Court of Human Rights judge Giovanni Bonello.\nDoubts on the legality of co-opting a non-Gozitan to succeed Mr Stellini, who resigned last week, were first cast by the Nationalist Party’s own regional committee of Gozo.\nIn a letter to party leader Adrian Delia last Sunday, the committee contested the decision made the day before by the executive committee to nominate Jean Pierre Debono, who had contested the seventh electoral district, comprising Żebbuġ (Malta), Dingli, Mġarr, Mtarfa and Rabat.\nThe committee said the seat should have gone to Gozitan candidate Kevin Cutajar, despite the latter having narrowly lost a vote on the matter in the executive committee meeting.\nApart from contesting the manner in which the ballot was conducted, the committee claimed the decision to nominate a non-Gozitan was in breach of both the letter and the spirit of the Constitution.\nThis argument was based on a constitutional amendment enacted in 2007 whereby Gozo was declared as one electoral district regardless of the change in its population. Moreover, the committee cited a provision in the General Elections Act on special cases such as co-option.\nAsked whether he subscribed to the Gozo committee’s view, Dr Bonello noted that the Constitution was the law that regulated all laws and, consequently, its provisions had to be respected by all. \nThe new member must have the same links with Gozo, constituents and constituencies as the member he is substituting\nThe matter of co-option of a new member of the House of Representatives, he noted, was governed by several constitutional rules, including two in particular.\n“The first is that Gozo is deemed to be a special region, different from the rest of Malta, and one to which specific constitutional rules are to apply. The Constitution recognises the particular identity and characteristics of Gozo as a separate and different entity from Malta,” he said\nThe second rule was that when the need of co-opting a new MP arose, the new member must be “as nearly as can be of the interests and opinions represented and held by the vacating member”. This meant, Dr Bonello continued, that the new MP must be of the same political party and represent the same interests as the previous one.\n“As the vacating member represented Gozitan interests – already defined as separate and distinct from Maltese interests – it follows that, to be in conformity with the express will of the Constitution, the new member must have the same links with Gozo, Gozitan constituents and constituencies as the member he is substituting,” he pointed out. \nThe PN has yet to decide on the co-option because, as Mr Debono last Monday announced, he was not taking up the seat amid internal dissent and mounting controversy. Though Dr Cutajar is the only candidate who expressed interest, the party will again convene the executive committee to make a decision. The matter was further complicated after Mark Anthony Sammut stepped down as president of the executive committee.\nContacted by Times of Malta, Dr Cutajar on Wednesday declined to comment when asked if there had been any developments following a letter he sent to Dr Delia last Monday enquiring about the way ahead.\nQuestions sent to the PN were not answered by the time of writing.", "comment_count": 30, "id": 859}, {"keywords": "", "author": "", "article_body": "Trees in a small Attard garden are to be uprooted to make way for more parking spaces, the Planning Authority has confirmed. \nResidents in Triq il-Katlan first contacted the Times of Malta when a sign promising a “project financed by the PA through the development planning fund” first popped up on a fence outside the garden. \nOne resident, who requested to remain anonymous, said no information was forthcoming when inquiries were made at the local council about the project. \nNo PA number was spotted on the site. \nA spokesman for the Planning Authority told the Times of Malta that a development notification order had been approved for the embellishment and revised parking provisions for the “junction”, including the introduction of 21 official parking bays to replace existing “informal parking”. \nThe spokesman said paving and proper pedestrian access would also be introduced. \nAll existing trees would be replanted on the same site together with 10 additional Olea Europea plants, the spokesman said. \nClearances had been issued from all relevant authorities, the spokesman assured. \n'Trees will just be re-positioned'\nIn a reply, the Attard local council insisted that it was \"totally misleading\" to say trees would be uprooted.\n\"All trees in the area will just be re-positioned,\" the local council said. \nThe local council emphasised its green credentials, saying it was \"very proactive when it comes to greenery\" and had been awarded funds for an urban greening project. \nRead: Original plans for Rabat road axed following outcry over tree removal\nThe government’s assault on trees has been subject to heavy criticism in recent years. Environment Minister José Herrera said last July the uprooting of trees to make way for new roads was necessary to prevent the country coming to a complete standstill. \nDr Herrera has pointed to new urban greening projects as counteracting the loss of trees. The Attard Residents Environmental Network last year petitioned the Prime Minister to reconsider the central link project, a major reconstruction of the arterial road from the foot of Saqqajja Hill down to Mrieħel which, they said, would destroy arable land and affect 47 farmers.", "comment_count": 39, "id": 860}, {"keywords": "", "author": "", "article_body": "Although a man suspected of staging his own hold-up in Msida 17 years ago was not given access to a lawyer during interrogation, his case was dealt with fairly, the European Court of Human Rights has ruled.\nIn February 2002, Antsat director Carmel Farrugia, 55, of Marsascala, and an employee, Anthony Farrugia, 44, of Luqa, had been charged with fabrication of false evidence, simulation of offence, fraud relating to insurance and making a false statement under oath. \nThe incident occurred the month before.\nThe employee had been conditionally discharged for three years in June 2003 after being found guilty of filing a false police report. The judgment was confirmed by the Court of Criminal Appeal the following April.\nThe director was acquitted of all charges in January 2007 due to reasonable doubts. The Attorney General appealed that judgment.\nThe Court of Appeal found there had not been any evidence concerning the charges of fraud relating to insurance, making a false oath and fabrication of false evidence. However, Mr Farrugia was found guilty of simulation of an offence and was sentenced to a year in prison, suspended for four years.\nMr Farrugia eventually filed a constitutional application claiming violation of the European Human Rights Convention on grounds that the Court of Appeal’s judgment was based on statements he had given to the police without the assistance of a lawyer. \nHowever, his complaint was rejected.\nAmong other things, the Constitutional Court noted that the Court of Appeal had not relied only on Mr Farrugia’s statement to the police but also on other means of corroboration. Thus, it felt that the statement was not a determining factor when finding guilt.\nMr Farrugia then decided to take his case to the European Court of Human Rights in Strasbourg, which noted that what Mr Farrugia had told the police did not amount to confessions, nor were his statements self-incriminating.\nThe court, which included Chief Justice Emeritus Vincent De Gaetano, pointed out that the privilege against self-incrimination was not confined to actual confessions or incriminating remarks. \nStatements would be regarded as self-incriminating if they substantially affected a suspect’s position, the European judges said, noting that the Court of Appeal’s reference to Mr Farrugia’s statements in assessing his credibility could not be considered as having substantially affected his position.\nUnderscoring the need to apply very strict scrutiny when there were no compelling reasons to justify the restriction on the right of access to a lawyer, the Strasbourg-based Court found that, in this case, “the overall fairness of the criminal proceedings was not irretrievably prejudiced by the restriction on access to a lawyer”.\nIt, therefore, concluded that Mr Farrugia’s right to a lawyer during police questioning was not violated.\nThe court, however, was not unanimous in its decision and two of the seven judges hearing the case entered a dissenting opinion. \nThe Cypriot and Portuguese judges deemed the case “truly Kafkaesque”. A man who had been acquitted found “himself convicted on the basis of shaky testimony from one single prosecution witness and the appellate judges’ doubts regarding the credibility of the defendant’s replies to police questions concerning facts unrelated to the imputed offence”. ", "comment_count": 0, "id": 861}, {"keywords": "", "author": "", "article_body": "A Gozo Channel ferry bow door, known as a visor, got stuck closed late on Wednesday afternoon, briefly stranding passengers with cars on board since the ramp could not be deployed.\nGozo Channel chairman Joe Cordina confirmed a fault had developed on the MV Malita's visor as it entered Mġarr Harbour at around 7.30pm.\nPassengers told Times of Malta the vessel turned around to use the rear ramp, but that this initially did not work either. One of the ramps was eventually deployed after some 20 minutes.\nMr Cordina said the captain turned the vessel around and used the other ramp, allowing passengers to drive off. \nThe MV Gaudos was then deployed instead of the Malita.   \nLast year, passengers were stuck on the ferry after a ramp fell into the water at Mġarr. The incident had left hundreds of people stranded on board. \nThe incident happened on Good Friday, during one of the busiest weekends of the year and had resulted in long queues at Ċirkewwa for most of the day.", "comment_count": 6, "id": 862}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A private company owned by the Prime Minister’s chief of staff, Keith Schembri, has made use of billboards erected by the Labour Party exclusively for the recent electoral campaign.\nRegulations issued by the government last year allowed political parties to put up special billboards on main arterial roads without applying for a Planning Authority permit.\nThe rules specify that such billboards could only be used by political parties three months before a general election, European and local elections or in the case of a referendum.\nThe rules also specify that the same billboards are to be dismantled a week after the publication of the official results and makes it clear that only political adverts can be displayed on these billboards.\nHowever, it seemed Kasco Ltd made use of at least one such billboard both before and after the electoral campaign to advertise its products. This billboard stood at the entrance to Lija.\nThe political billboard in Lija displayed a pasta advert in April but was used by the Labour Party as soon as Prime Minister Joseph Muscat kicked off the European Parliament elections campaign.\nThe Times of Malta was also told that the Labour Party billboards were not removed after the elections and commercial adverts could be seen on them. \nSo far, the Planning Authority is not known to have taken any action to have such political billboards removed.\nNationalist Party billboards have not yet been removed either and still display the same political messages used during last month’s electoral campaign.\nApart from being the Prime Minister’s right-hand man, Mr Schembri is also considered to be a key coordinator in Labour’s electoral campaigns.\nMr Schembri retained his shareholding of Kasco Ltd, which owns various businesses, ranging from the importation of paper, food and ironmongery products, apart from offering commercial services. \nThe company also owns coffee shops and an interior design studio, among other businesses.\nThe Panama Papers had revealed that, after taking public office, Mr Schembri had opened a secret company in Panama and a trust in New Zealand.\nDespite calls for his resignation from various quarters, Dr Muscat kept Mr Schembri in office and he had full confidence in his top aide.\nivan.camilleri@timesofmalta.com\nThe same billboard in Lija was used by both the Labour Party and Kasco Ltd, owned by Keith Schembri.", "comment_count": 20, "id": 863}, {"keywords": "", "author": "Denise Grech ", "article_body": "Properties in Wied Għomor and Villa Frere should be expropriated and kept for public use, the shadow minister for the environment, Jason Azzopardi said on Wednesday.\nSpeaking in Parliament during a debate on the estimates of the Environmental Resources Authority, Dr Azzopardi said the government should use its surplus \"for the common good\".\nWied Għomor, a scheduled site of ecological and scientific importance between Swieqi and San Ġwann, has been threatened by a number of development applications in recent years.\nGiardino Zamitello, adjacent to Villa Frere, was also threatened by a planning application to transform the area into a giant hotel earlier this year.\nDr Azzopardi also referred to an article in The Shift News that reported a developer had written to the Lands Authority to inform it that it was delaying plans to develop Villa Frere gardens.\nThe Prime Minister had \"promised his full cooperation\" to the developer, according to the leaked documents, the report said. The developer went on to deny any untoward cooperation.\nDr Azzopardi said \"heads should have rolled\" over the revelation, however, the country had become numb and deaf to allegations of wrongdoing.\nThe government should have used its surplus to expropriate the land for the common good, he said.\nIs the government brave enough to do this and was there political will to do this, he asked.\nThe PN MP also proposed a public fund to help civil society and local councils appeal development permits.\nResponding to the criticism during a later intervention, Environment Minister Jose Herrera said the idea to expropriate further land was not bad and was something the government should look into bringing forward.\nThe government had to take the properties' owners, squatters in the areas and those who \"believed to have ownership over the land\" into consideration, he said.\nHowever, he added, the government was taking areas previously earmarked for development and using them for afforestation projects. A site in Bengħajsa will see 8,000 trees planted in an area that will be the country’s biggest afforestation project to date, he added.\nDr Herrera also refuted criticism that the Environment and Resources Authority was toothless, saying that where it was possible, the ERA did criticise decisions.\nThe ERA was also working on increasing monitoring of emissions and would be given support to increase enforcement, he said.\nThe country had seen the largest environmental reform in recent years, he said, adding that it was critical that a small country had an environmental strategy.\nHe also encouraged the Nationalist party to provide proposals, rather than criticise.", "comment_count": 2, "id": 864}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Nationalist parliamentary group has not met in almost two months and no date has been set yet to debate the ongoing crisis triggered by the latest disastrous electoral results, this newspaper was told.\nThe situation was further compounded by the controversy which erupted over the co-option of an MP to succeed David Stellini, who resigned last week.\nSources said the Nationalist MPs last met on April 15, a few weeks before the official start of the electoral campaign.\nContacted by the Times of Malta, PN whip Robert Cutajar declined to comment.\nAccording to the PN statute, the parliamentary group must meet at least once a month or upon the request of the party leader. \nHowever, there is also a proviso under which it must convene if a formal request is made by at least a third of MPs.\nDespite having been at the helm since September 2017, Adrian Delia is yet to win over a significant chunk of his own parliamentary group who have privately expressed doubts about Dr Delia both way back during the leadership campaign and, then, when he faced allegations on his personal finances and of having been involved in money-laundering activities more than a decade before his venture into politics. \nHe has strenuously denied any wrongdoing.\nHe unwittingly revealed his strategy to get rid of a number of MPs\nDr Delia himself, and those who stand firmly behind him, have long been accusing the ‘establishment’ of putting spokes in the wheels and of not accepting the democratic will of the absolute majority of paid members who had elected him.\nThe sentiment was starkly exposed in comments Dr Delia made this week during #TimesTalk when he expressed his frustration that not all MPs were toeing the same line. Moreover, he complained it was very difficult to work with a team he already found there.\nMembers of the parliamentary group who spoke with the Times of Malta on condition of anonymity questioned the rationale of such a comment at this point in time. “He unwittingly revealed his strategy to get rid of a number of MPs. No leader ever speaks in a way to show a divide,” one MP commented.\nOthers pointed out it was “madness” for a leader to declare war against a section of his own MPs when he had not yet won an internal battle.\nThough the leadership cannot claim any glory in its first electoral test, which saw the party lose both the European and council elections with huge margins, the internal unrest was also fuelled by the decision made last Saturday by the executive committee to co-opt Jean Pierre Debono to fill Mr Stellini’s seat. \nAmid mounting controversy and internal dissent, Mr Debono announced he was renouncing the parliamentary seat. ", "comment_count": 13, "id": 865}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A magistrate on Wednesday was asked to ensure that psychiatric care was afforded to a man accused of murdering his mother and sister in Ghaxaq in March.\nThe request was made at the compilation of evidence continued against Joseph Bonnici, who has pleaded not guilty to having shot and battered Marie-Lourdes Bonnici, 70, and her daughter Angele, 29, in the family home.\nNardu Callus, a Kirkop resident and uncle of the accused, said Bonnici was a “good man” who only spoke when addressed.  \nA maternal aunt of the accused, Frances Ciantar, testified about a visit she had received from her nephew who had knocked at her door, accompanied by the police.\nThe woman had provided the key to vacant premises co-owned by all siblings, including Lourdes, her late sister, and had accompanied the party during a search of the house in Luqa.\nA number of Wasteserv officials posted at the Hal Far Civic Amenity Site testified about the discovery of the mallet allegedly used by the accused and later disposed of in one of the containers for metallic waste.\nThe discovery was made on April 1 with Domenico Savio Barbara, an operations manager, explaining that the container yielding the suspect weapon, had contained waste tipped by the public since March 12.\nPS Antoine Fenech, from the Forensic Science Lab, described how he had filmed the autopsy of the two victims and also recorded audio-visual footage of the Ghaxaq residence, with the accused himself providing the commentary as he retraced the steps of that fateful night.\nThe accused had also led investigators to the field where the bodies were buried and had indicated the spot where the firearm allegedly used in the murder had been buried.\nAs the hearing drew to an end, the court Magistrate Joseph Mifsud, was informed by the defence that ever since his transfer from Mount Carmel to Corradino Correctional Facility, Mr Bonnici had not been monitored by a psychiatrist.\nThe court issued a recommendation to the Director General of Prisons so that the accused be afforded all necessary care and treatment by the facility’s medical team.\nThe court also notified the Attorney General of the outcome of today’s sitting in view of objections made by the AG to a request by the accused’s girlfriend to get back the keys to the Ghaxaq residence that had been her home for the past 10 years.\nProsecuting Inspector Roderick Attard informed the court that all evidence to be retrieved from the residence had been preserved in the inquiry, thereby paving the way for the AG to reconsider its objections to the return of the keys.\nThe case continues later this month.\nLawyers Franco Debono, Marion Camilleri and Damien Cassar were defence counsel.", "comment_count": 0, "id": 866}, {"keywords": "", "author": "Ivan Martin", "article_body": "Patients at the State mental health hospital had been made to endure freezing cold showers in the height of winter because there was no hot water for months on end, according to a former senior official.\nPaul Dalli, the former Chief Operations Officer at Mount Carmel Hospital on Wednesday told a Parliamentary committee that during his tenure he could not take the poor conditions patients were made to suffer through.\n\"You do not know what it was like. I'm going to be blunt - I just could not take it any longer,\" he said. \nWatch: ‘Dangerous ceilings’ in most Mount Carmel Hospital wards\nPatients at the mental hospital, he said, would have to shower in the nude near each other with no privacy. Floor tiles in the bathrooms were cracked and dangerous. The hospital, he lamented, had been left to rot into a state of disrepair. \n\nDue to longstanding problems with water boilers, the winter months would see freezing cold showers in around eight of the hsopital's wards, and medical staff had even warned him that certain medication would not work if patients’ body temperatures dropped too low.\nMr Dalli gave a raw account of the state of the beleaguered hospital as members of the Public Accounts Committee grilled him over a National Audit Office report which had flagged suspicious employment during his tenure.\nMr Dalli told the committee that when he took over the COO position, the hospital had already signed a contact with an employment agency.\nWatch: ‘Dangerous ceilings’ in most Mount Carmel Hospital wards\nHis hands, he said, were tied and so he had decided to circumvent standard procedure, and use the contract, meant to employ clerks, to engage a slew of handymen and maintenance staff to fix the hospital’s “disastrous state”.\nAlthough this was an irregular way of employing people, Mr Dalli said the alternative was ignoring the “dire” conditions patients were living in.\nArchitects had instructed workers to install metal support jacks in some areas of the hospital in Attard.\nAsked why this spike in employment had happened around the 2017 election campaign, Mr Dalli dismissed any notion of foul play, saying recruitment efforts had begun some six months earlier, way before the snap election had been announced.\nRead: Mount Carmel nurses give ultimatum\nMr Dalli said he had taken the responsibility upon his shoulders to use the clerical employment system as a “safety valve” to engage “technical” workers, who would tile floors, fix boilers and wards which often had cracked ceilings and sub-standard safety conditions.\n“You need to understand what it was like in there when I was there. We had a disastrous state. We did not have enough nurses, we did not even have enough security – we had people escaping from the mental hospital,” he said.\nHe said his position in the hospital was “not easy”. When he saw the way patients were being mistreated, he wanted to demolish the whole hospital and rebuild it from scratch.\n“I like to read and write, and I can say that I truly learnt the meaning of the phrase 'piecemeal' when I worked in that hospital,” he said.\nThe NAO report found that in many cases, the ‘clerks’ employed as handymen, were often not competent or qualified to conduct the maintenance work required and in many cases, other professionals would have to be outsourced to finish jobs.\nMr Dalli clarified that he never employed any of these ‘clerks’ in licensed professional roles, but as “ladder holders and helpers”.", "comment_count": 69, "id": 867}, {"keywords": "", "author": "", "article_body": "Updated at 9.05pm \nMore than 370 migrants disembarked in Malta on Wednesday following Armed Forces of Malta rescue missions, in one of the busiest days for migrant arrivals in recent history. \nAFM personnel carried out three rescue missions beginning very early in the morning, as they scrambled to ensure people did not die at sea. \nThe first of the missions happened during the night when the AFM rescued 63 migrants who were in distress aboard a drifting rubber dinghy.\nThe boat was within the Maltese Search and Rescue Zone. The men, women and children on board were transferred to the AFM vessel, to be brought to Malta.\nA short while later, AFM operators received word of a second group of more than 200 people in distress at sea and went to their rescue. \nAFM personnel took 61 of those people in distress, placed them aboard the first rescue vessel and brought them to Malta. \nThe rest of the rescued people, 147 of them, were picked up later in the morning and reached Malta at around 10.30am. \nRead: Lawyers accuse EU of 'crimes against humanity' in submission to ICC\nA third vessel needed assistance inside Malta's SAR zone on Wednesday. Photo: Alarm Phone\nMore rescues coordinated\nAn AFM spokesperson later said that a further 99 people had been rescued at sea and were being brought to Malta. They disembarked in the afternoon. \nConfirmation of that mission - the third in 12 hours -  came a few hours after a sea alert NGO warned that 75 people were stranded inside Malta's Search and Rescue zone. \nThe AFM spokesperson could not confirm that the 99 rescued by the AFM were one and the same as the 75 reported stranded by NGO Alarm Phone. \nSources told Times of Malta that AFM rescue forces were rushed off their feet, with \"several\" vessels in Malta's SAR zone. \n\n\n\nBusy day for arrivals\nWith 370 men, women and children rescued, Wednesday was among the busiest days for AFM sea rescue personnel in recent history. \nWednesday's cohort of 370 people rescued at sea is the largest to have entered Malta since at least January 2018, and more than were brought to Malta while crossing the Mediterranean by boat in 2015, 2016 and 2017 combined, according to data published by UN refugee agency UNHCR. \nThe most recent large-scale disembarkation of rescued migrants dates back to the turn of the year: late in December, the AFM rescued 249 people in two rescue missions.\nA UNHCR spokesperson commended the AFM and Maltese government for having rescued the stranded people.\n\"We would like to reiterate that Libya remains an unsafe place for returns,\" they said. \nIn the evening, the NGO Sea-Watch said that up to 80 people were stuck in 'Maltese waters' in an \"unseaworthy rubber boat.\n\"We urge Armed Forces of Malta to uphold its responsibility, and to not coordinate an illegal refoulement but instead see the rescue through to its legally required end: a port of safety in Malta,\" the NGO wrote.\nA spokeswoman for the Armed Forces of Malta said the AFM was constantly monitoring the area but not coordinating any operation. ", "comment_count": 0, "id": 868}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "The current potential Nationalist Party split is the most serious crisis within the party since some of its staunchest supporters walked away and formed the Partit Demokratiku Nazzjonalista just over 60 years ago.\nGeorge Borg Olivier was at the helm of the party at the time, facing numerous foes within while trying to battle fiery Labour leader Dom Mintoff and the British colonial administration.\nHerbert Ganado.\nLawyer and writer Herbert Ganado, a long-serving member of the PN, who was exiled during the war for his pro-Italian sympathies while editing the Catholic Action newspaper Leħen is-Sewwa, argued that Borg Olivier was too soft on Mintoff and was not strong enough to stand up to him.\nHe disagreed with Borg Olivier about the party's set-up and social welfare policies, and he especially disagreed with the central plank of Borg Olivier’s policies - independence from Britain -- insisting that Malta was not yet ready for it.\nGanado finally broke ranks in 1958 and formed his own party, the PDN, which did not, however, take any of the PN’s MPs. The new party won 9.3% of the votes in the 1962 elections and elected four MPs (one of whom, the late Coronato Attard of Gozo, shortly afterwards switched to the Nationalist Party).\nBut Nationalist supporters generally rallied around their embattled leader. Borg Olivier still won the 1962 general election and crowned his long political career by achieving Independence for Malta in 1964. In the 1966 elections, Ganado's PDN and the other two small centre parties failed to win any seats and were eventually dissolved.\nBorg Olivier and Ganado argued in the newspapers - see pdf link below. \nBorg Olivier went through two other crises in his party, one in his early political career, and another near its end.\nThe first was in 1947 when party leader Nerik Mizzi returned from exile. Veteran MP Prof Guze Hyzler (who had been elected in 1932) wanted a fresh, more liberal PN and eventually went on to form the Democratic Action Party. Borg Olivier was reportedly offered a position within the party, but stayed loyal to Mizzi and eventually succeeded him in 1950. The DAP won four seats in 1947 and just one in the 1950 elections. It was dissolved shortly after.\nThen in 1974, the PN, in Opposition, faced serious policy divisions over Borg Olivier's insistence that a referendum must be held to decide whether Malta should become a republic. No referendum was held, and Borg Olivier and another five Nationalist MPs (out of a total of 26) voted in parliament against the Republican Constitution, which was approved since it had won the votes of more than two-thirds of the House of Representatives. But the party held together, although Borg Olivier was persuaded to resign as party leader a few months after losing the 1976 elections.\nThe only other time since then that the PN faced something of a split, however minor, was when Josie Muscat was the only Nationalist MP who in 1987 voted against amendments to the Constitution to ensure majority rule and also, controversially, Malta's neutrality and non-alignment. He had clashed with the party after holding unauthorised talks with Prime Minister Dom Mintoff to break the constitutional impasse caused when the PN, winning an absolute majority of votes in the 1981 elections, ended up with a minority of seats due to gerrymandering.\nDr Muscat, who had set up a right-wing group, Front Freedom Fighters, then left politics before reappearing briefly as the head of a small party, Azzjoni Nazzjonali, which unsuccessfully contested the 2008 elections. In the last general election Dr Muscat was a PN candidate once more, but failed to be elected\nLabour’s splits – Mintoff ousted the party leader in 1949, then brought down the government in 1998\nBy far the best known political split occurred 70 years ago within the Labour Party, when young minister Dom Mintoff managed to oust veteran leader Paul Boffa.\nThe Labour Party was even more powerful than it is today, having won just under 60% of the vote and 24 seats in the Legislative Assembly in 1947. But Mintoff viewed Boffa as being too soft with the British authorities in disputes over discharges from the dockyard and Britain’s failure to give Malta a share of Marshall Aid. He resigned as works minister and started holding rival political events, bitterly attacking Boffa and going so far as to accuse him of incest.\nPaul Boffa with Mabel Strickland.\nMatters came to a head in October 1949 at the Labour Party's general conference when Mintoff successfully moved a motion of no confidence in Boffa and was elected party leader instead. Five other Labour MPs followed Mintoff.\nBoffa and the other 17 Labour MPs left the party and became known as the Boffa Labour Group (BLG). In the elections held in 1950, the Labour Party and the BLG each obtained 11 seats, but the Nationalist Party, with 12 seats, formed a minority government under Enrico Mizzi, who died in office three months later. This was defeated a few months later, with fresh elections held in 1951.\nBy this time Boffa had set up the Malta Workers Party (MWP), which won seven seats to Labour's 14. The Nationalists, now led by George Borg Olivier, won 15, and formed a coalition government with the MWP.\nThe coalition was restored after another election in 1953 (which saw the PN win 18 seats and MWP three) but only lasted till 1955. In that year's election, the MWP had disappeared and most Boffisti went back to Labour. Mintoff won 23 seats and thus was able to form a government.\nIn the 1970s, Mintoff erected a larger than life-size monument to Boffa at the top of Merchants Street, facing the Auberge de Castille.\nMintoff was to cause another split in the Labour Party in 1998 when he broke ranks with Prime Minister Alfred Sant, on a motion concerning the development of the Cottonera Waterfront, which Mintoff opposed but which Sant declared to be a vote of confidence. Denying the Labour government its one-seat parliamentary majority, Mintoff forced Sant to hold elections just 22 months into its five-year term, which Labour lost.\nMabel Strickland, Toni Pellegrini and Dom Mintoff (right).\nBut Mintoff himself had suffered a split within his party while he was in opposition in the 1960s and on the warpath against the Church. His tactics were too much for a section of the party. Led by Toni Pellegrini, Labour’s erstwhile general secretary, they formed the Christian Workers’ Party in 1961.\nPellegrini, like Ganado, won four seats in the 1962 general election but the party only lasted till 1966, with most of its members eventually returning to Labour, including Pellegrini himself.\nSplit of the once strong Constitutional Party\nThe Constitutional Party under Sir (later Lord) Gerald Strickland was one of the major political forces before the war and led a government in a compact with Boffa’s Labour Party from 1927 to 1930. Its strength peaked in 1939, when it won six of the ten seats on the Council of Government, but waned in the war years, especially after Lord Strickland died in 1940. The party, now led by Strickland's nephew, Roger Strickland, was dissolved in 1946, only to be reconstituted in 1950, when it won four seats, as it did in 1951.\nHowever in 1952 Lord Strickland's daughter Mabel declared herself an independent in protest against the party's stand against the PN/MWP coalition and its alignment with Mintoff.\nIn 1953 the Constitutional Party successfully unseated Mabel Strickland on the grounds that her company had been given a government contract, and she went on to found the Progressive Constitutional Party, which fought that year's elections, which were also contested by the rump Constitutional Party.\nNeither PCP nor CP won any seats. PCP went on to contest the 1955 election, also unsuccessfully, but Mabel Strickland was elected in 1962. The party unsuccessfully fought the 1966 and 1971 elections, after which it was dissolved.\n ", "comment_count": 30, "id": 869}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 2.39pm\nThe European Commission has urged Malta to address aggressive tax planning systems, consider raising its retirement age and focus on fixing road congestion problems. \nIn a country-specific report issued on Wednesday, the Commission listed recommendations which also included calls to strengthen judicial independence and to create a separate prosecution service. \n'Aggressive' tax planning\nMalta was advised to address \"features of the tax system that may facilitate aggressive tax planning by individuals and multinationals, in particular by means of outbound payments\", in a country specific report issued on Wednesday by the European Commission.\nAnti-money laundering\nThe report also recommended that the country should continue the ongoing progress made on strengthening the anti-money laundering framework, notably regarding enforcement. \nA delegation from the European Commission was here last March and had already said that Malta had not made any significant progress in the fight against corruption.\nRead: European Commission's appraisal of Malta: not entirely ‘outstanding’\nRoad congestion concerns\nMalta needed to invest in the untapped potential for energy efficiency and renewables, water-management cycle and waste management, the report said.\nIt also needed to tackle the growing emissions from air conditioning and car use.\n\"Road congestion is one of the weakest aspects of Malta’s business environment and remains a major challenge,\" it said.\nMalta’s fiscal energy consumption is constantly on the rise, the report warned, adding investments across sectors are needed in the short-term to meet 2020 targets.\nThe environmental and social costs of the housing boom require closer monitoring, the report said. The economic and social consequences of the increase in the cost of housing require attention.\nReliance on foreign workers \nIt also noted policy initiatives in the labour market, particularly in the areas of skills and social inclusion, require better monitoring and evaluation.\nThe increasing reliance on foreign labour to address the labour and skills shortages creates social and sustainability challenges, it said. It also called for emphasis on addressing gender employment gaps.\nMalta invests relatively high amounts in education and training but this is not yet reflected in better outcomes for all, it warned.\nGovernance warnings\nMalta’s increasing reliance on sectors “considered vulnerable to financial integrity risks”, such as remote gaming, creates challenges to the governance framework. This places pressure on the supervisory and enforcement capacity, the report noted.\nWhile it praised the increase in the human and budgetary resources of the Financial Intelligence Analysis Unit, it said governance shortcomings, particularly in the fight against corruption, may adversely affect the business environment.\nGovernance shortcomings could also weigh negatively on investment, the report warned.\n“In particular, there is a risk of conflict of interest at various levels of government,” it added.\n“Improving the governance framework and ensuring an effective implementation is a key element to preserve Malta’s attractiveness and protect the economy from reputational risks,” it said.\nThe report called for a strengthened governance framework, including effective judicial and anti-corruption enforcement. These were prerequisite to obtaining the full benefits of investment, it said.\nPension and healthcare spending\nAge-related pubic spending in the pension and healthcare systems is expected to increase significantly, compared to other Member States. This indicates a risk of rising debt over the long-term, the report noted.\nOngoing efforts have helped to increase the supply of labour and prolong working lives, with a positive impact on employment rates for women and older workers.\nThe report noted that the statutory retirement age is set to remain unchanged after 2027 (at 65 years), despite a projected further growth in life expectancy.\nThe country-specific recommendations noted plans to expand the capacity of public hospital outpatient care. While it said this could help in tackling long waiting times for certain specialties, it noted measures to reduce unnecessary referrals to specialists and redirect inappropriate use of emergency care to outpatients have so far not been fully used.\nThis, the report said, prevented improvements in the efficiency of the system. Other measures, such as community-based and home care services introduced in 2017 and 2018, have not had any impact, the report said.\nFinal recommendations\nAn increased appetite for establishing and expanding specialised insurance vehicles, paired with a rising complexity of insurance business models, called for more stringent supervision, it added.\nThe report also recommended the country ensures the fiscal sustainability of healthcare and pension systems, including by restricting early retirement. \nIt also suggested that Malta should adjust the statutory retirement age in view of expected gains in life expectancy.\nThe semester report also called for investment-related economic policy on research and innovation. ", "comment_count": 27, "id": 870}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Inmates at Corradino Correctional Facility called alleged drug kingpin Jordan Azzopardi prior to his arrest, a court was told on Wednesday.\nProsecuting Inspector Mark Anthony Mercieca presented the court with an official copy of phone logs of calls made by inmates to Mr Azzopardi, explaining that the data had been verified with prison authorities. \nAnswering questions by defence lawyer Arthur Azzopardi, Inspector Mercieca said that call recordings from prison were never cancelled and had “no expiry date” so long as they were done through prison phone booths.\nMr Azzopardi stands accused of having run a large-scale drug operation.\nVilla rented for €3,500 monthly\nDuring Wednesday’s hearing, Mark Ciantar, a sales representative for the letting company which had leased out the Ta’ Liberat farmhouse to the accused, testified that he had showed the property to Mr Azzopardi but had not been involved in the lease agreement.\nThe villa had been rented for a monthly payment of €3,500 which always reached the company office in cash.\nThe witness could not tell who actually paid but said that he had met Mr Azzopardi when there was an issue over late payments of the rent.\nMetal tanks and traces of heroin\nA sergeant from the Drug Squad, Johann Micallef, recalled his involvement in four drug raids targeting properties in Birkirkara, Gżira, Marsa and Pieta’. In all these cases, they found similar circumstances, with metal doors, stone barricades and acid tanks with traces of suspected heroin around the container openings.\nAll premises were monitored using CCTV cameras, the officer explained.\nRecalling the day of Mr Azzopardi’s arrest and the search at the St Paul’s Bay farmhouse the following day, the officer said that various bullets of different gauges had been discovered during the search, together with five Apple laptops and three Iphones, all brand new and sealed, tucked away in one of the bedrooms.\nAmmonia bottles and other drug paraphernalia had also been discovered in the search.\nBail request\nAt the end of the sitting, the court, presided over by magistrate Doreen Clarke, heard submissions on bail in respect of Mr Azzopardi, with defence lawyer Alfred Abela questioning the validity of the man’s continued arrest at this stage, given that civilian witnesses had testified or had their testimony preserved in the records of the inquiry.\nThere was no real fear of absconding nor tampering with evidence, said Dr Abela, insisting that both local and EU jurisprudence made arrest the exception and not the norm.\nHowever, inspector Mercieca rebutted that there were other civilians to testify and the gravity of the crime was very real, adding that the prosecution needed more time to proceed.\nThe court declared that it would decide upon the issue of bail in chambers.\nThe case was adjourned to next week.", "comment_count": 0, "id": 871}, {"keywords": "", "author": "", "article_body": "The first four-lane flyover in Marsa will be open to vehicles by the end of summer, Transport Minister Ian Borg said on Wednesday.\nAddressing a press conference, Dr Borg said the flyover would connect Triq Aldo Moro to Triq Garibaldi.\nThe €70 million project will be finalised by end of 2020.\nCurrently, pre-cast pre-stressed beams are being placed on the large structures erected in the area which once housed a number of factories.\nThis will be the first of seven mammoth road structures that make up the project.\nThe flyovers and over 12 kilometres of new or reconstructed lanes, grade-separated at three different levels, will create direct northbound and southbound connections between Triq Aldo Moro, Vjal Sir Paul Boffa, Vjal Santa Lucija, Triq Giuseppe Garibaldi and Triq il-Marsa.\nThe project will see the end of traffic light waiting times and related congestion emissions, for over 100,000 road users who travel through this junction every day.\nThe new multi-level intersection includes the highest, the longest and the widest flyover structures ever built in Malta.\nThe tallest section will rise over four storeys to surpass a lower flyover beneath it, and the two longest ones, extending over 400 metres, will connect Triq Garibaldi and Vjal Santa Lucija to Triq Aldo Moro.\nThe widest of the seven structures will include four vehicle lanes, forking into two different flyovers, each with two lanes.", "comment_count": 11, "id": 872}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 4.10pm with KSU reaction \nLaw students sitting for their final-year examinations on Wednesday morning were ushered out of the exam room after it emerged that the paper handed out was wrong. \nSources who spoke to the Times of Malta described how, after about 15 minutes, University of Malta law students in their final year were suddenly asked to stop writing and hand over the paper.\nIt soon emerged that the paper contained questions about topics from other units which were not meant to be in the exam.\nThe students were then ushered out of the lecture hall, which was serving as an exam room, and told they would be informed at a later stage when the exam would be held.\n\"Obviously everyone started shouting 'this isn't our paper\",\" one student sitting for the exam said.\nAs confusion spread, faculty officials and the registrar were both called in. After confirming that the students' concerns were valid, the rector gave orders for the exam to be postponed.\nStudents have now been told the exam will be held at 5pm on Wednesday. \nSome students opted to wait at the university campus and revise some more, while others headed home and would return later, the student said.\nThe exam is crucial for final year students, as it consists of units considered to be the most important of the entire law course.\nUniversity apology, law students' demands\nA University spokesperson apologised to students for the error. \n\"The University is currently looking into the matter with the Board of Examiners,\" they said. \nThe students' union KSU called the situation \"unacceptable\" and said students should be \"compensated\" for the error. \nIn a statement endorsed by Malta Law Students' Society (GħSL), the European Law Students' Association and the Junior Chamber of Advocates, it also demanded that the University review its processes and consider setting up internal procedures detailing what should happen if the situation were to repeat itself. \nThe KSU urged any students with further complaints to get in touch at education@ksu.org.mt. \nEarlier, GħSL issued its own statement in which it said students affected by the \"grave injustice\" should be guaranteed a set of marks. \n\"Undue stress has been placed on these students,\" the society said. \nGħSL said it had contacted the Faculty of Laws about the matter and was waiting for a reply.", "comment_count": 49, "id": 873}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A couple of weeks before being arrested for allegedly breaching a driving ban, Liam Debono was involved in a near-collision while drifting in a BMW along a Żejtun street, a police officer told court on Wednesday. \nThis fresh snippet of information was revealed in the compilation of evidence against the young man involved in last year’s hit-and-run incident, which caused police constable Simon Schembri to lose an arm.\nAn off-duty police officer who had been driving his personal car testified that on the evening of May 6 he had spotted a white BMW drifting along a Żejtun street.  The young driver was clearly recognisable as Liam Debono.\nThe policeman recalled how he had to swerve to avoid being hit by the BMW that drove on. He had immediately informed the control room but had not given chase.\nThis incident had taken place in Triq Toni Zahra, Żejtun, the policeman said adding that he had identified the driver as Liam Debono.\n“I knew him. I had seen him on TV and I had also served as his escort when Liam was taken to court,” the officer replied when asked by defence counsel Victor Bugeja how he could be so sure.\n“Besides I was only a couple of metres away.”\n'Liam Debono never drove the cars'\nThe registered owner of that BMW, Kirsty Zammit, also testified after being duly cautioned by the court, confirming she also owned a Toyota Corsa that had been involved in a crash while driven by her father, Jason.\nThe young lady insisted that she drove both cars, and that she held all keys to the vehicles even when these were garaged.\n“How can you be so sure? What about spare keys?” Magistrate Joseph Mifsud asked.\nYet the witness insisted upon her version even when the Court warned her of the gravity of her declaration, explaining that he could keep her in custody until she told the truth or take provision when delivering judgment should it result that she was not saying the truth.\nRead: Liam Debono had been given drugs by his mother since he was nine\nThe young lady insisted that as far as she knew no spare keys had been cut and that “Liam Debono never drove the cars.”\nHer father Jason Zammit was next to testify, explaining how on the day of the arrest, May 24, he had driven his Fiat from Tarxien until being stopped by police at Luqa.\nFrom Tarxien until the moment of arrest, were there any stops? Inspector Fleri asked. “I don’t think so.” “\n“Who was driving?” the magistrate asked. “I choose not to answer that so as not to incriminate myself,” the witness replied, explaining that he occasionally drove Kirsty’s cars, in the presence of Liam Debono.\n“I had the keys,” Mr Zammit said, adding that Liam would sometimes drive on private property while washing and garaging the cars.\nThe accused’s father, Anton Debono, when summoned chose not to testify in view of his family tie with the accused. He then took his seat behind the dock.\nProbation officer followed Debono\nEarlier on in the sitting, a female probation officer explained how she used to follow Liam Debono when he was placed under probation last July. She was to report to court every six months.\nMagistrate Mifsud asked her directly why no report was filed in the records, the officer replying that indeed she had filed a note on January 8 at the One Stop Shop in court. “From then on I know nothing else.”\nThe officer explained that the office was having trouble with lost documents and in fact was adopting a new procedure.\nThere was a time when probation officers were under union directive and therefore she did not follow Mr Debono for a while, the witness continued.\nUrine samples from Mr Debono prior to January gave “clean” results, but another sample on April 15 had tested positive for cannabis.\nThe director of the Criminal Courts next confirmed under oath that her searches had showed that no note concerning Mr Debono had been filed in January. The court said that it would decide upon the matter in due course.\n'Don't destroy him'\nBrian Abela, the registered owner of the vehicle Mr Debono had been driving when arrested, said under oath and after being cautioned, that the Fiat Uno was still registered in his name although he had sold it to Jason Zammit. The transfer had not been registered yet, he informed the court.\n“Ha ngħidlek, tkissruhx” ['let me tell you, don't destroy him'] Jason Zammit had allegedly told police on the scene of the arrest, referring to his young companion. A police officer testified that Mr Zammit had said he was keeping Mr Debono with his company and that the youth had only driven a short distance.\nThe insurance policy document read that the Fiat was insured in favour of Brian Abela covering “any driver over 36.”\nAt the end of Wednesday’s hearing, the prosecution declared that it had no further evidence to produce. The defence lawyer, after consulting briefly his client, likewise said that he had nothing to add by way of evidence.\nThe case was adjourned to June 21 for judgment.\nInspectors Pierguido Saliba and Fabian Fleri prosecuted.", "comment_count": 0, "id": 874}, {"keywords": "", "author": "", "article_body": "A mystery lottery player who won a massive €820,000 prize is running out of time to claim their bumper prize, Maltco said on Wednesday. The Quaterno+ jackpot was won last month by a ticket bought at a point of sale in Qawra and which matched five out of the eight numbers drawn, 71 – 23 – 75 – 6 – 27 -56 – 81 – 8. More than two weeks after the prize draw, however, nobody has presented themselves to claim the €820,000 prize. They now have until July 17 to show up at Maltco head offices in Iklin and do so. \nIf they do not, the six-figure prize will be transferred to the Good Causes Fund, which is used to help NGOs and individuals with social, cultural, educational, sport, philanthropic or religious activities. The fund is run by the National Lotteries and Good Causes Fund Committee.\nCorrection 11.55am: The deadline for the winning ticket is July 17, not June.", "comment_count": 16, "id": 875}, {"keywords": "", "author": "", "article_body": "Government entities responsible for roadworks were ignoring local councils and riding roughshod over residents, Swieqi mayor Noel Muscat lamented on Tuesday. \n“It’s one thing to take roadwork responsibilities away from councils, but why are the authorities taking away respect too?” he asked. \nMr Muscat contacted the Times of Malta after road markings had been changed without residents or the council being made aware. \nLarge concrete barriers were placed along one of the locality’s main roads, and traffic flows were being changed without “the decency of letting us know first”.  \n“We face a situation where residents are coming to us to ask why the road network has been changed, and we don’t know what to tell them,” he said.  \nMr Muscat said he had contacted both Infrastructure Malta and Transport Malta after roadworks had started but had not heard back despite his repeated complaints and queries. \nLocal councils, he said, had a role to play in coordinating the government’s overhaul of the country’s road network, and life in their locality. \nResidents are coming to us to ask why the road network has been changed, and we don’t know what to tell them\nThe ambitious €700 million, seven-year plan to resurface all of the island’s roads was one of Labour’s grandest electoral pledges, and work has been rolling on since late 2017.  \nThe authorities have prioritised residential roads that have never been freshly asphalted and others that sorely needed seeing to.  \nHowever, the government’s policy of steamrolling over regulations and concerns raised by motorists and residents has raised a few eyebrows. \nMr Muscat said he was more than willing to cooperate with the authorities as well as with architects and contractors involved in roadworks to ensure smooth sailing for all involved. \n“We just want to be kept abreast of what is going on to be able to direct residents and inform them. Is that too much to ask?” he asked.  \nMr Muscat said he had even gone to the Planning Authority to ask to be notified if any permits for roadworks were issued, but had so far not been updated.", "comment_count": 23, "id": 876}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government’s claim that only 3.5 per cent of Maltese teachers are being assigned more lessons than laid down in the collective agreement is an attempt by the education authorities to “minimise the issue”, Malta Union of Teachers head Marco Bonnici believes. \n“There is much more at stake than the number of educators mentioned and the way the ministry is trying to minimise the issue and making it seem like an anomaly is unfortunately regrettable,” Mr Bonnici told the Times of Malta yesterday. \nThe union president made the comments after Education Minister Evarist Bartolo, during a press conference, appealed to the teachers’ union to drop its directives. \nThe MUT has ordered teachers and heads of department of maths and Maltese to refrain from providing or correcting exam papers, saying members were over-worked, often assigned 25 lessons per week or more.  \nAlthough, according to the minister, there were only 3.5 per cent Maltese teachers who were assigned the maximum case load, the union chief insisted the problem was even more widespread than the government made it out to be.  \n“If the situation continues with the current predicament, the MUT can anticipate more teacher shortages even in other core subjects. Issues with English teachers are similar as are shortages of primary school teachers,” Mr Bonnici went on. The MUT can anticipate more teacher shortages even in other core subjects\nDuring the press conference, a “worried” Mr Bartolo said he hoped the two sides would come to an agreement for the sake of “the common good”.  \n“My appeal, for the common good, is for the MUT to reconsider its position because the number of teachers with such a load is a bit disproportionate,” Mr Bartolo said. \nAsked by the Times of Malta whether the government had a back-up plan in case the union did not change its position and in light of the fact that the exam period was now only days away, the minister said the focus at the moment would be to “resolve the issue”. \nParents who spoke to the Times of Malta last month said they were not being provided with much information, only finding out about the situation at the last minute when they were helping their children with revision. \nMr Bartolo would not comment on whether the government was considering providing students with exam papers put together by the Education Department, as was the case in February during the half-yearly exams. He admitted, however, that he was not satisfied with what had happened in February and the papers provided to the students then.\nOn this, the union yesterday accused the ministry of trying to circumvent its directives by cobbling together exam papers as it did for the half-yearly exams, when pupils ended up with past papers and questions which were not on their syllabus.\nIt said it had also learned that the ministry was trying to acquire Maltese and maths exam papers from Church schools through the Curia.\nSuch actions were unbecoming of the ministry, more so since the way subjects were taught in Church schools was different from State schools, the union iterated.\nThe Malta Union of Teachers is set to meet the Education Ministry today to further discuss the matter. ", "comment_count": 31, "id": 877}, {"keywords": "", "author": "Jacob Borg", "article_body": "Three ministers have argued they have been singled out for their role in the Vitals Global Healthcare deal when, in fact, the whole Cabinet was responsible for it.\nNGO Repubblika called for an inquiry into the role of Tourism Minister Konrad Mizzi, Economy Minister Chris Cardona and Finance Minister Edward Scicluna in an alleged “criminal conspiracy” to drain money from the public coffers via the deal.\nIn submissions made by their lawyers in response to a court application by Repubblika, the ministers said the process leading to three public hospitals being given under a 30-year concession to a company, which had no prior healthcare experience, was in line with normal practices.\nAmong the issues highlighted by Repubblika was the signing of a memorandum of understanding with the investors behind VGH several months prior to the public competition for the contract.\nThe three ministers noted the memorandum of understanding was non-binding and limited to the Gozo General Hospital. \nThe signing of the document with prospective investors was a normal procedure that did not impinge on any later procurement processes, they said. \nThe memorandum of understanding was non-binding and limited to the Gozo General Hospital\nA letter was later sent to one of the investors, saying the “high level concept” for a 650-bed hospital in Gozo was “not aligned” to the current requirements of the government, the ministers noted, adding this was prior to the public call for an expression of interest to run the Gozo, St Luke’s and Karin Grech hospitals.\nNo reference to the memorandum was made in the letter exhibited by the ministers in court.\nThe Cabinet ministers objected to being linked to allegations of criminal behaviour simply by virtue of their roles. \n“God forbid a person is subjected to an inquiry simply because he is politically responsible for a government entity,” they said. \n“If that were to be the case, court inquiries would turn into a very dangerous political tool.”\nDr Mizzi, Dr Cardona and Prof. Scicluna objected to responsibility for the contract being pinned exclusively on them because that ignored the constitutional concept of collective Cabinet responsibility.\nThey wondered why they were selectively chosen as individuals having a vested interest in the contract and why they were being made to answer the “unfounded allegations” by Repubblika, particularly in light of the concept of collective Cabinet responsibility.\nQuestions had been raised by the NGO about the amount paid to VGH yearly as part of the concession agreement. Payments to Vitals were approved by Parliament, the ministers said. ", "comment_count": 124, "id": 878}, {"keywords": "", "author": "Jacob Borg", "article_body": "Three ministers have argued they have been singled out for their role in the Vitals Global Healthcare deal when, in fact, the whole Cabinet was responsible for it.\nNGO Repubblika called for an inquiry into the role of Tourism Minister Konrad Mizzi, Economy Minister Chris Cardona and Finance Minister Edward Scicluna in an alleged “criminal conspiracy” to drain money from the public coffers via the deal.\nIn submissions made by their lawyers in response to a court application by Repubblika, the ministers said the process leading to three public hospitals being given under a 30-year concession to a company, which had no prior healthcare experience, was in line with normal practices.\nAmong the issues highlighted by Repubblika was the signing of a memorandum of understanding with the investors behind VGH several months prior to the public competition for the contract.\nThe three ministers noted the memorandum of understanding was non-binding and limited to the Gozo General Hospital. \nThe signing of the document with prospective investors was a normal procedure that did not impinge on any later procurement processes, they said. \nThe memorandum of understanding was non-binding and limited to the Gozo General Hospital\nA letter was later sent to one of the investors, saying the “high level concept” for a 650-bed hospital in Gozo was “not aligned” to the current requirements of the government, the ministers noted, adding this was prior to the public call for an expression of interest to run the Gozo, St Luke’s and Karin Grech hospitals.\nNo reference to the memorandum was made in the letter exhibited by the ministers in court.\nThe Cabinet ministers objected to being linked to allegations of criminal behaviour simply by virtue of their roles. \n“God forbid a person is subjected to an inquiry simply because he is politically responsible for a government entity,” they said. \n“If that were to be the case, court inquiries would turn into a very dangerous political tool.”\nDr Mizzi, Dr Cardona and Prof. Scicluna objected to responsibility for the contract being pinned exclusively on them because that ignored the constitutional concept of collective Cabinet responsibility.\nThey wondered why they were selectively chosen as individuals having a vested interest in the contract and why they were being made to answer the “unfounded allegations” by Repubblika, particularly in light of the concept of collective Cabinet responsibility.\nQuestions had been raised by the NGO about the amount paid to VGH yearly as part of the concession agreement. Payments to Vitals were approved by Parliament, the ministers said. ", "comment_count": 124, "id": 879}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 11.45am with FAA statement\nAn illegal concrete batching plant was assembled in Gozo over the past weeks and the Planning Authority only moved to stop the abuse this week after being informed about it by the Times of Malta.\nThe Times of Malta has been following the assembly of the large imported batching plant in a Kerċem quarry for the past eight weeks.\nHeavy plant and equipment were carried through various Gozitan villages on trucks belonging to construction magnate Joseph Portelli, of J. Portelli Projects. \nThey were taken to an active soft-stone quarry known as Ta’ Qasam San Pawl. The facility, which is now completed and can produce concrete, was assembled by construction workers and engineers over the past weeks on a sizeable site within the quarry even though no permits have been issued yet.\nIndustry sources commented that although it was common knowledge in Gozo that the illegal batching plant was being assembled, the authorities seemed to have closed both eyes and did not intervene.\nWhen the Times of Malta informed the Planning Authority about the matter, a spokesman said the planning watchdog only got wind of what was going on in Kerċem when approached by this newspaper.\n“The authority had not received any complaints related to the case prior to your report,” the spokesman said. \n“Following your report, officials from the PA’s compliance and enforcement directorate carried out a site inspection and confirmed that a batching plant was being constructed within the quarry without a permit,” he acknowledged.\nThe spokesman said the directorate issued both verbal and written instructions for all works to cease with immediate effect and would monitor the site to ensure no further works were carried out.\nThe industry sources noted that, so far, the planning watchdog had done nothing to ensure that the batching plant was either dismantled or sealed.\nThe PA spokesman said “a planning application has been submitted attempting to sanction the illegal plant and is at pre-validation stage”.\nNo details were given regarding the identity of the applicant and no information on the plant appeared on the PA’s public server at the time of writing.\nThe investigations carried out by the Times of Malta established that the government-owned Kerċem quarry was leased to Carmel Cauchi, known as ‘Tal-Gawwi’ many years ago.\nThe quarry itself is already subject to various illegalities that remain even if the planning authority had issued an enforcement order in 1998.\nTwenty-one years ago, the owners were ordered to stop extending the perimeter of the quarry illegally and not to extract soft stone from public land that did not form part of the quarry. \nHowever, despite direct action by the regulator, the quarry kept expanding illegally over the years and soft stone continued to be extracted illegally and sold to be used on various construction projects.\nIn 2008, the quarry developers had applied through former Labour MP Carmel Borg to sanction the illegalities. Eleven years later, the PA has still to decide on the case.\n'No surprise' - FAA\nEnvironmental heritage NGO Flimkien Għal Ambjent Aħjar said it was not surprised about the batching plant revelations. \nThe PA's claims that it had not received any complaints about the case was a \"crushing indictment of the Planning Authority's lack of commitment to reverse abuse in the interests of Gozo's public health, heritage and the future of Gozo's tourism\", the NGO said.\nThe NGO said that abuses would continue until governments showed real determination to stamp out abuse \"rather than encourage it\" and suggested the introduction of a 'three strikes' system which would automatically disqualify repeat offenders from applying for permits. ", "comment_count": 101, "id": 880}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to Wednesday's front pages:\nThe Times of Malta reveals that an illegal batching plant has been built in a quarry in Gozo, and also writes that the Nationalist MPs have not met since April.\nIn-Nazzjon leads with the news that Maths and Maltese exams will not be held as a result of teachers' industrial action. It also notes that according to court evidence, three ministers have read the full Egrant report, a copy of which has not yet been given to the Opposition leader.\nThe Malta Independent features comments by the former PN executive president Mark Anthony Sammut, who says that party was run in a 'divide and rule' style. It also says that the Education Ministry is insisting that the exams should be held.\nL-Orizzont reports that workers at ARMS Ltd will be given paid compassionate leave for long-term illness. It also reports that the PN is proposing social media guidelines for its members, activists and MPs, which some described as a form of censorship.\nThe Malta Today says that the minimum wage increase is one of the lowest in the EU. It also features an appeal by Kevin Cutajar, one of the candidates considered for co-option to the PN, for a way forward to be found.\n ", "comment_count": 0, "id": 881}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Accusations of internal vote rigging against Nationalist Party top official Jean Pierre Debono to sway an internal vote at the PN executive council his way and make it to Parliament, have given Adrian Delia a new, massive blow to his already waning support as party leader.\nHowever, although these latest reports have “shocked” the electorate, internal vote rigging and manoeuvring inside political parties is not new.\nThe JPD case\nAmid an already tense atmosphere following the disastrous MEP election for the PN last month, its Executive Committee met to decide who was to be co-opted to Parliament following the resignation of MP David Stellini. \nDuring the meeting at the party headquarters, a secret vote was taken to choose between Kevin Cutajar, who was next in line for the vacated 13th district seat, or Jean Pierre Debono who, despite being elected to Parliament in 2017, decided to let go so that Dr Delia could become an MP after his election as PN leader.\nFollowing the vote, the PN announced that Mr Debono was to be co-opted after winning the ballot 42 votes in favour and 40 against. Both Mr Debono and his wife Kristy, also an MP, took part in the vote.\nHowever, while no one raised objections as to who was eligible for the vote during the meeting of the executive, a few hours later news started making the rounds that the election could have been ‘vitiated’ as two voters, Mr Stellini and party treasurer David Camilleri, took part in the ballot despite that they did not have a right to vote according to the statute.\nThe issue came to a head on Sunday evening when the PN’s Executive president Mark Anthony Sammut, who had resigned after the meeting, declared that the election was “vitiated” and null. The Gozo PN arm had already requested Dr Delia and secretary general, Clyde Puli, to nullify the vote taken.\n\nIn a more serious accusation, Mr Sammut published an electronic document with the list of PN executive voters which, he claimed, was passed on to him by Mr Debono as the PN’s political coordinator, showing its author as Jean Pierre Debono, and accused him of rigging the vote.\nDebono refutes accusations\nOn his part, Mr Debono refuted the accusations and said he had nothing to do with the preparations of the voting list. However, he did not deny that two voters, who cast their vote, were not eligible to take part.\nJPD already had a warning\nIn September 2017, soon after Dr Delia’s election, beating his rival Chris Said with an 800-vote difference from the almost 15,000 tesserati who cast their vote, claims started making the rounds that some voters participated in the leadership contest without having the right according to the party statute. \nA report was leaked to the media pointing at Mr Debono’s handling of proxy votes in the leadership election, accusing him of collecting a member’s voting document through a proxy issued without the voter’s consent.\nThe member had said the signature on the proxy was not his.\nWhen summoned to defend himself before the PN electoral commission, Mr Debono denied forging any signatures but admitted to having used proxies so that sectional committees could collect voting documents on behalf of members unable to do so themselves – an act the electoral commission criticised as a “ruse”.\nIn a decision on the case, after Dr Delia became leader, the party’s new Administrative Council said that it had accepted a written apology by Mr Debono in which he pledged to play no part in other party electoral processes to be held that year.\nIt nevertheless gave Mr Debono a public warning about his actions and said that the party would not tolerate any abuse in its electoral processes.\nFormer Cospicua mayor Pawlu Muscat addressing the media.\nLabour’s vote rigging claims\nMr Spiteri's allegations made the front page of The Sunday Times back in September 2000.\nThe latest claims involving the top echelons of the PN are identical to those which hit the headlines in 2000, when the late former Labour leadership contestant, Lino Spiteri, divulged a story of alleged vote rigging in his 1992 leadership contest with Alfred Sant.\nIn his The Sunday Times of Malta column, Mr Spiteri had alleged that he was told by Labour activist and former Cospicua mayor (now deceased) Pawlu Muscat how he was given 150 votes from two Alfred Sant campaigners to stuff into the ballot boxes at Labour headquarters to sway the leadership election in favour of Dr Sant.\nThe story, a blow to the then-Labour leader clinging to his post despite electoral defeats, stirred a massive controversy, putting Dr Sant’s leadership under renewed strain.\nHowever, despite admitting that it was true that he had recounted this story to many party stalwarts following the 1992 Labour leadership election, including to Mr Spiteri himself, Mr Muscat told a party disciplinary board later that he had made up the story to spite Mr Spiteri.\nAt the time, Labour had decided that there was no evidence of vote rigging in the 1992 contest, but expelled Mr Muscat from the party.\nBecome a Times of Malta premium member to read Mr Spiteri's column from that time and access past editions of Times of Malta dating back to 1930. ", "comment_count": 27, "id": 882}, {"keywords": "", "author": "", "article_body": "A mechanical digger toppled over on loose debris while carrying out demolition work on the old Palm Court hotel site in Qawra on Tuesday.\nNo one was injured.\nPhoto - Russell Shaw - Facebook/Times of Malta.", "comment_count": 30, "id": 883}, {"keywords": "", "author": "", "article_body": "Unborn children should be better protected by introducing better antenatal health and social services and stronger family units rather than through changes to the law, the Commissioner for Children has said.\n“Heavy-handed approaches which risk making the pregnant woman feel like or actually reduce her to the status of a quasi-surrogate mother are not conducive to the child’s best interest,” the Office of the Commissioner for Children argued.\nThe statement comes one day after PN MP Claudio Grech argued in parliament that a child protection bill which legislators are discussing should be amended to ensure that “foetus” [tarbija fil-guf] was included in the definition of “minor”.\nThis, Dr Grech argued, would send a “strong signal” that the unborn deserved equal protection as human beings.\nDr Grech’s line of thought did not chime with the Office of the Commissioner for Children, however, which believed the Minor Protection (Alternative Care) Bill was not ideal to protect the unborn.\n“In the context of a child developing in its mother’s womb, there can be no alternative form of care to that provided by the pregnant mother,” the Office argued, emphasising the “natural symbiosis” which bound the unborn child to its pregnant mother.\nIntroducing “more accessible, tailored, better-quality antenatal health and social services that empower and support pregnant parents to carry their pregnancy to term” would be more effective, the Commissioner went on to add.\nThat, coupled with strengthened familial and organizational structures around pregnant women, were the best protection an unborn child could have, the Office argued, as it urged MPs to approve the Bill being debated “without delay”.\n \n ", "comment_count": 10, "id": 884}, {"keywords": "", "author": "", "article_body": "The recent random killing of a migrant at Ħal Far was a blot on Malta's conscience, President George Vella said on Tuesday.\nIvorian national Lassana Cisse was killed on April 6 in a drive-by shooting in Triq il-Ġebel in an incident that sent shockwaves across the migrant community.\nTwo other migrants - a 27-year-old from Guinea and a 28-year-old from Gambia - were injured in the attack.\nTwo soldiers have been accused of committing the murder.  Prosecutors allege that the two shot at the men purely because of their ethnicity. \nDr Vella referred to the racially-motivated murder when he met officials of the Church-run Emigrants' Commission, which is heavily involved in the welfare of migrants. \nHe visited the commission's offices in Valletta and the premises of the Good Shepherd sisters, who offer a shelter for migrants in Balzan. \nThe President was greeted by Mgr Philip Calleja, who set up the commission, and Mgr Alfred Vella, director, and was able to chat with a number of migrants and volunteers who help them.\nDr Vella spoke on the migration issue, underlining Malta's efforts to bring about burden sharing within the European Union.\nMgr Vella said the Emigrants' Commission provides 400 beds in 14 locations to migrants.", "comment_count": 36, "id": 885}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A thief whose attempt to burgle a house was foiled by the owner, was handed a one-year sentence suspended for one year on Tuesday after pleading guilty in court.\nAleksandar Gochev, a 31-year old Macedonian, broke into a St Paul’s Bay apartment on Monday morning but was caught red-handed by the owner.\nThe intruder was arrested and taken to court within 24 hours.\nHe pleaded guilty to attempted theft and voluntary damage to third party property.\nThe court was informed that the accused was willing to make good the damages caused to the owner’s flat, totalling some €200.\nWhen making submissions on punishment, prosecuting Inspector Godwin Scerri told the court that the accused had collaborated with the police and the prosecution was thus not insisting upon an effective jail term.\nMagistrate Gabriella Vella, in view of the early guilty plea, collaboration and willingness to pay for the damage, condemned the accused to a one-year jail term suspended for one year.\nLawyer Josette Sultana was defence counsel.", "comment_count": 5, "id": 886}, {"keywords": "", "author": "", "article_body": "The Nationalist Party has joined a wave of social media criticism of a badge for businesses, announced on Monday, aimed at reassuring members of the LGBTIQ community that they are welcome.\nEquality Minister Helena Dalli launched the new initiative called #AllWelcome or #IlkollMerħba in Maltese, saying it would reflect existing equality laws and ensure they were enforced.\nBut many commented on social media that the badge is not needed since there is no discrimination.\nShadow Minister Claudette Buttgiieg on Tuesday said the badge made Malta look like a country where intolerance was dominant.\n\"No one can understand why businesses need to display this badge to show that they are ready to welcome anyone, especially the LGBTIQ, when this is a principle established in the Constitution which should be respected by everyone. It would appear that the minister is trying to create an issue where there is none,\" she said.  \nMs Buttigieg recalled that in terms of a 2013 constitutional amendment she had moved, everyone was entitled to fundamental rights and freedoms whatever his race, origin, orientation, colour, political views or gender.\nThis sticker was an insult to LGBTIQ people because it went against the principle of equality based on diversity, and actually labelled these persons, she said. \nLabour reaction\nThe Labour Party in a reaction said the PN statement smacked of opportunism by those whose track record showed their heart was not in the right place when decisions on equality needed to be taken. Everybody knew who had credibility in this area, had brought about change, and who had resisted change. ", "comment_count": 46, "id": 887}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman who sold drugs from her Għajnsielem bar has been jailed for six years and fined €5,000.\nSusan Bugeja, 50, pleaded guilty to possession and trafficking of cocaine within some 20 to 30 metres of an English language school at Ghajnsielem, Gozo back in July 2013.\nThe police had kept an eye on the bar and arrested the woman after questioning and searching a number of persons who went there. They found them in possessions of sachets of white powder, later certified as cocaine.\nAfter arresting the woman, the police searched the premises and found sachets of drugs in cigarette packets inside a metal box.\nUnder interrogation, the woman admitted to the trafficking but did not disclose  the name of her supplier.\nIn the course of criminal proceedings, a number of individuals testified to having purchased cocaine from the bar, some saying that they paid €50 each time\nThe statements released by the accused were eventually discarded as evidence against her since they had been released without the assistance of a lawyer.\nA psychiatrist, testifying in the proceedings, explained how the accused, a mother raising a teenage child single-handedly after her husband landed under house arrest in Sicily, had been through a traumatic personal experience which had caused great stress.\nHe said the woman was a “vulnerable” person, a follower rather than a leader by nature. She had sought drugs as an easy way out of her stressful situation, ending up sucked into a drug circle.\nA social inquiry report, updated last November, confirmed that the accused was handling two jobs, doing her best to raise her family and maintaining a degree of stability in her personal life.\nMagistrate Joseph Mifsud, observed that the evidence, including the testimony of those who had bought drugs from the accused’s bar as corroborated by the surveillance officers, pointed in the direction of the woman’s guilt.\nWhilst acknowledging that the accused had been going through difficult times, this did not reduce her criminal responsibility nor justify what she did.\nThe woman had been selling drugs to young persons and others, thereby  leading them into the grips of the deadly vice, he observed. \nHe condemned her to a 6-year jail term and a €5000 fine.\nInspector Bernard Charles Spiteri prosecuted", "comment_count": 0, "id": 888}, {"keywords": "", "author": "", "article_body": "Nationalist Party official Jean Pierre Debono said on Tuesday he received a salary of €2,238 from the PN last month, denying rumours that he had a yearly pay package in excess of €50,000. \nMr Debono, who has spent the past days embroiled in an internal party struggle over his role in a co-option vote to fill the parliamentary seat vacated by David Stellini, shared a screenshot of a transfer into his bank account.\nThe transfer, made on May 31, was for €2,238.97 from the ‘Partit Nazzjonalista’ and was labelled ‘salary’.\nThe screenshot shared by Mr Debono. Photo: Facebook\nA wage calculation which factors in income tax, national insurance contributions and the cost-of-living adjustment suggests that monthly wage translates into a gross yearly salary of €34,000.\n“I don’t want people to think I have anything to hide,” Mr Debono wrote on Facebook. “If you do the math, you will realise that my wife [PN MP Kristy Debono] and I raised slightly less in a single fundraising marathon than my yearly salary amounts to in a year”.  \n“That’s far away from the €50,000, €70,000 or €100,000 bandied about by certain individuals,” he said, adding that others within the party earned similar amounts.\n\nMr Debono, who previously served as the PN’s assistant general secretary and is currently its political coordinator, said on Monday that he would not be taking his oath of office as an MP.\nThat withdrawal came on the back of growing controversy over his role in organising the ballot that saw him voted in by the PN’s executive council as Mr Stellini’s replacement in parliament – a ballot he won by just two votes, and which the party’s outgoing executive president said should be declared void and retaken.\nMassive party debts\nThe PN has spent the past years battling intense financial difficulties, with debts rumoured to run into several millions of euro. An email leaked in January revealed that last August, the party leadership was warned that it only had enough funds to carry it to February.  \nIn late 2017, party leader Adrian Delia said he would follow in his predecessor Simon Busuttil’s footsteps and forgo a salary as PN leader. He had earlier told Lovin Malta that he saw no problem with somebody earning a salary for a full-time job. ", "comment_count": 54, "id": 889}, {"keywords": "", "author": "", "article_body": "Qatar Airways operated its inaugural flight to Malta on Tuesday, with its aircraft receiving a traditional water cannon salute.\nThe flight from Doha marked the launch of a daily operation for summer. It will fly four times weekly to Malta in the winter. \n“We are delighted to welcome this flag carrier to our airline family and to grow our route network further with the addition of Doha. The convenient flight schedule which will be operated by Qatar Airways throughout the year, will certainly strengthen our connections to the rest of the world,” Malta Airport CEO Alan Borg said.\nTourism Minister Konrad Mizzi said that the new route complementsgovernment’s vision for tourism as it will provide better market diversification and increased connectivity for Malta.\nQatar Airways flies to over 160 destinations, of which more than 80 are in Asia and the Pacific, the Americas, and Africa.", "comment_count": 0, "id": 890}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated 3.12pm with MUT statement \nThe Malta Union of Teachers on Tuesday afternoon accused the Education Ministry of trying to acquire Maths and Maltese exam papers from Church schools, in an attempt to circumvent a union directive blocking such exams from taking place. \nThe MUT ordered the directive in state secondary schools in protest over a shortage of teachers, saying many teachers were being required to teach more lessons than their collective agreement required. \nEducation Minister Evarist Bartolo had on Tuesday morning urged the union to drop its directives.\nAddressing a press conference, a \"worried\" Mr Bartolo said that he hoped the two sides would come to an agreement for the sake of \"the common good\".  \n\"My appeal, for the common good, is for the Malta Union of Teachers (MUT) to reconsider its position because the number of teachers with such a load is a bit disproportionate,\" Mr Bartolo said. \nThe MUT hit back later in the day, saying authorities were trying to piece together exams using half-yearly exam papers, as well as by trying to get their hands on exam papers prepared for Church school students (see below). \nUnion directives\nThe union has ordered teachers and heads of department of the two core subjects to refrain from providing or correcting exam papers, saying members were over-worked, often assigned 25 lessons per week or more. \nOn this the minister said that this is not the case across the board and only in exceptional cases were teachers being assigned that many lessons. According to Mr Bartolo only 3.5 per cent of Maltese teachers were assigned such a teaching load, while one in four Maths teachers had that many lessons. \nRead: Only 3.5% of teachers have maximum class load – ministry\nAsked by the Times of Malta whether the government had a back up plan in case the union did not change its position and in light of the fact that the exam period was only days away, the minister said the focus at the moment would be to \"resolve the issue\".\nMr Bartolo would not comment on whether the government was considering providing students with exam papers put together by the Education Department, as was the case in February during the half-yearly exams. He admitted, however, that he was not happy with what had happened in February and the papers provided to the students.\nAccording to parents who spoke to the Times of Malta last month, they were not being provided with much information, only finding out about the situation at the last minute when they were helping their children with revision. \nMeanwhile, also speaking at the press conference, Permanent Secretary Frank Fabri insisted that the department was putting in a lot of effort to address the issues flagged by the union. In fact, in recent weeks, the department has been busy engaging new teachers, with 14 for Maltese and six for Maths already brought in, he said. \n\"In light of the fact that we have done all we can to bring in teachers and even accepted the union's proposals and that only 3.5 per cent have such a load, we continue to stand by our position and we insist that it is only fair that children get to sit for their exams,\" Dr Fabri insisted. \nMUT reaction\nIn a reaction to the minister's comments, the Malta Union of Teachers accused the Education Ministry of trying to circumvent its directives by cobbling together exam papers as it did for the half-year exams, when pupils ended up with past papers and questions which were not on their syllabus.\nThe MUT said it had also learned that the ministry was also trying to acquire Maltese and Maths exam papers from church schools through the Curia.\nSuch actions were unbecoming of the ministry, more so since the way subjects were taught in church schools was different from state schools. \nThe MUT criticised the ministry for not having tackled its complaints about a shortage of teachers and said it was declaring an industrial dispute. It said it was directing all its members not to hand any exam papers to the Curia or the ministry. ", "comment_count": 77, "id": 891}, {"keywords": "", "author": "", "article_body": "Energy and transport together accounted for nearly two-thirds of all Malta’s greenhouse gas emissions in 2017, according to National Statistics Office figures.\nStatistics on air pollution levels and sources in Malta, issued to mark World Environment Day, show that emissions increased 14% in 2017 compared to the previous year - a total of more than 2,155 kilotonnes.\nA separate report published by the European Environment Agency last week showed Malta was one of just six EU countries to register an increase in emissions compared to 1990. By 2017, Malta’s total emissions had grown by 2.3% while the EU as a whole saw a drop of 23%.\nEnergy down, transport up\nAccording to the NSO, over a 10-year period emissions the energy industries fell by more than half, but those from transport were on the rise.\nThe decrease in energy emissions was attributed to the use of imported electricity by means of the interconnector from 2015 and the shift to a natural gas-fired power station in 2017.\nAt the same time, however, emissions from transport continued to increase. The stock of motor vehicles increased by 15% since 2014, reaching 385,236 in 2018, with passenger cars the fastest-growing type of vehicle.\nThe average age of passenger cars and motorcycles was 14 years.\n\nSea and air transport contribute to emissions\nBetween 2014 and 2018 there were an average of 316 cruise liner calls per year, the NSO said. During the same period, sea transport between Malta and Gozo increased by 19 per cent, rising to 23,600 trips in 2018.\nGas oil and diesel oil were the main types of fuel, amounting to 13 kilotonnes in 2017.\nData from the Malta International Airport, meanwhile, shows that between 2014 and 2018 the total number of charter and scheduled flights increased by 46%. The transport sector also increased its use of kerosene-type jet fuel purchased in Malta by both national and international airlines by 32%.\nWorld Environment Day is celebrated by the United Nations every year on June 5 to promoting awareness of the environment and its protection. This year has a chosen theme of Beat Air Pollution.", "comment_count": 6, "id": 892}, {"keywords": "", "author": "Ivan Martin", "article_body": "Tourism Minister Konrad Mizzi on Monday encouraged hoteliers to consider alternative investments to building new hotels in a bid to diversify the island’s offering. \nHe was reacting to the author of a nation-wide survey on the hospitality sector who last week warned of “alarming” spikes in the number of hotels on the island, which he said could pose a risk to the sector’s profitability.\n“We do encourage hoteliers to invest in refurbishment or redevelopment of existing hotels as well as to invest in other leisure products, whether they are culinary projects, theatres, museums or events,” he said.\nThe survey, conducted by ‘big four’ accounting firm Deloitte on behalf of the Malta Hotels and Restaurants Association, found that while tourist arrival trends were “still positive”, the increases were less pronounced than in previous years.\n“This year so far the results aren’t what we had got used to. We had a number of years where the graphs kept going up but this year was different,” Raphael Aloisio, from Deloitte, had said.\nMost alarmingly, he had warned that if supply of hotels and restaurants continued to increase at a faster rate than the demand for rooms and tables, then the sector would dip.  \nThe number of permits for hotels being issued has shot up from 15 in 2012 to 119 in 2017. \nAsked about this trend, Dr Mizzi said the government had a strategy to tackle the issue. \nOn the demand side, the government had been working to introduce a number of new routes during the shoulder months, and other times of the year, in a bid to fill the new rooms.\nAnd on the supply-side, the government had been working on the scourge of local hoteliers – private accommodation. \nDr Mizzi said the government had just concluded an agreement with alternative accommodation giant Booking.com, which would ensure that providers in Malta would have to register with the Malta Tourism Authority before putting their property on the website.\nThe authorities, Dr Mizzi said, were also holding talks with Trip Advisor. \nDr Mizzi said the island particularly needed to diversify its offering. One sector that was lacking was high-end accommodation.\nThe minister had just visited a new high-end hotel in Valletta. He said the high-spend tourist and business-calls visitors’ required more tailor-made accommodation.", "comment_count": 28, "id": 893}, {"keywords": "", "author": "Ivan Martin", "article_body": "Three sandy bays across Malta, including Balluta Bay in St Julian's, will be replenished with sand in the coming days as part of a beach extension programme, Tourism Minister Konrad Mizzi said on Tuesday.\nAddressing a press conference near the miniscule St George’s Bay in Birżebbuġa (outside the Al Fresco restaurant), Dr Mizzi said the beach, along with Għar l- Aħmar bay in Marsaxlokk, would be extended by some 25 metres using dredged-up sand from the seabed.\nWhile these two bays would be replenished by the government, Balluta Bay, which had already been used in a pilot project last year, will be extended by the nearby Marriott Hotel (formerly Le Méridien).\nBalluta Bay just after the replenishment project in 2018\nDr Mizzi said the hotel owner had pledged to replenish the bay for the next five years. The beach would remain public and no concessions or deck chairs would be placed on any of the three.  \nSt George’s Bay in Birżebbuġa will be a temporary extension project, with some 1,500 cubic meters of sand to be dredged up.\nThe other small beach in Marsaxlokk, Dr Mizzi said, would be a \"permanent\" fixture, with a roughly 15-year lifespan depending on intermittent replenishment.  That project, he said, would include a submerged berm, which will stop the sand from escaping back beneath the waves when the first storms hit at the end of summer.\nBalluta Bay had largely disappeared beneath the surface just a few months after the pilot project had been finished, with many questioning the point of having brought up tons of sand for just a few months.\nThe sands quickly returned beneath the waves after the first storms hit Balluta Bay\nKevin Fsadni from the Malta Tourism Authority has been overseeing the beach extension program, and told Times of Malta that although Balluta Bay had largely returned to the waves during the stormy period, a review of the beach back in February had found that some 15 metres still remained.\nThe authorities, he said, had identified beaches with natural sand deposits which had slowly vanished after roads built up to the bay, had impacted the normal cycle of sand replenishment.\nPulling up fresh sand from beneath the surface and placing it on dry land, recreated the process of beach formation in the least invasive way, he said.\n\"Our plan is for the whole coast of the island to be surveyed, and for the beaches such as these to be identified and replenished,\" he said. \nDr Mizzi later added that the replenishment projects had been approved by the Environment and Resources Authority and would follow a method statement drawn up by ecological experts.", "comment_count": 56, "id": 894}, {"keywords": "", "author": "", "article_body": "Two men from Ghana were charged on Tuesday with injuring each other.\nThe police said that a 37-year-old man had stabbed a 33-year-old injuring him slightly. The victim, in the meantime, was charged with seriously injuring his attacker.\nBoth men pleaded not guilty. The case is being heard at the Magistrates' Court by magistrate Paul Coppini. The prosecution is being led by inspector Bernard Charles Spiteri.", "comment_count": 0, "id": 895}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A court has blocked the Planning Authority from deciding on controversial plans for an ODZ fuel station in Magħtab until an appeal by residents has been resolved.\nThe court’s decision prolongs a saga that has already lasted about five years, during which time the PA was forced to decide on the project on three separate occasions.\nThe proposal, by Paul Abela of Abel Energy, aims to demolish two derelict farmhouses on Triq is-Salina, close to T’Alla u Ommu hill in Naxxar, to build a fuel station and related facilities.\nIt has faced sustained opposition from residents and environmental groups over its proximity to nearby houses, the take-up of agricultural land and the impact on the area’s rural character.\nThe planning watchdog had contentiously approved the project in January 2018, prompting the government to order a review of the planning policy under which the permit was issued.\nHowever, the planning appeals tribunal annulled the decision last April on procedural grounds that residents objecting to the project had not been given access to information provided to the developers ahead of the hearing where the project was greenlit.\nAlthough objectors agreed with the tribunal’s decision to send the case back to the PA, they took issue with one point which said residents were to be assumed to have been updated with all relevant documents. In a court appeal over this point, residents argued that this was “absolutely not the case”.\nPA forced to decide on the project on three occasions\nBefore the appeal could be heard, however, the PA scheduled a hearing for April 25 to again decide on the application, prompting residents to return to block the hearing until the appeal was decided.\nIn its decision, the court upheld the residents’ request for an injunction, concluding that their rights would otherwise be prejudiced.\nThe PA had already postponed the hearing following the request to the courts and will now have to wait until a decision on the appeal before rescheduling.\nThe residents are represented by lawyer Tanya Sciberras Camilleri.\nDating back to 2014, the fuel station proposal had originally been rejected by the PA on the basis of SPED (Strategic Plan for Environment and Development) policy before the decision was reversed in 2018 due to the fuel stations policy, which has since been reviewed.\nA draft of the revised policy, published for public consultation in April but not yet implemented, drastically reduces the maximum size allowed for fuel stations from 3,000 to 1,000 square metres.\nIt also limits outside development zone fuel stations to ‘relocations’ of existing facilities from urban cores as well as tightening restrictions on the use of agricultural land.", "comment_count": 15, "id": 896}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Cyclists were being used to promote new infrastructural projects though bike commuting still seemed to be an afterthought, according to the Bicycle Advocacy Group.\n“BAG receives a lot of criticism because we speak about safety. They tell us that the country has its own limitations and that there is no space for bike commuting,” the group’s president, Michelle Attard Tonna, said on the occasion of World Bicycle Day.\n“Lately, we are often being used to promote new infrastructural projects, however, when we see these projects we realise that the space for bike commuting would have been done as an afterthought and in a dangerous or irrational manner,” she said.\nSpeaking in Mosta, following a ride from Ta’ Qali with a stop at San Anton Palace to greet President George Vella, Dr Attard Tonna said BAG did not believe commuters should compromise their safety when using the bicycle.\nMore than 150 cyclists took part.\nThose who travelled by bicycle not only had the right to do so but should be celebrated because they were using a clean mode of transport that did not take much space, she added.\n“Our argument has always been consistent – offer different and sustainable alternatives for mobility so that everyone can have the opportunity to travel the way they want. We believe that if the authorities apply goodwill and common sense, we will one day manage to fulfil this target,” she remarked.\nDr Attard Tonna noted that cyclists were a minority that was slowly growing every day. However, there were also silent members within the cycling community, others who did not cycle but would like to and still others who supported relatives who cycled.\n“It’s high time we are listened to. It’s high time the authorities understand how important it is that they give us a choice to travel the way we deem best, indeed, how important it is that this choice is not taken away from us,” Dr Attard Tonna insisted. \nThe right for space was already there, however, cyclists were finding themselves in a situation where they needed to protect that territory and fight for it, she continued. Cyclists called on President George Vella at San Anton Palace, in Attard, on Sunday. Photo: Daryl Cauchi/Bicycle Advocacy Group\nApart from concerns about emissions, respiratory problems, traffic jams and the loss of precious space for parking lots, Dr Attard Tonna also mentioned small wins. \nThese include the increasing awareness about the need for sustainable mobility and, thanks to the Transport Ministry, the first segregated bicycle lane.\nThere was also infrastructural improvement in some zones, she said, adding that such infrastructure needed to be rendered safer and should allow connectivity.", "comment_count": 113, "id": 897}, {"keywords": "", "author": "", "article_body": "Only 11 of the 176 teachers of Maltese and 25 per cent of the Maths ones have 25 lessons a week, the Education Ministry said on Tuesday.\nIt pointed out that the maximum class load was laid down in the sectoral agreement and that in this context only 3.5 per cent of all the middle and secondary schools had this level of workload, which showed that it was the exception rather than the rule.\nAs a protest against what it says is overloading of teachers, the Malta Union of Teachers announced on Monday that no Maths and Maltese exams will be held in secondary schools this scholastic year.\nRead: No Maths, Maltese exams in secondary schools - MUT\nIt said it was standing by its directives after the government failed to heed its complaints about a shortage of teachers, particularly in those two subjects.\nHowever, the ministry said it had already made a start on 17 proposals made by the union, apart from trying to increase the number of teachers through year-round recruitment.\nOne of the measures in the sectoral agreement, which has already been put into force, was the reduction of one lesson a week for each of the teachers.\nThe ministry appealed to the MUT to reconsider its industrial action, and to suspend its directives.\nLate on Monday, the Maltese Association for Parents of State School Students issued an appeal to the ministry and the union for a solution to be found in the interests of the children.", "comment_count": 28, "id": 898}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The cultural heritage watchdog has called for the illegal ‘circus-like’ additions at Il-Fortizza in Sliema to be removed, after the owners of a restaurant within the historic building applied to regularise the structures.\nThe British artillery battery, built between 1872 and 1886, is scheduled at Grade 1 level for its high historical and architectural value, and has in recent decades been leased to catering establishments.\nAn application, currently being considered by the Planning Authority, seeks to sanction a glazed surrounding added to a wood-and-canvas tent along the side of the battery, as well as an extension of the structure, and new outdoor tables, chairs and umbrellas, all added without a permit.\nThe Superintendence for Cultural Heritage (SCH) has objected to the sanctioning, arguing that the illegal additions were not compatible with such a significant architectural monument and should be removed.\n“Some of the structures at il-Fortizza, including unauthorised tables and chairs, entrance tent and funfair equipment, vaguely evoke the appearance of a circus [and] are incongruous with the Sliema Point Battery,” the Superintendence for Cultural Heritage said.\n“The outdoor structures detract from the visual appearance of the scheduled building, increasing the material and visual clutter around the monument.”\nThe sanctioning request has also drawn objections from the Sliema Heritage Society and NGO Futur Ambjent Wieħed, which said the additions “practically obliterate the view of the historic fort” and gave the impression of a “crass mess wrapped in plastic”.\nThe Sliema local council similarly said the proposal violated planning policy that required such developments “to improve the townscape and environment in historic cores” and to “protect and enhance the character and amenity of distinct urban areas”.\nJust last February, the PA ordered the removal of several additional tents which had appeared on the promenade in front of the battery, after a complaint by the council and the Sliema Heritage Society.\nThe sanctioning application is open for public consultation until July 5.", "comment_count": 86, "id": 899}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Tuesday's newspapers:\nMonday's escalating developments within the PN dominate the front page of the Times of Malta, which also reports on the additions to Sliema's Fortizza which should not be there.\nThe Malta Independent also reported on what it called the 'open war' in the PN, and also on whether details can be given of trips made to Dubai in 2015 and 2016 by Tourism Minister Konrad Mizzi.\nL-Orizzont also focusses on the developments within the PN, also reporting that the National Archives would move to new premises.\nIn-Nazzjon carries a message from PN leader Adrian Delia in which he says that the party should be working together and listening to what the electorate wanted rather than pointing fingers of blame at each other.", "comment_count": 0, "id": 900}, {"keywords": "", "author": "", "article_body": "No Maths and Maltese exams will be held in secondary schools this scholastic year, the Malta Union of Teachers said on Monday.\nIt said it is standing by its directives after the government failed to heed its complaints about a shortage of teachers, particularly in those two subjects.\nIn a statement, the union said teachers' caseload was above what was laid down in the sectoral agreement.\nit drew the ministry's attention to the situation more than a year ago, underlining the fact that teachers were being over-worked and expected to give too many lessons.\nThis, it said, is stressing them out and affecting teaching.\nThe government, it said, had not heeded its complaints and had not enrolled additional teachers.\nAt this rate, it warned, pupils would end up not only without exams, but without teachers. \nConcerned parents told the Times of Malta at the end of last month that they had assumed that, following the half-yearly exams in February, the issue had been resolved. At the time, the education directorate had stepped in, compiling papers from past exam questions and some new material.\nAccording to the parents, however, the exam papers had not covered the entire syllabus.\n“I asked my son whether he needed any help with his Maltese. It was then that he informed me his teacher was telling students they were likely not to have a proper exam once again,” one mother said.\nIt was then that he informed me his teacher was telling students they were likely not to have a proper exam once again\nThis was soon confirmed by the head of the school who, while insisting that he could not divulge much information, told her the exam papers for the two subjects were yet to be sent to the school.\nNot having final exams for the two core subjects was especially worrying for Year 10 (Form 4) students because end-of-year exams were one of the last chances they had to be tested before they sat for their O level examinations.", "comment_count": 36, "id": 901}, {"keywords": "", "author": "Keith Micallef", "article_body": "The north is no longer a Nationalist fortress and the south has squeezed the PN out. Keith Micallef analyses the election results from a geographical perspective\nThe Nationalist Party risks shrinking to a regional political force after losing the local elections by a historic margin of 47,116 votes, even larger than the 42,616 gap in the MEP elections.\nThe PN can now only bank on a majority in a cluster of localities in the centre of the island and has suffered a wipe-out in the south.\nWhile this trend was fully exposed in the council elections, unofficial data also show that in the MEP elections the PN only obtained an absolute majority in the 10th district, consisting of Sliema and St Julian’s.\nAs for the rest, it obtained three relative majorities in the eighth, ninth and 11th districts, all of which are in the central-northern region.\nMEP elections\nFor the PL it was mission accomplished in the elections for the European Parliament. Apart from winning by an unprecedented majority of 16.4 percentage points, the party for the first time won four of the six seats up for grabs.\nThe PN – the party which fought tooth and nail for EU membership – registered its fourth straight loss since the first MEP elections in 2004.\nFurthermore, the party failed in its three major objectives.\nFirst, it did not put up a serious fight to retain the third seat that it had won by a whisker five years ago.\nSecondly, the margin of defeat was greater than both the last general election and the 2014 MEP contest.\nThirdly, the re-election of David Casa at the expense of Frank Psaila, who was being backed by the party machine, would be seen as a blow to the leadership.\nCouncil elections\n Labour won two thirds of the localities – 47 out of 68 councils – against the PN’s 19 which included Mdina where no election was held.\nThe PN lost votes in 56 localities and gained in just 11. On the other hand, Labour increased support in 53 councils and suffered marginal losses in 14.\nAs in the MEP elections, the PN achieved none of its modest objectives. Apart from failing to retain St Paul’s Bay, it lost Mosta and Siġġiewi, failed to win Birkirkara back, and for the first time ever it even lost control of Valletta. Munxar was the only council the PN managed to sway in its favour.\nSan Ġwann also switched to Labour, even though the PN registered a marginal increase of votes there. The seemingly contradictory result was due to the fact that in the previous election the PN had won most seats despite obtaining fewer votes. In Msida, where the party was harbouring hopes of a win, the outcome was the complete opposite, with the PL increasing its lead.\n\n \nFollowing these elections, the PN’s only remaining majorities are 11 in Malta and eight in Gozo. In Malta the distribution is very telling, clustered as they are around Sliema, St Julian’s, Swieqi, Attard, Balzan, Lija, Iklin, Mdina, Naxxar Għargħur and Mġarr. Nonetheless, in St Julian’s, Balzan, Għargħur and Mġarr, the PN suffered losses.\nThe picture in the rest of the island is much grimmer for the PN. The north is no longer a Nationalist fortress while the south is fast becoming a no-go area for the PN.\nApart from suffering huge losses, which in some places, such as Marsascala, meant a loss of seats, the party risks hitting rock bottom, winning just one seat by a small margin in certain localities.\nIf this trend persists in future elections it may find itself unable to elect any candidates in places like Cospicua, Għaxaq, Vittoriosa, Xgħajra and Marsaxlokk, where its share of the vote is dangerously hovering around the 20 per cent mark and in some cases has fallen as low as 15.5 per cent.\nThis election has also rekindled the debate on the decision to lower the voting age to 16. In Għargħur, 16-year-old Abraham Aquilina obtained most votes for the winning party, the PN, but has been denied the mayorship due to his age. Some might argue that this was a half-baked reform.\nWhile small parties failed to win a single seat, independent groups and candidates had limited success. The biggest feat was probably that of 23-year-old Steve Zammit Lupi, in Żebbuġ, Malta, who obtained 947 first-count votes and was elected straight away. \nIn Gozo, an independent group headed by David Apap, former PN mayor, won two seats in Għarb, while former Żebbuġ mayor Nicky Saliba was re-elected as an independent candidate.\nThese two localities ended up with a ‘hung’ council as no party has the majority of seats. The deadlock will have to be broken in the first meeting through a vote among the councillors.", "comment_count": 48, "id": 902}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Concerns have been raised over two apartment block applications in Pietà, which objectors say will destroy one of the locality’s best preserved streetscapes and negatively impact an area dotted with historic buildings.\nOne application proposes the construction of a seven-storey block on Triq ix-Xatt in place of an existing three-storey townhouse. The other is for a five-floor block on a stepped alleyway off the same street.\nThe two applications have drawn objections from residents, heritage groups and the Pietà local council.\n“If approved, these applications will see the destruction of one of Pietà’s lasting green enclaves and best-preserved streetscapes with garden dwellings dating back to the late 18th century,” Edward Said, from the Friends of Villa Frère, said.\nThe NGO is responsible for the upkeep and restoration of the villa’s historic gardens, which lie directly behind the proposed development.\n“The destruction of this special area will not only destroy some of the historic vistas of Villa Frère but will further compromise the context of the listed St Luke’s Hospital as well as Villa Medina,” Mr Said added.\n“We urge the public and the authorities to reject both applications and protect these buildings, gardens and fields,” he pleaded.\nThe Pietà local council said one of the applications would entail the destruction of one of a “series of stepped gardens having historic and ecological value and which can be considered as unique in the area”.\nA similar five-storey development in the same stepped alleyway – Alley 3 – was rejected by the Planning Authority last year due to the impact on the historic townscape and local character of the area but is currently under appeal.\nNGOs had said at the time the development would have towered over the Msida marina, ruining views towards and around the quaint, distinctive street, as well as destroying one of the last remaining ancient fields below St Luke’s Hospital.\nHeritage Malta, which holds the title to Villa Frère, has also recently objected to plans for the development of the nearby Giar-dino Zamittello and called for the gardens and structures to be scheduled at Grade 1 level, with an adequate buffer zone to protect their surroundings.", "comment_count": 5, "id": 903}, {"keywords": "", "author": "", "article_body": "The Independent Police Complaints Board has criticised the police Rapid Intervention Unit for the way it evicted Graffiti activists noisily protesting at the Planning Authority last September. While finding some cases of excessive force, it said no officer could be condemned since no one committing any \"suspicious activity\" had been identified.\n“It appears to the board, on the basis of the evidence presented to it, that the eviction operation was carried out in a disjointed manner. It could have been better organised so that the few episodes of excessive force could have been avoided,” the board, chaired by retired Judge Franco Depasquale, concluded in an 18-page report.\nThe activists showed up at a PA board meeting to protest against controversial plans for another new fuel station on Outside Development Zone land.\nTwo of the activists were bleeding as they were forcibly removed from the building by Rapid Intervention Unit officers, witnesses confirmed. Footage showed them being manhandled, sparking anger among the protesters who insisted they were doing nothing illegal.\nPrime Minister Joseph Muscat had described the police operation as heavy-handed.\nReport tabled in parliament\nThe report by the police board was tabled in Parliament on Monday by Home Affairs Minister Michael Farrugia, at the request of Nationalist MP Karol Aquilina.\nThe board heard complaints that protesters had been kicked and one had a drum thrown at her. Another continued to be beaten while on the floor.\nBut the board observed that the members of Graffitti who had given evidence  could not identify any of the policemen and link them to any specific incident.\nIt also noted that the evidence showed that it was not a policeman who had thrown the drum. As for the reported kicking, no injury marks or bruises were left on the protester involved.\nAnother protester had complained about having been held by the neck and having had a policeman hold his head down with a knee. The board however noted that this protester continued to forcefully resist the officers when he was taken out of the offices.\nHe had suffered no consequences, the board said, but the officer involved could have handled this case better so that this man would not have ended up with his face on the ground, arms twisted.\nThe board said the officers had not shown much skill and had used excessive force at times when this case could have been handled more professionally.\nBetter PA security\nIndeed, the whole incident could have been avoided had the Planning Authority provided better security. No one had stopped or questioned the protesters even when they were evidently holding objects as they entered the authority's offices.\nIt had also been noted that some of the individuals did not enter through the main gate, but the PA had not taken precautions to avoid that from happening.\nThe board said some three or four of the protesters had strongly resisted the police efforts to evict them. After being dragged out, some went back in to help their friends.\n“Some of the activists did not offer just passive resistance, but also active resistance,” it said. This was a far from the case of \"none of the activists having raised a finger\", as one of them had claimed on social media.\nThe board said the police had initially politely asked the protesters to leave. At least one outsider interfered and hindered the police operation, to the extent that he was asked to leave and was stopped from assaulting the protesters.\nRead the full report on pdf below (scroll down from parliamentary question. Some pages are upside down.)\n ", "comment_count": 40, "id": 904}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "The government has appealed against a “landmark” judgment on the unconstitutionality of old property rents but this is not expected to slow the momentum in favour of owners’ rights, according to specialist lawyers.\nThe widely expected appeal does not diminish the impact of the sentence delivered by the First Hall in its constitutional jurisdiction: Mr Justice Lawrence Mintoff’s ruling has paved the way for an entire class of residential property leases to be deemed unconstitutional.\n“The sentence implies that all residential rents with current annual rent of €209 can be declared unconstitutional because of the principle of proportionality between tenant and owner,” said Edward Debono, the lawyer of the plaintiffs who were awarded €20,000 in damages.\nPrivate individuals can never be called upon to bear the burden of social measures designed to protect and safeguard other citizens, for as long as [the private individuals] are not adequately compensated [by the State]- Mr Justice Lawrence Mintoff\n“It’s a landmark decision because, while Act X of 2009 had been declared unconstitutional as to commercial rents and requisitioned properties in previous cases, this is the first time that non-requisitioned residential rents have been considered unconstitutional.” \nIn its legal submissions the government had attempted to draw this distinction: it pleaded that there was no violation of owners’ property rights because the property still belonged to the plaintiffs, that the State hadn’t requisitioned the property in dispute but only “controlled” the rent, and that the lease was a private matter between tenants and owners.\nMr Justice Mintoff dismissed these pleas. Taking a cue from pronouncements of the European Court of Human Rights, he argued that while the State had legislated to ensure people had a place of abode, it had neglected the interests of property owners.\nHe wrote: “Private individuals can never be called upon to bear the burden of social measures designed to protect and safeguard other citizens, for as long as [the private individuals] are not adequately compensated [by the State]”. Dr Debono, one of the leading specialist lawyers in property rights cases, revealed that since that sentence was delivered he has had other property owners in the same situation inquiring about initiating lawsuits.\n“Some people want to forge ahead with filing causes in spite of the appeal – there is the feeling that the original judgment will be upheld on appeal – although others prefer to wait until the appeal is concluded.”\nAll classes of pre-1995 rents have now been deemed unconstitutional in a string of judgments over the years that include the latest one. The number of households held under all the old rental laws has been estimated at around 32,000 by the NSO. That amounts to over 15 per cent of households in Malta.  \nThe appeal that the government filed is expected to take six months to be decided. \nOld rental laws all found unconstitutional\nThe constitutional courts have now denounced the two laws that regulate pre-1995 property rents – Chapter 158 and Chapter 69 – as well as the amendments of 2009 that were designed to bring the breaches of property rights under Chapter 69 to a gradual, managed resolution.\nChapter 158 governs properties that were originally leased under title of emphyteusis or ground rent – leased for a specified number of years at a specified annual ground rent – which were then converted into perpetual leaseholds by legal amendments in 1979.\nThis class of leaseholds were repudiated in a decisive judgment in 2009 – Amato Gauci vs Malta – by the ECHR. That court found that “a disproportionate and excessive burden was placed on the applicant” and that “it follows that the Maltese State failed to strike the requisite fair balance between the general interests of the community and the protection of the applicant’s right to property”.\nThat judgment was reiterated in a string of subsequent lawsuits in Malta and Strasbourg.\nThen, in a 2014 case represented by Michael Camilleri, an associate of Mamo TCV Advocates, a Maltese constitutional court went further by ruling that tenancy governed by Chapter 158 could no longer be considered perpetual. This raised the spectre of eviction orders being sought. Eviction was averted in this case when the parties clinched an out-of-court arrangement.  \nDr Camilleri, a human rights lawyer who has specialised in taking property rights cases to Strasbourg, talked to this newspaper about a seminal judgment at the turn of this year in one of his cases at the ECHR. It involved emphyteusis or ground rent agreed after 1979 which, despite the fact that the owner was cognizant of the legal restrictions on his ability to raise rent and get the tenants out, was still judged in breach of property rights.\n“The ECHR maintained that although the owner knew what he was signing up to, he couldn’t predict how the law or situation would evolve over many years,” said Dr Camilleri. “Legal provisions granting tenants perpetual wide-ranging rights were problematic from that perspective. The ECHR looks at the wider situation, whether the law is balanced and proportionate – the rise in property prices means the owners have been subsidising the social welfare system.”\nAmendments to Chapter 158 two years ago attempted to rebalance the competing interests by introducing a mechanism for owners to get a raise in rent and subsequently get the tenants out. Owners can now take the case to the Rent Regulation Board, presided by a magistrate, who can raise the rent to two per cent of the property price – the exact amount is set commensurately with the tenant’s financial capability – and oblige the tenant to vacate the property after five years if he has sufficient means for alternative arrangements.\n“The problem is that these changes have introduced yet another court procedure, which costs money and takes time,” Dr Camilleri said. “Moreover, in case of a judgment from constitutional court saying tenancy is unconstitutional, the owner has to take the case to the Rent Regulation Board instead of filing directly for eviction. This matter has yet to be clarified.”\nMeanwhile, the other old law – Chapter 69 – governed ordinary rents agreed between owner and tenant. It zealously protected tenants and their descendants from eviction and arbitrary increases in rent. The law was eventually changed in 1995: rents since 1995 have empowered owners to evict the tenant or raise the rent discretionally upon expiry of the private agreement. All the cases that are being challenged in court are of rents made prior to 1995, which are inheritable. \nThese rents were modulated by Act X of 2009 in a bid to bring the complications arising from the unconstitutionality of rental laws to a gradual, managed closure. That law raised the bar for inheritance of rental agreements: heirs had to be living for four of five years prior to 2009 with the tenants and pass a means test. It uniformly raised rents to €185 annually, plus cyclical increases in keeping with cost of living indices – these rents currently stand at €209 annually.\n“The court [Mr Justice Mintoff] has now said that the rise in annual rent established by Act X of 2009 is in most cases insufficient given the disproportional market value of property,” Dr Debono said. “This is what’s innovative about the judgment.”\nAnother innovation in the judgement is the pronouncement that perpetual tenancy under the provisions of Chapter 69 can no longer be assured. This doesn’t imply automatic eviction. The highest court has maintained in past cases that it is not within the scope of the constitutional courts to order eviction; owners would have to request it in the ordinary civil court.   \n“The trend in court decisions,” Dr Camilleri said, “has been to lean in favour of interests of property owners, but there are still obstacles and finer details in laws that complicate owners’ property rights.”   \nLaws that violate human rights remain unchanged\nMr Justice Mintoff’s judgment “declares” that the laws governing the rent – Chapter 69 as well as Act X of 2009 – are “inconsistent with Article 37(1) of the Constitution and Article 1 of the first protocol of the Convention [of human rights], and these laws can be considered as having no effect between the parties [owners and tenants].”\nThe implication is that these legal provisions still stand for everyone else. Judge Emeritus Giovanni Bonello, who served at the ECHR, writes in his book Misunderstanding the Constitution that this situation has the “dazzling effect of the very same law being valid and invalid at the same time”.\nIn expanded comments to this newspaper, he said that having a law found to violate human rights to be only invalid for the particular plaintiff who challenged it “has huge negative effects”.\n“Among these, the courts are obliged to apply a law that the Constitutional Court has already found to be null and void. And every person in a similar situation has to reapply to the Constitutional Court to obtain a new declaration of nullity – an immense waste of resources and expenses.”\nIn previous classes of leasehold cases, the string of constitutional challenges became a rhythm of repetition, with the same laws denounced for the same reasons. The ECHR has in recent years almost invariably raised damages awarded to property owners by the local courts.\nLast December, the Council of Europe’s Venice Commission recommended devising a system common to much of the democratic world: the automatic revocation of any law deemed unconstitutional by the Constitutional Court. \nIn Malta, discretionary power to amend or revoke any law deemed unconstitutional is vested in Parliament. Although the UK has a similar arrangement, the difference in Malta is that the Maltese Constitution expressly holds that the Constitution is the “supreme law” that “shall prevail and any other law shall, to the extent of the inconsistency [with the Constitution], be void”.\nIn this context, Judge Emeritus Bonello accuses the Constitutional Court of “impotence” and “abdication” in his book which was serialised in this newspaper.\nWhen contacted, he elaborated on another “negative effect” arising from the possibility “that the Constitutional Court can rule white in one case, black in the next, and white again in the third”.\n“Certainty of the law should be a cardinal principle for the courts,” he said, adding that “uncertainty of the law” is a “carnival that only happens in Malta.”  \nSocial aim of law on controlled rents: is it legitimate?\nThe number of rents governed by post-1995 legal provisions, which empowered owners to freely raise rents and evict tenants on expiry of private rental agreements, has been estimated at three to four per cent of households in Malta, or 6,000 to 8,000.\nThe rapid rises in property prices coupled with high demand have led this class of rents to thresholds of unaffordability for a cohort of middle earners. Stories of sudden spikes in rent pushing tenants into homelessness or miserable abodes, or to living at friends’ or relatives’ houses, have led to calls on the government to control rent prices.\nThe government has been reluctant to impose controls on prices, and in a White Paper issued last October it proposed instead a raft of measures designed to provide greater stability to tenants.\nYet price controls as such are not inherently anathema to constitutional courts. Dr Camilleri explained that the ECHR does consider “whether the law on controlled rents has a legitimate aim”, including the “social aspect” of any legislation. This applies to residential rents as well as rents of community benefit, such as town band clubs.\nThe bane for human rights courts has been the disproportion in the old laws that put the burden of social protection almost solely on property owners. The sentence of Mr Justice Mintoff extended this reasoning to the meagre increase in annual rents of the 2009 legislation.\nThe more recent legal tweakings, that made it possible for another class of old rents to go up to two per cent of the property price, raised them halfway to market levels – annual rents on the open market are typically equivalent to four to five per cent of property price.\nThe recent White Paper proposes pegging rents to property prices. This is already the case in the free market, and social campaigners are hoping for legislative parameters that provide greater financial relief to tenants.   ", "comment_count": 7, "id": 905}, {"keywords": "", "author": "", "article_body": "The National Archives are to move to a purpose-built building within Ta'Qali national park, while the old Santu Spirtu hospital, where the archives are currently housed, will become a museum of medical history, it was announced on Monday.\nA ceremony during which land was transferred to the national archives was held on Monday morning.\nPresiding over the signing were Education Minister Evarist Bartolo, Infrastructure Minister Ian Borg and Parliamentary Secretary for Planning and the Property Market Chris Agius.\nMr Bartolo said this was a step about the future because Malta's identity was formed by the memory of its historical experiences across the centuries and its exchanges with other peoples and countries. \nMr Bartolo paid tribute to former Nationalist MP Michael Bonnici, who passed away recently, and who had been heavily involved in voluntary work at the archives.\nMr Borg said this would be the first time that the national archives would have appropriate facilities for the conservation of their precious documents.\n ", "comment_count": 6, "id": 906}, {"keywords": "", "author": "", "article_body": "A drunken man tried to get into a car which was not his, ended up in a police cell after arguing with officers and resisting arrest on Sunday afternoon. \nPaul Spiteri, 40 of Qrendi apparently had a drink too much when meeting friends at Pieta’ and then tried to get into somebody else's car, thinking it was his own.  \nThe police were alerted about a stranger who was attempting to break into a car. The arrival of the officers sparked a commotion, with Mr Spiteri having allegedly violently resisted arrest, threatening a police constable, causing him slight injuries and refusing to obey legitimate orders.\nMr Siteri admitted his wrongdoing upon his arraignment on Monday, also pleading guilty to breaching the peace and being drunk in public.\nUpon a request by defence lawyer Franco Debono, Magistrate Doreen Clarke, adjourned the case to next week for the hearing of evidence and submissions on punishment.\nMr Spiteri was granted bail against a personal guarantee of €2000 and an order to sign the bail book on Thursday.\nInspector Stacy Attard prosecuted.", "comment_count": 0, "id": 907}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two suspected thieves who were arrested on Saturday after a chase on rooftops in Fgura, were arraigned on Monday and denied bail.\nValdas Martinaitus, a 28-year old Lithuanian and Kakhaber Lomtadze, 41, from Georgia, both unemployed, were arrested by the police after residents noted their suspicious movements on rooftops and filmed them.\nValdas Martinaitus was also noted and photographed in Pembroke.\nThey fled when police arrived, with one of them suffering fractures when he jumped from a height in a desperate bid to escape arrest.\nThe man was wheeled into the courtroom, barefoot in a wheelchair and wearing tattered clothes while his alleged small-statured companion walked in with his feet in forensic slippers.\nThe two pleaded not guilty to participating in criminal activity and money laundering, as well as to last Saturday’s attempted theft which had led to their arrest.\nThe younger of the pair was separately charged with three other instances of attempted theft in May at Pembroke and Birkirkara, as well as three thefts at Pembroke and Birzebbugia, the earliest dating back to February.\nThese thefts involved cash and jewellery.\nThe two were remanded in custody. No bail was requested.\nInspectors Saviour Baldacchino, Shawn Pawney and Paul Camilleri prosecuted.\nLawyer Martha Mifsud was legal aid counsel.", "comment_count": 0, "id": 908}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The current system of judicial appointments is superior to the practice prevalent before 2016, and although there is still room for improvement, such a highly important and delicate matter called for caution and prudence, the president of the Chamber of Advocates, Louis de Gabriele said on Monday.\nHe spoke on the manner of judicial appointments when delivering his address during the inaugural ceremony of Madam Justice Joanne Vella Cuschieri.\nJudicial appointments have recently been a subject of political controversy, with the NGO Repubblika having gone so far as to seek court action to block new appointments, and later to block the assignment of duties to new members of the judiciary, pending implementation of recommendations by the Venice Commission on the Rule of Law.\nDr de Gabriele pointed out that the final discretion still rested with the executive, and it was mainly up to politicians to address the situation through wider consultation with all those who could contribute towards a solution in line with the expectations of a modern society.\nThe independence and impartiality of the judiciary was not solely related to their appointment but also to the rigorous and intellectual integrity of every member called to the bench, irrespective of any role he or she may have occupied previously, Dr de Gabriele said.\nAs for the newly appointed judge, the Chamber President praised her efficiency and dedication in the handling of the caseload as a magistrate, especially in the Gozo Courts where she was known to deliver judgments on their due date and had even managed to resolve a case that had been pending for 40 years.\nThe promotion of magistrates to judges augured well, Dr de Gabriele continued, since their experience in the lower courts eased their transition from lawyers to members of the judiciary.\n“You have made this transition successfully,” the Chamber president said.\nIn an emotional speech, tracing her upbringing and years of academic and practical formation as a lawyer, Madam Justice Vella Cuschieri heaped praise upon relatives, friends and colleagues who had contributed in varying ways to her success, bringing tears to her parents’ eyes as they sat inside the packed courtroom.\nShe also thanked the Judicial Appointments Board who had nominated her to the bench of Judges.\nHaving regularly served on the Courts in Gozo, Madam Justice Vella Cuschieri made reference to the current pitiful state of the building housing the Gozo law courts, saying officials worked in damp, stuffy and overcrowded conditions.\nIn spite of this, they continued to prove themselves as a motivated team, the judge said, calling upon authorities to address the need for a new building to house the courts in Gozo.", "comment_count": 0, "id": 909}, {"keywords": "", "author": "", "article_body": "Nationalist Party treasurer David Camilleri has resigned with immediate effect, after finding himself embroiled in an internal power struggle within the party.\nIn a lengthy social media post, Mr Camilleri said he was quitting the role to shoulder his burden of responsibility for the weekend’s tumultuous events, but raised the possibility that factions within the party had intentionally engineering the situation to cause the PN maximum damage.\nMr Camilleri was one of the 82 PN executive committee members who voted on Saturday to decide whether Jean Pierre Debono or Kevin Cutajar should assume a seat in parliament vacated by David Stellini.\nFactions within the party, including outgoing executive president Mark Anthony Sammut, have since argued that Mr Camilleri should never have been given a vote during that ballot, as the PN statute precluded him from having one.\nMr Sammut, PN MP Jason Azzopardi and others have suggested Mr Debono – one of the candidates for the vacated seat – was responsible for including Mr Camilleri on the list.\nEither nobody realised that David Stellini and I should not have voted, or else they realised but stayed quiet.\nMr Debono has denied that claim but also announced that he will not take his oath of office, which was originally scheduled for Monday. \n'Nobody objected to me voting' \nIn a lengthy post on social media, Mr Camilleri said that he was not aware that he should not have voted, and that nobody present during Saturday’s meeting had at any point objected to him doing so.\n“When I said that I would not be declaring how I would vote, none of the 81 other members present said that I did not have a vote,” he wrote.\n\nMr Camilleri said that both candidates for Mr Stellini’s seat had called him ahead of the vote to canvass his vote.\n“This shows that both candidates had a list of eligible voters ahead of the election, and this included my name and I presume that of Mr Stellini,” he wrote.\n“Either nobody realised that David Stellini and I should not have voted, which proves there was no malicious intent,” Mr Camilleri argued, “or else people realised but stayed quiet, to create this situation after the vote to harm the party”.\nMr Camilleri again insisted that his vote had remained secret and called for the ballot to be retaken.\nHe offered his resignation with immediate effect, saying that one could argue that he should have known he was not eligible to vote, but offered party leader Adrian Delia his loyalty and support.", "comment_count": 31, "id": 910}, {"keywords": "", "author": "Sarah Carabott", "article_body": "\"Foetus\" should be included in the definition of ‘minor’ within the Child Protection Act, according to the Opposition.\nSpeaking in Parliament during a discussion concerning financial estimates of the Embryo Protection Authority for this year, Nationalist Party MP Claudio Grech said the government had an opportunity to reveal its true intentions.\nThe Child Protection Act would soon start being discussed and the inclusion of \"foetus\" (tarbija fil-ġuf) in the definition would send a strong signal that the unborn deserved protection as human beings.\nThe Child Protection Act has been promised since 2014. Social workers and foster carers are calling for its immediate enactment.\nHe also called for the strengthening of social services, whether provided by NGOs or the government, so that pregnant women who were facing difficult times and considering abortion, were supported to pull through.\nMr Grech meanwhile urged for a balance between the right to life, which he said was supreme, and supporting prospective parents with infertility issues.\nHe referred to the Embryo Protection Act as introduced in 2012, which he said had reached an ethical balance between the needs of prospective parents and the treatment of embryos.\nHundreds had been born through that law. However, he questioned how while the birth rate had remained the same, there had been a drop of 20 per cent in IVF procedures at public and private clinics.\nAlso addressing Parliament, PN MP Claudette Buttigieg called for more sensitivity towards couples who did not want to have children and those who could not have children.\nThere were some who were not aware that their relatives had conceived through IVF because of the stigma, she said, calling for more psychological support for couples going through the process. \n'All government members are against abortion'\nEarlier, Labour Party MP Etienne Grech said that all government members were against abortion.\nDr Grech was providing figures about IVF treatment throughout 2018, which he said was most often the last hope for couples suffering infertility.\nIn all, there were 246 cycles, 56 of which resulted in pregnancies (a 23 per cent success rate).\nHe added that research on embryos, genetic modification and surrogacy were still illegal, however, there was room for discussion about the prospective legislation of surrogacy. Discussion needed about surrogacy to support couples who cannot benefit from IVF procedures\n'Need of debate about surrogacy'\nPL MP Rosianne Cutajar meanwhile called for a discussion about the introduction of surrogacy, in order to support couples who could not benefit from IVF procedures.\n“The reality is that there are still couples who are finding it difficult to become parents despite the amendments.\n“This means that the government still hasn’t done justice to all, and there are couples who go abroad to undergo treatment that is not available in Malta,” she said.\nThe figures were encouraging but they were not enough. Infertility was a condition, and just like any other condition, people should receive treatment for it, Ms Cutajar noted.\nThe Labour MP said she looked forward to a mature discussion about amendments that would allow preimplantation genetic diagnosis (PGD is a procedure used prior to implantation to help identify genetic defects within embryos) and surrogacy).\n\n\n\n\nEvery year for the past few years there have been more than 200 IVF cycles, Health Minister Chris Fearne said in Parliament.\nData was only available from 2013 onwards, when the authority was set up. A total of 309 babies have been born since.\nA total of 170 of these were born since 2015, when the service started being provided for free at Mater Dei Hospital.\nMeanwhile, following last year’s amendments, 61 couples who had used up all cycles offered by the government (gone through three unsuccessful ones) were now entitled to another cycle.\nThe minister added that two couples who had had their embryos frozen abroad had brought them over to Malta, while another 11 couples had had their embryos frozen in Malta.\n“All these couples have expressed their wish to use them, contrary to the initial fear that we will have large numbers of embryos that will remain frozen forever.”\nThere are also a small number of lesbian couples who are on the waiting list for IVF treatment.\nThese couples need gamete donation, and discussions with experts abroad are under way to see how gamete can be made available. ", "comment_count": 28, "id": 911}, {"keywords": "", "author": "", "article_body": "Updated 2.40pm with Delia's comments\nJean Pierre Debono will not be assuming a PN parliamentary seat, following allegations that he was involved in voting list manipulation ahead of the ballot to fill David Stellini’s vacated seat.\nIn a letter to PN leader Adrian Delia, Mr Debono vehemently denied the accusations levelled at him but said that he would not be taking his parliamentary oath because of the attempt “by the usual people to attack the party”.\n“I do not want to be complicit in allowing a transparent and democratic process be used as an excuse to divide the party,” he wrote in his letter.\nHe slammed “certain people” within the party, without naming them, and accused them of being envious and desperate for power.\nRead: MŻPN and PN's professionals call for party to sort out 'untenable' situation\nContentious co-option vote\nMr Debono was due to be co-opted into parliament on Monday to take up a seat vacated by David Stellini last week, after winning an internal party ballot to fill the seat last Saturday.\nThat ballot had split the party down the middle and enraged Gozitan PN members, who felt Mr Stellini’s 13th district seat should be filled by another candidate from the district.\nOn Sunday evening, the PN’s Gozo regional committee said that it was considering legal action if the PN leadership did not nullify the secret ballot, arguing that Mr Stellini should not have been allowed to vote.  \nLater that evening, outgoing executive committee president Mark Anthony Sammut accused Mr Debono of having allowed two ineligible voters to take part in the ballot. As the PN’s political coordinator, Mr Debono was the person responsible for compiling voting lists, Mr Sammut alleged.\nOn Monday morning, two Gozitan voters filed a judicial protest calling on the PN to cancel the co-option process and restart it.\n'Campaign to discredit you'\nIn his letter, Mr Debono argued that the allegations were aimed at discrediting party leader Adrian Delia. \nMr Debono had in 2017 given up his 7th district seat to allow Dr Delia to become an MP, following his election as PN leader. \n\"It is clearer than ever before that the same group of people of did not accept your democratic election as party leader are now trying to attack and discredit me personally, because I gave up my parliamentary seat to allow you to be named Opposition leader,\" he wrote. \nHe vehemently denied having struck any sort of secret deal with Dr Delia to ensure he was handed Mr Stellini's vacated seat, or allegations that he had been financially compensated for having handed Dr Delia his seat. \n\"Anybody could have contested this co-option,\" he said. \nMr Debono pledged loyalty to Dr Delia, saying he was offering his \"unconditional\" support to the party provided it got rid of toxic elements within it. \n'Nothing to do with voting list'\nHe also denied having done anything to manipulate voting lists for Saturday's ballot, reiterating a denial he had first made on Sunday night on social media. \n\"I had absolutely nothing to do with this election's processes for obvious reasons, and I took no decision of any sort,\" he wrote. \n\"Until May 30 David Stellini was still an MP and his resignation became effective on the evening of Friday, May 31,\" he added. \nPN officials, including Mr Sammut and MP Jason Azzopardi, had on Sunday night published a screenshot of a Microsoft Word document which they alleged showed that Mr Debono was the last person to have modified a list of executive committee voters. The last modification to the document happened on the morning on May 30. \n\nDelia seeking legal advice \nSpeaking on Times Talk, Dr Delia said he had asked for legal advice to propose a way forward for the executive.\nHe said he had been made aware of the fact that the party statute might actually not have the power to decide from which district the new MP should be co-opted from.\nAsked to comment on claims that there was a secret deal between Dr Delia and Mr Debono to be eventually co-opted to parliament, the PN leader replied: \"Absolutely not\". \n‹›-+Page:  /", "comment_count": 68, "id": 912}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Updated 6.55pm with Attorney General's reaction below.\nA Magistrates’ Court voiced serious concerns about “management of cases by the Attorney General’s Office” after the records of the Għaxaq double murder compilation reached court on the very morning of next scheduled hearing.\nThis message was expressed on Monday morning when Joseph Bonnici, 38, was back in court in the ongoing compilation over the alleged murder of his mother and sister in March.\nYet, the planned programme for Monday's hearing was somewhat hindered by the fact that the prosecution could not summon certain witnesses once the records of the compilation had only reached court from the AG’s Office at 9.00am on Monday.\nSuch a delay raised “serious questions about the management of cases by the AG’s Office,” said Magistrate Joe Mifsud, pointing out that a copy of the note of referral could at least be forwarded to the Court Deputy so that the prosecution could summon its witnesses in due time for the next hearing.\nThe Court ordered that a copy of this minute be communicated to Dr Peter Grech and the Justice Minister.\nRead: 'It's not a pretty sight,' man accused of double murder told investigators\nAs the session proceeded, forensic expert Dr Marisa Cassar exhibited the mallet allegedly used by the accused after shooting his alleged victims.\nAlthough not visible in a large white paper sack, the weapon appeared to have a long handle as the expert handed over the exhibit and reported that she had carried out a comparative analysis of DNA samples with the profiles of the alleged murderer and his two victims.\nAnother expert to testify on Monday was Martin Bajada, tasked with downloading and analysing CCTV footage from various sites linked to the murder.\nAmong these was footage from the office where the accused’s sister used to work, showing Mr Bonnici who had turned up on March 26 checking whether Angele had reported for work.\nOther footage from the victims’ home had captured mother and daughter going about the house shortly before they allegedly met their fate.\nThey were last seen on March 26 between 20:54 and 21:10, Dr Bajada explained, adding that there was no footage between 21:23 and 22:04 of the following day.\nOther footage from the Wasteserv Civic Amenity Site had recorded the accused’s car entering the site for some four or five minutes.\nDuring Monday’s hearing reference was made to an application filed on behalf of the accused’s girlfriend who, following the murder, had suddenly found herself out of the home she had shared with her partner for the past 10 years.\nThe court was informed that the woman had meanwhile been offered accommodation at a friend’s home but was seeking court authorisation to retrieve her personal belongings from the Għaxaq home.\nThe Court adjourned the case to Wednesday to hear witnesses who were meant to testify on Monday.\nLawyers Franco Debono and Marion Camilleri are defence counsel.\nAttorney General's reaction\nIn a reaction to the court's remarks, the Attorney General’s Office said that it first received the documents of the case on April 29.\nAfter a time extension granted by the Criminal Court at the request of the Office, the Office had up to June 12 to examine the documents and issue a bill of indictment or otherwise.\nIn order not to waste time, because it knew of the sitting scheduled for Monday, the Office chose not to keep the documents up to June 12 but sent them back to the court so that the sitting could be held.\nThe court was informed by e-mail to the deputy registrar on May 29 that despite the extension, the Office was sending the documents back so that the sitting could be held as scheduled.\n“It is clear, therefore, that the Office of the Attorney General cooperated with the court, and actually did more than required by law in the circumstances. It is absolutely not the case that it was responsible for any mismanagement or delays,” the Office said.", "comment_count": 0, "id": 913}, {"keywords": "", "author": "Jacob Borg", "article_body": "A number of PN MPs on Monday acknowledged the \"sad situation\" within the party, but all of them stopped short of calling for Opposition leader Adrian Delia's outright resignation.\nJason Azzopardi, who has had a very public falling out with the PN leader, said the party deserved better. \nDr Azzopardi did not demand the PN leader's resignation, but instead repeated calls for him to put his leadership to the test through a confidence vote before the general council. \nClaudette Buttigieg told the Times of Malta she did not know what the solution to the current impasse was. \n\"I wish I could answer. This is a very sad time for all of us, very sad. It is heartbreaking to see what is going on\", she said. \nFormer deputy leader Beppe Fenech Adami said the PN was going through a very difficult moment. \n\nDr Fenech Adami said everyone had to stand up to be counted in the manner they thought best. \n\"The party should come first and foremost before anything else\", the MP said. \nHe stopped short of saying whether Dr Delia should resign, instead insisting everyone should carry their responsibilities. \nFormer PN leadership contestant Chris Said did not write off the party moving forward with Dr Delia as its leader. \nThe Gozitan MP on Saturday expressed his dismay at the way Kevin Cutajar was shunted aside in the contest to fill the seat vacated by fellow Gozitan David Stellini. \nPN deputy leader David Agius declined to comment. \n ", "comment_count": 99, "id": 914}, {"keywords": "", "author": "", "article_body": "The Nationalist Party has been served with a legal notice that it will be sued if it does not cancel the vote to co-opt Jean Pierre Debono into parliament.\nIn a judicial protest presented on Monday morning, two Gozitan voters said they would be considering a civil lawsuit if the party did not cancel the vote to elect Mr Debono and order a retake.\nMariella Mercieca and Daniel Cilia argued that the PN had violated electoral law, the spirit of the Constitution and its own party statute in the way it ran Saturday’s vote.\nMr Debono narrowly won a vote among PN executive committee members on Saturday to replace David Stellini in parliament, beating Gozitan lawyer Kevin Cutajar to the seat by just two votes.\nA parliamentary motion to officially co-opt Mr Debono was scheduled for Monday, but sources told Times of Malta late on Sunday evening that the PN would be postponing it following an internal party rebellion.\nPolitical operative Mr Debono has been accused by fellow party members of meddling with the list of eligible voters to ensure at least two ineligible people could cast a vote.\nMr Debono serves as the PN’s political coordinator and in that role is responsible for handling executive committee attendance records and voting lists, outgoing committee president Mark Anthony Sammut wrote on Sunday evening.\n“The conflict of interest is clear,” he added.\n\nMr Sammut alleged that both Mr Stellini as well as party treasurer David Camilleri should not have been granted a vote in Saturday’s ballot.\nThe judicial protest filed on Monday goes one step further, arguing that both Mr Debono and his wife, MP Kristy Debono, should also have been barred from voting, to respect the PN’s statute, code of ethics and “general principles about conflict of interest”.\nSaturday’s vote, the protest argues, also violated Maltese electoral law and went against the spirit of the Constitution.\nThe PN’s Gozo regional committee had on Saturday also argued that the party was in breach of the law, citing article 22 of the General Elections Act’s 13th schedule.\nThat schedule deals with co-opting rules and stipulates that when filling a vacated parliamentary seat, “regard shall be had to the representation as nearly as may be of the interests and opinions represented and held by the vacating member”.\nWatch: 'It's a very sad situation' - PN MPs stop short of calling for Delia to quit\nMr Debono, who contested the 2017 general election on the 7th district, would not be representing 13th district voters disenfranchised by Mr Stellini’s resignation, the Gozo committee had argued.\n The judicial protest was signed by lawyer Damian Cassar and lawyer Amadeus Cachia from Franco Debono and Associates.", "comment_count": 50, "id": 915}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Social workers and foster carers are urging the government to enact without any delay the Child Protection Act, promised since 2014.\nThe Maltese Association of Social Workers, which has contributed to the formulation of the proposed law that is in its final enactment stages, urged the government to conclude it before the summer recess.\nThis would allow the actual implementation of crucial policies and the setting up of services to commence soonest, according to the association.\nIt was commenting on the occasion of the international Child Protection Day, thanking all professionals, foster carers and organisations that ensured children’s care within a safe environment.\nRead: ‘New measures on their own may not curb abuse’\nIt stressed the importance that all children were given opportunities whereby they could thrive to grow into adults that positively contributed to society.\nFoster care is the natural option for these babies, children and youths as it ensures the much-needed stability\nAlso marking Child Protection Day, the National Foster Care Association Malta called on the government to finalise the process of the new protection law.\nIt called for training in relation to the implementation of and repercussions ensuing from the new law in order to ensure the protection of the most vulnerable members of society.\nThe Child Protection Bill was tabled in Parliament by President Emeritus Marie-Louise Coleiro Preca, then family minister. The draft law was revised by her successor, Michael Farrugia, and a new Bill was approved in 2017.\nHowever, this law never came into force and the current ministry, headed by Michael Falzon, sent it back to the drawing board.\nA new draft of the law was presented in January and this final version has been commended for finally allowing foster carers to adopt minors who have been under their custody for more than five years.\nRead: Still too much power for minister, child experts say\nLast weekend, the National Foster Care Association Malta flagged the importance of bringing up children within a family that cared for them as this provided kids with a sense of security and stability.\n“Unfortunately, in Malta there are a number of children who cannot live with their biological parents and who are still not living with an alternative family.\n“Foster care is the natural option for these babies, children and youths as it ensures the much-needed stability,” it commented.\nThe association has urged the government to invest more in this sector and to increase the number of available foster care placements.\nIt also called for the strengthening of existing services and the creation of others to support carers in their commitment to look after children.", "comment_count": 2, "id": 916}, {"keywords": "", "author": "", "article_body": "Updated at 12.15pm\nThe Nationalist Party's own youth movement on Monday called for party leadership to shoulder responsibility for the \"untenable\" situation the PN had fallen into. \n\"Enough is enough,\" the MŻPN said in a Facebook post which continued to pile pressure on party leader Adrian Delia and his administration. \nTheir Facebook post was echoed some hours later by the PN's Forum for Professionals, which in a Facebook post of its own said that it was demanding that \"political responsibility be shouldered by all those who are refusing to view the clear electoral result as a damning one\". \nMŻPN calls\n\"The current situation is untenable, and represents a new low,\" the MŻPN had said.\n\"Enough is enough, and we demand that political responsibility be shouldered - at least out of respect for the thousands of voters and volunteers who gave their time, faith and effort - by those involved in the mess emanating from last Saturday’s vote in the Executive Committee,\" it continued in a Facebook post.\nThe statement came hours after a motion to co-opt Jean Pierre Debono into parliament was postponed, as the Nationalist Party leadership scrambled to contain fallout from a contentious vote to have Mr Debono replace outgoing MP David Stellini.We must stand up to be counted - not just when the going is easy\nIt also comes after leader Adrian Delia blamed the PN “establishment” for putting spokes in the wheels and after he issued a stern warning to his most vociferous internal critics.\n\nThe MŻPN replied: \"We have always stood out from our peers for our unwavering voice, unorthodox approach and the willingness to break ranks with whatever and whoever is labelled as 'The Establishment'.\" \nThe youth movement said it would analyse the current situation during a meeting of its own this week, and a full report and analysis shall be passed on internally.\n\"We must stand up to be counted - not just when the going is easy, but especially and more importantly, when the going gets tough.\"\n'Not business as usual' - Forum for Professionals\nThe PN's Forum for Professionals was also critical of the party leadership, saying that the party could not act like it was business as usual \"when it is clearly not the case\". \nIn their Facebook post, the Forum also called for action against anyone who \"may have contributed to alleged fraudulent wrongdoing\" in a co-option vote to fill a vacant MP seat. \n\nPN political coordinator Jean Pierre Debono narrowly won a vote to fill the vacant seat, beating Gozo lawyer Kevin Cutajar to it. \nMr Debono has however been accused of allowing ineligible people to take part in the executive committee vote, and Gozitan voters have filed a judicial protest threatening a civil lawsuit if the vote is not nullified. \n'Enough is enough' \nMP and deputy speaker Claudette Buttigieg also took to Facebook to express her dismay at the state of her party.\nWatch: 'Very sad situation': MPs tread lightly when asked about Delia\n\"Enough is enough,\" she wrote. \"No more lies, deceit and shady behaviour. We deserve better. PN deserves better. Malta deserves better\". \n\nThe PN is reeling from its worst electoral result in history after the European Parliament and local council elections prompted demands for the PN administration to step aside.\n\n ", "comment_count": 100, "id": 917}, {"keywords": "", "author": "Jacob Borg", "article_body": "The EU’s banking regulator had “serious concerns” on the adequacy and effectiveness of the Malta Financial Services Authority’s supervision of financial institutions but lacked the evidence that EU laws were breached.\nThis emerged from the European Banking Authority’s annual report, which gives an overview of its 2018 inquiries into the MFSA and the Financial Intelligence Analysis Unit.\nThe preliminary inquiries were sparked off by concerns about the supervision of the now defunct Ta’ Xbiex-based Pilatus Bank.\nThe inquiries found that the FIAU had breached EU anti-money laundering laws in 2016 during the course of its monitoring of the bank owned by Iranian national Seyed Ali Sadr Hasheminejad, who is facing money-laundering and sanction-busting charges in the United States.\nThe EBA says in the report that the FIAU failed to supervise effectively the “high-risk Pilatus”.\nRecommendations about how to strengthen the government’s anti-money laundering agency’s functions were issued and, since then, the unit has provided regular updates to the EBA on the progress towards implementing the recommendations, the report says.\nEU institutions have frequently been criticised for unfairly picking on Malta given the relatively small scale of Pilatus Bank’s operations when taken in the European context.\nThe EBA’s report noted that preliminary inquiries about potential breaches of EU law by supervisory authorities in Denmark, Estonia and Latvia were also opened in 2018.\nConcerns about the MFSA’s supervision were raised by the International Monetary Fund in a March report.\nIt said the MFSA had the supervisory authority to carry out its tasks but the necessary preconditions for operational independence were not all met.\nThe government has said steps were taken to address these points.\nFinance Minister Edward Scicluna has insisted the government was working relentlessly on improving Malta’s anti-money laundering supervision.\nResponsibility for the MFSA was placed under the Office of the Prime Minister’s control after the 2017 election.\nA draft Council of Europe report noted that the Office of the Prime Minister had taken over responsibility for various areas of activity that presented particular risks of money laundering, including online gaming, investment migration and regulation of financial services, among them cryptocurrencies.", "comment_count": 63, "id": 918}]