[{"keywords": "", "author": "Edwina Brincat", "article_body": "A young mother convicted of having conspired to fraudently collect money for Dar tal-Providenza had her conviction quashed by the court of appeal on Tuesday.\nGraziella Apap, 34, had been arraigned along with her alleged partner in crime, Joseph Meilak, and both were convicted of having tricked 34 people to hand them money in aid of the home for people with disabilities.\nMs Apap had been implicated by Mr Meilak, who had gone door-to-door collecting money, allegedly on her behest.  \nMr Meilak had pleaded guilty and landed a 4-year jail term. Ms Apap had also landed a 4-year jail term but had filed an appeal.\nThe Court of Criminal Appeal presided over by Madam Justice Consuelo Scerri Herrera, upheld a request by her lawyers for the removal of statements made by Mr Meilak and incriminating her at a time when judgment had not yet been delivered.\nAs for the remaining testimony by Mr Meilak, the court noted that his criminal record spoke for itself, shedding light upon his ‘unruly character’ and calling for great caution in evaluating it.\nIndeed, Mr Meilak had testified in a rather confusing manner as to whether he had been prodded to commit the fraud by the woman or whether he had undertaken the scheme in reaction to her repeated demands for cash, the court said. \nA third party who had been arrested together with Mr Meilak and who had claimed that Mr Meilak was constantly on the phone with “Gra,” had never been called to testify, a serious shortcoming by the prosecution, the court said.\nReceipts issued on behalf of the Dar tal-Providenza, found at Ms Apap’s home could possibly have been put there by Mr Meilak when he stayed with her for a time.\nAll in all, the court said, the evidence did not suffice to eliminate a “lurking doubt” on account of which the court could not pronounce itself “morally convinced” that Ms Apap had “fully participated” in the fraud, although she must have had an idea as to the illicit origin of the money handed to her by Mr Meilak.\nWhilst revoking the conviction for her involvement in the conspiracy to defraud, the court declared Ms Apap guilty of handling stolen property, converting her 4-year jail term to a three-year probation period, by way of “an opportunity to truly embark upon the right path,” whilst warning that this was to be the last chance.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 1819}, {"keywords": "", "author": "", "article_body": "A man was seriously injured when he fell a height of three storeys in Marsa on Tuesday afternoon.\nThe police said they were alerted to the incident in Triq il-Ħaddiem, Marsa, at 12.45pm.\nOfficers found that a 56-year-old man resident in Birżebbuġa fell a height of around three storeys while doing some work.\nA medical team administered first aid before taking the victim to hospital.  ", "comment_count": 1, "id": 1820}, {"keywords": "", "author": "", "article_body": "Saint James Hospital in Żabbar is to relocate to a site on the outskirts of Tarxien in June, the hospital’s chairman Josie Muscat announced on Tuesday.\nSpeaking after a tour of the new hospital with Health Minister Chris Fearne, Dr Muscat said the move was the culmination of 12 years’ worth of studies and permits.\nA preliminary permit was issued in 2002.\nThe new hospital will be located 120 metres south of the Bulebel industrial estate and is bordered to the west by a two-lane country road, which is accessed from Triq tal-Barrani and to the north by Triq Hal-Tarxien.\nDr Muscat said the hospital in Żabbar will be closed down.\nHe said he wanted the hospital to be a place where people felt comfortable and relaxed.\nMr Fearne said Malta’s economic growth would continue to drive growth in private healthcare.\nHe said over the past years, the government had outsourced certain work to private hospitals and clinics.\nThe new hospital will have three floors over a site area of  6,400Ssquare metres. Its facilities will include three operating theatres, 23 outpatient consulting rooms, 24 in-patient beds, a radiology department, an Immediate Care Medical Unit, a dental clinic, facilities for physiotherapy and rehabilitation, and a unit for plastic, cosmetic surgery and dermatology.\nThe investment is in excess of €15 million.   ", "comment_count": 5, "id": 1821}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who kicked up a disturbance at a Marsalforn bar and later turned his aggressiveness upon four police officers, threatening to kill them “one by one,” was jailed and fined after being found guilty by a court in Gozo.\nAbdiqani Omar Abdillahi, a 28-year old Somali man residing in Gozo, was arrested after the incident last December during which he had pointed a knife seven times at another man’s chest.\nThe man, evidently under the influence of drink, had put up a struggle when approached by the police. \nThe struggle continued in the police car as he was taken to Victoria police station, with the police having to make two stops when Mr Abdillahi became excessively aggressive, even attempting to bite one of the officers and threatening to kill all four of them “one by one.”\nAt one point Mr Abdillahi had to be tasered.\nHe showed no signs of letting up at the police station, manifesting an aggressiveness “such as I had never witnessed,” one sergeant had claimed.\nMr Abdillahi was charged with having violently resisted arrest, threatened the officers, refused to obey their legitimate orders, possessed an unlicensed weapon, disturbing the residents, having been drunk in public as well as relapsing.\nThe man against whom the accused had pointed his knife, testified how Mr Abdillahi had threatened him after his demand “for certain items” had been turned down.\nMagistrate Joseph Mifsud observed that although at the time of the incident the accused had been drunk and his behaviour had been rendered “more aggressive and violent” by the influence of alcohol, he was “conscious of what he was doing and therefore responsible for the natural consequences of his acts.”\nHe therefore declared Mr Abdillahi guilty, handing him a one-year effective jail term and a €2,000 fine.\nThe court finally remarked that the accused, having wasted many previous chances to “embark upon the right path,” could not plead drunkenness as an excuse for doing whatever he pleased, at the risk of history repeating itself.", "comment_count": 0, "id": 1822}, {"keywords": "", "author": "Denise Grech ", "article_body": "A group of 20 migrants left for Portugal on Tuesday after being stranded in Malta for over a month.\nTheir departure was part of a redistribution agreement reached by Malta with several EU countries after 49 migrants were brought to Malta by two rescue ships, and another 249 were rescued by the AFM in late December and early January.\n\n\n\nGermany, France, Ireland, Romania, Luxembourg, the Netherlands, Italy and Portugal had agreed to the relocation agreement after a standoff which saw the NGO rescue ships Sea Watch and Sea Eye sheltering off Malta in rough seas for 19 days.\n \n \n ", "comment_count": 0, "id": 1823}, {"keywords": "", "author": "", "article_body": "A woman was taken to hospital for treatment after she was involved in a three-car crash in the Regional Road tunnels, St Julian's on Tuesday.\nThe 21-year-old Mellieħa woman was driving a Toyota Vitz in the north-bound tunnel when the crash happened, at around 2.20pm.\nAn 18-year-old young man from Pembroke driving a Mini Cooper and an Msida man, 34, behind the wheel of a Renault Megane were also involved in the crash.\nBoth those drivers were unhurt. \nThe crash led to significant traffic tailback on the Regional Road, until police officers cleared the scene.", "comment_count": 0, "id": 1824}, {"keywords": "", "author": "Denise Grech ", "article_body": "Catherine Cutajar was an elderly maid living with her employers, when a freak storm ended her life brutally and suddenly.\nThe Tabone family of seven escaped unscathed by jumping through a window on the ground floor, but Ms Cutajar was killed when the three floors of the Sliema home she was living in collapsed.\nShe was found dead under the rubble close to the front door by firefighters. The family was devastated. \nMs Cutajar was one of the victims of an unexpected storm that rampaged the country in October of 1982.\nAll she could remember was hearing a terrifying noise and 'being repeatedly hit by falling stones'\nThe storm, which saw winds of up to 133km/h - the same speed as the storm that roared across Malta earlier this week - saw ceilings collapsing and lives ruined.\nThree other victims - a couple and a young man from Ħamrun - were also killed in the storm. The bedroom of 47-year-old Tony Bianco and his wife, 51-year-old Carmela, caved in, leaving their four children to escape the rubbles of their home.\nChaos reigned on that fateful October night, with many fending for themselves as firefighters and authorities struggled to keep up with emergency calls coming in.\nWatch: 'We lost everything' - two separate eateries gobbled up by the storm\nA mother who had spoken to Times of Malta at the time said she ran to the bedroom of her child, only to find out his cot was about to be crushed.\nAll she could remember was hearing a terrifying noise and \"being repeatedly hit by falling stones\", she confessed. Her house ended up being destroyed by the storm, but her baby was saved just in time and only ended up suffering slight bruises.\nThe storm had caused destruction, leaving 19 injured and scores narrowly escaping their life, as the country’s infrastructure struggled to handle the stormy weather.\n\n\"Freak storm\" in 1979 left English tourist missing \nAnother unexpected storm in 1979 had left many missing and others forced to abandon their vehicles, swept away by floodwaters.\n55-year-old Vivienne Huntingford died after being trapped when waters flooded the basement of her house. Another two men also died.\nOther people were reported to have been injured in near misses, after their cars were swept away by currents at Birkirkara, Msida, Marsa and other low-lying areas.\nThe Metereological Office at the time had reported 68.2 mm of rain had been recorded in the span of a few hours.\nThe incident had caused extensive damage, and around 30 people were isolated by deep water at the Marsa Sports Club and had to be rescued by helicopters. The first person to be flown out was an expectant mother.\nTransport in various parts of the island came to a standstill as hundreds of cars were stranded on the roads.", "comment_count": 26, "id": 1825}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A self-confessed thief who raided 10 service stations over a three-month thieving rampage, was jailed for seven years after the court took note of several opportunities the accused had already cast aside and wasted.\nMatthew Portelli, 32, was targeted by criminal prosecution as one of a gang of thieves who, over a three-month span back in 2011, had targeted 10 service stations, a tools store and two vehicles in various localities around Malta.\nThe gang were also allegedly behind an arson attack upon one of the stolen vehicles, a Ford Transit, which had been employed in one of their raids and which was subsequently set on fire in Wied is-Sewda, Qormi.\nThe culprits were ultimately arrested and prosecuted, with proceedings against Mr Portelli being assigned in November 2018 to another Magistrates’ Court.\nDuring a hearing in January, the accused had registered an admission to all the charges, running into some six pages, save for three which specifically linked him to the arson attack on the stolen van, the theft of the registration plates fixed to the van as well the intention to destroy the material traces of a crime.\nIn the course of proceedings, another member of the gang, Carmel Hartley, testified that neither he nor Mr Portelli had anything to do with the arson. “That was a decision taken by Glen Debattista. [The latter] and Ryan had set it on fire… We were present and saw him sprinkle petrol. It was at that moment that we left,” the man had explained.\nThe court, presided over by magistrate Donatella Frendo Dimech, observed that there was no reason why it should not believe the version of the man who “had not hesitated when shouldering responsibility nor when implicating the accused”.\nMoreover, this version had been confirmed by the Debattista duo, with Ryan claiming that although “the team always stuck together,” he had been the one to set the van on fire.\nThe court also observed that no proof had been put forward linking the accused to preparatory acts leading to the arson.\n“Nowhere was there proof of any common design linking the accused to the perpetrators of the crime,” noted the court, further pointing out that there had been no circumstantial evidence implicating him in that particular crime.\nWhen meting out punishment, the court took note of various factors, both against as well as in favour of the accused, observing, in the first place, how the man had gone on a thieving rampage over a three-month span, targeting petrol stations and vehicles.\nThe court also noted that the accused manifested an unruly character and had wasted several opportunities for reform, all chances being “cast aside and dwindling into nothing”.\nIndeed, pending proceedings, the man had faced fresh arraignment over separate theft-related charges, thus appearing to confirm the findings of a social enquiry report which indicated that he showed no sign of reform.\nOn the other hand, the court took note of the intervals when no progress had been registered when proceedings were underway before a different court.\nIt was also observed that the victims had since been reimbursed by insurance firms.\nIn the light of all this and upon the accused’s own admission, registered “at the very last stages of the proceedings”, the court declared him guilty and condemned him to a seven-year effective jail term.\nThe court ordered the forfeiture of his €5,000 bail bond, making him also fork out €1,662.70 by way of court expert expenses.", "comment_count": 0, "id": 1826}, {"keywords": "", "author": "", "article_body": "The Labour government’s economic model to increase the population without any plan was having a bad effect on several sectors including the environment, transport, infrastructure and waste, PN deputy leader David Agius said.\nSpeaking during the presentation of the party’s proposals for the environment, Mr Agius said the State of the Environment report confirmed what the Nationalist Party had insisted upon in the environmental sector and showed that, while progress had been registered in biodiversity, other environmental sectors were in a bad state.\nEnvironment spokesman Jason Azzopardi said the government did not have a long-term plan for the environment and this was being clearly seen in the negative results being acquired by the country.\nMalta, he said, had been described by Euronews as \"the dirty man of Europe\" and the most recent statistics showed that the country was the worst in Europe in waste recycling and the fourth from the bottom in air quality. This was apart from the increase in the number of cars on the road.\nMEP candidate Michael Briguglio said the PN would soon be announcing a series of concrete proposals in specific environmental sectors such as transport, pollution, land development and waste management.\nThe Nationalist Party would remain the voice of reason on environmental matters and through its MEPs and local councillors would promote a policy based on sustainable development.\nThe PN’s proposals were based on investment and better enforcement by the government, a greater involvement of the community, having an ecological public sector and ensuring the European Union catered for the needs of small islands.\nNew businesses would be given incentives in the circular economy and a fund would be set up for ecological innovations.\nResidents would be given incentives to take part in ecological activities and academic opportunities at tertiary level for research, education and publications would be increased.\nState buildings would be transformed to function in a carbonless manner and public sector development projects would have to be ecological.\nThere would also be better monitoring and reporting of environmental standards.", "comment_count": 24, "id": 1827}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "Two Maltese criminal investigations into the racket of tuna illegally farmed in Malta are still in the early stages and a third ‘audit’ by the European Commission remains in progress, The Sunday Times of Malta is informed.\nThe Maltese probes – parallel investigations by the police and Magistrate Gabriella Vella, who according to sources travelled to Madrid last week – were triggered by the findings of Operation Tarantelo, the Spanish-led investigation that also involved Europol.\nOperation Tarantelo has so far revealed that an estimated 2.5 million kilograms of tuna, worth around €12 million, was being smuggled from Malta to Spain annually. \nThe Spanish Grupo Ricardo Fuentes e Hijos owns the two outfits at the two ends of the smuggling route, according to information from the investigation: illegal tuna from Malta’s Mare Blu Farm was being supplied to another Fuentes Group fish supplier company in Spain. The tuna was then resupplied to fishmongers and other sales points throughout Europe.\nThe racket is believed to have gone on for a number of years. Spanish investigators only sniffed out the case after an outbreak of clusters of food poisoning led to investigations into the supply chain of tuna. \n“This investigation shows that illegal tuna can also be a danger to human health,” said Alessando Buzzi, a regional specialist on Bluefin tuna who works for the Worldwide Fund for Nature (WWF). “Now we have to make sure that this illegal trade is eliminated to protect not just the environment, but also consumers.”\nAlthough Operation Tarantelo pinned Mare Blu Farm, one of Malta’s five tuna farms, as the source of the illegal tuna, sources privy to the investigation by Maltese police said that another Maltese farm, whose name is being withheld, has been mentioned peripherally in the Spanish investigative report.\nCharlon Gouder, CEO of the Federation of Maltese Aquaculture Producers, maintained that none of the four tuna farms that are members of the federation – Mare Blu Farm is not a member – have been investigated.\nPolice sources said that the investigation by the Maltese police is still in its infancy.  \nMonitoring of tuna farming\nThe Sunday Times of Malta has managed to chart the modus operandi of the tuna racket.\nThe Mediterranean tuna fishery is probably the most controlled fishery in the world. Catch quotas are imposed on fishing nations around the Mediterranean, which fish for tuna either by hooks attached to surface longlines or purse seine nets that supply live fish to the tuna farms.\nWe have to make sure that this illegal trade is eliminated to protect not just the environment, but also consumers\nMonitoring takes place most intensely on the purse seiners and the transfer to the so-called ‘tuna ranches’ where tuna are fattened and eventually slaughtered. Two observers, one from the country of origin of the purse seiner and another from the country of destination for fattening, are stationed on purse seiners during fishing runs.\nAs soon as tuna is scooped in the huge nets, a report is transmitted to the European Fisheries Control Agency (EFCA), which deploys a patrol boat with inspectors on board. EFCA inspectors then monitor the tuna during transfer to carrier cages, estimating the number and total weight of tuna, inputting the information into an electronic database and tagging an electronic catch certificate.\nThe tuna is then slowly towed to the farms in the carrier cages for fattening. It usually takes weeks to reach Malta-based farms.\nThen the transfer of the fish from cages to pens is filmed and monitored by inspectors from EFCA, the European Commission, the Maltese Department of Fisheries and Aquaculture, and ICCAT (the International Commission for the Conservation of Atlantic Tuna). The estimated weight of the tuna is compared to the estimates at the point of catch, and, if any discrepancies are found, excess tuna is released back in the wild.\nThen, throughout the fattening period in the summer, department personnel also conduct inspections. This involves, among other things, random inspections by divers swimming among the tuna in the pens, estimating the number of tuna and cross-checking with relevant catch and stocking documentation. \nThis is where the department has been particularly deficient. According to a report by the National Audit Office published last year, the enforcement unit with the department is understaffed by a tally of 65 personnel. Environment Minister José Herrera talked about this in Parliament last week, maintaining that the government has been unable to fill vacancies, especially divers, and that the department is looking into outsourcing some operations. \nAsked for additional specifics, a spokesperson for Dr Herrera wrote that “the department is drawing up an action plan related to the recommendations made by NAO including that specifically related to a review of existing resources. In the meantime action will be taken to beef up staff but the process will be a dynamic one to be able to align with changes in regulations at ICCAT level.”\nNow it is also known that Mare Blu Farm allegedly got away with systematic overstocking by illegally caught tuna. The farm has a stocking quota of 3,000 tons and, if estimates of Operation Tarantelo are correct, it suggests that the farm may have been stocking an additional 2,500 tons of illegally caught tuna.\nIllegal tuna is sourced from undeclared catches. It could not be established whether Operation Tarantelo pinpointed any of the vessels involved in illegal fishing, or how the illicitly caught tuna was spirited to the farm in Malta.\nThe Japanese connection\nJapan is the chief destination market for farmed tuna, which has the right consistency of fat to meat ratio that is highly valued in sushi and sashimi. In fact around 70 per cent of tuna fattened in the Mediterranean is exported to Japan, where it fetches prices so high that Malta’s legal tuna industry now generates more than €120 million euros.\nIn the modus operandi uncovered by Operation Tarantelo, it was estimated that for almost every consignment shipped to Japan an equal amount from the illegally sourced stock was being shipped to Spain.\nThese parallel, duplicate shipments of equal quantities made use of duplicate paperwork – only the destinations were different. The certificates attached to the consignment dispatched to Japan would be genuine; photocopies of the certificates would then also provide cover for the illegally-caught and farmed tuna dispatched to Spain.\nAlthough some evidence suggests that some shipments might have been transported by seacraft to ports in France and perhaps also Italy, an unspecified proportion of shipments were put on trucks that boarded ferries of Virtu to Sicily and Grimaldi to unspecified ports, then making their way overland to their Spanish destination.\nImproved controls needed\nAlthough the WWF’s Alessando Buzzi said it was not certain at this point whether France and Italy were involved in some illegal fishing of tuna uncovered in Operation Tarantelo, or were simply waypoints along the smuggling route from Malta to Spain, the glare of the investigations is now mainly fixed on Malta.\n“A national audit in Malta showed that there are systematic deficiencies in the Department of Fisheries and Aquaculture,” Mr Buzzi said. “One of the big problems in Malta appears to be deficiencies in human resources.”\n\nSome systems of enforcement did work. It was mentioned in Parliament last May that 800 tons of tuna had been released after it was found to be in excess of the recorded catch statistics.\nA source in the fisheries department said that the tally of tuna released by the department in 2017 and 2018 now stands at 2,000 tons (including the 800 tons mentioned in Parliament). These were found to be in excess of the catch estimates at the point of transfer into the fattening cages.\nUnresolved questions remain about whether these fish might have been picked up from undeclared fishing throughout the weeks-long journey to Malta, or were simply variations between catch estimates and more accurate estimates at the point of transfer to farms.\nIn conversations with Mr Buzzi, it emerged that a ploy among an unspecified proportion of farms in the Mediterranean is to overinflate the fishes’ growth rates during fattening to account for unrealistic increases in the cumulative weight of tuna held in pens at slaughter.\n“Some farms declare growth rates of 76 per cent in three months of ranching,” he said. “This is not credible from a biological perspective. Tuna only grow by about a third of their weight at the fattening stage, and such cases are potential indicators for extra fish introduced in the cages illegally before harvesting.”\nMr Buzzi was talking generally about stratagems in tuna farms in the Mediterranean and did not specifically implicate any of the Maltese tuna farms in these ruses. Yet this is something that was tackled in Malta in 2017: the normal growth rate of tuna has been enshrined in Maltese rules to preempt any unrealistic inflation of growth figures. This, Dr Herrera’s spokesperson said, “was introduced by Malta to ensure a higher degree of control.”\nWWF, together with a raft of other international environment organisations including Greenpeace and Oceana, last November wrote to the European Commission asking for an investigation into illegalities in tuna farming. Environment Commissioner Karmenu Vella wrote back in early January to announce that an investigation was under way.\nMr Buzzi said: “We are engaging with the European Commission to find and make public the potential malfunctioning of the fishery control systems. We also want the Commission to investigate potential misuse of European funds by tuna farms.”\nA spokesperson for the European Commission told this newspaper that the Commission is “working” with EU countries and regulatory entities “to strengthen the traceability and control of live Bluefin tuna and to address the loopholes identified since the start of the Tarantelo operation.”\nThe spokesperson would not say when and if the report of the “audit” would be published.\nMalta is the largest player in the tuna ranching industry – it has the largest tuna farming capacity – the other major tuna-farming countries are Spain, Turkey and Croatia. Italy and France have a preponderance of purse seiners that supply live tuna to the farms, including those in Malta. France never allowed tuna ranching or farming. Italy’s tuna farms all ceased operations several years ago.  \n “Tuna farms in Italy were forced to relocate far from shore because of environmental issues,” said Mr Buzzi, who is based in Rome. \n\"This caused the cages to be battered in bad weather, allowing the tuna to escape and pushing up costs due to losses. An additional factor was falling tuna quotas. All of this made it too expensive and risky to install tuna-farming operations.\"\nMr Buzzi talks of additional controls that WWF advocates on tuna farms, including a ban on any unused portion of the quota being carried over to the following year, something the EU is implementing (see box).\n“Controls have to be improved in the tuna farming industry,” he said. “Of course any controls would be futile if you have corruption.”\nCommission tightens oversight\nThe European Commission has been in contact with the relevant authorities on the Tarantelo investigation and will continue to follow up the case with the Member States concerned, this newspaper has been told.\nThe Commission, a spokesman said, wanted to ensure that the authorities, fishing vessels and operators in these countries “abide by the rules set by the relevant Union legislation and international treaties”.\nUsing language that diplomatically sidesteps direct criticism of Malta’s systematic failures – the size of illicit trade in tuna uncovered in Malta is equivalent to a fifth of the yearly EU’s total tuna catch quota – the Commission talked of carrying out “regular audits in tuna farms across Europe”.\nThe new measures reinforce the control of live Bluefin tuna\n“The European Commission takes the findings of these audits very seriously,” the spokesperson said in written replies. “We are now in the process of discussing corrective measures with member states authorities, including Maltese authorities.”\nThe statement goes into detail about regulation at national and EU level, defining the limits to the Commission’s legal reach over Member States and how it would be fulfilling its legal responsibilities.\nThe Commission, the spokesperson writes, is actively working with European Fisheries Control Agency (EFCA) and International Commission for Conservation of Atlantic Tuna (ICCAT) to intensify scrutiny over live tuna fishery and farming operations. \nThe spokesperson talks of new measures approved last November “that will enter into force on 21 June 2019 [at the beginning of the tuna fishing season]. The new measures reinforce the control of live Bluefin tuna, in particular in relation to intra-farm operations and the control of the carry-over of live tuna from one year to another.”", "comment_count": 41, "id": 1828}, {"keywords": "", "author": "", "article_body": "Nearly half of people who contact MaltaPost do so to lodge a complaint, a survey by the Malta Communications Authority found.\nAlthough the company received fewer complaints in total than when the survey was last held in 2016, its handling of grievances appears to have worsened. \nIn 2016, 15 per cent of complainants said they were not satisfied with the company's response to their problem. That number has now leapt to 54 per cent.  \nConversely, the share of complainants happy with the way their problem was handled has dropped precipitously. In 2016, 71 per cent of complainants said they were satisfied. In 2018, 21 per cent were.\nAlthough 74% reported being satisfied with MaltaPost’s overall quality of service, this was still 20 percentage points lower than in 2016.\nComplainants made up seven per cent of all the people surveyed. Of those, 45 per cent said they did so to complain. \nThe Household Perception Survey, carried out in July and August 2018, confirmed that demand for postal letters has continued to fall, with online shopping boosting volumes of packets and parcels. \nThe most common complaints related to loss of mail (46%) followed by delay (17%), and misdelivery and failure to attempt delivery (a joint 14%).\nThe authority said 42% of respondents said they had spent less than €5 on posting articles in the last 12 months, as against 28% in 2016.", "comment_count": 15, "id": 1829}, {"keywords": "", "author": "", "article_body": "An independent MEP candidate is offering to spend an hour in voters’ living rooms, in a bid to drum up funds for his campaign and spread his ideas.\nIndependent candidate Antoine Borg is urging voters to invite a few friends over to their house and then call him over for a one-hour sit-down, in a twist to the usual door knocking ritual electoral candidates undertake.\n“I will spend an hour with you to listen to your and your friends’ concerns. I will answer all your questions. Of course, I will explain my policies, my thinking and my ideas for the European Union,” Mr Borg said.\n“At the end of the evening I will ask for some funds,” he added. Donations will be accepted in cash, credit card or Paypal – though he was keen to stress that people were not obliged to donate. \nMr Borg dismissed the traditional party clubs used by the Labour and Nationalist parties to campaign.\n“Party clubs are the worst place to go campaigning because you only meet the faithful in those places,” he said. “They don't reach out to people who may not have considered voting for them. This is a smarter way to reach people.\"\nMr Borg describes himself as a candidate who uses data, rather than ideology, to formulate his policies.\n“If the idea works, and if it benefits society, that’s all that matters,” he argues on his website.\nHis platform includes calling for clearer food labelling standards, a greater focus on Europol and transnational crime-fighting, and using research and development funds to boost Europe’s production of goods.\nAnyone interested in organising a fundraiser can contact Mr Borg via his website.", "comment_count": 3, "id": 1830}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Maltese jeweller cleared of buying precious items which had been stolen in a raid upon a Valletta store in August 2011 had his acquittal confirmed on appeal.\nGeorge Tabone, whose name is synonymous with the Gram brand, had been targeted by criminal prosecution after one of the men involved in the Valletta store burglary told investigators how he had sold his share of the booty to the owner of Gram Collections.\nJeweller George Tabone.\nThat confession sparked investigations against the jeweller who had been interrogated at the police headquarters, denied the allegations and protested his innocence all the way.\nCriminal action was subsequently instituted against Mr Tabone for allegedly handling stolen property, as well as for relapsing.\nRead: Assets freeze against well-known jeweller to stand\nIn the course of the proceedings, it emerged that the prosecution had based its case upon a statement by one of the thieves, Glen Debattista, who had that he had sold his share of the jewellery and that of his son, Ryan, to Mr Tabone at his Birkirkara outlet.\nBesides gold items, there had also been a solitaire ring having an estimated value of some €30,000, the court had heard.\nThe confessed thief had described how he used to visit Mr Tabone’s office, accessible via a spiral staircase, detailing how the Digital Video Recorder would be switched off while the deal was struck.\nHowever, the court observed that the police had found no trace whatsoever of the stolen jewelry at the accused’s premises. Nor had they established any link between the confessed thief, branded “a liar” by the defence counsel, and the jeweller.\nFollowing the acquittal by the Magistrates’ Court in 2015, the Attorney General had filed an appeal, arguing that there had been a wrong assessment of evidence by the first court.\nHowever, the Court of Criminal Appeal, presided over by Mr Justice Giovanni Grixti, observed that the prosecution’s case had been based upon the version supplied by one of the thieves, whose credibility was strongly questioned and which was denied by the jeweller.\nThe court also noted that Mr Debattista’s testimony had been marked by certain inconsistencies and that neither direct nor circumstantial evidence linked Mr Tabone to the crime.\nIn the light of such circumstances, the court declared that it was not “morally convinced” that the DVR issue, as well as the description of the jewellery shop supplied by Mr Debattista, could be taken to amount to “unequivocal evidence pointing in one direction”.\nThe court thus rejected the appeal and confirmed the acquittal. Lawyers Michael and Lucio Sciriha were defence counsel.", "comment_count": 0, "id": 1831}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 11.30am with bank statement\nBank of Valletta's website went temporarily offline on Tuesday morning, with the bank blaming \"internet connectivity issues\" for the sudden downtime. \nThe bank's technical issues come just two weeks after it fell victim to a massive cyberattack that saw hackers make away with €13 million. \nTimes of Malta started receiving reports that the website, and for some time the mobile application, were not online at around 10.30am on Tuesday morning. Users were also unable to use the bank's mobile app. By 11.15am, the website was back online and clients could log in to their accounts via the mobile banking app. In a statement issued at 11.30am, the bank said that it was experiencing \"internet connectivity issues\" which it was working to resolve as soon as possible. The problems had affected the bank's internet and mobile banking services, card payments through its EPOS machines and the website, the statement said. \nCustomers who needed urgent help could call 21312020 or email customercare@bov.com, it added.Clients who spoke to the Times of Malta on Tuesdsay morning explained how they initially had trouble accessing BOV's Personal Banking page. A short while later, the entire website went offline.  Users were also unable to log into the BOV mobile banking app.\nA trying month for BOV\nThe €13 million cyberattack the bank suffered had forced it to shut down all its operations - branches, ATMs, mobile banking and even email services - and take its website offline for almost the entire day.\nMost of its services were back up and running by the following morning, though payment facilities to non-SEPA accounts remained blocked for several more days. \nThe BOV cyberattack is believed to have originated overseas by a hacking group investigators have dubbed EmpireMonkey. Initial indications are that they infiltrated BOV systems by first breaking into France's stock exchange regulator, and sending emails from accounts there to BOV and other local banks. \nRead: How hackers got away with €13 million\nWhen a bank employee clicked on a link in the email, the hackers gained access to BOV systems. \nA bank spokesman last week told Times of Malta that it had yet to establish whether it would be able to retrieve the entire €13 million. \nMore to follow. ", "comment_count": 13, "id": 1832}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "A crowdfunding campaign to stop 12-storey apartment plans for Mistra Bay dead in their tracks is just €2,000 shy of its target.\nCitizens have raised more than €5,000 in the first week of fundraising against the Gemxija Crown Ltd project, which was approved by the Planning Authority last month.\nThey initially feared they had just four days to reach their funding target and file an appeal against the project, only to discover they had an added week of breathing room.\n“We’re delighted by the support we’ve received from all across the island,” one of the organisers, writer and activist Wayne Flask, told Times of Malta. “Residents from towns threatened by similar monstrosities, such as Pembroke and Xgħajra, have been especially keen”.\nLed by activist-residents Priscilla Grima, Karen Tanti and Sandra Copperstone, the organisers have one more week, until Friday March 1,  to drum up the €7,350 they need to pay an appeal application fee and cover legal fees to argue the case.\nCouncil remains silent\nUnlike activists who crowdfunded to pay for an appeal against the db Group’s City Centre project in St Julian’s last year, Xemxija residents opposed to the Mistra Bay plans must go it alone.\nThree local councils – Pembroke, Sliema and St Julian’s – vociferously opposed the City Centre project. The St Paul’s Bay council, by contrast, has remained resolutely silent. \nCouncillors were due to discuss the project at an urgent meeting scheduled for last week, but not enough members showed up to make up a meeting quorum.\nMayor Anne Fenech has refused to say what she makes of the Mistra Bay project and said it is unfair to accuse the council she leads of inaction.\n“This project has been on the cards since 2008, there was plenty of time for previous councils to take a stand,” she told Times of Malta last week.\nA decade in the making\nThe mayor’s 2008 reference harks back to the date when the Mistra Bay project was first presented. Mepa had at the time approved an outline permit for the project, which proposes a series of 12-storey apartment blocks for the site of the former Mistra Village holiday complex.\nFive years later, in 2013, planners granted the project a full development permit.\nA report by the environment ombudsman subsequently found that Mepa was wrong in both 2008 and 2013 and described plans for the site as “disproportionate”.\nDespite planners’ approval, the project faltered as investors failed to raise the necessary capital and subsequently fell out.\nIt was however resurrected by developer Charles Camilleri, who last July applied to renew the development permit on Gemxija Crown’s behalf before it ran past its five-year expiry date. That application was approved by the Planning Authority last month.\nResidents worry that the massive 700-apartment project will overwhelm their seaside locality, choke up already-congested roads and irrevocably transform the idyllic Mistra countryside.\n“Maybe the powers that be should think about the people who have donated [to the crowdfunding campaign] and what this absurd planning regime has done to them, how it has affected their livelihoods and damaged their standard of living,” said Mr Flask.\nDonations to the crowdfunding appeal can be made via Paypal to mistraprojectappeal@gmail.com, or via Revolut by contacting Priscilla Grima.", "comment_count": 25, "id": 1833}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "Thousands of euros and months of hard work were literally thrown to the wind as last weekend’s severe storm damaged a number of carnival floats sheltered in two huge temporary tents in Marsa.\nThe temporary tents that were to protect the carnival floats from inclement weather were totally destroyed.\nOne carnival float, belonging to Titti Carnival Company, was completely destroyed, while two others suffered extensive damage. Four other floats were rescued just in time as they were moved to safer premises before the gale force winds lashed the islands on Saturday and Sunday. \nThe rest of the companies, which were still working in their Marsa or Valletta warehouses, were unaffected.\nRead: Storm's trail of destruction could cost millions\n“I’ve never seen a storm of this magnitude in the 33 years I’ve been participating,” Raymond Mallia, leader of Titti Carnival Company, said.\n“It’s heart-breaking to see a year’s work destroyed before your own eyes. Everyone is disappointed, especially the dancers. But there’s nothing much we can do about it,” he said resignedly from his warehouse at Fort St Elmo.\nThe company was participating in the Dance Companies Category A competition with a float themed around Great Britain. Mr Mallia calculates they lost around €3,000 in lighting alone, besides paint, wood and metal work. However, he is comforted by the fact that no one was injured.\nRead: 'Worst storm since 1982' saw record gusts of 133km/h - Muscat\nThe enthusiast had words of praise for the Carnival Organising Committee and the festival’s artistic director, Jason Busuttil, who tried to help the company in whichever way possible.\nCome the weekend, Mr Mallia still intends to take part in the festivities and hopes for good weather.\n“I will set up a tractor, so at least our dancers can join in the celebrations, show off their lavish costumes and have fun,” he said.\nDreamteam Carnival Company, the winners of last year’s Triumphal Floats Category A, also suffered major damage but are hopeful they will be able to repair their circus-themed float before Friday, when official carnival celebrations kick off in Valletta.\nRead: Top wind speeds, temperatures and rainfall - the storm by the numbers\nTeam member Jeremy Mercieca described their weekend ordeal as “a nightmare”.\n“On Saturday, we started noticing that the tent where our float was stationed was not strong enough to withstand the storm. In the evening, the gale force winds picked up and the nightmare began,” said the school teacher.\nIt was a long and cold windy night\n“The wind started blowing away the tent… until the whole structure came apart bit by bit.”\nWhile a number of other participants managed to move their float to the warehouse of Rodrick Zerafa of Toto Perżuta Carnival Company, Mr Mercieca’s team could not follow suit for various reasons.\nRead: ‘Farmers have never seen so much damage’\n“It was a long and cold windy night. I watched the tent break away slowly while hoping and praying that our float would not be badly damaged,” he said, adding that he felt helpless. “We would have been risking our lives if we had to go into that tent. It’s difficult for people to understand this but it’s not easy to see all your hard work and money going to waste.”\nAt the same time, they were informed that some loud noises were heard coming from their warehouse, also in Marsa, where parts of the float were being finalised.\nOne of the damaged floats belonging to RRG Carnival Company.\n“When we went there, we found that the wind had blown away the corrugated metal roof and our warehouse had become open air. So we moved the parts to a safer space in the same building. What a night!” he exclaimed.\nRead: Storm damages hall at Fort St Angelo, undersea water main\nThe company found a lot of cooperation from Mr Busuttil, Clint Axisa, president of the Carnival Organising Committee, and Justice and Culture Minister Owen Bonnici, who announced the government will compensate the companies that were affected by the storm.\nDreamteam were given an alternative venue and offered a helping hand from other Maltese and Gozitan participants.\n“Our courage and determination at the moment is indescribable,” noted Mr Mercieca. \n“Everyone is working round the clock to repair the float. And after two sleepless nights, I continued with the dance rehearsals on Sunday.”\nDreamteam Carnival’s float at one of the damaged tents.\nDreamteam’s float at their warehouse in Marsa last week. The corrugated metal roof was blown away over the weekend.\n ", "comment_count": 8, "id": 1834}, {"keywords": "", "author": "Jacob Borg", "article_body": "The perceived financial burden of medical care in Malta is higher than the European Union average, data released by Eurostat shows. \nA total of 14.6% of Maltese polled for the year 2017 said medical care was a high financial burden, while 56.6% said medical care was somewhat of a financial burden and 28.7% said it was no burden. \nThe EU averages for these three categories was 11.2%, 33.9% and 54.9% respectively. \nAt EU level, the perceived financial burden of medical care was greatest for those living in two-person households where at least one person was aged 65 years or more. \nMedical care refers to individual health care services such as examinations or treatments. \nThe cost of dental care, which was treated as a separate category, saw Malta feature just above the EU average. \n15.6% of Maltese perceived medicine as costly\nAn average of 16.9% of EU citizens said dental care was perceived as a high financial burden, whereas 17.6% of Maltese found sitting in the dentist’s chair costly. \nA further 55.8% of Maltese perceived dental care to be somewhat of a financial burden and 26.6% said they felt no pinch on their pockets. \nThe perceived burden of paying for medicines, another separate category polled by Eurostat, found that 15.6% of Maltese perceived medicine as costly, 54.3% as somewhat costly and 30% felt no burden. \nAt the EU level, 13% found paying for medicine a heavy financial burden on the household, 39% reported that these costs represented some financial burden and just under half declared that paying for medicines brought no financial burden to the household.", "comment_count": 8, "id": 1835}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers\nTimes of Malta says the trail of destruction of Sunday’s storm is likely to cost several millions of euros. In another story, it says Malta has dropped four places in the Euro Health Consumer Index, an annual ranking of the performance of different countries’ health systems.\nThe Malta Independent says the Civil Protection Department had received 500 emergency calls since Sunday morning and the number is expected to rise.\nL-Orizzont says school cleaners are calling for an investigation into their wages.\nIn-Nazzjon quotes PN leader Adrian Delia saying the party wanted the immediate implementation of the Venice Commission recommendations.", "comment_count": 0, "id": 1836}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The trail of destruction of Sunday’s storm is likely to cost several millions of euros, according to insurance industry sources. \nInsurance companies were on Monday inundated with calls and requests for information about the coverage of their policies and how their damage could be recouped. \nRead: 'Worst storm since 1982' saw record gusts of 133km/h - Muscat\nMalta Insurance Association director general Adrian Galea told Times of Malta when contacted that it was still far too early to estimate or predict the value of the claims. \n“The insurance industry is expecting a significant number of claims for damages to be lodged by all those who suffered some kind of damage to their property, business, vehicles and/or boats but it is too early to predict the value,” he said. \nRead: Top wind speeds, temperatures and rainfall - the storm by the numbers\nMr Galea said the association was in the process of collecting data from its members on the various types of claims for damages that insurance companies may receive over the coming days and weeks. \nThis, he said, is a slow process that will take several weeks, primarily because not everyone lodged claims immediately and each claim would then have to be assessed, based on its own merits. \nRead: ‘Farmers have never seen so much damage’\n“It is the insurance company’s duty to ensure meeting all those legitimate claims as much as it is an insurance company’s duty to filter out those claims which are unjust, inflated or else simply not due because the policy conditions did not cover such risks,” he said. \nMr Galea said that as a general rule, a customer is entitled to expect settlement for the claim submitted provided that an insurance policy was in place to cover the risks associated with storm damage. He said the industry is often unjustly criticised over unaccepted claims but it all depends on the type of coverage.\nRead: Storm damages hall at Fort St Angelo, undersea water main\nFor example, unless a vehicle is insured against all risks, which is normally referred to as a comprehensive cover, damage caused by trees, falling debris or stones and severe flooding would not be covered.\nHe said that considering the severity of the storm, insurance companies could expect to see claims for damages to homes, repairs to solar panels or solar water heaters, broken glass, water ingress as well as claims for damage to business properties, construction sites and damage to protective walls, fences, machinery, tools and equipment.  \nWatch: 'We lost everything': two separate eateries gobbled up by the storm\nAs for agriculture, claims for damages to equipment, sheds and/or greenhouses would be also expected.\n“While insurance companies will try their best to settle a claim and reinstate their client to a similar position before the event took place, this will depend on the policy cover itself,” Mr Galea said.", "comment_count": 36, "id": 1837}, {"keywords": "", "author": "", "article_body": "Police on Monday night investigated what residents believed to be a shooting at a residence in Santa Lucia. No one was injured.\nResidents of Triq il-Prinjola contacted the police at around 10pm after they heard a sound and saw a hole in a balcony window.\nThe police went on site but there were no further developments.", "comment_count": 0, "id": 1838}, {"keywords": "", "author": "Sarah Carabott", "article_body": "As Birdlife CEO, Mark Sultana is often at the receiving end of hate speech, but the comments took a turn for the worse when his father, well-known environmentalist Joe Sultana, passed away last year.\nThe FKNK hunters' federation had expressed its condolences to the family of Joe Sultana, who was also the Birdlife Malta founder. Not all hunters appeared to share the federation's views, with Chris Mercieca saying he hoped the veteran ornithologist did not rest in peace. \n\nFacebook user Alex Jessica Borg, meanwhile, expressed hope that others like the late Mr Sultana will follow suit.\nMeanwhile, Glen Gatt, one of the people spewing hate at Mark Sultana said that thinking hunters would aim better if they thought their targets were Birdlife activists.\nThe comments do not always bother Mr Sultana, but he believes they are actually offensive to those who wrote them.\nPeople should always take into consideration the impact that their comments could leave on their own image, he said.\n“I believe people who show care and respect even when in disagreement, are admired more than those who use obscene and hateful rhetoric.”\n\nMr Sultana is participating in a #stophate speech campaign which for the last month has seen personalities reading out the hate messages they receive on social media.\nThe project also seeks to raise awareness of the impact hate speech can have on its recipients and the responsibilities that come with freedom of speech.\nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com\nOther #stophate videos:\nWatch: ‘I wish migrants would rape your wife’ - Peppi Azzopardi\nWatch: ‘You will go down like Daphne’ - Godfrey Farrugia\nWatch: 'I have a bullet ready for you' - Lara Dimitrijevic\nWatch: An assault rifle bullet... the cure for a gay man - Chucky Bartolo", "comment_count": 100, "id": 1839}, {"keywords": "", "author": "", "article_body": "Updated 12.45pm\nThe Malta International Airshow will again not be held this year, the Malta Aviation Society announced in a one-line statement on its website on Monday. It gave no reasons.\nThe last show - the 25th annual event - was held in 2017. \nLast year, the MAS cancelled the show after complaining of a lack of support from the Ministry of Tourism. \nThe show had been one of Malta's most popular outdoor events, having attracted some of the world's most modern combat aircraft as well as top aerobatic teams such as the Red Arrows.\nBut costs had spiralled, mostly on account of insurance requirements and the costs of fuel and accommodation for participants.\nREAD: Air show still grounded as talks between government, organisers stall\nIn a statement issued on Tuesday morning, MEP Francis Zammit Dimech expressed dismay at the news. \n\"It is a pity that in recent months we have repeatedly heard how the Malta Aviation Society was not finding any support to organise the airshow,\" he said.\nThe former tourism minister said that PN administrations had always offered the show its support and that he had even called for it to be included in a national tourism calendar. \n ", "comment_count": 26, "id": 1840}, {"keywords": "", "author": "Edwina Brincat", "article_body": "One of the people involved in the design of the track used in the ill-fated Paqpaqli motor show of 2015 told a court on Monday that he had not known where the spectators would be.\nHe also pointed out that the temporary circuit was designed for Porsche 911 GT3 vehicles, not the Porsche Spyder which eventually crashed. \nSeveral people were injured, some of them critically when a Porsche supercar being used in demonstration runs on the temporary track on the airport runway ploughed into the crowd.\nCourt action is being taken against the driver, Paul Bailey, and the organising committee.\nFreelance driving instructor Frederick Dineuff, who works for German company Sport Driving GmbH, explained to the court via video conference how he had been engaged by the local representative for Porsche to perform some demo laps with potential and existing customers during the charity event.\nREAD: Paqpaqli: Lawyers ask why track designers were not arraigned\nHe had travelled to Malta on October 1, 2015 together with fellow instructor Thomas Theodoros Bangma. They were met at the airport by Sandro Cauchi, local Porsche representative, and accompanied to San Anton Palace where they were offered accommodation during their three-day stay.\nAsked to recall his testimony before the inquiring magistrate in the wake of the incident, where he had said that he had been involved in the design of the track but had nothing to do with the barriers around it, Mr Dineuff explained how “someone from the organization” had supplied them with a “blueprint” of the track used in the previous year.\nHe, however, could not recall who that person was.\nMr Dineuff explained how he had fine-tuned the plan, introducing two chicanes and braking zones as safety features to reduce speed since there would be amateurs driving two Porsche 911 GT3 models and clocking up high speed, catering for a maximum speed limit of 200km/hr.\n“Our instructions were to set up a safe track so as to ensure that customers would have a good time,” he said, stressing however, that they had “nothing to do\" with safety measures such as barriers around the track.\n“We didn’t know where the spectators would be,” he said, pointing out that there had been no communication with the organizers but only with the local representative for Porsche.\nHe said that the track had been designed specifically for the GT3 models.\n“No accident happened when we drove, not one single incident,” Mr Dineuff stressed. “It was never communicated to me that anybody else would use our track. Never.”\nREAD: Paqpaqli crash: Supercar was being driven without traction control\nAsked, in the light of earlier testimony where he had allegedly voiced concern with his colleague that the barriers were not enough to protect the public, Mr Dineuff insisted “With our GT3s we didn’t have any accident.”\n“Did you at any point draw attention to the fact that the track was designed for GT3s not the Spyder?” defence lawyer Giannella de Marco asked.\n“I don’t recollect if I may say so because I was busy with my customers. I don’t recall if I mentioned it to Sandro or anyone else,\" he said.\nAsked by the court whether Paul Bailey had followed the same driving procedure as him and his colleague, Mr Dineuff replied: “It was a different manoeuvre from ours. He went straight to the chicane, he went faster, much faster it seemed to me.” \nLawyers want statements given without lawyers present struck down\nLater in Monday's court sitting, lawyers for Mr Bailey and the 13 former members of the Paqpaqli ghall-Istrina core committee raised a number of legal arguments, pointing out weaknesses and shortcomings in the case as instituted by the prosecution.\nLawyers Stephen Tonna Lowell and Giannella De Marco, assisting Mr Bailey, pointed out that their client had been asked to testify more than once in the course of the magisterial inquiry, and this in between facing neurosurgical interventions for the injuries sufffered in the crash.\nHis statements, having been given without the assistance of a lawyer, should be declared inadmissible by the court, in the light of a strong line of case-law on this subject.\nThe lawyers also requested the separation of proceedings in respect of Mr Bailey whose “defence is logically different from that of the other co-accused.”\nAll answers given by witnesses and experts in respect of the other co-accused, should be declared inadmissible vis-à-vis Paul Bailey, his lawyers argued, as were the reports drawn up by four court-appointed experts, since these had been “contaminated” by the foreign Porsche experts called in to assist in the inquiry.\nSpecific reference was made to the expert appointed to report on the dynamics of the accident.\nCourt expert 'has no expertise'\n“It is unacceptable to have an expert draw up a report and deliver an opinion when he has no expertise on the matter,” argued Dr Tonna Lowell, labelling the expert in question as “manifestly incompetent since he possesses no qualification save for a one-year evening course on motor mechanics.”\nLawyer Joe Giglio, assisting Tonio Darmanin, likewise raised the inadmissibility of the statements released by his client without legal assistance.\nThis argument was taken a step further by lawyer Stefano Filletti who noted that the discarded statements had to include all documents requested of the accused when there had been no lawyer to assist them.\n“The right to a fair hearing extends to statements and opinions based thereon,” Dr Filletti stressed.\nLawyer Arthur Azzopardi pointed out that none of the experts and laboratories employed in the gathering of evidence were in conformity with ISO standards.\nMagistrate Aaron Bugeja granted the lawyers for the victims one month within which to rebut these arguments in writing, so that a decision could then be taken by the court. \nThe case continues in May.\n ", "comment_count": 0, "id": 1841}, {"keywords": "", "author": "Keith Micallef", "article_body": "Less than three months before he faces his first electoral test, Keith Micallef interviews Nationalist Party leader Adrian Delia about his recent past, his poor poll numbers and his party’s policies.\nAt the turn of the year there were calls for your resignation but somehow you managed to weather the storm within the party. However, you did not ask for a secret vote of the PN’s parliamentary group, which was only summoned when the dust had settled. Why?\nStorms happen all the time in politics. I never considered holding such a vote as I never had the feeling that circumstances dictated it. Had there been a moment in my political life when I felt I had failed in my duties to the extent of seeking a confidence vote, I would have called it.\nAre you saying that reports in the media that a significant number of MPs lost confidence in you are fake news?\nIt is not my duty to judge what is being written. My job is to ensure I have a good relationship with the people around me whereby they would be comfortable to criticise. My role is to clarify any issues which they might raise.\nHow did you feel in the executive committee and administrative council, when you were questioned on allegations regarding domestic violence, money laundering and personal finances?\nI felt very comfortable. The only difference is that the atmosphere in the council was more intimate as it is a smaller body than the executive committee. In the latter case, I was overwhelmed by the level of support. Maybe this was due to the fact that by the time the executive committee met, members had a better understanding of the issues at stake\nCould it be a case of the administrative council, which met first, influencing the outcome of the executive committee? I could not have imagined a scenario of one organ contradicting the other, so the battle was effectively won within the administrative council.\nNot necessarily. The executive is composed of a much higher number of members to the order of eight to one. My reading of the situation is that people had enough time to understand the replies I had given on the various allegations made and that there was nothing untoward.\nHowever, outside the party circles these allegations are still overshadowing you. Some traditional PN voters believe you have made the party unelectable and they are unwilling to vote for a party led by somebody whose integrity they question. How are you planning to gain their support?\nAs you said, this is just a shadow. There is nothing else. Who is casting that shadow? Whenever I have been asked about anything, I was able to give a reply about everything, be it in the media or other fora. Factually, I can do nothing else. Facts are facts, fiction is fiction and lies are lies. However, it has been quite some time since I was questioned on certain issues which go back a long way. I meet thousands of people but these lies and rumours are not raised.\nAre you saying that the FIAU report in which you were mentioned in money laundering activities and a Soho-based prostitution racket is a fabrication?\nThe money laundering allegation is a downright lie based on manipulated and incorrect information. I know nothing about the FIAU report, and if it is true that the police have been aware since March last year of certain allegations, the fact that they never spoke to me certifies their incompetence.\nWe are simply building more buildings rather than constructing our future\nI was never personally involved nor gave any advice in anything related to money laundering. There was one allegation on which I gave an explanation countless times based on hard evidence, including to the Times of Malta. If there is somebody who does not want to believe documented facts, there is little more that I can do.\nAs for your personal finances, this newspaper last month enquired if you still had any pending tax bills, but you did not reply. The story was based on an e-mail addressed to you that was sent in January 2018, which outlined the agreement reached on a pending tax bill totalling €81,751 for the period 2007-2013 and another one of €64,086 for the period 2014-2017. While you had said that the first had been settled, you had refused to answer on the second, saying you needed to see the documentation first. Are you now in a position to confirm that this bill has been settled?\nYou are asking me a question on a document which I have never seen.\n[Dr Delia is shown a copy of this e-mail]\nI have no recollection whatsoever of this e-mail. Had I been prepared beforehand I would have brought my records and replied on the spot.\nHow can you be unable to recollect if a €64,000 tax bill is still pending or not? This is a lot of money.\nI can assure you I have no such pending bill. I have documented evidence about this.\nCan you produce it to lay everybody’s mind to rest on the matter?\nHad I known about the question beforehand I would have. I never went to the Inland Revenue Department, as the accountant used to handle such matters for me. If you are interested in my personal finances, I am available to set up a meeting with my accountant and give you a detailed month by month breakdown. I have no pending bills.\nRead: Income tax saga comes back to haunt Adrian Delia\nWhy did not you say so in the first place and produced the evidence at a later stage?\nYour document is no evidence at all!\n[Dr Delia interrupts the interview and goes to his desk to look for a document. Meanwhile, PN media chief Pierre Portelli, who was present throughout the interview, interjects remarks including that the Times of Malta has an agenda against Dr Delia. The interview resumes a while later following a colourful exchange, with the tax issue left pending.]\nWith the EP and council elections just three months away, the gap between the PN and PL is not getting any narrower according to the latest Malta Today survey. Is not this a very worrying sign for you?\nMy concern is not this but whether we have enough time to persuade enough people that the country is not heading in the right direction. I have been at the helm for 18 months and my initial task was to restructure the party and face a number of internal challenges. It is not good for the country to adopt a policy whereby the only drive behind economic growth is a rise in population, as this is not sustainable for an EU Member State with the highest population density. \n'We are not attracting new banks or serious financial institutions'. Photo: Mark Zammit Cordina\nThe government is importing thousands of foreign construction workers in response to the needs of unplanned development. We are simply building more buildings rather than constructing our future. The government is measuring success solely in terms of economic growth but this is not reflecting people’s spending power. The construction industry is doing well, but in the last six months there have been cash flow problems.\nNonetheless, the party in government is going from strength to strength. Does not this contradict what you are saying?\nWhen an economy is overheating, the consequences will only emerge at a later stage. It is like giving children unlimited access to candy. They will enjoy it at first but when it starts harming them they will regret it.\nAre you saying there is an economic bubble which will soon burst?\nI am not saying it is a bubble as my job as a politician is not to scaremonger. My point is that such a model is not sustainable as there are physical constraints. No effort is being made to attract value-added economic sectors.\nOne of the government’s biggest projects was to attract blockchain and cryptocurrency investors, which rely heavily on the banking sector. Nonetheless, the government first ruined Malta’s reputation, then the Finance Minister ignored the warnings sounded by the European Banking Authority, did nothing to strengthen the safeguards of this sector, and eventually the Prime Minister appealed to the banks not to be so stringent. Subsequently, a global bank [HSBC] warned that their profits had fallen by 23 per cent due to Malta’s reputational damage.\nWe are not attracting new banks nor serious financial services institutions while the banks are being encouraged to break the law.\nCan you elaborate on this? \nJoseph Muscat has lamented that banks are being too stringent when it comes to loans. He urged them to be more lax. Procedures such as due diligence and know-your-client have to be followed. Certain parameters need to be adhered to, like having a healthy distribution of loans across various economic sectors, so as not to have all eggs in one basket, in this case the construction industry.\nThe government is creating problems and shifting the blame on others. It has no solutions on pensions and tries to justify its decision to bring in thousands of foreign workers, saying these are necessary to guarantee pensions. And he blames the people for living longer when the increase in life expectancy should be a reason to celebrate as it is the result of a better quality of life.\nAre you saying that the PN is still trailing heavily in the polls because the negative repercussions of certain government policies are not yet being felt?\nThis is one of the reasons. The second is that Labour has only been in government for five years.\nBut the norm is that the decline of a party in government starts in the second legislature, where we are right now.\nThe feedback I am receiving is that people are starting to feel the pinch of corruption and have less money in their pockets. Meanwhile, the government is unashamedly using its power of incumbency to convey its message. At the Office of the Prime Minister alone there are 27 people with this duty. I believe that people are realizing what is going on, especially pensioners, families depending on one breadwinner and young people seeking to buy their first home.\nYet, this is not reflected in the polls\nThing will start to change after some time. I feel that there are already signs that this is happening but it might not necessarily have an immediate impact on opinion polls. The largest survey is that done with the electorate.\nLet us not forget that the Opposition suffered two landslide defeats and this affects its ability to persuade voters. I feel that not enough efforts to renew the party were made between 2013 and 2017, and I am trying to address this matter.\nHowever, it takes time before a party can project itself as reformed and regenerated. We have started outlining proposals in sectors like the fight against cancer, agriculture, pre-budget documents and the work-life balance directive by the MEPs.\nLet us not forget that our resources are limited, unlike the government that can also rely on PBS, which at times reports issues in a certain manner. Recently PBS changed Malta’s ranking in the corruption index issued by Transparency International.\nWhat are the party’s expectations in the local council elections? Where is the PN expecting to make gains?\nMy personal wish is to win back Birkirkara. Among the localities I visited, Iklin, which has been led by the PN for 23 years, stands out, as the council has developed a healthy relationship with the entire community. This is completely different from Rabat which is led by Labour.\nThis is only part of the picture. The PN had problems of its own in St Paul’s Bay. So the PN is no guarantee either.\nFair point. The party is giving a lot of importance to local councils like Siġġiewi which is taking initiatives such as a night shelter for the elderly, a children’s council and roadworks in rural areas. It has also developed a bond with residents. This is exactly what we want. On the other hand Labour has stripped councils of important responsibilities like roads, domestic waste collection and encroachment permits, and has starved them of funds.\nThe latest example is the setting up of the Gozo Regional Authority which lacks executive powers and is completely dominated by the ministry.\nIn the case of St Paul’s Bay, the PN lost its majority as a result of the defection of two councillors and consequently the party ended up in a weak position. Our target will be to have a new but more united majority in this locality.\nThe bottom line is that local council elections are a gauge for any party seeking to make inroads. What is the party targeting?\nWe are trying to attract new blood, targeting certain localities where the PN had lost its majority, seeking new ones and at least gaining a seat.\nPeople are starting to feel the pinch of corruption and have less money in their pockets\nDo you subscribe to the view that in the event of a resounding defeat, you should resign in the best interests of the party so as to stand a chance in the next general election?\nI did not venture into politics on a two-year project. That would have been arrogant and imprudent. This was no experiment. I believe the PN needs to renew itself. I need to measure myself in the 2022 general election. The forthcoming elections are a test and we need to do our best to overcome the first hurdle. My considerations when the result is out is to rectify and understand what went wrong and improve on our successes.\nWould you not seriously think about resigning if, deep down, you consider yourself a liability to the party?\nIf such extraordinary circumstances were to arise, I would resign as I would not only be harming the party but the country. It does not have to be an election. However, so far I have felt the complete opposite, as I have been given huge support at every step. Whenever I did not have backing, I managed to persuade the doubters and move forward. Certainly, I have not reached out to everybody yet.\nThe leadership has no perks but sacrifices, work and responsibilities. My sole satisfaction is to give something back to party and country.\n[At this point Dr Delia’s secretary hands him a document in the form of a certificate from the Inland Revenue, dated May 14, 2018, which said that he had no pending bills with the department. The interview shifts back to the tax issue. He insists that he had already shown this document to this newspaper but not to the interviewer.]\nWhat is the reason that this €64,000 bill was never mentioned, not even in the personal audit you had published on the eve of the leadership election in 2017?\nI cannot say as I have never seen the document you produced. €64,000 does not exist in my mind. But if there had been any other pending amount, it has been settled. The only exception is the period of 2017 in which I transitioned from private practice until I became Opposition leader, but I have already put aside money to settle that as well.\nDo you take any salary from the party as leader?\nNo. I had announced this from the very beginning, and never received any remuneration from the party. However, I had also said that there would be nothing wrong for the leader to be paid, but only after the party’s finances have been sorted out. My message was simple. I will be the last one to get it. Today I am the only one who is not paid by the party.\nYou have been very vocal on the issue of foreign workers. Can you outline the PN’s policy in this regard? Will the party limit the number of third country nationals entering Malta?\nWe will end up in a situation where 60,000 additional workers are be engaged by the private sector. What impact will this have on employment conditions? Many foreign workers are living in containers, getting a meagre pay, and spending nothing. We are using foreigners to build for foreigners. The country is not receiving any new tax revenue but just the social security contribution, as they are on the minimum wage.\nCan the Prime Minister tell us how many foreigners are needed to sustain every pension? What is the ratio? How many Turks at minimum wage are required for every 1,000 pensioners? How much does the country need to spend in order to upgrade its infrastructure to cater for this influx? Does it make sense financially? \nJoseph Muscat has said he is leaving, and he is leaving a mess. He only planned for a few years, for 10 years. When the economy overheats the rich will get richer and the poor will get poorer.\nWhat are the PN’s plans in this regard?\nChange cannot materialise overnight. There needs to be a gradual plan and this does not mean we do not want foreign workers. The government needs to shift certain economic priorities onto sectors like alternative energy, not fuel stations as it is currently happening.\nHas the government ever outlined the number of schools, hospitals or teachers required for the next decade? The PN will focus on the circular economy.  \nHow do you plan to implement your pledge of guaranteeing accommodation for everybody? It sounds like a pre-election stunt.\nThe solution is either providing accommodation or lifting people out of poverty. However, there is a category who can never make it on their own except through social measures. We are not on the eve of the election and it is early days. I have three years to beef up my proposal.\nIs it a case of pledging now and seeing how to work it out later, or have you already got a clear idea of how to implement this ambitious proposal?\nWe have to make better use of government land, lift people out of poverty and it does not necessary imply dishing out apartments. We have to adapt to each and every circumstance. \nHow will the PN make up for the revenue gap which will result if it halts the sale of passports?\nThe government is linking the sale of passports to social housing, to cleanse this filthy scheme. There are other ways to attract investment. Moreover, the impact on the real estate sector of the IIP is being blown out of proportion. Bed and breakfast tourists are having a much higher impact. I am against this scheme in principle. We need to plan to attract serious foreign investment, and the PN’s track record in this respect is very good.\nUse of a differently-styled emblem in the ongoing general council has fuelled speculation that the PN could ditch its traditional ‘maduma’. Is this the case?\nNo such plan is in the pipeline. It is just a stylistic design.", "comment_count": 31, "id": 1842}, {"keywords": "", "author": "Ramona Depares", "article_body": "Not everyone with HIV can infect others, a fact most people are unaware of, says a young man who has tested positive for the virus. In the wake of fake news about HIV transmission which was shared by a Maltese MP, he tells Ramona Depares that the country is in urgent need of basic education to remove the stigma.\nMalta lags far behind its European counterparts when it comes to educational campaigns about HIV, and the brunt is being borne by patients who are often at the receiving end of unjustified stigma, a young man who was diagnosed with HIV two years ago told this newspaper.\nThe man was reacting to recent reports on social media warning the public to beware of “HIV infected” fruit. The HIV virus can only be transmitted through specific body fluids that do not include saliva and tears.\n“Unfortunately, there has been no nationwide educational campaign by the authorities to educate people about the realities of HIV and the ways it can be transmitted. This is one of the biggest reasons why HIV-positive people are treated as pariahs by many, as the majority actually believe that you can get the virus even through minimal contact like hugging,” Adrian (not his real name) said.\nMoreover, Malta has failed to publicise a crucial medical breakthrough that would help considerably towards removing the stigma from many sufferers: in patients where the virus has become undetectable, it is not possible for them to transmit it to someone else.\n“In other words, not everyone who is HIV positive can transmit it to someone else. When the presence of the virus falls below a certain threshold over six months, it is impossible to transmit it. Thankfully, this is the case for me – I have responded well enough to the medication that I cannot infect anyone else,” Adrian explains.\nThe US Centre for Disease Control currently defines undetectable as being when the presence of the virus is “less than 200 copies/ml”. The breakthrough, made official in 2016, was followed by major educational campaigns across Europe, using the tagline ‘Undetectable Equals Untransmittable’ – also referred to as U = U.\nBut Adrian laments that the Maltese government has, so far, failed to follow suit. This approach, he argues, is one of the main reasons why many Maltese remain clueless when it comes to safe interaction with HIV positive people. It is also why so many patients find themselves on the margins of society, afraid to interact with people for fear of the stigma raring its head.\nThe majority actually believe you can get the virus even through minimal contact like hugging\n“When I was diagnosed HIV positive, it changed my life overnight. I was lucky enough to have a very strong support network of close friends and family, who coped with the news fantastically. But even so, there were many days when suicidal thoughts took over. I felt like damaged goods. If I did not have such a strong support system, I would not be here today. Not everyone is lucky to have that. Proper education would go a long way towards reducing these feelings of alienation,” Adrian says.\nThe young man describes how there were days when he would abruptly stop what he was doing and burst into tears, staying in the foetal position for hours on end. Other days, he would simply “freak out”.\n“Coming to terms with the news is a roller coaster of emotions, to put it mildly. You feel as though your body is not your own anymore, as though it has been taken over by something without your permission. It takes a long while to start accepting yourself again.\n“Think how much worse people who spread unfounded myths – such as the idea that you can get HIV from a piece of fruit – make it for those who are suffering.”\nAdrian’s case is one of the rarer ones, in that he always used protection during sexual encounters. Medically, he had always been considered to be part of a low-risk group.\nFor a time after his diagnosis, he says, he was not sure he wanted to be alive, let alone go out and meet people. “How could I date someone and risk infecting them, too?” he tells me earnestly.\nSince then Adrian has gone through all the steps of acceptance and coping, and leads a relatively normal life, the only glitches being the side-effects of the medication that occasionally manifest.\n“I take my medication regularly and, thankfully, the virus is undetectable in me.”\nMeantime, his one hope is not only to see a fully-blown educational campaign in order to minimise stigma and ease the pain of those who live with HIV, but to also have access to newer and more efficient medication, an area where Malta also lags behind.\n“I am currently taking six pills a day, three every 12 hours. I have spoken to others who are in the same situation but who are living abroad – they take one pill a day, with barely any side effects. The medication we have in Malta wreaks havoc in your body, and keeping to a work routine can be tricky,” he explains.\nHe confesses that he has been tempted to do like others, and order the more efficient medication online, but he has misgivings about how safe this would be.\n“I really hope the government does something about it. We find so much money for so many things. This medication would improve the quality of life of a lot of people,” he concludes.\n“Until this happens, the least that government can do is ensure proper education. I am not ‘the person who has HIV’. I am a person, fullstop.”", "comment_count": 21, "id": 1843}, {"keywords": "", "author": "", "article_body": "Parliament on Monday paid tribute to former Nationalist MP Lino Gauci Borda who passed away on February 13, and former Chief Justice Giuseppe Mifsud Bonnici who passed away last week.\nDeputy Prime Minister Chris Fearne paid tribute to Dr Gauci Borda, who was well loved by the patients he served as a family doctor.\nHe was also well respected as a politician, having served in the House for 18 years from 1976 to 1994.\nDr Gauci Borda had also been passionate about vintage cars and was president of the Old Motors Club for almost as long as he was an MP. He was instrumental in moving the club to its current Mosta quarters.\n\"Dr Gauci Borda will be remembered as a politician and a doctor, but especially as a gentleman who never refused to help anyone, of whatever political colour. He was a man who understood the people's problems,\" Mr Fearne said.\nDavid Agius, deputy leader of the Nationalist Party, highlighted comments by Dr Gaudi Borda's daughter Anabelle that her father had a heart of gold. He was a man who worried for people he did not even know.\n\"Lino Gauci Borda was a politician for the people who served in difficult times\" he said.\nAs former minister Tonio Borg had written, he was a  model of how someone should represent the people, quietly and with steadfastness. \nMr Agius observed how in his maiden speech, 42 years ago, Dr Gauci Borda had stressed the need to show the people that in parliament, MPs were working together  for the country. Unless that happened, the people would continue to be divided, and the country could not move forward if it was divided.\nSuch words could easily be applied to the present, Mr Agius said.\nTributes to former Chief Justice\nJustice Minister Owen Bonnici led the tributes to former Chief Justice Giuseppe Mifsud Bonnici, who, he pointed out, was fondly known by everyone as Ġoġo.\nChief Justice Giuseppe Mifsud Bonnici.\nHe was one of the country's philosophers, a man who was as humble as he was learned.  \nProf. Mifsud Bonnici had lectured practically all current lawyers on natural law and human rights. He would long be remembered as a judge for the fair as well as efficient way he handled his cases and for the way how, on his retirement, he sought to teach points of law to the people through his frequent appearances on TV. \nDespite coming from an illustrious political family he always showed himself to be impartial. \nDr Bonnici also praised Prof. Mifsud Bonnici for his contribution to sports, having been chess champion in 1955 and a long-serving president of the MFA.\nOpposition leader Adrian Delia said Prof. Mifsud Bonnici distinguished himself in everything he did - on the Bench, in the European Court of Human Rights, as president of the Chamber of Advocates, president of the Casino Maltese, president of the MFA, and a member of the UEFA disciplinary commission.\nA particular characteristic of Prof. Mifsud Bonnici was the depth of his thought and the way how he thought an argument through, something which he expected of all his students. \nBut more than anything, he would be remembered as a legal giant who always sought the truth and human rights and who loved his country and its people, Dr Delia said.\nSpeaker Anglu Farrugia associated himself with the condolences expressed by both sides of the House.\nNationalist MP Carm Mifsud Bonnici also thanked both sides for the comments made about his uncle.  ", "comment_count": 0, "id": 1844}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A magistrate has decided to allow testimony by court-appointed expert Martin Bajada in the compilation of evidence against three men accused of the car-bomb murder of journalist Daphne Caruana Galizia.\nLawyers representing one of the accused, Alfred Degiorgio, had filed a constitutional application in March 2018 arguing that Martin Bajada's appointment to the case violated their clients' fundamental human rights.\nMr Bajada continues to enjoy the trust of several members of Malta's judiciary, despite having been convicted of theft and fraud back in 1993.\nIn January Mr Justice Silvio Meli ruled that the circumstances did not pose any danger to Mr Degiorgio’s human rights and he therefore dismissed his application\nHowever, the issue is still subject to appeal, lawyer William Cuschieri had argued, insisting that therefore, Dr Bajada should not be allowed to testify in the compilation proceedings.\nIn a ruling on Monday, Magistrate Claire Stafrace Zammit said that  the court’s function in compilation proceedings “is strictly to gather evidence and it is in no way to determine guilt or mete out punishment.”\nCiting a judgment delivered by the First Hall, Civil Court in its constitutional jurisdiction, presided over by Mr Justice Grazio Mercieca, the court observed that interim measures were clearly exceptional in nature, thereby further reinforcing its decision to continue to gather evidence by “hearing all prosecution witnesses including that of Dr Bajada.”\nThe compilation of evidence continues later this week.", "comment_count": 0, "id": 1845}, {"keywords": "", "author": "", "article_body": "The weekend storm saw wind gusts reach a record 72 knots or 133km/h, Prime Minister Joseph Muscat told Parliament on Monday.\nHe said the storm was the worst to hit Malta since October 1982 although, luckily, no one was injured. In that 1982 storm, which was \"characterised by rain,\" Dr Muscat said, four people had lost their life. \nHe said the government was urgently carrying out an assessment of the damage and would seek funds from the EU, if eligible. It would support those affected, without becoming a private insurance.\nDr Muscat thanked all those uniformed personnel and volunteers who had worked long hours to make the roads safe.  \nIn 48 hours, he said, the Civil Protection Department received and assisted in 486 calls. In some cases it was backed by the police and the army.  \n14 people were evacuated in Sliema and 12 from two localities in Vittoriosa. \nRead: Top wind speeds, temperatures and rainfall - the storm by the numbers\nThe damage was mostly in felled trees, demolished walls, water tanks, PV panels, collapsed roofs and balconies and downed masts and wires. \nIn 48 hours, personnel collected 155 tons of debris from the streets and another 30 tons would be collected by the end of the day. Most of the work was concentrated on Xemxija, Spinola, Balluta and Ta' Xbiex promenade.  \nOver the weekend, Enemalta received more than 2,000 calls of which 987 involved storm damage.\nDr Muscat said there had been no need to move the gas tanker at Delimara.\nHe said the Water Services Corporation had described damage to the undersea water main between Malta and Gozo as substantial. Repairs will start once the sea is calm. \nHelp for farmers\nDr Muscat said the government would help farmers who had suffered damages. In this case, state aid rules could be waived because of the particular circumstances. An assistance scheme and a freephone service will be announced in the coming days. \nInfrastructure repairs\nDr Muscat said an assessment was being made of damage to the infrastructure, which had, however, generally held well. \nParticular attention would be given to the state of historical sites, where damage may not be immediately evident but may affect the longevity of the sites.\nThis storm showed the importance of ongoing maintenance of the infrastructure and its updating. For instance, old poles needed to be replaced and, where possible, cables should be run underground. \n\nDelia thanks rescue and repair crews\nOpposition leader Adrian Delia joined the Prime Minister in thanking all those who helped out in the storm, also thanking public-spirited individuals who had also helped clear the streets. \nHe said the PN was backing the government's efforts to seek solidarity funds from the EU and said the PN MEPs were already working to this end.  \nHe also backed the government's commitment to help farmers and said assistance should also be given to Carnival enthusiasts who had also suffered damages.  \nReplying to questions from a number of MPs, Dr Muscat said that, coincidentally, some weeks ago the government agreed to increase resources for the Civil Protection Department, including building an earthquake-proof compound and outlying facilities for quicker response to emergencies. \nAfter the storm. Video: Jonathan Borg", "comment_count": 33, "id": 1846}, {"keywords": "", "author": "", "article_body": "Malta’s human rights NGOs are “deeply concerned” by plans for the importation of Turkish nationals to work on a number of major construction projects and behoused in metal containers.\nIn a statement, NGOs Aditus foundation, Jesuit Refugee Service, and Integra Foundation said it was clear that the reported housing conditions were inadequate.\nThe Sunday Times of Malta this week reported how the Turkish ‘village’ that was being constructed illegally in a quarry just outside Mqabba was intended by its developers to remain in place for at least five years.\nThe compound was meant to serve as residential quarters for hundreds of Turkish construction workers imported into the island on low wages.\nHowever, work has ostensibly stopped after the Planning Authority intervened.\nThe project was devised by local road construction magnates and quarry owners Bonnici Brothers Group of Burmarrad, together with TACA Construction, a large Turkish firm based in Ankara.\nLast week, the Times of Malta published a report about what was going on in the Mqabba quarry, as containers were being erected and workers were seen already living on site. Following the report, the Planning Authority sent its inspectors to stop the work.\nDescribing the ongoing development as “illegal”, the planning regulator said that “it found no evidence that any persons were living there”.\nMeanwhile, the NGOs on Monday said it was upsetting to read that hundreds of men would be housed in metal containers or similar make-shift structures and paid the lowest possible rates in return for what is extremely tough and strenuous work.\nUnder no circumstances, the statement reads, could metal containers be considered humane treatment, and the refugee centres in Ħal Far provided ample evidence of the severe impact such living conditions had on a person’s physical and mental health.\nThe sleeping compounds that have been installed in an Mqabba quarry. Photo: Matthew Mirabelli\nFor too long, Malta had been on a path of normalising the ill-treatment of certain foreigners.\nIt would appear that the lives of those migrants filling the employment gaps of work often described as ‘what the Maltese no longer want to do’ were deemed less significant, less worthy, and less human, the statement read.\n“Malta has the obligation to respect, protect and fulfil the fundamental human rights of all persons in Malta, irrespectively of their nationality or their purpose of stay in Malta,” they said.\nFurthermore, it was unclear whether Government’s assessment as to the modalities of this ‘importation’ had taken into account the complex issues it would inevitably raise.\nWere relevant institutions well-equipped to ensure on-going monitoring of working conditions? Had the risk of onward human trafficking been factored and addressed?\nWould the workers be allowed to actually have a social, religious and personal life outside working hours? Would membership in local trade unions be permitted, so that their right to free association could be guaranteed? How would the Government prevent and tackle the negative and possibly violent response from far-right or other disgruntled sectors?\nThe NGOs were also keen to underline that Malta’s recent ratification of the ILO Protocol on Forced Labour was in stark contrast to this situation and to the broader and on-going treatment of migrant workers.\nNotably, the Protocol highlights that “there is an increased number of workers who are in forced or compulsory labour in the private economy, that certain sectors of the economy are particularly vulnerable, and that certain groups of workers have a higher risk of becoming victims of forced or compulsory labour, especially migrants.”\nThe group therefore strongly urged the government to ensure that these Turkish workers, and all other foreign workers, were guaranteed the legal, social and judicial protection they were entitled to.", "comment_count": 8, "id": 1847}, {"keywords": "", "author": "", "article_body": "Gusts of wind reached the force 12 speed of 133km/h during Sunday’s storm, Malta’s meteorological office told Times of Malta.\nThe breakneck wind gusts were recorded at 4am on Sunday morning at a Valletta weather station – the same station which recorded the highest hourly average wind speed of 52.8 knots (98 km/h) just one hour earlier, between 2am and 3am.\nAccording to the Beaufort Scale, winds faster than 118km/h are classified as Force 12, or hurricane level. \nWinds ranging between 89 and 102 km/h, which is the range in which most of Sunday's wind fit, fall into the force 10, or storm, category.\nWatch: 'We lost everything': two separate eateries, one fate\nAlmost 50mm of rain – 47.6mm to be precise – poured down on Malta during the storm. That was more than half of all the rain Malta received in February so far, and meant February 2019 has been significantly wetter than the monthly average.  \nThe wind and rain misery was compounded by near-freezing temperatures, meteorological data indicated, with thermometers in Dingli going down to 1.7 degrees Celsius at 7.10pm. Luqa residents got the warmest weather, with temperatures rising to maximums of 15.6 degrees on Saturday and 11.3 degrees on Sunday.  \nBy the numbers\nFastest gusts of wind: 133km/h \nHighest hourly average wind speed: 98km/h\nPrecipitation: 47.6mm (82.8mm in February so far)Lowest temperature: 1.7°C\nHighest temperature: 11.3°C\n\nWhat caused the storm?\nThe weekend’s storm was the result of a depression, or low-pressure system, forming over Greece. This then moved over northern Libya and extended towards the Maltese islands. Meanwhile, a high-pressure system – an anticyclone – spread over western and central Europe, extending towards Algeria.\nWhen those two contrasting systems met, winds picked up and the weather became unstable. The larger-than-usual differences in pressure and size added to the instability, a Malta International Airport representative explained.\nWhat will the weather be like in the coming days?\nYou can expect more wind on Wednesday and Saturday, though the Force 6 north-west winds projected will be significantly lower than the storm winds Malta experienced this past weekend.\nOther days are expected to be stable, with partly cloudy weather and temperatures ranging from daytime maximums of 17 degrees to night time lows of 7 degrees.", "comment_count": 1, "id": 1848}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta has dropped four places in the Euro Health Consumer Index, an annual ranking of the performance of different countries’ health systems.The country fell to 27th place out of 35 countries in 2018, having been ranked at 23rd the previous year, following a marginal decline from 642 to 631 points, compared to a maximum of 1,000.The index, published Monday by Swedish policy think-tank Health Consumer Powerhouse, measures the performance of national healthcare systems by assessing patient rights and information, accessibility, treatment outcomes, range and reach of services, prevention and pharmaceutical use.Malta’s assessment remained unchanged from the previous year’s report, with the authors citing decent accessibility, but less strong treatment results.“There seem to be gaps in the public subsidy system of Maltese healthcare,\" the report states. “This is particularly prominent for drug subsidies; many Maltese do not bother with receiving a subsidy. The result is that Malta has little data on drug use.”\nLost points in two categoriesBetween 2017 and 2018, Malta lost points in two of the six assessment categories, namely treatment outcomes and pharmaceutical use. The drop may have been affected by the tightening of scoring criteria and the replacement of two previous indicators with two new ones, access to psychiatric care for children and suicide reduction, the latter of which Malta scored poorly in.There seem to be gaps in the public subsidy system of Maltese healthcare\nA think-tank representative had not replied to questions at the time of writing. The report also notes, as in previous years, that Malta remained one of four European countries where abortion rights did not exist, which earned the country a zero point marker “for particularly abominable results” on that indicator. “Legal bans do not prevent abortions but rather turns them into a major health risk, forcing women to go abroad or having an abortion under obscure, insecure conditions,” the report states. “The latter affects almost solely women in socio-economically deprived circumstances.”Overall, the report found that European healthcare was steadily improving, with infant mortality and survival rates of heart disease, stroke and cancer all moving in the right direction. Patient choice and involvement were also found to be developing, but many countries were deemed to be sticking to inefficient ways of funding and delivering care services.Switzerland was ranked top, dethroning the Netherlands for the first time in 10 years and scoring 893 points overall. “Switzerland has for a long time had a reputation for having an excellent, although expensive, healthcare system, and it therefore comes as no surprise that rewarding clinical excellence results in a prominent position in the EHCI,” the report noted.", "comment_count": 64, "id": 1849}, {"keywords": "", "author": "Bertrand Borg, Claire Caruana, Philip Leone Ganado ", "article_body": "Their eateries had little in common, save for their seaside views.\nCome Monday, however, the owner of a fusion food restaurant in St Julian’s and the couple behind a St Paul’s Bay kiosk were both left counting their storm losses.\n“Only the kitchen survived,” Buddhamann owner Marvin Gauci told Times of Malta. “There’s no Buddhamann left”.  \nThe Corinthia-based restaurant at St George’s Bay was almost completely blown away by the high-speed gale which whipped Malta on Sunday. The winds tore off the restaurant's retractable canopy and entirely destroyed glass walls and windows, as video posted to social media revealed.\n\"We lost everything.. it's as though we lost part of our body\"- Charles Tanti\nA few kilometres further up the coast, a kiosk-owning couple in St Paul’s Bay were still coming to terms with the devastation they had suffered. Winds and waves rocked Buddhamann. Video: Facebook\nTheir seaside kiosk was completely hollowed out by the pounding waves and winds, which blew everything – kitchen equipment, cakes and fridges – out of the cabin.\n“The wind was so strong and the waves were crashing in. You stand here seeing things get destroyed and you can do nothing… I felt helpless,” owner Liliana Tanti said.\nHer husband Charles pointed to damaged ovens, fridges and even a sink and said the storm was unlike anything he had ever seen.\n\"We lost everything. Everything. It's as though we lost part of our body,\" he said. \nIt would take them at least two months to rebuild the kiosk, they estimated, as they worried about the livelihood of their employees.\nOver in St Julian’s, Mr Gauci – who is currently abroad - was still trying to come to terms with the “surreal” destruction of his restaurant.\n“Thank God I wasn’t in Malta or I would probably have been there trying to stop the glass from falling down. All I can think is what would have happened if there had been people inside at the time,” he said.\nHe, too, reckoned it would take around two months to be back up and running.\nRebuilding would begin “immediately”, he said.\nBefore and after: how the storm took its toll", "comment_count": 103, "id": 1850}, {"keywords": "", "author": "Keith Micallef", "article_body": "Members of the disciplined forces will be eligible for compensation of up to €180,000 in case of death or injury while on duty, under an occupational accident insurance scheme launched on Monday.\nAddressing a news conference, Home Affairs Minister Michael Farrugia hailed this initiative as another important measure by the Labour government following the decision to give members of disciplined forces the right to enrol in a trade union.\nDr Farrugia also highlighted the signing of the collective agreement for the police force as another major step forward. He said talks were also under way on a separate agreement incorporating members of the Civil Protection Department, the army and correctional officers.\nFinance Minister Edward Scicluna remarked that claims filed under this scheme will be handled by a specialised office, and aggrieved employees who are not satisfied with the outcome will be able to appeal.\nProf. Scicluna added that thanks to this initiative, which was listed in the Labour manifesto, employees who are injured or suffer some form of disability will not have to seek redress through court.\nUnder this scheme the maximum level of compensation will be of €180,000 in case of death. However, workers who suffer some form of permanent disability, will be able to file a claim to cover some of the expenses incurred to improve accessibility at home, such as a stair lift.\nThe scheme will come into force on May 1.", "comment_count": 0, "id": 1851}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A government official was taken to court on Monday after having allegedly asked for €500 to help a man solve a social accommodation problem when he worked in the social housing department. \nCarmel Spiteri from Vittoriosa pleaded not guilty to having, in August 2017  solicited payment for the performance of a duty within his office.\nAnother public official, Samantha Zerafa, testified how one day a client turned up, airing a grievance concerning a housing problem.\nThe man had applied for social accommodation a long time previously but had since been told that his file could not be traced.\nMs Zerafa said she accompanied the client to Mr Spiteri’s office within the Social Solidarity Ministry, leaving the two men to trash out the problem.\nSome time later, the same man had returned and told her that Mr Spiteri had asked for €500 so as to help sort out his housing problem.\nMs Zerafa told him that she would have to reveal what had happened to her minister, Chris Fearne, who then asked to meet the client. \nDuring that meeting, which she attended, the client confirmed how Mr Spiteri had asked him to fork out some €500, to help address his grievance.\nHe also claimed to have recordings of the conversations wherein such monetary requests were made.\nThe case continues.\nThe court is presided by Magistrate Simone Grech.\nLawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 13, "id": 1852}, {"keywords": "", "author": "Ivan Martin", "article_body": "The next President should not come from the Labour Party camp, Opposition leader Adrian Delia insisted once more on Monday.\nAddressing a press conference, Dr Delia said he had held talks with Prime Minister Joseph Muscat on the upcoming nomination of a new president, but had not heard back on his request for the next head of state to come from the Nationalist Party fold.\n“We had backed the appointment of Marie-Louise Coleiro Preca, and now it is time for the prime minister to show the same goodwill and back a president from the opposing political camp,” he said.\nEarlier this month, Times of Malta had reported how the PN had put forward a number of names for the nomination but that these were not likely to be considered by Castille, which was leaning towards former Foreign Affairs Minister George Vella.\nDr Delia on Monday also renewed his party's call for presidents to be approved by a two-thirds majority in the House.\nThis, he said, would ensure that presidents were truly representative of the entire country.\nChairpersons should enjoy trust of both sides\nChairpersons of national entities should also be appointed following such a vote to ensure they were both competent and impartial - enjoying the trust of both sides of Parliament.\nMonday’s press conference also saw Dr Delia, flanked by MEP hopeful Frank Psaila and MP Chris Said, question why the Venice Commission’s proposed reform of the island’s democratic structures had not yet been introduced.\n\"On December 17, the Venice Commission published its recommendations for Malta. Yet, weeks and months have passed and the government has not taken any action,\" he said.\nThe government has said it agrees with the overarching sentiment of the Commission’s report on Malta, but insists the details would have to be worked out.\nTo this end, the recommendations have been handed over to the committee tasked with reforming the Constitution.\nREAD: What rule of law experts said about Malta - and why it matters\nDr Delia, however, said that both the PN and the Labour Party agreed with the Commission and so its recommendations for an improved democracy should be introduced with immediately.\n“We cannot keep dragging our feet on something so essential to our democracy,” he said.\nAmong the various points, Dr Delia said while the attorney general was the government's legal consultant, an independent prosecutor-general should be appointed.", "comment_count": 16, "id": 1853}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government agreed to alter the parameters of a mega public tender connected to St Vincent De Paul Residence on the same day that the contract was signed.\nJames Barbara of James Caterers, who form the consortium.\nAs a result, a private consortium made up of James Caterers and a subsidiary of the db Group will rake in at least €274 million of taxpayer’s money over the next 15 years, when the original value of the tender they won was of under €60 million for 10 years.\nThe deal, which procurement experts dub as “illegal” as it does not follow established EU public procurement rules, is currently under the scrutiny of the National Audit Office. However, it has started to be implemented with the government’s blessing.\nThe fact that substantial changes were made to the original contract on the same day of its signing, emerges from partial access to the contract granted to Times of Malta by the Information and Data Protection Commissioner following a case filed by the Times of Malta.\nThe Family Affairs Ministry, headed by Minister Michael Falzon, twice refused to publish the contract citing personal and commercial clauses. The same minister also refused a similar request made by the Opposition in Parliament.\nHowever, Data Protection Commissioner Saviour Cachia overturned the ministry’s refusal and ordered it to make a redacted version of the contract available to Times of Malta.\nWhat has been established so far?\nThe contract between the government and the private consortium, originally for the building of a new kitchen and the supply of meals to residents and staff at SVDP for 10 years, was signed on November 14, 2017.\nHowever, according to the documents, Director of Contracts Anthony Cachia did not only sign that contract, worth €60 million, but also a number of ‘addendums’ and a management services agreement which, according to the government, became part and parcel of the same contract. These additions increased the value of the public procurement exercise nearly fivefold.\nApart from the catering services and building of the new kitchen, which were the original call of the tender, the government accepted that the consortium was to build, as a ‘gift’, four new blocks on public land adjacent to the current old people’s long-term residence.\nSilvio Debono of the db Group\nAccording to the original contract, James Caterers and the db Group subsidiary were only to build two new blocks, holding some 250 beds, for the government as a ‘gift’ for winning the catering contract.\nThey also accepted to make a €1.5 million cash payment every year for 10 years for the refurbishment of the old people’s homes.\nThe ‘gift’, according to the call for tenders, was to be free of charge to taxpayers. It was only on this basis that the contract was awarded to James Caterers and db subsidiary by a government-appointed evaluation committee, beating the competition of another consortium which offered a less costly ‘gift’.\nWhat happened between the award and the signing of the contract?\nAlthough the contract documents seen by Times of Malta do not go into the details of what happened between the award and the singing of the deal, the contracts signed at the end of the process completely change the scope of the original tender.\nThe ‘gift’ was to be free of charge to taxpayers\nApart from the €60 million catering and kitchen contract, which included the ‘free’ €30 million ‘gift’, (the four new blocks on public land), the government agreed to amend the original agreements.\nThis means that instead of the two extra blocks proposed by the bidder, the government and the private consortium agreed to forego the €1.5 million a year of cash payments and provide four new blocks with a capacity of 500 beds.\nAccording to the contract, these are also to be “free of charge for the government”.\nHowever, in a complete departure from the original scope of the tender, a new Management Services Agreement was inserted as part of the contract. This grants the consortium the management of their own ‘gift’, the new 500-bed residence, for 15 years.\nThe contract given to Times of Malta redacted the date when this management services agreement was originally signed and all the payments which the government was to make to the consortium.\nThis redaction is being contested by this newspaper and a decision of the Data Protection Commissioner is being sought.\nWhat happened before the signing of the contract?\nOn 9 November 2017, just three days before the signing of the final contract, a notice in The Government Gazette announced that the Finance Ministry had approved a record direct order – worth €274 million – for “management services of new hospital residence” to the James Caterers and Seabank db Group subsidiary. No tender was ever issued for the management of this ‘new’ 500-bed residence.\nThrough this direct order, it appears that the €30 million ‘gift’ on which the consortium ‘won’ the original €60 million tender was turned into a goldmine worth €274 million of taxpayer payments over 15 years.\nIs this allowed?\nParliamentary Secretary Anthony Agius Decelis, who oversaw the process.\nWhile the government, particularly Parliamentary Secretary Tony Agius Decelis who oversaw the process, argues that all was done above board, the EU law on concession contracts, dictated by legal notice S.L 174.10, is very clear.\nEstablishing parameters in which such concessions could be modified, the law states that any increase in the value of such a contract “shall not exceed 50 per cent of the value of the original concession”.\nIt also states that the new concession “shall not provide for modifications or options that would alter the overall nature of the concession.”\nThrough the changes made on the same day of the signing of the contract, the €60 million concession was turned to a €274 million concession – an increase of 456 per cent.\nivan.camilleri@timesofmalta.com", "comment_count": 16, "id": 1854}, {"keywords": "", "author": "", "article_body": "A hall at Fort St Angelo that serves as a venue for conferences and receptions, was damaged during the weekend's storm, Heritage Malta said on Monday.\nThe Egmont Hall in Fort St Angelo suffered considerable damage, particularly to its roof. External information panels were also affected, the agency said.\nThe Egmont Hall served as a cinema and theatre for British troops when the fort was held by the British forces. It is now also promoted as a venue for wedding receptions, theatre productions and corporate events.\nRead: Destruction across Malta as gale-force winds batter islands\nHeritage Malta said Fort St Elmo, which bore the brunt of the storm, escaped without damage. The prehistoric temples of Ħaġar Qim and Mnajdra, including the protective shelters, were also unharmed, but the Visitors' Centre suffered some external damage.   \nPart of the boundary wall of the prehistoric site of Tas-Silġ in Marsaxlokk collapsed on Sunday while some damage was caused to one of the pavilions at St Paul’s Catacombs.\nAll Heritage Malta sites and museums are open to the public, some of them having been closed as a precaution on Sunday.\nWatch: Before and after - how the storm swept businesses away\nUndersea water main damaged, supply unaffected\nMeanwhile, the Water Services Corporation said the storm had also damaged the undersea water main between Gozo and Malta.\nThe water supply to Gozo will not be interrupted, but the incident reinforced the need for Gozo to have an autonomous water supply, the corporation said.\nWork on the building of a reverse osmosis plant at Ħondoq is well under way.\nThe damage to the main will be evaluated once the sea is calm.   \nAttempts to tap European Solidarity Fund\nMeanwhile, the government said it had been in touch with the European Commission to begin the process of tapping into the European Solidarity Fund.\nAll government departments have officially started with studies to evaluate the extent of all damages.\nContact was made with European Commissioners Corina Cretu and Christos Stylianides by the Parliamentary Secretary for European Funds Aaron Farrugia to inform them that such studies have started, and that Malta will be formally triggering the process of tapping into the fund.\nNationalist MEP Roberta Metsola said the Maltese people were looking for tangible European solidarity after the worst storm in a generation devastated crops, destroyed businesses and damaged critical infrastructure.", "comment_count": 2, "id": 1855}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "One day after high-speed winds reaching speeds of up to 101km/h battered Malta and Gozo, the country woke up to clear skies and gentle breezes. But while Monday morning's weather gave no indication of the previous day's tempest, all across the country entrepreneurs and businesses were tallying up their damages. Seafront businesses were, unsurprisingly, the worst hit. In some cases – such as that of a gateau-selling kiosk in St Paul’s Bay – there was little left to salvage. Waterpolo sports clubs were left practically underwater; inside shops at one sea-facing shopping mall in St Julian’s, well over 30cm of water meant a lot of merchandise must be thrown away. Even structures further inland were not spared. Hibernians FC and the Malta Football Association have their work cut out if they are to close off access to the Hibs stadium, where brick walls were punctured like balloons by the howling winds.\nThe aftermath made for some striking comparison images.\nWatch the video to take a look. ", "comment_count": 1, "id": 1856}, {"keywords": "", "author": "", "article_body": "Bank of Valletta has resumed its internet banking, also giving access to third-party payment services through its branch network.\nHowever, customers who want to process payments to non-SEPA countries on the same day with that same day's value date will need to wait as the service has not yet been reinstated.\nThe bank's operations are now close to normal and the bank is concentrating its efforts on processing the last few backlogs that had resulted from a cyberattack which drained €13 million from its systems.\nA group, dubbed EmpireMonkey by investigators, carried out the heist from the bank on February 13, which led BOV to temporarily take its services offline.\nRead: How BOV hackers got away with €13 million\nCustomers wishing to seek clarifications are encouraged to get in touch with the bank through customercare@bov.com or + 356 2131 2020.", "comment_count": 1, "id": 1857}, {"keywords": "", "author": "", "article_body": "The status quo in the private rental sector is not sustainable, but in spite of this, the government’s White Paper does not go far enough, the Malta Chamber of Commerce, Enterprise and Industry said on Monday.\nIt also warned against building to cater for foreign workers, as these properties might be left vacant once the economic growth slows down.\n“Despite the scale and significance of the issues being faced by all parties involved in Malta’s private rental sector, the White Paper fell short of expectations in providing concrete, long-lasting solutions that effectively overcome the issues causing the current situation,” it said in a statement, following the presentation of a detailed report outlining its suggestions.\nThe document was formulated following an extensive internal and external consultation process on the subject, as a reaction to the government’s White Paper titled ‘Renting as a Housing Alternative’.\n“The [notable year-on-year economic growth] has benefited the country significantly from an output perspective, but it is also cause for substantial stress on the country’s infrastructure and most notably, on the housing market.\n“The current situation is characterised mainly by the fact that the shortage of workers is being matched by a shortage of affordable accommodation. However, the Chamber firmly believes that due to the irreversible nature of construction, it would be detrimental to the country to flood the market with new residential property that may remain vacant when the economic cycle eventually turns,” the Chamber said.\nThe chamber statement comes just a day after the prime minister said that foreign workers should have appropriate working and living conditions.\nThese are the Chamber's main recommendations: \n• re-assessment of the IIP programme’s property investment eligibility criteria; • a thorough audit of all private and public vacant property followed by efforts and incentives to place said resources to good use and form part of the rental property market; • a clear and directional role for the Planning Authority in ensuring supply of affordable permanent housing that addresses the needs of today and those planned for the future through policies and initiatives that promote the satisfaction of urgent market priorities while guiding/advising the market on any risk of specific potential unfeasible land uses; • implementation of the reforms proposed by the Malta Chamber and other bodies in 2018 related to Pre-June 1995 leased residential properties;• feasible, effective and reversible housing solutions that create immediate supply of affordable, comfortable yet reversible accommodation.", "comment_count": 97, "id": 1858}, {"keywords": "", "author": "Jacob Borg", "article_body": "Finance Minister Edward Scicluna told financial practitioners on Monday that Panama “is all history now”, though he quickly backtracked when confronted about his statement by the Times of Malta.\nSpeaking during the opening of an event organised by the Institute for Financial Services Practitioners, Prof. Scicluna said the MFSA, FIAU, the courts and the rule of law had all been dragged into it.\n“It is up to the historians to judge, I am not going to point fingers at who started what”, Prof. Scicluna told the audience.\nWhen questioned by the Times of Malta about his statement minutes after delivering his speech, Prof. Scicluna denied saying Panama should be relegated to the history books.\n“Panama is not history”, the minister said.\nAsked to clarify his statement about not pointing fingers at who started what, when it was Tourism Minister Konrad Mizzi and the Prime Minister‘ s top aide Keith Schembri who were implicated in the scandal, Prof. Scicluna again insisted he would not point any fingers.\nWatch: 'No legal proof' of what Pilatus Bank was doing, says President\nThe Finance Minister said during his speech that Panama was not an attack on Malta or its legislation.\nHe also said regulatory institutions needed to be strengthened, not destroyed or damaged.\nProf. Scicluna said the government was working on implementing a fifty-point plan to address any weaknesses in Malta’s regulatory framework.\nThe audio clip from the minister's speech. (.mp3 file)Your browser does not support the audio element.", "comment_count": 60, "id": 1859}, {"keywords": "", "author": "", "article_body": "There were 14,378 road accidents in 2018, a slight decrease of 4.2 per cent compared to a year earlier.\nThe National Statistics Office reported on Monday that there were 371 injuries – down by 8.4 per cent – of which 40 drivers, 16 passengers, 23 pedestrians/others and one cyclist were grievously hurt.\nThere were 18 fatalities last year, compared with 19 a year earlier.\nCars were responsible for 59.3 per cent of the injuries, followed by motorcycles (29.9 per cent) and goods-carrying vehicles (6.7 per cent).\nOf the fatalities, the two involving a driver both happened to be motorcyclists.\nA total of four cyclists were hit by passenger cars, one of whom suffered grievous injuries while the rest suffered slight/insignificant injuries.\nAnother cyclist was hit by a goods-carrying vehicle and suffered slight injuries.\nJust over two out of every three injuries were caused when two vehicles collided, the NSO said.\nBirkirkara emerged as the most likely place for collisions, with 354 cases. Marsa and Qormi were next in the list with 186 and 173 reported accidents respectively.", "comment_count": 1, "id": 1860}, {"keywords": "", "author": "Ramona Depares", "article_body": "Malta’s underwater heritage is to come under increased protection with new laws to regulate access to historical sites and artefacts that dot the seabed around the islands.\nThe breakthrough in legislation, expected to be announced in the coming weeks, was revealed by marine archaeologist Timmy Gambin.\nHis team, which is part of a University of Malta and Heritage Malta project, has been making substantial headway in surveying the Maltese seabed with a view to documenting the findings, making sure they are protected and opening up regulated access to the public.\nThe process is a laborious and painstaking one that has been going on for the best part of the last two decades, involving block-by-block investigation of the seabed.\nMarine archaeologist Timmy Gambin: “Most people recognise the importance of protecting these historical sites.”\nIt will now allow Heritage Malta to offer Maltese and foreign divers regulated access to a significant number of underwater wrecks going back to the two world wars. \nDr Gambin is the man who, in 2016, led a team of highly experienced divers for first-time explorations of a Phoenician wreck that was discovered off Gozo and which has been deemed to be the oldest shipwreck in the central Mediterranean. \nThe explorations yielded a number of historically significant results and artefacts, such as amphorae from North Africa and western Sicily and grinding stones made of lava, which originated in Pantelleria.\nAccess to underwater heritage sites such as wrecks has so far not been specifically regulated. Many divers have complained of a free-for-all scenario with the sites subjected to plundering and to irresponsible practices that threaten their safe-keeping.\nAnother complaint is to do with safe access to wrecks, with divers citing the need for marker buoys and moorings for dive boats at a number of popular sites, as well as the need to restrict fishing and protect from anchorage in the area.\nWhy should anyone feel that it is acceptable to take an amphora from an old shipwreck?\nBesides protecting such sites, the new system is expected to offer local diving schools the opportunity to register with Heritage Malta, against a fee, in order to be able to take divers down to the listed zones. Boats transporting divers to a close proximity of the sites will also be required to register.\n“Luckily, most people appreciate the necessity of protecting these sites and artefacts. After all, it would never occur to any of us to visit, say, the Domus Romanus and just take one of the exhibits. So why should anyone feel that it is acceptable to take an amphora from an old shipwreck?” Dr Gambin said.\nBut how will these regulations be enforced? After all, an underwater wreck is a different kettle of fish from your average museum entrance, where ushers are stationed and CCTV cameras are ready to record any wrongdoing.\n“It’s going to be a joint effort between all the authorities involved, including the University, Heritage Malta and patrol boats,” Dr Gambin said.\nA diver on a historic wreck off Malta at a depth of 70 metres. Photo: University of Malta/J. Wood\n“As soon as a boat moors off the wreck, its registration will be confirmed or otherwise against our database. Registered diving schools are also encouraged to inform us if they spot unauthorised divers around these wrecks. It is in their interest to make sure the system works smoothly – it is in the interest of everyone who values our cultural heritage, actually.”\nSo far, about one-third of the seabed has been thoroughly mapped in an on-going process that started some 20 years ago and that will now result in previously unimagined documentation.\nThis documentation will be used not only to allow Maltese and foreign divers to experience the findings at first-hand but will also become part of our above-ground heritage in the shape of interactive museum exhibits featuring 3D prints of the actual sites.\nA Heritage Malta exhibition that runs in Victoria until the end of August and that focuses on the discovery of the Phoenician shipwreck has already garnered substantial interest from Maltese and foreigners thanks to state-of-the-art technologies and interactive features. Dr Gambin plans to continue building on its success for future exhibitions.\nThe marine archaeologist hopes to see elements of these underwater findings become part of the national history curriculum, thus offering an interactive aspect to an academic subject which, he fears, is becoming increasingly unpopular. He is also working on using VR (virtual reality) as an experiential aide in classrooms.\n“The idea is to ensure Malta continues to stay in line with the UNESCO Convention of 2002, which lays down public access to heritage sites as a matter of principle.\n“As a nation we have matured considerably and most people recognise the importance of protecting these historical sites, and any artefacts found on them. This is why access needs to be regulated, as it is for above-ground sites like, say, the Hypogeum,” Dr Gambin concluded.", "comment_count": 11, "id": 1861}, {"keywords": "", "author": "Ivan Martin", "article_body": "Hackers posed as the French stock market regulator to break into Bank of Valletta’s IT systems and walk away with millions of euros, Maltese and European authorities believe.  \nThe group, dubbed EmpireMonkey by investigators, carried out a €13 million heist from the bank on February 13, which led BOV to temporarily take its services offline.\nThe investigations have seen the police, the financial services watchdog, the State IT authority and foreign counterparts all come together to try and trace the missing cash and fish out flaws in Malta’s banking security systems.\n“This investigation has involved a lot of collaboration, both in Malta between different authorities but also overseas, with Europol and other entities that are assisting in this,” a source privy to the details of the investigation said.\n“We are working around the clock on the case, but it is extremely complex and we have never had anything like this in Malta before.”\nA review of the bank breach has already uncovered how the hackers could have been attempting to infiltrate as far back as October 2018. A source said similar “phishing” – a method used to break into a computer system via electronic communication – had first been detected locally some four months ago. This had the same digital fingerprint as the hacking group believed to have carried out this month’s heist.\nThe hacking group is also believed to have targeted another Maltese bank, however, their attempts to infiltrate appear to have been unsuccessful.\nA source was quick to point out that banks regularly receive such threats and attempts to infiltrate their systems were commonplace.  \nHe told The Sunday Times of Malta that last year the hackers were believed to have broken into the Autorité des Marchés Financiers which regulates the stock exchange in France. \nWe have never had anything like this in Malta before\nThey then sent out e-mails to Maltese and French entities posing as the authority using an innocent-looking e-mail that included the authority’s official letter heads and a decoy document that, when clicked on, gave the hackers access to the bank’s systems.\nThe hackers then sought to move hefty sums to international banks in the UK, US, Czech Republic and Hong Kong. \nSources said the authorities had identified the BOV computers that had clicked on the malicious e-mails which inadvertently gave the hackers the keys to the vault.\nIt is not yet clear how long the hackers had access to the bank’s systems before the robbery was carried out.\nRead: Just €19 left and 'no access to my own money'\nBOV went completely dark on February 13 after they discovered their systems had been compromised. Branches, ATMs, mobile banking and even e-mail services were suspended and its website was also taken offline. \nThe attack was detected shortly after start of business, when bank employees started encountering difficulties reconciling international transfers. \nThe bank was quick to reassure customers that their accounts and funds had in no way been impacted or compromised by the incident. \nBOV said yesterday that its third-party payment services outside the euro area were being reactivated from its branch network and it would endeavour to have them fully operational by tomorrow. The bank is in the meantime working to also reinstate these payments through internet banking.\nThe bank’s euro area payments were activated last week and are operational through all BOV channels in the normal manner.\nRead: As cybercrime grows, banks are increasingly being targeted\nMeanwhile, industry veterans have their doubts as to whether all the money will be recovered.  \n“There are mechanisms in place to start tracing the money but this is not as simple as just reversing a transfer,” one of them said.\n“The bank now has to reassure people that it is secure – it is of paramount importance if customers are to continue trusting it.”\nivan.martin@timesofmalta.com", "comment_count": 110, "id": 1862}, {"keywords": "", "author": "", "article_body": "There are many pictures to testify to the strength of the storm which hit Malta on Sunday - but this one captures in a very different way.\nThe Seismic Monitoring Station at the University of Malta was able to see the surge on its monitors, which picked up the activity in a very visual trace.\nThe winds had abated slightly by Monday morning but the Meteorological Office still had a gregale advisory in force and the winds were expected to remain at Force 6/7 until 9am on Monday.\nRead: Destruction across Malta as gale-force winds batter islands\nThe winds destroyed trees and walls.\n ", "comment_count": 14, "id": 1863}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 10.35am\nThousands have signed a petition to Parliament calling on the government to turn Manoel Island into a wooded park with heritage buildings and save the iconic views from Triq Ix-Xatt.\nAccording to the petition, Midi’s Manoel Island mega-development threatens to lower the quality of life of thousands for the benefit of the few. \n“This is a historic opportunity for our government to reverse the wrongs of the past and go down in history as champion of the people,” the petition by Jamie Matthew Mercieca says. \n“Manoel Island is the last unbuilt area in the dense North Harbours conurbation – such a gem of architectural and natural heritage should rightly belong to all the people of Malta and Gozo.”\nThe Planning Authority board put off a decision on the Midi development on December 20, citing lack of information on building heights and other aspects of the project.\nHistoric opportunity for our government to reverse the wrongs of the past”\nThe plans – an extensive residential and commercial complex on Manoel Island, including a hotel and casino at the historic Lazaretto, apartment blocks, retail outlets, a yacht marina, streets and plazas – are recommended for approval, with a final decision expected in the coming weeks.\nSo far, nearly 2,500 people have put their name to the petition, which will close for signatures on April 16. \nThe “world-famous promenade views” across Marsamxett Harbour will also be obstructed. If these views, which are proudly featured on Air Malta planes are lost, the charm and draw of the promenade will be gone forever, they claim.\nMeanwhile, the sea channel will be narrowed through land reclamation and the extension of a yacht yard, bringing industrial activity directly into a densely populated area, the petition notes. Additionally, the building of apartments will generate thousands more car trips and add to the existing air pollution in the locality.\nThe petition also calls for the upgrading of the popular slipway for use by fishermen and boat owners of limited means, which it says would give a new lease of life to the country’s fading maritime heritage.\nIt also calls on the authorities to push for the transformation of Manoel Island into a recreational zone for youths, families, hobbyists, the ageing population, tourists and the community at large.\nAccess the petition here. \nFlimkien Għal Ambjent Aħjar on Monday asked supporters to make donations to the cause: \"If your health and Malta’s heritage is precious to you, we ask you to make a contribution to the Manoel Island Campaign. The studies, professional consultants’ fees and media costs needed to present a strong case at the Planning Authority cannot be borne by the small group of campaigners trying to save Manoel Island for you and the rest of Malta.\n\"Please make a contribution, no matter how small, by a secure link here, by mailing a cheque made out to ‘Nħobbu l-Gżira’, in an envelope marked ‘Manoel Island Campaign’ mailed to FAA, 23, St Anne Str, Floriana or through the Paypal donation link.\nIn their latest submissions to the PA, FAA had not objected to the development but insisted that the terms of the guardianship deed - drawn up by the Manoel Island Foundation - should be respected. The terms of the guardianship deed can be seen here.\nThe Manoel Island Foundation – chaired by Claire Bonello - had been set up by MIDI, the Gżira local council and NGOs to find the best compromise going forward. ", "comment_count": 30, "id": 1864}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nA photo of some of the devastation wreaked across Malta by the north-eastern wind dominated the front page of the Times of Malta, which also reported on a petition to retain Manoel Island as a woodland.\nThe Malta Independent also featured the weather damage, in its case that of carnival floats, along with MP Clyde Puli saying that corruption was not the only way for the country to grow, and the heads-up that a decision on a development in Mellieħa is expected this week.\nL-Orizzont's photo was of a massive tree felled by the storm, accompanied by stories about the conditions of foreign workers, as quoted by the prime minister, and the fact that the highest collection of organic waste was in Vittoriosa.\nMore soon.", "comment_count": 0, "id": 1865}, {"keywords": "", "author": "", "article_body": "A total of €73,000 in moral and pecuniary damages will be paid to seven aggrieved property owners who struck a friendly settlement with the government after taking their case to the European Court of Human Rights.\nThey complained that, given the low amount of compensation awarded to them by the Constitutional Court, they were still the victims of a violation of their right for protection of their property. All four cases had to do with the Housing (Decontrol) Ordinance.\nJesmond Portelli and Nazzareno Portelli, who own a property in Marsa, will receive €14,000 from the government. In 2016, the Civil Court (First Hall), in its constitutional competence, had awarded them €16,000 in compensation but this was subsequently reduced to €5,000 by the Constitutional Court.\nA similar experience was faced by Maria Stella Azzopardi Vella and John Azzopardi Vella when they instituted proceedings about their property in Sliema. They had been awarded €20,000 damages in February 2016 and the court also ordered they should receive €3,000 annually for every subsequent year during which the tenants benefited from the law they complained of. Seven months later, the Constitutional Court agreed there had been a violation but cut the compensation to €5,000, also annulling the order for future annual payments.\nThe Court agreed there had been a violation\nThe government will pay the property owners €17,000 jointly.\nA sum of €20,000 will be paid to Raimond Cassar Torreggiani and Geraldine Cassar Torreggiani, owners of an apartment in St Julian’s, who had complained they had been unable to repossess the property, which they needed, and for which they were being paid just seven per cent of its rental market value.\nThe Civil Court (First Hall), in its constitutional competence, upheld their claim and awarded them €50,000 in moral damages in February 2015. Just over a year later, the sum was lowered to €5,000 by the Constitutional Court.\nRose Borg, the owner of a property in Birkirkara, will be getting €22,000 from the government. In February 2016, she had been awarded compensation amounting to €15,000, which had been cut to €5,000 by the Constitutional Court five months later.\nIn view of the amicable settlements, a committee of three European judges decided to strike the cases off the list. Chief Justice Emeritus Vincent De Gaetano was among the committee members.", "comment_count": 10, "id": 1866}, {"keywords": "", "author": "", "article_body": "Chief Justice Emeritus Giuseppe Mifsud Bonnici, who also served as a judge at the European Court of Human Rights in Strasbourg, died on Friday aged 88. Known as ‘Ġoġo’, he was an inspiring and tenacious figure who was not afraid to speak his mind.\nVincent De GaetanoChief Justice Emeritus and Judge at the European Court of Human Rights.\nFor lawyers of my generation, Giuseppe Mifsud Bonnici was always there, dominating the legal scene. He inspired generations of law students by instilling a sense of discipline in legal thinking and drumming into their heads that Horace’s expression ‘est modus in rebus’ (there is a mean, or method, in all things) cut across the fields of law, ethics, morality and many other disciplines besides.\nHis struggles – as a lawyer, as President of the Chamber of Advocates and, later, as a first instance judge – to have justice delivered within a reasonable time in the face of ingrained practices which treated benignly dilatory pleas and tactics, deserve an entire book. Indeed, it was when he began trying constitutional redress applications in first instance, and later when as Chief Justice he presided over the Constitutional Court, that constitutional and human rights cases started being dealt with the expedition they deserved.\nHe was also instrumental in kick-starting – again in the face of opposition or scepticism even from some members of the judiciary – the process to ensure greater practical and administrative, as opposed to merely notional or constitutional, independence of the Judiciary from the Executive.\nHe promoted the setting up of the Commission for the Administration of Justice, as well as amendments to the Code of Organisation and Civil Procedure minimising the powers and functions of the Minister for Justice in the internal organisation of the courts and the distribution of work among judges.\nTonio BorgFormer deputy prime minister and European Commissioner.\nHe was a man of various talents – a champion of chess and a man who had everything under control. He was very Mediterranean in that sense, but he had a kind heart. He was my lecturer and as a judge, he introduced new concepts in human rights.\nHe inspired generations of law students\nJudge Mifsud Bonnici was a committed Catholic and in every aspect of his life he put the Catholic identity at the heart of his work. He was a man of principle who always thought the weaker person should be protected. His character dominated a discussion, and no one could mistake his poise and his arguments. Those who did not know him might have seen him as emotional but what he was deep down was kind-hearted.\nRead: Mifsud Bonnici funeral postponed to Tuesday\nHe always thought of the little guy. He will be remembered as someone who was outspoken, opinionated and always spoke up for what he believed in. This character trait marked all aspects of his life. He had many hobbies outside law and politics, working with the Malta Football Association. In all areas, he always spoke up for what he thought was the right thing to do.\nProf. Ray MangionHead of department, Legal History and Methodology, University of Malta.\nIn an opinion piece just over two years ago penned to mark Judge Mifsud Bonnici’s Award for Academic Excellence, Prof. Mangion described Judge Mifsud Bonnici as a “luminary of a polychromatic character”.\nJudge Mifsud Bonnici was a member of the most distinguished political and legal households in Malta, Dr Mangion wrote. “He belongs to the Cottonera stock but other descendants originating from Qormi included formidable individuals varying from ascetic poets to engineering scientists of the highest quality.\n“He had been active all his life and was president of the University Students’ Council from 1951 to 1958.\n“Since his childhood, he had been infatuated by the game of chess, certainly more intriguing and mind-boggling than philosophy of law. Mifsud Bonnici was a man who believed in appearance. He loved to quote from Clyde Bell who chiselled a fabulous monograph on the art of dressing as an underlying concept of civilisation since the Renaissance.\n“He looked at philosophy of law as equivalent to philosophy of life from the moment he discovered the writings of Oxonian John Finnis. Mifsud Bonnici had always emphasised that his greatest fortune was the fact that he was ‘Beato Fra Le Donne’”.", "comment_count": 6, "id": 1867}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 5.17pm \nFarmers suffered a huge level of damage to their crops and structures as winds reaching speeds of 101km/h battered the island on Sunday, with losses amounting to tens of thousands of euros each.\n“Most farmers do not remember this much damage or such strong winds,” Malcolm Borg from the Għaqda Bdiewa Attivi told Times of Malta.\n“Those with greenhouses were the most affected: they suffered a double whammy with the loss of their structures and the high-value crops inside.”\nMr Borg said full-time and intensive farmers would also have had a lot of crops at this time of year as it tended to be a good time to put greenhouse crops on the market.\nThese farmers, he said, would effectively have to start from scratch:  “Their very livelihood has been threatened: they have woken up to find everything they’ve worked for over the last months completely gone.”\nInsurance, Mr Borg added, was unlikely to go far in compensating for the damage, as insurance companies have said they do not have enough data to offer schemes to protect farmers.\nPrime Minister Joseph Muscat said on Sunday that Malta would be looking to tap EU solidarity funds to help alleviate the burden.\nThe Nationalist Party called for \"urgent compensation\" for farmers and suggested the creation of an expert task force to draw up a report on damages farmers had incurred. \n\"We urge the government to create insurance schemes for farmers, to protect them from these incidents,\" said Nationalist MP and spokesman for agriculture Edwin Vassallo and MEP candidate Peter Agius in a statement. \n‘We have never had to cancel a race before’ \nThe organisers of the Malta Marathon expressed their dismay at having to cancel a race for the first time in 34 years, but insisted the stormy weather left them with no choice.\nThe annual race was officially called off late on Saturday, with organisers saying that while they were ready to brave the weather, the worsening conditions meant cancellation was the only way to ensure safety.\nSome 4,900 runners had been set to take part, with many having flown in from overseas specifically for the event.\n“We delayed the decision as long as we were hoping things would get better, but we had to think about the safety not only of the athletes, but of the volunteers, the public and third-party contractors,” organiser Joe Micallef told Times of Malta.\nPhotos: Storm turns Malta's roads into an obstacle course \n“In a sense, we are relieved that the weather turned out the way it did because at least we didn’t cancel in vain: it really would have been dangerous for everyone involved. In fact, the vast majority commended us on the decision.”\n\nMr Micallef said the organising team would now be examining the balance books - he estimated expenses that had already been paid before the cancellation in the tens of thousands - and looking into the possibility of offering a discount to those who want to take part again next year. \n“We were always clear that refunds would not be possible even if the race were cancelled. Unfortunately this is something that happens sometimes all over the world.”\nCat shelter 'desperate' for help\nA Cospicua cat shelter that cares for around 300 cats made a desperate call for volunteer help on Sunday afternoon, as organisers struggled to keep up with storm damage.\n\"We are not coping as we are right now,\" Carers for Stray and Abandoned Felines wrote on Facebook. \"We know that everyone wants to stay cosy at home, but the cats need to eat no matter what the weather conditions are\". ", "comment_count": 22, "id": 1868}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A trip to the supermarket is no big deal for most, but for 11-year-old Ben it only became possible after he was introduced to service dog Quincy.\nUp until a year ago, a supermarket trip for Ben’s family would have required a very close watch and holding on tightly to his hand, something that could easily frustrate the child.\nBen and Quincy. Photos: Matthew Mirabelli\nNowadays, Ben, who is autistic, is strapped to Quincy by means of a harness, and the golden retriever manages to keep him close to his parents while allowing him free movement, his father, Eric Zammit, told The Sunday Times of Malta.\nQuincy is one of five autistic support service dogs trained by the Service Dogs Malta Foundation to help children integrate with the rest of the community, whether in a classroom or out on a playing field.\nBen, who immediately bonded with the two-year-old dog, has also found a sense of security in her, as she manages to calm him down when she senses that he is tense.\nShe also sleeps beside the boy, allowing the parents to get a good night’s sleep. Parents of autistic children often worry that their children will wake up and wander off during the night. Once, Quincy woke Ben’s parents up when the boy got out of bed.\nAnother big fear for parents is that their children will run away into some crowd, get lost, and then be unable to explain to people where they live. A service dog does not allow them to wander too far off.\nSome autistic children meanwhile seem to feel more at ease around a service dog. One child even uttered the first word to one of the dogs, Joanne Cremona from the foundation said.\nThere is a huge demand for them\nBen first met Quincy at school, where her trainer Robert Spiteri would take her for one-to-one sessions with the boy.\nLike her peers, Quincy was sourced at just six months of age and was fostered by a puppy raiser, during which time she was taught basic commands and how to socialise.\nBy the time she started being trained by Mr Spiteri, she had got used to being around children, traffic and crowds.\nMr Spiteri then started taking Quincy to therapy sessions at resource centres, observing her interactions with children, while training her in more specific commands.\nThe whole process takes around two years and costs the NGO at least €15,000.\nSome 20 dogs have been trained since the Service Dogs Malta Foundation was set up in 2013, with five ‘graduating’ and matched with a child.\nThe Burmese mountain dog Bliss attends resource centres as part of her training.\nThe training process is quite rigorous, in line with international standards. Those dogs that do not ‘graduate’ are given another chance. If they ‘fail’ again, the foundation may decide to keep them on as therapy dogs who visit residential homes – and there is a huge demand for them.\n“We have the dogs, we have the demand, but not the volunteers – we need people who are willing to pick up the dog from the foster family and take it to places such as elderly people’s homes,” Ms Cremona said.\n“We have seen residents who never get up from their chair reaching out and even walk up to the dogs!”\nHowever, at the moment the foundation is especially in need of puppy raisers and of funds to source and train support dogs that could be matched with autistic children, of whom there are 22 on the waiting list.\nFor the time being it is focusing on training autism assistance dogs, diabetic alert dogs – which learn when sugar levels of those around them drop dangerously low or spiral dangerously high – and therapy dogs. \nWhile the dogs remain the property of the foundation, they need to continue being trained by the family that they are matched with. Should the NGO feel there is any form of mistreatment or lack of care, the dogs will be returned.\nMore information is available on www.servicedogsmalta.org or the Service Dogs Malta Foundation page on Facebook.\nCurrently Robert Spiteri is training five dogs, and the foundation has three puppies in need of a foster family. Photos: Matthew Mirabelli", "comment_count": 0, "id": 1869}, {"keywords": "", "author": "Keith Micallef", "article_body": "No foreign construction company outside the European Union would be allowed to engage non-EU workers in Malta at below the minimum wage, the Prime Minister warned on Sunday.\nHowever, he acknowledged that the government might have to change the laws, to close “potential loopholes” which could encourage such abuse.\nJoseph Muscat sounded this warning when interviewed on the Labour radio station. \nRead: ‘Turkish village’ outside Mqabba was to stay for five years\nHe said that, since 2013, the number of foreign workers in the construction industry had only increased marginally - from six to seven out of every 100.\nReacting to concerns that thousands of Turkish construction workers were on their way to Malta, he pointed out that this contractor was not the one working on the Addolorata junction, but on a massive private development in Sliema. \nDr Muscat said he wanted to debunk certain “myths”, saying it was not true that 5,000 Turks would be imported, but 500. And, so far, only 60 had arrived. \nHowever, he expressed his concern on the employment conditions and their living quarters in Malta. \n“It is not acceptable for them to be accommodated in tents. This is out of question,” he remarked. \nThe Prime Minister added that if decent conditions were not provided, no work permits would be issued and if they were issued, they would be revoked. \nHowever, Dr Muscat acknowledged that from an analysis of Maltese legislation it transpired there was a “potential loophole” with regards to non-EU companies engaging third country (non-EU) nationals. Such situation arose as there seemed to be a vacuum in regulations, he said.\n“We are ready to enact a law in this regard… We will not tolerate non-EU workers being paid below the minimum wage as this would be unfair competition to Maltese workers,” he added. \nEnvironment\nDr Muscat referred to an afforestation project in Bengħisa saying 5,000 trees would be planted. He denied rumours that this was being done to compensate for a further expansion of the Freeport. However, he said that the Environment Resources Authority was exploring the possibility of expanding the Freeport through land reclamation. \nSpeaking about waste management, the Prime Minister said that by the end of the year the bottle return scheme would be introduced, whereby customers would be charged 10 cents extra, which they could reclaim if they returned the plastic container. This was being done to safeguard the environment and avoid the disposal of plastic into the sea, he said. \nAs for domestic organic waste, Dr Muscat noted that 7,000 tonnes of organic waste had already been collected since the introduction of this scheme last November. \nThe Prime Minister reiterated that, later this year, a decision would be taken on when the importation of fossil-fuel cars would be banned. Malta, he said, wanted to be among the first group of EU countries to start the transition towards electric cars. This could happen in seven, eight or 10 years’ time.\nDr Muscat added that government would be rolling out incentives to help owners of electric cars with their electricity bill if they charged their vehicle at home. \nCrime\nDr Muscat welcomed the news that criminality in 2018 had declined by seven per cent. Such achievement belied the harsh criticism the Opposition had been levelling against the police force in recent years, he remarked. \nHe expressed disgust at the wave of vandalism in the form of graffiti which was spreading around the island. The Prime Minister said that the police were working hard to find the culprits.", "comment_count": 47, "id": 1870}, {"keywords": "", "author": "", "article_body": "Gâteaux and bottles of wine were available for the taking in St Paul’s Bay as the contents of a street kiosk ended up in the middle of the road as a result of the winds that wrecked the Maltese hours in the past hours.\nIn a video posted on social media (see above), Rene Rossignaud filmed the goods available amid the wreckage.\nThe stall appeared to have been abandoned by the owner, presumably as the storm took a turn for the worse. \nThe incident happened in the same area where hundreds of fish were washed onto the roads as gale-force winds whipped the island. ", "comment_count": 13, "id": 1871}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia on Sunday accused Prime Minister Joseph Muscat of creating a new “poverty class” instead of the much vaunted new middle class that he used to speak about.\nThose in poverty or at risk of poverty were growing, he said.\nHe lamented the lack of planning that was characteristic of this government and said he had made it his mission to bring the PN back to the people after it had distanced itself from them over the years.\nDr Delia said the party would be there to help people bearing the brunt of the government’s decisions.\nThe PN had an open door policy and did not discriminate between nationalists and labourites, he said.\nDr Delia said children were being taught in containers, the Marsascala police station was in a container and workers were sleeping in containers. “Is this the best of times, with children, the police and workers all in containers? Was this Joseph Muscat’s vision”, Dr Delia questioned.\nTurning to Gozo, Dr Delia said the island would remain a priority for the PN.\nHe said the government had completely forgotten Gozo and was now trying to make amends by building a tunnel.\nDr Delia said a regional council for Gozo should be set up to given Gozitans more say over issues affecting the island.\nHe also announced that Gozitan MP David Stellini will be contesting the MEP elections.\nOn declarations by HSBC that the financial sector was suffering reputational damage, Dr Delia said the matter worrying for all.\n“You have a global bank with global impact saying its losses were due to reputation damage. We should all be concerned about this”.\nDr Delia slammed the Finance Minister for failing to say what steps would be taken to reverse this damage.\nHe also accused the government of treating farming as a dying trade and said the sector was being slowly killed by the government.\nDr Delia vowed that the PN would defend farmers and seek ways to help them, including by tapping EU funds.\nThe Opposition leader warned that there was only a short window of opportunity to save this sector.", "comment_count": 14, "id": 1872}, {"keywords": "", "author": "Claire Caruana", "article_body": "Alternattiva Demokratika co-founder Arnold Cassola resigned from the party solely over the abortion issue, insisting with The Sunday Times of Malta his principles come first.\nSpeaking a week after announcing he would resign from the party, Prof. Cassola, a former AD chairman, described himself as  “a consistent person” who stuck by his principles, even if that meant leaving the party which had been a major part of his life for many years.\nHe told the newspaper that while, as is the case in every party, there were always issues that members disagreed on, it was the abortion debate that prompted his departure. He dismissed rumours that there might have been other problems brewing between AD chairman Carmel Cacopardo and himself. \n“Of course it doesn’t mean that we didn’t have disagreements on other things, as is the case in any political party. But there are things that are too important. This is an important issue for me and for all of us.\n“The internal discussion in AD has always been ongoing, as with any other parties. In these discussions there are also people who are in favour or against. Obviously times change and I am from an older generation and it’s just about the principle you believe in really,” Prof. Cassola explained.\nThere is a big gap in Maltese politics at the moment and people are very confused, and this abortion issue might have confused them even more\nAccording to the former AD chairman, the party had given him assurances “in writing” that it was going to campaign on an anti-abortion plank, noting that while AD remained against abortion, it was not dissociating itself from comments made by MEP candidate Mina Tolu. The AD candidate last week said that political parties’ refusal to discuss abortion and reproductive rights was “frightening and unacceptable”.\n“What irked me is that on such sensitive issues you don’t just go and propose something off the cuff on Facebook,” Prof. Cassola said.\nOn whether there had ever been any other instances in the 30 years he spent with AD when he had ever mulled quitting the party as a result of similar conflicts, Prof. Cassola said that this had never been the case.\n“There were never such serious issues where somebody just went out and spoke up. Unfortunately, we are in a context where people don’t distinguish between the person and the party especially in a small place like Malta, where you cannot just say that you want a personal discussion,” Prof. Cassola said.\nWhen this happens, he said, parties should amend their policies, take these to members during the Annual General Meeting and only if they vote in favour of introducing them should these be taken up.\nAsked about his decision to contest the European Parliament elections as an independent candidate and whether he believed he had a chance of being elected, Prof. Cassola said that while he received “a lot of positive feedback” for sticking to what he believed in, he was also aware of the fact that in Malta such candidates did have not successful track records.\nHe insisted, however, that he wanted to “be there” for those voters who were confused and who did not feel they could vote for either of the two main parties.  \n“There is a big gap in Maltese politics at the moment and people are very confused, and this abortion issue might have confused them even more.\n“There is certainly a lot of confusion with people not sure who they identify with. When you have both parties voting in favour of petrol stations, both in favour of the Gozo tunnel, both in favour of hunting, land reclamation, who do people turn to? There are certainly people who do not have a home anymore.”\nProf. Cassola was among the founders of AD in 1989 and secretary general of the European Greens Party between 1999 and 2006. He was a member of the Italian Parliament between 2006 and 2008.\nIn the 2004 election for the European Parliament he obtained 9.33 per cent (or 23,000 votes) of the first-preference votes, just failing to be elected one of Malta’s five MEPs.\n ", "comment_count": 22, "id": 1873}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man arrested during a major police operation on Friday has been denied bail upon his arraignment on Sunday after pleading not guilty to drug-related offences.\nClayton McKay, a 25-year-old Qormi resident and one of three men taken into custody during last Friday’s crackdown, pleading not guilty to aggravated drug possession as well as to being a relapser.\nThe court, presided over by magistrate Gabriella Vella, heard how the police had found some 163 grammes of heroin and 91 grammes of cocaine in the suspect’s possession during last Friday’s search.\nBack in November 2017, the man had landed a €1,000 fine after he was found guilty of the unlicensed possession of a weapon and of firing the same weapon in an inhabited area.\nDuring Sunday’s arraignment, a request for bail was turned down in view of the fact that civilian witnesses were still to testify, the risk of tampering with evidence, as well as on the basis of the gravity of the offences and the untrustworthy character of the accused.\nThe court also issued a freezing order upon the accused’s assets, both movable and immovable, upholding a request by his defence counsel to grant him the statutory yearly allowance of some €13,000.\nInspector Anthony Scerri prosecuted. Lawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 1874}, {"keywords": "", "author": "", "article_body": "Updated Sunday 5.45pm\nThe wild winds that whipped across Malta from Saturday night turned the island's roads into a veritable obstacle course. \nUprooted trees, PV panels and even boats stood in the way of those brave enough to get into their cars.\nRead: Gale-force winds cause substantial damage; public urged to stay indoors\nMalta Public Transport said the storm had forced the closure of many roads, impacting all bus routes, with buses being diverted by the authorities. Delays are being experienced on all routes. \nLater on Sunday, MPT announced that all routes to Sliema and St Julian's, which are among the areas worst affected by the storm, had been suspended. \nTransport Malta warned road users that the storm had damaged several sets of traffic lights and that motorists should proceed with caution. \nOne video shared online shows dozens of dead fish washed ashore and into the street at Xemxija.\nDead fish washed onto the roads in Xemxija.\nWaves smash into police vehicles along the St Julian's promenade.\nAccording to the weather site Wind Finder, Malta experienced gusts of winds that are described as a “high threat to life and property”.\nIn a post on Facebook, Parliamentary Secretary Ian Borg thanked civil protection officers and workers of Clean Malta and Transport Malta who were working to clear the roads from the obstacles.\nDo you have pictures or clips to share? Send them to us on mynews@timesofmalta.com\n\nDriving through Sliema. Video: Dr Henning Martens\nTower Road, Sliema\nTower Road, Sliema. Photo: Michael Galea\nGħargħur\nThe road leading to Rabat.\nCospicua. Photo: Rachel Attard Manicolo\nXemxija. Photo: Jacqueline Van Hunnik\nTriq it-Tiben in Swieqi. Photo: Cristina Mifsud\nThis tree in Ta' Xbiex survived World War Two. Hopefully it can be saved, architect Edward Said said.\nAttard.\nAttard.\nVideo: Fabio Aufiero\nThis tree, in Gori Mancini Street, Birkirkara, fell down at around 3.15 am. Photo: Sandra Crossley\nQui-Si-Sana, Sliema. Photo: Elly Degiorgio\nTriq it-Tiben, Swieqi. Photo: Cristina Mifsud\n \n ", "comment_count": 16, "id": 1875}, {"keywords": "", "author": "", "article_body": "Roman festival of the dead\nThe ancient Roman festival of the dead was marked at the Roman Villa in Rabat last Sunday with an engaging day for all the family. The event, entitled Mortem was inspired by the nine-day ancient Roman festival of Parentalia which used to be held in ancient Rome between February 13 and 21, in honour of the Roman people’s ancestors and their departed loved ones.\nWhat made the headlines\nReport confirms pre-election passport dealings in Malta: A UK Parliament report about disinformation and fake news flagged “dealings” it says Malta’s Labour Party had in 2013 with the group that set up the notorious data-mining company Cambridge Analytica. Leaked e-mails sent in June 2011 show that SCL, the group that set up Cambridge Analytica, offered to broker a meeting between then Opposition leader Joseph Muscat and passports seller Christian Kalin of Henley & Partners. The e-mails, seen by the Times of Malta, feature correspondence between SCL and Mr Kalin, about a potential meeting with Dr Muscat. The government denied there had ever been any contact between SCL and Dr Muscat. However, the House of Commons report said SCL held meetings in Malta and Mr Kalin was introduced by SCL to Dr Muscat in 2011.\nThree shortlisted for Strasbourg court judge: The government shortlisted Madam Justices Abigail Lofaro and Lorraine Schembri Orland and deputy Attorney General Victoria Buttigieg for the post of judge at the European Court of Human Rights. The successful candidate will replace Chief Justice Emeritus Vincent De Gaetano who ends his statutory nine-year tenure on September 19. The final selection, expected to take place in April, is made by the Council of Europe’s Parliamentary Assembly.\n\nSocialists join in ‘severe’ rule of law criticism: MEPs from Prime Minister Joseph Muscat’s political grouping voted in favour of a resolution raising rule of law concerns in Malta. The rule of law resolution about Malta and Slovakia sailed through the civil liberties committee with 40 votes in favour and seven against. Voting records show Labour MEP Miriam Dalli was the only one of 15 MEPs from the Socialists and Democrats group to vote against the resolution. The resolution will be voted on in plenary next month.\nHousing concerns shoot up: Housing worries have shot up, according to the latest Eurobarometer survey, and has become the second most important concern for Maltese people after migration. When asked about the main issues facing Malta, half the respondents mentioned migration, followed by housing (29 per cent), environment, climate and energy (28 per cent), crime (19 per cent) and rising prices and inflation (19 per cent). In the last survey, 20 per cent said they were concerned about housing.\nBadly decomposed corpse found in St Paul’s Bay residence: The badly-decomposed corpse of a woman was found in a residence in St Paul’s Bay by the police on Monday evening. The woman, a 69-year-old British resident, had been dead for three months. The woman’s husband, who was questioned by the police, had apparently kept the body at home because he did not want to be parted from her. An autopsy on the body ruled out foul play as the cause of death. According to one neighbour, the woman’s husband told her that his wife, who friends said went by the name Jan, was “fine” some three weeks ago when she asked for her.\nGovernment ordered to reveal mega €274 million contract: The government was ordered to reveal the contents of a controversial €274 million contract awarded to James Caterers and a subsidiary of the Seabank db Group, following a complaint filed under the Freedom of Information Act by the Times of Malta. In his decision, Commissioner Saviour Cachia ruled that while it was true that some aspects of the contract for a 500-bed extension at St Vincent De Paul may be commercially sensitive, “the decision taken by the government to refuse, in toto, the request by the Times of Malta is not entirely justified”.\nFormer chief justice dies: Giuseppe Mifsud Bonnici, known as ‘Ġoġo’, a former chief justice and judge of the European Court of Human Rights in Strasbourg, died aged 88. First appointed a judge in 1988, he was considered a legal giant and lectured in philosophy of law at the University of Malta. He was chairman of the Commission for Press Ethics from 2001 to 2009, president of the Chamber of Advocates from 1978 to 1983 and president of the MFA from 1968 and 1982.\nWhat trended\n‘Window dressing’\nIt sounds grand: “Gozo should be the first region to completely switch to electric cars”. But what exactly does that mean?\nPrime Minister Joseph Muscat gave vent to that grand-sounding idea earlier this week, as he painted a picture of an eco-friendly nation which recycled all its waste and cherished newly forested sites.\nHis electric vision, thin on details, seemed to puzzle a few readers.\n“So they’re going to build a tunnel but then not let petrol or diesel vehicles through it?” asked a perplexed James.\nElectric vehicles should be introduced in Valletta, Sliema and St Julian’s\nPatrizio worried that talking up electric cars could distract from a more holistic environmental vision.\n“Imagine a scenario where all cars in Gozo becomes electric but 80 per cent of the island’s greenery is replaced by built-up areas .... has the environment been served well?” he pondered.\nC. thought the Gozitan emphasis was misguided “Electric vehicles should first be introduced in the polluted areas such as Valletta, Sliema and St Julian’s”\nAinsley was distinctly unimpressed by the whole thing, calling it “window dressing from the only country in the EU to miss all of its clean air targets,” he sniffed.\nHospital payment procedures\nMater Dei has cranked up its eligibility checks for foreign patients, and its CEO was keen to emphasise that revenue from such patients had tripled in just a couple of years.\nA new billing system is in the pipeline, too, and for many foreign readers, not a minute too soon.\n“Why isn’t Mater Dei connected to the social security database? Why are we forced to carry our payslips every month? Is this 21st century or stone age?” asked an irritated James.\nHe was not alone.\n“Every single time we have a hospital check-up or appointment we have to go through the same billing procedure where we have to show proof of marriage and NI and they tell us that we’re entitled for free healthcare,” wrote Shaun.\nThe complaints poured in.\n“If you’re a foreigner and present a Maltese ID card, they still ask for payslip at every single appointment. Gave them a copy of the payslip last week? Doesn’t matter, still need a new copy now,” another grumbled.\nBjarte had a litany of similarly frustrating experiences and accused the hospital of discriminating on the basis of nationality. \n“If you question it you’re met with a shrug,” he wrote.\nWhat they said\n“A society that does not respect its elders is a truly rotten society.”\nNationalist Party leader Adrian Delia, speaking at the PN general council, where he criticised Joseph Muscat for saying that people’s pensions depended on an influx of foreigners.\n“The present, post-truth, populist culture is fuelled by a sense of decay of democratic institutions, the trivialisation of news value and the banalisation of public discourse.”\nFr Joe Borg, chairman of Beacon Media Group, writing in the Times of Malta.\n\n“A metro system would take a quarter of a century and we could not drag our feet on upgrading the country’s infrastructure till then.”\nPrime Minister Joseph Muscat, speaking at the Victoria, Labour Party club, where he defended his government’s decision to upgrade the country’s road infrastructure instead of building a metro system.\n“To many of us the logic of Irish reunification is irresistible. But logic stands little chance of winning. On present indications it seems highly likely that Brexit will reopen Ireland’s historic wounds.”\nTimes of Malta columnist Martin Scicluna writing about the Irish backstop proposal.\n\n“Silence is a no-go. Whether you call it omertà or state of denial, it’s still a no-go. Whether it’s criminal or malicious complicity and a code of silence due to the trauma, we need to move away from it.”\nArchbishop Charles Scicluna, speaking at a Vatican press conference on the sidelines of a summit on preventing clergy sex abuse, answering a question about whether there was still omertà in the Church.", "comment_count": 0, "id": 1876}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta said the Turkish village that was being constructed illegally in a quarry just outside Mqabba was intended by its developers to remain in place for at least five years. In another story, the newspaper said Democratic Party leader Godfrey Farrugia and an alliance for mental health have questioned whether the involuntary commitment of a former police officer to the psychiatric hospital on Friday was legal. The newspaper also quotes Nationalist Party leader Adrian Delia saying he would not hesitate to resign should he feel he has become a liability to the party.\nThe Malta Independent quotes the Parliamentary Secretary for Gozo saying that the island as a region would be unable to apply for EU structural funds.\nIllum says Maltese women were being offered abortion pills for €90.\nIl-Mument says bankers and financial experts were concerned with the current situation in Malta.\nIt-Torċa said the BOV cyberattack was similar to an Asian theft.\nMaltaToday leads with an insider piece on the tuna bribery scandal.", "comment_count": 0, "id": 1877}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Turkish ‘village’ that was being constructed illegally in a quarry just outside Mqabba was intended by its developers to remain in place for at least five years, The Sunday Times of Malta is informed.\nThe compound was meant to serve as residential quarters for hundreds of Turkish construction workers imported into the island on low wages. However, work has ostensibly stopped after the Planning Authority intervened.\nThe Sunday Times of Malta has now learnt that the PA had turned down an application for a permit for the development.\nThe project was devised by local road construction magnates and quarry owners Bonnici Brothers Group of Burmarrad, together with TACA Construction, a large Turkish firm based in Ankara.\nLast week, the Times of Malta published a report about what was going on in the Mqabba quarry, as containers were being erected and workers were seen already living on site. Following the report, the Planning Authority sent its inspectors to stop the work.\nDescribing the ongoing development as “illegal”, the planning regulator said that “it found no evidence that any persons were living there”. It said “the owners of the quarry stated that the tent was intended to be used as office premises and not for residential purposes”.\nThe newspaper is informed that both the Planning Authority and the government were very aware of the plans to house for the Turkish workers. It can reveal that David Bonnici, one of the directors of the Bonnici Group, submitted an application, through a Direct Notification Order (DNO), to turn the soft stone quarry into a “temporary installation of foreign workers’ quarters for a definitive period of five years and tied to ongoing construction projects in Malta”.\nThe permit application was presented during Christmas week, accompanied by architectural plans drawn up by Karl Farrugia of Forward Structures Ltd.\nThe plans, seen by the newspaper, include the transformation of the quarry into a residential compound consisting of large dormitories in makeshift containers.\nThe sleeping quarters are located within a gated area closed off by high fences, completely segregating the Turkish workers from the local community. There is also a security office, a technical area as well as a kitchen and cafeteria.\nAnother building in the same quarry, also belonging to members of the Bonnici Group, will serve as an extension to the workers’ sleeping compound, according to the plans.\nAt the end of last month, the PA told Bonnici Brothers that it would not approve the project. Despite this, the Bonnici Group appeared to go ahead with construction and only aborted the work after the Times of Malta ran the story.\nA few weeks ago, The Sunday Times of Malta unveiled plans by TACA Construction to import some 2,500 Turkish construction workers to Malta in the coming weeks to work on massive projects approved by the PA.\nThe government, through Jobsplus, is facilitating this initiative by fast-tracking permits for third country nationals.\nSo far, some 300 workers from TACA have started working on the Fortina Hotel site in Tigne, despite the fact that a dispute with the government over part of the land has not yet been settled. It is understood that TACA has also beaten Maltese contractors in the bidding for other lucrative contracts.\nTACA has won the City Centre project, a multi-million development through which the Seabank db Group will be turning the former ITS site in St George’s Bay into a mega project including a hotel and a 38-storey residential tower.\nWorkers on the Fortina site are being paid €4.50 an hour, much below the rates paid by Maltese contractors.\nIt is not yet known what the relationship is between Bonnici Brothers’ and TACA.\nBonnici Brothers had not returned calls by the time of writing.\nPrime Minister Joseph Muscat recently made a pitch for the importation of more foreign workers, arguing that they are essential to pay for increased social benefits and pensions.", "comment_count": 72, "id": 1878}, {"keywords": "", "author": "", "article_body": "A 14-year-old girl was seriourly injured when she was hit by a car in Ġżira on Saturday night.\nThe accident happened in Triq ix-Xatt at 10.10pm\nThe police said the girl was hit by a Citroen C2 that was being driven by a 29-year-old man from Pembroke.\nShe was assisted by a medical team and taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1879}, {"keywords": "", "author": "", "article_body": "Updated Monday 3pm \nGale-force winds lashed Malta early on Sunday morning, uprooting trees, demolishing walls and damaging power lines, but no injuries were reported, a police spokesman told Times of Malta.An uprooted tree along the Sliema front. Photo: Harry Briffa/Facebook\nThe winds, which reached gusts of up to 101 km/hour, caused damage to electricity networks and forced road closures across the whole island. \nCivil Protection Department officials were called out to 300 separate sites to clear roads, remove dangerous walls and evacuate people from flooded residences. \nOn Monday, the government said that it would be looking at ways of tapping EU funds to help rebuild following storm damage. Farmers were among the worst hit.  \nPeople advised to stay indoors\nAuthorities advised people to stay indoors unless they needed to travel. \nAccording to Wind Finder, in the early hours of the morning, Malta experienced gusts of winds that are described as a “high threat to life and property”.\nThe Maltese Islands Weather site said on Sunday morning that the northeast wind was at its strongest in many years.\nThe 101 km/h (Force 10, almost Force 11) gusts measured by the site's weather station in Għarb were an all-time record.\nOne of the worst storms Malta has seen in recent years gradually died down as night fell, with the strong gale force gregale wind moderating overnight. \nAccording to Wind Finder, Malta experienced gusts of winds that are described as a 'high threat to life and property'.\nCPD overwhelmed\nThe CPD said it had worked with the police to evacuate homes in Sliema and Vittoriosa which had flooded. People evacuated will be offered alternative housing by the government until their homes are fixed, the Home Affairs Ministry said. \nTrees were uprooted in several areas, including on the Rabat road where a large tree completely blocked access. Another tree blocked a road near the airport exit. They were later removed. \nCleansing Department director Ramon Deguara said most of the fallen trees had been cleared in the morning, but that people could expect further collapses. \nRead: The storm by the numbers\n\"A number of large trees were partially uprooted and we’re expecting them to fall soon,\" he said, pointing out that the incessant wind and rain was not helping.\nThe Sliema and St Julian's promenade was a \"total disaster\", he said.\n\"We still have to quantify the damage. The whole operation is going to take days,\" Mr Deguara added. \nAmong other incidents, a balcony at Portomaso crashed to the ground while a number of old trees at Balluta square were destroyed.\nRead: How the storm turned Malta's roads into an obstacle course\nIn a bizarre sight, some citizens braved the weather to pick up hundreds of fish which were flung out of the sea onto promenades. \nThe following morning, the sea bream was being sold on the Xemxija promenade, fetching €10 for five fish. \nTransport Malta said the storm had knocked out several sets of traffic lights. As of 2pm, traffic lights at the Żabbar junction remained out of order. \nVideo: Mark Zammit Cordina\nThe winds blew strong enough to bend this traffic sign in Dingli.\nPolitical parties change plans\nThe storms forced the Nationalist and Labour parties to change their Sunday morning plans. \nThe closing session of the PN's general council was postponed to Wednesday evening. A Labour Party activity was cancelled. \nDestruction along the Sliema promenade.\nA collapsed tree blocks a traffic lane in Pieta'.\nPower cuts \nEnemalta said that the storm had damaged parts of its distribution network and warned that recovering electricity to affected areas could take longer than usual as weather conditions remained severe.\nOn Sunday evening, the company said it had fielded more than 1,500 calls from the public and identified 540 faults. Technicians would be working throughout the night to restore electricity to all affected areas, it said. \nWatch: Before and after - how the storm wreaked havoc\nThe company noted that the cold weather and requests for people to remain indoors had also led to a spike in demand for electricity, which was 20 per cent higher than that on the average Sunday. \nFlights and buses delayed\nSeveral flights scheduled to take off on Sunday morning were delayed, a Malta International Airport representative confirmed. Turkish Airlines flight Istanbul to Malta and Emirates Malta to Larnaca have been cancelled, five flights have been delayed for one hour, and one flight delayed two hours.\nMalta Public Transport warned customers to expect delays to all routes. \n\"Many roads are closed. This is affecting all bus routes, with buses being diverted by the authorities,\" MPT explained. \nAt 5pm, the company announced on social media that it was suspending all routes servicing St Julian's and Sliema, on the CPD's advice. \n\nA damaged windscreen. Photo: Frances Chircop\nCars damaged by a falling wall in Baħar iċ-Ċagħaq.\nRough seas and a windswept Balluta. Photo: Luca Catania\nWild seas made for an almost unrecognisable promenade at Spinola. Photo: Dominic Fenech\nGozo ferry operating, Sicily catamaran cancelled \nGozo Channel chairman Joe Cordina confirmed the ferry between Malta and Gozo was operating normally, although vessels were berthed on the far side of Ċirkewwa. \nAll Virtu Ferries catamaran trips to and from Sicily scheduled for Sunday and Monday were cancelled due to the weather, with additional trips scheduled for Tuesday to compensate.  \nCemeteries closed until Monday\nThe Environmental Health Directorate within the Superintendence of Public Health said all government cemeteries were being closed until Monday nmorning as a precaution. A destroyed tree by Saqqajja Hill in Rabat. Photo: Angela Galea Salamone\nBoats, balconies wrecked\nA power boat came undone at Manoel Island and sank a yacht, sources told Times of Malta. Two other boats in the area came undone and crashed onto rocks in the area. \nA sailor said two pontoons had come loose at the Grand Harbour and were currently without power. Scuba divers were working to reconnect them, and boat owners were not being allowed onto the affected pontoons. \n\"Water levels are rising and falling by shocking amounts,\" a sailor aboard a docked vessel told Times of Malta. \"It's freezing here, without power, but I'm glad I'm on board\". \nVideos of two separate cranes - one in Sliema, the other in Swieqi - with their steel hoppers swinging dangerously in the high winds prompted concern on social media. \nPedestrians have been urged to heed the dangers of this crane in Sir Arturo Mercieca Street, Sliema. Video: Peter Falzon\nA steel hopper swings on this crane overlooking Pender Gardens.\nFarmers suffer damage\nThe Għaqda Bdiewa Attivi said on its Facebook page that the weather wreaked havoc in farmers' fields with some estimating damages of more than €50,000 and fearing the worst as the wind blew stronger.\n\"It's heart-wrenching to wake up for another day of work to find your enterprise in tatters.\n\"We commend the bravery of our farmers to continue to fight and express solidarity especially with those whose livelihoods have been seriously threatened by these weather events.\"\n\nA video posted on Facebook showed the main road in Xemxija full of small fish that had been dragged to land by the rough seas.\nHistoric fort damaged\nA hall at Fort St Angelo and a boundary wall at the Tas-Silġ prehistoric site in Marsaxlokk were damaged, as was part of the Visitors' Centre at Ħaġar Qim, Heritage Malta said on Monday. \nSewage plant, water connections damaged\nPrime Minister Joseph Muscat said Malta's northwest sewage treatment plant, in Mellieħa, was shut down after developing a fault and then evacuated, following concerns about an unstable three-storey wall.\nDr Muscat made reference to an evacuation of people in a Sliema building, but Times of Malta is informed that the operation was called off.\nA damaged windscreen. Photo: Frances Chircop\nOn Monday, Water Services Corporation said that an undersea water connection between Malta and Gozo was damaged in the storm. \nDr Muscat said that a huge clean-up operation would be launched in the coming days to clear the debris all over the island.\nHe thanked all those involved in the ongoing operation. Dr Muscat spoke also on Gozo, saying such circumstances showed the necessity of having a permanent link.\n'Millions' in damages - Delia\nOpposition leader Adrian Delia said he had been contacted by farmers who claimed to have suffered “millions” in damages from the storm.\nFarmers from the Mġarr community, he said, who were in tears after having their livelihoods destroyed.\nContinuing on the weather story, Dr Delia said many people did not even have a roof over their heads to shelter from the storm.\nA pole smashed right through this car.\nMifsud Bonnici funeral put off\nThe funeral of former chief justice Giuseppe Mifsud Bonnici was also put off to Tuesday, relatives confirmed to Times of Malta. Judge Mifsud Bonnici passed away on Friday.\nDamaged stadium, restaurant\nHibs Stadium incurred significant damage, with trees toppling hoarding and stone boundary walls falling over. \nA clip uploaded on social media shows the moment waves destroyed the Buddhamann Restaurant in St Julian's.\n\nHibs Stadium was left the worse for wear.\nWalls toppled over at Hibs Stadium.\nBallutta Bay lashed by winds and high waves.\nStormy Saturday\nThe bad weather started on Saturday afternoon with isolated showers developing into hail storms and the odd thundery spell. \nFootball matches on Saturday evening were cancelled as was the Malta marathon which was due to be held on Sunday morning. The Nadur carnival planned for Sunday has been postponed to Thursday.\nLarge marquees used to house carnival floats to be used in carnival celebrations blew over.\nTents set up on the University of Malta's Tal-Qroqq campus for an upcoming careers fair were also badly damaged, The Yuppie reported on Sunday evening. \nCarnival floats built for next week's celebrations took a battering.\n\n\nA toppled container. Photo: Daniele Braggioli/Facebook\nDamage in Qawra.\nSteel mesh came crashing down onto cars parked in a Sliema road. Photo: Hilary Galea Lauri\nA reader sent in a picture of his neighbour's membrane which came apart and landed in his garden.\nThe gregale hitting Valletta and Sliema. Photo: James Vella Clark\nGħargħur\nA police spokesman said reports of damage came from across the islands.\nA large tree near the Addolorata Cemetery completely blocked the road as did another near Hompesh Road in Żabbar.\n\nA flight from Istanbul to Malta was cancelled because of the weather and some flights were also delayed landing. Trees were also uprooted in the vicinity of the runway. \n\nPhoto: @Keti.kate/Instagram\nOn Friday evening, the Met. Office issued a gregale advisory notice to mariners, warning them of very rough seas tonight and on Sunday as a low pressure zone over the Ionian sea extends over the Maltese islands.\nThe strong winds were accompanied by a drop in temperature, with the thermometer showing a temperature of 2 degrees Celsius in some areas, colder than most European countries at the moment. \n\nDo you have pictures or videos to share? Send them to us on  or on our Facebook page\nFootage shot at Baħar ic-Cagħaq on Saturday night. Video: Clive Camilleri\nDamaged street furniture in Għargħur. Photo: Matthew Mirabelli\nDamage in Rabat. Picture: Shaun Grech\nA tree blocking the road next to the bus stop in Triq Ta' l-Ibrag corner. Photo: Malcolm Naudi\n\nVideo: Jonathan Mohnani\nVideo: Pere Lopes\nĊirkewwa. Photo: Owen Sant’Angelo\nThree trees Dingli Street, Sliema. Photo: Rowena Pullicino - Facebook\nSliema Aquatic Sports Club. Photo: Daniela Said, Facebook\nSan Giljan Kiosk. Photo: Mr Borda, Facebook\nBonnett blown away, Windsor Terrace, Sliema. Photo: Karen Heneghan - Facebook\nThe Point. Photo: Sylvana Psaila - Facebook\nBalluta. Photo: Luisa Busuetta - Facebook\nA water tank blew off a roof in St Agatha Str, Sliema. Photo: M Spiteri\nTanks damaged by a falling wall in Tower Road, Sliema. Photo: Thomas Agius Vadala\nVideo: Attila Buris\nPhoto: Attila Buris\nVideo: Bertine Madelen Sjoeholm\n ", "comment_count": 152, "id": 1880}, {"keywords": "Education", "author": "", "article_body": "An app designed by Finnish educators and experts that provides access to many resources and lesson plans for teachers, was launched in Malta last week, and the app’s premium version will be available for free for all Maltese primary school teachers.\nTo download the app, teachers may visit the site below.\nLesson App was launched at the end of an educational conference attended by about 300 educators from Malta, the UK, China and Spain, in the presence of Dr Frank Fabri, permanent secretary at the Education Ministry.\nThe conference, led by Learning Scoop Finland, was organised by Mater Boni Consilii St Joseph School, Paola, and Tumas Fenech Foundation for Education and Journalism.\nLearning Scoop Finland has chosen Malta as the first country outside its home market to launch this type of app, said Kenneth Vella, head of the Paola school.\nLearning Scoop Finland director Johanna Jarvinen and pedagogical trainer Tuomas Taubert, who worked on the app’s design, said instructions for the app’s use will also be sent to teachers in the coming days. Training on the use of the app will also be given to trainee teachers at the Faculty of Education, said Ms Taubert.\nDr Fabri welcomed Learning Scoop Finland’s initiative, adding that the Education Ministry was always open to ideas about education, with Finland’s educational system and those of other major countries being a point of reference. He referred to various local education initiatives such as the new assessment system, the learning outcomes framework and My Journey, which will be launched in the forthcoming scholastic year.\nHe announced that in the coming days the ministry would be studying the possibility of strengthening collaboration not only with Learning Scoop Finland but also with entities from other countries.\nAlso present at the app launch was Fr Charles Mallia, Ian Mifsud and Angela Coppini from the Secretariat for Catholic Education, Prof. Sandro Caruana, dean of the Faculty of Education, Malta Union of Teachers president Marco Bonnici, as well as officials from the education directorates.\nwww.learningscoop.fi", "comment_count": 0, "id": 1881}, {"keywords": "Education", "author": "", "article_body": "Technical, Vocational Education and Training (TVET) generally has the dubious position of being the poor cousin in relation to higher education.\nStudents and their parents look at TVET options as the last resort if a university place of their choice is not available.\nGovernments throw money to build ever-expanding universities yet grudgingly acknowledge that TVET institutions are a necessity without the same level of commitment or investment.\nBut the fact is that TVET skills create new businesses and gene­rate employment. The world runs on TVET skills in virtually all industries and sectors.\nWhile some countries are starting to realise the importance of investing in and building up this area, many others place less importance on it in their quest to become ‘developed’.\nThe world runs on TVET skills in virtually all industries and sectors\n‘Revaluing TVET’ is the title of the first regional conference on vocational education and training (VET) in Malta which will is being organised by International Vocational Education and Training Association (IVETA) Europe. It will be held from May 9 to 11 at the db San Antonio Resort and Spa, St Paul’s Bay.\nThe conference will seek to redress the imbalance in the views of TVET across the different stakeholders, including parents and students themselves.\nIt will be addressed by speakers from all over the world. This presents participants a unique opportunity to learn from the experience and knowledge from leading international practitioners and academics.\nThe conference will be opened by Education Minister Evarist Bartolo. Other local speakers include permanent secretary at the Education Ministry Frank Fabri and Prof. Joaquim James Calleja, head of Mcast and current president of CEDEFOP.\nThe conference is being co-organised by Mater Boni Consilii St Joseph School, Paola, and Warnborough College, UK.\nFor more information e-mail Kenneth Vella, head of Mater Boni Consilii St Joseph School, on materbon@gmail.com or visit the conference website below.\nhttp://www.warnborough.net", "comment_count": 0, "id": 1882}, {"keywords": "Education", "author": "", "article_body": "Five students from Giovanni Curmi Higher Secondary School, Naxxar, joined six students from France and 11 students from Austria for an Entrepreneurship Education in Europe (EEE) Week at the Business Academy in Vienna. The main aim of the week was for the students to acquire a range of skills that would enrich their entrepreneurial skills.\nWorking in groups, the students had to apply the concept of up-cycling by creating a product from scratch. They had to go through all the stages of new product development (NPD), starting from the concept idea to commercialisation. The participants also learned about the cultural, professional and social realities of the host country and could therefore integrate more easily on their mobility experience.\nThe EEE Week formed part of an Erasmusplus project on entrepreneurship that the Naxxar school is participating in together with four other schools from the UK, Austria, France and Finland. Students coming from different disciplines and cultures are taking part in the project to acquire a wider range of life skills in order to be better prepared for the workplace.", "comment_count": 0, "id": 1883}, {"keywords": "Gozo", "author": "", "article_body": "Rosemary La Roche, a UK resident at St Anna Home for the elderly at Gozo General Hospital for the past five years, last Sunday received the sacraments of baptism, First Holy Communion and Confirmation by Gozo Bishop Mario Grech.\nPrior to this special event, on the occasion of World Day of the Sick, Mgr Grech celebrated Mass, assisted by one of the hospital’s chaplains, Canon Joe Cardona, for all the residents and staff, including the hospital’s CEO Joe Fenech.\nSince Ms La Roche, 75, has no relatives in Malta, she chose her nurses to act as godparents (parrini). Ms La Roche was later entertained to a small party organised by the staff.", "comment_count": 0, "id": 1884}, {"keywords": "Gozo", "author": "", "article_body": "This year, the Gozo Tourism Association is celebrating its 20th anniversary. To mark the occasion, the association organised a tree-planting event at Villa Rundle Gardens in Victoria, led by Gozo Minister Justyne Caruana (pictured). The function was followed by a press conference at the Citadel Cultural Centre.\n\nDr Caruana praised the work of the association for the past 20 years. She said the association has been active not only by strengthening the tourism sector in Gozo, but has also worked closely with the ministry and the government in drawing up new proposals and initiatives for this sector.\nDr Caruana also reiterated the ministry’s commitment in attracting more visitors to Gozo by investing in the island’s infrastructure and by organising specialised activities throughout the year.\nGTA chairman Paul Scicluna gave an overview of the achievements and initiatives the association managed to obtain these past 20 years for the benefit of the tourism community in Gozo.\nThe first general meeting of the association was held on February 11, 1999.", "comment_count": 0, "id": 1885}, {"keywords": "Gozo", "author": "", "article_body": "Mġarr Harbour. A Guide and History is a new publication by Richard Evans, a foreign resident living in Għajnsielem. The book was launched at the Arkadia commercial centrein Victoria.\nThis is the latest booklet following up an earlier one entitled Salvu on Comino.\nBoth books were written to raise funds for Puttinu Cares.\nThe book contains harbour recollections by residents of Mġarr and Għajnsielem. Over €1,000 were raised from donations made by people visiting Arkadia. As a token of appreciation they were given a copy of the new publication, signed personally by the author.\nSeen below are, from left, Richard Evans, Puttinu Cares Gozo president Carmel Camilleri, secretary Carmen Cefai and committee member Annabel Formosa.", "comment_count": 0, "id": 1886}, {"keywords": "Gozo", "author": "", "article_body": "Sr Maria Rosaria Tagliaferro, provincial of the Salesian Sisters of St John Bosco, last week was in Gozo where she met Laura Vicuna School students, the past pupils of Mary Help of Christians Oratory and also called on Gozo Bishop Mario Grech.\nSr Maria Rosaria, who lives in Naples, also spent some time with the Salesian community in Sliema, where she met the Salesian Sisters, a group of young people from the Salesian Oratory and Youth Centre who prepared supper for her at the Sisters’ convent.\nWhile in Malta, Sr Maria Rosaria met the provincial of the Maltese Salesian Province, Fr Paul Formosa.\nSeen here are Sr Maria Rosaria Tagliaferro (second, from right) with, from left, Sisters Ines Bonello, Stella Spiteri, Elsa Gretter and Antoinette Pace.", "comment_count": 0, "id": 1887}, {"keywords": "Environment", "author": "Alex Vella", "article_body": "The Ramblers’ programme for March challenges the endurance and vitality of members and guests. Six out of the seven walks prepared are moderate to hard. However, the first walk of the month, along and across the harbour, provides a good sport for beginners.\nHardy ramblers get more buzz from tougher, craggy stretches. The Gozo walk tops the en­durance test. The hilly topography will perforce assess the stamina of ramblers as high ridges are climbed and deep valleys de­scended many times over, during five hours of continuous walking.\nBesides the healthy exercise, the prize for the effort will be the breathtaking array of vistas on offer, rugged countryside and rocky coastline panoramas immersed in warm sunlight; sights that are not destined to last if the warped thinking behind the proposed Gozo tunnel continues.\nThe Ramblers are set against the idea of the two-lane tunnel for traffic because it is no solution at all for sensible connectivity between the islands. It is incredible how this idea, which has been bandied about for many years but discarded as unviable by different administrations, has been de­clared as doable now without so much as a glance at its impacts and sustainability.\nHow presumptuous is it of our prime minister to summarily state that the tunnel is definitely going to be built and in the same breath say that scientific studies are yet to be concluded! This stinks of a foregone conclusion, with the studies being carried out as only ritual formalities. Rationally, one should wait for the studies before deciding.\nSupporters of the tunnel are ill informed if they think it is a quick solution for speeding up the crossing. Not only will it take years to complete but even once finished, it will not decrease the average crossing time appreciably. One must first consider the controls and collection of tolls. And the single-lane restriction will create delays in case of slow-moving vehicles and unimaginable problems in case of a breakdown or accident, which are inevitable.\nSeeing a tunnel for traffic as a solution is shortsighted\nQueues of tailing traffic will still remain but will be transferred elsewhere from Mġarr and Ċirkewwa. Since travel through the tunnel will be less staggered, more traffic will inevitably cause gridlocks in Gozo, given the size of the road network.\nThe sister island will become a mere extenion of characterless and polluted Malta as the building industry will irresistably thrive on covering green areas with cement, sadly eliminating bursts of countryside views as one drives along.\nThe distance travelled underground in a single lane will be at least three times the distance from Mġarr to Ċirkewwa.\nOne of the breathtaking array of Gozo sights.\nThe landscape beneath the Nadur ridge will be scarred as the gaping hole will pour its asphalt arteries onto the fertile meadows, causing irreversible damage to the environment.\nNor is it a long-term solution! Other problems will be caused by the traffic that is likely to escalate with long queues of vehicles puffing out poisonous exhaust (imagine being forced to stop in the middle of the tunnel!). One would have expected better thinking outside the box from the various authorities created recently to deal with traffic problems.\nOther measures that have been suggested, such as high-speed ferries, and ferries to different ports, need careful consideration in order to provide solutions that will hold for the next 50 or so years. A combination of such measures would certainly solve the problem of waiting time and queues. Seeing a tunnel for traffic as a solution is shortsighted.\nIf a tunnel has to be dug then let it be for a metro system that would remain underground and be studiously planned to encompass the whole of Malta, as has been suggested elsewhere.\nTogether with fiscal measures, it would have the effect of reducing traffic and improving air quality. It might be argued that tunnels for a metro system will aggravate the problem of waste. This is certainly true.\nHowever the Castille-inspired rhythm of overdevelopment, now described as “the great leap forward”, knows no bounds and makes land reclamation inevi­table, with or without tunnels.\nSince Malta has to suffer the predicament for its purported progress, it is best to seek and suggest methods that limit the anticipated environmental damage.\nRamblers admiring the catacombs at Ta’ Bistra in Mosta.\nMarch walks\nSunday, March 3: Around and across Marsamxett harbour – an easy cultural walk from Manoel Island to Valletta of some four hours taking in the Pinetum and Valletta gardens on the way, returning to the Ferries by boat. The starting point is across the bridge on Manoel Island.\nSunday, March 10: The northeast coast of Mellieħa – starting at Selmun Palace, this hard walk of four hours heads down the steep lane to Mistra Bay and follows the coast overlooking St Paul’s Islands and Mġiebaħ Bay. Not recommended for inexperienced walkers because of the rough and hilly terrain.\nWednesday, March 13: The countryside around Mosta – the meeting spot is Tarġa Gap next to Mcast. The walk of four hours will follow the Victoria Lines to Dwejra on to Wied il-Qlejja (Chadwick Lakes) returning by way of Wied Speranza. It is a moderately hard walk on rough terrain.\nSunday March 17: Gozo – a long and moderately hard ramble of some five hours, which, however, can be cut short at various points at will at bus-stops encountered on the way. It leaves the Mġarr ferry terminal upon arrival of the 8.15am trip from Ċirkewwa. Many hills and valleys are trasversed as the walk takes in Għajnsielem and Nadur, Xagħra and Marsalforn, Qbajjar and Żebbuġ. Not a walk for the faint-hearted.\nSunday, March 24: Wardija Ridge – a moderate walk that starts near Scotts supermarket in Bumarrad and climbs through Wied Qannotta to the highlands of Wardija from where spectacular countryside and coastal views can be enjoyed.\nWednesday, March 27: Żonqor – The meeting place for the walk is at the bottom car park of Smart City. It will head towards Żonqor along the country lanes of Inwadar park and then follow the coast back. The duration of the ramble is three hours and it is a moderately easy walk on rough terrain.\nSunday, March 31: Victoria Lines West – The starting point is Mġarr parish church. The moderately hard walk through the hamlets of L-Iskorvit and Ta’ Abatija will climb the uphill path to the Kunċizzjoni Battery from the top of Fomm ir-Riħ Bay. Then the Victoria Lines are followed until the Binġemma Gap is reached.\nExcept for the Gozo walk, all walks on Sunday mornings start at 9am, while those on Wednesdays start at 2pm. Everybody is invited to join in the walks. However, beginners should take care to start with the easy walks, and then decide on the harder graded walks. The Ramblers’ Association takes great care in picking its trails but everyone is solely responsible for their safety and are free to choose to walk or stop at their discretion. For further information visit the websites above or call 9949 7080.\nAlex Vella is executive president of the Ramblers’ Association of Malta.\nwww.ramblersmalta.org\nwww.facebook.com/ramblersmalta", "comment_count": 0, "id": 1888}, {"keywords": "Gozo", "author": "", "article_body": "■ A commemorative event in honour of Mro Joseph Vella, who passed away on February 25 last year, is being held today by the Gozo Ministry with the participation of the La Stella Philharmonic Society. At 10am, the band will play marches from the Astra Theatre to the Villa Rundle Gardens in Victoria, where Gozo Minister Justyne Caruana will unveil a bust to Prof. Vella. The bust is the work of sculptor Joseph Scerri.\n■ Today, the Victoria and Xagħra Scout Groups will be celebrating Founder’s Day. There will be a church parade at around 10.45am, followed by Mass at the Good Shepherd church in taċ-Ċawla, Victoria, at 11am.\n■ To commemorate the Apparition of Our Lady of Lourdes, Masses will be said at Lourdes church in Għajnsielem today at 5.15am and 8.30am, 1pm, 3.30pm and 5pm and tomorrow, on Wednesday, Thursday, Friday and Saturday at 5.15am and 9am and at 1pm, 3.30pm and 5pm. The sanctuary will remain open until 7.30pm.\n■ The Friends of the Sick and Elderly in Gozo are organising a charity sale at the private road between Gozo Colleges off Fortunato Mizzi Street today from 7am to 1pm. The cost is €10 per car space.\n■ Love from a Woman’s Eye is a collective exhibition featuring works by Rosita Kvas, Emma Borg and Abi Macleod Clark at the Citadel Cultural Centre (Hall 2) in Victoria. Entrance to the exhibition is free. It is open until Thursday from 10am to 4.30pm.\n■ Carnival in Nadur kicks off today at 12.30pm. More than 500 people are expected to take part in a colourful programme at St Peter and St Paul Square. This will be followed by the Nadur Spontaneous Carnival between Friday and Tuesday, beginning after sunset and lasting until the early hours.\n■ Ralph Breaks The Internet (U) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n■ A blood donation session will be held at Gozo General Hospital Outpatients Department on Tuesday from 1pm to 5pm.\n■ A public talk on ‘perinatal’ mental health services is being held at the Gozo General Hospital on Friday between 10.45am and 12.30pm. Those interested are to call 2210 6322 to book a place.\n■ High Tea, including tombola, in aid of Puttinu Cares will be held at Crystal Palace, Marsalforn, on Thursday at 7.30pm. Those attending will be given a prinjolata (carnival sweet) for free. For further informational call 7970 4840, 7905 4750 or 7970 6253.\n■ MUSEUM superior Joe Fenech will lead a prayer and catechesis meeting at Our Lady of Pompeii church, Victoria, on Thursday from 10am to 11am. All are welcome.\n■ Members of Il-Fergħa Ewkaristika (Għawdex) will meet at Ta’ Pinu Sanctuary on Saturday at 3pm to celebrate Mass and adoration of the Blessed Sacrament. All are welcome.\n■ The Diocesan Eucharistic Movement will hold a prayer evening at Our Lady of Mount Carmel church, Ta’ Hamet, on Saturday at 8pm, followed by Mass at midnight.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1889}, {"keywords": "", "author": "", "article_body": "MEP candidate Arnold Cassola has called for an investigation after a video emerged of Prime Minister Joseph Muscat and his wife and friends partying at Girgenti Palace.\nProf. Cassola, a former Alternattiva Demokratika chairman, wrote to the Electoral Commissioner and the Standards Commissioner, saying that the video constitutes \"unethical behaviour\".\n\"I urge you to open an investigation into unethical behaviour by an MP (the prime minister) and the fact that a state property is being used by a political party, something which breaches party financing laws,\" he said in the letter, copied to the press.\nIn the leaked video, Dr Muscat can be seen jumping and chanting with the crowd to the former Mintoffian tune \"Ma Tagħmlu Xejn…” while his wife Michelle dances in front of him, waving a bottle of champagne.\nThe historic Girgenti Palace is used as the Prime Minister's summer residence. \nThe undated clip also irked a number of Nationalist Party exponents, including MP Jason Azzopardi who wrote on social media: \"The former Chapel of Girgenti Palace... such a suitable setting indeed.\"", "comment_count": 262, "id": 1890}, {"keywords": "", "author": "", "article_body": "Hili Ventures has signed a memorandum of understanding to buy the Comino Hotel and bungalows, Times of Malta is informed. \nThe unstipulated deal will see the demolishment of the current hotel and bungalows to be replaced by another boutique hotel and structures, a source close to the deal said. \nThe footprint occupied will be the \"same or even smaller\" as that currently occupied by the hotel and bungalows but details about the project are still scant.\nA number of leading overseas architects have been approached to design the tourist resort, the source said.\nA share purchase agreement will be signed with Kemmuna Ltd in the next couple of weeks with the deal sealed by the end of the year.\nHili Ventures is jointly owned by Melo Hili and Beppe Hili. The group operates a string of diversified businesses in 10 countries.\nAccording to the Natura 2000 management plan, issued in 2015, the owners of the hotel and bungalow complex, Kemmuna Ltd, had been seeking to redevelop the properties for several years and were then in the process of formulating a development plan for the area.\nThe plan warns: “Further development can affect the protected habitats and protected species and if it is to be considered at all needs to take very strong cognizance of the location of these properties and great importance of the surrounding protected land and the impacts that urban development may have on such sites and on the wider SAC / SPA [Special Area of Conservation / Special Protection Area].”\nNevertheless, the plan does not rule out further expansion of the hotel or bungalow complex footprint, requiring only that the environmental and planning authorities that the necessary studies are carried out to protect habitats and species.\nThe Comino Hotel made the headlines for the wrong reasons last month after an estate agent listed it to for sale valued for €100 million, prompting a backlash. The company later said the listing was a fictitious one created for training purposes and mistakenly published.", "comment_count": 35, "id": 1891}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Maltese engineers have developed sophisticated, cost-effective equipment such as miniature computers, electric propulsion, solar panels and electrical power systems for small- and medium-sized satellites.\nNew technologies developed by the engineers were well-received at the Global Space Technology Convention (GSTC) in Singapore last week.\nMarc Anthony Azzopardi from the University of Malta’s Astrionics Research Group and Blu5 Group CTO Antonio Varriale, which is based in Malta, were in Singapore to present the fruit of a collaboration agreement signed two years ago.\nSponsored by industry heavyweights such as Airbus Defence and Space, Thales Alenia Space, ST Engineering, ArianeSpace, and other technology leaders including Blu5 Group, the GSTC is the premier space industry event in Asia, where the industry descends annually to showcase their latest products and vision for the entire space industry.\nThe Maltese delegation described their electronic miniaturisation efforts in the small satellite sector that has taken the space industry by storm over the past decade.\nDr Azzopardi told Times of Malta how they were developing a collection of technologies for very small satellites that are set to become a very popular choice as the industry seeks to lower the cost of accessing space.\nOur satellites cost tens of thousands compared to tens of millions\n“In Singapore, we presented the satellites and the associated technologies we are developing as they find application in testing and validation of electronic components in low earth orbit. Chips, such as Blu5’s SEcube™ and other electronic materials developed for use in mobile phones and other portable electronic devices can be used successfully in small- and medium-sized satellites for short term missions,” he explained.\nIn 2017, small satellites under 10kgs accounted for over 65% of all new satellites put into earth orbit and the exponential trend is seeing no sign of abatement, particularly in the lower cost segment.\nMalta is currently at the forefront of the small satellite sector, and is actively developing a swath of new technologies for satellites weighing just a couple of hundred grams.\nDr Azzopardi said that the growing team is developing miniature technologies that offer enormous cost-saving when compared to conventional space-grade technology.\n“Our satellites cost tens of thousands compared to tens of millions, so they are much better suited for verifying technology in the space environment, prior to it being used in much more expensive missions,” he said.\nThe Astrionics Research Group was established by the Department of Electronic Systems Engineering of the University of Malta in 2015, and is now a rapidly growing team of research students, academics, support engineers and contributors from various other departments and faculties that share an active interest in applied electronic systems research and development for the space environment.\nThe Research Group is very active in the picosatellite and nanosatellite sector and is currently developing numerous satellite subsystems.\nBlu5 focuses on the design and development of hardware-software platforms, targeted to ICT systems developers and integrators in various fields.\nThe SEcube™, a chip also developed in Malta by Blu5, combines three powerful, but complementary, computing technologies in a tiny 9x9mm package and has found application in the small satellites being developed by the Astrionics Research Group.", "comment_count": 8, "id": 1892}, {"keywords": "", "author": "", "article_body": "The way a former policeman was arrested and taken to a mental hospital could have been illegal, an alliance for mental health has warned after a clip emerged taken by the arrestee himself.\nThe A4MH requested the Commissioner for Mental Health and the Police Governing Board to officially investigate and to ascertain that all procedures as established by the Mental Health Act were appropriately followed when Mario Portelli was arrested from his home.\nMr Portelli was the chief witness in the trial against former police inspector-turned-lawyer David Gatt, who had been accused of being involved in the failed heist of HSBC’s operations centre in Qormi in 2007.\nIn recent videos uploaded on Facebook, Mr Portelli made serious claims against both the Prime Minister and Economy Minister Chris Cardona. \nClaiming the government was trying to stop him from confronting Joseph Muscat on Sunday about his (secret company) Egrant \"lies\", on Friday Mr Portelli filmed his distress as police officers turned up at his home to take him to Mount Carmel hospital. The last shot of the clip showed a policeman trying to snatch his mobile phone from him.\nThere appeared to be no doctor present when he was taken away by force.\n'Investigate and take action'\nIn a statement on Saturday, the A4MH said it expected both the commissioner and the police board to investigate the case, publish their conclusions and take all necessary action to address any shortcomings which it may have identified.\nThe alliance, which is constituted by representatives of the professionals and the service users of mental health services, said it did not wish to comment on the specific case, saying it did not know the details. \nThe A4MH is highly aware of the distress that involuntary admission to a psychiatric hospital can cause, primarily to the person concerned and their families, and also to the professionals that are involved in the case.\nIt said it recognises there are situations where involuntary hospitalisation is unavoidable.There are stringent requirements laid down by law through the Mental Health Act (Cap 525) that govern the procedures for such admission\nHowever, there are stringent requirements laid down by law through the Mental Health Act (Cap 525) that govern the procedures for such admission.\nThese procedures determine that a medical doctor would have reviewed the person and recommended hospitalisation as the only reasonable course of action to preserve life and safety. The doctor would also establish that there are no safe alternatives that are less restrictive.\nThere is also the requirement that either the person's responsible carer/next of kin, or a specifically-trained mental welfare officer would also have met with the patient in the immediacy, and would have agreed that admission would be necessary to protect the individual or others due to the presence of mental illness.\nOnly at that point can a person be transported to a psychiatric facility, it said.\nThe A4MH said once in a psychiatric facility, there are legally mandated requirements for a person to be reviewed within specified periods of time by specialists in psychiatry to confirm the on-going need for hospital-based care. ", "comment_count": 113, "id": 1893}, {"keywords": "", "author": "Jacob Borg", "article_body": "Feedback on whether the public agrees with extending Malta’s controversial cash-for-passports scheme is still being “analysed”, according to the government website dedicated to public consultations.\nCitizenship Parliamentary Secretary Julia Farrugia, who is responsible for the scheme, told the Times of Malta in September the evaluation of the public consultation was in its “final stages”.\nWhen the scheme was first launched in 2013, Prime Minister Joseph Muscat had said it would be capped at 1,800 main applicants. Four years later, Dr Muscat announced during the lead up to the June 2017 election the scheme would be extended.\nThe latest report by the scheme’s regulator said there had been 833 successful main applicants until the end of June 2018. \nThe public was asked in January 2018 whether applications under the Individual Investor Programme, as the scheme is formally known, should be capped at law or be left at the government’s discretion.\nThis relates not only to the legal framework\nTo receive a Maltese passport, IIP applicants must fork out €650,000 and provide a €150,000 investment in government stocks or bonds as well as satisfy property requirements and pass Identity Malta’s due diligence procedures.\nA 2014 “endorsement” by the European Commission has long been used to market the scheme. Dr Muscat insisted the scheme had been endorsed “in writing” by the Commission. But this was dismissed by a Commission spokesman earlier this month.\nA Commission report on citizenship and residency schemes across the EU found that although the residence requirement existed in legislation, in practice the requirement for applicants to physically reside in Malta was not verified sufficiently.\nAs set out in the report, the Commission was examining whether or not such schemes were in line with EU rules, a spokesman said. “This relates not only to the legal framework governing the scheme but also to its application”, he pointed out.\nHenley & Partners, the scheme’s concessionaire, has earned over €28 million between 2014 and 2018 from passport sales. Part of the money paid by foreigners buying EU citizenship are ring-fenced in a national development fund.", "comment_count": 16, "id": 1894}, {"keywords": "", "author": "", "article_body": "A kite surfer was rushed to hospital after losing control and crashing into nearby rocks on Saturday afternoon.\nThe incident took place at around 3pm near Ta' Fra Ben, in Qawra, shortly before a hailstorm hit Malta. \nPolice said the 30-year-old Polish national could have lost control of his aircraft because of the windy weather.\nThe man was taken to Mater Dei Hospital following the incident where he was found to have sustained serious injuries.\nMalta is facing a stormy weekend with gale force winds which may reach speeds of up to 88km an hour. ", "comment_count": 0, "id": 1895}, {"keywords": "", "author": "Claire Caruana", "article_body": "Payments to credit rating agencies have not “exploded” in recent years, Finance Minister Edward Scicluna has insisted, despite data he tabled in Parliament recently showing otherwise.\nIn comments on a video on his Facebook page, Prof. Scicluna dismissed claims which he said were suggesting that the government was paying the agencies to secure a positive rating. \n“Their obligation is to the world and the public. The agencies’ reputation is at stake and they are there to give ratings. Their rating is important because banks then use these to make certain important decisions,” Prof. Scicluna said in the video.\nRead: Government payments to credit rating agencies soar since 2013\nIn recent years, the government has used the ratings by a number of such agencies, including those by world-renowned agencies like Fitch, DBRS, Moody’s and Standard and Poor’s, when speaking about Malta’s booming economy.\nCredit rating agencies are independent companies that assign ratings which reflect the ability of a debtor to pay back debt. Agencies rate countries as well as private firms. Ratings are either solicited or unsolicited, with agencies initiating them themselves.\nThe country has been paying for such ratings for many years\nWhile not divulging any figures, the minister insisted that the country had been paying for such ratings for many years, insisting that these were crucial for a country or company. \nAccording to Prof. Scicluna, it was “simply not true” that the payments to rating agencies had increased significantly since Labour took office in 2013.\nHis claim comes just weeks after data he tabled in Parliament last month, in reply to a question by Nationalist MP Jason Azzopardi, showed that since 2013, the payments had soared, with the government forking out a total of €237,502 last year alone. \nIn 2013, the figure stood at €121,119, going up to €126,567 in the following year and €214,702 in 2015 before peaking at €248,697 in 2016.  \nFollowing the minister’s comments, this newspaper asked the government for the amount paid to credit rating agencies prior to 2013, however, the information was not supplied by the time of going to print. \nEarlier this month, Times of Malta had also asked for a breakdown of fees that were paid to each of the four main agencies but this data was also not provided. \nAccording to information in the Government Gazette, the Finance Ministry issued a direct order to Fitch Ratings worth a total of €80,000 over two years.\n ", "comment_count": 39, "id": 1896}, {"keywords": "", "author": "", "article_body": "The government has offered to pay €7,000 “as just satisfaction” to a former newspaper editor who, in 1973, had been sentenced to three months in prison after publishing an article about a Cabinet minister.\nJoseph Calleja had been found guilty of defamation and offending public morals after the satirical newspaper he edited, In-Niggieża, carried an article titled Pudina mis-Sultana a’ la Cassar (Sultanas’ pudding, Cassar style).\nThe article had claimed that the late then minister Ġużè Cassar had impregnated a Gozitan woman and fathered a child.\nMr Calleja had spent two and a half months in prison, subsequently claiming he suffered from anxiety and psychological trauma, including claustrophobia, as a result.\nMr Calleja was not happy with the offer\nForty-one years later, he sought constitutional redress arguing that his right to freedom of expression had been violated. The Civil Court (First Hall), in its constitutional competence, agreed with him and he was awarded €5,000 in moral damages. Both sides appealed and the Constitutional Court cut the compensation to €2,000.\nMr Calleja claimed that the costs he had incurred, including to take his case to the European Court of Human Rights in Strasbourg, amounted to just under €9,800. He complained that he remained a victim of the violation upheld by the Maltese courts, given the low amount of compensation awarded and the fact that expenses far exceeded the award.\nAttempts were made to reach an out-of-court settlement but they failed. Subsequently, the government informed the Strasbourg-based court it was willing to make a unilateral declaration, acknowledging violation of Mr Calleja’s right to freedom of expression, and offering him the sum of €7,000. It also asked the court to strike out the case before it.\nMr Calleja was not happy with the offer but a committee of three European judges, including Chief Justice Emeritus Vincent De Gaetano, was satisfied with both the amount offered and the government’s declaration. The judges concluded there was no reason for them to continue examining the case and so decided to strike it off the list.", "comment_count": 10, "id": 1897}, {"keywords": "", "author": "Claire Caruana", "article_body": "It was crucial for the Church to listen to victims of sexual abuse, Archbishop Charles Scicluna told a news conference at the Vatican on Saturday amid fresh concerns over the way crimes were hidden from the public gaze.\n“It's not about a three-day event with everyone being listened to at the same time and same place. Our attitude should be that we go home and continue to listen to people,\" Mgr Scicluna said in reply to questions on why more victims were not invited to the summit. \n\"If you don’t listen to the narratives of victims you will never understand why you need to get it right.”\n\nEarlier, a top Catholic cardinal admitted that Church files on priests who sexually abused children were destroyed or never even drawn up, a move which allowed paedophiles to prey on others.\nPope Francis had opened the landmark summit by saying that the world expected \"concrete measures\" on tackling paedophilia in the Catholic Church.\nThe Archbishop, who serves as the Vatican’s leading sex crimes investigator and leader of the meeting, also called for more communication with victims, insisting they should not just serve as witnesses. \n“One of the main problems we have is that we do not just have problems when communicating with people but also within the Church. We need to share vital information within the Church.\n“There needs to be more communication with the victims. They are not informed of the outcomes of church procedures, they have no say, and they are the ones impacted.\"\n \n ", "comment_count": 17, "id": 1898}, {"keywords": "", "author": "", "article_body": "One of the runways at Malta International Airport was temporarily closed down on Saturday afternoon after a pilot noticed a drone being flown in its vicinity.\nAccording to the police, air traffic controllers decided to close the runway when the drone was spotted around 12.25pm.\nPolice and Armed Forces of Malta officials were seen in the area trying to identify the person operating the drone. An AFM helicopter was also deployed to the scene but there was no sight of the drone.  \nServices were resumed shortly afterwards and no flights were delayed or cancelled because of the incident.\nThousands of travellers were stranded over Christmas at Gatwick airport after a drone was sighted, causing chaos to one of the world's largest airports. \nMore details to follow", "comment_count": 21, "id": 1899}, {"keywords": "", "author": "Denise Grech ", "article_body": "Cottonera, Floriana, Għaxaq and Pembroke have two to five times the national rate of domestic violence reports, new data has revealed. \nFigures from the annual crime report for 2018 show that these localities experienced a spike in reported domestic violence, which became the second most reported crime in the country after material damages. It is followed by theft. \nThe reports relate to stalking, bodily harm and psychological harm, criminologist Saviour Formosa said.\nReports on domestic violence shot up to over 1,341 cases (eight per cent) in 2018. There was a 10 per cent increase in reports of psychological harm, the data shows.\nSaviour Formosa\nCrime as a whole went down by seven per cent last year, reaching a total of 15,925 reported offences.\nAn increase in population, coupled with an influx of tourists, meant crime was now more diversified, Prof. Formosa said. \nCases of fraud increased by 30 per cent over the previous year, as new forms of digital crime emerged, he added. Fraud reports shot up to 1,032 in 2018, from 787 in 2017, he said. \nThe main increase was registered as fraudulent gains, making fraud the fourth most reported crime in the country.\nLast year, Prof. Formosa had warned a high perception of widespread corruption and bribery led to the rise in reports relating to fraud. This time, Prof. Formosa noted that the perception had not changed but that new forms of digital crime were emerging.\nMoney-laundering cases, recorded for the first time in 2017, registered a 94 per cent increase in just one year. Thirty-three cases were reported in 2018, compared to 17 cases in 2017.\nThe Maltese offence profile changed from a public-oriented to a personal one, with an “increasing focus on financial-related offences,” Prof. Formosa said.\nThis, he warned, required a shift in policing, personal safety and preparedness in technological advances.\nThere was the need to initiate thinking about crimes that “have yet to be conceived by offenders as the next societal change will occur, mainly in the digital arena,” he said.\nCrime was moving into a virtual space – and the elderly were the most vulnerable, he warned. \nHome Affairs Minister Michael Farrugia said the police force would be strengthening its economic crime unit following the rise in financial crime reports.\nOther statistics from the annual crime report\n■ Victims were mainly Maltese men aged between 40-59.\n■ Mdina pushed St Julian’s to third to become the city with the most reported crimes. Floriana was a close second.\n■ Crime in St Julian’s dropped from 10.6 per cent in 2017 to 9.4 in 2018 – the lowest in 18 years.\n■ Pickpocketing went down by 995 offences in 2018 – a decrease of 46 per cent from the previous year.\n■ Theft from beaches decreased by 46 per cent – the lowest in 14 years.\n■ Drug reporting increased by 12 per cent in 2018 – the highest ever since 2004.\n■ Sexual offences increased by 18 per cent.", "comment_count": 12, "id": 1900}, {"keywords": "", "author": "", "article_body": "Homosexuality is not a psychological disorder, the Malta Chamber of Psychologists said on Saturday, amid an appeal to eliminate the stigma of mental illness which shrouds people of lesbian, gay and bisexual orientations.\nHomosexuality is not a pathology, mental anomaly nor psychological disorder, the chamber said in a statement. \nThough the psychologists did not say what provoked them to issue a statement, it came a day after Matthew Grech, who describes himself as an “ex-gay”, told The Malta Independent that homosexuality is a psychological disorder.\nIt reiterated that the notion of gay conversion, as a therapy or simply even as a concept, is in itself harmful and noxious to persons from the LGBTIQ community, since it not only rejects a group of individuals based on unfounded promises, but also promotes a lack of tolerance.\n\"As a body we promote respect and equality for all persons and we strongly condemn any practices, public outcries or vociferous attacks on any minority group or section of our population.\"\nThe discipline of psychology is concerned with the health and well-being of humans and groups, and the chamber said it considered such behaviours to be a direct threat to public well-being.\n\"Denying our true nature may in itself lead to psychological difficulties, and denying our sexual orientation - if it so happens not to be hetero-normative - is in fact known as internalised homophobia.\"", "comment_count": 63, "id": 1901}, {"keywords": "", "author": "", "article_body": "Malta favours a Brexit deal but the EU cannot move from the principles outlined in the proposed agreement, Prime Minister Joseph Muscat told British Labour leader Jeremy Corbyn. \nDr Muscat met Mr Corbyn during the European Socialist leaders’ meeting in Madrid, according to a statement sent by the Labour Party.\nWith just five weeks until Britain is due to leave the EU on March 29, Theresa May is yet to get the changes to her exit deal with Brussels she needs to secure its ratification in parliament.\nAhead of a promised parliamentary debate and vote on the next steps on Brexit on February 27, Mr Corbyn is under intense pressure from moderates within his party to back a second referendum explicitly, now that the terms of Brexit are known.\nMr Corbyn, a longtime eurosceptic, has said Labour is focusing on securing an early national election before any possible resort to a second referendum.\nThe Madrid meeting was used for the first vice president of the European Commission Frans Timmermans to formally launch his bid to take on the Commission's top job.\nDr Muscat also held formal meetings with Romanian prime minister Viorica Dăncilă.", "comment_count": 44, "id": 1902}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated Saturday 8.10am with BoV reaction\nClients of Bank of Valletta are up in arms as payments to third parties remain unavailable over a week after a cyber attack that saw hackers make away with €13 million. \nSeveral clients told the Times of Malta that despite the bank resuming its services a day after, payments to third parties were still not being processed, with some ending up without any money as a result. \nBut a spokesman said on Saturday a backlog of around 6,000 payment orders had been brought down to about 300 by Friday night in a race against time to put a halt to the disruption.\nRead: BOV goes dark after hackers go after €13m\nLess than 24 hours after the breach, the bank issued a statement saying it had resumed operations, however, payments to and from third parties were still not being handled since it was the particular system that processed such payments that was breached. \nOne client who spoke to Times of Malta on the condition of anonymity described how she only had €19 in cash and “no access to her own money” since non-euro funds were not being released into accounts. \n“They were unable to offer any short-term solution to our dire predicament,” the client said, pointing out that, when contacted, the bank said that a complaint should be lodged online. \nAnother described how he was forced to “fish out information”, insisting that he was not supplied with any details on when the service would be back to normal.\nThey told us specifically that they have no idea if it is days or weeks \n“There is no information whatsoever on when this will be resolved. They told us specifically that they have no idea if it is days or weeks,” the irked client said.\nAccount holders in the UK have also complained that the bank would not even issue a form of proof or explanation that could be used to present to their landlords, for instance. One client said that his rent is already late by a week and there seemed to be no end in sight, with the bank refusing to provide timelines. \nA number of business owners have also contacted Times of Malta expressing concern that problems had not yet been fixed, lamenting the negative impact the issue would have on their own operations.\nVideo: Mark Zammit Cordina\nAsked about the issue on Friday, Finance Minister Edward Scicluna said he was not in a position to comment on whether the funds had been traced and retrieved, insisting that it would be the bank that made such statements. \n“There’s no need for the minister to prod into that. It’s up to them because it’s a public company and they have shareholders, a board of directors and you should ask them.  I’m sure that they would report the outcome in a transparent manner. I’m sure they are doing their utmost to recall and trace those funds but it’s up to the bank to report on that,” Prof. Scicluna said.\nBank operations are now close to normal - BoV\nIn a statement, Bank of Valletta said its third-party payment services outside the euro area are being reactivated from its branch network and will endeavor to have them fully operational by Monday. The bank is in the meantime working to also reinstate these payments through internet banking.\nThe bank's euro area payments were activated last week and are operational through all BOV channels in the normal manner.\nOver the past days, bank employees focused their efforts on restoring normal service, as well as on clearing up backlogs which accumulated due to the incident, BoV said in a statement.\n\"The bank's operations are now close to normal. Payments of salaries, social benefits and pensions, both local and international, are proceeding as usual and the bulk payment functionality, on the bank’s internet banking, has also been reinstated.\"\nThe cyber incident is currently the subject of a criminal inquiry.\nBank of Valletta thanked its customers and employees and said any queries should be directed to customercare@bov.com or 2131 2020.\nAdditional reporting Philip Leone Ganado and Jacob Borg.", "comment_count": 27, "id": 1903}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that Cottonera, Floriana, Għaxaq and Pembrokehave two to five times the national rate of domestic violence reports. It also reports that Bank of Valletta clients are up in arms as payments to third parties remain unavailable over a week after a cyber attack that saw hackers make away with €13 million.\nL-orizzont says a total of 71 restoration projects are currently under way in Malta. It also reports that the rate of crime in Malta was down by 7.1 per cent in 2018. \nThe Malta Independent reports that an enforcement notice has contradicted a Planning Authority statement on a quarry residential unit to house Turkish workers imported for major development projects. \nIn-Nazzjon features a large picture of party leader Adrian Delia touring Valletta as well as a picture of the party general conference meeting this weekend. \n ", "comment_count": 0, "id": 1904}, {"keywords": "", "author": "", "article_body": "Updated 8.30pm with more images\nA hail storm and thunder lashed across Malta on Saturday afternoon ahead of forecast north-easterly winds which threaten to reaching speeds of up to 88km per hour.\nPembroke. Photo: Pierre Gatt\nThe bad weather started on Saturday afternoon with isolated showers developing into hail storms and the odd thundery spell. Temperatures are expected to dip to lows of six degrees Celsius and as the evening turns to night, the winds are expected to pick up speed, reaching force 8 and 9 in the early hours of Sunday.\nMotorists have been advised to proceed with caution as a hail storm blanketed roads, potentially causing danger. Though flooding has been reported in several parts of the island, the police said no major incidents had been reported by 6pm.\nThe afternoon's FA Trophy quarter final match between Pieta and Gżira United was abandoned at the 89th minute with the score at 1-1 while the horse racing was also abandoned midway through.\nThough such a storm is not unseasonal, the temperature is actually warmer in a number of northern European countries.\nForce 9 winds are classified as a strong or severe gale on the Beaufort Scale, which could result in slight damages to buildings and structures. A representative of Malta International Airport, which hosts the meteorological office, said that the gale force winds would be accompanied by thundery showers and possibly hail.\nTwo children in Swieqi built their own version of a snowman. Photo: Franco Portelli\nThe scene in Swieqi. Photo: Luke Baldacchino\nHail over Cospicua.\nThat forecast was echoed by weather site WindFinder, which as of yesterday evening predicted gusts of wind reaching force 10 levels – 49 knots – at times. \n\nThe violent weather is expected to subside somewhat as the progresses tomorrow, with winds veering east-northeast and moderation to force six or seven for the rest of the day. \nTemperatures throughout the day will hit lows of seven degrees Celsius, with highs only slightly above that, at11 degrees. \nNorth-easterly winds are especially concerning to mariners with vessels in areas like Marsamxett Harbour, the Grand Harbour or St Paul’s Bay, and the spectre of very rough gregale winds had many boat owners scrambling to get their vessels to safety yesterday. \nTheir concerns were lent credence by the Malta Meteorological Office, which on Friday evening issued a gregale advisory notice to mariners, warning them of very rough seas tonight and on Sunday as a low pressure zone over the Ionian sea extends over the Maltese islands.\nFgura\nZejtun. Photo: Jean Paul Bonnici\nDo you have pictures or videos to share? Send them to us on mynews@timesofmalta.com or on our Facebook page\nPhoto: Jonathan Borg", "comment_count": 52, "id": 1905}, {"keywords": "", "author": "Denise Grech ", "article_body": "An Ombudsman's report into several controversial promotions in the Armed Forces of Malta showed democracy was under threat, PN MP Mario de Marco said.\nAn investigation by the Ombudsman into the promotions showed the selection process was \"vitiated\", lacked integrity and was intended to \"produce a desired outcome\".\nSpeaking during the annual general council, Dr de Marco said the Ombudsman's investigation- which the government had tried to stop - showed people had been victimised by the decisions of the government.\nSeveral people had filed complaints following the board's decisions on a number of controversial promotions. The promotions, which took place in September 2013 included that of the present commander, Jeffrey Curmi, who had leapfrogged from major to brigadier – three levels of promotions – in a matter of months.\nThe Ombudsman, Dr de Marco noted, said the board's decision showed \"serious repercussions to democracy\".\n\"This is a serious accusation,\" the PN MP said. \"The authorities are not working. In our country, democracy is under threat,\" he added.\nDavid Agius.\nClosing off the general council, PN deputy leader David Agius said a PN government would see that justice was done with those who had not been promoted.\nHe also said a PN government would ensure a cleaner government, which worked against corruption and in favour of the environment. \nDr Agius also made calls for unity, insisting the party needed to show the electorate it was united to gain people's trust", "comment_count": 52, "id": 1906}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man appealing an 18-month jail sentence was almost left without a legal leg to stand on because a court registrar had mistakenly logged his appeal as having been abandoned rather than adjourned. \nJonathan Farrugia, who stands accused of being involved in the attempted bombing of a Fgura couple last year, had been found guilty of falsifying banknotes in 2016. \nHe had appealed that decision, and a judge had ordered for an appeal hearing to be postponed to a later date as it clashed with another trial.\nBut the court registrar forget to log this, almost resulting in the appeal being thrown out.\nThe error was compounded when Mr Farrugia failed to put in an appearance, kickstarting a legal process whereby the appeal is deemed abandoned, which is what the registrar put down in the records of the case.\nBy the time the case was eventually heard, on February 19, 2019, the original judge had retired and the case was assigned to a different court, presided over by Madam Justice Consuelo Scerri Herrera.\nWhen prosecuting lawyer Elaine Mercieca Rizzo, from the AG’s Office, argued that the appeal had been abandoned and that the conviction had thus become final, the issue finally came to the fore. \nBoth the appellant’s lawyer, David Gatt, as well as inspector Malcolm Bondin, who had prosecuted before the Magistrates’ Court, testified under oath that the appeal had never been abandoned but rather adjourned.\nThe court registrar was also summoned to testify on Thursday, admitting under oath that he had made a mistake and that the judge had ordered the case to be adjourned.\nThe registrar had informed both the prosecuting officer and the appellant’s lawyer of the adjournment date, with printed copies of the relative e-mails being exhibited in court.\nIn the light of this evidence, Madam Justice Scerri Herrera observed that this had been “a serious shortcoming by the Court registrar” who had not only recorded the appeal as abandoned, but had even failed to cancel the appellant’s admission ticket to jail, even though the appeal was still pending.\nThe Court pointed out that the accused would have ended serving his 18-month jail term even though submissions had not been made in his appeal.\nMadam Justice Scerri Herrera ordered the necessary corrections in the records of the case, while adjourning the appeal for continuation.", "comment_count": 2, "id": 1907}, {"keywords": "", "author": "", "article_body": "Bank of Valletta is re-activating its third-party payment services to areas outside the eurozone from its branch network, and will endeavour to have them fully operational by Monday.\nThe bank is also working to reinstate these payments through internet banking.\nPayments within the eurozone were activated last week and are operational through all BOV channels in the normal manner.\nOver the past days, bank employees focused their efforts on restoring normal service, as well as on clearing up backlogs which accumulated due to a cyberattack on February 13 which saw €13m disappear from its systems.\nThe bank's operations are now close to normal. Payments of salaries, social benefits and pensions, both local and international, are proceeding as usual and the bulk payment functionality, on the bank’s internet banking, has also been reinstated.\nThe cyber incident is currently the subject of a Criminal Inquiry before the Court of Magistrates of Malta.\nAny queries should be directed to customercare@bov.com or + 356 2131 2020.", "comment_count": 3, "id": 1908}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A third of Maltese people would not be willing to use the Gozo tunnel if the toll were higher than the current ferry fare, a research report prepared for Transport Malta found.\nAccording to the study, carried out last September but not made public, only 64 per cent of Maltese people would be willing to pay higher fares to use the tunnel, compared to 81 per cent of Gozitans.\nNumbers were higher when people were asked whether they would be happy to pay the same for a tunnel as they do for the ferry, which is what the government has previously indicated would be the case. \nOf those who said they would not be willing to pay the same amount or more, Maltese people were ready to pay €5 on average to use the tunnel, while Gozitans said they would only pay €3.\nYounger people, as well as those with a higher level of education and those in education or employment, were more willing to pay extra.\nThe majority of those who said they were not willing cited the fact that the price of the ferry was already too high.\nThe report, prepared by Vincent Marmara based on a survey of 824 people in Malta and Gozo, also confirmed earlier findings on the high levels of support for the building of a tunnel: 85 per cent of Maltese people and 83 per cent of Gozitans said they were in favour of the project.\nThose who supported the tunnel cited reduced travelling times as the main factor, followed by comfort and avoiding bad weather. Among Gozitans who opposed the tunnel, the largest fear was that the island would lose its identity.\nMore than three-quarters of the Maltese respondents and nearly nine in 10 Gozitans said they would consider using the tunnel. Younger people were more willing to use the tunnel, and more than half of Maltese people over the age of 66 said they would not. However, less than half said they would be willing to use public transport to travel through the tunnel, although support was higher among Gozitans.\nResidents of both islands said they would travel between Malta and Gozo more if the tunnel were to be built. Moreover, two-thirds of Gozitans who currently live in Malta during the week for work or study said they would return to Gozo.  ", "comment_count": 146, "id": 1909}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An American tourist landed on the wrong side of the law shortly after her arrival in Malta, ending up in police custody after being found in possession of unprescribed cannabis.\nLari Bebegol, a 20-year-old holiday maker from California, was arrested on Thursday and taken to court on Friday, pleading guilty to the possession of some four grams of cannabis grass.\nThe passenger was stopped by customs officials upon arrival at the Malta International Airport and found to be carrying the drug for which she had no local medical prescription as required by law.\nUpon her arraignment, the woman pleaded guilty importing the drug for her own personal use as well as to cannabis possession, landing a €500 fine after the court, presided over by magistrate Audrey Demicoli, took note of the accused’s early guilty plea, the fact that she had cooperated with the police as well as the small quantity of drug involved.\nAssistant Commissioner Dennis Theuma prosecuted.", "comment_count": 0, "id": 1910}, {"keywords": "", "author": "Jacob Borg", "article_body": "Finance Minister Edward Scicluna said on Friday he was \"obviously concerned\" about statements by HSBC Malta CEO Andrew Beane about reputational damage being done to the country’s financial sector.\nIt was essential that all market participants ensured anti-money laundering standards were fully implemented without delay, Mr Beane said during the presentation of HBSC’s financial results on Tuesday.\nReplying to questions after a press conference, Prof. Scicluna said certain groups of people had damaged Malta’s reputation.\nThe Finance Minister said he was obviously concerned by Mr Beane’s declaration:“It’s a state of affairs. He said what was so obvious to many people”.\nIn what was a turbulent 2018 for the banking sector, Pilatus Bank had its licence taken away by the ECB and Satabank was put under the control of EY after the authorities found widespread breaches of anti-money laundering procedures at the bank.\nAsked if he was saying that this reputation damage had been brought about by politicians, Prof. Scicluna said others were keen to tarnish the island’s reputation, including by feeding foreign media one-sided stories.\nWhen it was again pointed out that Mr Beane was calling on the financial sector to get its act together, Finance Minister said HSBC as a global bank had been bitten elsewhere in other countries.\n“They have revolutionised and changed the culture because of that, and they expect that other banks should learn from these experiences, and carry out the changes and cleaning up which is required, because it is a new age now”.\nProf. Scicluna said all the banks were working on improving their compliance functions, in what was turning out to be a costly exercise.\nHe said the MFSA and FIAU were also in constant contact with the banks.", "comment_count": 109, "id": 1911}, {"keywords": "", "author": "Denise Grech ", "article_body": "Cases of fraud have risen by over 30 per cent over the past year, as new forms of digital crime emerge, criminologist Saviour Formosa warned.\nLast year, Prof. Formosa had warned the increase in cases of fraud came following greater public awareness in cases of corruption and bribery.\nComputer related crime, in fact, increased by 20 per cent rise over the previous year, with most cases relating to password disclosure, unauthorised access and possession of data.\nMoney-laundering cases, recorded for the first time in 2017, registered a 94 per cent increase in just one year.\nA total of 33 cases of money-laundering were reported compared to 17 cases in 2017, Prof. Formosa said, adding the perception of financial crime had gone up.\nHome Affairs Minister Michael Farrugia said the police force’s economic crimes unit would be strengthened following the rise in financial crime reports.\nThe country’s crime rate reached 15,925 offenses last year - a seven point decrease, figures from this year’s annual crime report reveal.\nAn increase in population, coupled with an influx of tourists, meant crime was now more diversified, Prof. Formosa explained.\nThe previous singular crime phenomenon has also been brought to heel- pickpocketing decreased by 46 per cent to a total of 995 offenses in 2018.\nTheft from beaches also decreased by 46 per cent- the lowest in 14 years.\nCrime was mostly reported in Mdina, with several cases of parking reports. Floriana was a close second, and St Julian’s, which had previously been a hub for crime, is now third.", "comment_count": 8, "id": 1912}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who stands accused of having drunkenly threatened his parents with a knife and then kicking up a struggle when police showed up was denied bail on Friday. \nWayne Caruana, 40, from Għaxaq, pleaded not guilty to threatening his parents with a knife, threatening two police officers, slightly injuring them and violently resisting arrest during an incident on Thursday. \nHe was also charged with being drunk in public, refusing to obey police orders and being a relapser.\nThe court heard how the incident had occurred at the parents’ home and how the accused had refused to obey orders when police officers were called in to handle the situation.\nA request for bail by the accused’s lawyer, legal aid counsel Dustin Camilleri, was turned down by the court, presided over by magistrate Audrey Demicoli.\nInspector Colin Sheldon prosecuted.", "comment_count": 0, "id": 1913}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The President is calling on the electorate to support politicians who uphold child protection, including that of migrants, in the upcoming MEP elections.\n“From my former life as a politician I have first-hand experience of how difficult it can be to stand for these values, which might not be popular, including the issue we are discussing,” Marie Louise Coleiro Preca said at the end of the third Lost in Migration conference, organised by Missing Children Europe and her Foundation for the Wellbeing of Society.\nShe said the conference had flagged lacunae, including lack of training and coordination at national and cross-border levels that were preventing the necessary holistic progress to create a safe environment for migrating children.\nThe President was “deeply troubled” with comments by Federico Soda, Director of the IOM Coordination Office for the Mediterranean, that we have a “shrinking protection space” for children in migration.\n“To address this situation, we must support those politicians who share our values.\n“Knowing that we are passing through very challenging times, in the political life of our EU, and with the upcoming European Parliamentary elections, we must, as civil society, also support those politicians who share our values to be brave, to uphold child protection, including the protection of migrating children.”\nCivil society needed to lobby with and support candidates who were working to ensure that each child could enjoy their rightful dignity, she added.\nUnfortunately, legal frameworks were not adequately providing systematic child protection, and in the process, human rights continued to be breached for countless children.\nWe are being bombarded with hate speech\nThe President also referred to concerns raised by the conference’s participants about the increase in populist rhetoric.\n“We are being bombarded with hate speech, exclusionary tactics, and, as a result, witnessing an escalation of social tensions.”\nWe could not remain complacent in the face of such challenges, because the normalisation of fear and hatred could only be addressed when we were brave and spoke out, pushing for action, Ms Coleiro Preca added.\nA parent would only put their children in the boat when they thought that water is safer than land\nListen to the children\nIn order to address gaps in our protection system, it was important to include children and young people who had first-hand experience of migration and what it meant to be a migrating child and attempting to enter Europe.\nShe recalled the words of a young Syrian refugee who told the conference that most of the decisions being made were affecting young people, “yet we don’t see young people participating in these decisions. If young people do not participate, then people will make assumptions and have misconceptions about our situations. Talking to people about your first-hand experience makes a difference.”\nRead: ‘Time to walk the talk and protect child migrants’ - UN representative\nThe President referred to another comment which she will always hold onto: that a parent would only put their children in the boat when they thought that water is safer than land.\nShe hoped that such narratives would influence and transform European communities.\nMs Coleiro Preca also hoped that the conference would provoke the necessary response from the authorities to ensure that migrating children were given much-needed protection.\nThe recommendations of the three editions of the conference have provided sufficient recommendations and guidelines to put the relevant policies and safeguards in place and provide the protection that every child, whoever they might be and wherever they might come from, rightfully deserved, she added.\nRead: Refugee actors cancel Malta shows after immigration denies actor entry", "comment_count": 0, "id": 1914}, {"keywords": "", "author": "", "article_body": "Three people had to be evacuated on Friday afternoon from an apartment block in  Msida, one of them from the balcony via a fire ladder.\nA witness said the other two managed to get down the apartment's stairwell, escorted by firemen.\nThe fire broke out Triq il-Qroqq at 1.55pm but has now been put out, according to the witness.\nThe surrounding roads, which had been closed off to traffic at one point, have been opened.\n\n\nOne person had to be rescued from his balcony by fire ladder.", "comment_count": 0, "id": 1915}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A husband who allegedly punched his wife in the eye during a row at a Paola playground was remanded in custody while the woman is still being treated in hospital.\nThe 65-year-old Tarxien man was arrested following the incident, which allegedly took place on Thursday afternoon at a public play area.\nDuring Friday’s arraignment, the man pleaded not guilty to assaulting and threatening his wife and inflicting upon her a grievous injury. He was also charged with being a relapse.\nAfter Thursday’s incident, the woman required medical treatment and is reportedly still in hospital after suffering severe eye injuries, allegedly resulting from the blow dealt by her husband.\nA request for bail was turned down by the court, presided over by magistrate Audrey Demicoli, who remanded the man in custody, while issuing a Protection Order in favour of the victim.\nThe court also banned publication of the names of both parties\nLawyer Kenneth Camilleri was defence counsel.", "comment_count": 0, "id": 1916}, {"keywords": "", "author": "Denise Grech ", "article_body": "Housing worries have shot up according to a Eurobarometer survey, becoming the second most important concern for Maltese people following migration issues. \nOver a quarter of respondents were worried about housing according to the survey, surpassing crime, as the second most pressing concern for Maltese.\nWhen asked about the main issues facing Malta, half of the respondents mentioned migration, followed by housing (29%), environment, climate and energy issues (28%), crime (19%) and rising prices and inflation (19%).\nRead: 1,700 single mothers are waiting for housing\nHousing concerns rose in a matter of months, according to the survey. In the previous Eurobarometer, which was carried out in spring last year, 20% of people said they were concerned about housing.\nThe latest Eurobarometer survey, published on Wednesday, was taken in November last year. Over 500 interviews were carried out as part of the survey.\nHouse prices have shot up following economic growth and the influx of foreigners over the past years. The report revealed that the prices increased at a faster rate than the world’s priciest housing market in Hong Kong.\nLeading figures such as Archbishop Charles Scicluna have long warned of a “social emergency” in housing, with people finding it increasingly difficult to keep up with rising rent prices. \nRead: Bishops warn of a 'social emergency' in housing\nThe Eurobarometer survey also revealed trust in the written press continues to be lower than the EU average. \nOnly 32% of respondents said they trusted the written media, compared to the European average of 47%.\nRespondents also said television was their main source of information for local and European political matters. Trust in political parties was higher than the EU average (18%), with 36% of respondents saying they trusted parties, the report showed.\nSixty-three per cent of respondents also said they trusted the government, compared to the European average of 35%. \nRead: Run-down government buildings offered for NGO housing projects\nThe Maltese continue to be optimistic about their prospects, with 87% of respondents saying the current situation was either very good or rather good. Forty per cent of respondents also said they believed Malta would get better in the coming 12 months. \nThis was nearly double the level registered for the whole of the EU (21%) and the highest among the 28 member states, the report noted.", "comment_count": 66, "id": 1917}, {"keywords": "", "author": "", "article_body": "Three men were arrested during a major police operation currently under way in Qormi.\nIt is not yet clear what the operation is targeting but sources said it was likely related to drugs.\nAt least nine police officers from the Drug Squad and the Special Intervention Unit are taking part in the operation in Triq Armal, corner with Triq Valletta.\nSnipers were also spotted strategically placed on rooftops before the raid was carried out.\nFurther details to follow", "comment_count": 6, "id": 1918}]