[{"keywords": "", "author": "", "article_body": "Updated at 4.10pm with Labour statement\nA report on questionable army promotions was yet another condemnation of the Labour government's abusive governance which was simply being ignored, the Nationalist Party said on Friday.  \nAddressing a press conference, Opposition MP Beppe Fenech Adami reacted to the findings of an Ombudsman investigation into promotions in the Armed Forces top brass.  \nBack on February 15 - some 10 weeks ago - the Ombudsman had found that the promotion process was “vitiated”, lacked integrity and was intended to “produce a desired outcome”.\nOmbudsman Anthony Mifsud had said that one of the main issues that led to the process being simply “a screen for the choice made” was that two of the members on the selection board had been persons of trust without any specialisation in military affairs.\nThe controversial promotions in September 2013 included that of the present commander, Jeffrey Curmi, who had leapfrogged from major to brigadier – four promotions – in a matter of months.\nSince its publication, Times of Malta has also reported how the Office of the Prime Minister was refusing to implement the recommendations.   \nOn Tuesday a spokesman for the Office of the Ombudsman confirmed that the government had not yet implemented the recommendations made more than a year ago to correct an injustice suffered by various army officers.\nSpeaking during Friday's press conference, Dr Fenech Adami said that since the promotions had not been based on merit, they had resulted in people who were competent and qualified, being overlooked, \"simply for not being close to the Labour Party and in particular, to Prime Minister Joseph Muscat\".\nThis was also resulting in members of the AFM being demoralised and the AFM suffering a worrying brain drain, he said.\nThe chain of command in the AFM had lost its moral authority, and officers' sense of justice and career progression had been trampled on.\nAlthough the government did not appear to care, the PN was there to stand up for these people, and to say that someone in this country did in fact care.\nThis, Dr Fenech Adami said, was just one of the many instances where the government was ignoring warnings about bad governance.  \nMEP candidate Dione Borg said the AFM was one of the country’s most important institutions and the ombudsman's report illustrated the importance of the PN’s proposal for important offices to be appointed by a two-thirds parliamentary majority. \n'Fenech Adami owes army an apology' - PL\nThe Labour Party hit back by attacking Dr Fenech Adami, saying that he had failed the army when he served as \"de facto\" home affairs minister.\nDr Fenech Adami was a parliamentary assistant within the Home Affairs Ministry between 2010 and 2013. \nThe PL said that the government's reaction to the Ombudsman's report about AFM promoitions was within the report itself. ", "comment_count": 2, "id": 3019}, {"keywords": "", "author": "", "article_body": "The government’s interest was not to restore trust in Malta’s institutions but to continue to capture them politically, MEP David Casa said.\nHe said in a statement the government’s sheer arrogance could be seen in its latest decision to nominate new magistrates and judges before making the necessary reforms.\nMr Casa said he would continue to insist on the implementation of the Venice Commission recommendations are implemented as soon as possible as well as those in the Greco report.\n“The Nationalist Opposition has insisted in the Maltese Parliament on the setting of of a committee that would lay out the manner in which the Venice Commission and Greco recommendations should be implemented. \nThe European Parliament, just as it did over the past years, would continue to safeguard democracy and the rule of law in Malta and Gozo, as well as act on behalf of the Maltese and Gozitan people, he said.\nHe also referred to the Ombudsman’s statements on promotions in the Armed Forces and said that instead of being arrogant and rubbishing the recommendations, the Labour government should take heed and implement them.", "comment_count": 15, "id": 3020}, {"keywords": "", "author": "", "article_body": "Efforts to save the chapel and affreschi that are housed on the first floor of St Augustine’s Priory in Valletta are being stepped up as a series of events designed to highlight the architectural features of the building and the imperilled art pieces has just been announced by the prior, Fr Alex Cauchi.\n“We had already managed to get European Regional Development Funds to cover 80 per cent of restoration works, but these funds do not include the chapel on the first floor, and the affreschi that are showcased there. At the moment they are in a dire state, so we have been trying our utmost to source funds,” Fr Alex said.\nThe Augustinian church, sacristy, oratory and priory comprise one whole block of Valletta between Old Bakery, St John, Old Mint and St Mark streets.\nThe sacristy consists of a rectangular space with a second attic and vaulted roof. The priory building is mostly on three floors at Old Bakery Street with another two floors of rented housing and shops beneath the convent onto Old Mint Street. The oratory occupies part of the ground floor beneath the Augustinian convent. Structural changes were made in 1845, converting part of it into a sacristy.\nFr Alex has joined forces with German cultural manager Xenia Lorenz-Rebers, who explained how she fell in love with the historical and cultural aspect of the priory while on a visit to Malta. When she realised that parts of the building and some of the artworks were in danger of perishing unless urgent restoration interventions were carried out, Ms Lorenz-Rebers was determined to come up with a plan to save them.\nAt the moment they are in a dire state\n“The entire monastery is impressive. Fr Alex explained that some €9,000 is needed in order to carry out the necessary works, but of course he doesn’t have access to those funds. I went back home to Germany and gave the matter some thought. Eventually, I came back to Malta, discussed it with Fr Alex and we set up a plan,” Ms Lorenz-Rebers said.\nThe first event takes place on June 5 and will feature blind pianist Anton Belousov. The 26-year-old musician is considered a prodigy, having been born blind and starting to learn to play the piano at the age of seven, under very difficult conditions. He is currently performing as a solo-pianist, and orchestra pianist, with the Philharmonic Orchestra of St Petersburg and the Philharmonic Orchestra Ryazan.\nWhen he learnt about the features of the priory, Mr Belousov was immediately interested, and expressed enthusiasm to be part of the project.\n“He told me: ‘I cannot see the beauty of the church in which I will be playing, because I am blind, but I can still feel the presence of God, and it is an honour for me to contribute to such a project, playing for the people in Malta’,” Ms Lorenz-Rebers said.\nThe concert is not a one-off, but marks the beginning of a project called Concert & Dinner, which will see up to three events taking place until the end of year, each one featuring different musicians. All proceeds will go towards the funding of the restoration works.\n“The idea is to get the audience more involved in the story and the needs of the priory, thanks to an intimate setting. After the concert, while enjoying dinner, guests will be able to converse with the musicians themselves,” Ms Lorenz-Rebers said.\nAll work being carried out on this project, she added, is being done on a voluntary basis, from the design of the poster to the services she is providing herself.", "comment_count": 0, "id": 3021}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 6.10pm with Education Ministry statement\nMalta has the second largest number of early school leavers in Europe, with one out of every six students quitting school in their teenage years.\nHowever, despite topping the list along Spain and Romania, Malta has managed to halve the share of early school leavers between 2006 and 2018, according to European data.\nAccording to Eurostat, early school leavers are those aged between 18 and 24 with, at most, lower secondary education and who are not in further education or training.\nIn 2006, a third of Maltese students left school early, a figure that dropped to 17.5% in 2018. In both instances, boys made up the largest share of early school leavers, with 36% in 2006 and 19.4% in 2018.\nMalta pledged to bring down the figure to 10% by 2020.\nRead: Early school leavers in Malta are highest in the EU\nOverall, the proportion of early leavers from education and training decreased over these 12 years in all member states, except for Czechia (increased to 6.2%), Slovakia (8.6%) and Sweden (9.3%).\nLast year, the lowest numbers of early school leavers were recorded in Croatia, Slovenia, Lithuania, Greece, Poland and Ireland, while the highest shares were recorded in Spain (17.9 per cent), Malta and Romania (16.4 per cent). Thirteen states have already fulfilled their 2020 national target.\nMalta triples portion of 30 to 34-year-olds with tertiary education\nMeanwhile, together with another 15 member states Malta has met its 2020 target for those aged 30 to 34 with tertiary education.\nOnly 9.3% of the Maltese had completed tertiary education in 2002 – a figure that rose to 34.2% in 2018.\nThe share was higher for women than men - 37% compared to 31.7%.\nThe countries at the top of the list have seen at least half of their population aged 30 to 34 completing tertiary education.\nMore than 57% did so in Lithuania and Cyprus, while more than 56% completed tertiary education in Ireland and Luxembourg.\nOn the opposite end of the scale, the lowest proportions were observed in Romania (24.6%) and Italy (27.8%).\nRead: Early school-leavers suffer from ‘intense health-related problems’\nWomen surpassed 2020 target\nEurope has set its own 2020 target, and so far, it remains on track. It expects at least 40% of 30 to 34-year-olds in the EU to complete tertiary education.\nIt crossed the threshold last year with 40.7% – up from 23.6% in 2002.\nThe steady increase was even more significant for women - from a quarter in 2002 to 45.8% in 2018 - than for men (from 22.6% to 35.7%), meaning that women are above and men still below the overall Europe 2020 target.\nIn a statement issued later on Friday, the Education Ministry highlighted tertiary education figures as especially noteworthy.  \nThe Ministry also highlighted progress in cutting early school leaving rates. In 2000, more than half of all students left school early; by 2010 that rate was 23.8 per cent and it is now 17.5 per cent, the ministry said. ", "comment_count": 15, "id": 3022}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, jailed for life over his involvement in the murder of messenger Alphonse Ferriggi during an armed holdup outside a Bank of Valletta branch in San Ġwann 19 years ago, shed light upon preparations leading up to that fateful incident.\nRichard Grech, 51, convicted for life following a trial by jury back in 2011, took the witness stand in ongoing proceedings against James Vella and Chris Scerri who, together with Joseph Zammit, also jailed over his involvement in the crime, had allegedly made up the gang behind the violent robbery which had yielded no cash but “only papers”.\nAlthough testifying at length about the plans leading to the heist, Mr Grech claimed to have parted company with Mr Vella and Mr Scerri shortly before the holdup, his desire for a drink and a shot of heroin proving too much to resist.\nThe man, who 19 years ago had been hooked on alcohol and drugs, recalled how he had first got to know the two co-accused through their acquaintance with a former girlfriend of his from Qormi.\nBack in 2000, Mr Grech shared his San Ġwann apartment, a penthouse opposite the BOV branch, with the woman during his trips to Malta from Libya where he had been working at the time.\nBoth Mr Vella and Mr Scerri used to visit the couple at their San Ġwann home, spotting the messenger who drove up every morning in a white station wagon at around 5am to deposit “money or at least bags” at the bank’s deposit box.\nThese daily visits, observed from the veranda across the road, had led to the hatching of a plan whereby those bags, believed to contain cash, were to be seized by the gang.\nMr Grech, describing himself as being “drunk from morning till night”, said he just used to go along with whatever the others decided.\nThe witness recalled how one Sunday, shortly before the robbery, he had accompanied Mr Vella to Sliema, parking his car along the seafront while the other man slipped into a parked Volkswagen Golf, left momentarily unattended by its driver who had stopped to grab a bite from a nearby kiosk, and drove off.\nThe vehicle stolen on that day was to be used during the holdup, the witness explained, adding details as to how the car had been hidden somewhere at San Ġwann valley until the execution of the plans.\nOn the eve of September 18, 2000, Mr Vella and Mr Scerri had called for Mr Grech before driving their red Mazda Bubble to Floriana where the fourth member of the gang, Mr Zammit, was waiting.\nWith hours to go to 5am, the foursome had whiled away the time, later returning to Mr Grech’s apartment.\nAs the hour approached, Mr Zammit had driven the getaway Mazda to the pre-determined spot, the San Ġwann landmark, also known as the Rajt ma rajtx , smajt ma smajtx cross, where he was to wait while the other three carried out the holdup.\nMeanwhile, the latter sat inside the Golf, metres away from the bank, awaiting their victim who would turn up to deposit the bags, Mr Grech recalled, saying that they “wouldn’t know what was in them”.\nHowever, as the moments dragged by, Mr Grech had been taken ill, his drug dependency getting the better of him and forcing him to retire back to his apartment where, after a shot of heroin, he had gone to sleep.\nLeaving home later that morning, the witness recalled having noticed nothing untoward outside the bank and had only overheard third parties talking about the murder.\nHe had met Mr Vella and Mr Scerri while getting his supply of drugs from Qormi, later that same day.\n“Did you do it?” the witness had allegedly asked. “Yes, but we found nothing, just papers,” was the alleged reply.\n“That was the end of the story,” Mr Grech declared, confirming under cross-examination that he could not offer eye-witness evidence as to what the two co-accused had actually done after he left them.\n“I saw nothing, I went upstairs, I went inside.”\nInspector Keith Arnaud prosecuted. Lawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 3023}, {"keywords": "", "author": "Ivan Martin", "article_body": "Police are investigating reports of vandals that have defaced two historic buildings with black liquid in Mqabba in recent weeks. \nMqabba mayor Charlene Muscat told Times of Malta that the small village's community was \"united\" in dismay at what appeared to be black tar thrown onto the facades of two historic buildings in what she described as an attempt to intimidate residents. \n\"It seems someone is trying to pass on a message, to instill fear. But they got the opposite reaction from the public as people have united to support those affected,\" she said.  \nLast month, a property on Valletta Road, Mqabba, was defaced with the suspicious black liquid.\nAnd on Friday morning the front facade of another historic building, dating back to the 1700s, was also found covered in black liquid.  \nFriday's discovery of the attack on Torri Vincenti, which was built in 1726, saw an outpouring of outrage from residents.\nSources said the vandalism had come after the property owners had raised concerns over large construction trucks passing through the village's narrow streets, causing damage to properties in the quaint neighbourhood.  \nSpeaking on condition of anonymity one resident said they had had enough of being \"bullied\" by a particular developer who would not listen to reason.  \n“When I tried to talk sense to a driver he reacted with threats of violence.\n“This is how we are living in our quiet village – in fear that if we open our mouths we will suffer damage to our properties or worse,” the shaken resident said.\n\nShocking CCTV footage seen by Times of Malta shows a large construction truck - loaded with building debris, zooming passed one of the buildings - hitting one of the defaced buildings.\nA notice near one of the vandalised buildings says that vehicles wider than two metres should not pass through the narrow street.\n\nIn a Facebook post the Mqabba local council described the attacks as \"cowardly\". \n\"We hope that justice is served for the residents affected and that whoever is responsible is apprehended by the police,\" the council said. \nThe video below shows trucks being driven through the narrow streets.  \n\n \n \n ", "comment_count": 136, "id": 3024}, {"keywords": "", "author": "", "article_body": "The deficit in the consolidated fund blew up to €134.2 million by the end of March, 120.6% more than in the same period last year.\nThe National Statistics Office said that during the first quarter, recurrent revenue rose by €99.7 million over the same period last year and amounted to €1,014.5 million. This represented a 10.9% increase from the €914.8 million reported in the same quarter in 2018.\nThe increase was primarily the result of a €29.8 million rise in grants.\nTotal expenditure by the end of March stood at €1,148.8 million, a 17.7% increase from the first quarter of 2018.\nRecurrent expenditure stood at €993.1 million, €120.5 million higher than reported by the end of March 2018. The main contributor to this increase was a €68.8 million rise under programmes and initiatives. Conversely, drops of €8.6 million in allocation in respect of local councils and €5.4 million in treasury pensions slightly off set this rise in outlay.\nThe interest component of the public debt servicing costs amounted to €49.7 million, a €6.2 million drop from 2018.\nGovernment’s capital expenditure registered an increase of €58.7 million from the same period last year and amounted to €106 million.\nThe difference between total revenue and expenditure resulted in a deficit of €134.2 million compared to a deficit of €60.8 million in the same period in 2018. The main catalysts in the difference were increased outlays in both recurrent and capital expenditure.\nDuring March, central government debt stood at €5,502.5 million, a €41.8 million rise from the corresponding month last year.\nEuro coins issued in the name of the Treasury also rose by €6 million.\nGovernment stocks and foreign loans decreased by €201.5 million and €7.9 million respectively. Higher holdings by government funds in Malta government stocks also resulted in a decrease in debt of €18.8 million.", "comment_count": 16, "id": 3025}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "In the last decade or so, social media has taken on a more prominent role in conversations about heritage and heritage preservation, both internationally and locally.\nAn Instameet being held on Saturday will highlight some of Ħamrun’s facades, niches, signage and other quirky spaces.\nFacebook and Instagram, in particular, have increasingly highlighted fading aspects of our national identity and criticised attempts at destroying both natural and built environments. Few people are left untouched by the wave of nostalgia created by such platforms.\nOne of the Instagram accounts that consistently pulls at our heartstrings is MaltaDoors, an online gallery documenting the quirkiness of Malta’s doorways, entrances and signage, among others.\nThe project’s curator, Lisa Gwen Baldacchino, believes social media is helping to raise awareness and give people a voice, even if that is limited to their online social circle.\n“If MaltaDoors is anything to go by, I can say that followers of the account have learnt to or are learning to really look at and appreciate Maltese architecture, in its many facets,” Ms Baldacchino, an arts and culture manager by profession, said.\nThe most at risk, in her opinion, are modernist builds and townhouses that have been derelict or were abandoned for years.\n\n“There seems to be little to no regard to safeguard modernist architecture − it doesn’t fall under ‘our’ definition of what constitutes cultural heritage,” she notes.\nMs Baldacchino is saddened by the fact that whole buildings in familiar roads are being knocked down to be replaced by apartment blocks. Abandoned spaces pose a bigger problem.\n“The longer builds are neglected, the more problematic they become to then renovate – which could also be an unattractive quality and a detriment in terms of potential buyers or future home owners,” she points out.\nBut she is angered most by the “sheer insensitivity and general lack of taste”. “Some builds are given horrible extensions which are in no way in keeping with the architectural fabric within that locality,” she said.\n\n“There is a lack of contemporary aesthetic and sensitivity where spatial dynamics/distribution is concerned. There is also very little attention/concern for public space, and green space.”\nMaltaDoors was born by chance three years ago. While organising her many snaps, Ms Baldacchino realised her propensity for urban landscapes, apertures, facades, capturing the light and the way it exalted and defined architectural elements.\n“The ‘purpose’ I believe has changed, now, but there was no vision when it started, other than a love for taking photos and playing local tourist,” she admits.\nSince then, the project has consistently received positive feedback from followers around the world, media houses, print magazines and travel platforms.\n\nAmong her photographic collaborations, Ms Baldacchino mentions those with Surface Mag (the US), The Simple Things (UK) and a recent one with Hangar Agency, with whom she worked on a project for Malta International Airport to create artwork for the hoarding covering a new project.\nAn upcoming collaboration she is excited about is with Andrew Farrugia and Craig Macdonald, the team behind Te fit-Tazza, who create modern designs portraying Maltese buildings and landscapes.\n“I love them, their work and what they stand for. When they approached me to create a limited series, based on my images, it was an easy and obvious yes,” she enthused.\nIn a bid to raise more awareness, Ms Baldacchino is holding an Instameet in Ħamrun on Saturday.\nInstameets are basically organised photowalks by Instagrammers for Instagrammers.\n\nMs Baldacchino has planned a trajectory, with specific spots in mind, where she will highlight certain aspects of the locality and then everyone is free to take photos of whatever they like, be it themselves or of the environment.\nThis is the third such event Ms Baldacchino is organising. Participants, who often include non-Maltese residents, are encouraged to really look at and appreciate a place or space which they would have probably overlooked.\n“We think we know many localities and yet we don’t really explore them – most of us don’t really venture into the local bars, or każini, we don’t stop to look at the monuments, the devotional niches, the street vendors, the facades and residential builds. We might know the square, we might know a few ‘landmarks’ but how well do we know the outskirts, the alleys?” she asks.\nBut why Ħamrun? Ms Baldacchino moved to the locality five years ago and she admits she is in love with the place.\n“It reminds me of my childhood. To me the shops on the main road held the same fascination as Valletta did. For some reason, Ħamrun lost its lustre a few decades ago but it’s still incredibly charming and quirky,” she said. “There’s an authenticity there, which I don’t find present or which is not as immediately palpable elsewhere. The signage and the old shopfronts are especially worthy of note.”\nSaturday's Instameet will be held between 2.30pm and 6pm. For more information, visit the MaltaDoors Facebook event.", "comment_count": 1, "id": 3026}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A total of 67 organisations will on Saturday remember Lassana Cisse, who was murdered in cold-blood on Triq tal-Ġebel in Birżebbuġa on April 6.\nThe 42-year-old Ivorian man had most probably been walking home after offering food and support to migrants at the Ħal Far centre.\nHis trip was cut short when a driver opened fire, a case that according to investigators was looking increasingly possible to be a racial hate crime.\nWatch: A hit-and-run went unnoticed until a murder on the same road\nTwo other men, who have since been released from hospital, were also seriously injured in the drive-by shooting.\nThe 22-year-old from Guinea and a 28-year-old from Gambia both live in Birżebbuġa. \nNo one has yet been accused of the murder and migrants have since been living in fear, with Mr Cisse’s flatmates barely sleeping at night.\nThe 67 organisations who banded together are calling on the police to commit all necessary resources to bring the perpetrators to justice.\nThey are also urging the authorities to ensure that all members of Maltese society feel respected, safe and protected.Lassana Cisse\nThey will lay flowers in Mr Lassana’s memory in Ħal Far.  The organisations are meeting at 11am on Saturday outside the Jobsplus premises and head to the murder site together.\n“Lassana’s life mattered. He mattered to his family, to his friends, and he mattered to us. Such brutal acts of violence cannot and must not be ignored or silenced.\n“Together, we remember Lassana Cisse, whose life was so callously taken away.”\nThey condemned racism and wanton acts of hatred, encouraging people to come together to denounce this act of violence.\nPeople are welcome to bring flowers with them.\nRead: In memory of Lassana - Michela Spiteri", "comment_count": 0, "id": 3027}, {"keywords": "", "author": "Ramona Depares", "article_body": "Malta ranks as one of the most ‘instagrammable’ places in Europe, with a global travel site placing it seventh on the list, beating destinations like the Cote d’Azure, in France, Kiev, in Ukraine and Vienna, in Austria.\n\nAccording to Big 7 Travel, which released the rankings this week, locations with “sweeping stretches of coastline, historical monuments, kitsch cocktail bars and more street art than you can possibly imagine” turned out to be the most popular on Instagram, with the final results ranked in order of their visual allure and popularity on social media.\nDubrovnik, in Croatia, topped the list, with Iceland and the Scottish Highlands featuring second and third respectively.\nCities that made it to the Top 20 include Bruges, in Belgium and Portugal’s Lisbon while the Tuscan region, in Italy, and Lake District, in England, also faring well on a regional level.\nAn Instagram search using #Malta reveals almost six million posts featuring some of the most iconic spots on our islands as well as some pretty spectacular off-the-beaten track spots.\nValletta, as is to be expected, ranks high on the list of top posts, with a particular shot of the skyline featuring the iconic Carmelite church dome garnering over 1,500 likes. The traditional, colourful facades in towns and villages are also popular and serve as vibrant backdrops for many a tourist selfie.\nThe colourful umbrella installation that brightened up Żabbar some months ago still ranks high on the top #Malta posts as do shots showcasing the crystal blue Mediterranean Sea, especially in Comino’s Blue Lagoon. Sadly, missing from the list is the Azure Window, which succumbed to the elements over two years ago.\n\nInstagram is today considered one of the main driving forces within the tourism industry. Sixty-seven per cent of people surveyed by Big 7 Media said they have visited a new destination after seeing it on Instagram and 61 per cent booked a specific hotel after seeing it on their Instagram feed. Another 33 per cent said they researched their upcoming holiday destination via the Instagram feed, leading many to wonder about the relevance of printed guidebooks in the digital age.\nThe survey results were reached via what the website described as “a comprehensive scoring system” that analysed the amount of hashtags per destination, survey results gathered from the site’s 1.5 million audience and votes cast by a panel of travel experts.\n‘The best locations have the least tourists’\nMichele Agius who, with almost 12,000 followers on his Instagram handle @micagius, is one of Malta’s top travel bloggers told Times of Malta the App broadened people’s horizons considerably.\n“Lesser known places have boomed after going viral on Instagram, each due to their unique characters, be it colourful buildings, a rugged mountainous landscape or pristine seas and beaches. When travelling, it is best to find the beauty in everything, while appreciating the place for what it is and not what it could have been.”\nHe said that, as a travel blogger, his challenge in photographing a location was to help viewers see it differently than before.\nHis advice to prospective instagrammers is: “Always research a place before you visit, watch videos, read about the spot and go through the place’s hashtags to learn about the location and see what has already been done. You should aim to be different and, hopefully, to wow the viewer. If your photo does not have these qualities, it will just be missed through quick scrolling.”\n\nOf course, Mr Agius does have his favourite spots to instagram in Malta. Acknowledging it is very easy to take things for granted and to forget to be appreciative of the island we live on, he urged people to simply “stop, enjoy the view and realise how lucky you really are to call this home”.\n“Sometimes, we forget that such beauty is at our doorstep. Playing tourist in Valletta and straying off the beaten path always presents new Insta opportunities, just like every sunset at Golden Bay does. Of all the elements on the island I’ve photographed, the Mediterranean Sea is the one I love most. With our clear seas, countless wrecks and natural stone formations, it’s not hard to see why,” Mr Agius said enthusiastically.\nHe recommended to those who are new to the Instagram game to forbear from starting to snap away immediately. “Don’t be lazy, look around and get inspired. The best locations are those with the least tourists around. And avoid framing unnecessary objects, such as railings,” he said.\nBut, most important of all, he concluded, enjoy the experience.", "comment_count": 38, "id": 3028}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Friday’s newspapers.\nTimes of Malta says no one was hurt when an apartment block in Gwardamanġa collapsed on Wednesday night moments after the residents fled when they noticed large cracks forming in the walls. In another story, the newspaper says President George Vella urged the government to implement “as soon as possible” the Venice Commission’s recommendations on the appointment of the judiciary to ensure their independence.\nThe Malta Independent says that all four families affected by Gwardamanġa’s building collapse have been given alternative accommodation by the contractor from the adjacent site.\nIn-Nazzjon quotes the Nationalist Party’s health spokesman Stephen Spiteri saying that the government had money for corruption but not for the most vulnerable.\nL-Orizzont says that a centre of wellbeing has been inaugurated within Mcast.", "comment_count": 0, "id": 3029}, {"keywords": "", "author": "", "article_body": "Two people are expected to be arraigned in court in the coming days after they were arrested on Thursday in connection with thefts from vehicles in the Delimara and St Peter’s Pool area.\nThe police said the two were arrested following days of investigation. Several stolen objects were found during a search in a car the thieves were using.\nPolice investigations are continuing.", "comment_count": 0, "id": 3030}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat on Thursday again failed to give an indication of when he planned to implement the Venice Commission’s recommendations on judicial appointments.\nPressed for a specific declaration that Thursday's were the last appointments of members of the judiciary under the present system, Dr Muscat insisted he would not give any timelines.\n“I will not confirm anything about further appointments because situations could develop that would make certain things necessary,” he said curtly.\nWhen Times of Malta insisted that Dr Muscat outline his plans on the recommendations made, he replied: “We will definitely implement the changes before those ever implemented by a Nationalist government.”\nDeclaring he was making a political comment on the court case filed just before the swearing-in ceremony, he lambasted Nationalist MPs Simon Busuttil and Jason Azzopardi for signing Repubblika’s court application. “It is ironic the two lawyers are now not supporting a system introduced in 2016 and which was voted upon unanimously by Parliament,” Dr Muscat remarked.\nWe will definitely implement the changes\nWhen asked why he was still rushing on with the appointment of members of judiciary despite the Venice Commission’s comments that a reform was required because the one in place did not safe-guard the independence of judges and magistrates, the Prime Minister noted that reforms took long to implement and necessitated discussions.\nFollowing constitutional amendments, the government, in 2016, had introduced the Judicial Appointments Committee, which would evaluate candidates applying to become members of the judiciary. The government, however, still enjoys the prerogative of choosing the candidates who get the committee’s blessing.\nThe first candidate appointed under the new system was Toni Abela, a former deputy leader of the Labor Party, who was appointed judge.\nIn a recent report issued on Malta’s rule of law and the state of democracy, the Council of Europe’s Venice Commission said the modified judicial appointment system still “falls short of ensuring judicial independence and further steps are required”.\n“The principle of independence of the judiciary requires that the selection of judges and magistrates be made upon merit and any undue political influence should be excluded,” it noted.\nDr Muscat said he agreed with the Venice Commission’s recommendations but has, so far, ignored calls from various quarters, including the Opposition parties, not to make further appointments to the Bench until a new system is launched.\n ", "comment_count": 93, "id": 3031}, {"keywords": "", "author": "Claire Caruana", "article_body": "Friends and former employees of Queen Elizabeth still share a certain “familiarity” with the monarch, royal biographer Andrew Morton has discovered, with some affectionately referring to her as ‘Aunty Liz’. \nThe biographer spoke to the Times of Malta yesterday while in Malta to meet with those who had had any form of interaction with Queen Elizabeth and Prince Philip during their stay on the island while the prince served as a Royal Navy officer before his wife ascended the throne.\nThe Queen has since then often described living in Malta as the happiest time of her life.\n“The people I’ve spoken to talk about her as Aunty Liz. There’s a kind of familiarity that people feel towards her, especially those who worked with her. And what is also interesting is that she kept in touch and still keeps in touch with people from all those years back,” Mr Morton said.\n“She keeps in touch with their families. How many of us keep in touch with people when we’ve moved on? She did.”\nThe island, he said, was a key player in the life of not only Queen Elizabeth but the entire Royal Family, with the people that have come forward so far confirming that the monarch did indeed enjoy many happy moments while living on the island while her husband was serving as an officer between 1949 and 1951.\n“Virtually every member of the Royal Family has visited here or lived here or been stationed here. It’s like the spiritual heart of the Royal Family. Even Meghan (Markle) came here!\n“The abiding word when reading the correspondence and the conversations is the word ‘happy’. There’s a great deal of warmth and the fact that she seemed more relaxed. You get to see the human being behind the mask,” the biographer explained.\nShe still keeps in touch with people from years back\nThose coming forward with recollections, he noted, were mainly former employees who worked for the then-princess or acquaintances who lived close to Villa Guardamangia, in Pietà, where the pair resided during their stay in Malta.\nOn whether he believed that the Maltese still felt a bond to Queen Elizabeth, Mr Morton said that the people he met seemed to still feel a genuine connection to her, adding that she was considered an “honorary Maltese” to some, as was Prince Philip.\nApart from the international bestseller about the late Princess Diana, Mr Morton has recently also written a biography on the latest addition to the Royal Family, Meghan Markle, the wife of Prince Harry.\nAsked about this and whether he believed that the Maltese felt the same connection to her as they did with the other royals, Mr Morton said that it was interesting that of all the people that the young prince could have married, he ended up with someone with links to the island.\n“If you read what she had to say about Malta after her visit you can tell that she [Meghan] feels at home here and she feels that way because she has ancestors who were also here,” Mr Morton went on.\nOn some of the stories that would be featuring in his upcoming book, Mr Morton said that while still early days, the recollections would surely reflect details of the mutual respect between the Queen and her Maltese acquaintances.\n“This man told me yesterday that he called her Aunty Liz and I thought to myself: ‘Oh, really?’\n“But then he showed me some of the letters they sent each other and there it all was!”", "comment_count": 7, "id": 3032}, {"keywords": "", "author": "Denise Grech ", "article_body": "Prime Minister Joseph Muscat on Thursday urged local councils to clean up the country and reduce waste, admitting he was not satisfied with the level of cleanliness in the country.\nSpeaking at Msida during the Labour party annual general conference, Dr Muscat said people needed to show discipline not to leave waste in the streets.\nPeople needed to show the same care to the streets as they did to the inside of their houses. \nThe big challenge in the next five years was for local councils to improve the level of cleanliness, he said.\nThere were several reasons for the waste in the streets: contractors that didn't pick up waste and tourism pressures being among them, he said. \nWith hard work, he hoped the Msida promenade could one day be as beautiful as the Sliema one. \nCommunities, he added, were hoping for their roads to be improved, for better parking, and to deal with tensions between the residential community and budding businesses. \nThe Labour party would be issuing a manifesto for each locality addressing these issues. \"No issue is too small,\" he said. \nHe once again levelled criticism at the Opposition for not fielding enough local council candidates in 21 localities. \"Isn't the scope of a political party to subject itself to people's judgement,\" he said.\nAddressing injustices\nWork-related injustices were also being addressed as part of an electoral pledge.\nSome 6,000 people will be receiving over €11 million this year in a bid to deal with long-standing grievances. Some 2,500 police officers who were not paid overtime will also be seeing that injustice addressed, Dr Muscat said. \nThe payments were only possible because the government had registered a surplus, he said. This allowed the government to correct injustices that had been made in the past, he said. ", "comment_count": 47, "id": 3033}, {"keywords": "", "author": "", "article_body": "The Chamber of Architects has called for an updating of regulations involving the building industry in the wake of Wednesday's collapse of an apartment block in Gwardamanġa and other earlier incidents.\nThe Kamra tal-Periti said the rate of construction accidents in Malta, whether resulting in damage to neighbouring properties, injury or even death, was unacceptable.\n\"The ever-increasing complexity of today’s buildings, compounded by the current frenzy of the industry to turn around projects as quickly as possible, urgently requires an immediate and major overhaul of the country’s building and construction regulatory processes.\n\"The current legislation in Malta is characterised by excessive fragmentation of responsibilities,\" it said.\nFor example, the Civil Code stated that “If a building or other considerable stone work erected under a building contract shall, in the course of 15 years from the day on which the construction of the same was completed, wholly or in part, or be in manifest danger of falling to ruin, owing to a defect in the construction, or even owing to some defect in the ground, the architect and the contractor shall be responsible therefore.”\nBut the Code did not establish clear lines of responsibility, and these were generally decided by the courts depending on the particular circumstances of each case.\nMoreover, whereas architects had a professional warrant and were subject to a Code of Professional Conduct, contractors were not regulated at all.\n\"This is especially worrying when it comes to demolition and excavation contractors. The absence of a registration system means that anyone with demolition or excavation plant can carry out such works, without any basic training, technical knowledge, or insurance cover.\"\nThe absence of a registration system means that anyone with demolition or excavation plant can carry out such works, without any basic training, technical knowledge, or insurance cover\nThe Avoidance of Damage to Third Party Property Regulations placed the onus of enforcing the implementation of a works method statement drawn up by an architect on a site manager purposely appointed by the developer, and on the contractor executing the works. \nOne of the regulations stated that “professional responsibility for the method statement remains with the architect who prepares it, whilst ultimate responsibility for adhering to the method statement rests with the site manager and the contractor.”\nBut once again, the regulations did not establish minimum basic training or competences for site managers, not even as basic a requirement as literacy.\nThe regulations even allowed the developer to take on the role of site manager, in what was clearly a blatant conflict of interest sanctioned by the law.\n\"Indeed, if the developer fails to appoint a site manager, the regulations presume that the developer is ipso facto carrying the responsibilities of a site manager.\nWhen two key players in the industry are not required to possess basic competence and are wholly unregulated, the public is exposed to unacceptably high and unnecessary risks\n\"When two key players in the industry are not required to possess basic competence and are wholly unregulated, the public is exposed to unacceptably high and unnecessary risks,\" the chamber warned.\nIt said that just two weeks ago, it held talks with the government on its detailed proposals for the regulation of the industry to bring it in line with other European countries. It will be making its proposals public in the coming days. \nThe chamber stressed that its comments did not refer to any case in particular. ", "comment_count": 49, "id": 3034}, {"keywords": "", "author": "", "article_body": "Updated 7.20pm with Labour's reaction below\nThe shadow minister for health, Stephen Spiteri, has called on the government to ensure that people who suffer ADHD get the best medicine from the health service.\nHe was reacting to reports that the medicine was recently changed, and the new one is not as effective as the one it replaced.  \nDr Spiteri said the government should review its procurement procedure to ensure that the best medicines were available to doctors.  \nMEP Francis Zammit Dimech said this was not the first time this had happened. In February the government had reportedly considered cervical cancer treatment which was not as effective as some products.\nIn diabetes too, doctors said better quality medicines should have been selected by the health service.\nHe insisted that contrary to some claims, there were no EU rules which forced the government to buy generic medicines instead of branded ones. \nLabour reaction\nIn a reaction, the Labour Party said it was worth remembering that the present government had solved one of the biggest problems in the national health service, which was medicines out of stock. \nThe former PN government had not only created the medicines out of stock problem, but it was also very limited in the choice of medicines it provided. Suffice to observe that the last PN health budget was of €365,132 million, compared to the current €685,808 million.\nFurthermore, the government has already taken action to address the problems faced by those suffering ADHD, something the PN seemed to be unaware of.\n ", "comment_count": 4, "id": 3035}, {"keywords": "", "author": "Ivan Martin", "article_body": "A growing need to feed exotic big cats could be among the main reasons retired racehorses are being illegally slaughtered, sources told the Times of Malta.\nRecent reports of horses being slaughtered in an unlicensed rural farm on the outskirts of Siġġiewi have also given rise to concerns that the meat could be making its way onto consumers’ plates.\nHowever, sources in the equine sector said that, while they were certain some of the uncertified meat was being served to diners, the “major” buyers of this black market produce were believed to be the owners of big cats such as lions and tigers.\n“There is a fellow, who most of us know, who slaughters retired racehorses for a few hundred euros and then sells the meat to people who have private zoos or who have, say, a tiger or a jaguar in their garden,” a veteran in the horse racing community said.\nRead: 'Pails of blood' lead to raid on illegal abattoir\nHe admitted he, too, had been approached in the past by third parties offering to slaughter any racehorses he might have wanted to get rid of. “It’s crazy, I know, but this is Malta and you come across all sorts,” he added.\nLaw enforcement and Veterinary Department sources told the Times of Malta reports of irregular horse meat being sold to private zoos and smaller collectors of large cats had emerged in recent months and they had a rough idea of who could be behind it but no evidence or actual reports to go on.\nA tiger or jaguar in their garden\nThe horse-owning community, they said, was close-knit and extracting specific information was no mean feat.\nFurthermore, they continued, officers tasked with investigating such crimes complained they already had their plates full, handling other cases of crime involving wildlife and the environment. That said, the sources urged members of the public to come forward with any information that could shed light on the illegal practice.\nThe sources noted that the illegal slaughter of animals raised a series of health concerns, not only because of the questionable hygiene standards during the killing process but also because of the fact that racehorses were usually administered performance-enhancing drugs.\nThere are also concerns on how the horses are being killed, with the sources not discounting the possibility of bin bags being placed over the animals’ heads, fastening the bag with a rope at the neck and then let the horse choke to a painful death that could take several minutes.\nAbout a decade ago an illegal slaughterhouse had been traced in the Swieqi valley when three men had been caught red-handed slitting the throat of a sheep.\nNine tanks filled with pigs’ heads were found a year later in a workshop that had been modified into a makeshift Qormi abattoir.\nNationalist MP Mario Galea last week blew the whistle on a number of suspected animal rights abuses, including the possible return of dog fighting.", "comment_count": 40, "id": 3036}, {"keywords": "", "author": "Denise Grech", "article_body": "The Planning Authority on Thursday controversially approved the building of another fuel station in Burmarrad, just five days before the expected publication of a revision of the fuel stations policy.\nThe approval will see a kerbside fuel station in the village centre being relocated to a field outside the development zone on Triq Burmarrad. The plans also include a car wash, a retail outlet and parking spaces.\nThe PA’s latest decision comes amid a long-promised review of the controversial fuel stations policy, ordered by Environment Minister José Herrera in January 2018 to minimise the burden on agricultural land.\nAmid protests by environmental activists, Transport Minister Ian Borg pledged to publish the revised document for public consultation by the end of this month.\nThe application for the new fuel station was submitted by Bonnici Stores Ltd in 2007. Two previous applications for a filling station and a fuel station on the same site had already been rejected in 1995 and 1997.\nRead: Ministers disagree on ODZ fuel stations, but conclusion imminent\nIn the latest assessment, the environment regulator had warned: “There is no valid justification for the further loss of undeveloped land outside the development zone boundary, along with the associated environmental impacts to accommodate such use.”\nWhen the application was first submitted, the Environment Protection Directorate had also warned the proposed development was not “simply a relocation to a safer location but is a major expansion ODZ with rather extravagant land take-up”.\nBut the PA approved the development with four votes against and seven votes in favour. Opposition representative Marthese Portelli, environmental NGO representative Annick Bonello, Environmental authority chairman Victor Axiak, and PA chair Vince Cassar all voted against.\nSpeaking prior to the vote, lawyer Claire Bonello, representing Front Ħarsien ODZ insisted the current fuel station policy did not allow relocation to areas with good agricultural land.\nMoviment Graffitti representative Robert Fenech also pointed out another fuel station was already located on the same lane.\n\nRead: New petrol stations policy will not apply to pending applications - minister", "comment_count": 45, "id": 3037}, {"keywords": "", "author": "", "article_body": "A survey has shown that 71 per cent of the Maltese intend to vote in the forthcoming European Parliament elections, slightly higher than the overall EU average of 67 per cent.\nA Eurobarometer survey looked into various aspects of the elections and views of EU membership and found that over a third of the Maltese were very likely to vote, roughly in line with the EU average.\nHowever, the Maltese were considerably better informed about the elections than their EU counterparts. Only 38 per cent of EU citizens knew when the elections were to be held (for the record, between 23 and 26 May) – compared with an impressive 73 per cent of the Maltese.\nThe Eurobarometer also checked how people’s opinion of the issues that mattered had evolved over time, comparing the results in September 2018 with those taken for the current survey in February/March.\nImmigration was – and remains – the main concern, with 72 per cent saying it should be discussed as a matter of priority, down four percentage points.\nCombating climate change, on the other hand, has gained in importance, with 50 per cent now saying it should be tackled, up 11 percentage points.\nIn third place was the need to promote human rights and democracy, mostly along the same levels as last September, and the fight against terrorism in fourth, down to 34 per cent compared with 49 per cent in the previous survey.\nThe impact of the European Parliament was also more appreciated by the Maltese, with 31 per cent saying its role has strengthened over the years, compared with 21 per cent across the EU as a whole.\nThe positive attitude also extended towards the EU itself, with 67 per cent saying membership was a good thing (EU 61%), and 91 per cent saying the country had benefitted from membership (EU 68%).\nIf a vote on accession were held today, only 12 per cent would vote to leave (EU 14%).", "comment_count": 84, "id": 3038}, {"keywords": "", "author": "", "article_body": "Around half of all households will be covered by true-fibre technology by the end of 2019, GO CEO Nikhil Patil announced on Thursday. \nSpeaking during an on-site visit in Santa Luċija, Mr Patil said that, to date, 85,000 homes have the opportunity to experience the technology, which delivers data \"at the speed of light\", with the number expected to reach around 100,000 by the end of the year. \n\"There is nothing faster in science today. GO is the only company in Malta that delivers a true fibre network right up to your living room,\" the CEO went on. \nInitiated in 2016, the long-term project is aimed at ensuring that Malta is ready for the technologies of the future, Mr Patil said, adding that the company strived to be ready for the technologies of \"hundreds of years from now\".\nSpeaking during the visit, Prime Minister Joseph Muscat said the technology was useless unless it went to the community directly, adding that he was pleased to see that GO was \"putting its money where its mouth is\". \n\"I am particularly glad to be in Santa Luċija today because this is also a very clear commitment and intent from the company that you're not only covering areas that might be no-brainers but it is coming to where real Maltese people live. I think this is a very important statement of intent. This is where the country will make a change,\" Dr Muscat said. \n ", "comment_count": 11, "id": 3039}, {"keywords": "", "author": "Denise Grech ", "article_body": "An application for a mega-extension of St Vincent de Paul was approved unanimously on Thursday by the Planning Authority.\nThe project will see the development of four residential blocks, which will house almost 500 residents, and a car park within the St Vincent de Paul Residence long-term care facility complex.\nAccording to the case officer’s report, the whole site will occupy an area of around 16,500 square metres.\nArtists' impression of the extension.\nMP Marthese Portelli, who acts as the PN representative of the board, argued that the investigations by the public procurement procedures related to the development being discussed were still ongoing.\nWhile the Opposition recognised more beds were needed, the extension was shrouded in controversy over public procurement procedures, Dr Portelli noted.\nThe Times of Malta had revealed a €60 million tender, issued for the provision of meals and the building of a new kitchen, was later morphed into a 500-bed fully fledged extension.\nThe Nationalist Party had asked the National Audit Office to investigate the contract.\nA judicial protest calling for the publication of the contract was eventually filed by Partit Demokratiku, arguing there were serious breaches of EU public procurement rules in the way the tender was handled.\nThe contract was awarded to James Caterers and Malta Healthcare – a subsidiary of the Seabank db Group.\nThe contract said that any additional investment had to come at “no additional cost to the contracting authority”. However, the government later agreed to pay €274 million for various services associated directly with the new extension over a period of years, the protest noted.", "comment_count": 2, "id": 3040}, {"keywords": "", "author": "Claire Caruana", "article_body": "The collapse of a building in Gwardamanġa adjacent to a construction site should not be used to “characterise everything” related to construction in Malta, Joseph Muscat said on Thursday.\n“When you take into consideration how much construction work is under way, we cannot use these events to characterise everything from this accident, as this would not be fair to those who abide by the rules,\" the Prime Minister said, hours after the partial collapse of three-storey block.\nThe corner wall of the three-storey block came crashing down on Wednesday night, with bricks and concrete rubble spilling onto the road and into a construction site next door. Nobody was injured with some neighbours evacuating the building just in time. \nWatch: 'Five minutes later and I would have found my brother dead'\n“It should also be a lesson that things can be done better. I will await the conclusions of the investigations. We have asked the Building Regulations Office (BRO) to tell us whether they received any complaints. I have no doubt that we need clear statements on this,” Dr Muscat insisted.\nThe partial collapse of the building in Gwardamanġa. Photo: Matthew Mirabelli\nHe confirmed that residents who were affected by the incident will be offered “assistance” but did not divulge any details on what this would entail.\nDr Muscat went on to acknowledge that this was not simply something that had impacted one construction site but there were other incidents that had occurred recently.\n“We need to make sure that things, and I’m not saying that is what happened in this case, are not simply done on paper. If there is a need for more assurances on the spot, that is what I care about. In fact, I have asked for this information,” Dr Muscat said.\nWhen asked for his reaction to claims by residents that they had resorted to the authorities but no action was ever taken, Dr Muscat was quick to add that he was informed that the BRO had not received any reports of complaints.\n“I don't have reason to doubt the residents and that is why we are waiting for all the reports. But maybe it could also be a matter of awareness on where the complaints are to be filed,” the Prime Minister added.", "comment_count": 0, "id": 3041}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 2.25pm, adds Transport Malta statement\nA resident who lived in the collapsed Gwardamanġa building tried to stop the adjacent construction works on Wednesday afternoon after noticing the damage being caused.\nSpeaking to the Times of Malta, Rosanne Lanzon said her brother noticed the damage at around 3pm, several hours before the collapse.\nThe building crashed down on Wednesday night, luckily leaving no victims among the debris.\nRead: Building collapses in Gwardamanġa, residents out in the streets\nMs Lanzon said her brother woke up to go to the bathroom yesterday evening, to be greeted “with a scene out of a film”.\nThe family managed to flee the building with their blind dog in their arms, moments before the collapse.\n“Five minutes later and I would have found by brother dead”, she said.\nOther residents told the Times of Malta that they had filed complaints about the ongoing works adjacent to them, including to the police.\nHome Affairs Minister Michael Farrugia later defended the police during a visit to the site.\nMinister defends police\nVideo: Matthew Mirabelli\nHe said he had not gone there to investigate as that was the job of the inquiring magistrate. The minister said he had some basic information about the site and had come to speak to the contractors and residents. \nThe Home Affairs Minister said responsibility for the safety of the workers at the construction sites fell into the lap of the Occupational Health and Safety Authority. \n“The police are no architects, they aren’t engineers, so they refer the case to the architects and the engineers to draw up the necessary reports, and they have to rely on those reports”, Dr Farrugia said when asked what normally happened when a police report was filed about constructions works.\nMalta Developers’ Association President Sandro Chetcuti insisted that the developer had followed all procedures and had filed all the documentation required.\nThe incident has sparked concerns among many who believe the large number of construction projects - especially the ones including excavation - were being carried out at the expense of health and safety regulations. \nDriving licence theory testing centre part of fallen block\nTransport Malta said it was temporarily suspending driving licence theory tests since the theory testing centre was part of the fallen block.\nIt said it was establishing an alternative site for the tests and clients would be informed of a new date and place. The service, it said, would resume May 2.\nDo you have footage of the aftermath of the incident last night? Send it to us on mynews@timesofmalta.com\nThe collapsed building adjacent to a construction site.\n ", "comment_count": 63, "id": 3042}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man’s night out dancing at a Paceville club proved a costly decision, landing him back behind bars with a hefty €24,000 bill to pay into the State coffers.\nThe 39-year old Portuguese national, whose name had been banned by another court presiding over the compilation of evidence over claims of harassment and rape by his former partner, had been arraigned afresh in March for breaching the conditions of bail pending ongoing criminal proceedings.\nThe man’s fresh arraignment had followed a series of circumstances culminating in allegedly incriminating footage wherein he could be seen dancing at a Paceville club close to midnight on March 10 and “having a good time”.\nWhen delivering judgment over the alleged breach of bail, the court, presided over by magistrate Donatella Frendo Dimech, observed that the accused had admitted in open court that he had “breached the bail condition regarding the hours within which he was ordered to retire in his residence”.\nThe bail decree, as varied by the Criminal Court in February, had imposed that the accused “was to return home at 9pm every day, including Sundays and public holidays”.\nFootage taken from the club left no doubt as to the identity of the man frequenting the establishment “after 10pm,” the court said, declaring the accused guilty, condemning him to a six-month effective jail term and ordering his immediate re-arrest.\nMoreover, following upon this conviction, forfeiture of the bail bond was mandatory in terms of law, the court went on, ordering the forfeiture of €24,000 representing a €10,000 deposit and a personal guarantee of €14,000 in favour of the State coffers.", "comment_count": 0, "id": 3043}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated 7.22pm with PN reaction below\n\nSix new members of the judiciary were sworn in on Thursday afternoon in spite of a court decree accepting to hear with urgency an application for the appointments to be halted.\nThe application was filed in the First Hall of the Civil Court in the morning by civil society activists Repubblika.\nThe court was asked to intervene with urgency to stop the appointments until a new system is introduced ensuring the judiciary’s independence. A revamp of the system was promised by the government years ago.\nIn a decree, Mr Justice Mark Chetcuti accepted to hear the case with urgency and gave the Prime Minster until the end of the court’s business on Friday to file its reply. He also declared he will be hearing the case with urgency on Monday.\nMr Justice Francesco Depasquale. Photo: Matthew Mirabelli\nSoon after the court case was presented, the Department of Information issued an announcement stating that President George Vella would be presiding over the swearing-in of the new judges and magistrates.\nIn a statement in the morning, the government confirmed reports by Times  of Malta last month that Cabinet had approved the promotion of three magistrates - Francesco Depasquale, Aaron Bugeja and Joanne Vella Cuschieri to judges and the appointment of three lawyers - Nadine Lia, Victor Asciak and Bridgette Sultana to magistrates.\nIn a statement, Repubblika said the government had publicly acknowledged the findings of the Council of Europe’s Venice Commission, that the present method of appointing judges meant the judiciary was not independent. The government had also publicly committed itself to change the method of appointing judges to guarantee judicial independence.\n\nThe organisation said that despite its promises, the government was appointing six new people to the bench using a system it had already admitted amounted to undue interference of the government on the judicial system.\nRepubblika said the case should get to the European Court of Justice that was currently examining the interference of the Polish government in the country’s judiciary and had ordered Poland not to appoint new judges until the case was closed.\nJustice Joanne Vella Cuschieri\nPresident calls for changes in judiciary appointments ‘as soon as possible’\nPresident George Vella called for constitutional changes according to the recommendations of the Venice Commission “as soon as possible” during Thursday's ceremony.\nRead: Better checks and balances needed to ensure rule of law - Venice Commission\nIn a direct reference to the recent Council of Europe recommendation, which the government accepted but did not implement, Dr Vella said that following changes in 2016, the government must now move as quickly as possible to implement further changes to assure the independence of the judiciary.\nWhile acknowledging that these changes need the support of two thirds of parliament, he urged the government and all those involved to implement the changes without further delay.\nRepubblika’s court case was filed by Prof. Vicki Ann Cremona and signed by lawyers Jason Azzopardi and Simon Busuttil.\nMr Justice Aaron Bugeja.\nMinistry: Busuttil, Azzopardi opposing system they used and approved in the past\nThe Ministry of Justice in a reaction Dr Busuttil and Dr Azzopardi themselves, in Parliament, back in 2016 voted in favour of the same method of appointment with which new members of the judiciary were now being sworn in.\n\"More so, through their actions, the two Opposition MPs are saying that all members of the judiciary who were appointed by successive governments, including that which they used to form part of and using a system which was less transparent than the present one, are not impartial or independent. This is an unprecedented fierce attack on the Judiciary.\"\nThe ministry pointed out that judicial appointments now follow written advice from the Judiciary Appointment Committee which is made up of the Chief Justice, the Auditor General, the Ombudsman and the President of the Chamber of Advocates.\n\"Both Busuttil and Azzopardi had voted in favour and approved this system which is more transparent than that which had been utilised by the various governments until then. This new system was also described as a positive step forward by the Venice Commission.\"\n\"It is bewildering how the two Opposition MPs are against the use of the method which they had themselves voted in favour.\"\nPN Reaction - government determined to have total control of the institutions\nIn a reaction, the Nationalist Party criticised the government for going ahead with the appointments to the judiciary without first bringing into force the recommendations of the Venice Commission for the judiciary to be truly independent. Furthermore, no consultation was made with the Opposition, something the commission had recommended.\nThe government had acted in a manner aimed at ensuring it would have control over the judicial system, Opposition leader Adrian Delia said.  \nHe said the Opposition would not tolerate a situation where rule of law reforms were nullified before even being introduced.\nNor would the Opposition consent to fictitious reforms which would still leave the government in total control.", "comment_count": 0, "id": 3044}, {"keywords": "", "author": "", "article_body": "Malta approved 660 asylum applications in 2018, almost twice the per capita average of the EU.\nThe EU approved asylum applications to 333,355, which works out to 650 per million population, while Malta’s rate works out to 1,385 per million.\nOf the 660 approved applications, 160 were given refugee status and 480 subsidiary protection, while 25 were approved for humanitarian reasons.\nSyrians were the largest group of successful applicants (230), with Libya in second place (225) and Eritrea in third (80).\nNo refugees were resettled to Malta, according to Eurostat, while the EU received 24,815 people.\nThe number of applications across the EU was down by almost 40% from 2017.\nThe largest group of beneficiaries of protection status in the EU in 2018 were citizens of Syria (96,100 persons, or 29% of the total), followed by citizens of Afghanistan (53,500 or 16%) and those of Iraq (24,600 or 7%).\n\nIn 2017, 172,900 or 32% of asylum seekers granted protection were Syrians, 99,800 or 19% were Afghanis and 63,800 or 12% were Iraqis.\nMore than 40% of all positive decisions in the EU were granted in Germany.  In 2018, the highest number of persons granted protection status was registered in Germany (139,600), ahead of Italy (47,900) and France (41,400).", "comment_count": 14, "id": 3045}, {"keywords": "", "author": "", "article_body": "Total cruise passenger traffic in the first quarter of 2019 amounted to78,051, an increase of 11.9% over the same period in 2018.\nThe National Statistics Office said there were 21 cruise liner calls during the first quarter, four more than in the previous year. At 99.7%, transit passengers accounted for the absolute majority of total traffic, reaching 77,853.\nOn average, every vessel that berthed in Malta carried 3,717 passengers, 385 less than in the previous year.\nPassengers from EU states comprised 65.9% of the total traffic, the major markets being Italy, France and Germany. The total number of passengers from non-EU countries stood at 26,632, of whom 19% came from the United States.\nOn a gender basis, female passengers made up 53.3% of the total. The largest share of passengers fell within the 60-79 age bracket and were followed by those aged between 40 and 59.", "comment_count": 2, "id": 3046}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A comment by Tourism Minister Konrad Mizzi that he recalls the first Air Malta flights in 1974, three years before he was born, sparked comments by friends and foes on the social media.\nIn an interview on Il-Bizzilla, Air Malta’s inflight magazine, Dr Mizzi spoke about the national airline’s 45th anniversary, saying he still recalled the airline’s first flights.\n“I still remember the day when Air Malta started its first flights in 1974, with scheduled services to London, Birmingham, Manchester, Rome, Frankfurt, Paris and Tripoli,” he said.\nThe comment prompted a number of memes poking fun at the minister. \nPolitical rival Peter Agius, a Nationalist candidate for next month’s MEP elections, was quick to post a screenshot of the interview on Facebook, pointing out that Dr Mizzi was born in November 1977.\nStriking a parallel to the controversies, the minister was involved in throughout his political career, Dr Agius commented tongue in cheek: “My parents always taught me that whoever lies on something insignificant also lies on much more serious things.”\nThis post prompted reactions by both admirers and critics of the minister.\nQuestions sent to the Tourism Ministry remained unanswered at the time of writing.", "comment_count": 47, "id": 3047}, {"keywords": "", "author": "", "article_body": "The double insularity experienced by Gozitan businesses should be addressed and these should be provided with additional flexibility, particularly when it came to EU funding rules for transport, MEP Roberta Metsola said.\nSpeaking as she was submitting a parliamentary question to the European Commission, in which she called for additional flexibility for Gozo when it came to the aid ceiling for road transport costs.\nGozitan businesses were faced with much higher costs than the €200,000 aid ceiling for and such a one-size-fits-all approach meant that the playing field was being skewed.\n“Gozitan businesses do not want handouts. They just want a fair approach that allows them to compete,” she said.\nDr Metsola argued that the specific characteristics of Gozo required specific exemptions from this rule.\n“If we really want to see Gozo as a business hub, we must act and lighten the burden to do business in Gozo,” Dr Metsola said.", "comment_count": 12, "id": 3048}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Updated at 10.30am with OHSA comments\nThe developer of the site at Gwardamanġa, adjacent to the collapse of a three-storey neighbouring building, had followed all procedures and had filed all the documentation required, the president of the Malta Developers’ Association Sandro Chetcuti said on Thursday.\nThe MDA reacted immediately to the news of the late-night collapse, and an agitated Mr Chetcuti confirmed to the Times of Malta that the site was being developed by one of its members, saying he was anxious to prevent people from jumping to conclusions.\n\"We were extremely concerned and cannot stress how relieved we were that no one got hurt,\" he said.\nAlthough not in a position to comment on what may have caused the collapse, Mr Chetcuti said his priority was to ascertain that the developer had not omitted any of the procedural steps and that there had not been any prima facie negligence which may have contributed to the collapse.\n“We contacted the authorities to verify that the developer and his architect had done all he needed to do in terms of method statements, condition reports and so on. I can confirm that all the documentation had been filed,” he told Times of Malta.\nRead: Building collapses in Gwardamanġa, residents out in the streets\nMr Chetcuti said that the spate of accidents over the past months, some of them fatal, underlined the important of having a sector that was self-regulated, which would be possible if it were mandatory for developers to register with the Malta Property Foundation, a partnership between MDA and the government.Sometimes, accidents are just that: accidents- Sandro Chetcuti\n“There is a big difference between someone who buys a plot and gets an architect and a builder – and a professional developer. The former is very often not aware of all the procedures that need to be followed.\n“If developers were registered, we would be able to control the standards and investigate abuse,” he said.\nHe pointed out there was a difference between the intrinsic safety of the site and the safety of the employees – which falls under the Occupational Health and Safety Authority.\n“And another point is that sometimes, accidents do happen,” he added.\nThe building collapsed late on Wednesday evening, in an incident which shocked neighbourhood residents but resulted in no injuries.\nThe corner wall of the three-storey block came crashing down around 10.40pm, with bricks and concrete rubble spilling onto the road and into a construction site next door. Police evacuated more of the area on Thursday morning as another section of the building was expected to fall - while cracks had also appeared in the RMF building next door.\n\n\n\nThe development in question has been going on intermittently, at least since 2017. Demolition and the main excavation works were finalised prior to May 2018. Construction activities continued at a very slow pace until recently, OHSA chief executive Mark Gauci confirmed to the Times.Aerial view of the buildings before works started. Photo: Google Maps\nTwo visits, not shortcomings notedOHSA officers had visited the site on two occasions when no serious shortcomings with regards to occupational health and safety regulations were noted.\nHowever, as Mr Chetcuti pointed out, the avoidance of damage to third party properties is not regulated through the OHS Authority Act but through the Avoidance of Damage to Third Party Regulations (issued under the Building Regulation Act).\nThese regulations fall under the remit of the Building Regulations Office and among other things, these regulations require the preparation of a method statement which shall be prepared by a perit in collaboration with the site manager and the contractor.\nThe method statement indicates the procedures to be adopted during the excavation, demolition and construction phases including any information which is relevant to safeguarding both the stability of the works being undertaken, as well as the stability of adjacent structures or terrain.\n“As already stated, it is BRO’s responsibility to investigate whether such an onerous obligation has been fulfilled with regards to this incident,” Mr Gauci said, adding that the risk to third parties following yesterday’s incident needed to be seen in the light of the protection of members of the general public, and therefore has to be addressed by the police.", "comment_count": 0, "id": 3049}, {"keywords": "", "author": "", "article_body": "Cabinet has approved the appointment of six new members of the judiciary - three judges and three magistrates.\nAll nominees had been previously approved by the Judiciary Selection Committee in line with the Constitution, the government said on Thursday.\nLater in the morning, Repubblika filed an application in the First Hall of the Civil Court calling for the appointment to be halted.\nThe appointments will see the number of judges go up to 24, that of magistrates would remain 22.\nCompared to six years ago, if one took into consideration the appointment of Lorraine Schembri Orland as a Judge in the European Court of Human Rights and the imminent retirement of Mr Justice Silvio Meli, the number of both judges and magistrates had increased by two.\nThis ensured the people got a better service and enabled the possibility of more specialisation, the government said.\nThe new judges will be Francesco Depasquale, Joanne Vella Cuschieri and Aaron Bugeja, the new magistrates Nadine Lia, Victor Axiak and Bridget Sultana.\nThe new appointments sees the female percentage of members of the judiciary going up to 53%.\nJudiciary appointments soon despite promised reforms\nLegal practitioners had told Times of Malta there was “a big rush to fill vacancies with more appointments before a new system is put in place”.\nFormer Opposition leader Simon Busuttil said the appointments were in serious contempt of the Venice Commission. \n\n\n\n \n ", "comment_count": 51, "id": 3050}, {"keywords": "", "author": "", "article_body": "Żejtun on Wednesday came alive as people gathered to celebrate the feast of San Girgor, traditionally celebrated the Wednesday after Easter.\n\nEvents kicked off with a pilgrimage from the chapel of St Clement, with Archbishop Charles Scicluna, the town archpriest and the clergy leading the way to the parish.\nThere, the clergy was joined by horse-drawn carts, with the participants decked out in traditional local costumes. \nAfter Mass, a programme of events featuring traditional folk music and children’s games was organised by Festivals Malta in the square in front of the church. \nThe crowd later made its way to Marsaxlokk to enjoy the rest of the day with traditional music and għana, food, tombola and – for the really committed ones – their first swim. \nThere were also a number of stalls with traditional crafts such as the loom, filigree, pottery, cane work, glass and lace.\nThis year, the festivities also included the 12th edition of Għanafest, a traditional event that highlights għana, which this year will take place on June 21 and 22 at the Argotti Gardens in Floriana.\nThe festival will feature foreign folk artists on its programme, including Sherazade, an Algerian singer. The Travellers, a local band which celebrates the Maltese language, are expected to be another highlight.\n\nBesides the traditional segments of għana, the main stage will also host contemporary bands Skald and Mistura. For the main stage, Għanafest has also invited ‘Sherazade et Lavion Rose’, a French folk group which is being brought to Malta in collaboration with the French Embassy.\nGastronomy also plays a big part in the festival, with the Mediterranean Culinary Academy holding interactive live cooking sessions using indigenous Maltese fish, while the traditional aljotta will be prepared by the fishermen’s wives.", "comment_count": 1, "id": 3051}, {"keywords": "", "author": "", "article_body": "A 76-year-old man was Qormi was seriously injured on Wednesday after falling down the stairs of a residence.\nThe police said the accident happened in Triq il-Kbira, Sqaq Nru. 4 at 6.30pm.\nThe victim was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3052}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says civil servants who did not achieve the set pass mark in an examination for senior principals were still promoted after this was lowered following the intervention of the Office of the Prime Minister. In another story, it says a growing need to feed exotic big cats could be among the main reasons retired racehorses were being illegally slaughtered.\nThe Malta Independent quotes the Planning Directorate saying that a planned home for the elderly outside development zone in Vittoriosa is unacceptable.\nIn-Nazzjon quotes leader of Opposition Adrian Delia saying that his party believed in the capability of the Maltese to compete in Europe.\nL-Orizzont says Malta’s is estimated to have an average growth of 4.2% up to 2021.", "comment_count": 0, "id": 3053}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Civil servants who did not achieve the set pass mark in an examination for senior principals were still promoted after this was lowered following the intervention of the Office of the Prime Minister, Times of Malta is informed.\nThe sudden change of rules, since condemned by the Office of the Ombudsman, took place during the last electoral campaign and the final interviews were held just three weeks before the country went to the polls.\nAs a result of the changes in the pass mark, some of those who had passed the first written part of the exam with flying colours were not promoted, ending up in a lower position after the second phase – an interview – when compared to others who had not performed so well in the written part.\nAccording to an investigation by the Ombudsman after a complaint by one of the candidates two years ago, 252 civil servants sat for the written exam, or the general ability test.\nThe rules specified that “candidates must obtain a 70% rating to pass the test” and that “candidates who are successful in part 1 and who are shortlisted will be asked to sit for a structured interview (part 2)”.\nHowever, the Ombudsman found that, on April 21, 2017, when the results had already been published and the number of those that obtained the 70% pass mark was determined, the Public Service Commission approved a request by the Office of the Prime Minister to lower the pass mark to 65%.\nOnly 89 were promoted from among those interviewed\nThis meant that, though originally 87 candidates were to be interviewed as they had obtained the set pass mark, another 49 were added to the interview list although they had not achieved the 70% pass mark in the written exam.\nTo add insult to injury, only 89 were promoted from among those interviewed for the second part of the exam. Some of those who would not have been eligible were it not for the lowering of the pass mark were made senior principals though others who had achieved the 70% mark failed to make it after the interview.\nWhen the Ombudsman asked for a justification, the Public Service Commission, a constitutional office with the remit of upholding principles of merit and equity within the public service, said it had accepted the Office of the Prime Minister’s request because “the number of applicants who achieved the 70% pass mark rating was insufficient to address the exigencies across the public service”.\nThe Ombudsman felt that the intervention to change the pass mark after the examination process had already started was not on and gave rise to discrimination against candidates who were successful prior to the intervention by the Office of the Prime Minister.\nThe Ombudsman commented that if there were not enough successful applicants, the PSC should not have changed the pass mark but should have rather “published an amendment to the call in such a manner and containing such provisions as the commission may direct, including, if appropriate, the extension of the time available for the submission of applications”.\nAlternatively, he added, it should have withdrawn the call and published “a revised call in such a manner and with such amendments as the commission may direct”.\nThe Ombudsman made it clear it was not acceptable that candidates who did not meet the criteria listed in the published call were still shortlisted to proceed to the interview.\nTimes of Malta is informed that the interview was conducted just three weeks before the general election by Christopher Cutajar, permanent secretary at the Transport Ministry, Joseph Stafrace and James Pearsall, a former president of the General Workers’ Union.\nA recommendation by the Ombudsman to ‘fix’ the injustice and reconsider the disadvantaged candidates for the appointment of senior principal is still being considered by the Office of the Prime Minister.\nThe PSC is chaired by Louis Naudi, who had been appointed by the Nationalist administration.\n ", "comment_count": 38, "id": 3054}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 10.30am \nA Gwardamanġa building collapsed late on Wednesday evening, in an incident which shocked neighbourhood residents but resulted in no injuries. The corner wall of the three-storey block came crashing down around 10.40pm, with bricks and concrete rubble spilling onto the road and into a construction site next door. A Civil Protection Department official told Times of Malta that nobody was injured in the incident.The resident said she lost everything but is happy that her blind dog was saved. Photo: Matthew Mirabelli\nAt 9am on Thursday, police were asking witnesses to move back and evacuate the area as they expected another part of the building to collapse. At 9.45am police were asking employees at the RMF offices to evacuate the building after a big crack was noticed in a wall. \nThe family in the middle flat managed to save their blind dog but the owner told Times of Malta: \"I have nothing but the clothes on my back at the moment.\"\nA person who was on site said the occupants were very lucky to escape. There were big cracks in the wall, which had been clearly visible from the outside.\nOne resident who was inside at the time of the collapse said they had filed reports to the police about works that were being undertaken nearby.\nThe contractor was seen on site in the morning and when asked if he had received complaints about the works he declined to comment.\nAn employee working at a gaming company at offices near the construction site said he could feel the vibrations from his desk when the construction was taking place.\nA nearby neighbour said the families were lucky the incident did not happen later as the residents would have been sleeping.\nThe highlighted part shows the building which crashed to the ground. The building to the left is now a construction site. Photo: Google Maps\n\"The crashing noise sounded like festa fireworks,\" she said.\nIt is not yet known what caused the sudden collapse, which also damaged a parked van.\nRead: Gwardamanġa developer complied with all procedures – Sandro Chetcuti\nThe area was evacuated by CPD officials and police, with Enemalta engineers also dispatched to the site to ensure damaged power cables did not pose a danger to civilians.\nThe development in question has been going on intermittently, at least since 2017. Demolition and the main excavation works were finalised prior to May 2018.\nPhoto: Matthew Mirabelli\nA shot of the building site from the back.\nThe incident happened a day another part of a building in Swieqi collapsed, injuring a worker in the process. ", "comment_count": 0, "id": 3055}, {"keywords": "", "author": "", "article_body": "Luciano Moggi, the former general manager of Italian giants Juventus, is eligible to vote in Malta's local elections. \nMr Moggi's name appears on the electoral register and his voting document bears an address in Gżira. \nThe information came to light after a photo of Mr Moggi's purported voting document was leaked to social media. \nIt is not yet known when the Italian official managed to obtain a Maltese permit, though his notorious tactics in the past have raised eyebrows in Malta. Mr Moggi had been handed a life ban by the Italian football federation and sentenced to prison for his role in calciopoli.\nMr Moggi drew universal condemnation for his purported underhand manoeuvres in trying to gain an unfair advantage for Juventus by influencing referee selectors, charges he strenuously denied.\nMr Moggi was initially sentenced to five years and four months in prison, reduced to two years and four months on appeal and then cancelled completely in 2015 when the charges were dropped, even though he was not acquitted.\nIn spite of all the accusations and criticism levelled at Mr Moggi and the sanctions imposed on the club, many Juventus supporters are adamant that calciopoli was born out of envy for their success and the power wielded by their general manager.", "comment_count": 68, "id": 3056}, {"keywords": "", "author": "Denise Grech ", "article_body": "Opposition leader Adrian Delia on Wednesday hoped the upcoming May elections will be the first step in changing the government's attitude.\nStating that the Nationalist Party was starting from the bottom, he urged supporters to recognise the party's limitations.\nThe upcoming European Parliament and local council elections are a month away.\nThe Nationalist party acknowledged, \"with humility\", that it needed to gain people's respect, he told supporters at the Ta' Xbiex PN club.\n\"This is not won overnight or by being arrogant and saying you know everything, but by listening to others,\" Dr Delia said.\n\"I am convinced in May, we will take the first step - not to change the government, but to change its attitude,\" he said.\nDr Delia also criticised the Labour party for saying the PN did not believe in democracy because it did not field enough candidates to fill the minority seats in a number of localities. \nIt was rich for the Labour party to say this, considering it tried to stop local elections from taking place two years ago, Dr Delia said.\nHe thanked the over 296 candidates for the local council elections and 10 for the European Parliament.\nDr Delia also said Finance Minister Edward Scicluna conceded the government had no plan and was not ready for the development boom taking place. \nSpeaking at the Labour Party's annual general conference, Prof. Scicluna reportedly said the country's infrastructure was starting to feel the weight of rapid and unprecedented economic growth. \nThis, Dr Delia said, confirmed the Nationalist party was right in saying Malta was not ready for the fast-paced development boom. \n ", "comment_count": 20, "id": 3057}, {"keywords": "", "author": "", "article_body": "Clive Agius\n \n \nClive Agius, the man who had been wanted by court order, has been found, the police said.\nThe police issued a request for information about the 34-year-old's whereabouts two days ago.\nMr Agius found himself back in the dock last year answering to charges of aggravated possession of cocaine and heroin, as well as with having breached bail conditions.\nThe police thanked the public for their assistance and said the man was being held for investigations.", "comment_count": 3, "id": 3058}, {"keywords": "", "author": "", "article_body": "A 67-year-old man was grievously injured in a fall from a cliff in Għajn Tuffieħa this afternoon.\nThe police said the accident happened at 1.45pm. \nThe victim, who lives in St Paul's Bay, had to be pulled up by an Armed Forces of Malta Helicopter. He was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3059}, {"keywords": "", "author": "Denise Grech ", "article_body": "Stacey Smith spent over 25 years searching in vain for her father’s grave until a letter to the Times of Malta finally provided the closure she had been searching for.\nMs Smith was only 13 when her father, Peter James Smith, succumbed to injuries from a gas explosion at his home in Paceville. The cause of the incident is still not determined.\nPeter James Smith died from injuries after a gas explosion in September 1993.\n“It is my understanding that he had been asleep and then woke up and had switched on a light, or perhaps lit a cigarette, which caused the gas blast,” she said, adding that the family never received an explanation from the authorities. \nThe man suffered 90 per cent burns to his body and succumbed to his injuries nine weeks later, she said.\nAt the time, the teenager was living in Scotland with her mother, who was unable to pay for her to come to Malta.\n“The government would not repatriate him as he had died without a will and had lived in Malta for more than 10 years,” she said.\nMs Smith’s family moved to Malta from Dundee, Scotland, when she was two years old. Together with her sister, she returned to the Scottish city with their mother after her parents separated. \nMs Smith was only five years old at the time. Speaking to the Times of Malta, the woman recalled fond memories of the country.\n“My love of being in and on the water was born in Malta,” she said. \n“My most vivid memories revolve around that, heading out to the Blue Lagoon, which is, in my mind, still the most stunningly beautiful place on the planet.”\n“I remember we would visit Valletta, all awestruck at how old and beautiful it seemed,” Ms Smith, 38, said.\nAlong the years she tried to locate her father’s final resting place but to no avail.\n“It was an agonising loss, particularly knowing it was not a pain-free and peaceful passing,” she wrote in her letter. \n“I never had the chance to say goodbye or pay my respects.”\nAfter reaching out to the British High Commission and Maltese officials, who informed her they were unable to track down her father’s grave, Ms Smith started to lose hope she would ever ‘meet’ her father again. In a last-ditch attempt, she wrote a letter to the Times of Malta making an impassioned plea for information.\nHer call for help did not fall on deaf ears for, having read her letter on this newspaper, the Santa Maria Addolorata cemetery archivist promptly informed her that her father had been buried in grave 91 in the West Division. Ms Smith now plans to travel to Malta towards the end of the year, when she has some time off her nursing classes.\n“I cannot express how amazing it would be to show my partner and my son the country where I grew up and the place that makes my heart swell just by thinking about it,” she said.", "comment_count": 0, "id": 3060}, {"keywords": "", "author": "", "article_body": "Updated Thursday at 1pm\nThe Malta-Gozo fibre optic cable has finally got under way, with 24 fibre optics that will be installed guaranteeing \"huge amounts of data\" for \"decades to come\". \nIt has taken over four years to get to this stage, with funds for a feasibility study being allocated in 2014.\nEarly last year, Malta Enterprise had issued a call for tenders for a €3.5 million project, to be completed within nine months of the contract being signed. Elettra, a subsidiary of Orange Marine, had won the tender. The company will be represented locally by Joseph Cachia & Sons, a member of the M Demajo Group. \nAn appeal had been filed following the identification of the preferred bidder last August.\nSpeaking during the launch, Elettra CEO Didier Dillard said the first main phase of the project - a survey of the best route for the project - has been completed. \nThe route will commence at the Xewkija industrial estate and move 3.6 kilometres to the shore at Tal-Fessej, limits of Mġarr ix-Xini. It will then proceed under water for 13 kilometres, landing at Golden Bay before terminating 4.3 kilometres away at Żebbiegħ, Mġarr.\nSpeaking in San Lawrenz, Prime Minister Joseph Muscat said a study had highlighted the islands could not depend on one fibre optic cable. \n\"While [Gozo] is showing clear signs of advancement, we need to close the gap between what is offered to Gozitan youth and families and what is offered on the main island,\" Dr Muscat said.\nHe said continuous investment would incentivise Gozitan youth to remain on the island.\n\"We will look back at this time as the period when Gozo reaped its best economic results,\" he said. \nFurther investment, such as the Malta-Gozo tunnel, would help provide a major update to both countries' infrastructure, he said. \nThe tunnel would act as a highway for foreign direct investment to flow towards Gozo in unprecedented levels, Dr Muscat insisted, saying it would give opportunities for Gozitans to work closer to home. \nGozo Business Chamber welcomes launch of project\nThe Gozo Business Chamber said that is it had proposed the project a number of years ago. It said the cable would make it possible for the ICT industry in Gozo to flourish, and the construction of the ICT Hub \"a reality in the making\".\nThe chamber encouraged government to implement this project as fast as possible for the benefit of business on Gozo, leading to new job possibilities for residents of the island.\nGozo Tourism Association says cable will attract more investment\nThe Gozo Tourism Association, in the meantime, said that the long-awaited project would enhance and increase the digital infrastructure in Gozo.\n\"The GTA believes that Gozo’s double insularity cannot be mitigated only through permanent links. But also, with projects like this announced investment will augment Gozo’s connectivity, opening up the island for potential private investment and job creation in the IT sector,\" it said.\nHowever, it urged the government to step up efforts to improve fconnectivity through the introduction of the fourth ferry, the fast ferry and an airlink between Malta International Airport and Gozo.", "comment_count": 5, "id": 3061}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The owner of a Ħamrun bar and four patrons were cleared of illegally betting after 10 years of criminal proceedings – featuring five prosecution witnesses – failed to “provide substantial proof which the court could rely upon”.\nMario Gauci, 50, from Mqabba, together with Carmelo Cassar, 31, of Żurrieq, Alfred Pace, 48, Jason Gauci, 45, and Lawrence Anchilleri, 67, all last three from Ħamrun, were cleared of all criminal liability in two separate judgments handed down on Wednesday.\nThe men had been targeted by criminal prosecution following a police raid at a Ħamrun bar back in October 2007 where officers had come across a number of patrons watching horse races with a French running commentary on two television screens.\nBooks and papers bearing figures indicative of football pools had been retrieved by the police during the raid but had never been exhibited in court.\nTwo of the men had been using a laptop linked to two betting websites, the prosecution had claimed, without, however, exhibiting the computer and the cash elevated from the bar throughout the proceedings.\nThese shortcomings were pointed out by the court, presided over by magistrate Natasha Galea Sciberras, who observed that when the police chose to press charges, one would reasonably expect them to bring forward adequate proof.\nProceedings had dragged on for 10 years, a delay certainly not solely attributable to the prosecution, the court observed, adding that in all this time only five witnesses had been summoned by the prosecution, four of whom were police officers.\nThese witnesses had provided “no substantial evidence upon which the court could rely,” the court declared, remarking that such witnesses were expected to prepare themselves well before testifying.\nIn the light of all evidence put forward, the court concluded that there was insufficient proof of the illegal gambling allegedly taking place at the bar, with the mere presence of the men there, watching horse races on television and a laptop linked to horse racing websites, deemed insufficient in terms of law.\nThe laptop had never been exhibited, the sergeant from the Cybercrime Unit had never testified and no court expert had been appointed to analyse the seized computer, the court observed, clearing all five of all criminal allegations in their regard.\nLawyer David Gatt was defence counsel.", "comment_count": 0, "id": 3062}, {"keywords": "", "author": "", "article_body": "EPP president Manfred Weber will be addressing the PN general council on Sunday, Opposition leader Adrian Delia said on Wednesday.\nWeber is the EPP’s nominee for the post of European Commission president.\nDr Delia said that Mr Weber came from a small town and was therefore well aware of the challenges facing small retail businesses which were losing business to online sales.\nHe was speaking during a visit by a Malta Business Bureau delegation to the PN headquarters, during which he was presented with a copy of their business manifesto for the European Parliament elections.\nDr Delia said that the PN was working within the European Parliament to find ways to help retailers grow their online present and to fight unfair competition.\n ", "comment_count": 3, "id": 3063}, {"keywords": "", "author": "", "article_body": "Health and safety authorities were warned three times about unsafe construction in Swieqi but only took an interest once part of the building collapsed, neighbours have claimed.\nAuthorities have however insisted that is not true and said officers visited the area twice within the space of a week, issuing stop orders for works on two adjacent sites.    \nA 24-year-old Senegalese worker was hurt on Wednesday after part of the building he was working on – a wall in what used to be a maisonette - collapsed. Lifting him out of the rubble required Civil Protection Department expertise.\nNeighbours who spoke to Times of Malta said that their warnings had been in vain.CPD members at the scene on Wednesday.\n“We contacted the Occupational Health and Safety Authority at least three times and sent them photos and video footage,” a woman who asked to remain anonymous said.\n“An officer called me once to ask if works were under way at that moment – which they weren’t – and that was the last I heard of them”.\nVideo of the works show a construction worker standing on top of a residence’s roof as he demolished it using a jackhammer. Mounds of rubble visible below suggest the roof was not being jacked up for support, and photos indicate employees were not wearing any ear, eye or head protection as they worked. \nThe woman showed Times of Malta copies of e-mails she had sent to the OHSA dating back to the start of April.\n“All we got was an acknowledgement,” she said. “Works continued. And sure enough, the inevitable happened”.\nTwo inspections and two stop orders - OHSA\nThe OHSA, however, insisted it had followed up on the complaints.\n“There are three adjacent properties in the area which are being demolished,” an OHSA spokesperson told Times of Malta.\n“Inspectors visited the site on April 4 and ordered works to be stopped that same day. While there, they noticed that a second site next door was being demolished without the OHSA having been notified. They ordered works to be stopped there too”.\nOHSA officials had returned to the site on April 10 but no works were under way at the time, the spokesperson said.\nIn the ensuing days, owners of the second site had gotten their paperwork in order and the OHSA had lifted its order to halt works, the authority spokesman said.\nOn Wednesday, part of that same site collapsed during works.\n“An investigation is now under way and it is too early to establish the root cause of the incident,” the spokesperson said.\nThe neighbours who spoke to Times of Malta were unconvinced by the authority’s explanations.\n“It might be technically two different sites, but workers always entered from the same doorway,” they said.\nRegular criticism\nThe police said worker’s injuries were very serious, with the OHSA saying that he had suffered a fractured leg in the incident.\nThe OHSA is often forced to defend itself from accusations of inaction, and its CEO Mark Gauci has repeatedly said that the authority is chronically understaffed and under-resourced, with less than half the staff it was originally meant to have when it was set up in the early 2000s.\n“We can’t be at every workplace at the same time,” Mr Gauci had told #TimesTalk almost two years ago, in an interview in which he argued that it was “wrong, misguided and unfair” to blame the authority for every workplace accident.", "comment_count": 0, "id": 3064}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A series of fraudulent thefts from an electronics chain store led the police to a man accused of being a drugs kingpin, after he allegedly accepted the stolen equipment as payment for drugs.\nThis fresh snippet of information emerged on Wednesday during the compilation of evidence against Jordan Azzopardi and a mother-of-five currently facing drug-related and fake currency charges ever since their arrest in March.\nRead: Acid tanks, white powder and fake €100 notes: court hears of drug trafficking operation\nA sergeant from the CID testified that the police had been investigating a series of thefts targeting the Pieta, Sliema and Birkirkara outlets of the same electronics store. The suspect had made use of a stolen cheque book to purchase iPhones and laptops before suspicious staff members had reported him to the police.\nThe fraudster was ultimately tracked down, with the help of CCTV footage from the stores.\nThe man, an Iranian national, was registered in Malta as a student. He had admitted to the fraud which had involved over €25,000 worth of brand new equipment, some of which was retrieved by investigators.\nOne iPhone was traced to the young mother, currently seated by Mr Azzopardi at the dock, the witness explained, adding that another gadget had been recovered from the brother of Ramires Vella, another youth arrested during police raids linked to the accused’s circle of operations.\nThe thief confessed that he had handed over a large part of the merchandise to Mr Azzopardi in exchange for drugs, the officer went on, explaining that the man had not replied when asked whether the drug kingpin had devised the fraudulent scheme.\nThe court, presided over by magistrate Doreen Clarke, also heard how three receipts relating to items purchased from the stores had been discovered during searches at Mr Azzopardi’s property together with the brand-new packaged products.\nAnother officer from the Economic Crimes Unit also confirmed under oath that back in 2015, Mr Azzopardi had been arraigned alongside two other co-accused, Naomi Tanti and Silvio Camilleri, over use of fake currency.\nProceedings in this regard were still ongoing separately before another Magistrates’ Court, Inspector Matthew Vella testified.\nRobert Mifsud, a currency expert, on Wednesday reported in court how four envelopes containing different currency had yielded only two fake banknotes. The other envelopes contained €480, €230 and four other banknotes, all genuine currency.\nAt the end of the hearing, the court declared that there was sufficient evidence for both accused to be placed under a bill of indictment.\nAs for the request for bail on behalf of the mother, defence lawyer Alfred Abela rebutted objections raised by the Attorney General, stating that there was no possible risk of tampering with evidence since the only civilian witness in her regard was currently behind bars.\nNor was there a risk of absconding given that the woman’s children lived in Malta, Dr Abela continued, adding that the accused had a clean criminal record.\nMoreover, a recent decision by the Criminal Court, presided over by Mr Justice Giovanni Grixti, had stated that investigations against a third party were not to create an obstacle to the granting of bail.\nThe court was to decide upon the request in chambers.\nMeanwhile, a bail application on behalf of Mr Azzopardi was to be dealt with at a later stage, upon the accused’s own request.\nInspector Mark Anthony Mercieca prosecuted. Lawyers Arthur Azzopardi, Alfred Abela and Rene Darmanin are defence counsel.\nThe case continues in June.", "comment_count": 0, "id": 3065}, {"keywords": "", "author": "", "article_body": "A motorcyclist suffered grievous injuries after crashing into a Peugot 307 in Paola.\nThe car, driven by a 52-year-old from Xgħajra, collided with the Honda motorcycle in Antoine de Paul square. \nThe 45-year-old Mosta resident was hospitalised following the incident.\nPolice investigations are ongoing. ", "comment_count": 0, "id": 3066}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The Arts Council has taken the first step towards putting a retractable roof over the Teatru Rjal in Valletta, with a tender issued yesterday for a company to handle a nationwide consultation process.\nThe Labour Party pledged in its 2017 electoral manifesto to look into ways to overcome the problems resulting from having an open-air theatre, including sound pollution and vulnerability to the weather. \nThe suggestion made in the manifesto was for a retractable roof, which it said could be done with aesthetic sensitivity.\nThe tender says that the former opera house, which was destroyed by enemy bombing 77 years ago, could be turned into a “fully-equipped performing arts space”. \nIt also says that the space could be used for conferences and exhibitions “of a more commercial nature”.\nPrevious attempts to reach consensus on the theatre have always been fraught, with controversy over everything from the architectural style to the amount of retail space within the building. Eventually it was included in designs for the entrance to the capital city by Italian architect Renzo Piano and it opened again as a performance venue in 2013.\nThe consultation process is meant to ensure that the Arts Council obtains feedback from internal and external stakeholders, experts from relevant multidisciplinary backgrounds and the public, according to the tender document. \nThe process will start with the setting up of an advisory council and will entail interviews, focus groups and panel discussions with stakeholders, as well analysis of the feedback. The project is envisaged to start during the second quarter of 2019 and to take 14 months.\nOnce the process is completed, the Arts Council will issue a position paper on the way forward.\nThe tender closes on May 14.", "comment_count": 19, "id": 3067}, {"keywords": "", "author": "", "article_body": "Updated at 4.45pm\nIt took well over an hour to release a man trapped under rubble on a construction site.\nThe man, a 24-year-old from Senegal residing in Birżebbuġa, was working on the construction site in Triq F. Vidal, Swieqi when a wall collapsed onto him, pinning him under the rubble.\nMembers of the Civil Protection Department and an ambulance were on site. Authorities were informed of the incident at 1.30pm on Wednesday.\nHe has been hospitalised and his injuries were later confirmed to be very serious.\n\nA number of accidents in recent months have highlighted the problem of lack of safe practice in the construction industry.\nEarlier this month, an 18-year-old construction worker was seriously injured after falling from a site in Żejtun.", "comment_count": 0, "id": 3068}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg   ", "article_body": "A young woman murdered last month accused her brother of having raped her and was hell-bent on having him sent to jail, her father told court on Wednesday.\nPaul Bonnici, who is serving time for murder, also described his murdered wife of having been a troublemaker and appeared to sympathise with his son Joseph, who stands accused of having killed them. \n\"You do not do that sort of thing for no reason,\" he told the court. \nMr Bonnici recalled how his daughter Angele and Joseph did not get along. \n“I feared that I would die and she would file a case against him,” he told the court. \nJoseph Bonnici stands accused of having murdered his mother Maria Lourdes and sister Angele late in March, shooting them in the head using a homemade gun which a ballistics expert testified was designed to take 12 to 16 gauge shotgun pellets. \nPolice testified earlier this month that they believe he meticulously planned the double murder, luring the two women to his house to kill them, hiding the bodies and then getting back to bed so that his girlfriend would not suspect anything was wrong.\nOn Wednesday, the court placed him under a bill of indictment.\nTensions between siblings\nDuring that sitting, Mr Bonnici said that he did not know why the siblings argued, but that Angele had told him that she had a plan to send some friends to hunt in her brother’s field, in the hope of drumming up trouble. The family lived on a quiet residential road in Għaxaq.\nHe said that the two children had had a normal upbringing, though he later revealed that he had once gone to his son’s house and seen something that shocked him.\n“I peeked through a hole in the door and saw my daughter completely naked, with a towel,” he said.\nAt the time, Angele was spending a lot of time at her brother’s house next door, where he lived with his partner.\n“I told her ‘so why did you never tell me or your mother about it?’” he testified.\nMr Bonnici then told the court that Angele had once told him that her brother had raped her as a girl.\n“I told her ‘so why did you never tell me or your mother about it?’” he testified.\nIn a previous sitting, Joseph Bonnici’s current girlfriend as well as his aunt had testified that Angele had made similar claims. \nA former colleague of Angele's would also make the claim when testifying later in Wednesday's sitting. \n'I killed because of my wife'\nPaul Bonnici recalled his murdered wife with a measure of rancour.\n“She was always stirring up trouble,” he said. “She would claim that her pots and pans were disappearing, and blame Joseph’s partner. But how could that be? Her door was barred,” he said.\nMr Bonnici was sentenced to 31 years in prison in 2005 for the double murder of two of his neighbours - murders which on Wednesday he blamed on his wife, saying she had needled him into committing them. \nHe said that his wife no longer visited him much in prison, with around three yearly visits in the past years.\n“She told me visiting made her dizzy, but she didn’t get dizzy when she went shopping with Angele on Sundays,” he told the court.\nIn a previous hearing, his aunt had described Joseph as a “very good boy” who was quiet and hard working.\nOn Wednesday, his father Paul continued along that theme, saying he could not understand how “such a good boy” could have killed two people, before adding “but you do not do that sort of thing for no reason”.\nFormer colleagues, acquaintance testify\nEarlier in the sitting, former working colleagues of Angele Bonnici’s as well as an acquaintance of hers testified.\nThe director of a health and safety company Angele worked at described her as a diligent employee who always turned up for work early. \nA former colleague told the court how Angele had twice told him that she had been abused by her brother. \n\"I'm not the Angele I used to be,\" he recalled her telling him. \nThe former colleague had however noticed \"nothing strange\" when he had once gone swimming with Angele, her brother Joseph and Joseph's partner. \n\"It was a normal brother-sister relationship,\" he testified. \nAn acquaintance of  the Bonnici family, Rita Spiteri, told the court she knew that Angele and her brother were not on speaking terms.\n“Maria Lourdes would say  ‘għandha raġun’ [she’s right] but give no details,” she said.\nThe case continues in June, when court experts will present their reports.\nInspectors Keith Arnaud, John Spiteri and Roderick Attard prosecuted.Lawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 3069}, {"keywords": "", "author": "", "article_body": "Ta’ Barkat Sewage Plant has been taken offline after a \"very large\" quantity of illegally discharged animal waste clogged up crucial parts of the facility, the Water Services Corporation said on Wednesday.\nThe WSC said in a statement that many parts related to sewage screening areas required immediate cleaning before the plant could resume operations.  \nA police report has been filed.\nNew water production would also be interrupted until the situation stabilised over the next five days, WSC added. \nThe WSC reiterated that sewage infrastructure was very complex and delicate and that such infrastructure was damaged through the improper use of the urban sewer system.\nIt was therefore very important that only human toilet waste and degradable toilet paper were discharged in the system.\nAnyone suspecting foul play or problems with the sewage system can report issues on freephone number 8007 6400, by e-mailing customercare@wsc.com.mt, website live chat at www.wsc.com.mt or through the corporation’s social media channels.", "comment_count": 29, "id": 3070}, {"keywords": "", "author": "", "article_body": "Supporting a Malta-Gozo tunnel before the necessary studies are carried out and published is irresponsible, according to a collective of Malta's NGOs.\nIn a statement released on Wednesday, 13 organisations said that since the benefits and impacts of the tunnel were not yet known, the Parliamentary motion which gave political backing to the tunnel last Wednesday was a non-starter. \nThe organisations said that, since this motion did not have legally binding implications, it simply represented an affirmation of the political commitment to build a tunnel.\nRead: Wirt Għawdex voices 'major concerns' about proposed tunnel\n\"However, this is a blind commitment since, at this stage, crucial data and studies have not been presented, including the most basic fact of whether the tunnel will indeed reduce journey time between the two islands,\" the NGOs said.\nThey added that it was \"questionable\" whether a relatively narrow tunnel with one lane in each direction, through which up to 9,000 cars will pass daily, would reduce the average journey time, when taking into consideration the capacity of the tunnel itself as well as higher congestion along the routes leading to and from it.\nRead: Could a 'permanent link' become a traffic bottleneck?\n\nWhile the approved motion did refer to the undertaking and publication of studies, \"common sense\" dictated that a commitment to the tunnel option should only come after such studies were carried out and published, not before.\nMoreover, these studies should not have the tunnel option as their point of departure, but should objectively compare different options in terms of costs, impacts and efficacy, including for example, a fast-ferry service, they said.\nEarlier in April, several organisations filed a judicial protest against the Minister for Capital Projects to publish all studies pertaining to the proposed tunnel.\nThey also asked for a Strategic Environmental Assessment (SEA) to be carried out as required by national and EU laws.\nThe 13 organisations behind today's press statement are:Din l-Art Ħelwa, Ramblers' Association of Malta, Nature Trust (Malta), BirdLife Malta, Friends of the Earth Malta, Moviment Graffitti, The Archaeological Society Malta, Flimkien għal Ambjent Aħjar, Kamra tal-Periti, Futur Ambjent Wieħed, Isles of the Left, Bicycle Advocacy Group and Żminijietna – Voice of the Left", "comment_count": 35, "id": 3071}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat is refusing to implement recommendations made by the Ombudsman to remedy a “vitiated” army promotions exercise in 2013.\nThe Ombudsman expressed surprise that the Home Affairs Ministry “does not seem to appreciate the significance of selecting the best officers in the army by a process which is above reproach and truly impartial”.\nA spokesman for the Office of the Ombudsman confirmed on Tuesday the government had not yet implemented the recommendations made more than a year ago to correct an injustice suffered by various army officers.\n“The government has not remedied the injustice and the Home Affairs Minister [Michael Farrugia] has stated that he does not agree with the Ombudsman’s findings with regard to the injustice suffered by the complainants,” the spokesman said.\nNoting that the Ombudsman was still expecting the government to remedy the injustice committed, the spokesman did not specify what form the remedy should take.\nRead: Army promotions intended to produce desired outcome\nAsked whether the eight officers involved should be promoted to the post they had applied for, the Ombudsman’s spokesman said that was up to the government. The Ombudsman was clear in his report that the complainants had suffered an injustice, he added.\n“The Ombudsman cannot recommend that these officers be promoted since the investigation only concerned the selection process itself and not who should have been promoted.\n“The Ombudsman’s final opinion unequivocally stated that the selection process was ‘vitiated’ and that the complainants and the other eligible candidates, who were not selected, suffered an injustice as a result of an act of maladministration,” the spokesman said.\nThe Office of the Prime Minister was asked what action, if any, was the Prime Minster contemplating to implement the Ombudsman’s recommendations, however, the questions remained unanswered by the time of writing.\nThe selection exercise to promote majors to lieutenant colonels started just a few weeks after Labour was returned to power in 2013. \nJeffrey Curmi and Mark Mallia, who at the time had a rank of major, were given four successive promotions between September and December of that same year, eventually ending up as commander, in the rank of brigadier, and deputy commander, in the rank of colonel, of the Armed Forces of Malta respectively.\nServing majors who felt they had more experience and qualifications than those selected in the exercise complained to the Ombudsman but the government tried to stop the investigation, arguing the Ombudsman’s office had no legal jurisdiction on AFM affairs. The court eventually up-held the Ombudsman’s right to investigate and a report was submitted in March 2018.\nThe selection process was conducted in an unprofessional manner\nThe Ombudsman concluded that the selection process was “conducted in an unprofessional manner” and was “a screen for the choice made”.\n“It was a process tailor-made to achieve a pre-ordained result”, the Ombudsman declared, insisting the whole exercise was “vitiated”.\nHe harshly criticised the choice of the selection board members, made by the then home affairs and national security minister Manuel Mallia, noting it was mostly made up of non-military staff. \nThese included two political appointees, a former One TV reporter and a ministry customer care officer who, the Ombudsman pointed out, were not familiar with the workings of the army.\nReacting to the Ombudsman’s findings, Home Affairs Minister Michael Farrugia insisted he did not agree with the conclusions of the investigation, even criticising the way it was conducted.\nOmbudsman Anthony Mifsud lambasted the minister, expressing surprise that the “ministry does not seem to appreciate the significance of selecting the best officers in the army by a process which is above reproach and truly impartial”.\nDespite subsequent appeals by the Ombudsman for the Prime Minister and Parliament to remedy the “injustice”, remedial action has yet to be taken.", "comment_count": 105, "id": 3072}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Quitting heroin is easier than quitting tobacco for some people because of the additional barrier of illegality, according to Caritas, which believes legalising recreational cannabis would do more harm than good.\nThe NGO is concerned that unverified claims about its health benefits only make cannabis more appealing and raises expectations.\nCaritas director Anthony Gatt. Photo: Matthew Mirabelli\n“When it comes to medicinal cannabis, we have to be careful what message we pass on. In Malta there is no clear definition of what conditions it should be prescribed for, and we have crossed paths with people who believe it will solve all their problems,” director Anthony Gatt told the Times of Malta.\nMr Gatt said there have been people who swapped conventional medicine prescribed for pain management with medicinal cannabis. However, the latter had no effect and their health actually regressed. \nRead: Medical professionals oppose cannabis legalisation\nCaritas, which has not objected to medicinal cannabis to treat specific conditions, has been approached by concerned parents who feel at a loss when confronted by health benefit claims from their children.\nMr Gatt said the NGO was insisting that passing on messages that cannabis was not a dangerous drug in this manner did more harm than good, especially among young people.\nRead: Cannabis legalisation movement condemns 'harmful' comments by academic\nThere was unanimous agreement among all stakeholders that exposure to cannabis was damaging for young adolescent minds. \nWhile no government would consider legalising it for adolescents, downplaying the harms and risks by removing sanctions, only made it more enticing for children.\n“Creating a favourable attitude towards cannabis will encourage more people to take up the substance – this is just what happened with alcohol and tobacco, which are nowadays the most commonly consumed substances in Malta,” he added.\nRead: Legalising cannabis for 'harm reduction' is not the answer - academic\nWhile not everyone developed a dependency, there were those who were more vulnerable than others, such as people recovering from some other dependency and those with a genetic predisposition of developing mental health issues like psychosis.\nMr Gatt, who has been working in the substance abuse sector for 20 years, acknowledged that there were people who would not develop a dependency. \nCaritas recognises the benefit of legalising it for those who are not dependent, as they would not have to deal with the black market and they would know exactly what they are consuming.\n“However, the State has an interest in the general well-being of the population, and hence its campaigns in favour of wearing seatbelts in cars, the risks of smoking and the dangers of drink-driving. The State is obliged to take care of public health,” Mr Gatt noted.\nThis is where the issue of common good came in, he said. It did not mean that because someone could consume it in moderation, others were capable of doing so. \n“There are people who enjoy cigarettes and alcohol in moderation, but the impact of the two substances on society is big. For example, a considerable percentage of cancers are caused by alcohol and tobacco,” he said.", "comment_count": 47, "id": 3073}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta says Prime Minister Joseph Muscat is refusing to implement recommendations made by the Ombudsman to remedy a vitiated army promotions exercise in 2013. In another story, it says the government must provide the nurses’ union with timelines for the Mount Carmel renovations by Wednesday, or risk being faced with industrial action.\nMaltaToday says Parliamentary Secretary Clifton Grima has vowed to have the racetrack completed by the end of the legislature.\nThe Malta Independent says the police have been instructed to avoid exposing gender in media statements.\nL-Orizzont says a surplus of €250.8 million has been registered.\nIn-Nazzjon says the government did not care for people who were paying high rental rates.", "comment_count": 1, "id": 3074}, {"keywords": "", "author": "", "article_body": "Inspired by the anthropomorphic paintings by followers of Flemish artist David Teniers, children aged between six and 12, can today get creative when joining artist and art-educator, Gabrielle Agius in a workshop being held at Palazzo Falson.\nThose attending can make mixed-media animal portraits while learning about the curious singerie tradition. \nThe workshop is being held between 11am and 1pm. Pre-booking is essential. Secure your child’s place by sending an e-mail to bookings@palazzofalson.com or calling on 21451021.", "comment_count": 1, "id": 3075}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government must provide the nurses’ union with timelines for the Mount Carmel renovations by Wednesday, or risk being faced with industrial action, Times of Malta has learnt. \nConstruction jacks being used to support parts of the ceiling at risk of collapse.\nThe move comes in the wake of reports in Times of Malta that most of the wards at the country’s only mental health hospital have condemned ceilings. As a result, patients have been crammed into a few wards, with beds lined up too close to each other. \nIn comments to this newspaper on Tuesday, Malta Union of Midwives and Nurses (MUMN) president Paul Pace confirmed that a meeting with the government was scheduled for Wednesday. \nDuring the meeting, the union will be asking for work timelines, as it had in the past. However this time around, if these are not provided, industrial action would follow.\nReferring to comments on Monday by Health Minister Chris Fearne, who assured journalists that patients were safe at Mount Carmel and that the government had a five-year plan for the hospital, Mr Pace questioned how the wards could be considered “safe” when patients did not even have enough space to store their personal belongings. \n“I fail to understand how the minister could insist that while the parts of the hospital with serious infrastructural problems have been evacuated, the remaining areas are safe. \n“Nurses cannot care for their patients’ properly, because they cannot even access their beds. Those who are crammed in the few remaining wards are piled up so close to each other that they have to place their belongings on the floor because there is no space for a bedside table,” Mr Pace said. \nHe added it was unacceptable that the minister seemed to measure patients’ safety by whether a ceiling is condemned or not. \nPhotographs taken inside the hospital show scaffolding being used to support parts of the ceiling at risk of collapse. In some areas, architects have also instructed workers to install metal support jacks to hold old beams in place.\nWhile saying that the easiest measure would be to instruct members to walk out of the dangerous building, constructed in 1861 and which he said was now just like a “pigsty”, Mr Pace insisted that nurses had a responsibility to their patients. \nWhile all other entities seemed to be shirking all responsibility, the union would not do the same, he said.\n“The condemned ceilings and close proximity of the beds, as well as the unusable offices and stairways, make giving proper nursing care very difficult. But there are patients that we need to think of before decisions are taken, Mr Pace said when pressed to state what kind of action the union could be mulling.\nPatients have to place their belongings on the floor\nThe union head also dismissed comments by the minister that the government has a five-year plan for the hospital and that works are currently under way. \n“We have been hearing this for years and yet we are still in the same situation we were three years ago, if not worse. Why are we still in the first year of this so-called five-year plan? The government claims to have allocated millions to refurbish Mount Carmel but we have yet to see any of this actually materialising,” Mr Pace went on. \nWhile the minister was quick to mention the five-year plan when faced with questions on the hospital, the union head said, the government repeatedly denied the MUMN a copy of an architect’s report drawn up to identify the problems there. \nOn whether nurses were refusing to work at the hospital, Mr Pace confirmed that the situation was so dire that none of the staff were voluntarily opting to be assigned there. \nInstead, he explained, fresh graduates who failed to make it to the top of their class were being placed at the hospital after all the other positions in other hospitals were taken up by those scoring higher marks. \n“Everyone is quick to talk about stigma surrounding mental health issues but in reality, the problem is the hospital. People are likely to not speak up about their struggles because they fear being admitted to the run-down hospital,” Mr Pace went on.\nIn the meantime, a spokesperson for the Ministry of Health said 104 patients have been relocated from Mount Carmel Hospital to Casa Maria, Prince of Wales, Sliema. \n“All patients were assessed by their consultant carer prior to the move. Casa Maria is licensed to host patients by the Directorate of Health Care Standards,” the spokesperson said.\n“Mount Carmel today is a safer place, since all the structures have been reviewed and dangerous areas are closed for patients and staff. \n“The ongoing project of refurbishing and restructuring at Mount Carmel Hospital will take a total of five years. We are in the first year of five. The project is proceeding according to plan, and by this summer two wards will be completely refurbished to house patients again,” the spokesperson said.\n“The total cost of this project is estimated at €30 million; an unprecedented investment in the mental health field.”\nclaire.caruana@timesofmalta.com", "comment_count": 34, "id": 3076}, {"keywords": "", "author": "Denise Grech ", "article_body": "The PN's decision not to field enough candidates for elections in 21 localities could have been a tactic aimed at discouraging the people from going out to vote on May 25, even though the European Parliament elections were also being held on the day, Prime Minister Joseph Muscat said on Tuesday.\nEarlier on Tuesday the PL said  the Nationalist Party had already lost a third of local councils since it fielded just enough candidates to fill the minority seats in 21 Labour-controlled localities. No elections would have been necessary had Labour not fielded a higher number of candidates than the remaining seats.\nPN slams Labour 'spin'\nThe Nationalist Party replied by noting that the same could be said of Labour in other localities such as Attard, Swieqi, San Lawrenz and Balzan, where the PL had itself not fielded enough candidates for council elections. \nIt also pointed out that the PL had cancelled elections in 16 administrative councils such as Swatar and Baħar il-Cagħaq, denying people there the vote. \nThe PN accused the \"socialist party\" of having failed to understand the concept of local councils - 25 years after the PN had introduced them - as it sought to centralise more powers. \nMuscat warns against complacency\nAddressing supporters during the opening of the Labour party's annual general conference in Tarxien, Dr Muscat warned against the view that people did not need to vote because Labour had already won in their locality.\n\"Had Labour played the same political game as the PN, 117,000 people would have been left with no reason to vote in the local council elections. They would also have had less of an incentive to vote in the European Parliament elections\", he said.\nEuropean Parliament elections and local council elections will take place on the same day for the first time.\nClearly, Dr Muscat added, the Nationalist Party could not find enough candidates in the south area of Malta and in Gozo. But it was astounding that it could not find enough candidates in large localities such as Qormi.\nThe Nationalist Party had become a party that represented regional, not national interests, he said. \nThe Labour Party had not only found enough candidates, but it would be presenting an electoral programme for each locality, Dr Muscat said.\nHe warned against complacency and urged people to vote, rather than give in to the strategy of those \"ready to play a political game with the future of the community\".\n\"What we need to do now is roll up our sleeves,\" he said. \"We cannot allow anyone to make us believe this is going to be a walkover,\" he added.\n'We introduced the word surplus to the Maltese' \nThe prime minister also spoke about the latest financial results, saying that this administration had introduced the word 'surplus' to the Maltese people, who had previously only gotten used to hearing about deficits and debt.\nFinancial data published today shows the government made a surplus of €250.8 million in 2018.\nThe surplus would have been achieved even without the €133.7 million from the citizenship by investment scheme, Dr Muscat said. Those who insisted in saying the government depended on a cash injection from the IIP scheme for a surplus were financially illiterate, he added.\nThe surplus was achieved by diversifying the economy, rather than eating up from the country's resources. While other countries dealt with their deficit by taking away benefits or firing civil workers, the Maltese government was wise with its money, he said.\n'We had to take decisions and calculated risks because we kept believing in our economy, he said.", "comment_count": 143, "id": 3077}, {"keywords": "", "author": "", "article_body": "Legal experts have voiced fears that gender quota proposals aimed at increasing female participation in Parliament are nothing but a “smokescreen” to introduce political party funding by the State “by stealth”.\nThe proposals, which were presented by Parliamentary Secretary for Reform and Simplification of Administrative Processes, Julia Farrugia Portelli, in March, would see the female gender representation in Parliament increased to 40 per cent through the addition of 12 extra seats. \nHowever, legal experts have pointed out that the proposed legislative amendments include a provision that appears to have fallen under the radar and that they claim can be used as a backdoor to introduce “the financing of political parties by the State by stealth”.\nThe proposals make reference to the introduction of “incentives in the form of State funding to political parties in order to support the under-represented sex to contest Maltese general elections”. \nThe document goes on to propose a number of  legal amendments for the Financing of Political Parties Act “to open the way for State funds that can be used to recruit, promote and train candidates pertaining to the under-represented sex”.\nHowever, sources within the legal sector have raised the point that State-financing should only be introduced after a widespread consultation process in its own right, and that introducing them in this way is “deeply objectionable”.\nTraditionally, the financing of political parties by the State is not viewed in a positive light by voters, with a 2014 poll about the issue by MaltaToday revealing that an overwhelming majority of respondents were against it.\nAdding her voice to the chorus of criticism is lawyer Claire Bonello  who, when contacted by this newspaper, insisted that State-funding should be discussed on its own as a comprehensive legislative mechanism if it enjoys electoral support, and not “slipped in as an ancillary thought”.\n“What measure of electoral and taxpayer support exists for this State financing? Why is an extra burden being placed on taxpayers without specific, transparent and widespread information as to the cost-benefit analysis of this measure?” the lawyer asked, adding that foreign jurisdictions where State funding has been introduced are often criticised for the lack of transparency brought about by these mechanisms. \n“If introduced in a piecemeal fashion, it risks becoming exorbitant, unnecessarily complex, and discriminating in the levels of funding awarded across the various political groups,” she said.\nThe lawyer also decried the way the proposals claim to be basing themselves on the Irish funding model, a reference that she described as “deceptive”.\nThe potential for conflicts of interest is rife\n“In Ireland, political parties are sanctioned, by reduction of financial grant receivable, if certain equality measures are not adhered to. However, this obviously presupposes that the principle of State funding is already in operation and agreed to,” Dr Bonello said.\nShe lamented the fact that in the local scenario, what is being proposed is “slipping in the very contentious issue of State funding by hitching it to the gender-balance bandwagon”, adding that “this is really not on”. \nThe proposed amendments have also attracted criticism for their failure to establish a cap on the amounts that can be directed towards this type of funding, as well as for allowing the amounts to be established by a legal notice.\n“This is a shocking abuse of the legislative form of delegated legislation, which is usually resorted to for flexibility and for administrative convenience and not on such an important issue,” Dr Bonello said.\nOther sources questioned whether any criteria will be laid down for the establishing of such amounts, and whether the publishing of these amounts will be placed within the remit of one ministry.\n“The potential for conflicts of interest is rife in circumstances where you have a minister from a government being able to set criteria and amounts of funding for his own party. This will be not be subject to much scrutiny from the Opposition party who would also stand to benefit from the State funding largesse. There needs to be some kind of legislative cap en-trenched in the Constitution and not one that is easily changed by the two major recipients of this funding,” Dr Bonello said.\nAnother source of concern is the fact that the proposals seemingly fail to provide for independent auditing of these funds. \nThe document, in fact, only requires the political party that benefits from the funding to provide an annual report to the Electoral Commission within a year from when the funds are received. \n“The Electoral Commission is made up of members from the main political parties, which will also be benefitting from this proposed funding. There has to be a system of external and independent auditing,” Dr Bonello said, while also confirming that she has already raised all these points through a formal submission on the e-mail address that was provided in order to enable the public to register its opinion in the consultation process.\nMeanwhile, asked whether any action was planned in response to these concerns, a government spokesman replied that the proposals were “definitely not a smoke-screen but rather a positive measure via a transparent process to remedy for the gender gap between the two sexes in Parliament,” adding that “any person contrary to the proposed mechanism can formally register their opinion in the consultation process”. \nNo negative feedback on the suggested mechanism was registered to date, the spokesman insisted. ", "comment_count": 49, "id": 3078}, {"keywords": "", "author": "Ramona Depares", "article_body": "The government urgently needs to invest in a well-equipped and accredited laboratory system to test local produce and to deliver results to farmers “in a timely and efficient manner”, according to the chairman of the National Hub for Ethnobotanical Research.\nThe use of pesticides in local produce has been the subject of much controversy in recent months, after an EU report placed Maltese fruit and veg at the top of the EU pesticides list. But Mario Gerada insists that, while true that pesticides are a major cause for concern, a holistic approach to tackle the problem is needed.\n“We cannot demonise the farmer. As part of the Hub’s research, we have met with the farmers and listened to their concerns. With respect to pesticides, they brought up a number of issues, such as when are the crops sampled. And how? When and where are they tested?” Mr Gerada said.\nREAD: Authority's pesticide test was 'flawed' - Environment Ministry\nThe results of this series of meetings were then collated into a list of policy requests from the farmers, combined with recommendations by the Hub and presented to Parliamentary Secretary for Agriculture Clint Camilleri. \n“The current system sees produce being tested for pesticides in a foreign laboratory, with the results taking about a year, give or take, to reach Malta. Whenever the tests reveal that any crops are too high in pesticides, that particular farmer’s produce is destroyed. But, in reality, the result would be referring to the previous year’s crop cycle. This does not make sense,” Mr Gerada said.\n“Malta does not have any accredited labs to carry out the tests locally, and the expense to implement local testing would be considerable. But a solution needs to be found.”\nIt was “an objective fact” that some farmers were using pesticides excessively, he said, but one also had to investigate the reasons in order to tackle the root of the problem. “In reality the majority are abiding by pesticide regulations. It’s just a matter of getting everyone in line.”\nThe relationship between farmers and authorities has not always been “the best” possible, he admits, putting this down to heavy bureaucracy. And, while farmers need to comply with regulations, teaching them how best to comply with the system is imperative, he says.\n“We need to depart from a position of care, as opposed to punishment. The industry was neglected for years, by all administrations, so the relationship between farmer and authorities needs to be rebuilt. No-one wants to eat pesticide-laden food, but a way needs to be found within a context of care.”\nREAD: How pesticides are monitored\nOne possible way of facilitating dialogue between farmers and government, Mr Gerada believes, would be to turn the government farm in Għammieri into a practical centre for research and dialogue in partnership with the farmers themselves.\n“The idea would be to transform the farm into a space where farmers can present the difficulties they encounter in their day-to-day work in order to discuss possible solutions. Let us say that farmers encounter a new kind of insect that they don’t know how to eliminate. It is more likely that they figure out a way to solve the problem without resorting to excessive pesticides if they have other experts to discuss the issue with. L-Għammieri could serve as the base for these exchanges.”\nMoreover, he continued, it was impossible to carry out a serious discussion about the use of pesticides without referring to the issue of traceability and imports.\n“At present, there is no system of traceability. All produce should be labelled, traceable and identifiable, both for regulatory purposes and for the consumer. We need to introduce a certificate of production that identifies the country of origin and safe use of pesticides.”\nThe importance of traceability takes on a strong significance when considering the difference in pesticide regulations between EU and non-EU countries where pesticide laws are much more lax.”\nFarmers lament the injustice of getting punished while others get off scot-free for the same thing.\n“For a long time, farmers have suffered a negative image and been looked down upon by the community in general. Our approach as a Hub has been to facilitate dialogue between all parties concerned, as we believe that this is more likely to lead to a long-term and reasonable solution than by focusing on purely punitive measures.”\nThe Ministry for Agriculture says spot checks for pesticides are carried out at the Pitkali Market, with about 50 surprise inspections carried out this year so far. Onsite inspections are also carried out to verify that the vegetables being delivered to the markets are locally grown and that producers with specific products truly cultivate the products they declare.\nA spokesman for the parliamentary secretary said a National Gene Bank would be established to safeguard against the possible loss of local varieties through the accidental introduction of harmful pests or diseases. Questions whether there are plans to invest in a local pesticides testing laboratory remained unanswered. ", "comment_count": 12, "id": 3079}, {"keywords": "", "author": "", "article_body": "Following a wet and windy start to the week, the weather forecast is promising a brighter and warmer day just in time for Wednesday's San Girgor celebrations which, for many, marks their first dip in the sea.\nIn reality, however, the centuries-long tradition is much more than that. \nThe feast, which has been marked since at least the 1500s, is celebrated on the first Wednesday after Easter Sunday.\nIn the past it used to consist of a procession by confraternities from all Maltese parishes starting from Mdina and ending with a religious ceremony at the Żejtun parish church.\nNowadays, the pilgrimage is considerably shorter as it starts from the chapel of St Clement in Żejtun. \nFrom there, participants, accompanied by the Archbishop, the archpriest and the clergy, head to the Żejtun parish church where the Miserere mei, Deus (Have mercy on me, O God) Psalm is sung. \n\nThere will be several artisan and food stalls in the square\nThey then continue to Żejtun’s old parish church, popularly known as San Girgor, where the clergy will be joined by horse-drawn carts and the participants will be dressed in traditional local costumes. \nFollowing Mass, Festivals Malta will ensure that this year the Żejtun festivities continue with folk music by għannejja and children’s games in the square in front of the church. \nThere will also be several artisan and food stalls scattered around the area. \nThe religious function and activities in Żejtun will then see the crowd make its way to Marsaxlokk to relax and enjoy the rest of the day with traditional music and għana, food, tombola, and – for the brave ones – their first swim. \nAt Marsaxlokk, two stages will be set up on the waterfront for a folk programme that includes daqq tal-prejjem and botta u risposta. There will also be a number of stalls with traditional crafts such as the loom, filigree, pottery, cane work, glass and lace.\nThe feast will kick off with the procession from St Clement at 9.30am. Mass will be said at 10.30am and the Marsaxlokk events will get under way at noon.", "comment_count": 0, "id": 3080}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat on Tuesday defended the government’s decision to reject a Russian request to use Malta’s airspace for military aircraft to fly to Venezuela.\nFielding questions during a press conference, Dr Muscat said Malta’s neutrality did not mean closing an eye to \"situations\".\nDr Muscat said the government had taken the best decision based on the information at hand.\nMalta approved a similar request in March, and Russian military planes and personnel were eventually spotted in the Venezuelan capital Caracas.\nThe Russian government has dismissed as “absurd” reports suggesting it could try and interfere in next month’s local elections in retaliation.\nA statement by the Russian government acknowledged that Malta had exercised its sovereign right but said the decision was not a “friendly” one.\nThe decision was applauded by the US State Department.\nAir Malta arrangements 'above board’\nAsked about government funding of Air Malta, Dr Muscat insisted that commercial arrangements between government-owned companies and the airline were all above board.\nHe said there was no government interference in this respect and Air Malta’s accounts had been audited by an international firm.\nThe recently published accounts show that were it not for nearly €34 million in revenue from the disposal of landing rights in 2018 to a government-owned company, the airline would have registered a loss of €17 million after restructuring costs and non-recurring items.\nFinance Minister Edward Scicluna said Air Malta had taken a strategic decision to give up an asset worth €62 million.\nHe said this decision meant the asset would keep on yielding income throughout the years.", "comment_count": 46, "id": 3081}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Finance Minister Edward Scicluna has given the green light to the Department of Contracts to ‘negotiate’ some €40 million worth of public tenders with private companies despite the latter not meeting the requirements specified in the original offer.\nAccording to information submitted in Parliament recently, under Prof. Scicluna’s direction, the ministry approved some 17 public tenders, mostly of a substantial value, to be awarded through a so-called “negotiated procedure”, allowed by European Union public procurement rules to be used only in extreme instances of urgency.\nEU public procurement rules dictate that a ‘negotiated procedure’ is a sort of last resort tool, available only in very specific circumstances with the approval of the Director of Contracts, since it implies that a contract may be awarded without prior publication, such as in cases of extreme urgency.\nHowever, industry sources said that it seemed the government was resorting to this exception more often in order to dish out contracts directly, instead of using the procedure only as a last resort.\n“The government is increasingly resorting the ‘negotiated procedure’ instead of issuing a new tender when none of the bidders meet the requested requirements,” the sources pointed out.\nAccording to statistics, since 2013 the Finance Ministry gave an average of two approvals a year for such procedure to be used. \nGovernment resorting to this exception more often to dish out contracts directly\nHowever, in 2018 alone, Prof. Scicluna approved the use of this procedure for seven tenders.\nHowever, eyebrows were raised even sharper last February when the minister gave the green light for the Director of Contracts to negotiate directly with bidders for a €23 million contract to build a new underpass at the Tarxien/Santa Luċija roundabout.\nThe original tender issued for this mega road project was cancelled by the Department of Contracts after it was found that the evaluation board set up by the government had mistakenly awarded the contract, even though none of the companies’ competing had satisfied all the criteria.\nHowever, the government did not issue a new offer, as is usually done in such a competitive tender and instead is using the negotiated procedure to award the lucrative contract to one of the same bidders who had failed to meet the original requirements.\nGovernment sources said that this latest approval by the Finance Minister was the largest ‘negotiated procedure’ ever approved by the government.\nThe award of this tender is still being ‘negotiated’ by the Department of Contracts and Infrastructure Malta, the government road building agency responsible for the public contract. \nApart from this procedure, the Finance Ministry is also tasked with approving direct orders given to various companies and individuals without the issue of a competitive tender.\nDespite strict rules that direct orders have to be limited in scope and value, the current administration is granting many direct orders every year.\nThis has been already highlighted in various reports issued by the National Audit Office.", "comment_count": 33, "id": 3082}, {"keywords": "", "author": "", "article_body": "PN head of delegation David Casa met with Turkish Ambassador Kerem Kiratli to discuss the case of investigative journalist Pelin Ünker and the deteriorating state of media freedom in Turkey.\nMs Ünker is facing multiple cases against her following her reports on the Paradise Papers. The charges were dropped in one case but a 13-month jail sentence still hung over her head.\n“The charges in this case must also be dropped”, Mr Casa said.\nHe presented the ambassador with a declaration signed by MEPs from across the political spectrum calling for the charges against Ms Ünker to be dropped and for Turkey to respect the European Convention of Human Rights.\n“I have brought the serious concerns of members of the European Parliament to the attention of the ambassador and I have been assured that our concerns were noted,” Mr Casa said.\nMr Casa visited Ms Ünker in Istanbul earlier in the year where he met with her legal team and representatives of organisations working to protect investigative journalists in the country. Ms Ünker also visited Malta as Mr Casa’s guest and addressed the vigil in honour of Daphne Caruana Galizia.\nMr Casa and the ambassador also discussed a number of issues on which EU-Turkey cooperation has proved vital, in particular on migration and combatting terrorism.", "comment_count": 10, "id": 3083}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 4.12pm with PN reaction below - \nThe Nationalist Party has already lost a third of local councils in Malta and Gozo, ahead of next month’s election, after failing to field enough candidates, the Labour Party said on Tuesday.\nIn a press conference, the PL this afternoon said that the PN had fielded 100 less candidates than the PL for the upcoming election in May.\nLabour has put forward 399 candidates while the PN presented 296.\nThis meant that that PN had already forfeited winning 21 of the 68 local councils across the archipelago, the PL said.\nParty president Daniel Micallef said the PN was trying to play an electoral “game”.\nRead: PN councillors pressured to pledge loyalty to Delia\n\"Not a single Sunday passes without the PN preaching about democracy. But with the first electoral appointment coming up in a few weeks, the PN is trying to play around with democracy,\" he said. \nThe PN, he added, was trying to ensure that there were no elections in certain localities.\nHad it not been for the PL fielding more than enough candidates, certain localities would have ended up without an election, he said.\n“It is clear the PN does not believe in local councils any more, if it ever did,” he said.\nDeputy leader for party affairs Chris Cardona said it was clear that the PN’s current situation was resulting in the party’s own supporters no longer having any faith in its direction or leadership.\n“There are people feeling very disillusioned within the Nationalist Party today,” he said.\nIllustrating his point, Dr Cardona, who is also Economy Minister, said two localities in Gozo (Għarb and Żebbuġ) had PN mayors who were this year running as independent candidates rather than on a blue ticket.\nIn 13 localities across the archipelago, the PN was only running the same number of current councillors, failing to put forward a single more. The PL on the other hand had increased its number of candidates by some 26.\n\n\n\n“This is turning the election into a child’s game,” he said.\nDeputy Prime Minister Chris Fearne concluded the press conference, saying the PN wanted voters to stay at home come election day.\nThis was not in the interest of the nationalist party, nor was it in the interest of democracy, the electorate, or the country, he said. \nThere have been instances in the past where elections were not held in certain localities because not enough candidates, or the exact number of candidates needed, submitted their nomination.\nPN reacts - Labour has also not fielded enough candidates in some localities\nIn a reaction, the Nationalist Party observed that the Labour Party had fielded an insufficient number of candidates for the elections in some localities, and it was only thanks to the PN candidatures that there were enough candidates for elections to be be held.\nThe PN said the PL could not preach about democracy in local government when it had cancelled elections for 16 administrative committees for outlying areas  - (Fleur-de-Lys in Birkirkara, Santa Luċija in Kerċem, Gwardamanġa in Pietà, Paceville in St Julian's,  Kappara in San Ġwann, Madliena in Swieqi, Marsalforn in Żebbuġ, Bubaqra in Żurrieq,  Xlendi in Munxar, Tal-Virtù in Rabat, Ħal Farruġ in Luqa, St Peter's in Żabbar, Swatar in Birkirkara and Msida, Burmarrad in St Paul's Bay, Baħrija in Rabat and Baħar iċ-Ċagħaq in Naxxar.\nLocal council elections were also cancelled by the government two years ago.\nThe PN also pointed out that while 197 local councillors were elected on its ticket in the last elections, the number of its candidates was now almost 100 more.  \n ", "comment_count": 56, "id": 3084}, {"keywords": "", "author": "", "article_body": "Tourism Minister Konrad Mizzi’s rights would be breached by a corruption inquiry requested by former Opposition leader Simon Busuttil and NGO Repubblika, his lawyer John Bonello told a Constitutional Court on Tuesday.\nDr Mizzi has demanded that no decision on whether an inquiry is needed should be taken until his human rights breach claim has been heard.\nLawyer and Nationalist Party MP Jason Azzopardi told the court that Dr Mizzi did not want to be investigated for corruption despite claiming he was innocent.\nThe Tourism Minister was not present for his human rights breach case.\nDr Azzopardi told the court the request inquiry would not impinge on the minister’s rights. The inquiry was being requested because his clients were arguing that Dr Mizzi is “corrupt and taking bribes”, Dr Azzopardi said.\nThe PN MP argued that Repubblika should be allowed to intervene in Dr Mizzi’s human rights breach case, as it was allowed to do in a similar case last December.\nThis request was upheld by the court.\nRead: Simon Busuttil embarks on new Panama Papers battle\nDr Mizzi’s lawyers gave notice of appeal against the decision.\nMr Justice Joseph Zammit Mckeon told the minister’s lawyers that they had to decide whether their client’s Constitutional case was urgent, or whether they wanted to appeal the decision.\nThis is the second time Dr Mizzi has claimed a Panama Papers inquiry would breach his right to a fair hearing.\nRepubblika has slammed the “outrageous” use of State institutions to run away from the law.\n“Human rights laws exist to protect citizens from their government. Konrad Mizzi thinks they exist to protect the government from citizens”, Repubblika said last week.", "comment_count": 0, "id": 3085}, {"keywords": "", "author": "", "article_body": "Updated 3.20pm \nMalta could have made a surplus of €500 million last year but had instead decided to invest in capital projects, Prime Minister Joseph Muscat said on Tuesday. \nSpeaking at a press conference, Dr Muscat said that the government surplus made it possible for the government to increase pensions, offer tax refunds and re-pave roads. \nDr Muscat was speaking following the release of finance data which showed that the general government made a surplus of €250.8 million in 2018, a considerable shift from the €70.2 million deficit registered in the so-called government’s ‘consolidated fund’.\nSurplus data was calculated on an accruals basis, rather than cash, and took into account various ‘extra-budgetary units’ (EBU), the National Statistics Office explained, with the most significant of those coming from the citizenship scheme. Source: NSO\nMost of the surplus came from the EBUs, which reached €176.8 million, €21.1 million less than a year earlier.\nAlthough the NSO did now break down how much each EBU - which range from the national orchestra to Heritage Malta - had contributed to national accounts, it did specify that the National Development and Social Fund was responsible for €133.7 million.\nThe fund gets 70 per cent of Individual Investor Programme funds, which allows wealthy foreign investors to buy Maltese citizenship. \nThis means that even without those funds, the surplus would have been over €117 million.\nThere are other contributors to the gap between the consolidated fund’s deficit and the surplus registered by the general government, made up of €208 million from various categories, with €62.5 million subtracted due to Air Malta payments for its assets.\n\nThe Maastricht Treaty reporting for 2017 had shown a surplus of €387.2 million in 2017, and of €90.9 million in 2016.\nTaken as a percentage of GDP, this represented a positive two per cent, well above the deficit-to-GDP ratio of three per cent – a crucial threshold which EU member states must remain above if they are to comply with their treaty obligations.\nAlthough the government's yearly accounts were in surplus, Malta continues to have overall debt of €5.7 billion - €17.8 million less than in 2017.\nIncreases in GDP mean that this debt forms a smaller share of Malta's GDP, with the ratio going down from 50.2 per cent in 2017 to 46 per cent last year.\n'Strong finances' - Muscat\nIn his press conference, the Prime Minister highlighted how the government had inherited a three per cent deficit in 2013 and turned it into a two per cent surplus.\nDebt had also fallen from a high of 70 per cent under the Nationalist government to 46 per cent, he said. \nThe Prime Minister said Malta’s strong economy and finances meant it had to borrow less and was paying less interest on that borrowing.\nDr Muscat also noted that a surplus would still have been registered without the funds generated from the passport sale scheme.\n\n ", "comment_count": 45, "id": 3086}, {"keywords": "", "author": "", "article_body": "European Parliament election candidates are being quizzed on their green credentials in a questionnaire drafted by conservationists.\nNGO Birdlife on Tuesday said it had drafted a set of questions concerning five priority issues which it wants political parties and their MEP candidates to consider, promote and endorse.\nThe manifesto has was sent to all of Malta’s European Parliament candidates this morning and the NGO is requesting their responses to each of the 10 questions in the document.  \nFrom climate change to ODZ development, from the transport challenges to clean air, hunting and trapping derogations and the need of better enforcement, from biodiversity loss to unsustainable fisheries and bycatch, the document touches upon a number of the NGO’s concerns.\n“We feel it is our responsibility to put the natural environment on the agenda and their obligation to relate, think and reply on their position,” the NGO said.\nBirdlife will be organising a morning debate featuring MEP candidates on Friday May 3 at the Salina Nature Reserve’s Visitor Centre between 8am and 10am.\nA number of candidates from each party have accepted the organisation’s invitation to attend and respond to questions related to the environment.\nThe Labour Party will be represented by MEP candidates Robert Micallef and Alfred Sant, the Nationalist Party will be represented by Peter Agius and Frank Psaila, Alternattiva Demokratika will be represented by Carmel Cacopardo and Partit Demokratiku will be represented by Anthony Buttigieg.\nThe event is open to all and participation is free, however one needs to register here.", "comment_count": 4, "id": 3087}, {"keywords": "", "author": "", "article_body": "A six-year-old boy was grievously injured in a fall on Monday.\nThe police said the accident happened in Triq Ħaddara, Żejtun, at 7.35pm.\nThe boy, the police said, most likely fell from the stairs of a residence. He was taken to Mater Dei Hospital by ambulance.\nAn inquiry is being held and the police are investigating.", "comment_count": 0, "id": 3088}, {"keywords": "", "author": "Ivan Martin", "article_body": "Just before sunrise, in an open field in rural Qormi, around 200 people would gather to bet on which dog could tear the other up, according to a former dog fighter who shed light on the dark world of illegal fight betting. Speaking on condition of anonymity, the former fighter detailed how dog owners would parade their “champions” around the horse racing track in Marsa, trying to attract challengers for a showdown on Sunday morning. “In my day it was about the challenge, it was pika (pique) and the fights were mostly about the skill of the dog. I’m not saying it was right, and today there is a lot more awareness about animal rights, but my guess is that the fights today are much more violent,” he told Times of Malta. Police sources on Monday indicated that the fights being investigated today were probably using breeds such as the pit bull, favoured by trainers for its obedience and willingness to continue fighting through extreme pain and exhaustion – something Maltese dog fighters call “zeal”.The spectre of illegal dog fighting was raised in Parliament last Tuesday by Opposition MP Mario Galea who said he had been shocked to learn the heinous form of animal cruelty had made an unwelcome comeback in recent months.The matter is now being investigated by the police and animal welfare officials. Sources in both entities encouraged the public to come forward with any information they may have on the practice.\nAn increasingly violent 'sport'\nMeanwhile the former dog fighter told Times of Malta that several years ago he had been convinced to get involved in the fights by friends who attended dog fights for fun. The black market ‘sport’ would then see owners agree on an impartial referee, and meet in a field in rural Ħandaq in the outskirts of Qormi – the same neighbourhood believed to be hosting the illegal fights today.In his day, the former dog fighter recounted, the breed of choice was a boxer mix – his had been a boxer mixed with a Maltese hunting dog (tal-kaċċa). The ‘sport’, he said, had resembled a form of wrestling, with dogs winning a fight if they asserted their dominance by climbing on top of their opponent for at least a minute unchallenged.“It would attract quite a crowd. Some would bet – sometimes for big money – others would just do it for the prestige of winning, or because of pique,” he said, adding that he had once competed for a cup that dog owners had pitched in for. And, while attendance at these fights – held at around sunrise mainly on Sundays – was believed to have dwindled, they were also believed to have become increasingly violent.\nRewarding violence\nSources in the Veterinary Department said that dogs used for fights were typically raised in isolation, spending most of their lives on short, heavy chains and conditioned for fighting through the use of repeated violence and rewarding of extreme behaviour. Dogs made to participate in fights would likely have their ears cropped and tails docked close to their bodies to minimise the animal’s normal body language cues and to limit areas that another dog can grab during a fight. Since it was illegal to make these bodily alterations to pets, fighting dog owners would keep their animals locked away from prying eyes, sources said. Meanwhile, the former dog fighter told Times of Malta that fights could take anything from a few seconds, to as long as half an hour, with animals often sustaining serious injuries. He recalled how, prior to fights, opponents would wash their rival’s dog clean, to ensure that the animal had not been rubbed down with liquids that deterred other dogs from attacking. This had been introduced to discourage cheating dog owners who, among other things, would rub down their dogs with bitter rabbit gallbladders.", "comment_count": 39, "id": 3089}, {"keywords": "", "author": "", "article_body": "These are the main stories in Tuesday’s newspapers.\nTimes of Malta says legal experts have voiced fears that gender quota proposals aimed at increasing female participation in Parliament are nothing but a “smokescreen” to introduce political party funding by the State by stealth. In another story, the newspaper says dogs inclined to seriously maim or even kill each other are likely being used in an illegal dog fighting ring that is being investigated by the authorities.\nThe Malta Independent says the countdown for the European Parliament and local elections has begun.\nL-Orizzont says work has started on a new health centre in Paola.\nIn-Nazzjon leads with the Nationalist Party’s launch of the electoral campaign for the May 25 elections.", "comment_count": 1, "id": 3090}, {"keywords": "", "author": "", "article_body": "A total of 41 candidates have submitted their nomination for the European Parliament elections in May.\nThe Electoral Commission said on Tuesday two candidates each were submitted by Alleanza Bidla, Alternattiva Demokratika and Moviment Patrijotti Maltin, one each by Brain not Ego and Imperium Europa, five were independent, four from the Partit Demokratiku, 14 by the Labour Party and 10 by the Nationalist Party.\nSix MEPs have to be elected.\nThe whole list of candidates follows.\n\n\n\n\nCandidate Name\n\n\nCandidate Surname\n\n\nCandidate Party\n\n\n\n\nRebecca\n\n\nDalli Gonzi\n\n\nAlleanza Bidla\n\n\n\n\nIvan\n\n\nGrech Mintoff\n\n\nAlleanza Bidla\n\n\n\n\nCarmel\n\n\nCacopardo\n\n\nAlternattiva Demokratika\n\n\n\n\nRomina\n\n\nTolu\n\n\nAlternattiva Demokratika\n\n\n\n\nAntoine Paul\n\n\nBorg\n\n\nBrain Not Ego\n\n\n\n\nNorman\n\n\nLowell\n\n\nImperium Europa\n\n\n\n\nJoseph\n\n\nAquilina\n\n\nIndependent Candidate\n\n\n\n\nNazareno\n\n\nBonnici\n\n\nIndependent Candidate\n\n\n\n\nMario\n\n\nBorg\n\n\nIndependent Candidate\n\n\n\n\nArnold\n\n\nCassola\n\n\nIndependent Candidate\n\n\n\n\nStephen\n\n\nFlorian\n\n\nIndependent Candidate\n\n\n\n\nSimon\n\n\nBorg\n\n\nMoviment Patrijotti Maltin\n\n\n\n\nNaged\n\n\nMegally\n\n\nMoviment Patrijotti Maltin\n\n\n\n\nCamilla\n\n\nAppelgren\n\n\nPartit Demokratiku\n\n\n\n\nAnthony Emanuel\n\n\nButtigieg\n\n\nPartit Demokratiku\n\n\n\n\nMartin\n\n\nCauchi Inglott\n\n\nPartit Demokratiku\n\n\n\n\nGodfrey\n\n\nFarrugia\n\n\nPartit Demokratiku\n\n\n\n\nAlexander Matthew\n\n\nAgius Saliba\n\n\nPartit Laburista\n\n\n\n\nJosef\n\n\nCaruana\n\n\nPartit Laburista\n\n\n\n\nNoel\n\n\nCassar\n\n\nPartit Laburista\n\n\n\n\nJosianne\n\n\nCutajar\n\n\nPartit Laburista\n\n\n\n\nMiriam\n\n\nDalli\n\n\nPartit Laburista\n\n\n\n\nCyrus\n\n\nEngerer\n\n\nPartit Laburista\n\n\n\n\nFelix\n\n\nGalea Busuttil\n\n\nPartit Laburista\n\n\n\n\nMary\n\n\nGauci\n\n\nPartit Laburista\n\n\n\n\nJames\n\n\nGrech\n\n\nPartit Laburista\n\n\n\n\nRobert\n\n\nMicallef\n\n\nPartit Laburista\n\n\n\n\nJoseph Mario\n\n\nSammut\n\n\nPartit Laburista\n\n\n\n\nAlfred\n\n\nSant\n\n\nPartit Laburista\n\n\n\n\nLorna\n\n\nVassallo\n\n\nPartit Laburista\n\n\n\n\nFleur Anne\n\n\nVella\n\n\nPartit Laburista\n\n\n\n\nPeter\n\n\nAgius\n\n\nPartit Nazzjonalista\n\n\n\n\nRoselyn\n\n\nBorg\n\n\nPartit Nazzjonalista\n\n\n\n\nSpiridione\n\n\nBorg\n\n\nPartit Nazzjonalista\n\n\n\n\nMichael\n\n\nBriguglio\n\n\nPartit Nazzjonalista\n\n\n\n\nDavid\n\n\nCasa\n\n\nPartit Nazzjonalista\n\n\n\n\nMichael\n\n\nMercieca\n\n\nPartit Nazzjonalista\n\n\n\n\nRoberta\n\n\nMetsola\n\n\nPartit Nazzjonalista\n\n\n\n\nFrank\n\n\nPsaila\n\n\nPartit Nazzjonalista\n\n\n\n\nDavid\n\n\nStellini\n\n\nPartit Nazzjonalista\n\n\n\n\nFrancis\n\n\nZammit Dimech\n\n\nPartit Nazzjonalista", "comment_count": 34, "id": 3091}, {"keywords": "", "author": "Ivan Martin", "article_body": "A man arrested for working with a Mafia organisation is believed to form part of a gaming crackdown that saw €1 billion in illegal proceeds seized last year.  \nThe suspect was arrested by the police on Sunday under a European Arrest Warrant after days of surveillance.\nThe police said in a statement the arrest had followed an operation named ‘Op Rich’, which was carried out between members of the Intelligence and Counter Terrorism Unit.\nThe Italian, who lives in Swieqi, was well-known in online betting circles in Malta and is expected to be arraigned in court today for the extradition procedure to be embarked upon.\nHe is wanted by the Italian authorities for association with the organisation, management and collection of illegal betting on behalf of a Mafia organisation.\nSources yesterday indicated that the man had featured in an investigation into online betting fraud which led to the arrest of 68 people last November. \n80 search operations reportedly carried out in various cities across Italy\nThe investigation, which saw the cooperation of Maltese authorities, was led by the prosecutors of Bari, Reggio Calabria and Catania, and coordinated by the Italian National Anti-Mafia and Counter-Terrorism Directorate.\nThe volume of sports bettings and other bets, discovered by the Italian Guardia di Finanza and the police, is worth over €4.5 billion, according to Italian media reports.\nAround 80 search operations were reportedly being carried out in various cities across Italy in connection with the case.\nItalian investigators said the criminal groups were using Mafia methods to infiltrate the online betting market to launder funds deriving from drug trafficking and other criminal activities.\nOnce laundered, the funds were then reinvested in estate assets and financial positions abroad, in the name of foundations and a complex web of shell companies.\nItalian media reports say the Bari investigation focused on a Puglia crime syndicate headed by infamous Mafia boss Vito Martiradonna, 70.\nSources involved in the Maltese side of the investigation told the Times of Malta that the investigation was the biggest that the Malta Gaming Authority had ever been involved in.", "comment_count": 45, "id": 3092}, {"keywords": "", "author": "", "article_body": "Charles Polidano.\nThe Democratic Party said on Monday that its Qrendi local council candidate, Charles Polidano, was physically attacked outside his home.\nThe party did not say if he was injured but said a police report has been filed.\nThe assault happened just outside his home in front of a friend and fellow resident.\nThe incident, it said, \"shows that the tyranny of intolerance is becoming bolder.\"\n\"The attacker left no ambiguity that it was a politically motivated attack arising from Polidano's candidacy for the local council election on the PD ticket,\" it added.\n\"This is yet another textbook example of the tragedy which grips our democracy, where it becomes clear how many people prefer not to voice their political opinions out of fear of physical, social and professional consequences. Instances like these continue to demonstrate how all who oppose the government are crushed under the boots of its partisan followers, who evidently fear no retribution for their bad behaviour,\" deputy leader Timothy Alden said.\nHe insisted the party and its candidates will not be intimidated. \nQuestioned after the statement was issued Mr Alden said Mr Polidano had back pain and would be going to a health centre.", "comment_count": 36, "id": 3093}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Matthew Xuereb interviews the president of the Chamber of Advocates, Louis Degabriele, who took over late last year.\nLawyers and their clients both stand to benefit from a new law regulating the legal profession, which is expected to be presented in Parliament before October, according to the Chamber of Advocates.\nChamber president Louis Degabriele said that following an 11-year baking period, the law was now ready and was being given its final touches by the Attorney General. He said Justice Minister Owen Bonnici had given him his word that the new bill would be tabled in Parliament before the beginning of the new forensic year.\nDr Degabriele, who has been a practising lawyer for more than three decades, said the profession was never regulated, except for a few provisions in the Code of Police Laws, which gave rise to complaints and diminished standards.\n“Nowadays there are more than 1,500 lawyers. In a completely changed socio-economic environment, we need to regulate the profession, with all the pressures and the temptations that lawyers face [so we need something] to maintain standards and ensure that those who do not maintain those standards are weeded out,” he said.\nHe explained that through the new law, the Chamber of Advocates will become the regulator of the profession on a day–to-day basis while the chamber will be regulated by the Commission for the Administration of Justice. The chamber will have the power to exercise discipline within the profession and monitor practicing lawyers in the daily practice of the profession.\nHe said this two-tier system will benefit not only lawyers but also clients, who can have peace of mind about the service they are to expect from their lawyers.\n“These are basic rules to ensure that the lawyers of tomorrow are better than us. We need to ensure that standards are not only maintained but we need to take these standards to a higher level,” he said.\n“No lawyer can accept that standard of ‘anything goes’. It is a mentality that, as profession, we definitely cannot afford. We need to make sure that people in this profession, particularly the younger generations, understand this. The law is not going to teach you how to be prepared but it can give you the discipline to ensure that certain standards of integrity, independence and impartiality of thought are maintained,” he added.\nHe stressed that lawyers should be able to tell their clients things that they do not want to hear because they are not always right.\nAsked about the Committee for Advocates and Legal Procurators, Dr Degabriele said this will now become the Advocates’ Disciplinary Tribunal and will deal with complaints which do not involve the removal or suspension of a warrant, which would then be referred to the Commission for the Administration of Justice.\n“The committee was inundated with frivolous claims. Many cases which end up before this committee are complaints that their lawyer lost their case. There is also a three-month prescription period to observe. This division in disciplinary proceedings will make the committee work more efficiently by only dealing with cases which are substantiated,” he said.\nNo lawyer can accept the standard of ‘anything goes’. It is a mentality that, as profession, we definitely cannot afford\nDr Degabriele said that a good number of complaints were about overcharging and most of them were not justified as the fees were set.\nThe maximum fine at law is pegged to one-tenth of the Attorney General’s salary but at a time when lawyers are overseeing transactions involving millions of euros, he said this should increase.\nAsked whether the committee for the appointment of the judiciary was simply acting as a rubberstamp, Dr Degabriele disagreed.\n“It has a function and I honestly believe that the process can be improved. In fact, the committee is discussing this internally, with the intention to proceed with a system where the committee has more autonomy,” he said.\nAccording to the lawyers’ chief, the committee ought to have a wider base, and more sitting judges should participate in the process. The Chief Justice, the Auditor General, the Ombudsman, the Attorney General and the president of the Chamber of Advocates currently sit on the committee.\nWhile the committee at present only gives a recommendation, it should be able to give the State the name of a person who ought to be made a judge or magistrate, he said.\nTurning to the legal aid system, Dr Degabriele admitted that this needed “a complete rehash”, starting with a change to the means testing for eligibility.\nThe register is currently voluntary but Dr Degabriele believes that one of the options could be having a pool employed by the State or the court administration.   But in the meantime, he insisted that lawyers were duty-bound to offer the best possible service. \nRegarding the duration of cases in court, Dr Degabriele said the average length of a case in the First Hall was down to two to three years from eight years. One of the bottlenecks, he said, was at appeals stage where it takes four to five years for a case to be appointed.\n“There is nothing which says that the judicial system is perfect but it is the best we have in a state of imperfection,” he said.\nHe suggested that appeals should be decided by judges based on written submissions rather than entire sittings, except if clarifications are needed.\nHe also criticised the way cases are heard in court, with judges expecting lawyers to be in two places at the same time.\n“If the court were to have an appointment system and everyone is connected to the same database, lawyers cannot be given cases at the same time. In 2019, this is not artificial intelligence but a very simple calendar system which would give you a conflict if there’s an overlap. I think this will benefit everyone. It will not remove delays altogether but if would go a long way,” he said.\nHe also suggested the introduction of the concept of discovery where the parties are bound to disclose the evidence that they have in their case. Anything that is not disclosed cannot be used in court and this enables lawyers to better guide their clients.\nAsked about reforms to the Constitution, Dr Degabriele said the chamber had already expressed its willingness to be involved.\n“We can contribute as an objective professional body. We are willing to contribute and it is also important that as a representative body of the legal profession, we should be consulted.”", "comment_count": 3, "id": 3094}, {"keywords": "", "author": "", "article_body": "A local cleaning company has enraged social media users through its 'Rent a Wife' name.\nThe company posted an advert offering cleaning services to a local Facebook group, in the hope of drumming up some additional business.\n“Here at Rent a wife we become like one,” the business, which appears to have offices in Mellieħa, wrote in its ad.\nIts pitch immediately backfired, however, with people unimpressed by its promise that “not only woman [sic] but also men do the work”.\n“The name you chose for your company will make sure a lot of people, myself included will never hire your services,” wrote one.\n“Very sexist,” fumed another.\nThe post that outraged users.\nA woman who claimed to be part of the company quickly stepped in and urged people not to be offended by its name.\n“We do not only provide cleaning services but everything a wife can do and that is cleaning cooking doing errands babysitting errands such as paying you're bills ironing,” she wrote.\nThat reassurance just made things worse.\n“Not only cleaning but everything a wife can do? I guess that makes it all better then,” one wrote sarcastically.\n“Very strange,” added another. “I never knew men were incompetent to clean or care for children”.\nTimes of Malta sought a comment from the company but was unable to make contact.\nShortly afterwards, the company’s Facebook page was taken offline. ", "comment_count": 106, "id": 3095}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Increased traffic resulting from the proposed Gozo-Malta tunnel will boost calls for wider roads, eating away at green or arable land, Wirt Għawdex said.\nWirt Għawdex is an NGO whose aims are 'to foster the knowledge of and safeguard the natural, archaeological, historical and anthropological patrimony of the islands of Gozo and Comino'.\nIt said the projected building boom caused by the tunnel will see further loss of untouched land, more fuel stations and increased pressure by developers on land outside development zones.\nParliament last week gave its unanimous support to the construction of a permanent link between Malta and Gozo in what Infrastructure Minister Ian Borg described as a “historic moment” from which there was no turning back.\nWirt Għawdex said it was voicing its “major concerns” following a public debate and consultation with its members.\nIts committee said it was sympathetic to the connectivity issues faced by Gozitans: “We are, after all, Gozitans ourselves, constantly facing the hardships and tribulations of travelling to Malta for work, education and travel purposes and also because of other commitments.”\nIt called for consideration of short-term solutions like a fourth ferry, more frequent ferry journeys and a fast ferry service as well as long-term options such as a mass transit system.\nIt is our duty as Gozitans to, first and foremost, make sure such solutions do not result in the loss of Gozo’s unique character and way of life as we know and love it- Wirt Għawdex\n“But it is our duty as Gozitans to, first and foremost, make sure such solutions do not result in the loss of Gozo’s unique character and way of life as we know and love it,” it commented.\nThe NGO, which would like to see all the studies for the proposed tunnel being finalised and offered for public discussion, flagged the negative impact of the project on the natural and built environment as well as on the cultural and social heritage of Gozo.\nDuring the construction phase, the digging, removal and relocation of debris would pose considerable risk to the natural environment of the island and its surrounding waters. After completion, the likely rise in traffic congestion would result in increased air pollution, apart from a demand for the widening of roads, Wirt Għawdex said.\nThe subsequent need to update the road infrastructure to cater for increased congestion would lead to the altering of traditional streetscapes, it warned.\nIncreased property demands would also change Gozo’s traditional townscapes by encouraging the destruction or alteration of traditional buildings, a relaxation of height limitations and an extension of development zones. This would, therefore, challenge what had, so far, seen the intact separation of Gozitan villages, the NGO added.\nGozo’s insularity resulted in a unique culture and way of life that undeniably differed in various respects from that of its sister island, Wirt Għawdex commented. \nIt admitted it was worried that the sudden and uncontrolled influx of mainland influences would put pressure on, and subsequently change, Gozo’s cherished cultural and social norms and traditions.", "comment_count": 52, "id": 3096}, {"keywords": "", "author": "", "article_body": "Updated April 23 10.20am\nConcrete barriers have been installed on Tal-Balal Road as part of the reconstruction project of this thoroughfare in a bid to improve safety, Infrastructure Malta announced.\nThe same system is also being adopted to safely separate the two new three-lane carriageways of part of Triq Reġjonali.\nThe measures come amid a public debate on the level of safety on Maltese roads following a spate of serious, including fatal, accidents.\nIn a statement, Infrastructure Malta said the CE-certified concrete barriers could contain the impact of a 13-tonne bus travelling at speeds of up to 70km/h. \nTheir lack of sharp edges made them safer for motorcyclists, and studies had shown that such barriers \"reduce the likelihood of severe injuries to helmeted riders involved in motorcycle-barrier collisions,\" the agency said. \nThe barriers are being cast at a local plant which has been audited by international certification body TÜV to ensure European safety standards are respected, Infrastructure Malta added.  \nThe barriers are being manufactured locally under licence.", "comment_count": 25, "id": 3097}, {"keywords": "", "author": "", "article_body": "A French tourist was injured on Monday afternoon when she lost control of his quad bike in Għajnsielem Gozo.\nThe police said the incident happened at 3pm in Borg Għarib Street when the 44-year-old crashed into a boundary wall.\nThe victim suffered grievous injuries.\n ", "comment_count": 7, "id": 3098}, {"keywords": "", "author": "", "article_body": "The police have issued a request for information about 34-year-old Clive Agius, who is wanted by court order.\nThe man lives in Floriana.\nAnyone knowing his whereabouts has been asked to phone, even anonymously, on  21 224001 or 119.\nMr Agius found himself back in the dock last year answering to charges of aggravated possession of cocaine and heroin, as well as with having breached bail conditions.\n ", "comment_count": 0, "id": 3099}, {"keywords": "", "author": "", "article_body": "Quick-acting police arrested two people seen carrying a weapon in Qawra on Monday afternoon.\nThe ‘weapon’ turned out to be a fake.\nThe incident happened at 3.45pm in Triq it-Tamal.\nNeighbours said they had seen several police cars converging on the area and surrounding a car.\nNo further information was immediately available.", "comment_count": 5, "id": 3100}, {"keywords": "", "author": "", "article_body": "Updated at 5.24pm \nThe Nationalist Party’s campaign for next month’s European elections began with a stutter on Monday, with some of the party’s grassroots unimpressed by the party’s “negative” messaging and Labour pouncing on a spelling mistake on one of its billboards. Plenty of internal criticism for the PN's billboard strategy.\nThe party’s first set of billboards, which appeared on Sunday night, took swipes at the government for rising cost of living, meagre pensions and corruption allegations.\nOn Monday, discussion within internal PN chat groups was not entirely complimentary.\n“Embarrassing… we’ve ended up with no ideas,” wrote one follower. \"So much for Simon [Busuttil] being negative and us changing tune,\" wrote another. \"We've remained the same\".The critical comments, seen by Times of Malta, forced secretary general Clyde Puli to defend the party’s strategy.\n“Labour used to discuss the oil scandal, Arriva etc.,” he wrote. “And they won”.\n“Their supporters did not call them negative,” Mr Puli told PN voters who were unhappy with the party’s first set of electoral billboards. “We will criticise. Because we are the Opposition and that is part of our job… the Labour government is corrupt and nothing should stop us from fighting this fight.”\nHis battle cry did not win over all internal sceptics, though.\n“We’re not going to win over people if we keep ‘moaning’,” one replied. “The criticism is factual, but young people do not want to hear negativity….why why why? I miss our old PN”.\nBillboard battle\nWhile Mr Puli was weathering internal criticism, the party’s Labour rivals were hard at work belittling the party for a spelling mistake on one of its billboards.\nThe PN was forced to replace billboards highlighting the rising cost of living within hours of putting them up, after discovering that they had misspelled “togħla” [is rising].\nThe PN spelling mistake.\nWithin hours, a billboard mocking that oversight appeared in Santa Venera.\n“Together for against our country,” the billboard read, with a note in scrawled script above.\n“Sorry… we found another mistake,” it read.\nThe Labour Party has repeatedly accused the PN opposition of going out of its way to damage Malta's reputation overseas. \nA Sunday Times of Malta survey published earlier this month indicated that Labour enjoys a massive lead over the PN in the run-up to the May elections, with 59 per cent of voters saying they will vote PL, compared to just 37 per cent for PN.\nThe billboard typo recalled a similarly embarrassing typo back in 2016, when authorities had put up a billboard welcoming heads of 'goverment' [sic] ahead of Malta's EU Council presidency. \nLabour wasted no time in responding.\nTit-for-tat\nAs the billboard battle heated up on social media, Nationalist voters used their photo editing skills to hit back at their Labour rivals.\n\"We made a mistake,\" photo-edited versions of a PL billboard read, with the messages followed by a variety of punch lines, among them \"Air Malta did not make a profit\" or \"Partnership won\". ", "comment_count": 102, "id": 3101}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The environment authority has taken issue with plans for another fuel station outside the development zone as the long-awaited review of the controversial policy governing such projects continues.\nThe Planning Authority is considering an application to “relocate” an existing fuel station from Ta’ Xbiex to a site of about 3,000 square metres of agricultural land off Mdina Road, Żebbuġ. \nThe facility would include a workshop, a retail shop, offices and a car wash.\nIn its response to a screening request, the Environment and Resources Authority said the proposal was “premature” while the fuel stations policy was still under review and that the application should wait until the updated policy came into force.\nThe policy review was announced in January 2018 but has yet to be concluded. Following a protest by environmental activists over the prolonged delays, Infrastructure Minister Ian Borg said the revised policy would be published by the end of this month.\nProposals by the ERA for the policy review would rule out relocations to ODZ land but the government has indicated this could remain permissible under the new policy.\nIn its comments on the Żebbuġ application, the environment watchdog restated its overriding objection that there was “no valid justification for the further loss of undeveloped rural land and associated environmental impacts to accommodate even further development of petrol stations”.\nNo valid justification for further loss of rural land\nIt had previously warned that the project would result in “further deterioration” of the area’s landscape by taking up undeveloped rural land for commercial uses.\nThe regulator also expressed concern over the cumulative environmental impact of the large number of petrol stations being proposed on ODZ land and said that case-by-case environmental studies left the broader concern unresolved.\nA project description statement submitted by the developers states that the fuel station would provide a service to “transient traffic as well as the local traffic generated by the surrounding business activities and industrial area” as well as allow access to essential auto-motive-related sales.\nIn the planning document, the developers say a number of measures will be taken to mitigate noise pollution and visual impact as well as to protect the quality of water and air on site and in the surrounding areas.\nThe site is designated for agricultural use under the Attard local plan and is adjacent to land listed as an area of scientific importance due to an existing watercourse of hydrological significance.", "comment_count": 7, "id": 3102}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Russian government has shot down reports suggesting it could try and interfere in next month’s local elections as “absurd”.\nIn a statement, Russian Foreign Ministry spokeswoman Maria Zakharova reacted to reports that Malta had turned down a Russian request to use its airspace to fly military aircraft to Venezuela.\nMalta’s decision comes shortly after the island had last month approved a similar request, with Russian military planes and personnel eventually spotted in the Venezuelan capital of Caracas.\nRead:Malta turns down Russian request to use airspace - sources\n\"]\nThe question about Malta begins at 1.39.50 in the above video. \nLast month The New York Times reported how a visit to Venezuela by two Russian military planes had “set off alarms” that the pro-Venezuela Russian government was stepping up its support of embattled Venezuelan President Nicolás Maduro.\nThe international media reports have also quoted unnamed sources suggesting that the Russian embassy in Malta did not take kindly to the rejections, raising concerns of possible retaliation.\nThis, the reports said, could result in some for of interference, possibly in the form of a misinformation campaign, in the upcoming MEP and local councils election.\n“These reports distort the interpretation of the Russian request and the response of the Maltese authorities to it. This also implies conjectures that Russia can respond by launching a campaign to discredit the country’s leadership during or after the May 2019 elections to the European Parliament. This news is absurd. Unfortunately, this is not the first time that Malta voices such ridiculous and absolutely groundless accusations with regard to Russia. This is called fake news in modern language,” the spokeswoman said.\nOne of two Russian military planes that arrived in Venezuela last month. AFP\nMaltese media criticised\nShe added that the Russian government believed the media reports tarnished the publications’ reputation.\n“This is a blow to their professionalism, independence, objectivity and honesty during the fulfillment of their official duty,” she said.\nThe statement also acknowledged that Malta had exercised its sovereign right but went on to say: “The solution of Malta government is not friendly… of course Russia will take this into account in its bilateral relations with Valletta.”\nMeanwhile, the US State Department gave the Maltese government the thumbs up for refusing the Russian government's request.\n\n\n\n“We applaud the government of Malta for refusing to allow Russian planes to use its airspace to supply the brutal former regime in Venezuela. We call on all countries to follow Malta’s example to stop the Kremlin’s support for the dictator Maduro,” tweeted State Department spokesperson Morgan Ortangus.", "comment_count": 20, "id": 3103}, {"keywords": "", "author": "", "article_body": "Voters registered in Gozo who wish to collect their voting documents from Malta and, vice-versa, voters registered in Malta wishing to collect their documents from Gozo, must submit their written request as soon as possible, the Electoral Commission said on Monday. The commission urged applicants not to leave the request until the final day (May 23) in case the weather conditions preclude the transportation of documents within the legal time limit.Requests should be made personally via email at maltagozo.electoral@gov.mt or by application form, which form can be sent attached through an email. The forms are available at https://electoral.gov.mt/Elections/ApplicationFormsEN.Voting documents in Malta are to collected from the vote counting complex in Naxxar, while in Gozo, they are to be collected from the ID Cards Office in Victoria.\nDates for collection will be between May 20 and 23, and the voter must be personally present to show his/her identity or residence card.\nAbroad on polling day?\nThe commission also informed voters who intend to vote one week before polling day, owing to their being abroad or hospitalised, that they may personally call at the Office of the Electoral Commission, Counting Hall Complex, Naxxar, or at 28A, St Francis Square, Victoria, Gozo. The available hours are:Monday to Friday: 8am till 1.30pm and from 3pm until 7pm; Saturdays and Sundays: 8am till noon.\nAll persons are advised that the legal deadline to effect such applications by affidavit is by noon of Friday May, 17.Applicants must take their ID or Residence Card.Voters registered in Malta will cast their vote at the complex at Naxxar while those registered in Gozo shall vote at the Government Experimental Farm, Mġarr Road, Xewkija.", "comment_count": 5, "id": 3104}, {"keywords": "", "author": "Jacob Borg", "article_body": "Works on a €40 million healthcare hub in Paola are under way after the original tender was withdrawn in September following a decision by the appeals court.\nSpeaking during a visit to the site on Monday, Health Minister Chris Fearne said the government was placing emphasis on primary healthcare in the community.\nBuilding the hub will cost €25 million, with the total investment to get the hospital up and running reaching €40 million. Of these, €33 million will come from EU funds. \nMr Fearne said the regional health centre would offer various services, including dentistry and mental healthcare. \nThe centre is expected to be completed in three-and-a-half years’ time, and authorities expect it to soak up some of the pressure placed on Mater Dei Hospital. \nIt will be named after the late Vincent Moran, a former health minister who passed away last November.\nAn adjacent carpark is being built to lessen the impact on residents, he said.\nThe Health Minister said the government would be publishing a 10-year mental health strategy. Part of this strategy would strongly emphasise the importance of community care, he added. ", "comment_count": 9, "id": 3105}, {"keywords": "", "author": "Jacob Borg", "article_body": "Former Opposition leader Simon Busuttil has accused Tourism Minister Konrad Mizzi of using all possible legal manoeuvres to block an inquiry into the Panama Papers.\nDr Mizzi last week filed a Constitutional application arguing that his right to a fair trial was being breached by the request for an inquiry filed by Dr Busuttil.\nThe minister demanded that no decision should be taken about whether to hold the inquiry until his arguments about a human rights breach before the Constitutional court were heard.\nDr Busuttil and civil society group Repubblika took to the courts to again demand an inquiry in March due to the “institutional paralysis” over the Panama Papers scandal.\nIn reply to the Tourism Minister’s request to postpone the inquiry decree, Dr Busuttil told the court on Monday that an inquiry was merely an evidence-gathering process, not a hearing or a trial.\n“No one is prejudiced by the gathering of evidence”, Dr Busuttil said.\nThe former Opposition leader said Dr Mizzi’s request amounted to an attempt by a top government official to block an investigation and prevent evidence from being gathered and scrutinised.\nA leaked e-mail found in the Panama Papers revealed how Dr Mizzi, together with the Prime Minister’s chief of staff Keith Schembri, planned to receive $2 million in deposits using secretive offshore structure.\nOne of the companies linked to the planned deposits was owned by Yorgen Fenech, one of the investors behind the power station project spearheaded by Dr Mizzi.\nDr Busuttil said a similar Constitutional application claiming a human rights breach had been dropped by the minister in January.\nIn the application, Dr Mizzi had argued that he faced both an actual and potential breach of his rights if a Panama Papers inquiry took place.\nThis application was dropped after an appeal by Dr Mizzi, among others, successfully blocked the inquiry, so by his own admission, the potential breach of his human rights no longer existed, Dr Busuttil argued.\nVarious case law was also cited, in which it was ruled that decrees should only be postponed in exceptional circumstances.\nAn identical reply to Dr Mizzi’s request to block the decree was filed by Repubblika.\nBoth replies were signed by PN MP Jason Azzopardi.", "comment_count": 0, "id": 3106}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Changes in ADHD medication provided by the government were having a detrimental effect on children and adults, psychiatrists warned.\nThe government, however, insisted it supplied high-quality generic medicine and has commissioned an independent study to look into a number of cases.\nADHD is the most commonly diagnosed mental disorder of children, affecting one in 20, usually manifested in hyperactivity, poor concentration and impulsivity from an early age.\nMedication available worldwide allows 95 per cent of children to be treated with one form of medicine or another, however, patients in Malta are struggling.\nWhile the variety available abroad was not provided here, a recent swapping of a medicine with a cheaper one resulted in regress among some sufferers, the Times of Malta was told.\nA long-term effect medicine called Concerta (Methylphenidate) was recently replaced by Xenidate. \nAlthough in laboratory conditions they seemed similar, in practice, their release and effect was different, consultant child and adolescent psychiatrist Nigel Camilleri said. \nThis was either having no effect on children or only did so immediately and was short-lasting, affecting their sleeping patterns, he added.\nParents cannot even buy Concerta from pharmacies\nDr Camilleri is aware that the medication is used in some countries but notes that it has also been pulled off the shelves because of the consequences already mentioned.\nThe Maltese Association of Psychiatry appealed to the Health Ministry to reintroduce Concerta and, as a psychiatrist, Dr Camilleri said he received complaints from patients on a daily basis.\n“People from all walks of life, including those in managerial positions, are struggling, with one particular person at risk of losing her job since medication changed in January. Parents are, meanwhile, in tears as they cannot even buy Concerta from pharmacies because it is no longer being imported,” he remarked.\nPsychiatrists and people suffering from ADHD in Malta can only find treatment that works within three to four hours – Ritalin (also Methylphenidate) – or 12 hours (Xenidate). \nThere is no in-between medication that lasts for eight hours, such as Medikinet (Methylphenidate).\nWhen contacted, a spokeswoman for the Health Ministry said the government was supplying high-quality generic alternatives and “there has been no proven adverse reactions to such treatment being provided in the rest of the EU”.\nStill, the Health Ministry commissioned an independent study, with the support of international expertise in ADHD treatment on the international market, to look into the cases of those who requested in writing to continue using the branded instead of the generic medicine, she said. \nThe results of the study were imminent and the Health Department would be acting on the re-commendations of the expert report, the spokeswoman added.", "comment_count": 16, "id": 3107}, {"keywords": "", "author": "Jacob Borg", "article_body": "Parts of Mount Carmel had been evacuated due to serious infrastructural problems, Deputy Prime Minister Chris Fearne confirmed on Monday.\nMr Fearne said these parts of the hospital had been sealed off, and the remaining wards did not pose a danger to patients.\nThe Times of Malta reported last week how around three-quarters of the wards at Mount Carmel have condemned ceilings.\nIn one ward, the foundations too gave way and cracks were so wide that rats were sneaking in, according to a technical report.\nThe Health Minister said the government had decided to commission a study into these infrastructural problems instead of just patching them up.\nHe said the problems in the 150-year-old hospital had not occurred overnight. Mr Fearne said that while others had ignored these problems, the government had come up with a five-year plan to renovate the hospital.\nA building outside Mount Carmel had been rented to host patients in two wards which were being refurbished.\nOnce these renovations were done, patients in other wards would be relocated so works could be carried out in those wards.\nMr Fearne said €5.6 million had been dedicated to the renovations this year alone.", "comment_count": 40, "id": 3108}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Times of Malta continues to be the country’s favourite and most trusted news organisation by a wide margin, an independent study has shown. The Media Insights study found that nearly 78 per cent of Sunday newspaper readers said they regularly read The Sunday Times of Malta, followed by just over 16 per cent who read It-Torċa and just above 12 per cent who mentioned The Malta Independent on Sunday.\nThe Times of Malta website is also the online news source most people refer to, with 77 per cent of those surveyed citing it. Just under half of all respondents – 48.5 per cent – said the Times of Malta website is their favourite online source of news, with 10.7 per cent citing TVM’s website and 9.4 per cent naming Lovin Malta as their favourite online source. 10.8 per cent of respondents said they had no favourite news site. Times of Malta’s website is even more popular among university graduates, with 58.2 per cent of respondents with a tertiary education citing it as their favourite online source of news.\nThe study, carried out by research firm Esprimi, was based on two national surveys done over a period of a week in April and October 2018, online and by telephone, with a total of more than 4,250 responses.\nThe Times and Sunday Times also led the pack for preferred printed newspapers, with nearly two-thirds of all respondents, ahead of It-Torċa and L-Orizzont with 7.2 per cent and 5.1 per cent respectively. Around one in 10 indicated “none”.\nMore than four in every five respondents cited the Times of Malta website as one of their online news sources.\nSunday remains by far the most popular day for newspapers with around a third of respondents, but nearly double that – 62.6 per cent – answered “never” when asked when they were most likely to read printed newspapers. Unsurprisingly, the study found that far more people are now consuming their news online, with 41.6 per cent saying they read news websites and 7.5 per cent opting for newspapers or reading both printed and online news.\nFar more people are now consuming their news online\nMore than half said they did not read news articles either online or in print.\nMeanwhile, among magazine readers, Sunday Circle and Pink, published by Allied Newspapers Limited and distributed in The Sunday Times, emerged as the most popular and third most popular respectively.\nMore than half of respondents who bought magazines from the store or got them with their paper said they like to refer to the Sunday Circle, while it was 27.6 per cent for the women’s magazine Pink.\nThe Sunday Times of Malta is the country's most popular Sunday newspaper.", "comment_count": 30, "id": 3109}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Water Services Corporation denies that slurry is being disposed in the open sea from Gozo’s only wastewater plant, insisting the material was being treated using recently-installed equipment.\nThe Times of Malta was alerted a few weeks ago that bowsers laden with slurry were pumping out the waste in a manhole outside the Ras il-Ħobż plant, in the limits of Għajnsielem. \nThe ‘practice’, which started towards the turn of the year, had raised questions as the plant was not designed to treat farm waste but domestic sewage. In fact, whenever slurry is illegally dumped into the sewers it clogs the plant, with the result that raw sewage is pumped into the sea. \nIn recent years, there have been various incidents whereby Ras il-Ħobż, a popular diving spot close to the iconic Mġarr ix-Xini Bay, was contaminated with sewage.\nWatch: Pollution havoc at Gozo diving spot, but WSC says its network is working perfectly\nDuring a recent onsite visit, the Times observed four bowsers discharging farm waste in a manhole outside the plant in the space of about an hour. \nThere was little if any supervision by WSC staff during the operation. However, the sea below, where the plant discharges its effluent, looked crystal clear, at least to the naked eye.\nWhen asked about the matter, the corporation said it was fully aware of the situation, insisting that operations were being conducted under its supervision.\n“We developed a system that converts a bowser full of slurry to a skip-load of solid waste in about 15 minutes. This also safeguards the plant,” CEO Richard Bilocca said. \n“Since the new equipment has been installed, the plant is producing much less sludge and consuming less power,” he remarked.\nHe added that the situation in Gozo was very urgent due to the large concentration of farms in relation to the island’s population and, hence, the reason why such equipment had been installed there.\nThe Times had asked to view the equipment in operation but, instead, it was shown a short video clip, on the grounds there was not enough time to organise a trip. Such visit could be possible in the future, the Times of Malta was told.\nIf the plant is not closed, it would take weeks to recover until it reaches required parameters\nMr Bilocca recalled that the problem of illegal dumping of farm waste in the sewers had started about 10 years ago when new EU directives introduced limitations on the spreading of manure in fields across the year.\nThe corporation confirmed that, last year, it had decided to seal a number of manholes in Gozo that were being illegally used by farmers to dump manure, especially cow slurry. Such measure came in the wake of repeated faults caused by abusive practices, which were also having an impact on the production of the so-called new water from the same plant, which is used by farmers for irrigation purposes.\n“When there is a fault, often caused by illegal discharges, the only option is to shut down the plant for a few hours to cleanse the system - at the cost of having raw sewage flow straight into the sea,” Mr Bilocca pointed out.\n“If the plant is not closed down, it would take weeks to recover until it reaches the required treatment parameters. During such period, farmers would also suffer as they would go for about two weeks without new water until the plant returns to normality,” he continued.\nIllegal dumping of slurry in the sewers continues in Malta. \nGiven that no equipment similar to the one in Gozo was installed at the three plants in Ta’ Barkat in Xgħajra, which caters for 80 per cent of Malta’s sewage, Iċ-Ċumnija, in Mellieħa, and Sant’Antnin, in Marsascala, which was being upgraded, how was the WSC coping, he was asked.\nMr Bilocca said that, in Malta, other systems were devised “to stabilise the situation” but he pointed out there were plans to install equipment similar to that at Ras il-Ħobż.\nWhat options do Maltese farmers have to dispose of their slurry? The WSC would not delve into the merits of the matter. \n“This sector is managed by the Governance of Agricultural Bio-resources Agency and such questions are better directed to them,” Mr Bilocca said. \nSet up in 2017 through a legal notice published days before the general election, this agency coordinates and implements Malta’s agricultural waste management plan.", "comment_count": 16, "id": 3110}, {"keywords": "", "author": "Jacob Borg", "article_body": "Three directors of a company that developed and sold a headband marketed as helping autistic children “retired” following revelations that the device inventor falsely claimed to possess a PhD in neuroscience.\nThe Sunday Times of Malta reported in March that Adrian Attard Trevisan had falsely claimed he had obtained a PhD in neuroscience from the University College London.\nRead: Autism headband inventor paraded fake PhD\nIn a company announcement last week, Neurotech, the company behind the device, said Peter O’Connor, Simon Trevisan and Neale Fong had “retired from the board”.\nThe company’s shares jumped up 237.5 per cent upon the announcement.\nNeurotech admitted last month that Dr Attard Trevisan did not hold the qualifications listed in their prospectus to investors.\nCompany chairman Mark Davies said Neurotech had faced several recent challenges but remained in a unique position with a “scientifically-proven product, ready to sell into a large market”.\nDr Attard Trevisan once claimed the headband could help autistic children become more in touch with their environment by “500 per cent”. He has since admitted there was no scientific study to back up the claim when it was made in 2012.\nNo scientific study to back up claim when it was made in 2012\nIn 2016, Neurotech, an Australian company, took over AAT Research, the Maltese company founded by Dr Attard Trevisan and used to market and sell the headband.\nDr Attard Trevisan’s research received extensive media coverage, an endorsement from Prime Minister Joseph Muscat and a product launch of the autism headband by the Marigold Foundation, chaired by the PM’s wife, Michelle Muscat.\nPromotional material by Neurotech from that period presents Dr Attard Trevisan as a key developer of the autism headband, with a PhD in neuroscience from the University College London and a PhD in human physiology from Milan.\nSince admitting to faking his PhD qualification, Neurotech announced it had cut all ties with the inventor.\nNeurotech said in a public announcement it was “deeply disappointed” with the news about the fake PhD, Dr Attard Trevisan’s “limited role” as a company adviser had been terminated, it said.\nCompany documents from 2018 show Dr Attard Trevisan is a major shareholder in Neurotech.\nDr Attard Trevisan is being sued by a former employee for allegedly plagiarising sections of a PhD he obtained from Milan University in 2015.", "comment_count": 30, "id": 3111}, {"keywords": "", "author": "Ivan Martin", "article_body": "Reports of horses being slaughtered illegally have given rise to concerns meat could be reaching Maltese consumers via the black market, according to law enforcement and Veterinary Department sources.\nThe sources told the Times of Malta the police had been tipped off about the illegal activity possibly taking place at a secluded farm in the outskirts of Siġġiewi. The information supplied indicated that retired race horses were being illegally slaughtered and the meat then sold for consumption.\nThe matter was first flagged by Nationalist MP Mario Galea who last week blew the whistle on a number of suspected animal rights abuses, including the possible return of dog fighting.\nThe sources noted that the illegal slaughter of animals raised a series of health concerns, not only because of the questionable hygiene standards during the killing process but also because of the fact that race horses were usually administered performance-enhancing drugs. In 2010, officers found a workshop which had been modified to also operate as an illegal abbatoir.\nThe information furnished, the sources continued, indicated that horses could have been killed through asphyxiation, placing a bin bag over their heads and fastening it with a rope at the neck. \n“This is particularly cruel because the animal will suffer for several minutes before eventually dying a painful death,” they pointed out. In the public abattoir, animals are first stunned before they are killed in the most humane way possible. Horses could have been killed through asphyxiation, placing a bin bag over their heads and fastening it with a rope at the neck\nSources close to the Veterinary Department said that if the asphyxiation reports turned out to be true, it would probably be because this would make it look as though the animals had died of natural causes. \nOnly about a dozen horses were usually legally slaughtered for their meat in Malta every year, the same sources noted. Still, horse meat available on the market was far bigger than what one would expect from 12 animals and while the bulk was likely imported and then marketed as being local produce, the sources would not rule out that illegally-slaughtered animals were being sold to local consumers.\nThis is not the first time that the authorities are looking into the practice of illegal animal slaughter. About 10 years ago, an ‘abattoir’ operating illegally had been traced in the Swieqi valley when three men had been caught red-handed slitting the throat of a sheep.\nThe floor of the Swieqi ‘abattoir’ was covered in blood, a clear indication that several animals had been killed there, the sources recalled.\nIn 2009, police had raided an illegal slaughterhouse in Swieqi. Photo: Matthew Mirabelli\nSubsequently, animal welfare officers had apprehended two other men who they believed had turned up to buy meat hanging in a non-refrigerated room in the abandoned farm-turned-‘abattoir’.\nOfficers involved in the investigation had found the testicles of a horse on the ground and a mound of butchered animal heads and limbs covered in manure were discovered in a nearby field.\nAn old donkey, three horses, four goats and a sheep grazing in a field were believed to have been rescued from the butcher’s block thanks to the police raid.\nTools used to slaughter animals and animal tags that abattoirs display to ensure meat traceability were also found. The police had been monitoring activities at the old farm following complaints that illegal dog fighting could be going on there.\nThree men had eventually been found guilty of animal cruelty and breaching health regulations by selling meat not slaughtered under monitored sanitary conditions.\nOne year later, officers had come across nine tanks filled with pigs' heads in a workshop that had been modified into a makeshift abbatoir in Qormi.\nAnimal welfare officers also found slaughtering knives and freezers packed with meat, as well as several live animals including 50 sheep, 20 goats, several chickens and ducks.\nThe owner was arrested and charged with animal cruelty.  ", "comment_count": 37, "id": 3112}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta notes a rise in the slaughter of horses, worrying that their meat may get onto the black market.Another story explains that the medication used to treat ADHD has been changed and that some patients are finding its effects less helpful.\nL-Orizzont chooses the turmoil in Libya as its lead story, quoting the former member of the Libyan National Congress saying that Malta should support the civil government there. It also reports on women in the north offering child care services, without a permit.\nIn-Nazzjon reports that Malta would be broke without the money from selling passports, and reminds that the PN starts its electoral campaign today.\nThe Malta Independent interviews the two women who ran around Malta to raise plastic awareness, and also reports on Opposition leader Adrian Delia saying that the electoral campaign ould not be based on hate.", "comment_count": 0, "id": 3113}, {"keywords": "", "author": "", "article_body": "A 32-year-old man was grievously injured in a fall from a balcony this afternoon.\nThe police said the accident happened in Triq Ta’ Nawċiera, Qawra at 4.15pm.\nThe man, who is from Ukraine, fell when the balcony wall collapsed. He was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3114}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "A tunnel to Gozo is at present ineligible for funding under the EU’s TEN-T network, MEP Michael Cramer (European Green Party) told The Sunday Times of Malta yesterday.\nThis funding was something that, once the network is revised, was mentioned as a possibility by Transport Minister Ian Borg two weeks ago.\nOn the other hand, EU rules allow the government to subsidise fast ferry connections between the islands, Mr Cramer said.\nThe MEP, who sits on the European Parliament’s Committee on Transport and Tourism, was in Gozo to take part in a debate about transport between the islands. Several candidates for next month’s European elections took part. Mr Cramer’s appearance was arranged by independent candidate Arnold Cassola.\n“You have a big problem with traffic jams, and a tunnel will attract more cars, so the time that would be gained in the tunnel would be lost in exacerbated traffic jams,” Mr Cramer said.\nThe tunnel itself could become a bottleneck in peak times\n“The plan is for a one-lane tunnel that feeds into wider roads, and the tunnel itself could become a bottleneck in peak times. This means that a tunnel is not likely to improve the time it takes to get to your destination.”\n\nThe German MEP says that the Committee on Transport and Tourism is focused on three principles: “to avoid, to shift and to improve” transport networks to steer Europe away from private car use. This because the “growth of 25 per cent of CO2 emissions in transport since 1990 is nullifying CO2 savings in other sectors.”\nHe elaborates: “We are decisive on co-financing: 80 per cent of co-financing is going into rail and inland waterway projects. The European Parliament has decided that at least 40 per cent of EU money on transport has to go into rail.”\nHe mentions trams as the overall solution for Malta, something that the EU could more readily co-finance.\nAnd he dismissed talk by Dr Borg that the tunnel could be financed by the TEN-T network funding in the future.\nMr Cramer talks of electric bikes as ideal for short trips in Malta, citing research showing that most cars trips are less than 6km. As for transport to Gozo, Malta could learn from Denmark’s zero-emission ferries that are serving transport needs superbly.\n“Malta may make the same mistake as the Channel Tunnel,” he says. “It was devised to be financed by shareholders but costs of construction almost doubled. Even after plans were altered for a rail tunnel during the construction itself – initially it was supposed to be a road and rail tunnel – the private shareholders ended up losing 60 per cent of their investment. By the time the tunnel was completed, the company had gone bankrupt.”\nAnalysis: Faith over science?\nLast Wednesday’s motion in Parliament in favour of a tunnel to Gozo was supported by the PL and PN, while the two PD MPs deliberately and symbolically “boycotted the sham discussion”.\nHowever, with studies to back up the project yet to be published, the vote can be seen as merely an act of political faith.\nThe Prime Minister talked of the tunnel options – whether dug deep underground or immersed on the seabed – as something that has yet to be decided. This runs contrary to previous assertions of the tunnel being at the “implementation stage”.\nOpinion: The Gozo tunnel panic - Arnold Cassola\nAll talk about the tunnel shows that the project is still at the conceptualisation stage and that its funding and operation remain fluid.\nIn last year’s project description statement issued by Transport Malta, the tunnel was described as underground – bored either above or below the layer of blue clay. This remained an open question in the report.\nThe tunnel would be financed and constructed by a private entity that would then operate it for 20 years. This has led to questions about financial feasibility: whether it would be possible to rake in a return on investment and make a profit within 20 years.\nThis is something that is in turn dependent on evolving sea transport connections. The need for a tunnel could wane once the long-promised fast ferry to Valletta becomes operational and other sea-transport connections are expanded or forged. These might include a slow ferry to Valletta, a service that was abruptly halted in 2015 to make way for a yacht marina and has yet to be resumed, as was hinted at the time.\nQuestions have also been raised about the geologic feasibility of the tunnel. Scepticism by outspoken geologist Peter Gatt led to Infrastructure Malta responding late last year that detailed geological studies were being conducted. It is not known whether these studies have been completed.\nLast week Transport Minister Ian Borg promised to publish all studies but it is unclear whether they will include any detailed geological studies.\nTalk by Dr Borg two weeks ago that the tunnel may be eligible for EU funding as part of an expanded TEN-T network – revision of the network is expected in the early 2020s – shows that uncertainty remains about whether the project shall be delivered by a private entity or the government itself.\nFor a private entity, financial feasibility remains the proverbial elephant in the room: making a return on investment and running a profit from the daily pool of 9,000 vehicles projected to make the crossing by 2030 could make fares prohibitively high and encourage drivers to use the ferries instead.\nAnd for the government, if it has to fund the tunnel, putting its bets on TEN-T funding may prove to be ephemeral.\nAll this casts serious doubt on the target date of 2024 for completion mentioned by Dr Borg last year.", "comment_count": 75, "id": 3115}, {"keywords": "", "author": "Denise Grech ", "article_body": "On social media, so-called influencers can be quite, well, influential, especially with their young audiences. But how much of what they recommend stems from being offered some sort of payment to do so, Denise Grech asks.\nSocial media application Instagram has become the new way of connecting with audiences and creating a loyal fan base. The feed of local online influencers is full of recommendations on the best products and places to eat. But how much of it is genuine?\nAccording to industry insiders who spoke to The Sunday Times of Malta, hardly any of it is. Some of Malta’s major influencers are getting paid to post rave reviews of products and services, from skincare creams to ice cream parlours, often without disclosing they are getting paid to do so or that they have been given the product for free.\nBrands can pay anywhere from €50 to €200 for influencers to post pictures with a product, industry stakeholders added.\nThe reluctance to disclose sponsorships could have potentially serious legal implications, they said. In the US, stars Kendall Jenner and Bella Hadid faced lawsuits after failing to disclose they were being paid to advertise a luxury music event that fell apart.\nIn Malta, authorities and influencers alike have been left scratching their heads over how to properly inform their young audience they are being paid to post about a product.\nLawyers in commercial practice said current regulations on comparative and misleading advertisements are already in place, however it is difficult to enforce them.\nBrands can pay from €50 to €200 for influencers to post pictures\n“It’s an unexplored area in terms of regulation, because the market is so new and has exploded so quickly that there was no reason to explore it before,” one lawyer said.\nAlso, regulators could hardly be expected to have someone scrolling through Instagram and phoning influencers up every time they suspect one of their posts is misleading.\nThe lawyers say a set of guidelines is needed to outline how and when to disclose sponsorships and paid product placement.\nInfluencers, however, have a moral responsibility to properly inform their audience when they are being paid to post about a product or when they are given a product for free, according to entertainer Chucky Bartolo, a social media personality in his own right and a former online journalist.\nHe warned it was “deceptive” and “irresponsible” not to disclose sponsorships, particularly because the audience on Instagram is made up of young teenagers who easily believe the influencers.\nAdults can often see through posts being sponsored but young teenagers are susceptible to believing the recommendations are genuine, he explained.\nA social psychologist who specialises in media literacy echoed his concerns.\n“Followers of influencers feel they have come to know these people,” Mary Anne Lauri said.\n“They feel that they are friends, and friends’ recommendations have a stronger influence on us than any advert,” Prof. Lauri noted.\nThe phenomenon is known as “parasocial interaction” – a phrase used to describe the illusionary experience where audiences see celebrities as friends. Brands have capitalised on this, with industry stakeholders admitting companies advise influencers that their posts should not look like an advertisement.\n“It was an ad-hoc set-up, it happened overnight, and it blew up instantly. We didn’t have time to figure it out,” Mr Bartolo said.\nMany influencers fear that disclosing sponsorships will lead to losing their audience. “My audience may get frustrated if they see my feed is full of advertisements, so I might lose support,” he said.\nHowever, many were understanding enough to support their favourite social media darling being approached by large companies, he added.", "comment_count": 3, "id": 3116}, {"keywords": "", "author": "", "article_body": "A 24-year old man has been remanded in custody after allegedly attempting to run over a police officer in Ħamrun on Saturday.Justin James Grima, from Tarxien, was arraigned in court on Sunday where he pleaded not guilty to attempting to cause serious injury, threatening a police officer, damaging a police motorcycle and a host of other charges, including traffic offences.\nPolice said the incident took place at around 3.20pm when the accused was driving a Mitsubishi Shogun along St Joseph High Street and was stopped over the tinted windows on the SUV.He was told to follow traffic officers to the police garage, but instead attempted to flee in another direction. He was intercepted by police, who ordered him to turn off his engine, and when he refused, reached in through the window towards the ignition key. According to the prosecution, the accused then grabbed the officer’s hand and said: “My cousin has already run over one of you; I’m not scared of running over two more.”He then hit the accelerator and drove in the direction of two officers, smashing into a police motorcycle and narrowly missing the two.He was arrested and taken to Police HQ. Among the charges against him, he is accused of breaching the peace by causing a commotion while in the lock-up later in the day. Lawyers Franco Debono and Amadeus Cachia appeared for the accused. A request for bail was made but denied by Magistrate Simone Grech after the prosecution objected.\nWhen the accused came out of the court room in police custody, relatives who were waiting outside insulted the police. The relatives then moved outside court and waited for the Magistrate to come out.\nThe Magistrate eventually left court escorted by a substantial number of officers.", "comment_count": 0, "id": 3117}, {"keywords": "", "author": "", "article_body": "A 42-year-old Italian wanted for working with a mafia organisation was arrested by the police under a European Arrest Warrant after days of surveillance.\nThe police said in a statement on Sunday the arrest followed an operation named ‘Op Rich’ was carried out between members of the Intelligence and Counter Terrorism Unit.\nThe Italian, who lived in Swieqi, was well known in Igaming circles in Malta and is expected to be arraigned in the coming days for the extradition procedure to be embarked upon.\nHe is wanted by the Italian authorities for association in the organisation, management and collection of illegal betting on behalf of a mafia organisation.\nSix people have been arrested under European Arrest Warrants since the beginning of the year.\nSuch operations are aimed for persons sought internationally to be brought to justice, strengthening the fight against criminal organisations.", "comment_count": 28, "id": 3118}]