[{"keywords": "", "author": "", "article_body": "A man escaped with cash following an armed robbery in Birkirkara.\nThe police said the hold-up took place in Triq Fleur de Lys at 6.30am.\nThe man, who was hooded and carrying a knife, entered the shop and demanded cash from the 29-year-old woman from Żabbar, who was manning the shop.\nThe man escaped with the money.\nThe police are investigating.", "comment_count": 0, "id": 1219}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says a Health Department policy that an unborn baby is not recognised as a person at law has raised questions on the government’s intentions on abortion, despite the Prime Minister’s repeated denials it had no plan to legalise such a practice. In another story, the newspaper says Nationalist MP Hermann Schiavone suspended himself from the party following revelations by The Sunday Times of Malta that he and fellow MP Kristy Debono had met 17 Black owner Yorgen Fenech.\nIn-Nazzjon says PN leader Adrian Delia has accepted MP Hermann Schiavone’s decision to suspend himself from the party.\nThe Malta Independent quotes the Ombudsman saying Parliament was not acting on recommendations forwarded to it following inaction by the government.\nL-Orizzont says the government has plans to strengthen care for sufferers of Parkinson’s disease.\nIn-Nazzjon says PN leader Adrian Delia has accepted MP Hermann Schiavone’s own suspension.", "comment_count": 1, "id": 1220}, {"keywords": "", "author": "", "article_body": "Another woman was evacuated from a stranded humanitarian vessel after requiring medical attention, the government said.\nNGO Sea-Eye said in a statement the woman, 23-year-old Nigerian, one of the two pregnant women on board the Alan Kurdi, had suffered an epileptic seizure. Her \"worried\" husband remains on board.\nThe vessel has been stuck at sea for nine days with 80 people aboard - 64 of whom were rescued off war-torn Libya. On Tuesday, another 24-year-old woman was evacuated to Malta for medical attention by the AFM following loss of consciousness.\nThe ship has been denied access to Malta and Italy, with both governments repeatedly saying it was Libya's responsibility to take in the boat, Sea-Eye chairman Gorden Isler had told Times of Malta.\n\"We can only hope that the young woman will soon feel better again. Here on board we could not help her anymore,\" Capt. Werner Czerwinski said.\nWatch: 'In Libya, they sell human beings. They have sold me twice'\nHe expressed his concern about the coming days saying the people were constantly asking him why they had to stay on board for so long.\n“They are really afraid of the next phase of bad weather. Many of them were seasick and recover only slowly. They see how two women collapsed and had to be evacuated. This is not a condition for people who have experienced such terrible things and it is also not a condition for my crew,\" he said.\nRead: 'Please help us,' NGO asks Malta after Salvini 'humiliates' migrants\nThe Migrant Offshore Aid Station delivered emergency food, water, medicines, dry clothing and blankets to the remaining migrants onboard the stranded vessel Tuesday afternoon. Another shipment had to be delivered by the AFM.\nThe woman’s evacuation was one of two medical evacuations carried out by the AFM on Wednesday.\n50-year-old man evacuated from another vessel\nThe army also evacuated a 50-year-old man from the vessel Fedora, also for urgent medical attention.\nThe evacuations were conducted by the AFM’s Melita 1 search and rescue vessel.\nIn a statement, Sea-Eye, said it was still waiting for a political solution.", "comment_count": 0, "id": 1221}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The St Julian’s local council and business community have welcomed plans to replenish the sandy beach at Balluta Bay once again, but urged the government to pursue a long-term approach instead of yearly top-ups.\nTimes of Malta reported on Wednesday that the beach extension – inaugurated last August but swept away within months – would be repeated yearly at a cost of around €80,000, with Tourism Minister Konrad Mizzi arguing the cost was worthwhile for people to enjoy the beach over summer.\nSt Julian’s mayor Guido Dalli, asked by Times of Malta for his views, said he was pleased the project would be reinstated but raised questions about its long-term sustainability.\n“The beach itself is very positive; everyone prefers having it there,” he said.\n“It’s just a question of whether it makes more sense to invest in a breakwater. If they prefer to do it year by year, the council is not opposed, but we already know that the first strong grigalata [north-easterly wind] is going to carry the whole thing away.”\nHis views were echoed by Malta Hotels and Restaurants Association president Tony Zahra, who said businesses around the bay, which include a hotel and several bars and restaurants, had all given positive feedback about the impact of the beach last summer.\nOne would hope it’s not destroyed every year\n“I think it’s a good idea to do it again, but obviously one would hope it’s not destroyed every year, and we should be trying to find a solution to prevent that,” he said.\nThe prospect of an underwater reef or wave-breaker to shield the sand from erosion has already been raised by Dr Mizzi.\nHe said, however, that such a project would require further study due to environmental considerations such as the presence of protected Posidonia seagrass.\nMarine biologist Alan Deidun, who has studied the impact of breakwaters on Posidonia habitats for a project in Marsaxlokk, told the newspaper the effects of such a project could be significant.\n“The Posidonia at Balluta seems to be in a fragmented condition due to anchoring, discharges from land and other human activities, but the fact that it is already impacted should be no excuse for cutting corners,” he said.\nProf. Deidun said breakwaters altered an underwater area’s hydrodynamic conditions – currents and water-flows – which could lead to the seagrass being “choked” beneath heavy sediment deposits.\nWorks, he said, could also increase water turbidity over a wide area, as well as “obliterating” anything directly below or close to the breakwater itself.\n“I would urge the government not to consider a project like this without commissioning a proper hydrodynamic study, which would give a snapshot of future scenarios with a breakwater in place,” he said.  ", "comment_count": 62, "id": 1222}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Tourism Minister Konrad Mizzi is “still gathering information” about his visits abroad, which was sought through questions tabled in Parliament since 2014.\nThe minister told Nationalist MP Claudette Buttigieg last week the information she had originally requested in 2014 about his trips abroad is “still being compiled”.\nAbout eight similar written questions were tabled since June 2017 asking for a list of trips made since he was first appointed minister in 2013 together with the names of those who accompanied him, the destinations, the scope of the visits, details about people with whom he met and the expense.\nCabinet colleagues regularly reply to such type of questions, political observers commented. Prime Minister Joseph Muscat, who frequently travels on official business, submitted regular information to Parliament, they noted.\nThe only travel information supplied by Dr Mizzi during this legislature was that he made eight overseas visits in 2017 and another 30 last year, spending about €2,600 per trip.\nNo further details were, however, given though they were requested in the written questions.\nWhen former Opposition leader Simon Busuttil asked Dr Mizzi whether he recently visited either Panama or New Zealand, the minister replied with an unequivocal “no”.\nCabinet colleagues regularly reply to such type of questions\nThe Panama Paper had exposed Dr Mizzi as the only sitting government minister across the EU to have a secret company in Panama. The company formed part of another financial vehicle, a trust in New Zealand.\nDr Mizzi had later admitted he had not declared neither the company nor the trust with the Maltese tax authorities, in breach of Maltese law.\nDespite intense pressure from various quarters to resign, including Cabinet colleague Evarist Bartolo and others, the Prime Minister still decided to retain him. \nIn a move evidently aimed at allaying public criticism about his inaction, Dr Muscat had stripped Dr Mizzi of his energy and health portfolios and the minister also had resigned from the post of deputy leader of the Labour Party.\nStill, Dr Mizzi was retained as a minister within the office of the Prime Minister and continued to handle major energy projects.\nFollowing the last general election, Dr Muscat appointed him Tourism Minister.", "comment_count": 36, "id": 1223}, {"keywords": "", "author": "Jacob Borg", "article_body": "St Michael School in San Ġwann has been waiting for 13 long years to be connected to the sewage mains despite paying the relevant fees when it was built in 2006, Times of Malta is informed.\nSources familiar with the situation told the newspaper that the road-widening project outside the school in Tal-Balal would have been the perfect opportunity to remedy the situation.\nOver 4.3 kilometres of water pipes, 650 metres of internet and other telecommunication cable ducts and 650 metres of high-voltage electricity cables were being installed beneath the new road surface in collaboration with utilities and telecommunication services providers, a spokesman for Infrastructure Malta said.\nSchool almost half a kilometre away from nearest existing sewage network\nThe school has been using a temporary storage facility near the school grounds where to dump the sewage waste before it is removed by a bowser twice a week at the school’s expense. As the school expanded over the years to over 500 students and teachers, more pressure was put on what was meant to be a temporary infrastructure.\nThe sources said the Water Services Corporation had drawn up the necessary plans for the drainage works but refused to pay for them and Infrastructure Malta would not foot the bill for the drainage works.\nAn Infrastructure Malta spokesman said the agency did not have the necessary resources, nor the remit, to install new networks for specific developments. Such new systems were developed and funded by the utilities providing the service in collaboration with the customers involved, he added.\nHe said the school was almost half a kilometre away from the nearest existing sewage network and the estimated cost of installing such a long, new network, including all the trenching works required, ex-ceeded €250,000.\nWhen asked by Times of Malta about the promised sewage infrastructure at the school, a spokesman for the WSC replied it “communicates all project proposals with Infrastructure Malta through official channels”.", "comment_count": 8, "id": 1224}, {"keywords": "", "author": "Edwina Brincat      ", "article_body": "Thirteen people who had posted angry comments on Facebook directed at restaurant owners in Għajn Tuffieħa over an act of animal cruelty have been cleared of all liability after a magistrate found several procedural defects in the prosecution’s case. A photo of the kitten that was killed in Għajn Tuffieħa.\nLast August, an unidentified man was seen chasing a stray kitten out of the Apple’s Eye restaurant and then beating the animal to death, in full view of patrons dining nearby. \nThe incident had prompted outrage on social media, with many directing their posts at the restaurant owners, who insisted they had nothing to do with the alleged cat killer.\nThe family who own the restaurant ultimately turned towards the police, filing a report about a series of comments and perceived threats made in their regard.\nThirteen suspects were identified and prosecuted for having allegedly threatened the proprietors of the restaurant via Facebook as well as with the misuse of electronic equipment.\nHowever, magistrate Donatella Frendo Dimech observed that the prosecution’s cases were riddled with procedural defects.\nThe first charge, being a contravention, was time-barred and had been withdrawn by the prosecution in the course of the proceedings.\nHowever, even if this time factor had not entered into play, the charge would still have faltered on account of the fact that defamatory comments, unless amounting to threats, were no longer prosecutable offences following amendments to the law.\nAny action in this respect would have to be of “a purely civil nature,” the court observed.\nThe matter would have been different had the comments amounted to threats.\nHowever, even in this case, the prosecution would have had to prove that the threats were real in terms of law, involving a future and unjust wrong against the intended victim, the court went on, adding that the comments posted by all 13 accused did not amount to such threats.\nPeople prosecuted by the police had allegedly posted comments such as “If I was there I stone him to death and make sure he is dead before I report myself to the police, sick pathetic liar” and “This is the act killer of appple’s eye….may you rot in hell”.\nAs for the alleged misuse of electronic equipment, the prosecution had rested solely upon information obtained through Facebook and investigations into open sources and local service providers.\nReports on these findings amounted merely to hearsay evidence and were thus inadmissible unless confirmed by representatives of entities concerned, the court said.\nIn the absence of such evidence, the prosecution failed to prove the link between the alleged criminal conduct and the accused, who were therefore acquitted.\nThe court also criticised the “totally anomalous and irregular” practice adopted by the police, who had summoned the accused to the local police station, not to question them as suspects, but to inform them that charges would be issued in their regard, a practice which was nowhere mirrored under our law.", "comment_count": 0, "id": 1225}, {"keywords": "", "author": "Keith Micallef", "article_body": "An average of two foreign-registered cars were impounded every week by the transport regulator in 2017, as the vehicles were circulating illegally on Maltese roads.\nIt transpires that during the period under review a total of 173 cars were impounded by Transport Malta, of which 108 had foreign plates.\nIn such cases, the owner can reclaim the car by paying a removal fee to Transport Malta, a storage fee and a €35 administrative fine. \nBy law, when buying a car from abroad, there is a 30-day limit to have the vehicle inspected and registered by the local authorities. A similar arrangement applies for foreigners with a permanent residence permit who are also obliged to follow the same procedure. Failure to meet this deadline would result in a daily €30 fine until the situation is regularised. \nHowever, non-residents and tourists are allowed to use their car for a maximum of seven months per calendar year without registering, on condition they have their normal residence outside Malta and have non-resident status. \nThe presence of foreign-registered cars on the island, whose number have increased in recent years due to the influx of migrant workers, has become a sore point for law-abiding Maltese motorists. They claim that authorities are turning a blind eye to traffic contraventions committed by drivers at the wheel of foreign-registered cars, as more often than not the culprits are hard to trace. \nAggrieved motorists four years ago had joined forces and opened a Facebook page, by the name of Carpark Paradise. Administrators insist their only objective is to fight discrimination against Maltese drivers especially on issues like illegal parking. \nThis kind of contravention is by far the most common offence committed on Maltese roads, not only by foreigners but also Maltese. \nIt transpires that in 2017, the highest number of traffic-related fines issued by Transport Malta was over illegal parking with 4,673 out of the 14,034 tickets issued.  \nThe total marks a 38 per cent rise over 2016, and the majority of tickets were issued in St Julian’s, St Paul’s Bay and Malta International Airport. \nThe second most common contraventions were expired road licences (2,779) followed by vehicles which had no licence affixed to the windscreen (2,550). \nMeanwhile, more than 15,000 parking tickets were issued by the police during the same 12-month period. \nThis equates to an average of 55 parking tickets per day, between traffic police and Transport Malta officers.", "comment_count": 4, "id": 1226}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Ombudsman has accused the House of Representatives of sleeping on investigation reports handed over for remedial action. Ombudsman Anthony Mifsud (left) has lamented parliament's inaction on a number of investigation reports.\nParliamentary Ombudsman Anthony Mifsud presented the case notes for 2018 to Speaker Anġlu Farrugia on Wednesday afternoon.\nIn his forward address, the Ombudsman said that “a number of final opinions have been sent to the Speaker of the House of Representatives following negative response from the public authorities to requests to implement our recommendations\".\n\"We have indicated that to date none of these referrals have been actively considered by the House. There has been no response whatsoever.”\nThe Ombudsman continued that: “One can safely conclude that this statutory procedure provided for in the Ombudsman Act, which was meant to be a final safeguard to provide redress against injustice to aggrieved citizens, is proving to be ineffective. This needs to be remedied.”\nThis concern, Mr Mifsud added, was also highlighted by the Venice Commission in their opinion on Constitutional arrangements and separation of powers and the independence of the judiciary and law enforcement.\nIn this respect, the Ombudsman welcomed the commencement of the legislative process initiated by Government in Parliament on changes suggested by the Venice Commission.\nThe annual publication of case notes is meant to provide an inkling into the investigation of complaints carried out by the Ombudsman and the Commissioners in his office, the considerations on which their final opinions are based and the type of remedy or redress recommended.\nThis year’s edition reported cases that were of general interest and meant to provide a fair “cross-section” of the complaints investigated.", "comment_count": 40, "id": 1227}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 7.57pm with Delia comments \nNationalist Party MP Hermann Schiavone suspended himself from the party's parliamentary group on Wednesday, days after The Sunday Times of Malta revealed he and another MP had met with 17 Black owner Yorgen Fenech.\n\"Despite knowing I did nothing wrong, I still feel I need to carry responsibility for my lack of attention,\" Dr Schiavone said in a letter to party leader Adrian Delia.\n\"I feel the controversy is distracting you and the party from continuing its fight for what is right effectively,\" he said, suspending himself and asking the party to appoint a board to investigate the matter. \nDr Schiavone and MP Kristy Debono met with Mr Fenech to discuss a potential sponsorship opportunity for a conference they were organising. \nMr Fenech, who serves as a director of the Tumas Group as well as of the Electrogas power station consortium, was revealed to be the owner of 17 Black, a secret company leaked emails suggest was created to funnel money to companies owned by minister Konrad Mizzi and OPM chief of staff Keith Schembri.  \nKristy Debono 'unfairly criticised'\nIn his letter, Dr Schiavone said that his fellow MP Kristy Debono was not to blame and was being unfairly criticised for the meeting. \n\"I was originally referred to another director but at the last moment was referred to Mr Fenech,\" he said.\n\"Ms Debono was not informed about the change in appointment and so is facing unjust criticism.  \nIn comments to Times of Malta, Ms Debono said that she was not feeling relieved.\n\"I was willing to shoulder responsibility but I'm glad the truth has come out,\" she said, adding that Dr Schiavone retained her full support.  \nRead: PN MPs meet owner of 17 Black to seek conference sponsorship\nPledging loyalty\nAlthough Dr Schiavone has suspended himself from the PN's parliamentary group, he indicated that he would continue to back the party in parliament. \n\"Although I will not form part of the parliamentary group, I assure you that in parliament I will be following the party line,\" he wrote to Dr Delia. \n\"I am in politics to serve and have always done all I can to serve any party leader I've had with loyalty and honesty,\" he said.\nRead: PN silent on Kristy Debono general council future following 17 Black owner meeting\n'We walk the walk' - Delia\nIn a statement, Dr Delia said he accepted his suspension.\n\"This is nothing but a testimony to how PN MPs conduct themselves,” Dr Delia later said, adding that this showed his party was walking the walk, not just talking the talk. Addressing supporters at the PN club in Balzan, Dr Delia thanked Dr Schiavone for his loyalty.\nDr Schiavone was elected to parliament for the first time in 2017, following a turbulent path to obtain a seat. In 2003, he was forced to withdraw his electoral candidature as a result of an anonymous letter accusing him of wrongdoing.\nA decade later, the party banned him from contesting the 2013 general election on a PN ticket, after he accused then-PN MP Franco Debono of being behind that letter. \n‹›-+Page:  /  \nLabour Party says suspension meant to quell disagreements\nThe Labour Party saw the suspension as another sign of the disagreement within the Nationalist party.\nIt said it was clear that the suspension was meant to put an end to the public spats between the two MPs and their colleague – especially just weeks before an election.", "comment_count": 182, "id": 1228}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A former chef who used to buy cocaine every day from Jordan Azzopardi’s illegal underground operation told a court on Wednesday how he was once beaten up by the alleged drug kingpin and two of his henchmen.\nOwen James Formosa, a confessed cocaine-addict currently also facing drug-related proceedings, took the witness stand on Wednesday in the compilation of evidence against Mr Azzopardi, who was arrested on March 13.\nThe witness stepped forward to confirm a statement released on March 9 to the police, two days after he was arrested during a raid on a house at Mountbatten Street, which he regularly visited to purchase his daily dose of cocaine, spending €30 to €40 each time.  Jordan Azzopardi.\nThe man recalled how he would walk up to the first floor and then hand over his cash in exchange for the drug through a hole in a metal door.\nThe person who served him was generally “Ramires”, the 20-year old who was arraigned on Tuesday over drug-related charges.\nMr Formosa also recounted how one time Mr Azzopardi and two of his men had turned on him. One of the three had held him while Jordan Azzopardi and the other punched him, the witness explained, saying that his vision still suffered as a result of the beating.\nThe man said that he occasionally went to buy drugs from another place in Birkirkara, also targeted by a police raid. He mentioned the other drug outlets in Marsa and Gzira, adding that he had “heard people saying that these belonged to Jordan.”\nAn officer from the police's anti-drugs squad told the court how he had found similar set-ups when searching locations in Marsa, Birkirkara, Gżira and Pieta’. They all had a metal door behind the front door, stone barricades and a black acid tank, besides cash strewn about the place.\n€3,500 monthly rent\nReuben Vassallo, an architect from St Paul’s Bay and owner of the Ta’ Liberat farmhouse at San Martin, used by Mr Azzopardi as his residence, also took the witness stand explaining how the villa had been rented out in October on a one-year term.\nThe agreement had been signed with a woman named Kelly who was to pay the €3,500 monthly in advance, the court was told.\nA couple of installments had not been paid since a dispute had arisen over a damaged jacuzzi, Mr Vassallo explained.\nThe witness recalled how his gardener had noted something suspicious while tending to some rubble walls at the villa, prompting the owner to inform the police.\nThe gardener concerned, Jason Camilleri, also testified as to how the police had searched the rubble wall which had first attracted his attention and aroused his suspicion. Inside that wall was a sock which was retrieved by the officers.\nOn another day, the police had searched a cave close to the villa. There, hidden behind the walls of a sauna, they had found a cash-filed packet.\nFresh charges\nDuring Wednesday's hearing, the prosecution filed two fresh charges against Mr Azzopardi for possession of counterfeit money and unlicensed possession of a weapon for which relative duty had not been paid.\nAs the hearing neared its end, submissions for bail were made with respect to the female co-accused, a mother-of-five from Cospicua who works as a nail technician and whose name cannot be published under court order.\nLawyer Alfred Abela pointed out that the risk of tampering with evidence was non-existent given that only one civilian witness, currently behind bars, was still to testify.\nMoreover, as a mother whose children lived in Malta and with a job here, the risk of absconding was unlikely, he argued.\nHowever, the prosecution objected to bail on account of the gravity of the offences and the fact that investigations were still ongoing.\nThe court, presided over by magistrate Doreen Clarke, declared that it would decree upon the matter in chambers.\nA similar request for bail on behalf of Mr Azzopardi is to be discussed at a later stage, the court was informed.\nThe case was adjourned to April 24.\nLawyers Arthur Azzopardi and Alfred Abela appeared as counsel to the defence. Inspectors Mark Anthony Mercieca and Justine Grech prosecuted.", "comment_count": 0, "id": 1229}, {"keywords": "", "author": "Denise Grech ", "article_body": "Some 300,000 people are to start receiving a tax refund from Monday in terms of a government measure originally announced in the 2018 Budget.\nWorkers should expect a €40 to €68 cheque to arrive by post as from next week. The cheques will be based on the tax declaration form filled in 2018.\nThose who are single will receive between €40 to €60. Those who are married will get €44, €56 or €68.\nRead: Tax refunds, higher pensions and higher VAT-free thresholds for SMEs\nFinance Minister Edward Scicluna said the aim of the measure was to reduce social poverty, noting that those with a lower income would receive higher amounts than others from the government.\nA study by the government showed the risk of poverty decreased by 0.81 percentage points from last year, Prof. Scicluna said.\n\"The government does not just talk about reducing poverty- it delivers it with facts,\" he said.\nThose who are eligible for the rebate are kindly asked to wait a week after April 15 until they contact the department with queries.", "comment_count": 28, "id": 1230}, {"keywords": "", "author": "Ivan Martin", "article_body": "An investigation by the Mental Health Commissioner into the involuntary committal of a former police officer has found his rights had not been breached.\nMario Portelli filmed the moment three police officers came to his home to escort him away last February.\nThe former officer had previously posted a flurry of videos on Facebook in which he said he was going to confront Prime Minister Joseph Muscat about claims that his wife owned the once-secret offshore company Egrant.\nQuestions had been raised by mental health practitioners as to whether all the necessary procedures were adhered to in the process leading to Mr Portelli’s committal.\nAccording to those procedures, a doctor must assess the person and recommend hospitalisation as the only reasonable course of action to preserve life and safety. The doctor must also establish that there are no safe alternatives that are less restrictive.\nReplying to a parliamentary question, Health Minister Chris Fearne said that the commissioner had concluded that the case of Mr Portelli had been above board.\nAlthough Mr Fearne said he would not publish the entire report, due to private medical information within it, he reproduced a one-paragraph conclusion declaring that Mr Portelli’s committal, at the behest of his parents, did not breach his rights:\n“Having taken all the evidence in consideration, the Board does not consider that Mr Portelli’s rights as a mental health service user were breached during the period indicated for investigation. The Police acted under Article 44(4) of the Mental Health Act. The admission process was effected through a first medical assessment at Mater Dei Hospital and subsequently completed with a second specialist assessment effected within 24 hours of admission at Mount Carmel Hospital.”\nThe alliance for mental health had asked both the Mental Health Commissioner and the police board to officially investigate and to ascertain that all procedures were adhered too.\nA spokeswoman for the police declined to say if Mr Portelli’s committal to Mount Carmel had been pre-authorised by a psychiatric team.\n“Kindy note that due to investigations being carried out, it’s not prudent to divulge further information regarding this case,” a police spokesman said.\nPD MP Godfrey Farrugia, who is familiar with Mr Portelli’s case, had said on Facebook that the former PC did in fact arrive at Mount Carmel with the necessary documentation but that this was only because they took the “irregular” step of stopping at Mater Dei Hospital en route to sort out the paperwork with the patient in tow.\nMr Portelli’s parents had also insisted that all the necessary procedures were adhered to.", "comment_count": 5, "id": 1231}, {"keywords": "", "author": "", "article_body": "Malta International Airport has been ranked among the world's best by Skytrax, which listed it among the top 10 airports of its size worldwide.\nMIA, which currently holds a four-star rating awarded by Skytrax in 2016, ranked among the best airports hosting between five and 10 million passengers annually.\nOther top performers in that category included Adelaide Airport (Australia), Christchurch International Airport (New Zealand), Koltsovo International Airport (Russia), and Keflavík International Airport (Iceland). It was the only EU airport to feature in this category.\nAn internationally renowned airline and airport audit organisation, Skytrax announced the winners of its World Airport Awards 2019 based on air travellers’ votes on service and product key performance indicators, such as check-in and security processes and retail options, for 550 airports across the globe.\n“This is another vote of confidence from our passengers in our airport and the team that drives it towards reaching its ambitious goals, heartening us to keep working on turning brief airport journeys into memorable passenger experiences in line with our vision,” Malta International Airport CEO Alan Borg said.\nThe overall winner of Skytrax’s World Airport Awards 2019 was Singapore Changi Airport, which has held on to the prestigious ‘World Best Airport’ title for seven years since 2013.", "comment_count": 7, "id": 1232}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government should \"urgently reconsider\" the appointment of Jason Micallef as chair of the Valletta Cultural Agency, PEN international is insisting. \nIn a tweet, the international writer's association said that it was \"dismayed\" by the appointment, \"despite an obvious conflict of interest\". \n\"The Maltese government must urgently reconsider this promotion and hold him accountable for his vilification of #DaphneCaruanaGalizia,\" the organisation said. \nThe Times of Malta reported last week that a special clause in a new law setting up the Agency will allow the former Valletta 2018 chief to be appointed chairman, despite Mr Micallef also being at the helm of Labour Party media house ONE. \nThe Valletta Cultural Agency was set up last month with the aim of continuing the legacy of the Valletta 2018 Foundation in the capital and to lay the groundwork for Malta’s next European Capital of Culture stint in 2031.\n\n\n\nThis is not the first time that the international association has complained to the government about Mr Micallef, most notably following controversial comments he made related to the murdered Ms Caruana Galizia. \nLast year, Mr Micallef had sparked anger among several local and international artists after uploading a social media post mimicking the slain journalist's last words. ", "comment_count": 32, "id": 1233}, {"keywords": "", "author": "Denise Grech ", "article_body": "Migrants aboard a stranded vessel received a lifeline on Wednesday, after an NGO donated food and water supplies.\nThe 'Alan Kurdi' has been stuck at sea for eight days with 80 people aboard - 64 of whom were rescued off war-torn Libya. On Tuesday, a 24-year-old woman was evacuated to Malta for medical attention by the AFM following loss of consciousness.\nThe ship has been denied access to Malta and Italy, with both governments repeatedly saying it was Libya's responsibility to take in the boat, Sea-Eye chairman Gorden Isler said.\nThis is the same country whose capital has been surrounded by military troops for days. There is heavy fighting going on,\" Mr Isler said.\nRead: No Maltese requests for evacuation from Libya\nWatch: 'In Libya, they sell human beings. They have sold me twice'\nThe ship is now waiting off Malta for another shipment of supplies, Sea-Eye added.\nThe Migrant Offshore Aid Station delivered emergency food, water, medicines, dry clothing and blankets to the remaining 63 migrants onboard the stranded vessel Tuesday afternoon. It said it hoped the supplies will be \"of some support until a more long-term solution is found\".\n\"Most of those onboard have already experienced unimaginable atrocities in Libya and we are therefore deeply saddened that the ship has been stranded for so long, especially when those onboard include an infant and a young child who have been facing adverse weather conditions,\" MOAS said.\nRead: No Maltese requests for evacuation from Libya\nIt expressed concerns on the escalating violence in Libya, saying this only enhanced the need for the creation of safe and legal routes for vulnerable people in desperate need of protection.\n\n\n\nThe NGO called for countries to focus on showing solidarity and compassion in their response to the vessel and allow those onboard safe harbour in Europe.\nMOAS refused to ignore the plight and suffering of those on Europe’s doorstep, it said.", "comment_count": 0, "id": 1234}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "Three teenagers accused of hijacking a merchant vessel and forcing it to head to Malta were the ringleaders who led the alleged uprising aboard the ship, its captain insisted in court on Wednesday.\nThe captain of the El Hiblu 1 told the court that the accused – who are aged just 15, 16 and 19 – acted aggressively and circled the bridge, making sure the ship was heading to Malta at full throttle.\nThe three teens face charges which amount to terrorist activity under Maltese law. \n“No Libya, go Malta!” the captain recalled them ordering, saying that the three had worked together to make sure the El Hiblu 1 did not return to Libya, as was the captain’s intention.\nCaptain Nader El Hiblu, 42, admitted that there had been no violence and that he was the only person steering the ship all throughout.\n“We did as we were told to avoid being hurt,” he told the court. “We felt outnumbered”.\nRead: 'They were ready to die': crew members testify in ship 'hijack' case\nThe El Hiblu 1 was stormed by AFM troops in the early hours of March 28 as it entered Maltese waters. The ship’s captain had said that his vessel was “under piracy”, with a group of migrants he had rescued late on March 26 having forced him to head north towards Europe.\nUnder cross-examination on Wednesday, the captain said he had first made contact with Maltese authorities when the El Hiblu 1 was close to Malta. He had not made any mention of being hijacked, he admitted.\n“I wanted to keep things calm,” he said in court.\nWas it true that the crew had suggested mentioning a hijack, to give them a better chance of entering Malta, the defence asked.\n“I was steering the ship at the time,” the captain replied. “I cannot answer that question”.\nThe El Hiblu 1 had rescued the group of 100-odd migrants after receiving instructions to do so by Italian authorities, the captain recalled. A rescue plane flying overhead had then instructed him to take the group to a defined location, where a ship would be waiting.\nOnce there, however, the El Hiblu 1 found no trace of the alleged ship. The captain had tried to make contact but received no reply, and after waiting a while, had decided to change course and head for Tripoli, he testified in court.\nOn Tuesday, the ship’s chief engineer had testified that the vessel had spent just 30 minutes at the designated meeting point before heading for Libya. The ship’s captain, however, on Wednesday claimed that the ship waited for six hours – from 6pm to midnight – before sailing to Tripoli.\nTrouble began brewing early the following morning, he said, when migrants woke up and spotted Libya’s coastline in the distance.\n“We sensed something would happen and locked ourselves in,” he told the court. “A group of 20 or 25 got hold of anything they could lay their hands on and began to bang on the glass,” he said.\nOne of the accused, whose names are being withheld under court order, had banged on the glass using an iron key. Another had also banged and covered all the cameras. The third, the captain said, had served as an interpreter because he spoke English.\nWhen pressed, the captain denied reporting injuries to Maltese authorities.\nThat prompted magistrate Aaron Bugeja to step in and read from transcripts between the El Hiblu 1 and Maltese authorities, in which the ship said some crew members had been injured.\nRead: AFM on alert as hijacked ship heads for Maltese waters\n“That was the chief engineer speaking,” the captain said.\nThe ship captain had initially tried to steer the ship as slowly as he could, in the hope that the Libyan coast guard would catch up and intervene. The three accused had realised, though, and demanded that he set sail at full throttle.\nThey had remained there, by his side, until the vessel approached Malta and AFM troops prepared to storm the ship, the captain said.\nLawyers Cedric Mifsud, Neil Falzon, Gianluca Cappitta and Malcolm Mifsud were counsel for the defence. \nInspector Omar Zammit prosecuted. ", "comment_count": 0, "id": 1235}, {"keywords": "", "author": "Keith Micallef", "article_body": "Reports that Mater Dei Hospital is gearing up to receive Libyans injured in ongoing clashes in Tripoli have prompted the nurses’ union to issue a stern warning to the government.\n“Our nursing staff is already strained to the limit,\" the Malta Union of Midwives and Nurses said in a statement. \n\"This will result in nursing patients who will very probably be infected with multi-resistant organisms and deployed in corridors where high-security risks for the nurses involved will be present. This will have an impact on the whole service in Mater Dei Hospital,” the MUMN said.\nThe Health Ministry has told the MUMN that no such plans are in the pipeline.\nHowever, the MUMN noted that the indications on the ground did not tally with such assurances. Apart from media reports, concerns that Libyan patients could be on their way to Mater Dei Hospital tallied with feedback received from nurses, the union said.\nFull occupancy at hospital\nMater Dei Hospital is already running at 100 per cent bed occupancy, with nurses struggling to cope with the sheer number of patients in both wards as well as corridors, the MUMN said.\nRead: No Maltese requests for evacuation from Libya\nThe union noted that despite the Health Minister’s denial that such plans were in the pipeline, it was still receiving “worrying reports” from its members that preparations were underway to receive Libyan patients.\n“We are not against the care for the Libyan patients, but such extra work load will have drastic effects not just on the nursing staff working with such patients but also an impact on the care given in the whole hospital,” the MUMN said.\nMalta's only acute hospital could not cope with the additional workload and should not be used as a political game, the union said. \nMUMN warned that  if the Minister would not keep  his word it would not hesitate to take whatever actions necessary to protect its members and patients from what is described as “unethical and irresponsible decisions.”", "comment_count": 46, "id": 1236}, {"keywords": "", "author": "", "article_body": "The labour supply in October 2018 increased by 5.7%, reaching 210,979, in one year.\nCompared to last year, the highest increase in employment (1,816) was brought about by professional, science and technology activities and administrative and support service activities (1,452).\nRegistered full-time employment in the private sector went up by 10,873 persons to 161,663. Public sector full-time employment increased by 1,076 persons to 47,526.\nRegistered part-time employment went up by 4.2% in October 2018 compared to the previous year. The increase in jobs was generated by professional, scientific and technical activities, and arts and entertainment.\nThe number of part-timers who also held a full-time job amounted to 28,030, up by 9.1% when compared to the corresponding month in 2017. Employed persons whose part-time job was their primary occupation totalled 35,103, up by 0.7% when compared to 2017.", "comment_count": 8, "id": 1237}, {"keywords": "", "author": "", "article_body": "Two protected birds were shot just a few hours before the start of the spring hunting season, Birdlife said on Wednesday.\nThe shot yellow-legged gull. Photo: Birdlife\nIt said in a statement that a marsh harrier and a yellow-legged gull were found shot by members of the public at Mġarr and Tas-Safra, respectively.\nBirdlife said the total of illegal hunting casualties for 2019 so far stood at 22.\nIt said that this year’s spring season, was open only for quail and ran between Wednesday and April 30. \nBirdlife said it would  be monitoring the season to report and document the killing of protected species, especially the turtle dove.\nIt prepared a video explaining the evident differences between quail and turtle doves to help the public recognise which were being hunted and enable them to identify any illegal hunting taking place. \nBirdlife asked the public to report incidents of illegal hunting to the police by calling 110 or Birdlife on 2134 7645/6 during office hours or 7925 5697 in the evenings and on weekends. People who spot poachers should try and take photos or videos as evidence, they said. ", "comment_count": 0, "id": 1238}, {"keywords": "", "author": "Claire Caruana, Denise Grech", "article_body": "Updated at 12.11pm with Schiavone comments \nThe Nationalist Party on Tuesday failed to answer questions on whether Kristy Debono would relinquish her role as president of the general council following her meeting with the owner of 17 Black.\nIt was also asked whether Opposition leader Adrian Delia had demanded such a move. The Sunday Times of Malta reported that Ms Debono, together with fellow MP Hermann Schiavone, met Yorgen Fenech last Friday.\nIn a statement on Monday, two days after admitting she had met with Mr Fenech, who is also the CEO of the Tumas Group, seeking a sponsorship, Ms Debono admitted she had made an error of judgement when attending the meeting. She apologised for the “unnecessary controversy”, saying she had no intention of doing anything “secretive”.\nOn his part, Dr Delia said that, while he did not know that two of his closest MPs had met with the businessman, the meeting did not dent the party’s fight against corruption.\nAccording to sources, party grassroots were questioning whether her position as general council president was still tenable in light of the meeting with Mr Fenech. \nStill, the sources added, those close to Dr Delia were objecting to her stepping down.\nMs Debono insisted on Tuesday she was not the one who had set up the meeting with Mr Fenech. The meeting, she insisted, lasted less than an hour.\nPressed to say who had arranged the meeting, the MP declined to say. Sources, however, indicated it was Mr Schiavone who had sought the meeting.\nMs Debono would neither respond to questions regarding the meeting itself or react to comments made by fellow parliamentary group members about the encounter, insisting she had nothing else to explain.\nSources said that during a meeting with Dr Delia, Ms Debono had suggested that the situation had been “blown out of proportion” but that she and Dr Delia agreed, with hindsight, the meeting would be deemed “politically insensitive”.\nDr Delia was “very understanding” of Ms Debono, the sources said, adding he did not exert any pressure for resignations.\n'Issue blown out of proportion' - Schiavone\nMr Schiavone declined to apologise, saying he had \"already said what I had to say\". He said many other delegates had told him that the issue \"was blown out of proportion on purpose\".\nHe insisted a fellow director of Tumas group, whose name he did not divulge, was the one to set up the meeting with Mr Fenech.\nPN leader Adrian Delia was not informed of the meeting, he said, since the party leader is never involved in logistical matters. He confirmed that he had met with Dr Delia in the past days but declined to divulge what was said. \nTimes of Malta and Reuters reported late last year that 17 Black was one of two companies that would pay $2 million to Panama companies set up by Tourism Minister Konrad Mizzi and the Prime Minister’s top aide, Keith Schembri.", "comment_count": 67, "id": 1239}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Plans have been submitted to renourish the tiny sandy beach at St Thomas Bay in Marsascala, replicating a similar project carried out at Balluta Bay last year.\nThe Balluta project, which failed to last the winter after the new beach was entirely swept away by successive storms, was now set to be repeated yearly at a cost of about €80,000, Tourism Minister Konrad Mizzi told Times of Malta.\nA proposal by the Malta Tourism Authority, to be formally published by the Planning Authority today, aims to dramatically increase the size of the sandy beach known as Il-Fajtata at St Thomas Bay.\nThe “pilot experimental project” will use sand found on the seabed within the same bay, the same approach as at Balluta, rather than importing new sand.\nDr Mizzi told Times of Malta on Tuesday the project was part of the MTA’s efforts to improve Malta’s tourism product and specifically to increase the leisure facilities in the south of the island, following similar efforts at Balluta in the north.\nThe Balluta project lasted just seven months.\nAsked whether he considered the project a success worth replicating, given its short lifespan, Dr Mizzi said the cost had been “worthwhile” for people to enjoy the beach during the summer months.\n“The cost and the investment is not massive, so we will be replenishing it or topping it up on a yearly basis,” he said, adding that longer-term solutions were also being considered.\n“Solutions include a reef or wave-breaker of sorts, which would ensure the sand remains but this would require further studies and careful environmental consideration,” he said.\n“On balance, we decided providing a beach for Balluta made sense,” Dr Mizzi added.", "comment_count": 89, "id": 1240}, {"keywords": "", "author": "Ivan Martin", "article_body": "No Maltese had asked to be evacuated from Libya so far, despite fighting that led the government to reassess its options should the fraught situation deteriorate further, Times of Malta was told.\nThere was heavy fighting near Tripoli since the forces of military strongman Khalifa Haftar launched an assault on the capital last Thursday.\nGovernment sources said that, so far, they had received no requests for any form of assistance from the roughly 50 Maltese nationals in the North African country. Should there be any such requests, the authorities would have to look closely at what options were available as the situation in Libya was changing by the day.\nAn air strike on the Libyan capital’s only functioning airport, Mitiga, damaged a runway which was temporarily closed. \nSuch incidents, the government sources said, made things more difficult when getting any Maltese out of Libya should the need suddenly arise.\nAt a meeting of the European Union Foreign Affairs Council in Luxembourg on Monday, Malta’s permanent representative, Daniel Azzopardi, called for EU unity in dealing with the current Libya crisis.\nSituation changing by the day\nMalta is supporting the various calls made by the United Nations and the G7 countries against a military solution.\n“Coordinated international action in Libya is required under the auspices, and in support, of the United Nations. Malta argued with the Security Council it is imperative that the entire international community comes together in full unity to help reinstate and pursue peace and stability in Libya,” Mr Azzopardi said on Tuesday.\nRead: Libya clashes death toll rises to 32\nMalta has also urged European Union member states able to exert pressure to do so in a bid to prevent further escalation of conflict in Libya.\nOn Tuesday, the United Nations decided to postpone a Libyan national conference aimed at drawing up an election roadmap because of fighting raging near the capital.", "comment_count": 4, "id": 1241}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta says no Maltese have asked to be evacuated from Libya so far, despite fighting that led the government to reassess its options should the fraught situation deteriorate further.\nIn another story, the newspaper reports that three judges and three magistrates will be named in the coming weeks, despite repeated promises by the government to change the “outdated system” of appointments.\nIn-Nazzjon says Mater Dei will be welcoming injured people from Libya.\nMaltaToday says that a special committee will be investigating tuna bribery allegations.\nThe Malta Independent says that proposals to regulate lobbying activities will be drawn up by the Commissioner for Standards of Public Life by the end of the year.\nL-Orizzont says €8 million have been invested in Malta Air Traffic services.", "comment_count": 0, "id": 1242}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Environment and Resources Authority did not object to revised designs for the 27-storey Townsquare high-rise in Tigné, after appealing the original approval and forcing the project back to the drawing board.\nIn its final report after a new environmental impact assessment, the regulator acknowledged “significant impacts on dust emissions during excavation and construction as well as on the visual amenity” but concluded that the overall project was not environmentally objectionable.\nThe Townsquare project was narrowly approved by the Planning Authority in 2016 ‒ in a much larger form than that proposed now ‒ amid widespread opposition from residents, the local council and environmental groups.\nThe environment watchdog at the time expressed serious concerns about the visual impact, the effect of construction on residents and other aspects, while, in a written memo, chairman Victor Axiak described the EIA carried out then as a “sham”.\nThe regulator subsequently appealed the decision, as did the local council and NGOs, and the appeals were accepted by the planning tribunal last May, forcing the developers to return with new designs, including an 11-storey reduction and a reconfiguration of the public open space.\nIn its reassessment of the project – published last week and one of the requirements of the appeal decision – the ERA noted that about 70% of the required excavation had already been carried out, reducing the impact on residents.\nRead: Tigné residents’ fears on Townsquare project rise\nDuring construction and finishing, it said, the impacts were still expected to be major.\nWhile it acknowledged the major impact of dust emissions from vehicles, it said these impacts were temporary and “characteristically related to a development of this scale, also taking into account the context of the area”.\nIt said the impact of traffic pollution would be moderate in the short term for residents and pedestrians in the immediate vicinity but insignificant by 2027. \nIt strongly recommended the implementation of a Green Travel Plan –  which the developers have committed to – to offset negative impacts.\nThe regulator again highlighted the project’s major visual impact and said that, given the scale being proposed, the impacts were hard to mitigate.\nThe revised project has still to be assessed by the Planning Directorate, which will issue a recommendation ahead of a final decision by the PA. The developers have argued that the new designs comprehensively address the revisions requested in the appeal decision.\nThey said the 7,500 square metres of open space proposed would become the largest pedestrian zone in Sliema’s town centre.\nWhile retaining the same area as originally proposed, the developers said the space had been reconfigured to include a better flow for pedestrians, substantially more greenery and a landscaped rear garden, all accessible to the public.\nChanges to the tower, they said, would “dramatically reduce” its visual impact.\nThe development will include 159 apartments, retail outlets, a business centre, dining outlets, cafés and underground parking as well as the restoration of the historic Villa Drago.", "comment_count": 67, "id": 1243}, {"keywords": "", "author": "", "article_body": "Twenty-three NGOs have got together to express their deep sadness over the death of an Ivorian migrant, who was shot in Ħal Far over the weekend.\nThe NGOs also sent their wishes to the two other victims of the shooting, saying they hoped for their full recovery without permanent or serious damage.\n\"Whatever the actual reasons for this terrible incident, it affects not only the three victims but the entire migrant community in creating a sense of fear, lack of security and isolation. It also affects us all, a nation jolted by an appalling act of violence,\" they said.\nThey urged Malta’s highest authorities to unequivocally condemn all forms of violence – whatever their motivation.\nRead: Motive in Saturday's murder yet to be established\n\"We caution that, should it emerge that this was in fact a racially-motivated incident, Malta would be called upon to face far more than an act of assault, but far graver crime aimed at instilling terror in entire communities.\"\nLassana Cisse, a 42-year-old man from the Ivory Coast, was shot to death last Saturday night. The motive remains unknown.\n ", "comment_count": 13, "id": 1244}, {"keywords": "", "author": "", "article_body": "Customs has seized another container with €2.7m worth of cocaine, just two days after a 91.2kg haul, bringing the total so far this year to 515.2 kg, worth nearly €58 million.Last year was a record breaker in terms of cocaine hauls, which saw the Customs Department seizing a total of 284.7 kg of cocaine. This year, in just 14 weeks, the Customs Department has nearly doubled this amount\nThe 24 kg of cocaine were seized from another reefer container at the Malta Freeport, after several were scanned by the Customs Container Monitoring Unit.\nThe drugs were found in the refrigerant compressor unit. The container was transhipping in Malta from South America, en-route to Tirana, Albania. Investigations are being carried out by the Police Anti Drug Squad while a magisterial inquiry has been initiated.", "comment_count": 16, "id": 1245}, {"keywords": "", "author": "Luke Scicluna", "article_body": "The PN has filed a motion in an attempt to let the administrative council elections go ahead as originally planned in May.\nA legal notice had indefinitely postponed the elections, scheduled to take place on May 25, 2019, concurrently with local council and European Parliament election\nAdministrative committees are responsible for hamlets such as Burmarrad and Swatar, which fall under the responsibilities of other local councils.\nOpposition MP Robert Cutajar filed the motion, which argued that administrative committees were an integral part of the devolution of powers and were essential for subsidiarity.\nRead: Goodbye, administrative committees? Local council reform proposals unveiled\nHe and other MPs from the Opposition benches argued that the Labour Party had cancelled the elections because it could not find candidates to contest them. However, Labour MP Alex Muscat insisted the Opposition was misrepresenting the legal notice.\nOnly 33 per cent of those eligible had turned out to vote in elections for administrative committees, and some hamlets - such as Bidnija - had not been granted an administrative council.\nDr Muscat said reforms would bind mayors to appoint a local councillor to tend to the affairs of each respective hamlet, leading the administrative committees and representing them with his or her vote on the local council. This would allow a single individual to be identified as the point of contact for each particular hamlet.\nOpposition MP Chris Said said that only 16 hamlets had been identified in the original law, and that others could easily have been added by the government. He pointed out that this was the second time that the Labour Government was postponing elections, referring to the postponement of local council elections to coincide with this year’s MEP elections.\nHe claimed that the intention was ultimately to do away with administrative committees altogether.", "comment_count": 1, "id": 1246}, {"keywords": "", "author": "Ivan Martin", "article_body": "Judge Lorraine Schembri Orland was elected to the European Court of Human Rights following a vote on Tuesday.\nShe was one of three candidates put forward by Malta for the role.\nThe other two final candidates were deputy Attorney General Dr Victoria Buttigieg and Madame Justice Abigail Lofaro. \nShe obtained an absolute majority of votes cast, and will be elected ECHR judge for a term of office of nine years, starting in September. \nMadam Justice Schembri Orland will be the first Maltese woman in history to be elected as ECHR judge. \nShe was first appointed to the bench back in 2012. She currently presides over the Civil Court, First Hall which has civil competence, as well as original jurisdiction in matters of Fundamental Human Rights as guaranteed by the Maltese Constitution and by the European Convention on Human Rights.\n\n\n\nShe also presides over the Civil Court which is competent in matters of probate, minority, interdiction and incapacitation, guardianships, trusts, foundations and cross border successions,\nThe three Maltese candidates for the post were interviewed by the Council of Europe's Election of Judges committee, which eventually recommended her as the most qualified candidate.\nThe next and final step  the plenary vote which took place earlier on Tuesday.\nMadame Justice Schembri Orland concluded her Doctorate of Laws (LL.D.) at the Univeristy of Malta in 1986. In 1996 she concluded her Magister Juris in European Law -(M.Jur.) (Eur. Law) also from the University of Malta.\nBetween 1991 and 1993, she was a member of drafting committee entrusted with broad legislative reforms to the Constitution of Malta.\nPrior to becoming a judge, she had held positions with the European Council of Women, was a member of the National Consultative Committee on Bioethics, was a member of the founding committee of San Blas Drug Rehabilitation Centre set up by Caritas (Malta), and others.", "comment_count": 15, "id": 1247}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Tourism Minister Konrad Mizzi laid out his ambition for Malta International Airport to equal the capacity of London Gatwick, as he announced an €8 million air traffic control upgrade.Dr Mizzi said on Tuesday that Malta Industrial Parks, a government entity, was in the process of drawing up a new master plan for the airport and the surrounding industry cluster, which he said would contribute to significantly improving capacity.While the airport’s runways were sufficient, he said, further investment was required in taxiways and other infrastructure.\n\n\n\nThe minister noted that planning permission was already in hand for an overhaul of the car park area, while further plans were in place to upgrade the terminal building and add parking facilities for seven more aircraft, upping the airport’s hourly capacity.Speaking after a visit to Malta Air Traffic Services, a government entity which handles all traffic management in the country’s air space, Dr Mizzi said the €8 million investment had updated and improved the technical systems available to controllers.Upgrading of the runway management systems had already yielded fruit, he added, allowing the runway to continue functioning during the historic storm last February.", "comment_count": 93, "id": 1248}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg", "article_body": "Migrants who forced a merchant vessel to head to Europe had not threatened or attacked its crew, the ship’s chief engineer testified on Tuesday, raising questions about whether vessel had genuinely been hijacked.\nIn a marathon session stretching throughout the day, the court heard the engineer explain how crew members of the El Hiblu 1 locked themselves in the ship’s bridge when migrants they had rescued grew restless and suspected they had been misled.\n“They were ready to die. They were not thinking about themselves so they thought much less about us,” he said.\nAs the witness struggled to summarise the experience, the magistrate stepped in.\n“So you felt overpowered,” he suggested.  \nThe engineer initially appeared to admit that the crew had misled the rescued migrants, telling magistrate Aaron Bugeja “yes, we tricked them”.\nMinutes later, he took that back.\n“No, we didn’t trick them. It wasn’t our fault vessels did not show up to collect them as planned”.\nThree young men charged\nThe El Hiblu 1 entered Malta on March 28 after Armed Forces members boarded the ship as it neared Maltese waters, following reports that migrants had seized control of the vessel and forced it to head to Europe.\nFive people were subsequently arrested by Maltese police and three of those, teenagers aged 15, 16 and 19, have been charged with crimes amounting to terrorist activity.\nThe engineer’s testimony prompted a series of stern questions from magistrate Aaron Bugeja, who asked why the ship’s captain had claimed he had injured crew members on board.\nReading from transcripts of conversations between the captain of the El Hiblu 1 and AFM officials, the magistrate noted how the ship’s captain had told local officials that “I have crew injured on board. Many people fight with me because I did not want to come to Malta. They broke my vessel”.\n‘Tricked’\nIn his testimony, the ship’s engineer said that the El Hiblu 1 had picked up the 100-odd migrants after receiving instructions to come to their rescue by authorities in Rome.\nSome of the migrants being rescued had initially refused to board the ship, fearing they would be returned to Libya.\nThe El Hiblu 1’s first officer had promised them that would not happen, and they had recanted. The ship had set sail for a rescue point where it expected to transfer the rescued migrants to another ship. No ship had arrived at that point, and the El Hiblu 1 had promptly veered towards Libya while the migrants slept on deck.\nRead: Teenagers charged with terrorist activity in ship hijacking case\nWhen the sun rose the following morning and the migrants spotted Libya’s coast in the distance, tensions had escalated.\nAround 15 of the migrants started banging on the bridge with spanners and metal pipes they found on the deck, the engineer recalled, with the ship’s first officer eventually letting three of them in to talk.\nTwo of the three, who the ship’s engineer engineer identified as two of the accused, had ordered the crew to head to Europe and threatened to cause damage if they were followed by Libyan vessels or planes.\nThey had also ordered the crew not to speak among themselves in Arabic or to contact port authorities in Libya.  \nHead to Europe, they had told him.\nThe El Hiblu 1 was running low on fuel, the engineer recalled.\n“I took one of the men down to the engine room to show him we did not have enough fuel to make it to Europe,” he testified. But the hijacker was having none of that. Fuel or no fuel, he said, they would be going to Europe.\nA migrant and her child disembark the vessel. Photo: Jonathan Borg\nWith that settled, the three interlocutors had told the migrants outside the bridge to calm down.\nThe vessel approached Malta at around 3am on March 28. Maltese authorities, he recalled, had instructed the crew to place migrants on the port side of the vessel. The three teens charged as ringleaders remained inside the bridge.\nEarlier in the day, the court heard testimony from police inspectors roped in on the case once the El Hiblu 1 had docked as well as AFM witnesses who told the court that the ship's captain had clearly and repeatedly told authorities \"my vessel under piracy\". \nThe owner of the El Hiblu 1 told the court that he had had the vessel built from scratch in 2015. \nThe ship had been dry docked in Turkey and was headed to Tripoli, he said.\nThe case continues on Wednesday. ", "comment_count": 0, "id": 1249}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Planning Authority has received more than 2,600 objections, including that of the Żebbuġ local council, to the proposed 11-storey tower on the site of the Toyota showroom.\nThe massive project, which mayor Sarah Agius Saliba described as a “monster”, would be more than twice the height of the tallest buildings in Żebbuġ, which are usually limited to five floors.\nThe project is being proposed by Rohan Arch Limited, a company owned jointly by Michael and Geoffrey Debono, which was incorporated in February 2018 and registered on the Toyota showroom address in Mdina Road.\nThe site on which the company is proposing to develop the massive project stretches across three roads: Triq l-Imdina, Triq Ġanni Bonnici and Triq is-Siġġiewi.\nAccording to documents filed with the Planning Authority, the developers are proposing the demolition of existing buildings, currently housing the Toyota showroom, the parts section and the body repair centre, and excavation for three levels of parking, the construction of a parking area and a “medium-rise building” for commercial and office space.\nEffects on residents will be devastating\nThe project in Żebbuġ is expected to include restaurants and retail outlets at ground level, with the overlying nine floors and a receded penthouse at the top level, all earmarked for office space. A separate five-storey block, being proposed on Triq is-Siġġiewi, will include a 1,200-square-metre supermarket at ground level with medical facilities above.\nObjectors told the Planning Authority in their representations that the proposed project jarred with its surroundings and that its effects on residents and the environment would be devastating.\nThey said the project went against a number of existing planning policies, including the Strategic Plan for Environment and Development. Also, the proposed development was incompatible with the urban design and environmental characteristics of the urban conservation area and would not maintain the visual integrity of the area, the objectors argued.\nThey said the project would significantly change the character of Żebbuġ and cause a domino effect with further development.\n“The proximity of the proposed tower, just metres from residential houses, will have a very negative effect on the basic quality of life of these residents, blocking the sun, increasing air and noise pollution dramatically and causing severe traffic congestion that reaches gridlock not only during so-called peak hours,” the objectors continued.\nThey said the project completely ignored the extent of the negative effect on the quality of life of the residents in the surrounding area.\n“The daily life of Żebbuġ residents will be permanently sacrificed,” they remarked.", "comment_count": 39, "id": 1250}, {"keywords": "", "author": "Ivan Martin", "article_body": "Maltese tuna fishers had their catch quota increased in an “unprecedented” move announced by the Fisheries Parliamentary Secretary on Tuesday.\nMalta’s national catch quota for the upcoming 2019 tuna fishing season will be 353 tonnes, an increase of 34 tonnes over the amount legally caught in 2018.\nThe quota was announced at a press conference at Marsaxlokk, an event that was heavily attended by local fishers.\nClint Camilleri said that in previous years the entire fishing quota was shared among large operators that were set up to catch blue fin tuna.\nThis year, however, the authorities have come out with a system that will see 63 of the large operators allowed to catch 299 tonnes, and another 52 operators with boats no longer than 12 metres, allowed to catch an additional 40.5 tonnes.\nThis is the first time that smaller operators will legally fish for blue fin tuna.\nFisheries Parliamentary Secretary Clint Camilleri announced the tuna quota on Tuesday\nClaire Abela, a senior fisheries protection officer explained that the 52 smaller operators would need to have caught at least 400 kilos of swordfish last year to qualify for the tuna quota.\nAn additional nine tonnes have been allotted as by-catch, and two tonnes have also been allotted for recreational fishing.\nMr Camilleri said the new quota system was geared towards facilitating the operations of larger fishers, while also encouraging smaller operators to enter the game.\nTuna farms to face harsher enforcement\nMeanwhile, a spokesman for the Environment Ministry told Times of Malta that efforts were under way to increase enforcement measures on the tuna ranching industry.\nMaltese tuna farming was thrust into the international spotlight after an international investigation found that it was at the centre of an EU-wide black market operation.\nRead: How the Tuna racket operated\nThe months-long investigation by Spanish authorities, dubbed 'Operation Tarantelo', overseen by Europol, uncovered a network of shell companies and distributors that have allegedly been funnelling illegal tuna catches from Maltese waters and Malta-based fish farms to Spain via Italy and France.\nA network of 79 individuals – none Maltese – have been arrested, and more than 80,000 kilos of illicit bluefin tuna were seized.\nSpeaking form the sidelines of Tuesday’s press conference, the spokesman said that controlled transfers of tuna farmed in Malta would be increased to weed out abuse.\nThese transfers see the large fish moved from one pen to another by a team of professional divers who then count the fish to ensure that illegally caught tuna is not being fattened along with regular catches.\nMr Camilleri, on the other hand, was reluctant to get into the details of the alleged racket its aftermath, saying that magisterial inquiries were establishing the facts.\nHe did say, however, that a new committee had been set up, tasked with implementing the recommendations of a number of shelved reports into the industry, including an audit by the Auditor General.", "comment_count": 10, "id": 1251}, {"keywords": "", "author": "", "article_body": "Sirens in St Paul’s Bay will finally be getting a pool, thanks to a €2.2 million investment from the Planning Authority’s Development Planning Fund.\nThe project at the aquatics club will include changing rooms, toilets, spectator stands and other facilities of this kind, and will also extend use of the site underground with the inclusion of a gym and a diving centre.\nThe project is one of 22 different projects in 13 localities in Malta and Gozo, which will be receiving €4 million in all.\nInfrastructure Minister Ian Borg said on Tuesday that councils were coming forward to suggest projects for the fund, with 84 having been financed over the past two years.", "comment_count": 6, "id": 1252}, {"keywords": "", "author": "", "article_body": "The newly formed Anti-Money Laundering Team has once again seized undeclared cash at the Malta International Airport, after carrying out searches targetting 'high risk flights'.\nCustoms Officials from the Anti-Money Laundering Team stopped a Georgian national, leaving to Istanbul, with eventual searches of his belongings turning up €35,000 in several denominations and currencies were taken from him.€25,000 - the excess over the legal amount that can be carried without declaration - were seized pending investigation, while the passenger was placed under arrest by the Police Anti-Money Laundering Section.Last year was a historical year for Customs not only in its results in their Anti-Money Laundering operations, but also in its narcotics seizures.", "comment_count": 4, "id": 1253}, {"keywords": "", "author": "", "article_body": "A Gozitan computer supplier has been named and shamed by the Consumer Affairs Directorate after he failed to honour the decision of the Consumer Claims Tribunal.\nA consumer had complained to the tribunal after buying computer parts from Reboot in Gozo, which turned out to be faulty. It transpired that there was a problem with the motherboard, which was eventually replaced by a used one which was not strong enough for the computer.\nThe consumer won the claim, and the trader was ordered to refund her with the price of the motherboard. However, the trader wanted a declaration that the woman would not file any future claims against him. As it happens, new faults developed which affected other parts of the computer.\nWhen the trader failed to answer letters about these new faults, the consumer decided to go to another establishment to fix the defective computer.\nThe computer’s video card had to be replaced and she was also asked to pay for the inspection and cleaning services. This cost €784.Justin Buttigieg, the defendant, stated that in his view, the original video card he had sold to the consumer was not faulty and that he could not honour the guarantee since the consumer and her son went to another shop.\nHowever, the Tribunal gave more credence to the consumer’s version, and ordered Mr Buttigieg to refund the consumer the sum of €784 with costs.", "comment_count": 0, "id": 1254}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man arrested in an anti-drugs operation preceding the arrest of drug lord Jordan Azzopardi has been remanded in custody after pleading not guilty to drug-related charges in court on Tuesday.\nRamirez Vella, a 20-year-old Tarxien man, was arraigned under arrest and charged with procuring cocaine and heroin and committing the offences within 100 metres of a school.\nMr Vella was one of the people arrested late on March 7, when a coordinated police operation saw a house on Mountbatten Street raided.\nThere, officers found drugs and cash. The police had later revealed how people inside the house had tried to destroy evidence by throwing sachets of drugs in acid.\nMr Vella, one of those occupants, pleaded not guilty and chose not to answer when asked what he did for a living.\nNo request for bail was made at this stage and the court, presided over by magistrate Monica Vella, remanded the young man in custody.\nToday’s arraignment came in the wake of police investigations which followed the raid and which, backed by forensic testing, led the police to gather sufficient evidence to press charges against the young man.\nInspector Mark Anthony Mercieca prosecuted. Lawyers Arthur Azzopardi and Alfred Abela were defence counsel.", "comment_count": 0, "id": 1255}, {"keywords": "", "author": "", "article_body": "Updated at 2.20pm\nA woman needing urgent medical attention was evacuated from a humanitarian vessel stranded off Malta, the government said on Tuesday.\nIn a brief statement, the government said the medical evacuation was conducted by the Armed Forces of Malta.\nThe woman, who is understood to have been travelling alone, was extremely weak and complained of dizziness, drifting in and out of consciousness.\nMaltese authorities reacted \"promptly and professionally,\" to the evacuation request, NGO Sea-Eye said in a statement. \nThe Alan Kurdi, with 81 people aboard, 64 of whom were rescued off war-torn Libya, is currently in international waters outside Malta but has asked the country for permission to seek shelter from inclement weather. It has not received a reply to that request. \nMeanwhile, the Maltese government has agreed to supply the ship with food and water on Wednesday, following an urgent appeal by crew members who say supplies are running perilously low.\nRead: 'Please help us,' NGO asks Malta after Salvini 'humiliates' migrants\n\"We need supplies by Wednesday at the very latest,\" a Sea-Eye spokeswoman had said earlier on Tuesday afternoon. \"Supplies are about to run out\". \nThe Alan Kurdi headed towards Malta on Saturday after it was refused entry to Lampedusa. \nBoth Italy and Malta have refused it a safe harbour, leaving the migrants sleeping in cramped conditions on the ship's deck, exposed to the elements. \n\"They freeze, they get wet again and again and of course no one has [other] clothes with them,\" said operations manager Jan Ribbeck. \nThe European Commission has urged EU member states to find a solution to the impasse so that the migrants may disembark safely.\nMeanwhile, people aboard the ship remain none the wiser and the Sea-Eye board has said it is \"growing angry\" about the blockade. \n\"It cannot be that people here and then collapse and have to be picked up individually,\" Mr Ribbeck said. ", "comment_count": 0, "id": 1256}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Human ashes will only be allowed to be scattered at sea or from aircraft under the finalised cremation law set to be brought before Parliament in the coming days.The law, details of which were announced on Tuesday, will prohibit the scattering of ashes in swimming areas or public places, although an open space will be designated for the practice.Ashes will also be allowed to be spread on private property, while sealed urns can be stored on private property, buried in graves or held in columbaria, public storage structures, usually in cemeteries.Urns containing the ashes of significant individuals will also be permitted to be held in museums or similar public locations. Commercialisation of sealed urns, such as buying or selling, will be prohibited.Malta has so far not permitted any form of human cremation, despite repeated calls for alternatives to traditional burial.\nA new law to regulate the practice, piloted by Labour MP Rosianne Cutajar, was announced late last year and published for consultation in February.Ms Cutajar said on Tuesday the proposed regulations had already undergone changes since the close of public consultation on March 9 and could be altered further as it makes its way through Parliament.The proposed law, she said, included standards for crematoria. \nIt also allowed for deceased individuals who had already been buried to be exhumed and their remains cremated, as well as the cremation of body parts.Mothers could be cremated together with their children if both died during childbirth, as could twins or triplets who were stillborn together.\nHealth minister Chris Fearne said the law would lay down clear conditions for operators to obtain a license from the Superintendence for Public Health, which obliged to inspect and ensure compliance with the regulations.Operators will be required to keep a detailed register of the processes used and individuals cremated.Malta is the only country in Europe with no law on cremation, leading several people every year to seek such a service abroad, according to the government has said. Expenses, including freight, can reach up to €5,500.Ms Cutajar has said public research showed that a third of the population wanted an alternative to traditional burial. Cremation, she has argued, has the least negative impact on the environment and gives relatives the opportunity to retain a memento of their loved ones, as well as costing much less than traditional burial.", "comment_count": 73, "id": 1257}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The carer who allegedly raped a young lady working as a cleaner at a home for the elderly was remanded in custody after denying the criminal allegations in court.\nSandesha Shetty, the 31-year old Indian national, residing at Rabat and employed as carer at the residential home where the abuse took place on Sunday morning at around 10am, was taken to court under arrest on Tuesday.\nThe man pleaded not guilty to having engaged in non-consensual sexual acts with the female member of staff, holding her against her will while subjecting her to acts bearing sexual connotations, amounting to offensive, humiliating, degrading or intimidating towards his alleged victim.\nProsecuting Inspector John Spiteri explained how on April 7 the alleged victim had filed a report, claiming to have been raped by a colleague at her workplace.\nThe woman had said that the incident had taken place while she was cleaning a room at the residential home. She said her aggressor entered the room and with her back turned upon him, he had crept up, grabbed her and forced himself upon her.\nThe whole incident lasted a minute, the woman explained.\nThe man had gone away to grab a sandwich, returning a while later to continue where he had left off but had been halted in his tracks by the presence of third parties who had since entered the room.\nThe woman had first relayed her ordeal to her boyfriend and had subsequently filed a police report.\nA medical examination of the woman had confirmed the rape, the court heard.\nThe alleged aggressor denied the charges and was remanded in custody since no request for bail was made during his arraignment.\nThe court, presided over by magistrate Monica Vella, banned publication of the name of the victim as well as of the home where the alleged abuse took place.\nInspectors John Spiteri and Stacy Attard prosecuted. Lawyers Franco Debono and Amadeus Cachia were defence counsel. Lawyers Arthur Azzopardi and Alfred Abela appeared parte civile.", "comment_count": 0, "id": 1258}, {"keywords": "", "author": "Jacob Borg", "article_body": "Justice Minister Owen Bonnici on Tuesday defended his “reformist government’s” track record during a hearing about Daphne Caruana Galizia’s assassination in the Council of Europe.\nDr Bonnici and Attorney General Peter Grech faced questions about the lack of progress in identifying the mastermind behind her murder, as well as inaction against top officials facing corruption claims.\nThe Justice Minister told the assembly that while he disagreed with Ms Caruana Galizia’s style of writing, this in no way impinged on the quest for justice when it came to her murder. \nTurning the tables on PN MP Jason Azzopardi, who had questioned the minister’s political responsibility for creating an environment of hate against the assassinated journalist, Dr Bonnici pointed out that Dr Azzopardi’s party leader Adrian Delia had called Ms Caruana Galizia a “worthless blogger”.\nDutch MP Pieter Omtzigt questioned why the government insisted on erasing the journalist’s memory by removing candles and flowers placed at a makeshift memorial in Valletta.\nHe said that while 10 people had been arrested, the three triggermen charged had not yet been brought to trial and the ringleaders behind the assassination were still at large.\nDr Bonnici replied that the government had not stopped anyone from placing candles and flowers by the Great Siege monument.\n‘Monument by Malta’s best talent damaged’\nHe explained that the monument by Antonio Sciortino, one of Malta’s “best talents”, had suffered damage from the candles and flowers and needed to be restored.\nAfter restoration, people were once again free to hold activities at the memorial, but all candles and flowers were removed “once the activity ended”.\nCandles and flowers laid at the monument are regularly removed. Photo: Chris Sant Fournier\nDescribing Ms Caruana Galizia’s murder as a blot on Malta, the Justice Minister assured that tracking down the mastermind behind the murder was a priority.\n“This is not Malta. Malta is not this. Malta is much better than this”, he said.\nThe Dutch MP, who is drawing up a report for the Council of Europe about the murder, questioned why Malta’s institutions never seemed to act on corruption cases involving politicians.\nDr Bonnici said that such cases had been investigated and the Egrant inquiry had exonerated the Prime Minister from any wrongdoing.\nThe Justice Minister insisted that the main conclusions from this inquiry had been published and showed that someone tried to frame Prime Minister Joseph Muscat and his family.\nHe said an appeal against an inquiry into the Panama scandal had been dismissed on a “technical issue”, as inadequate evidence had been provided to show such an inquiry was necessary.\nAttorney General questioned\nDuring the hearing, Attorney General Peter Grech refused to say if Maltese authorities had asked the United Arab Emirates for legal assistance.\nThe UAE, which is notorious for not cooperating with foreign jurisdictions, was where Tumas Group CEO Yorgen Fenech set up his shell company 17 Black.\nA leaked e-mail from the Panama Papers showed how the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi planned to received up to $2 million from 17 Black through secretive offshore structures that had not been declared to the tax authorities.\nDr Grech said the fact that he could not provide any information to respect the integrity of investigations did not mean that nothing was being done. Dr Bonnici answers questions at the Council of Europe. Photo: Facebook/Owen Bonnici\nDuring the hearing, the Attorney General set out a number of legal arguments as to why a parallel public inquiry into the journalist’s death was not a requirement.\nThe Caruana Galizia family has repeatedly called for an independent public inquiry to look into the murder and establish whether the government had done everything it could to prevent it. \nDr Grech said the inquiring magistrate had broad powers to follow the evidence wherever it took him. He clarified that this did not mean a public inquiry would not be appropriate at some stage.\nThe Attorney General said the fact that three people had been charged did not mean that the magisterial inquiry was over.\n‘A reformist government’ \nDr Bonnici told the COE that Malta’s \"reformist government\" had introduced a raft of changes to the country’s legal system.\nThe Justice Minister said the government had removed time-barring on political corruption, introduced whistleblower protection and regulated party financing.\nDr Bonnici said the justice system had been furthered reformed in 2016 by strengthening its independence, making judicial appointments more transparent and improving the conditions of the judiciary.\nHe said the government had removed criminal libel and introduced what he described as “anti-SLAPP measures” by ensuring that only one libel case per story could be filed.\nThe Justice Minister said the government was committed to further reforms.\nHe said no stone would be left unturned to solve Ms Caruana Galizia’s “horrendous murder”.\nDr Bonnici said top investigative agencies had been involved in the investigation and the magisterial inquiry’s ultimate aim was identifying all those involved in the assassination.\nWork on Venice Commission reforms ongoing\nOn the Venice Commission’s suggestions to strengthen Malta’s rule of law, Dr Bonnici said the government had formally announced it had kick-started the legal process to carry out these reforms.\nDecoupling of the Attorney General’s role as both legal advisor to the government and prosecutor as well as reforms to judicial appointments were being given top priority, he said.\nDr Bonnici did not directly reply to a question asking if further judicial appointments would be postponed until these reforms were implemented.\nHe said many of the reforms required Constitutional amendments requiring the Opposition’s assent.\nThe Justice Minister admitted last week that the new public prosecutor would be a government appointee.", "comment_count": 67, "id": 1259}, {"keywords": "", "author": "Sarah Carabott", "article_body": "May Malimi exposes his scars across his body - from the back of his head, down to his shoulder, knee and foot. Pointing to his shoulder and a laceration in his knee, he said the pain still persists. Photo: Chris Sant Fournier\nThe 17-year-old from Chad was hit by a car and left unconscious on the side of Triq il-Ġebel with a fractured collarbone. He was found a few hours later “in a pool of blood” by two Somali men, who took him to the Ħal-Far centre and asked for an ambulance.\nMr Malimi's incident happened on a Friday night in February but only came to light after a migrant was killed and another two injured in a shooting on that same road last Saturday night.\nLassana Cisse, a 42-year-old man from the Ivory Coast, was shot to death at around 11pm. The shooter remains at large.\nSources said Saturday's three victims were found spread out across the country lane often used by migrants walking to and from the open centre in Ħal Far.\nMr Malimi no longer frequents Triq il-Ġebel, and neither do others after hearing about fellow migrants who were pelted with rocks, taunted and threatened or even hit by cars. Mr Malimi’s hit-and-run is not the first of the sort, he said.\nPhoto: Chris Sant Fournier\nNever questioned by authorities\nAccording to his medical report, which flags the diagnosis as a \"motor vehicle accident\", Mr Malimi was admitted to Mater Dei's emergency department after being hit by a car while walking. \nHe does not know whether the hospital alerted the police about the incident, and he was never questioned or contacted by the authorities. He spent four days in hospital.\nMr Malimi told Times of Malta that he did not remember the make of the car, as he was hit from the back and pushed to the ground. He was walking by the side of the road, headed to the open centre at around 8pm after getting off a bus in Birżebbuġa.\nNegmeldin Soliman, who was translating on behalf of Mr Malimi, said that the young man’s fears were reiterated by others within the community.\nA sense of helplessness\nOne of the Somali men who helped out Mr Malimi noted that a similar hit-and-run had taken place on that same road.\n“If people continue to be let off scot free and no action is taken they will continue repeating such incidents and coming after migrants,” he said.\nMr Soliman added that Mr Malimi often questioned whether the authorities were following up these incidents, while people at the open centre were feeling helpless.\n“They are wondering what they could do about their own safety, but they do not really have many options when it comes to commuting.\n“They need to be reassured that measures will be put in place to ensure their safety on the road. They are very scared.\"\nYunus Berndt lays flowers at the site where Photo: Chris Sant Fournier\nConcern was also expressed by the Ħal-Far Outreach NGO, which on Monday lit up candles and laid flowers at the site where Mr Cisse was found dead, in a bid to keep his memory alive.\nYunus Berndt, from the NGO said Mr Cisse’s murder shook the community. \nThough speculation is mounting over the motive behind the murder, the police are still in the early stages of investigations. They are believed to be looking for a white Toyota Starlet, which witnesses said was used in the shooting. \nThe police are also believed to be looking into the backgrounds of each of the three victims to try to establish any possible connection with the shooter. ", "comment_count": 0, "id": 1260}, {"keywords": "", "author": "", "article_body": "A Google search and verification workshop themed around the EU elections is being hosted in Malta next month.\nThe seminar is open to media specialists, students and anyone operating with social media. The workshop will cover verification, data visualisation, advanced search techniques and how to find and use real-time search data in your stories.\nIt is themed around the upcoming MEP elections, although the tips and tools can apply to any beat.\nPresented by Abigail Edge, Google News Lab's Teaching Fellow for the UK and Ireland, the event is organised by Google, Times of Malta and the University of Malta’s Faculty of Media and Knowledge Sciences.\nThe event will be held at the University of Malta's Faculty of Media and Knowledge Sciences on Thursday, May 2 at 2pm. Light refreshments will also be provided.\nThe Google News Initiative is the social media giant's effort to work with the news industry to help journalism thrive in the digital age.\nMs Edge has reported for The Guardian and BBC News and is currently working on her first book.\nTo book a place send an e-mail to daniela.said@timesofmalta.com by not later than April 18. Booking is on a first-come, first-served basis.", "comment_count": 0, "id": 1261}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Former Central Bank deputy governor Alfred Mifsud has been appointed consultant to Foreign Affairs Minister Carmelo Abela, Times of Malta is informed.\nA consultancy contract, issued through a direct order, was signed between the government and Mr Mifsud, a former chairman of Labour’s TV station, last December 27, providing for a monthly remuneration of €1,500, excluding VAT, according to sources close to the Foreign Affairs Ministry.\nThe sources said it was not yet clear what kind of consultancy was Mr Mifsud providing, adding he had not yet been spotted at the ministry’s office in Valletta.\nThe ministry was asked for a copy of the contract and what kind of advice was Mr Mifsud giving but the questions remained unanswered.\nIt is not yet clear what kind of consultancy is Alfred Mifsud providing\nA request for a copy of the contract was also made under the Freedom of Information Act but it was declined by the government on grounds that it was not in the public interest. The ministry had previously asked for an extension to react to the newspaper’s request, stating it needed more time to consult with Mr Mifsud on whether his contract was to be divulged.\n“The contract for service with the Ministry for Foreign Affairs and Trade Promotion is for services which are not regarded as within top management roles, hence, the contract is not being disclosed in view that the public interest does not outweigh data protection considerations,” the ministry said.\nTimes of Malta has now asked the Data Protection Commissioner to look into the matter.\nMr Mifsud had been given the appointment at the Central Bank soon after he had sold his private business, Crystal Finance, in 2015.\nHe was touted to succeed Josef Bonnici whose term as governor ended in 2016 but Mr Mifsud pulled out following allegations by his former partner of impropriety when he was chairman of Mid-Med Bank (now HSBC) between 1996 and 1998. Mr Mifsud denied the allegations.\n ", "comment_count": 42, "id": 1262}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Prime Minister distanced himself from a recent controversial promotion at the Lands Authority with a spokesman saying he did not involve himself in its “day-to-day matters”.\nTimes of Malta reported last week that Carmel Camilleri, a former director for estate management at the now-defunct Lands Department, was appointed acting chief officer at the Lands Authority responsible for the same department he used to manage before the infamous Marco Gaffarena property scandal.\nThe newspaper was told the promotion was made by CEO James Piscopo and approved by the board of governors despite the Auditor General having named Mr Camilleri as one of the protagonists in the scandal that had led to the resignation of then planning parliamentary secretary Michael Falzon.\nWhen the Auditor General had published his findings, Joseph Muscat had said during a press conference that Dr Falzon and Mr Camilleri had resigned, adding the government would not tolerate any wrongdoing.\nDr Falzon became Family Minister.\nFollowing Mr Camilleri’s appointment, Dr Muscat was asked for his opinion but no reply was forthcoming. A spokesman curtly said: “The Prime Minister does not deal in any way with the day-to-day matters of the Lands Authority.”\nQuestions sent to both Lands Authority chairman, Judge Lino Farrugia Sacco, and Mr Camilleri remain unanswered.\nIn a letter to Times of Malta last week, Mr Camilleri said among other things he had always done his job “loyally and diligently” along the years and would continue to discharge his duties responsibly.\nIn a sworn statement in reaction to the Auditor General’s findings, Mr Camilleri had said he had acted the way he did because he felt threatened and under pressure by Mr Gaffarena and a liaison officer representing Dr Falzon.\nHe said that before he was interviewed by the Audit Office he had been warned by Clint Scerri, described as Dr Falzon’s representative, not to mention Dr Falzon to the investigators.\n“This is why I didn’t say everything because I felt threatened and thought that if I said what Clint (Scerri) used to do I would have ended up in trouble with my bosses,” Mr Camilleri had said.\nTimes of Malta has so far failed to establish when did Mr Camilleri return to the Lands Authority after his resignation in 2016, on whose instructions was he engaged and in which position. Both Judge Farrugia Sacco and Mr Piscopo failed to tell when asked.\nThe National Audit Office had established that Mr Gaffarena had acquired €3.4 million in land and cash from the government for the expropriation of half a building in Valletta valued at €900,000.\nMr Camilleri was singled out as one of the main trio of participants that led to “irregularities” in clear breach of the fundamental principles of good governance, transparency and fairness. The other two were Dr Falzon and then director general Ray Camilleri.\nLands Authority sources said Mr Camilleri was promoted without a call for application.\n“Lands Authority officials who were never found of having acted incorrectly were not even given the opportunity to apply for this promotion,” the sources noted.", "comment_count": 50, "id": 1263}, {"keywords": "", "author": "Keith Micallef", "article_body": "The energy regulator is refusing to disclose the results of tests carried out in the wake of last month’s gas-related incidents, saying the checks on gas supply equipment had already been in place before the incidents happened.\nThe tests had been announced in a joint statement issued on March 6 by the Regulator for Energy and Water Services and the Malta Competition and Consumer Affairs Authority.\nThe two watchdogs had pronounced themselves following safety concerns raised by the death of a 70-year-old man in a fire that started from a gas heater at his Msida residence.\nDuring the same period, a 48-year-old man suffered grievous injuries in a fire at his home in Paola, while a commercial establishment in Qawra had to be evacuated, also due to a fire.\nIn their joint press release, the two regulators had notified the public that they had launched their own investigations, while noting that the three incidents seemed to be unrelated.\nThey had also announced that a number of checks were being carried out on gas supply equipment and systems, namely regulators and gas cylinders. Such procedure included inspections to establish if the product had undertaken all necessary compliance checks in line with EU legislation. Furthermore, these tests had to be backed up with physical product testing in an accredited laboratory.\nThe statement read that these tests were usually available in 15 days, subject to the availability of the laboratories.\nA number of checks are being carried out on gas supply equipment\nApart from these checks, it had also been announced that inspections for structural integrity and leaks in gas cylinders would also be carried out.\n“Additional checks will be carried out with immediate effect both on the quality controls being carried out in the filling plants and on the safety of the cylinders being placed on the market,” the two regulators had said.\nThree weeks down the line Times of Malta enquired with the Regulator for Energy and Water Services on the outcome of this exercise and if any recommendations had been made to improve safety. However, a spokeswoman declined to give any details.\nShe insisted that the process described in the press release was a mechanism which had been in place as required by law and that such measures were not taken in reaction to recent reports of incidents. \nAs for the cause of the three incidents which fuelled the concerns, it was pointed out that the one which resulted in a fatality was the subject of a magisterial inquiry and consequently the regulator declined to comment.\nAs for the other two cases the spokeswoman said that no further action was required after it transpired that both gas cylinders were found to be in order.\nThe regulator said it was advisable to ensure that domestic gas regulators were compliant with EN16129 standard and that the equipment, including the gas pipes, were replaced when due, as directed by the manufacturer.", "comment_count": 18, "id": 1264}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says the man accused of murdering his mother and sister had planned the crime down to the very last detail, building his own makeshift gun and buying a pressure washer to clean up the mess. In another story, it says the unidentified shooter who killed a man and injured two others on Saturday night used a semi-automatic pistol but it is still too early to be certain of the motive.\nThe Malta Independent quotes Kristy Debono and Hermann Schiavone saying that they did not set up the meeting with the owner of 17 Black.\nIn-Nazzjon says that Air Malta has debts with Enemed and other entities.\nL-Orizzont says that women in politics have been at an imbalance for the past 70 years.", "comment_count": 0, "id": 1265}, {"keywords": "", "author": "Ivan Martin", "article_body": "The unidentified shooter who killed a man and injured two others on Saturday night used a semi-automatic pistol, according to sources close to the investigators who say it is still too early to be certain of the motive.\nYunus Berndt, from the Ħal-Far Outreach NGO, places a flower at the roadside memorial for Lassana Cisse, 42, killed on Saturday night in Birżebbuġa. Photo: Chris Sant Fournier\nThe incident happened in Triq Tal-Ġebel, a country lane between Birżebbuġa and the Ħal-Far open centre, at about 11pm.\nAll three victims are migrants who were walking along the quiet rural road when they were shot at by a person in a white Toyota Starlet.\nThe sources on Monday told Times of Malta the motive had yet to be established, however, they did not exclude that this could have been a racial hate crime, noting that this was a main avenue being followed.\nRead: Scene of migrant murder is hotspot for racial attacks\nGiven the dense migrant population in the area where the incident occurred, investigators’ “first instinct” on learning of the incident was to suspect it could have been linked to racial hatred, the sources said.\n“That said, at this early stage, they cannot exclude that there may have been some other motive, which is not yet clear,” the sources were quick to add.\nThey said that though the police had not yet established the identity of the shooter, they were working on some promising leads as well as combing through CCTV footage taken from cameras in the neighbourhood.\nThe deceased, Lassana Cisse, a 42-year-old man from the Ivory Coast, was described by those who knew him as a quiet fellow, who kept to himself.\nOne of the injured is a 22-year-old resident at the Ħal-Far centre and the other is 45-years-old.", "comment_count": 0, "id": 1266}, {"keywords": "", "author": "Keith Micallef", "article_body": "Rather than help the competition watchdog to get its teeth back after three years in limbo, a recently-tabled draft law would only serve to make it ineffective, the consumers’ association warned.\nThe long-term solution should be to amend the Constitution so that public authorities could take remedial action while safeguarding the right to a fair hearing of anyone allegedly committing a breach, it said.\nThe association was commenting in a statement following the latest development in the Competition Office saga, which has been dragging on since May 2016. Then, a Court of Appeal had upheld a previous judgment ruling that certain provisions of the Competition Act were unconstitutional.\nThe case had been instituted by the Federation of Estate Agents, which had felt aggrieved by the decision of the Director for Competition to proceed against it over alleged breaches of the law. The federation argued that only a proper court could deliver a decision on the matter given that, in case of ‘guilt’, it could be fined up to €1.25 million.\nWatchdog would resort to the courts in all cases\nSubsequently, the director of competition within the Malta Competition and Consumer Affairs Authority refrained from imposing fines.\nOn its part, the government had initially tried to make amends by changing the Constitution but the Opposition would not play ball. Subsequently, it opted to change the Competition Act and the Bill outlining the proposed changes was only published last month and is due to be debated by Parliament at Second Reading stage in the coming weeks.\nIn its reaction, the association said the long-term solution would be to enforce decisions made by the competition watchdog only after the expiration of the period whereby the ‘guilty’ party could seek redress in court. Such arrangement would allow the regulator to take the action it deemed necessary while safeguarding the right of the individual or commercial entity to appeal before a court.\nWhile acknowledging that such changes would require the Opposition’s support as they would need the backing of two thirds of MPs, the association noted that failure to do so would result in all issues related to competition and consumer law ending up in court straightaway.\nIn turn, this would cause more delays for action, to the detriment of consumers and commercial entities negatively affected by the issue.\nThis would render the competition and consumer affairs watchdog powerless and ineffective in fulfilling its duties to defend consumers’ and businesses’ rights.\nThe association also took issue to the fact that the amendments “differ substantially” from the proposals that had been issued for public consultation last summer.\nThe most important change was that the watchdog would resort to the courts in all cases regardless of the seriousness of the alleged breach, the association noted.\nIt expressed disappointment that its proposal to increase fines had not been taken on board by the government.\nDuring the public consultation, the association had criticised the introduction of a new clause under which the regulator would have to wait for the legal representative of the business under investigation to be on site prior to conducting an inspection.\nSuch provision might render data seized by the Competition Office useless because it would have no power to stop the business from tampering or removing any incriminating evidence, the association said.\nIt also warned that the proposed changes could serve as a precedent for other public authorities to have to go to court to impose sanctions.", "comment_count": 1, "id": 1267}, {"keywords": "", "author": "Claire Caruana", "article_body": "Hairdressers without any teaching qualifications have been roped in to teach one of the ‘applied’ SEC subjects being introduced to secondary schools next September.\nTeachers who spoke on condition of anonymity expressed the surprise they felt when a group of hairdressers turned up for a 10-day crash course in teaching hairdressing that had initially been aimed at warranted teachers.\n“We just couldn’t believe it when we saw that while we had worked for years to get our qualifications, hairdressers who have so far worked only in salons will be allowed to teach students,” one teacher said.\nThe course, and others like it, such as in applied engineering, technology and media literacy, is intended to give teachers the skills to take a hands-on approach to teaching their subject next year.\nHowever, some of the hairdressers who attended this particular course had only one Advanced Level to their name and others none at all, another source said.\nHairdressers training to be supply teachers - Ministry\nA spokesperson for the Education Ministry dismissed this information as incorrect.\n“The persons mentioned have been offered additional training until July in this subject through Mcast, which would make them eligible to apply as supply teachers,” she explained.\nBut Malta Union of Teachers head Marco Bonnici said the ministry’s claim only confirmed fears that some of those chosen to teach the applied subjects lacked the necessary qualifications.\nNo state-of-the-art labs or facilities can compensate for a reduction of teaching standards through the engagement of unqualified teachers\nWhile they may have vast knowledge of the area they specialised in, in this case hairdressing, they did not yet have any experience or training in pedagogy, he pointed out.\n“The recent information and data are confirming the MUT’s statements earlier this year that there are not enough teachers to teach the 13 new applied subjects being introduced in September.\n“With more than one fifth of students choosing applied subjects in the recent options exercise and the provision of a 10-day crash course for prospective teachers – some of who do not even have the status of supply teachers – the educational system has sunk to an unprecedented level.\n“No state-of-the-art labs or facilities can compensate for a reduction of teaching standards through the engagement of unqualified teachers,” the MUT head said. \nTo apply for the job of a supply teacher, an applicant must be in possession of at least two ‘A’ levels. However, according to the call for applications issued by the Education Ministry, such applications will only be considered if there are still vacant teaching jobs after those with better qualifications have been selected.\n13 new subjects \nCome September, 13 new subjects will be on offer to State school students wishing to take a hands-on, rather than academic, approach to learning.\nThe MUT has repeatedly warned there may not be enough educators to cater for all the new subjects. It said a number of those who signed up for the courses had dropped out.\nHowever, the ministry denied this, insisting that 62 people had attended and concluded the courses.\nThe ministry had initially told this newspaper that teachers would be attending a 10-day crash course in March but the government spokeswoman said on Saturday that this was just “the initial part of the training”: there would be a further four days of training in June.", "comment_count": 91, "id": 1268}, {"keywords": "", "author": "", "article_body": "Nationalist MP Kristy Debono admitted on Monday that she made an error of judgement when she sought a sponsorship from Yorgen Fenech, the owner of once-secret Dubai company 17 Black.\n\"Following reactions in the media, social media and various people I have spoken to, I now realise that meeting the CEO of Tumas group was an error of judgement on my behalf and I unreservedly apologise for the unnecessary controversy,\" Ms Debono, president of the PN's general council and shadow minister for economic affairs said.\nThe meeting was revealed by The Sunday Times of Malta. Ms Debono initially denied holding such a meeting and when pressed by the newspaper to state whether or not she had indeed met Mr Fenech, she asked for questions to be sent via e-mail.  \nIn her statement on Monday, as she told the newspaper, she said she had held the meeting \"with the sole intention to organise a political conference and on a non-profit making basis.\"\nTo this end, she said, she shortlisted a number of possible conference venues, in the St Julian's and Swieqi vicinities to discuss possible sponsorship of a small conference room. The sponsorship did not materialise.bI wish to assure one and all that my stand against corruption remains as strong as ever\n\"The meeting was held in broad daylight, non-secretive and all above board. It was only to this end, and nothing else, that I conducted the said meeting.\n\"I wish to assure one and all that my stand against corruption remains as strong as ever,\" she said. \nLast year, in a joint investigation by the Times of Malta and Reuters, Yorgen Fenech was identified as the owner of 17 Black, which had been named in leaked e-mails as one of two companies that would pay $2 million to Panama companies belonging to the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nThe PN has called for the pair’s resignations over what it considers a major scandal blighting the country’s international reputation.\nRead: Meeting 17 Black owner does not hurt PN's fight against corruption - Delia\nEarlier on Monday, Opposition leader Adrian Delia said he had not known that Ms Debono, who was accompanied by MP Hermann Schiavone, had met Mr Fenech.\nHe insisted, however, that this did not dent the party’s fight against corruption.\nMr Schiavone in a Facebook post on Sunday (see below) criticised The Sunday Times for carrying the story saying it was aimed at harming party leader Adrian Delia by attacking those close to him. \nThe post appears to have since been deleted.", "comment_count": 163, "id": 1269}, {"keywords": "", "author": "", "article_body": "A billboard promoting Democratic Party MEP candidates was vandalised, party leader Godfrey Farrugia has said.\nThe billboard in Marsa featuring the PD’s three electoral candidates was put up just last week. On Monday, it was found half-torn off its frame.\n“I was told by the billboard operator that it was intentionally ripped,” Dr Farrugia told Times of Malta.\n“We found it extremely difficult to organise the billboards in the first place, and for a small party like ours, even drumming up the funds for them is difficult. It’s a shame that we also have to contend with such acts,” he added.\nThe PD is fielding three candidates – Anthony Buttigieg, Martin Cauchi Inglott and Camilla Appelgren – during next month’s MEP elections.", "comment_count": 13, "id": 1270}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Daphne Caruana Galizia's husband and sons have filed a judicial letter calling on the authorities to hold a public inquiry to determine whether the state is abiding by its obligations under the European Convention on Human Rights.\nLawyers for the family made the call to the prime minister, the attorney general and the justice minister, calling on them to order an inquiry to investigate whether the right to life is being safeguarded by the state.\nThey said the inquiry needs to focus upon whether the murder of the journalist could have been avoided, whether the State had taken all necessary steps to obviate danger to her life and whether necessary protection had been afforded.\nMs Caruana Galizia was killed by a car bomb as she drove out of her residence on October 16, 2017. Three men have been accused of the murder but they are not believed to have been the masterminds behind the crime. \nThe family said the inquiry should also to investigate whether “procedures, processes and administrative structures” had been lacking in this regard and whether these could be strengthened.\nThe family called upon the authorities to appoint “suitable, independent and impartial” persons to conduct the inquiry, failing which other legal measures would be sought.\nLawyers Jason Azzopardi, Eve Borg Costanzi and Therese Comodini Cachia signed the letter.", "comment_count": 23, "id": 1271}, {"keywords": "", "author": "Keith Micallef", "article_body": "Updated at 5.29pm \nNationalist Party leader Adrian Delia has said he did not know that two of his closest MPs had met 17 Black owner Yorgen Fenech, but insisted that this did not dent the party’s fight against corruption.\nDr Delia was asked on the matter at the end of a visit which the PN parliamentary group paid to President George Vella at the presidential palace in Valletta on Monday.\nThe Sunday Times of Malta revealed that PN MPs Kristy Debono and Hermann Schiavone had met Yorgen Fenech to seek a sponsorship.\nMr Fenech is the owner of 17 Black, one of two companies set up to pay $2 million to Panama companies belonging to the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nHe is also one of the directors of the consortium awarded a contract to build the €450 million Delimara power plant, under the watch of Mr Mizzi who at the time was Energy Minister.\nEvasive replies\nOn Monday, Dr Delia - who is also PN spokesman for good governance - was evasive when confronted with the matter.  While hinting that they could have made an error of judgment, he insisting that none of them had done anything criminal.\nDr Delia added that it was crucial that this controversy did not overshadow the ongoing 17 Black inquiry.\nWhen it was pointed out to him that following this meeting the PN had lost its moral authority to speak against corruption, he said that good governance had to do with the conduct of those in power.\nDelia meets President Vella\nEarlier, Dr Delia and President George Vella addressed the media at the end of a meeting Malta's new head of state held with the PN's parliamentary group.\nThe PN leader welcomed the pro-life stance of taken by President Vella while expressing his concern on the current situation in Libya, which he said could have repercussions on Malta.\nOn his part Dr Vella thanked PN MPs for supporting his nomination for President, while urging them to lead by example.\nThe PN parliamentary group paid President Vella a visit. Photo: Jonathan Borg\n“Your conduct has to portray integrity and must show that you are really honourable members,” he said.\nDr Vella also expressed concern on the escalation of tensions in Libya, while calling for a diplomatic solution. He added that trouble in this neighbouring North African country would not bode well for the Maltese economy and would also have other repercussions, such as a spike in migration.\nThe President also referred to last Satuday’s murder of a 42-year-old Ivorian in an area between Birżebbuġa and Ħal Far. He expressed his hope that such gruesome act was not racially motivated.", "comment_count": 60, "id": 1272}, {"keywords": "", "author": "", "article_body": "Air Malta is eyeing the introduction of a service to Accra, Ghana, next year as part of a growth process which will possibly be followed by a service to Mumbai, Tourism Minister Konrad Mizzi told Parliament on Monday.\nThe minister was replying to a range of questions on Air Malta and the disused Selmun Palace Hotel, which the airline once operated.\nReplying to questions by Nationalist MP Robert Cutajar, the minister said the former Selmun Palace Hotel is government-owned and the government intends to issue a request for proposals for the development of a new hotel in Selmun.\nTalks are being held with the Planning Authority on the form which such a hotel may take.\nThe Cabinet has decided that while a request for proposals will be issued for a new hotel, no residential development will be allowed.\nHe said the adjoining historic Selmun Palace is being kept in a good state of maintenance and being used for film-shooting. Two productions by Viacom will be filmed next month.\nEnemed dues\nAsked by Mr Cutajar and Nationalist MP Ryan Callus whether it was true that Air Malta owed Enemed some €20 million for fuel, the minister said the debts were not as high and the airline was observing its credit terms. Fuel was paid within 90 days and a payment was made last week.\nReplying to questions by Labour MPs Rosianne Cutajar and Alex Muscat, the minister spoke on how Air Malta, for the first time, had made an operational profit of €1.4m. The vision, he said, was to develop a Malta hub where Air Malta operated in conjunction with other airlines for a wide range of connections from New York to Mumbai.\nHe wanted to see Air Malta serving routes to all European, North African and countries.\nAs from next year he would like to see Air Malta developing a route from Accra, Ghana, followed by a service to Mumbai using new Airbus A321 long-range aircraft.  \nDr Mizzi also told Ms Cutajar that studies were being made about extending Pinto Wharf in Grand Harbour so that it could better handle the berthing of cruise ships. ", "comment_count": 19, "id": 1273}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who was arrested after a chase at St Paul's Bay on Saturday was jailed on Monday after being convicted of drug possession.\nThe court was told that police officers had gone to Fra Ben point in response to a separate report. While there, they noticed Nigerian-born John Gabiriel, 37, acting suspiciously. As soon as he noticed the officers approach, Mr Gabiriel dashed off and was seen throwing away a bag.\nPolicemen arrested him shortly after.\nThe bag was found to contain 27 sachets of cannabis and a considerable amount of empty plastic sachets, the court was told.\nMr Gabiriel pleaded guilty and his defence lawyer, Mark Mifsud Cutajar, pointed out that he had cooperated fully with the police. He also told the court that his client  was currently homeless and had had no previous brush with the law.\nHowever, the prosecution argued for an effective jail term, pointing out that the accused had originally landed in Lampedusa and had moved to Malta in search of a job.\nMagistrate Rachel Montebello condemned him to a nine-month effective jail term.", "comment_count": 0, "id": 1274}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A married man who had argued with his wife sought to make amends by spraying graffiti in Tigne that was so large it could be seen across the water from Valletta.\nAhmet Acar, a 47-year old construction worker, was arraigned on Monday under arrest, pleading guilty to having caused more than €2500 in damages to the public space at Tigne Point, property of the Sliema local council.\nThe accused had apparently argued with his wife and wanted to make amends.\nInspired by a graffiti artist whom he had observed at work at Sliema, the man had decided to give it a try, putting up his own message on a wall overlooking Marsamxett harbour and reportedly visible across the waters from Valletta. The court was not told what the man had sprayed.\nHowever, his idea backfired and he ended up arrested.\nHe admitted his wrongdoing and his employers reassured the Sliema local council that they would foot the bill to have their worker’s ‘graffiti’ cleaned up within the week.\nIn the light of this undertaking and the accused’s early guilty plea, the court, presided over by magistrate Rachel Montebello, conditionally discharged him for three years, warning him of the consequences he would face in case of any future breach.\nInspector Bernardette Valletta prosecuted.Lawyer Gianluca Caruana Curran was defence counsel.", "comment_count": 0, "id": 1275}, {"keywords": "", "author": "", "article_body": "New regulatory standards covering respite services for carers of persons with disability have been made public\nThe social regulatory standards and accompanying guidelines were drafted by the newly set up Social Care Standards Authority, and are meant to outline how staff take care of persons with disability.\nSome 800 people who care for persons with disability use the respite services provided by the State, to take a break and recharge from the responsibility of full-time care.\nRead:21-bedroom respite services centre opens\nMatthew Vella, who heads the authority, told Times of Malta that the new standards were based on fieldwork and lengthy discussions with stakeholders. These would now be transposed into law via legal notices due to be published on Tuesday.\nMr Vella said more than 200 on-site inspections had been carried out by the authority in recent months to assess the level of service at respite centres across the island.\nGuidelines made public\nAccording to the guideline documents, the standards reflect the rights of clients of respite services based on the principles of dignity, privacy, equality, individuality, and diversity. They cover the rights of persons with disability, personal support programs, decision taking and inclusion.\nSimilar guideline documents have recently been drafted by the authority for adoption services, residential care, and day centres. New standards for addiction services and alternative care were next on the authority’s to-do list, Mr Vella said.\nAnthony Agius Decelis, Parliamentary Secretary for Persons with Disability, told a press conference that the main concerns of relatives of persons with disability were about the level of service provided by respite centres, the quality of care and safety standards.\nThese, he said, were central pillars of the new guidelines and standards.", "comment_count": 0, "id": 1276}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A ship with 81 people aboard, 64 of whom were rescued off war-torn Libya, has asked Malta for permission to seek shelter from inclement weather.\nThe humanitarian vessel headed towards Malta on Saturday after it was refused entry in Lampedusa. Malta was the next safe harbour for the Alan Kurdi, and the NGO Sea-Eye has since then been calling for protection from rough weather.\nThe ship now remains in international waters outside Malta.\nWhen contacted, a spokeswoman said the Armed Forces of Malta had no updates about the issue in what appears to be another protracted migrants' saga.\nThe European Commission has meanwhile urged EU member states to find a solution to the impasse so that the migrants may disembark safely.\nBoth Italy and Malta have refused it a safe harbour, leaving the migrants sleeping in cramped conditions.\nOn Friday afternoon, Italy finally agreed to evacuate two children with their mothers for humanitarian reasons, but they refused to airlift the fathers.\nRead: 'Please help us,' NGO asks Malta after Salvini 'humiliates' migrants\nBad weather on the horizon\nOn Monday, a Sea-Eye spokesman told Times of Malta that the weather was expected to take a turn for the worse and will remain so for several hours.\n“The captain has requested permission to approach Malta to seek weather protection. Malta communicates with us very strictly, but is not hostile. This gives us hope that a humanitarian solution can be found quickly,” Gorden Isler said.\nIf permission to enter a Maltese port is not granted by Monday night, the vessel will need urgent drinking water and food supplies.\nThe current stand-off has forced the NGO to cancel its upcoming mission and as a result, no ship in the Libyan search-and-rescue zone is likely to search for people in distress, the spokesman warned.\nHe explained there were currently 81 people on board the Alan Kurdi, 64 of whom had “gone through hell” in the form of torture, rape, human trafficking and murder.\nMost of them are now sleeping on deck.\n“They are cold, wet, and freezing. These people need help quickly. Our crew is also exposed to increased stress. This situation must be stopped right now because it endangers the health of 81 people,” he said.\nVideo: See Eye\nThe spokesman hit back at critics who accused the NGO of deliberately getting itself in trouble, many of whom acknowledge that Libya is facing a \"challenging situation\".\n“So why are we the only ones willing to search for people in distress? International law should be respected and not misinterpreted.\"\nThe money pumped by Europe into the expansion of the Libyan Coast Guard could possibly exacerbate the problem.\nIf the war in Libya persisted and got worse, the number of those in distress would increase, Mr Isler warned.", "comment_count": 0, "id": 1277}, {"keywords": "", "author": "Denise Grech ", "article_body": "An oil spill at the Grand Harbour, which “could not be contained”, risked causing damage to marine species on the shore, according to marine biologist Alan Deidun.\nThe oil spill was spotted from Kalkara after a yacht caught fire in the marina. People at the Kalkara Marina described the blaze as something akin to a fireworks factory explosion, damaging nearby boats and causing thousands of euros in damages.\nThe cause of the fire is not yet known and the fire only died when the boat started sinking.\nProf. Deidun said the environmental impacts of hydrocarbons, including fuels, depended on their composition. The diesel from the yacht in question was composed of light fractions that had limited impact on marine life. The effect would be mainly restricted to short-term impacts on coastal species attached to the rocks (like algae, limpets and barnacles) that came in contact with the fuel, he said.\nThe issue was that the layer of diesel was so thin and spread so quickly there was nothing that could be done to stop the damage.\nNothing could be done to stop the damage\n“In the short term, there is practically nothing that can be done because the oil spill cannot be recovered,” he said.\nDespite being “impossible to contain”, the environmental impact was not big, given that most of the fuel would evaporate in the short term.\nDiesel oil spills create a translucent sheen, causing alarm as they seem to be very grave. The oil from the yacht has a light chemical composition, spreading quickly into a thin veneer at the surface of the ocean.\n“The oil spill is so thin that it cannot be burned and even if it did, you can’t burn it in a harbour as that would be dangerous,” Prof. Deidun noted.\nThe Environmental Resources Authority conceded it could not deal with the sunken yacht that contained some oil, pointing out that a magisterial inquiry was in progress.\nA spokeswoman for ERA said compliance officers immediately carried out investigations at the Grand Harbour upon being alerted to the spill. It was concluded that the incident was “in all probability” related to Tuesday’s yacht fire.\nThe environment watchdog said it was in contact with Transport Malta, the competent authority where oil spills within the Grand Harbour were involved, and with the Civil Protection Department, which were all following the case.\nThe sunken wreck, the spokeswoman admitted, could contain some diesel residues that could not be recovered.", "comment_count": 4, "id": 1278}, {"keywords": "", "author": "", "article_body": "The property market grew by nine per cent over the past year, Infrastructure Minister Ian Borg said on Monday, saying this was due to general growth in the economy and other sectors which sustain this sector.\nSpeaking at the presentation of warrants to 31 new architects, he said the growth represents greater demand for professionals in this industry, who could can work towards progress and sustainability.\nHe said that while one cannot erase what had been done in the past, the future was “filled with opportunities for our country to develop sustainably”.\nThe ministry is working hard so that apart from setting up the Malta Construction and Building Authority it is also carrying out a lot of work with the entities falling within the ministry.\nHe also stressed the importance of avoiding abuse, saying it was essential that professionals such as architects and engineers should oversee work not only during the construction stage, but throughout the lifetime of any building.", "comment_count": 12, "id": 1279}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The government signed its first sectorial agreement with medical physicists on Monday, a move that will affect 18 professionals.\nMedical physicians, regulated by the Allied Health Care Profession, ensure safe and efficient use of medical equipment and reduction of risks from x-rays, radioactive material and strong magnetic fields among others.\nAmong others, they certify machines and regulate the dose of radiation required by oncology patients. \nThe agreement was signed with UĦM - Voice of the Workers.\nHealth Minister Chris Fearne said on Monday that the relatively new skills were especially required at the Sir Anthony Mamo Oncology Centre.\nOver the past four years, employees were trained abroad in medical physics and the sectoral agreement would ensure their continuous development, he said.\nAn increase in human resources was part of the national cancer plan, the minister added.\n ", "comment_count": 0, "id": 1280}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Primary Health Care Nursing Manager was behind a circular ordering the removal of all religious symbols from health centres, Chris Fearne said on Monday.\nThe Health Minister’s comments come a day after he ordered the revocation of a directive asking health clinics to remove all religious symbols, such as holy pictures stuck to walls.\nThe minister said he had not been consulted on this matter.\nMr Fearne said he had asked the CEO of Primary Health Care to investigate and take disciplinary action if necessary.\nAsked by the media about the separation of Church and State, he said politicians should not hinder religious expression.\n\"This is an issue of personal devotion that politicians should stay out of. We are not forcing anyone to put up religious symbols, however, I believe we should not stop anyone who feels that they want to express their devotion in this manner.\"\nThe reasoning behind the circular, meant to be implemented immediately, was that health centres were a public entity, and should be considered to cater towards a multi-cultural society.\nIn a tweet on Sunday afternoon, Mr Fearne said he disagreed with the decision and that he had ordered that the circular be immediately revoked.", "comment_count": 269, "id": 1281}, {"keywords": "", "author": "", "article_body": "The leftist think-tank organisation Żminijietna has taken a stand against the proposal to increase the number of MPs but said it fully agreed in principle with the proposal to increase the number of female representation in parliament. \nŻminijietna said on Monday that out of 65 MPs, 55 should still be elected under the current system, the only difference being that the number of districts would be reduced from 13 to 11 districts.\n\"The remaining seats would be distributed proportionally according to the number of votes the parties got, with the aim to reduce gender imbalance,” it said in a statement.", "comment_count": 4, "id": 1282}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "“Chocolate shouldn’t just be eaten, it should be appreciated,” Pawlu Borg Bonaci says as he helps himself to some of the delicious, brown sweet.\nSome of the finished products.\n“You should let it melt slowly in your mouth and then breathe in to fully taste its flavours,” he advises.\nChocolate is the principal ingredient of Easter eggs and Elia Caterers, founded in 1953 by Mr Borg Bonaci’s grandfather, Elia, annually churns out hundreds of them in different shapes and sizes.\nThe traditional sweets are made of high-quality chocolate Elia imports directly from a fair trade-certified company in Belgium.\n“We only use pure chocolate, meaning all the components are made of cocoa beans. This is different from what we call ‘baker’s chocolate’ or ‘compound chocolate’, which contains vegetable fat,” Mr Borg Bonaci, one of the company’s directors and also its sales and marketing manager, points out.\nElia Caterers churns out hundreds of chocolate eggs in the run-up to Holy Week.\nTemperature and humidity are the worst enemies of chocolate\nTurning chocolate drops or blocks into Easter eggs is quite a laborious task. The process starts with what is called ‘tempering’, which involves the slow melting and cooling of the chocolate. Through this process, chocolate shrinks a bit while cooling and can, therefore, be easily removed from moulds.\nCarmelo Borg Bonaci, one of the founding members of Elia Caterers, decorating Easter eggs in the traditional way.\nTempering also gives chocolate its shine and makes it melt in the mouth but not in one’s hands.\n“Without it, chocolate would not even snap,” Mr Borg Bonaci notes as he splits one of the ready-made eggs to produce that cracking sound.\nDark, milk and white chocolate drops are first melted at different temperatures. This is necessary because, for example, high temperatures can burn the milk protein of white chocolate.\nEmployees then fill the moulds with the molten liquid. The moulds also hail from Belgium (Antwerp, to be precise) and are usually made of Teflon, polycarbonate or aluminium.\nThey come in different shapes, such as bunnies, teddy bears, ducks or more modern, abstract forms. They have various sizes, with the smallest one at Elia measuring three centimetres and the largest 80 centimetres.\nThe filled containers are placed on a vibrating tray, allowing any excess chocolate to drip off. They then pass through a cooling tunnel, a covered conveyor belt set at a specific temperature to cool down the chocolate.\nCake decorator Marica Attard filling a mould with molten chocolate.\n“All this happens in a controlled environment because temperature and humidity are the worst enemies of chocolate,” Mr Borg Bonaci remarks. Having a stable temperature helps avoid ‘fat blooming’, that whitish coating which can appear on the surface of chocolate when the cocoa butter gets separated from the rest of the components.\nOnce set, the egg halves are carefully removed from the moulds and placed on a hot plate to slightly melt the rims of each half and then stick them together. It is at this point that any ‘surprises’ are locked inside.\nFinally comes the decoration part. Eggs are adorned with traditional designs using sugar paste and royal icing or else with flavoured chocolate such as caramel, strawberry, lime or orange. They can also be given a velvety texture using a spraying technique.\n“The orange chocolate flavouring is definitely my favourite,” a smiling Mr Borg Bonaci admits as he points to a row of shiny, fancy Easter eggs ready for consumption.\nStefan Zahra, manager of the cake and chocolate decoration department, carefully adorns an Easter egg.\nA process called ‘tempering’ makes chocolate shiny and easily removable from moulds.", "comment_count": 9, "id": 1283}, {"keywords": "", "author": "Bertrand Borg, Edwina Brincat", "article_body": "Updated at 2.08pm\nJoseph Bonnici, the man accused of the double murder in Għaxaq last month had planned the crime down to the very last detail, building his own makeshift gun and buying a pressure washer to clean up the mess, police inspectors told a court on Monday.\nThe 38-year-old murdered mother and sister on Tuesday March 26, and then got back into bed.\nProsecutors explained how Mr Bonnici had prepared for the murder, executed it and then reported the two women missing to police before crumbling under the pressure of interrogation.\nThe Għaxaq man faces charges of having shot his mother Maria Lourdes and sister Angele and dumped their bodies in a field. It was the second double murder in the immediate family’s history: his father, Paul Bonnici, is serving time for having killed a couple who lived next door.\nSigns of premeditation\nInspector Keith Arnaud told the court how Joseph Bonnici had picked that Tuesday in March as the day to kill his mother and sister because his girlfriend was due to return home late. It was raining, and that would help wash away evidence of the crime, the inspector added.\nMr Bonnici intentionally shorted a switch to trigger his home’s circuit breaker, then called his sister over from next door, where she lived with their mother, under the pretext that he needed her help to fix the electrical fault.Angele Bonnici.\nHe had built his own silenced gun, Inspector Arnaud said, and he used that to shoot his sister Angele as her back was turned. Angele fell; he reloaded and shot her again. She continued to gurgle, and Mr Bonnici reached for a sledgehammer, smashing her head to make sure she was dead.\nWith his sister killed, he called his mother over, again using the electrical fault as an excuse. As she walked ahead of him, he shot her in the head.With his sister killed, he called his mother over, again using the electric fault as an excuse\nAngele Bonnici was shot twice in the head. His mother, Maria Lourdes,was shot once. Both were unrecognisable due to their injuries, the court was told.\nAs both women lay dead, Mr Bonnici wrapped their bleeding heads in garbage bags and dragged their bodies into his car, using a metal sheet to make it easier to move the bodies.\nA wheelbarrow, which Mr Bonnici had covered in clingfilm and equipped with heavy-duty tyres, was resting in the car's back seat. \nHe then went to bed and pretended to be asleep as he waited for his girlfriend to return home. Later that night, he got up and drove the corpses to a field, using the wheelbarrow to cart the two to his chosen burial spot. There, he covered their bodies with lime.\nWhen police officers found the bodies, garbage bags were still tied around both women’s heads. The mother had a small pouch containing €4,500 close to her chest.\nPolice suspicions\nProsecutors said Mr Bonnici, who had initially reported his mother and sister missing, confessed to the crime after being interrogated by the police.\n “I made a mess, it’s a mess,” [Ħerba għamilt, ħerba hemm]  he told them.\nHe told police how he had killed the two, where he had buried them and how he had gotten rid of items used in the crime. Officers recorded Mr Bonnici’s confession.\nMr Bonnici told investigators he had burnt the sacks he had used to carry the bodies and bought a pressure washer to wash away traces of blood.\nHe had also burnt his sister's mobile phone and a lantern his mother was holding when he had shot her. \nPolice scour the area where the bodies were found. Photo: Mark Zammit Cordina\nMr Bonnici first claimed he had thrown the gun away, but later recanted and showed them where he had buried it. He dumped the sledgehammer at a WasteServ skip in Għaxaq. Investigators found the sledgehammer weighing more than 6kg and with an iron handle, which they believe was the one used by Mr Bonnici.\nPolice found his Daewoo parked in a parking bay for the disabled on Saturday March 30 at 6am in Żejtun.\nMr Bonnici owned several licensed weapons, including a hunting shotgun, but had opted against using those to kill his relatives because they did not have a silencer. The firearm he built, on the other hand, did.\nLong-standing resentment                              \nInvestigators say Mr Bonnici’s had long harboured resentment against his two relatives, blaming his mother for having needled their father into killing two of their neigbours more than a decade ago and suspecting that his sister was plotting to have him sent to jail.\nThe senior Bonnici’s double murder was not the only horrific episode in the family’s history. Around a decade ago, an ex-girlfriend of Joseph Bonnici’s had died by suicide, the court heard.\nMr Bonnici’s current girlfriend testified that she knew of that death, and that the ex and her mother-in-law, Maria Lourdes, had not gotten along.\nA suicide note she had written to Mr Bonnici had made reference to those tensions, the inspector told the court. \nInspector John Spiteri told the court that he had received reports that Angele Bonnici had spoken of having been sexually abused by her brother in the past.\nLater in the sitting, Mr Bonnici’s own girlfriend told the court how Angele had once told her that he had “touched her” when they were younger. The family mother, Maria Lourdes, knew about this, she had said.\nJoseph Bonnici had denied ever abusing his sister.\nMr Bonnici’s girlfriend recounted a disconcerting episode early in their relationship, around nine years ago.\nAngele - who was eight years younger than Joseph - had taken off her clothes in front of both of them to show him a pimple.   \nShe found this disconcerting, but Joseph had insisted there was nothing unusual or untoward, she told the court.\nA father’s suspicions\nInspector Spiteri told the court how, one day after the two women had been reported missing, prison authorities told him that the accused's father, Paul Bonnici, wanted to speak to the police.\nMr Bonnici is serving time for having killed a couple who lived next door to them in 2000, with a long-standing feud between the two families having come to a head when the Bonnicis accused them of having stolen clothes hanging out to dry.\nThe father was aware that there was tension between his son and daughter, Inspector Spiteri told the court. He called home every morning, and it was unusual for his wife to not let him know she was going out.\nMr Bonnici had recently been ordered to pay €80,000 in damages by a civil court, but thought it highly unlikely that his wife and daughter would have fled the island to get out of paying that.\nJoseph Bonnici had visited his father in jail that Thursday and told him he did not know of his mother and sister's whereabouts.\nHe had then visited his sister Angele’s workplace to ask if they had seen her, and from there gone to police to file a missing persons report.\nWhen police visited the Bonnici home, they noted a strong smell of kerosene. The suspect, Joseph Bonnici, told officers that he used kerosene as a flea repellent.\nUncashed cheques lay in Angele Bonnici’s room. Maria Lourdes’ mobile phone was there, as well as some gold jewellery. Neither of the two had made any phone calls since the previous evening.\nPeople who last spoke to the mother and daughter had not noticed anything untoward about them. CCTV footage from previous days showed them in pyjamas, acting normally.\nThe cameras went offline at 9pm on the day of the murder, and resumed operations the next day.\n‘We all led separate lives’ - girlfriend\nMr Bonnici’s girlfriend told the court that her boyfriend had kept telling her “sorry” over and over again when she spoke to him at Żejtun police station.\nWhen she discovered what had happened, she had collapsed in shock.\nThe two had been living together in Mr Bonnici’s home for the past nine years. Although his mother and sister lived on the same plot of land, they rarely visited – usually only when the family’s father visited from prison.\nApart from that, they only met by chance on the roof or in the garage, Ms Bonnici told the court.\n“It wasn’t a very close relationship,” she said. “We all led separate lives but were ready to help each other out”.  \nShe and her boyfriend did not really discuss the family’s dark past, she told the court. \n\"Joseph is the quiet type. He's not one to talk unless asked, and I didn't ask much,\" she said. \nShe described her boyfriend as “the most amazing person I know” and told the court that he had lifted her out of an abusive relationship in her past.\n“He always respected and loved me. He was always calm and gentle and he was never aggressive, not even with our pets”.\nAs she sang his praises, the bespectacled Mr Bonnici, who had spent the hearing sitting silently, began to sob.\nThe compilation of evidence before Magistrate Joseph Mifsud will resume on April 15.\nInspector Keith Arnaud is prosecuting. Lawyers Franco Debono and Marion Camilleri are counsel for the defence. ", "comment_count": 0, "id": 1284}, {"keywords": "", "author": "", "article_body": "The number of tourists in February went up 2.3 per cent when compared to the corresponding month in 2018, but they spent 2.8 per cent less, according to the National Statistics Office.\nOut of the 125,198 trips, the majority - 103,655 - were carried out for holiday purposes, while a further 14,776 were undertaken for business purposes.\nInbound tourists from EU member states went up by 1.7 per cent to 107,744 when compared to the corresponding month in 2018. Most inbound tourists were aged between 25 and 44 (41.1 per cent), followed by those within the 45-64 age bracket (31.5 per cent).\nTotal nights spent went up by 3.5 per cent when compared to February 2018, amounting to 774,569 nights. The largest share of guest nights (58.6 per cent) was spent in collective accommodation establishments.\nTotal tourist expenditure was estimated at €71.2 million, with the average length of stay edging up to 6.2 nights.", "comment_count": 3, "id": 1285}, {"keywords": "", "author": "Herman Grech", "article_body": "The area where a migrant was murdered and two others injured on Saturday is a hotspot for racial attacks and incitement, Times of Malta is informed.\nA number of incidents were reported in the area between Birżebbuġa and Ħal Far in recent months, adding fuel to speculation that the 42-year-old Ivorian killed there on Saturday could have been the victim of a random shooting.The victim: Lassana Cisse\nSources said the victims were found spread out across a stretch of Triq tal-Ġebel, a country lane often used by migrants walking to and from the open centre in Ħal Far. Two Ghanians sustained gunshot injuries but their condition was not serious.\nThe fact that victims were not together has perplexed investigators, who are still trying to understand what sparked the murder.\nThey have not excluded that it may have been a racially-motivated attack though police said it was \"still too early\" to reach conclusions. The police believe the shooter was riding in a white Toyota Starlet and are currently investigating CCTV footage.\nOsman Dicko, a friend of the victim, said migrants were living in fear more than ever, with many believing racial motivation behind the shooting. Until we get to know the real reason behind the murder, each one of us is asking: am I next?- Friend of victim\n\"Until we get to know the real reason behind the murder, each one of us is asking: am I next?\" he told Times of Malta.\nThe victim, Lassana Cisse, who used to work in a factory near Ħal Far, did not have a troublesome background, according to Mr Dicko, who last saw him two weeks ago. \n'Pelted with stones, spat on...'\nTimes of Malta is informed a migrant from Chad was run over by a car in the same road in what looked like a \"deliberate\" hit-and-run on February 2. The car had no number plate affixed, according to a source.\nThe victim was hospitalised but the media was not informed about the incident.\nSome months ago, over the space of a couple of weeks, a flag showing “right-wing symbols” was erected at a roundabout close to the Ħal-Far open centre. It was twice taken down by officials, according to another source.\nGraffitti’s Andre Callus said the area was synonymous with racial attacks along the years, especially since there are few residences in the area. Migrants were pelted with stones, spat on, and in at least one case, an African man beaten up, he said.\nMaria Pisani from Integra Foundation urged the authorities and all “decent human beings” to do everything they can to ensure that racism and all racist attacks are not trivialised.\"If migrants are being specifically targeted, then this is hate crime at its most horrific. We await the outcome of the police investigations, but in the meantime, treated with the gravity they deserve.\"", "comment_count": 0, "id": 1286}, {"keywords": "", "author": "", "article_body": "The revelation that two PN MPs sought sponsorship for a party activity from a business man implicated in scandal has prompted Partit Demokratiku to call once again for a lobbyist register and reform of the party financing law.\nRead: PN MPs meet owner of 17 Black to seek conference sponsorship\n\"Politics is not a business. It should only ever be about public service. Political parties should not be enterprises which depend on donations from shady corporate interests. Malta and Gozo deserve better. We need to have an airtight lobbyist register. It is the duty of the Commissioner of Public Standards to be a prime mover and set the ball rolling,” party leader Godfrey Farrugia said on Monday.\n“It is the obligation of the Chief Electoral Commissioner to keep track of who is donating to or sponsoring our decision makers. I have also said - and repeat - that we should make it more difficult for private interests to donate to parties. We should have state financing of political parties, matched with a token tax aimed at the businesses currently setting the political agenda through their donations. Let us cut the puppeteers’ strings,\" deputy leader Timothy Alden added.\nPartit Demokratiku said it was of the opinion that no situation justified Opposition MPs risking the credibility of the Opposition by asking for handouts from a businessman implicated in many of the recent scandals.\n\"Currently, the Electoral Commission is tasked with being judge, jury and executioner, a role which the Constitutional Court has challenged, because the Commission is made up of representatives from the two major parties. We require a genuinely independent Electoral Commission, without appointments made by leading officials,\" MEP candidate Anthony Buttigieg concluded.", "comment_count": 12, "id": 1287}, {"keywords": "", "author": "Sarah Carabott", "article_body": "When three years ago Christine Grixti received the call informing her she had been matched with a donor, her own weak heart nearly failed with excitement.\nHer husband, Charles, who had already bid farewell to Christine in a similar episode just a month earlier, called an ambulance as he rushed home from work.\nOn their way to hospital, the couple was still coming to terms with the life-changing call they had just received.\nMs Grixti, who had been living with arrhythmogenic right ventricular dysplasia for 20 years, was praying to her late parents and the donor to help her make it alive to hospital.\nMeanwhile, her husband was asking the ambulance nurse whether it was true that a matching heart was being made available.\nFor years, he had stood by Ms Grixti, backing her every move. However, he had never believed that his wife, who had been told she will not make it past the year, would find a matching heart.\nThe next few hours and weeks were quite challenging, with Ms Grixti requiring two litres of blood following the transplant procedure and being recovered in hospital for unrelated complications.\nHer donor, Drew Abela\nMs Grixti, now 45, admitted she would relive those moments if she could, including the day she met with the family of 20-year-old donor, Drew Abela, whom she met through social media following a newspaper article.\nThose days marked the shift from being a living time-bomb to a living miracle. Her second chance at life, made possible by the Abelas’ altruism, inspired her to encourage more people to become organ donors.\n“The topic of inheritance after death is rather a sombre one but most of us leave a will ensuring that our possessions are passed on to those who survive us.\n“Whoever we are and no matter what we own, we all have organs. Let’s make sure they too are inherited by those who survive us. Organ donation allows others to live a decent life,” she remarks.\nRead: Drew Abela saved seven lives. His grieving relatives want it to lead to more\nBefore being given her new heart, Ms Grixti had to make several changes to her life.\nShe had to cut down her working hours, quit driving and travelling abroad and even simple tasks like making her bed.\nShe had been diagnosed with a rare heart disease at 20 and the loss of her father at 33 had an impact on her heart that saw her being inserted with an im-plantable cardioverter defibrillator.\nSimilar to a pacemaker, the ICD prevented sudden death as her heart was getting weaker.\nSadly, Ms Grixti underwent another “huge heartbreak” when her mother died suddenly four years later and, following an infection in the ICD’s leads, in 2013 she was told she needed a heart transplant.\nAsked whether she was scared of such a delicate procedure, she said she knew she was in good medical hands and that her only alternative was death.\nSecond chance at life inspires her to encourage more people to become organ donors\nDoes she ever feel guilty that to get an organ someone else has to pass away?\n“Always. I’m still battling that guilt,” Ms Grixti said.\n“As a person who faced death twice in a month, I’m always encouraging people to live life to the fullest but I know I’m still alive because someone else passed away.\n“However, Drew’s family tells me that living with the help of their son’s organ is a continuation of the young man’s life. He gave life to seven others.”\nBe a hero, become a donor\nIn dealing with the tragic loss of their son, Drew Abela, his parents Sharon and Kenneth funnelled their energy into the Life after Drew campaign.\nIn collaboration with the Transplant Support Group Malta, the campaign is raising awareness about the need of organ donation, encouraging others to register as donors and calling for a support structure that guides surviving relatives through the process.\nOne can become a donor in minutes by either registering online using one’s e-ID details, sending the application form by e-mail, or by post.\nHolders of the donor card still have to register.\nMore information on www.transplantsupport.org.mt or the Facebook page Transplant Support Group – Malta.", "comment_count": 1, "id": 1288}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government has engaged a new international firm to make a fresh valuation of the St George’s Bay peninsula in St Julian’s, currently occupied by three Corinthia hotels.\nThis would be intended to pave the way for a second consideration of the hotel chain’s request to turn a large part of the prime site into a real estate concession for speculation, The Sunday Times of Malta was informed.\nHowever, industry sources said that Tourism Minister Konrad Mizzi, who is piloting the negotiations with Corinthia, has awarded the valuation assignment to Colliers International – a global real estate services company which counts Corinthia as one of its clients. Dr Mizzi presented the draft Corinthia deal to parliament in December. Photo: Darrin Zammit Lupi\nIn light of this potential conflict of interest, Dr Mizzi was asked who selected Colliers and whether the previous Deloitte valuation, on which the government had based its negotiations, has been scrapped. He failed to reply.\nWhen asked for comment, the Corinthia group distanced itself from the government’s decision, saying it had nothing to do with the selection of Colliers International and adding that such a serious firm would have checked for conflicts of interest prior to taking the job.\nAdmitting that the international firm had done similar work for the group on its property in Russia, a spokesman made it clear that Corinthia had not been consulted by the government on the use of Colliers and that it had nothing to do with the ongoing exercise.\nThe group said that although it was still interested in striking a deal with the government, it still considered the valuation made by auditing firm Deloitte as “fair value”.\nA matter of urgency\nIndustry sources said Dr Mizzi had given instructions for the valuation to be handled with urgency so that a deal with the Corinthia could be concluded before Parliament’s summer recess.\n“The plan is that nothing should be mentioned until the MEP elections so that no votes are lost,” one source said.\n“Soon after the elections, which Labour is expecting to win by a big margin, a new resolution will be presented to Parliament with the intention of getting it approved quickly.”\nThe plan is that nothing should be mentioned until the MEP elections\nThe deal with Corinthia requires Parliament’s green light – by a simple majority – since it involves the transfer of public land.\nThe original deal\nDr Mizzi’s first attempt at giving new rights over the land to the Corinthia group was made last December. He has so far refused requests to publish a 2014 Memorandum of Understanding on which he said the deal was based.\nJust a day before Parliament rose for the Christmas holidays, the minister presented it with a draft deal that had already been negotiated with Corinthia, giving the hotel chain the whole of the St George’s Bay peninsula – probably one of Malta’s most prized pieces of real estate – for speculation purposes.\nThe PN Opposition immediately objected to the proposed deal, which was then sent back to the drawing board.\nThe land is already in Corinthia’s possession for use by its hotels exclusively. However, under the agreement that Dr Mizzi had wanted Parliament to approve in a single session, the hotel chain was to be allowed to build up to 100,000 square metres of luxury apartments and offices, which it would then put up for sale, while keeping their hotels and upgrading them.\nAmong the advantageous terms given to Corinthia, the government had agreed to take a settlement of just €17 million for the changes requested to the original 1990s agreement between the government and hotel chain – with the latter set to rake in many more millions more from its property dealings at the site.\nSectoral opposition\nThe proposed deal had created controversy and was greeted with anger by various sections of society, particularly pro-environment NGOs and the Malta Developers Association, which condemned the negotiations.\nA consortium of businessmen interested in the site warned the government it could take legal action because the sale had not been made through a public call for tenders, and because the deed, they argued, amounted to state aid in breach of EU rules.\nReal estate agents estimated the site as having a current market value of a least €700 million, way above Deloitte’s valuation.\nOn the other hand, constituted bodies such as the Chamber of Commerce and Enterprise, the GRTU, Malta Employers Association and Malta Hotels and Restaurants Association had not issued a reaction, despite having harshly criticised a similar deal struck with the Seabank db Group for the former ITS site nearby. \nDr Mizzi was also asked whether Colliers would also be asked to make a new valuation of the former ITS site, passed on to the db Group for just €15 million after a similar Deloitte valuation, but he did not reply.\nQuestions which Konrad Mizzi did not answer:\n• In his presentation to Parliament last December, the minister defended the first valuation made by Deloitte and wanted Parliament to rubber stamp his negotiations in a session. What changed his opinion?\n• Was the first valuation wrong? Can we have a copy of the Deloitte valuation?\n• How did Minister Mizzi go to Parliament with a wrong valuation on which the whole negotiations were based? Isn’t this amateurish and unprofessional?\n• How was Colliers International selected and by whom? Aren’t there proper valuers in Malta who know the local current market value much better?\n• Will the government publish Collier’s report when ready?\n• Will Corinthia be asked to pay market value on this deal?\n• Will Colliers also be drawing up a report on the former ITS site for a re-evaluation of the deal signed with the DB group?\nCorinthia on Colliers International:\n“Corinthia works globally in real estate and has over the years been involved in projects and business involving all of the major international property consulting firms, either acting for us or advising our counter parties such as property vendors, banks and financial institutions.\n“Our understanding is that government has appointed a team from Colliers in London although we cannot confirm that as we were not a party to that appointment, nor do we have knowledge or sight of the brief given to them. Nor do we have any relationship with the Colliers London office.\n“As you are aware Colliers is a global commercial real estate services organisation with approximately 12,000 employees in more than 500 offices in some 69 countries. We have in past years engaged their St Petersburg office to independently value our commercial property there as per our annual audit and regulatory requirements. We understand this office is a local business which operates separately and independent to their London office.\n“In any case, we are sure that serious firms such as Colliers would have checked for any conflicts of interest and verified there are none prior to taking any engagement of this nature.”", "comment_count": 57, "id": 1289}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Mellieħa local council has unanimously agreed to appeal against a development permit issued recently for the construction of an eight-storey block comprising a hotel and residential apartments.\nThe decision was taken at a council meeting last week during which a motion originally submitted by Nationalist Party councillors was approved, following an amendment filed by Mellieħa mayor John Buttigieg.\nThe original motion requested the government to “return” the plot of land earmarked for this development for the construction of a community centre.\nSuch demand was made in the wake of the fact that the site, measuring 3,600 square metres, was in the council’s hands through an encroachment agreement which the government terminated in 2015. Subsequently, the plot was put on sale through an auction.\nThough no details were given on the amendment presented by the Mellieħa mayor, a council statement issued following the meeting noted that the encroachment had been given on condition that the land had to be used as a park-and-ride facility only and not for the construction of a community centre.\nAs for the merits of the appeal, the council said that partial review of subsidiary plans approved in January 2013 should not prevail over the 2006 local plan.\nThe development by J. Portelli Projects, which is at the heart of the controversy, was originally re-commended for refusal as it was in breach of the height limitation policy for the area. However, the Planning Authority board controversially overruled the case officer’s recommendation on the basis of a separate policy that allowed a degree of flexibility when deciding such applications.", "comment_count": 14, "id": 1290}, {"keywords": "", "author": "Ramona Depares", "article_body": "This is the fourth article in a series about Malta's local food industry. Read the first, second and third articles. \nAged 15, when most of her classmates were dreaming of a career in law, medicine and education, Alexandra Spagnol had only one thing on her mind – her family’s fields. In the young girl’s mind, there was no doubt about what her future would hold, and that was a vocation in farming.\n“Classmates could never understand me; they used to make fun of me and found farming a strange choice to make. But agriculture and livestock are in my blood. My mother’s side of the family has always worked the fields and I have never wished to do anything different,” she tells me, before stopping off to check how a flowering zucchini crop is faring.\nFast-forward 10 years and the now 26-year-old mother-of-two is one of a dying breed – a full-time female farmer who does the donkey work on her own, spending seven days out of seven in the fields and working as hard as the next man.\n“As soon as I finished secondary school, I started working the fields full-time, and I haven’t looked back since. But to this day people still stare when they see me driving a tractor. Because I’m a woman, they look at me in disgust, and most will even go so far as to tell me that women should not be doing this. Mind you, these will usually be complete strangers,” she says.\nIt would appear that sexism is still very much alive when it comes to certain sectors of the industry. But Ms Spagnol is not having any of it.\n“Women are as efficient as men, and this applies to all industries. I do get those who question whether I am capable of carrying out the physical labour aspect of the job. My reply to them is that I regularly handle 300 sacks of potatoes in a morning, each sack weighing 25 kilos give or take. So there’s their answer,” she says with an impish smile.\nRead: The truth about antibiotics in your food \nIn fact, what makes Ms Spagnol remarkable in the agricultural industry is not her gender; there are many women hailing from farming families working the fields in Malta. Ms Spagnol takes it a step further, with the bulk of the work divided equally between herself and her uncle.\nPeople do not understand the importance of farming\n“My husband is a livestock farmer but we keep our work separate most of the time. I spend all day, pretty much everyday, in our fields together with my uncle. He reaps the harvest and I sow the crops... or vice-versa, depending on what needs to be done.”\nWhen she says she spends every day working the fields, Ms Spagnol means exactly that, with no hint of hyperbole. Every week brings with it a basic schedule from Monday to Sunday, allowing for the sometimes unexpected turn of events that Mother Nature can bring with it.\nRead: Why farmers are quitting agriculture\nShe recites her timetable matter-of-factly: “Mondays and Fridays I prepare the vegetables for the Farmers’ Market the following day, which takes pretty much all day. Tuesdays and Saturdays I’m at the Farmers’ Market in Ta’ Qali at 5am sharp. Wednesdays and Thursdays I plant the crops, water them and so forth...” And on the seventh day, the farmer rested? No.\nThe last ‘holiday’ was when I gave birth to my daughter.\n“There’s always something to do on Sundays too, you know. There’s always watering, unexpected problems, new crops to plant... the fields are a 24-7 job.”\nSo, when does she get to have a rest and maybe holiday a bit? This question provokes peals of laughter. The answer to that, clearly, is very rarely.\n“I haven’t been abroad in 10 years. Since I started working full-time, in fact. I’ve forgotten what it means to visit another country. As for rest I don’t know. I don’t sleep much that’s for sure. Sometimes I’m still watering crops at 8pm. The only days I try to keep sacred and work-free are Christmas and New Year’s Day.”\nShe stops to think for a second, and adds, as an afterthought: “Come to think of it, the last ‘holiday’ was when I gave birth to my daughter. Mostly because it was by Caesarian section, so I had to stop for a couple of days whether I liked it or not. Otherwise, I wouldn’t have been away from the fields for that long, that’s for sure.”\nRead: 'This generation thinks carrots grow in supermarkets'\nHow does this work out with taking care of a two-year-old and a nine-month-old, I wonder out loud. This provokes another peal of laughter.\n“What did I say about women being as capable as men, earlier? I’d hazard to add that we are even more capable in some instances. I multi-task like there’s no tomorrow. Parents help with the babysitting aspect, of course, we all need that little bit of help on occasion. But I’m there to oversee the kids’ homework, to spend time with them and put them to bed. Not that there haven’t been days when I’ve had to nip down to the fields for some emergency watering or general upkeep at night, mind you. But I still get to spend time with them.”\nAlexandra Spagnol’s last ‘holiday’ was when she gave birth. Video: Chris Sant Fournier\nThe young farmer’s fields cover a various array of crops – she exports potatoes to the Dutch market; she grows any veggies you can think of, such as kale, tomatoes, onions, zucchini... She is currently planning to experiment with asparagus, despite the knowledge that it’s a big gamble and that the plants take about two years to flourish.\nShe also makes the ever-popular ġbejniet, thanks to a herd of goats that she keeps in a separate field.\n“They are one of the main reasons why I can’t really take a day off, more so than the crops. My uncle would cover for me in the fields for a couple of days, but with livestock you can’t do that. They get very attached to the person who feeds them everyday and tend to shy away from new people. This affects the yield, of course. They love me; the family always jokes that you can easily figure out which part of the fields I’m standing in, as there will be all the goats right behind me.”\nThe goats are also used to her little ones, she adds, particularly her son, who already has an affinity for the land and for livestock.\n“He loves it. He is exactly like I was at his age, wanting to spend every single spare minute of the day in the fields, on the tractor or with the animals. And they are used to him, they love him back,” she says with a proud smile.\nThis begs the question: given all this hardship, how does she feel about a future in farming for her children? It is easy to see that my question produces mixed reactions, that the young mother is torn between pride and caution.\nPeople stare in disapproval when they see me driving a tractor\n“I love the land, so of course I feel proud that my offspring seem to love it just as much. At the same time, it would set my mind at rest to see them with a ‘normal’ job, and a secure paycheque every month.\n“It is not so much the hardship that makes me cautious. Farmers are used to that. It’s the lack of appreciation, the assumptions that we are rolling in money when it’s anything but the case. The system is stacked against us,” she says, a reference to the way that the infamous Pitkali market operates as well as to the fact that Maltese consumers nowadays do not attach value to local produce.\n“I’ve almost stopped using the Pitkali; the Farmers’ Market has been a game-changer for me. I prefer to deal directly with the consumer, anyway. The feeling of satisfaction of actually selling something that you yourself nurtured is incomparable.”\nBut even this is not without a downside. Customers are increasingly reluctant to pay a reasonable amount for produce and expect local farmers to sell their crops at a much lower price than imported fruit and vegetables that are found at supermarkets.\n“People will not negotiate at a supermarket, of course. But they continuously haggle with me, when I’m already charging rock bottom prices. When you consider the expenses involved in farming, if you do the math you will figure out that we’re not rich pretty fast,” she insists.\nThe expenses don’t only include the obvious capital expenditures for crops and equipment but also the unexpected disasters wrought by nature. This year, Ms Spagnol tells me, was particularly cruel, with the weather acting up from one extreme to another.\n“So many crops destroyed, and we have to foot the bill for everything. There was a lot of rain and wind this year, but also a lot of ġlada.”\nĠlada, she explains, is a thin layer of ice that forms over the crops when the air is particularly cold. The result typically tends to be a field full of dead plants.\n“When it’s a particularly cloudless day in winter, we can tell immediately what’s going to happen later at night. We usually go down to the fields at around 9pm to hose down the crops in order to melt down the ice,” she explains.\nWriting that it’s a tough life is somewhat redundant, but Ms Spagnol repeats that the hardships don’t really bother her as much as some people’s attitudes.\n“At school they used to make fun of me for wanting to be a farmer. In all truth, not much has changed now. People remain uneducated about agriculture and what it entails. And they still do not understand the importance of a Maltese farming industry. This is what hurts, not the hard work,” she concludes ruefully.\nEating local\n ", "comment_count": 68, "id": 1291}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A third of mental healthcare professionals in Malta suffer from symptoms of burnout, according to the first study of the sort.\nResearch carried out among inpatient professionals at Mount Carmel Hospital, the Psychiatric Unit and the Gozo psychiatric ward also shows that one out of every six participants are suffering total burnout.\nCarried out by psychiatrists Patrick Barbara and Aloisia Camilleri, the study focused on five professionals, namely psychiatrists, occupational therapists, psychologists and psychotherapists, social workers and nurses.\nDr Barbara noted that burnout was a process that kicked off when an employee was faced with chronic stress at work resulting from various factors, including lack of human resources.\nIt starts with emotional exhaustion, especially when the job involves long working hours and challenging human cases.\nThis is followed by depersonalisation, where a person no longer feels attached to their job, and, finally, low personal accomplishment.\nPeople in the caring professions, such as that of mental healthcare, could often start to doubt whether they were actually helping service users, Dr Barbara said.\nThe research study, which targeted 322 potential participants, had a response rate of 71 per cent out. People in the caring professions could often start to doubt whether they were actually helping service users\nJust under 14 per cent – 13.9 per cent – of the participants reported total burnout, meaning high emotional exhaustion, depersonalisation and low personal accomplishment.\nEmotional exhaustion was recorded among 40.4 per cent of participants and low personal accomplishment was flagged by a third.\nWhen compared to recent data, burnout in Malta is similar to that of other European countries, however, the island registered a high prevalence of emotional exhaustion.\nAlso, in Malta men suffer more from depersonalisation while non-Maltese health professionals (about 16 per cent of the mental healthcare inpatient professionals) suffer more from depersonalisation and low personal accomplishment than the Maltese.\nFor Dr Barbara, the fact that the island compares with other countries did not mean Malta should sit on its laurels and be happy with the situation. Burnout presented a lose-lose situation for both employees and employers, he said. When the well-being of burnt out employees suffered, they performed at a lower standard than they were supposed to, resulting in the organisation losing efficiency, he added.\nResults of the research, called Burnout Among Mental Health Professionals Working in an Inpatient Setting Within the Maltese NHS, were presented at a national conference on neurodevelopmental disorders organised by the Association for Child and Adolescent Mental Health.\nWhile mental health professionals often focused on the well-being of the service users, through the research, Dr Barbara hoped to shed light on the professionals’ well-being. Health professionals worked in a multi-disciplinary team with human resources being the main resource in the psychiatry field, he pointed out.", "comment_count": 6, "id": 1292}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta features to the drive-by, fatal shooting of a man, in an incident which also left two others injured. It also reports on signs that healthcare professionals are suffering from burn-out.\nThe murder also made it to the front page of the Malta Independent, which also reports on a consultation process being planned with an eye to reforming laws on prostitution and human trafficking.\nL-Orizzont also gives prominence to the shooting, accompanied by a story on the controversial order to remove religious symbols from health centres, a decision which was revoked by the Health Minister almost as soon as it went public.\nIn-Nazzjon also refers to the health centre order and its revocation and reports on the murder in Birzebbuġa.\n ", "comment_count": 0, "id": 1293}, {"keywords": "", "author": "Denise Grech ", "article_body": "Denise Grech elicited some reactions to the inaugural speech of Malta’s 10th president, George Vella, after he was sworn in on Thursday.\nHigh expectations surround newly-appointed President George Vella after his inaugural speech, which gave hope that he would raise his voice against environmental destruction, spearhead broad consultations on constitutional reform and speak out on behalf of the marginalised.\nDr Vella said he hoped to be a moral compass for the country and to work to heal divisions, including those caused by the blots on Malta’s character stemming from the murders of Karin Grech, Raymond Caruana and Daphne Caruana Galizia.\nDuring his speech, he also referred to poverty, the harm done to the environment and the right of everyone to a decent quality of life. He said he accepted to take on the role of serving people and to promote Malta’s values, including the fair distribution of wealth.\nHis declaration that he would resign if faced with the choice to sign a Bill legalising abortion received praise from the pro-life community, while pro-choice activists said his position was “unfortunate”.\nOthers kept their feet on the ground: in the context of upholding the rule of law, the role of any president was limited.\nPresident: “The threat of the ‘built-up’ environment as opposed to the ‘natural’ environment is all the more evident, and is becoming more apparent.”\nIt was “refreshing” to hear a President who understood the links between the environment and health and well-being, when institutions seem to have buried their heads in the murky sands of policies, NGO Din l-Art Ħelwa said.\n“We were certainly very happy to hear the President of the Republic express his concerns about what is happening to our built and natural environment, and to pledge to defend such heritage,” the organisation’s head Alex Torpiano said.\nPresident: “We cannot allow ourselves to think that, thanks to our country’s remarkable economic performance, there is no material poverty among our citizens.”\nCaritas said Dr Vella’s speech indicated he will be a strong voice for social justice and people in poverty.\nThese two things were challenging authorities in ensuring no one gets left behind, Caritas director Anthony Gatt said.\nWe look forward to seeing our President act as the moral compass he promises himself to be\nThe organisation also praised Dr Vella’s opposition on abortion, saying it augured well that other issues related to the protection of life, such as policies against drug abuse, would remain on the national agenda.\nPresident: “While the need to reform [the Constitution] in earnest is being felt, I hold that we need to be diligent and cautious in our approach.”\nRepubblika, which promotes the rule of law, said it was encouraged by the President’s comments on constitutional reform.\n“The President seems to be giving a cautionary note here, which we certainly support,” they said, adding this was a signal to the government that “wanted to rush through changes”.\nRead: 'I never imagined myself in this position', says President Vella\nTheir message, like the message of the President, was that consultation on the constitutional reform would not proceed with haste.\nRule of law, they insisted, was in crisis. “Constitutional reform can change that but it is only part of it,” they said. “The root of it is the fact that people who are in government continue to act with impunity,” Repubblika added.\n“The President speaks of moral guidance, but within the very limited powers he has, you can only do so much. We have high hopes [on improvements in the rule of law], but not from Dr Vella, or anyone that can be President – because the role of the President is limited in addressing these issues.”\nPresident: “I will continue to see that there is respect for medical and moral ethics including respect for life from its very beginning.”\nCatholic Voices Malta said the appointment of George Vella had a lot of positive aspects. It cited his defence of the vulnerable, including the unborn child. \nThe President’s speech clearly showed his commitment to place the person at the centre of his presidency, it said.\n“We look forward to see our President act as the moral compass he promises himself to be and as Catholic Voices Malta we wish him all the best.”\nHowever, the Voice for Choice, a coalition of women’s rights organisations, said his unequivocal stance against abortion was “unfortunate”. “His call for unity is very laudable, but we cannot have unity while still spreading stigma,” the coalition said.\nThe Women’s Rights Foundation, on the other hand, said they commended the President’s support for women’s protection and civil liberties.\nPresident: “We have an important role to fulfil in Euro-Mediterranean relations, in bringing Europe closer to the Arab world, in the future development of the African continent, and in inter-cultural and inter-religious dialogue.”\nCatholic Voices also welcomed this declaration, saying that inviting representatives of other religions to Church service before his inauguration in itself was an important message: he wanted to foster a culture of dialogue and be a “President for all,” it said.", "comment_count": 10, "id": 1294}, {"keywords": "", "author": "", "article_body": "Customs officers have seized more than 90kg of cocaine at the Malta Freeport, the latest of a series of major hauls over the past months.\nPackets containing 91.6kg of the drug were found hidden inside compressor compartments of refrigerated containers containing fruit that were headed to an EU member state from an unnamed south American country.\nThe drugs have an estimated street value of €10.2 million.\nScans of the two containers clearly indicated that they were carrying unknown packets, Customs said in a statement on Sunday. A physical search confirmed indications, with 38 packets of cocaine found hidden in each of the two containers.\nThe case has now been handed over to the police’s anti drug squad. A magistrate is leading an inquiry into the case.\nCustoms officials have made some major cocaine finds over the past months. In March, officials found almost €40m worth of the drug in two separate finds, with a further €11m haul in February and €9.7m find at the turn of the year.\nThe cocaine was found inside packets hidden in the containers.", "comment_count": 0, "id": 1295}, {"keywords": "", "author": "", "article_body": "Police are investigating allegations of abuse at a home for the elderly in Mtarfa, the government confirmed on Sunday afternoon.\nThe claims were reported to the police by the residence’s administration, the parliamentary secretariat for active ageing said.\nEarlier on Sunday, Net News reported that a 23-year-old cleaner who works at the home had been raped by a colleague at their workplace.\n“We are taking this case very seriously and are offering the alleged victim all the necessary support,” the secretariat said in its statement.\n“We do not tolerate any form of abuse and will be cooperating fully with the police investigation,” the statement added.", "comment_count": 0, "id": 1296}, {"keywords": "", "author": "", "article_body": "Men, women and children rescued by an NGO vessel off Libya's coast have told the ship's crew they were tortured, enslaved and kidnapped in the North African country they escaped. \nThe Alan Kurdi is carrying 64 people it rescued last Wednesday and remains stranded in international waters outside Malta, with its crew warning that food shortages and bad weather are taking their toll.\nThe ship turned towards Malta on Saturday after Italy’s coast guard refused it entry to Lampedusa.  \nThe vessel, which is operated by NGO Sea-Eye, rescued 64 people from a rubber boat on Wednesday April 3. \n“Food and water supplies will run out shortly and the medical situation can deteriorate quickly once the storm sets in tonight,” warned Sea-Eye spokeswoman Carlotta Weibl on Sunday. \nRescued migrants outnumber the ship's carrying capacity and many are sleeping on deck, she added. \nA Maltese government spokesman had told Times of Malta on Saturday that they were monitoring the situation.\n'In Libya, they sell us blacks as slaves'\nPeople rescued by the Alan Kurdi have told crew members they were tortured, raped and enslaved while in Libya. \nOne woman told the crew that she was trafficked and forced into prostitution. \n\"If you refuse, they will beat you or use knife on you,\" she said as she pointed to a scar on her left leg. \nA rescued woman recounts her memories of Libya. Video: Sea-Eye\n\"Libya is the most terrible country I have ever seen,\" said Benjamin. \n\"They sell human beings. They have sold me twice,\" he recounted. \nItaly denounced\nSea-Eue spokeswoman Ms Weibl denounced Italy for their refusal to come to the rescue of the Alan Kurdi or its rescued crew.\nAccording to the NGO, Italian authorities refused the vessel entry to territorial waters on the pretence that the Alan Kurdi and its passengers represented a threat to “peace, good order or security of the coastal state”.\nThat provision is listed in the United Nations Law of the Sea’s Article 19, which defines what constitutes a violation of innocent passage.\nArticle 19 lists a variety of activities, ranging from use of weapons to military activity, propaganda as well as “the loading or unloading of any commodity, currency or person contrary to the customs, fiscal, immigration or sanitary laws and regulations”, as examples of violations of a foreign ship’s innocent passage.\nPeople are sleeping on the ship's deck, Sea-Eye said. Photo: Sea-Eye/Fabian Heinz\nThe Alan Kurdi abided by instructions and did not enter Italian waters.\nGermany – the ship’s flag state - and the European Union have been negotiating with Italy to try and resolve the impasse, to no avail.\nA deal to evacuate two families among the 64 rescued was aborted after Italy insisted that the fathers of each of the two families would not be allowed onto Italian soil, Ms Weibl said. The families refused to be separated.\n“These are “rescued people” and should not be treated differently by categorizing them based on their legal status, as “migrants,” Ms Weibl said.\n“At sea there is no migrant, banker or plumber: there are only people.”", "comment_count": 0, "id": 1297}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated Monday at 11.30am\nAn order to remove all religious symbols from health centres has been revoked by Health Minister Chris Fearne.\nIn a circular, Primary Care officials told heads of health clinics that all religious symbols, such as holy pictures stuck to walls have to be removed.\n\n\n\nRead: Crucifix in state classrooms ‘no breach of human rights’\nThe reasoning behind this order, to be implemented immediately, was that health centres were a public entity, and should be considered to cater towards a multi-cultural society.\nHowever, in a tweet on Sunday afternoon, Mr Fearne said he disagreed with the decision and that he had ordered that the circular be immediately revoked.\nRead: ‘Crucifix removal never, tolerance always’\nOn Monday, Mr Fearne told Times of Malta that the directive had been issued by the Primary Health Care Nursing Manager.\nHe has asked the CEO of Primary Health Care to investigate and take disciplinary action if necessary.\nMr Fearne said he had not been consulted on this matter.\nAsked by the media about the separation of Church and State, he said politicians should not hinder religious expression.", "comment_count": 260, "id": 1298}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Nationalist Party’s statement against the suspension of Malta’s voting rights in the EU was testament to the state of disarray it was in as it was now contradicting the position taken by its own MEPs, the Prime Minister said on Sunday.\n“I was left baffled how the PN came out against calls to invoke Article 7 with guns blazing... there was no need for such extreme measures,” Joseph Muscat said.\n“The fact that the PN is now taking such position shows that it is not believing what it [its own MEPs] is saying, and acknowledging that this [criticism by PN MEPs] is just cheap partisan propaganda, he said.\nThe Prime Minister made these remarks when addressing a political activity in Ħamrun. Dr Muscat was reacting to the call made a few days ago by Greens MEP Sven Giegold for the European Union to invoke Article 7 against Malta.\nSuch a measure would result in a member state being denied certain rights such as voting, and would also affect EU funding opportunities.\nMr Giegold made this call after the Council of Europe’s anti-corruption watchdog said that Malta’s criminal justice system was at risk of paralysis.\nIn a statement issued a few days ago, the PN condemned this call, saying people should not be the ones who were made to suffer the consequences of the government’s wrongdoing.\nDr Muscat said the PN’s statement on the matter highlighted the party’s inconsistency and state of disarray.\n“This is what happens when somebody [PN MEPs] repeatedly attacks his own country. People are blaming the PN,” he said.\nMEP elections\nCommenting on the forthcoming May 25 European and council elections the Prime Minister insisted that this would be no walk in the park.\nReferring to the survey published by The Sunday Times of Malta which said that the PL had a 22 percentage point lead over the PN, Dr Muscat cautioned against attempts to instill a sense of complacency within the party.\n“I laughed when seeing an analysis which said that the PL had a chance of winning five seats,” he said.\nDr Muscat insisted that under the single transferable vote system used in Malta, it was plausible for a party winning a large majority that it would not even win four seats.\nMDA report\nDr Muscat noted that the report published by the Malta Developers Association allayed concerns of a property bubble as it concluded that the sector was growing at a sustainable rate.\nThough this sector grew by a robust 9%, the fact that other economic sectors registered an even higher growth rate, showed that it was not driving the economy but the other way round.\n“Property is being driven by demand,” he said.\nHowever, Dr Muscat acknowledged that government had taken note of the challenge being posed to first-time buyers by the fact that in a single year property prices had risen by 25%.\n“We will not shy away from this problem. There will be various schemes to support them,” he said.\nEconomy\nDr Muscat hailed the decrease in the number of persons on unemployment benefits from 12,000 in 2012 to 5,500 last December, as testament to Labour’s success in government.\nThe next challenge, he said, was to raise the quality of the jobs being created to ensure better salaries.\nThe Prime Minister also welcomed announcements made by SR Technic that outlined plans to invest €40 million and create 350 jobs, as well as the €20 million investment by Toly Products. However, he hinted that much bigger investment, due to be announced in the coming weeks, was in the pipeline.\nDr Muscat said the only way to have long-term sustainable social justice was through further economic growth.", "comment_count": 23, "id": 1299}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia was quick to hit out at the government “backroom dealings” on Sunday, but made no mention of revelations by The Sunday Times of Malta that two PN MPs close to the party leadership met 17 Black owner Yorgen Fenech over a potential sponsorship deal. \nPN MP Jason Azzopardi slammed revelations about the meeting in a cryptic post on twitter.\n“How can you even thing of being credible on corruption if you, whilst criticising the corruptor, meet him behind the backs of your team mates & the public? Not to mention the possibility of being criminal accomplices”, Dr Azzopardi said.\n\nDuring a political activity in Gozo, Dr Delia accused the Prime Minister of only being concerned with big business.\nOn Greco’s damning report on Malta, Dr Delia said the country’s institutions were clearly failing in their duties.\nHe said the government’s power to appoint the Police Commissioner meant it effectively controlled the police force.\nDr Delia also slammed the Attorney General for failing to protect citizens when the government signed off on the Vitals deal handing over three public hospitals to anonymous businessmen.\nNo to abortion\nDr Delia also unequivocally declared that under no circumstances would the Nationalist Party agree to the introduction of abortion.\nThe Opposition leader said he had no problem declaring the PN’s opposition to its introduction, even if this meant Malta was the only country in the world not to legalise it.\n“We believe in life from conception to its natural end… For the government, a baby in the womb is just eight cells. For us, those eight cells are everything”, he said.\nThe Opposition leader spent much of his speech expressing his agreement with various points raised by President George Vella during his inauguration speech.\nHe highlighted how Dr Vella said the economy should be a just and equitable one, and said the President had identified how a supposedly socialist government had turned its back on society.\nDr Delia accused the Prime Minister of importing “slaves” who were exploited and given a net pay of €400 a month.\nHe clarified that the PN was not against foreign workers, saying those workers should have good jobs in good conditions.\n“This is about treating humans as humans. Muscat is only concerned about balancing the books. He is not even managing that now, as the year ended with a deficit”, Dr Delia said.\nThe Opposition leader questioned how solutions for pensions, infrastructure and social housing could be found when there was a deficit, given that these problems were not even solved when the exchequer was running a surplus.\nDr Delia accused the government of shunning pensioners who were facing ever increasing hardships.\nSome pensioners, he said, were facing an explosion in their rents.\nHe said everyone had a right to have a roof over his head and this was a problem that needed to be solved by the government.\nDr Delia questioned how many foreigners were needed to keep pensions sustainable. He said the government had not plan about future pension.\n“Joseph Muscat knew he was going to spend 10 years in power and leave. Other will then have to suffer the consequences”, he said.", "comment_count": 19, "id": 1300}, {"keywords": "", "author": "Claire Caruana, Denise Grech", "article_body": "Nationalist Party MPs Kristy Debono and Hermann Schiavone on Friday met the owner of once-secret Dubai company 17 Black to seek “possible sponsorship” related to a conference.\nLast year, in a joint investigation by the Times of Malta and Reuters, Yorgen Fenech was identified as the owner of 17 Black, which had been named in leaked e-mails as one of two companies that would pay $2 million to Panama companies belonging to the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nThe PN has called for the pair’s resignations over what it considers a major scandal blighting the country’s international reputation.\nSources told The Sunday Times of Malta on Saturday that at around 11.15am on Friday, Ms Debono and Mr Schiavone walked into the office of Mr Fenech on the 21st floor of the Portomaso Tower.\nContacted on Saturday, Ms Debono initially denied holding such a meeting and when pressed by The Sunday Times of Malta to state whether or not she had indeed met Mr Fenech, the MP and president of the PN’s General Council asked for questions to be sent via e-mail.\nI met Mr Fenech to discuss possible sponsorship of a small conference room\nIn reply to these questions, Ms Debono confirmed meeting the Tumas Group CEO and Electrogas power station director, saying that she had met Mr Fenech “to discuss possible sponsorship of a small conference room”.\n“My intention was to organise this conference, which is on my own initiative and non-profit making. Hence, I shortlisted a number of possible conference venues, in the St Julian’s and Swieqi vicinities.\n“I met Mr Fenech to discuss possible sponsorship of a small conference room and informed him that I am considering as well other venues. Had this materialised, I would have listed the company as a sponsor,” Ms Debono said.\n\n\n\nAsked whether she deemed meeting Mr Fenech acceptable given how critical the PN has been of his 17 Black link, Ms Debono said that party had “never issued any directive for boycotting establishments owned by Tumas Group”.\n“In fact the party and party representatives held political events in these establishments till recently. I will honour any directives issued by the PN as I always did,” Ms Debono added.\nShe did not reply to questions on whether Dr Delia had been made aware of the meeting.", "comment_count": 203, "id": 1301}, {"keywords": "", "author": "", "article_body": "Gozo has all the potential to become the digital destination of the future, MEP Roberta Metsola said on Sunday as she outlined her vision for Gozo during a speech at a PN activity in Nadur. \nDr Metsola called for massive public investment in traditional and digital infrastructure to make Gozo the destination of choice for foreign direct investment and to keep attracting mobile workers to the island.\n“We have the private enthusiasm but we need this to be matched by public decisions. Do not leave Gozo behind,” she appealed. \nDr Metsola said she was working to support EU funding for a more modern Gozo Channel fleet: “It is time for a fourth and fifth ferry, and the fast ferry service has taken too long. People are tired of empty promises, it is time for action.”\nThe MEP, who opened a constituency office in Gozo in 2018, said that Gozo’s particular characteristics meant that tailored solutions were needed to ensure that those people who wanted to stay in Gozo had all the opportunities they needed on the island.\nShe said the future was digital and Gozo provided a perfect environment the global tech revolution could provide. ", "comment_count": 18, "id": 1302}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "An application to develop a hotel specialising in yoga meditation is being recommended for approval on a massive ODZ property in the limits of Qala owned by Labour’s former Gozo minister Anton Refalo, The Sunday Times of Malta has learned.\nThis despite 20 years of controversy over the site and vociferous objections to the latest proposal.\nAcquired in the early 1990s by Dr Refalo and his wife as a small building set on agricultural land with an idyllic view of Daħlet Qorrot Bay, the property has been turned into a large rural residence through piecemeal developments over the past two decades.\nDespite the fact that most of the development carried out, including the building of extra rooms, was originally illegal and followed various enforcement orders issued by the Planning Authority, the Labour MP has always managed to have his sanctions overturned, mostly on appeal, even when the Nationalist Party was occupying office.\nERA is concerned that approval of this proposal would further consolidate uses which are not characteristic of rural areas\nThe latest application to develop this breathtaking 2,000 square metre site was recently presented by Dr Refalo’s wife, Lina, in an apparent bid to finalise what may well be the couple’s dream project.\nThe Refalos have asked the Planning Authority to grant them permission to make further internal alterations and change the use of this property from a residential one to a commercial establishment – mainly a 3-star hotel “specialising in yoga meditation and culinary services”.\nThe last phase of the Refalos’ project includes further changes to the building through the creation of a new basement which will have hotel bedrooms and ancillary facilities.\nDespite the objections of the Environmental and Resources Authority and NGOs, including Flimkien għal Ambjent Aħjar and Nature Trust, the Planning Authority’s directorate has already recommended that the Refalos be given the necessary permits to open their hotel.\nIn a strongly worded objection, the ERA said that the proposed development is of concern and is objectionable in principle.\n“ERA is concerned that approval of this proposal would further consolidate uses which are not characteristic of rural areas.\n“Although the site is committed the use proposed will indirectly increase the impact on the area in terms of further land take-up for further expansions and traffic.”\nOther objectors were not so diplomatic and went straight to the point.\n“The existing building is already illegal and it is already a big eyesore,” one objector lamented.\n“The sanctioning which happened over the years is disgraceful and if given the go-ahead it will inevitably encourage other developers to try the same sort of thing,” another objector said.\nOther objectors referred to the political ramifications, saying the Labour politician appeared to be using his political connections “to bend the rules” and “make a mockery” of the planning process.\nHowever, despite the objections and a long history of illegalities which changed the topography of the site, as can be confirmed by aerial photos taken by the Planning Authority, the development is being recommended for approval.\nDr Refalo served as Labour’s first Gozo Minister until 2017 when Prime Minster Joseph Muscat replaced him with Justyn Caruana.\nFollowing a few months in the political wilderness, he was rehabilitated by the Prime Minister, who appointed him chairman of Heritage Malta – the island’s watchdog on cultural heritage.\n ", "comment_count": 40, "id": 1303}, {"keywords": "", "author": "", "article_body": "A 46-year-old woman was grievously injured early on Sunday when she fell into the sea in St Paul’s Bay.\nThe police said the accident happened along Triq Isouard at 4.30am.\nThe woman is a Serbian national and lives in Mellieħa. She was taken to hospital by ambulance.\nThe police are investigating the incident.", "comment_count": 0, "id": 1304}, {"keywords": "", "author": "", "article_body": "President pledges unity\nGeorge Vella was sworn in as Malta’s 10th President and pledged to work “unceasingly” to strengthen national unity. Dr Vella, 76, succeeded Marie-Louise Coleiro Preca. He insisted during his inaugural speech that one of his priorities would be that of seeking to heal divisions, including those caused by the blots on Malta’s character caused by the murders of Karin Grech, Raymond Caruana and Daphne Caruana Galizia.\nWhat made the headlines\nSon pleads not guilty to killing mother, sister: Joseph Bonnici, 38, of Għaxaq, admitted to the police during interrogation that he had murdered his mother and sister, Maria Lourdes Bonnici, 70 and Angele Bonnici, 29, and he also took investigators to the field in Għaxaq where he had dumped the bodies, a court was told. Mr Bonnici was arraigned the day after the bodies were found, and was charged with the double murder. He pleaded not guilty. The victims are believed to have been shot in their home in Għaxaq and then taken to the field where their bodies were later discovered.\nCharles Camilleri\nGaffarena-scandal protagonist gets top job at Lands Authority: A civil servant who had a central role in the Valletta property scandal that led to the resignation of a parliamentary secretary has been given an executive position at the Lands Authority, the Times of Malta revealed. Charles Camilleri, who the Auditor General had found “colluded” with Mark Gaffarena in the shady Old Mint Street property deal, was appointed acting chief officer for estate management. This is the same office he managed prior to his resignation in the wake of the Gaffarena scandal. However, in a letter published in the Times of Malta the day after this story appeared, Mr Camilleri said that immediately after the National Audit Office published its report he personally questioned these findings through an affidavit outlining his strong reservations. He also appeared before the Public Accounts Committee and was questioned by the police, neither of whom recommended any action against him. He said he had resigned his position at the Government Property Division at the time to be able to defend his integrity.\n‘Forged’ signature documents linked to shelf firm: Documents containing Opposition leader Adrian Delia’s ‘forged’ signature are linked to a shelf company which was one of several beneficiaries of suspicious payments believed to have originated from a London prostitution racket, the Times of Malta reported. Dr Delia had gone to the authorities with documents which he says had his forged signature and asked them to investigate whether they were in any way linked to the findings of a money laundering probe, of which he was the subject last year.\nPublic prosecutor to be appointed by the government: The person who eventually takes up the role of public prosecutor under proposed reforms will be a government appointee, Justice Minister Owen Bonnici confirmed to the Times of Malta. It was announced last month that the government would be hiving off the prosecution role from the Attorney General’s functions. Legal observers have raised concerns that splitting the prosecution role from the Attorney General’s functions would have little effect when it came to high-level corruption cases involving government officials if the public prosecutor was a “friendly figure” chosen by the government. The report by Greco, the Council of Europe’s anti-corruption watchdog, leaked in The Sunday Times of Malta, notes that the criminal justice response to government corruption can too easily be paralysed where political influences come into play.\nCleaning contracts abuses spread to Mt Carmel as ‘cleaners’ abound: Abuse in the procurement and management of cleaning service contracts at Mount Carmel hospital, reported by the Times of Malta several weeks ago, have been confirmed through a new audit by the National Audit Office. The disregard to public procurement rules by the Health Ministry was only discovered by chance, during a separate investigation by the NAO of another contract, for clerical services, which was also found to be grossly irregular.\nPanama Papers yield €9m in taxes: Just over €9 million was recovered by the taxman after offshore dealings were exposed in the Panama Papers three years ago, according to information supplied to the Times of Malta by the Tax Compliance Unit. A total of 237 taxpayers in Malta featured in the Panama Papers – 163 individuals, 62 companies and 12 trustees. Taxmen in 22 countries worldwide raked in more than €1 billion in fines and arrears following investigations into the data exposed by the Panama Papers.\nMaltese priest appointed bishop in Peru: Fr Giovanni Cefai was appointed bishop of the newly set up territorial prelature of Santiago Apóstol de Huancané in Peru, which is part of the archdiocese of Arequipa and which consists of 20 parishes with a population of 200,000 people. Fr Cefai was ordained as a priest in 1997 and was parish priest of the parishes of Santa Cruz and San Pablo Apóstol, both in Arequipa. He was also regional superior of the St Paul Missionary Society in Peru.\nWhat trended\n‘Ma Tagħmlu Xejn’\nThe Commissioner for Standards in Public Life announced this week that Prime Minister Joseph Muscat’s behaviour at a party in his official residence at Girgenti Palace did not constitute a breach of ethics. Not surprisingly, this led to a mixed reaction online.\nIn the leaked video, Dr Muscat can be seen jumping and chanting with the crowd to the former Mintoffian tune Ma Tagħmlu Xejn while his wife Michelle dances in front of him, waving a bottle of champagne.\n“But it was Joseph Muscat himself who was singing the partisan Mintoffian chant Ma Tagħmlu Xejn, not only the guests. Muscat was not just singing but also jumping to the tune. That must have escaped the notice of the Commissioner for Standards in Public Life,” said Dennis.\nAnna believes the whole episode was “no big deal” and that the important thing is that the party was not financed through public funds.\nTo which John replied: “Why? The majority of Maltese elected him as Prime Minister, why not let them enjoy the champagne on the house?”\nToni believed everything was wrong: “A private event in a public place paid by public funds, all ethics were broken!”\nMario disagreed: “The place is the Prime Minister’s official residence which in any case, even if there was no party, it is paid by public funds. But still it can be used by the Prime Minister to host a private party.”\n“I’m no fan of Muscat but everyone deserves to have some fun,” Drin remarked.\nPaul summed it up this way: “The first flop decision taken by the Commissioner for Standards for Public life.”\nPresidential trips\nMany online readers expressed their views on the fact that former president Marie-Louise Coleiro Preca made 89 trips abroad during her term of office, costing taxpayers around €2.5 million in travel expenses.\n“Shocking news, total waste of money. The Office of President should be abolished, I criticised it under the PN too, especially when Eddie Fenech Adami anointed himself President of Malta, he just lacked a crown. This money could have been used to employ more hospital consultants and cut waiting lists,” P said.\n“€2.6 million squandered on ceremonial and entertainment travel with not one euro benefit for taxpayers,” Francis said.\nBut George thought such criticism was unfair. “Are you aware that most of these trips were imposed on her because of her position, and very often she led business delegations? If you wish to focus on costs, you cannot do this without considering the economic benefits that such trips bring about. And the economic results are there for all to see.”\nWhat they said\n“It is very attractive to base politics on the building of walls. But after you build walls all around you, you soon realise you have imprisoned yourself.”\nPrime Minister Joseph Muscat addressing party supporters in Mtarfa on the significance of ‘Freedom Day’.\n“The police cannot be at every party, wedding or family event to monitor what people are drinking.”\nTransport Minister Ian Borg speaking to the Times of Malta in reaction to reports about poor drink-driving enforcement by the police.\n\n“Somebody leaked this document midway through this process. We are in the eighth phase of 15. This was confidential, as it would only be fair to publish it at the end when the process is complete.”\nFinance Minister Edward Scicluna addressing the social partners where he disputed Malta’s poor showing in a recent evaluation by Moneyval of its anti-money laundering regime, on the grounds that the findings were “leaked” midway through the process.\n“I hope to continue witnessing the respect that has been shown thus far towards the ethical and moral bases of the medical profession, above all, respect for life, from its very inception to the individual’s very last breath.”\nPresident George Vella, sending out a strong pro-life message in his inaugural address.\n\n“The President of the Republic has the privilege to be the Head of State. We want to see in him a defender of Malta’s heritage in every sense – cultural, historical, artistic, architectural and natural.”\nArchbishop Charles Scicluna speaking during Mass at St John’s Co-Cathedral before the swearing-in of George Vella as Malta’s President.", "comment_count": 10, "id": 1305}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta leads with a survey it commissioned on the forthcoming European Parliament elections that shows that the Labour Party has a 22-point lead over the Nationalist Party. In another story, the newspaper reports that the government has engaged a new international firm to make a fresh valuation of the St George’s Bay peninsula in St Julian’s, currently occupied by three Corinthia hotels.\nIt also says Nationalist Party MPs Kristy Debono and Hermann Schiavone on Friday met the owner of Dubai company 17 Black to seek “possible sponsorship” related to a conference.\nThe Malta Independent on Sunday interviews newly-appointed President George Vella, who says that some laws Malta was coming under pressure to change have been on the statute books for decades.\nMalta Today says PN leader Adrian Delia has told the police he never opened a bank account in Jersey.\nIllum says Archbishop Charles Scicluna was not pleased he was not given a front seat at the swearing in ceremony of President George Vella.\nKullħadd says the European Commission has told MEP David Casa that Malta has one of the most stringent visa application processes.\nIt-Torċa says Libyans are not answering calls for rescues at sea.\nIl-Mument says Tourism Minister Konrad Mizzi has found himself cornered with regard to the Corinthia deal.", "comment_count": 0, "id": 1306}, {"keywords": "", "author": "Anthony Manduca", "article_body": "A Misco survey commissioned by The Sunday Times of Malta shows Labour with a commanding lead over the PN ahead of next month’s European elections, while voters identify their major concerns. \nSixty-eight per cent of respondents intend to vote in the European Parliament elections due on May 25.\nSixteen per cent will not be voting and the same amount still did not know if they would.\nThere is likely to be a higher incidence of voting among women and among those aged 55 and over.\nAmong those who voted Labour in the 2017 general election, 77 per cent intend voting while only 68 per cent of PN voters said they intended to.\nOf those who stated they intend to vote, or still do not know if they will, 59 per cent said they would vote for Labour and 37 per cent for the PN.\nAlternativa Demokratika and the Democratic Party will pick up just two per cent each of the votes, according to the survey.\nBased on these percentages, the most likely outcome of the election will be four seats for the Labour Party (a gain of one) and two seats for the Nationalist Party (a loss of one). \nHowever, since Malta has the single transferable vote electoral system, what will eventually determine the number of seats is not the number one preferences but the way votes get transferred from one candidate to another. A five to one seat victory for Labour, while unlikely, cannot be ruled out.\nA 37 per cent vote for the PN would be the lowest ever for the party in the post-Independence era; in the last European election in 2014 it won 40 per cent of the vote, while in the 2017 general election it garnered 43.68 per cent.\nThe smaller parties are not expected to make much of an impact at next month’s European elections\nThis poll confirms the trend seen in other published and unpublished polls, of a shift from the Nationalist Party to the Labour Party since the 2017 general election.\nIt also confirms the view that the smaller parties are not expected to make much of an impact at next month’s European elections.\nThose respondents who do not intend to vote were asked why this was the case, with 34 per cent stating they have no interest in voting and 18 per cent saying they do not trust any of the candidates. Other reasons were mentioned but they all obtained less than five per cent of mentions.\nFloating voters\nTwo other questions indicate the extent to which respondents may switch from one party to another between elections.\nForty-two per cent of respondents consider themselves as floating voters. The incidence of floating voters is higher among those aged under 55 and among males, and least in the south-eastern region of Malta.\nSixteen per cent of those who intend voting for the Nationalist Party in the forthcoming EP elections consider themselves to be floating voters, while this is true for 28 per cent of those intending to vote Labour.\nSeven per cent of all respondents claimed to regret the way they voted in the 2017 general election.\nAround half of these claimed to have voted for the Labour Party while a quarter of them claimed to have voted for the Nationalists. The other quarter did not state who they voted for.\nLeaders of the pack\nWhile 59 per cent of respondents are still undecided whom to vote for, 29 per cent of Labour voters named Miriam Dalli as their preferred candidate and 16 per cent named Alfred Sant. The other PL candidates all received a minimal number of mentions. \nAmong Nationalist voters, the top two were Roberta Metsola, at 21 per cent, and Frank Psaila, with 12 per cent. Francis Zammit Dimech (nine per cent) and David Casa (two per cent) followed.\nAs to the factors that respondents will base their vote on, 52 per cent said national issues, 35 per cent said the candidate, 26 per cent said it was the political party, and 23 per cent cited issues related to the European Union.\nThe Labour Party is set to increase its support at next month’s European Parliament elections. Photo: Shutterstock\nForeigners and traffic are main issues\nImmigration and traffic got the most mentions by respondents when asked what they thought were the two most important issues facing the country.\nImmigration – to be interpreted as the influx of foreigners of all nationalities – was mentioned by 28 per cent of respondents, who were not prompted with a list of pre-set replies. In a similar Misco survey two years ago, only five per cent of respondents had cited this issue.\nTraffic was mentioned by 19 per cent of respondents (compared to five per cent two years ago).\nThese were followed by “too much construction” (10 per cent), corruption (10 per cent), cost of living (eight per cent), the cost of property (eight per cent).\nThose aged under 25 and over 54 are less concerned about immigration\nThose aged under 25 and over 54 are less concerned about immigration than other age segments. Similarly, women and persons who are not working are also less concerned about this issue.\nTraffic is seen as the most important issue by persons aged under 25, followed by too much construction work and the environment.\nCorruption increases in importance as one moves up the age groups, while the environment tends to get more important the younger the respondents. \nFor declared Labour voters, immigration and traffic are the major issues, both mentioned by 23 per cent of PL respondents.\nFor declared PN voters, corruption and immigration are by far the major issues, mentioned by 32 per cent and 31 per cent respectively.\nAmong those that consider themselves as floating voters, 31 per cent consider immigration to be the major issue followed by traffic, mentioned by 21 per cent of such respondents.\nFinances a major personal challenge\nAlso unprompted, survey respondents were then asked to state what they consider to be the two major personal challenges they are facing. Personal financial issues (low income, cost of living, low pension) topped the list, mentioned by 25 per cent of respondents. This represents a big rise from a Misco survey two years ago, when 14 per cent of respondents mentioned financial issues as their major personal challenge.\nTraffic was mentioned by 17 per cent (up from 10 per cent in 2017).\nThis was followed by a “stressful lifestyle” at six per cent and the cost of property, also six per cent.\nThe stressful lifestyle and cost of property declines in importance as one moves up the age groups.\nThis is the first time, however, that “stressful lifestyle” has made it into the list of personal challenges.\nAmong declared PN voters, personal financial issues are by far the most often mentioned challenge, at 47 per cent.\nOn the other hand, declared Labour voters see traffic as their major challenge (20 per cent).\nParties’ platforms\nRespondents were also asked to identify the main issues which they believe the main political parties are talking about.\nWhen it comes to the Nationalist Party, 12 per cent said it is talking mainly about corruption, 5.9 per cent thought it was personal financial issues and two per cent said immigration. Fifty-six per cent didn’t know.\nAs regards the Labour Party, a range of issues were mentioned. Seven per cent of respondents said the party was talking mainly about infrastructure, while six per cent said pensions, economic growth and the tunnel between Malta and Gozo. Forty-five per cent of respondents did not know.\nThe concerns\n\n\n\nNational issue\n% Mentions\n\n\nImmigration\n28%\n\n\nTraffic\n19%\n\n\nToo much construction work\n10%\n\n\nCorruption\n10%\n\n\nCost of living\n8%\n\n\nCost of property\n8%\n\n\nEnvironment\n7%\n\n\nAbortion\n5%\n\n\nOver population\n4%\n\n\nInfrastructure\n4%\n\n\n\n\n\n\nPersonal challenge\n% Mentions\n\n\nPersonal financial issues\n25%\n\n\nTraffic\n17%\n\n\nStressful lifestyle\n6%\n\n\nCost of property\n6%\n\n\nJob related issues\n5%\n\n\nEnvironment\n3%\n\n\nPersonal health\n3%\n\n\nImmigration\n3%\n\n\nToo much construction work\n2%\n\n\nCorruption\n2%\n\n\n\nTechnical note\nThis survey was conducted by Misco International Limited among a random sample of 402 respondents. Interviews were conducted by telephone by trained interviewers under the direct supervision of Misco fieldwork coordinators. Respondents were selected using the random digit dialling method. Fieldwork was conducted between the March 27 and 29 A sample of 400 provides a margin of error within ±5%.\nData was weighted according to age, gender, and region. Weighting is used to adjust the results of a study to bring them more in line with what is known about a population. The weighting was done according to the Demographic review of 2014.\nThe age groups used were: 18 – 24; 25 – 34; 35 – 44; 45 – 54; 55 – 61; 62 and over.\nThe regions used were those listed in the Demographic review of 2014, namely: Northern; Northern Harbour; Southern Harbour; South Eastern; Western; Gozo and Comino.\nThe data was also analysed by the occupation of respondents.", "comment_count": 35, "id": 1307}, {"keywords": "", "author": "Anthony Manduca ", "article_body": "The Labour Party is enjoying a 22-point lead over the Nationalist Party, according to a Misco survey commissioned by The Sunday Times of Malta. \nAsked which party they intended to vote for in next month’s European Parliament elections, 59% of respondents said they would vote for the Labour Party compared to 37% for the Nationalist Party. This is broadly in line with previous polls carried out by other organisations.\nThere were 2%of respondents who said they would vote for Alternativa Demokratika and 2% for the Democratic Party.\nRead: Labour well ahead as EP election nears\nBased on these percentages, the most likely outcome of the election would be four seats for Labour (a gain of one) and two seats for the PN (a loss of one). \nHowever, since Malta has the single transferable vote electoral system, what will eventually determine the number of seats is not the number one preferences but the way votes get transferred from one candidate to another. This means a five-to-one seat victory for Labour, while unlikely, cannot be ruled out.\nA 37% vote for the PN would be the lowest ever for the party in the post-Independence era; in the last European election in 2014 it won 40% of the vote, while in the 2017 general election it managed just under 44%.\nThe PN is also facing a problem of getting its support base to vote.  Among those who voted for the Labour Party in the 2017 general election, 77% said they intend voting in the European elections while only 68% of those who voted Nationalist declared their intention to cast their vote next month. \nMiriam Dalli and Alfred Sant emerged as the most popular PL candidates for the MEP elections, with Roberta Metsola and Frank Psaila top among Nationalists.\nRespondents were also asked to name the most important issues which they believe Malta is facing at the moment. Immigration (an influx of foreigners of all nationalities) was the number one issue, mentioned by 28% of respondents. In a similar Misco survey two years ago, only 5% of respondents had mentioned immigration.\nThe next most important national issue identified by respondents was traffic, at 19% compared to 5% two years ago, followed by “too much construction” (10%) and corruption (10%).\nFinancial issues (25%) and traffic (17%) topped the list of personal challenges.", "comment_count": 167, "id": 1308}, {"keywords": "", "author": "", "article_body": "Updated 9.06pm \nA man was killed and another two were injured in a drive-by shooting in Birżebbuġa on Saturday night.\nThe incident happened in Triq tal-Ġebel at around 11pm, with one of the injured men contacting police and reporting the shooting. \nAll three victims are migrants who were walking when they were shot at by a man in a Toyota Starlet.\nSources said the victims were found spread out across a stretch of Triq tal-Ġebel, a country lane often used by migrants walking to and from the open centre in Ħal Far. The fact that victims were not together has perplexed investigators, who are still trying to understand what motivated the murder. They have not excluded that it may have been a racially motivated attack.\nThe shooter is still on the run. The area where the men were shot is well covered by CCTV cameras. \nIdentity confusion\nOn Sunday evening, the police said that the murdered man was a 42-year-old from the Ivory Coast and that they were still trying to confirm the identities of the two injured men.\nOne of them, a 22-year-old who lives in Ħal Far, was grievously hurt. The other was seriously injured in the shooting. On Sunday evening, the police said that their initial description of the second injured man as being 45 and from Georgia was mistaken, and he has yet to be identified. \nBoth men are receiving treatment at Mater Dei Hospital. \nAn inquiry is being held.\nOnly a week ago, a mother and her daughter were found shot dead and partially buried in a field.", "comment_count": 0, "id": 1309}, {"keywords": "Education", "author": "", "article_body": "St Aloysius’ College, Birkirkara, recently won the 10th Malta Mathematics Olympiad, beating 31 other colleges and schools from Malta and Gozo that took part in this year’s competition.\nThe winning team was made up of Haydn Cassar, Alan Brincat, Jason Spiteri and Robert Sciberras Herrera, and their coach Jeanette Aquilina.\nThe Malta Olympiad, which is organised by the Department of Curriculum Management of the Directorate for Quality and Standards in Education every two years, was first held in 2000 and St Aloysius’ College has won it five times.\nThe contest aims to identify talented mathematics students and give them the opportunity to work together as a team in a spirit of healthy competition, under the guidance of coaches, to discover and enjoy the fun of the problem-solving aspect of mathematics.", "comment_count": 0, "id": 1310}, {"keywords": "Education", "author": "", "article_body": "Over 150 educators recently attended a seminar on ‘Supporting gifted learners in a mixed ability class’ that showcased various local enrichment programmes for gifted students.\nThe main speaker was Lianne Hoogeven from Radboud University in The Netherlands, a researcher on educational adjustments for gifted students. Prof. Hoogeven spoke about effective ways of engaging gifted students in class.\nDuring the seminar the participants were also introduced to the Radboud International Training on High Ability (RITHA).\nNine local educators are currently taking part in the first RITHA blended course.\nThe seminar was held at Giovanni Curmi Higher Secondary School, Naxxar, and was organised by the Science Centre, Pembroke, with the support of the Institute for Education.", "comment_count": 0, "id": 1311}, {"keywords": "Education", "author": "", "article_body": "Liza Azzopardi has graduated from Aston University with a Master of Science in Health Psychology. Her studies were partially financed by a scholarship awarded to her by the Education Ministry under the Endeavour (Group B) scholarship scheme to enable her to specialise in the area of health psychology.", "comment_count": 0, "id": 1312}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Ministry organised a special event to give a warm welcome to the three young Gozitan members of the Special Olympics Malta team – Maria-Pia Saliba, Carmelo Pace and Giuseppina Galea – at the Gozo Sports Complex in Victoria. Gozo Minister Justyne Caruana congratulated the athletes on their great success and presented them with flowers and a trophy to mark their achievement. The three participants and Dr Caruana cut a special cake for the occasion which they shared with all those present. On their part, the athletes presented Dr Caruana with a camel as a memento from Abu Dhabi.", "comment_count": 0, "id": 1313}, {"keywords": "Gozo", "author": "", "article_body": "Italian students from Monza and Gozo College Rabat Primary School students gave a musical concert at the Don Bosco Oratory, Victoria. The students played musical instruments and performed songs from The Greatest Showman and the Zecchino d’Oro festival. The highlight of the show was the Italian marching band. The Italian students were led by teachers Valeria Monzio, Alessandra Gatti, Paolo Colombo and Felice Cattaneo, while Hilda Grima and Alison Hili led the Gozitan students. The concert was attended by students, parents and special guests, including Gozo Minister Justyne Caruana.", "comment_count": 0, "id": 1314}, {"keywords": "Gozo", "author": "", "article_body": "Statuarian Michael Cutajar Zahra is seen working on a new Passion statue for Fontana parish. The statue representing the scourging of Jesus at the Pillar will be blessed today during Mass at 4.30pm.\n\nIt will then be carried in a Penitential procession, together with the statue of Christ the Redeemer, also by Mr Cutajar Zahra. Biblical characters will take part in the procession.", "comment_count": 0, "id": 1315}, {"keywords": "Environment", "author": "", "article_body": "The following are a selection of articles and photos submitted by students from various schools taking part in the Young Reporters for the Environment (YRE) programme.\nDive against debris\nAccording to National Geographic, 40 per cent of the plastic we use is single-use. Much of it ends up in our waterways and the percentage of unrecycled plastic waste being washed into the sea is getting higher and higher.\nAquaventure, a dive centre in Mellieħa, decided to do something about it. Its divers conduct about 20 dives per year to collect debris from the sea. And to cut single-use plastic, instead of buying water in plastic bottles it sells reusable bottles.\nAquaventure manager Lee Martin said: “Single-use plastic is not only bad for our environment but also for us, as tiny microplastics, which can be seen in the sand, are being washed out to sea. The fish eat these tiny pieces of plastic, and when we eat these fish they end up in us!\n“I care a lot about our ocean, fish and beaches and we should all care about this problem. It is not going to get smaller unless we all do something. It does not take much to switch to reusable items instead of single-use plastic.”\nMichaela Tickle, Form 2, St Monica School, Gżira.\n\nPlastic versus reusables (PVR)\nSixteen billion disposable coffee cups are used every year. Although they are made of paper the inside of the cups are coated with plastic to laminate them, and they have plastic lids, which just adds insult to injury! The photo shows a disposable cup with a dead plant and straw in the dark in the foreground and a reusable cup in the background. The latter contains a living plant and a reusable straw and has light on it, to stress the message that it is these types of cups and straws that we need to use.\nMichaela Tickle\nNatural beauty vs unnatural destruction \nThe photo shows a piece of land full of beautiful life and natural beauty in the background and plastic bottles in the foreground. The bottle on the right has soil trapped inside it. Plastic is unnatural, and it stops all life from growing. Although they are reusable it is estimated that 22 billion plastic bottles are thrown away every year. People are to blame, not plastic. Plastic is recyclable.\nMichaela Tickle\n\nPublic inconvenience\nThe area between Bulebel industrial area and the bypass going towards Żejtun is turning into a dump. All sorts of waste, including broken glass, plastic, broken furniture and paper is accumulating there all the time. Recently, even a porcelain toilet base ended up in this area, adding to the waste thrown in the street and creating public inconvenience.\nApart from being illegal, dumping waste in the countryside is an eyesore. Moreover, the chemicals and non-biodegradable materials dumped in this manner are contaminating the soil and the groundwater and has become a huge environmental issue.\nŻejtun local council and the Malta Industrial Parks were contacted and an immediate action was taken to clean up and regularly monitor the area.\nGrazia Magro, St Margaret College’s Senior Secondary School, Verdala, Cospicua.\nTo read other students’ entries, visit www.yremalta.org.\nAll sorts of waste is being dumped in the street, even a porcelain toilet base.", "comment_count": 0, "id": 1316}, {"keywords": "Gozo", "author": "", "article_body": "The editorial of Il-Ħajja f’Għawdex for March stresses the importance of the printed word and libraries even in this age of Kindle and other digital platforms. Coincidentally, another article describes three generations of a single family who took up librarianship as a career.\n\nA short biography features Dr John Galea, who has succeeded the late Prof. Joseph Vella as musical director of the La Stella Philharmonic Society.\nThe monthly interview focuses on Bishop George Bugeja, OFM, and his difficult role as Apostolic Vicar at the Libyan capital Tripoli and Bishop of Benghazi.\nThe weather trends in Gozo during 2018 are analysed by Joe Meilak, who runs the Nadur Weather Observatory, while other features provide more information on the fauna and flora of the island.\nAnother article argues for the principle of duplication when it comes to the provision of public services in Gozo and in Malta, in order to reflect Gozo’s regional nature.\nAn extensive review of Charles Bezzina’s latest anthology, Mar-Ritmi tal-Baħar, is also included.", "comment_count": 0, "id": 1317}, {"keywords": "Gozo", "author": "", "article_body": "• A blood donation session will be held at Xewkija District Health Centre today from 8am to 1pm and on Tuesday from 1pm to 5pm.\n• A group of second year University students, in collaboration with the Gozo Ministry and sports entities, will organise a family fun event at the Gozo Sports Complex, Victoria, today from 9am to 1pm. The theme of the event is ‘Let’s all Get Active’. Mass for children will celebrated by Fr Simon Cachia at 9.15am.\n• A Via Crucis on Għammar Hill, next to Ta’ Pinu Sanctuary, will take place today at 4.30pm. Gozo Bishop Mario Grech will lead the reflections. At the end of the Via Crucis, to be broadcast on Radju Marija 102.3 FM, Mgr Grech will give a short message, followed by Eucharistic Benediction.\n• Mortal Engines (12A) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n• The Fondazzjoni Santa Ċeċilja (Gozo) will be presenting ‘The Seven Last Words of the Lord’ by Joseph Haydyn at Our Lady of Pompeii church, Victoria, today, at 7.30pm.\n• The Europe Direct Information Centre (Gozo) is organising a ‘Citizens Dialogue’ with Dr Joanna Drake, deputy director general for Mobility and the Environment within the European Commission, at the Gozo Business Chamber premises, Victoria, tomorrow at 6pm. General issues about the EU will be discussed.\n• Fr Marcello Ghirlando will give Lenten talks at St Anthony church, Għajnsielem, between tomorrow and Wednesday at 7pm. All are welcome. Fr Ghirlando will also celebrate Mass and lead a healing service at St Anthony church on Thursday at 7pm. There will be adoration of the Blessed Sacrament from 6 to 7pm.\n• Il-Fergħa Ewkaristika (Gozo) will be holding an hour of adoration at Our Lady of Pompeii church, Victoria, on Thursday from 9am to 10am. Rosary will be recited at 8.45am.\n• The feast of Our Lady of Sorrows will be celebrated at St James church in Victoria on Friday. Masses will be held every half an hour between 6am and 1pm. Gozo Bishop Mario Grech will celebrate Mass at Independence Square at 6.30pm, followed by a penitential pilgrimage with the statue of Our Lady.\n•The Oasi Group of Volunteers will be organising a figolli bake sale at the Duke Shopping Mall between Thursday and Saturday from 9.30am to 7pm and next Sunday from 9.30am to 1pm.\n• The Friends of the Sick and Elderly in Gozo are organising a charity sale at the private road between Gozo Colleges off Fortunato Mizzi Street next Sunday from 7am to 1pm. Admission fee is €10 per car space on the day. For more information, call 2155 3336, 2155 1180, or 2155 8250 or e-mail admin@fseggozo.com.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1318}]