[{"keywords": "", "author": "Bertrand Borg ", "article_body": "Updated at 4.20pm\nNorth-easterly winds reaching speeds of up to 48 knots are expected to howl across Malta on Sunday, in what promises to be a wet and windy weekend.\nPoor weather is expected to begin on Saturday with a series of isolated showers and gradually increasing northern winds, which will rise from force 5 to force 6 as the day turns to night.\nThose conditions are set to worsen considerably come Sunday, with showers turning to thunder and the winds rising to force 9, according to the Meteorological Office. \nForce 9 on the Beaufort Scale is reserved for strong or severe gales, with winds of up to 47 knots (87km/h) and high waves.\nWeather forecasting site WindFinder – a favourite of mariners and windsurfers – predicts 44 knot winds with gusts of up to 49 knots on Sunday morning.\nAn MIA representative told Times of Malta that winds would veer east-northeast and decrease slightly, to force 6 or 7, as the day progressed. Seas are expected to be very rough. \nThe gale force winds will be accompanied by some chilly temperatures, with the mercury expected to dip to 6 degrees Celsius on Saturday night, according to the Malta International Airport weather station.\nMalta marathon 'definitely happening'\nPoor weather will not however disrupt Malta Marathon plans. Thousands of runners are expected to line up in Mdina on Sunday morning to take part in the annual race, and storm clouds will not stop them, an organiser told Times of Malta.\n“The race is on, it will happen come what may,” they said.\nWindFinder predicts gusts of up to 49 knots.", "comment_count": 36, "id": 4019}, {"keywords": "", "author": "", "article_body": "Heritage Malta has registered as objector to the proposed development at Giardino Zamittello in Pietà.\nThe heritage organisation has also requested the upgrading of Villa Frère's scheduling.\nIt was referring to the proposed construction of a four-storey hotel with a towering 10-floor structure in lieu of the garden and neighbouring property.\nAs the official holder of the title of neighbouring historic Villa Frère, the national agency for cultural heritage is arguing that the proposal would ultimately mean the destruction of the magnificent and important historic garden known as Giardino Zamittello and would also inevitably lead to the crippling of the villa.\nSurviving Grades I and II listed extents of Villa Frère (in yellow) and the Zamittello garden excluding the dwellings (in red).\nThe garden and villa are also being compromised by a six-storey touristic development replacing a two-storey house in a stepped alleyway off the Pietà marina, close to the villa, a seven-storey apartment block on the seafront approved last year and a 10-storey retirement home still under consideration.\nThe agency also requested the upgrading of the scheduling of Villa Frère as a Grade 1 heritage monument and the scheduling of Giardino Zamittello, together with an adequate buffer zone to protect its context.\nRead: Historic villa entrusted to NGO\nGiardino Zamittello is a highly formal garden consisting of a series of walled enclosures originating in the mid-late 18th century, with further embellishment during the very early 1800s in the high baroque, neo-classical idiom.\nViews of Giardino Zamittello featuring the garden walls supporting balustraded walkways, neo-classical niche and central hemi-cyclical staircase and pergola.\nIt includes a tower that was most probably used by the Maltese insurgents during the French blockade.\nDocumentary evidence shows that the house and its garden belonged to renowned auditor Giuseppe Nicolo Zamitt, known as Zamittello, who also owned Palazzo Zamittello on Strada Reale, Valletta, just across from the Royal Opera House, as well as the iconic Castello Zamittello in Mġarr.\nRead: Beyond the walls of Villa Frère\nZamittello was an acclaimed Maltese legislator and man of letters, having a career that spanned the end of the Order of St John’s rule, the Napoleonic occupation, to the start of the British colonial government of Malta.\nViews of Giardino Zamittello featuring the Tuscan tempietto.\nHe was among the first recipients of knighthood when the Order of St Michael and St George was instituted.\nReportedly, he is the only Maltese to be interred in the chapel of the Langue of Auvergne in St John’s Co-Cathedral, after his demise on September 7, 1823.\nPietà is best known for its patrician houses and gardens with the likes of Villa Guardamangia, Casa Guardamangia, Villa Medina and Villa Zammit.\nViews of Giardino Zamittello featuring two of the walled gardens and a pergolated cruciform section with an exquisitely carved central fountain, proposed for demolition.\nVilla Frere and Giardino Zamittello are special in that they offer a symbiosis in how they embrace the raking topography of the ancient Qrejten (Pietà).\nApart from its intrinsic historic significance, Villa Frère is also important for the history of the Maltese language since Mikiel Anton Vassalli spent a long time in the property discussing with Frère how to establish Maltese as a written and taught language.\nOutline of the property proposed to be mostly demolished and rebuilt as a 10-storey hotel.\n ", "comment_count": 8, "id": 4020}, {"keywords": "", "author": "", "article_body": "Updated with Dr Mark Xuereb's reply\nThere is no such thing as a “magic instant cure” for depression and people should be wary of marketing gimmicks designed to take advantage of them, Malta’s psychiatric lobby has warned.\nThe Malta Association of Psychiatry was prompted to issue a statement to that effect following reports that a religious sect was distributing flyers claiming they could cure depression “in three minutes”.\n“Be free from depression in three minutes. Without medicine, without hospitalisation and free of charge,” the flyer read.\nLovin Malta reported that the flyers were produced by the Brazilian sect Universal Church of the Kingdom of God, which has branched out to Malta.\nShortly after news of the flyers made the rounds, the sect uploaded a reworded version of the flyer to the Facebook page of its Malta branch. The reworked flyer did away with the three-minute claim and instead asked readers “What if your new life could start in three minutes?”\nA separate article published by iNews quoted a local psychiatrist as saying that a three-minute treatment for depression did in fact exist. \n“Nowadays there is a three-minute treatment, Theta Burst Simulation,”  Mark Xuereb was quoted as saying.\nTheta Burst Simulation is a form of Transcranial Magnetic Stimulation (TMS), which uses electromagnetic pulses to kick-start areas of the brain. \nDr Xuereb, who has pioneered the use of TMS in Malta, was quoted by iNews as claiming that patients undergoing such treatment felt better within two hours. \nIn its statement, the MAP warned that all claims of quick fixes for depression had to be treated with caution. \nWhile TMS could prove useful for people who were not responding well to other methods, it was not a recommended first-line treatment in line with international guidelines, the MAP said.\nLocal psychiatrists approve its use when it is delivered daily for anything between two and six weeks, though they note that there is a lack of research about its safety when administered to young children.  \n“The mainstay of treatment for depression is psychotherapy and medication,” the MAP said.\n“Contrary to some popular perceptions, such medication when indicated is not addictive and neither is it a 'tranquiliser'. The role of medication is restoring to normal an imbalance of chemicals in the brain.”\nMAP said it was gravely concerned “that people who have influence in the community could easily forget their responsibilities and take advantage of patients who are vulnerable due to their desperate desire to feel better.”\n“The MAP strongly advises all professionals to always remain balanced in their statements and to never forget that medicine is about the individual and not personal gain,” it said.\n'No panacea, but no 'pie-in-the-sky' - Dr Xuereb\nIn a statement later, Dr Xuereb said patients have a right to be guided by healthcare professionals to make an informed decision in their management plan to recovery, based on the best treatment options available to date. Clinicians are obliged to keep up to date and receive training in new treatments which ultimately strive to make their patients better.\nDr Xuereb said TMS is used all over the world by established bodies in the UK, US, Australia and Canada and has been researched for decades.\n\"Like all remedies, it is not panacea but it is certainly not charlatan-speak, nor is it pie-in-the-sky. There are no serious side effects.\"\nThere are about 30 different types of depression, each with particular characteristics and often co-morbid illnesses which act as perpetuating factors. \nPatients have their own personal background, clinical history, medication, co-morbid physical illness and medications which must be factored in when prescribing TMS. \nThe protocol used depends on the clinical presentation and the research available to date. This large number of variables thus poses a veritable challenge when it comes to prescribing TMS which is a rapidly evolving field.\nHe said in Malta, his team is in constant personal contact with the CTMMS professionals who offer regular support.\n\"The fact remains that TMS is a safe, effective, non-invasive, painless and evidence-based treatment for various illnesses including severe depression, anxiety, migraine, pain, addictions, nicotine and alcohol cessation and fibromyalgia. People walk in and walk out of the clinic and carry on with life soon after a TMS session.\"\nMedication and psychological therapies may be inefficient and limited when nerves and their intricate connections are damaged as happens in the case of depressive illnesses, he said.The patient has the right to consider avoiding side-effect inducing drugs and opt for other treatments, including TMS which works on natural and physics principles.", "comment_count": 13, "id": 4021}, {"keywords": "", "author": "", "article_body": "A Sicilian man could not bear spending a 50-minute flight without smoking, so he lit up in the toilet before the plane had even taken off. David Luca Di Dio, 28, from Messina, pleaded guilty to lighting up on a Ryanair plane which was departing for Catania on Thursday afternoon. He was arraigned under arrest before Magistrate Audrey Demicoli who fined him €400 after hearing him admitting to the charges.Police inspector Silvio Magro prosecuted.", "comment_count": 0, "id": 4022}, {"keywords": "", "author": "Denise Grech ", "article_body": "Urgent restoration work will take place at St Paul’s Anglican Pro-Cathedral in Valletta, after large pieces of masonry broke off the tower.\nThe fabric of the cathedral has long been in dire need of restoration. Architects have identified unstable structures, and the fabric of the tower, the spire and the stonework have severe problems. A fund for restoration work – seeking to raise €8 million – was launched some two years ago.\nPrince Charles and billionaire theatrical producer Sir Cameron Mackintosh have both donated hefty sums to the cause.\nRead: Anglican cathedral restoration costs spiral \nBuilt in 1844, the cathedral is one of the most universally recognised features of the Valletta skyline, but experts have long warned the structure was in dire need of restoration. \nA few weeks ago, a large piece of stone fell from the tower, ending up on the street.\nIt was an accident waiting to happen, structural engineer Charles Sciberras feared. Experts had previously identified the cause behind the cracking in the tower – metal rods that had been installed within the stone to reinforce it.\n“It was a technique popular at the time the cathedral was being built,” project manager Guillaume Dreyfuss said. The iron bands laid as the tower went up eventually rusted and expanded with the heat, consequently fracturing the stone.\nA debris-containing net will be installed around the tower this weekend. Four specialised workers abseiling from the spire will instal strapping and netting to the deteriorated areas of the tower.\nThe tower is a challenge to access, Mr Dreyfuss said. Standing at almost 68 metres, it is higher than the Barrakka lift and was, for a long time, the tallest building in Malta.\nUrgent work will start on St Paul’s Anglican Pro-Cathedral in Valletta tomorrow.\nIt was an accident waiting to happen\nSt Paul’s Anglican Pro-Cathedral is a Grade 1 building of local stone in the World Heritage city of Valletta.\nAn organisation called “Save the Valletta skyline”, formed to raise funds for restoration work, has long argued the cathedral would stand at the epicentre of the capital city and a vibrant community centre.\nWork on restoring the cathedral will start in June and a call for applications is open now.\nThe ring road around Valletta will be closed for safety reasons as from tomorrow afternoon due to urgent restoration works on the tower.\nGreat Siege Road will also be closed on Sunday (from 7am onwards) and Monday, Tuesday and Wednesday (from 3pm onwards) while the net is installed.", "comment_count": 18, "id": 4023}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The office of the Attorney General is refusing to say whether it will file an appeal on a corruption case involving former Rabat mayor Frank Fabri, currently occupying the role of permanent secretary at the Education Ministry.\nA few weeks ago, the court, presided by Magistrate Donatella Frendo Dimech acquitted John Borg, a cleaning contractor, on charges of corrupting Dr Fabri.\nThe court acquitted Mr Borg on technical grounds, as the prosecution had failed to prove the veracity of recordings of conversations made by Mr Borg himself. \nThe court also threw out statements Mr Borg had made to the police in which he said he had given Dr Fabri money in relation to a public contract for road cleaning in Rabat.\nConfirming that the police had investigated Dr Fabri on the claims made, referring to his time as Rabat mayor in 2006, it confirmed that no charges had been pressed against Dr Fabri as “the prime witnesses against him were undergoing criminal charges in court”.\nAlthough the police confirmed to Times of Malta that, after the latest court decision, they had passed the court file to the Attorney General to consider appealing, Attorney General Peter Grech did not reply when asked if his office would be filing an appeal.\nDr Grech was also asked why charges against Dr Fabri were never presented in court and whether the alleged corruption case was now time-barred.\nLegal experts described the police actions on this case as “odd”, as while they had brought charges against Mr Borg for “corrupting Dr Fabri”, no charges were ever made against Dr Fabri himself. “A corruption case normally takes at least two sides to happen,” the sources insisted.\nPrime witnesses against him were undergoing criminal charges in court\nDuring the actual court case, Dr Fabri had chosen not to reply to questions order to incriminate himself.\nAsked by Times of Malta to state whether he had received money, as alleged by Mr Borg, Dr Fabri did not reply.\nHe only said that “the court judgment confirms the unfoundedness of the allegations and my innocence”.\nHowever, legal sources said that Dr Fabri was actually “never accused of anything by the police” and it was only the court case against Mr Borg that shed light on claims against the Education Ministry’s top civil servant.\nCourt proceedings show that Mr Borg had told the police and other parties that he used to pay Lm150 (€345) a month to Dr Fabri in connection with a cleaning contract in Rabat.\nMr Borg, who had also provided the police with recordings of telephone conversations in which he had recounted his dealings with Dr Fabri to third parties, also claimed that Dr Fabri had afterwards asked him for an increase in the alleged ‘kickbacks’ and to start paying him Lm250 (€575) a month. According to Mr Borg, after he refused, Dr Fabri had terminated his contract.\nDuring the same proceedings, an acting executive secretary at the Rabat local council had confirmed to the court that Mr Borg’s contract was stopped on the direction of Dr Fabri “due to bad workmanship”.\nDr Fabri had resigned as Labour mayor in 2007.\nInvestigators told the newspaper that normally such a proof is “basic prosecution procedure” in such cases.\nThe AG has a 20-day time window to appeal a case from the day a sentence is given by the courts.\n ", "comment_count": 99, "id": 4024}, {"keywords": "", "author": "", "article_body": "A 22-year-old man was seriously injured on Friday when he fell from the balcony of an apartment in Sliema.\nThe police said the accident happened in Triq de Piro at 5.30am.\nThe victim, a Swede, was assisted on site by a medical team and then taken to hospital by ambulance. The balcony was about three stories high.\nThe police are investigating.", "comment_count": 0, "id": 4025}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Friday’s newspapers.\nTimes of Malta says two members of the judiciary and a lawyer in government employ have been shortlisted for the post of new judge at the European Court of Human Rights. In another story, it said the EU Court of Justice has turned down an application by Pilatus Bank calling for an interim remedy over claims that the European Central Bank violated its rights.\nThe Malta Independent speaks to former homosexual Matthew Grech who says that in a democratic society he can proclaim that homosexuality is a psychological disorder.\nL-Orizzont says that home rentals have increased 175% in five years.\nIn-Nazzjon leads with the Nationalist Party’s launch of a consultation process to ensure that dyslexic students are not left behind.", "comment_count": 0, "id": 4026}, {"keywords": "", "author": "", "article_body": "Updated at 2.36pm\nChief Justice Emeritus Giuseppe Mifsud Bonnici has passed away aged 88.\nKnown as 'Ġoġo' and the elder brother of President Emeritus Ugo Mifsud Bonnici, the Cospicua-born judge occupied several key national posts throughout his life.\nHe was appointed judge in 1988 and later chief justice in 1990.\nBetween 1992 and 1998, he served as Judge of the European Court of Human Rights in Strasbourg.\nHe was nominated chairman of the Law Commission in 1999 and chairman of the Commission for Press Ethics from 2001 to 2009. He was chosen to represent Malta in the European Study Group on Civil Law from 2004 to 2009. He was president of the Chamber of Advocates from 1978 to 1983 and president of the Casino Maltese for almost 15 years.\n\nAlso renowned in the field of sports, he was president of the Malta Football Association between 1968 and 1982. Originally, he was a delegate for St George’s FC on the MFA council.\nHe also served on the UEFA Disciplinary and Control Commission (1970-1982) and the UEFA Appeals Board (1982-1984), as well as the World Cup Appeals Board (1982).\nHe was also Malta’s chess champion in 1955.\nIn an opinion in Times of Malta in December 2016, Ray Mangion, the university’s head of Department, Legal History & Methodology, wrote that Judge Mifsud Bonnici cherished three personal achievements.\n“First of all, he was the initiator of a motion in the Chamber of Advocates, countenanced by Sir Anthony Mamo that induced the Bench in 1965 into reaching a unanimous agreement so that all judicial causes would start according to appointments, and end in the shortest time. When he was elevated to the judgeship in 1988, he issued a circular to all advocates to clarify and explain that he would follow such a system. He managed to decide over 1,000 cases in a couple of years.\n\n\n\n\"Secondly, he was the proposer and redactor of the constitutional amendments that set up the Commission for the Administration of Justice in 1994. He was its first vice-president.\n“Thirdly, he was instrumental in excluding any judge from every temptation to become head of State. He was the first chief justice to persuade Prime Minister Edward Fenech Adami into establishing that the president of the courts would not automatically be made President of Malta in the latter’s absence.”\nJudge Mifsud Bonnici, who was also was very active in the media following his retirement, was married to Maria née Cremona and they had three daughters - Josette, Marie and Anna.\nCondolences\nThe Institute of Maltese Journalists extended its condolences saying Judge Mifsud Bonnici, saying he helped local journalism safeguard the ethical principles on which serious and professional journalism is based.\nJudge Mifsud Bonnici served as chairman of the Journalists' Ethics Commission for eight years.\nThe Nationalist Party said Judge Mifsud Bonnici had given a great service both to the country and at a European level. He would be remembered as a person of integrity and defender of human rights.\nThe Malta Football Association  said his dedication and love of Maltese football was not only reflected by his tenacity and determination during his 14-year tenure as president of the association but also through his continued attendance for all international home matches at the National Stadium, even up to the recent UEFA Nations League games.\nHis loyalty and commitment to Maltese football would serve as an example and lasting legacy of true support and devotion to the game he  led during some very challenging years for the association.\nThe Tumas Fenech Foundation for Education in Journalism said that although his greatest contribution was in the legal field, even on international bodies and in sport, he also made an outstanding contribution in drawing up the Code of Ethics and then interpreting it in practice as chairman of the Commission for Press Ethics.\nThe Chamber of Advocates recalled the utmost respect with which Judge Mifsud Bonnici, who led the chamber for several years, was held. \nHe continued to attend Chamber events even when advancing age and frailty had made it challenging, they noted. \n\"We have not only lost a stalwart of the profession but a giant and constant point of reference. He loved the profession and the profession loved him\". \n ", "comment_count": 43, "id": 4027}, {"keywords": "", "author": "Jacob Borg", "article_body": "The EU Court of Justice has turned down an application by Pilatus Bank calling for an interim remedy over claims that the European Central Bank violated its rights.\nThe bank applied for an interim measure from the European Court of Justice in November to annul an order for all communication between Pilatus Bank and the ECB to be made through the “competent person” appointed by the MFSA last March to take control of the day-to-day running of the bank.\nVeteran US financial regulator Lawrence Connell was appointed by the MFSA to run the bank following the arrest of its chairman Ali Sadr in the United States last March on money-laundering and sanction-busting charges.\nPilatus Bank argued that the order by the ECB to channel all communication through Mr Connell lacked any legal basis in national or European law.\nKnee-jerk manner with which it took action against the bank\nThis request for an interim measure was turned down by the Court of Justice last month, on the basis that Pilatus Bank did not provide evidence to support its contention that the ECB had refused to communicate with it if such communication was not channelled through Mr Connell or communicated without the approval of the latter.\nThere was no reason to believe that the ECB would in fact refuse to accept such communication from Pilatus Bank, the court maintained.\n“That is even more unlikely since the ECB has expressly acknowledged in its written observations that, in view of a judgment by the Court of Appeal of Malta of November 5, 2018, it will no longer request the applicant ‘to coordinate’ with the competent person its communication with the ECB,” the court said.\nPilatus Bank’s licence was withdrawn by the ECB in November upon a recommendation by the MFSA.\nApart from the action being taken at EU level, the bank has also brought a number of cases against the MFSA over the way it handled the case.\nPilatus Bank has objected locally to the way the MFSA appointed Mr Connell and effectively shut down all the bank’s operations.\nRead: EU watchdog backs proposal to withdraw Malta's Pilatus Bank licence\nAccording to legal filings by the bank, the MFSA informed it about a directive freezing all its operations through a telephone call, rather than a written notification as required by the law.\nOne financial industry source who spoke to Times of Malta said there was a real risk that the MFSA might lose the case brought against it by Pilatus Bank, due to the “knee-jerk” manner with which it took action against the bank following news of Mr Sadr’s arrest.\nPrior to his arrest, the bank had been in the spotlight after an FIAU report highlighted shortcomings in its anti-money laundering procedures following a 2016 inspection was leaked.\nA subsequent visit by the FIAU had found no reason to take further action against the bank.\nLast year, the European Banking Authority found the FIAU in breach of anti-money laundering laws over its handling of the case and the lack of follow-up action in 2016.  ", "comment_count": 31, "id": 4028}, {"keywords": "", "author": "Denise Grech ", "article_body": "People were being told their concerns were simply \"problems of success\", Opposition leader Adrian Delia said.\nSpeaking during a meeting of the Nationalist Party general council, Dr Delia said Prime Minister Joseph Muscat was laughing at the people's problems and boasting of a surplus.\nThe government was not acknowledging that it did not have a long-term plan, the Opposition leader added.\nThe Nationalist party, on the other hand, did not see people as a problem, but as a resource.\n\nReferring to reports that an influx of students led schools to resort to mobile classrooms, Dr Delia said children having lessons in containers were being told this was the result of success, he added.\nRead: Mobile classrooms under consideration for some overcrowded state schools\nHe also hit out at comments by Education Minister Evarist Bartolo who joked that all schools in Malta would be shut down and children and teachers would be sent to have classes in containers at the Freeport. \n\"He is making fun of those who are saying our children deserve better,\" Dr Delia said.\n\nTurkish workers in containers\nDr Delia said that Turkish workers were being made to live in containers while they worked on construction project. Times of Malta reported earlier this week how hundreds of Turkish construction workers flown to Malta had been moved to a quarry in Mqabba.\nThese people were living in \"worse than precarious\" conditions, the Opposition leader said.\nHe also echoed alarms raised that Malta's dwindling reputation in the financial sector was affecting banks.\nHSBC CEO Andrew Beane warned earlier this week that damage to Malta's reputation was affecting the bank negatively. The bank reported that its profit had slid by 23%.", "comment_count": 7, "id": 4029}, {"keywords": "", "author": "", "article_body": "The government has nominated judges Abigail Lofaro and Lorraine Schembri Orland and lawyer Victoria Buttigieg as its candidates for the European Court of Human Rights.\nThe nominations became necessary as Judge Vincent A. De Gaetano’s term will expire towards the end of September.\nThe government said in a statement the choice of the three candidates was made following a public call.\nIt said that, on the basis of these nominations, the process will now start by the entities concerned, in line with the Convention for the Protection of Human Rights and Fundamental Freedoms and a number of Resolutions of the European Council’s Committee of Ministers, for a Maltese judge to be appointed to sit on the Court.\nThe candidate acquiring the absolute majority of votes by the members of the Council of Europe's parliamentary assembly would be declared elected as the Maltese judge to sit on the Court.\nThe results would be publicly announced by the assembly’s president.\nThe government thanked Judge de Gaetano for his service and useful work in the court.", "comment_count": 5, "id": 4030}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The father of a young mother at the centre of a violent fight at Żabbar last Sunday afternoon was granted bail after he pleaded not guilty to threatening police officers with a metal bar.\nThe 46-year-old Vittoriosa resident, living on social benefits, was arraigned on Thursday afternoon over his alleged involvement in the brawl, after having been discharged from hospital where he was being treated for a medical condition, triggered by Sunday’s incident.\nProsecuting Inspector Joanna Piscopo charged the man with the attempted grievous bodily harm of a police sergeant, threatening the officer as well as disobeying police orders and breaching the peace.\nThe man had apparently rushed to his daughter’s assistance after a call from the latter saying that she had been assaulted by her estranged partner when she called at his Żabbar residence to collect their four-year-old son.\nAt the time of the alleged aggression, the 25-year-old woman had been accompanied by her mother and another child fathered by another partner, a 20-year-old from Cospicua.\nThe latter had also rushed to the scene of the fight upon getting a call from the woman and had lost his temper upon catching sight of his terrified child who had witnessed the whole scene.\nThe woman, who ended up suffering fractures to her hand, accompanied her father outside the courtroom on Thursday with her arm in a sling. Both of her estranged partners had been arraigned separately in court on Monday.\nThe woman’s father pleaded not guilty and was granted bail against a deposit of €500, a personal guarantee of €3,000, and an order to sign the bail book once a week and to abide by a curfew.\nThe court, presided over by magistrate Astrid May Grima, took note of the fact that the man had cooperated with the police and had already been granted police bail before his arraignment.\nInspector Joanna Piscopo prosecuted. Lawyer Albert Zerafa was defence counsel.", "comment_count": 0, "id": 4031}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "British High Commissioner Stuart Gill. Photo: Chris Sant Fournier\nWith five weeks to go until Brexit, Theresa May still shuttling to Brussels, and MPs from both Labour and Conservatives abandoning their parties, it is perhaps not easy to look at the future with confidence.\nBut British High Commissioner Stuart Gill told the Times of Malta that in spite of the short-term challenges, he is confident that the outcome will be a positive one once the dust has settled.\nViewed from outside the UK, it is not always easy to understand why there is so much resistance to the deal hammered out last autumn, let alone to why a second referendum has been ruled out and what would happen if the UK left with no deal. One question at least seems to have dissipated over the past weeks: whether there will be a Brexit at all.\nMr Gill goes through various aspects of the scenarios, explaining what could and could not happen at each twist and turn – but also what the long-term outcome should be.\nHowever, his ultimate message was a positive one: “Our friends in Europe are going to remain our friends in Europe. We work through Nato, the UN and the Commonwealth. And that is a pretty powerful network of alliances and friends, among people with whom we share values and beliefs – including Malta.\n“We are looking to a very positive future. We are not going to go and sit in a corner; we are going to agree on our own trade deals. We are going to have a close relationship with the EU and with many other countries. And we are very positive. There is a process and it might be challenging at the moment. No one said this would be easy: it is complicated. But there is a direction of travel.”\nListen to the full interview here. Audio: Chris Sant Fournier (.mp3 file)Your browser does not support the audio element.\n\n\n\n\nHighlights of the interview:\nOn the backstop:\nNo one in the negotiations – and certainly not the British government – wants to do anything which affects the Northern Ireland peace agreement, the so-called Good Friday peace agreement.\nOn the peace agreement:\nAn open border with a common travel area, and all the cross-border movement … was a crucial part of the peace agreement as it took away the security on the border and any concept of a ‘hard border’. Going back to that runs the risk of going back to a situation which would recreate those tensions.\nOn another referendum:\nWhat would the question be and would it solve the situation that we are currently in now? The government has made it very clear that we had a democratic decision and it would be a betrayal of that position not to see it through.\nOn bilateral trade deals:\nEvery trade agreement that the EU has so far agreed with a third country started without regulatory convergence. In this case, we are starting from the opposite. We already have regulatory convergence so the question is not how close can we get – but how far apart we want to remain…\nOn the future relationship:\nIn the course of the negotiations, there are going to be a lot of creative ideas. But there will be a very close trading relationship between the EU and the UK, with the UK outside the institutions and the customs union.\nOn the impact:\nIt is not a move towards isolationism. As the Foreign Secretary Jeremy Hunt said, it does not mean we are going to move the United Kingdom geographically to some quiet part of the globe.\nOn Malta:\nOur relationship will get stronger. We may not be sitting next to each other in the rooms in Brussels and Strasbourg and Luxembourg. But our shared history and beliefs and constant interaction at all levels of economics, culture, security, you name it, these are going to go on.", "comment_count": 51, "id": 4032}, {"keywords": "", "author": "", "article_body": "Mario Gafá has resigned from CEO of the Foundation for Tomorrow’s Schools, the government said.\nIt said in a statement that, under his leadership, the FTS finished the project for the construction of a new primary school in Marsaskala, which was unveiled on Wednesday, and has contributed to the progress of important project deliverables such as the VET labs across Malta and Gozo, school extensions, and the planning for the construction of new schools, such as those in Qawra, Msida and Victoria.\nThe Education Minister thanked Mr Gafá for his commitment to the foundation and the service he has provided through his role since 2017.\n‹›-+Page:  /", "comment_count": 4, "id": 4033}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A female van driver was cleared of all criminal liability in a road accident wherein a motorcyclist suffered grievous injuries after a court concluded that there had been no shortcoming on her part.\nRodianne Desira, 26, had been targeted by criminal prosecution over her allegedly negligent and dangerous driving which had caused the collision on Dawret Ħal Għaxaq in March 2014.\nThe woman had exited a side road, heading towards Gudja, when a noticeable bump towards the rear end of her vehicle caught her attention. It was only then that she realised that a motorcycle had crashed into her van.\nThe motorcyclist had been driving along the main road, keeping close to the central strip, heading towards Żejtun, when the accused’s van had crossed his path, the sudden manoeuvre making it next to impossible for the motorbike to avoid impact.\nThe motorbike rider later explained how he had spotted the van at a standstill at the stop sign, before it drove out onto the main road just as the motorcyclist had driven past.\nYet the van driver painted a different picture of the dynamics of the incident, explaining that she had been at a standstill at the stop sign when another driver on the main road had signaled her the all clear.\n“The accused did not in any way just exit onto the main road without taking all necessary precautions,” the court observed, after taking note of all the evidence, pointing out that it had been the motorcyclist who had miscalculated the situation, driving ahead when the van had already exited the side road.\nIn fact, the bike had collided with the rear part of the accused’s van, the court observed, declaring that “even circumstantial evidence indicated no shortcoming on the part of the accused”.\nThe court, presided over by magistrate Simone Grech, cleared the van driver of all accusations declaring that it had not been proven that she had failed to abide by traffic regulations taking all necessary precautions as a side road user.\nLawyer Robert Galea was defence counsel.", "comment_count": 0, "id": 4034}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A Maltese teenager was sentenced to four years in prison after killing a cyclist in Poland while driving under the influence of marijuana.\nThe 18-year-old, who was driving without a licence, has also been banned from driving for life, according to Polish media.\nThe teenager was driving a Mercedes in Bielawa, near the Polish capital Warsaw, when he fatally hit a 77-year-old cyclist on June 3.\nThe underage driver lost control of a Mercedes hatchback while on a curve and veered into the opposite lane, hitting the man and killing him on the spot.\nThe Maltese man, identified in the media as Piero C, was arraigned in court in June, charged with breaking traffic laws and causing the fatal accident through recklessness.\nNews outlets had reported the driver was sober at the time of the incident. However, subsequent drug tests showed he was under the influence of marijuana.\nAccording to the Warsaw District Court, he was driving at double the speed limit of 30 kilometres per hour.\nHe has also been ordered to pay PLN30,000 (nearly €7,000) to the wife of the deceased cyclist.\nThe defence said the verdict – which is not final – was too harsh. It argued that the court did not take into consideration mitigating circumstances, such as the age of the driver or the incorrect road markings.\nTesting for substances took place some weeks after the incident, according to the defence, which also appealed the decision.", "comment_count": 0, "id": 4035}, {"keywords": "", "author": "", "article_body": "The Nationalist Party has launched a consultation process aimed at ensuring the success of dyslexic students.\nThe process was launched by education spokesman Clyde Puli and MEP Francis Zammit Dimech at a consultation meeting on dyslexia with stakeholders and professionals at Europa House in Valletta.\nMr Puli said the PN would be listening to parents, teachers, heads of schools, organisations and professionals and move a number of concrete proposals for the sector. He thanked all those helping children with so much ability and dedication.\nDr Zammit Dimech said he had led the European Charter for Dyslexia initiative and was working for this to also reflect the vision of stakeholders.\nThe meeting was also addressed by Richard Broadbent, from the UK’s Dyslexia Institute. He said that less than one per cent of people with dyslexia were diagnosed and there was still astigma and lack of awareness.\nHe said technology could be of major benefit to dyslexics and the European Charter was important for the education system not to fail any student.", "comment_count": 1, "id": 4036}, {"keywords": "", "author": "", "article_body": "A project for the re-introduction of the barn owl was launched on Thursday by Parliamentary Secretary Clint Camilleri.\nMr Camilleri said the mating project was aimed at reintroducing the species. A number of mating barn owl were placed at the Razzett tal-Bagħal in Buskett, where the inauguration took place. \nMr Camilleri said that this was one of a number of projects by NGOs promoting the conservation of wild birds. A total of €106,188 were invested in the projects. This particular project was being managed by the hunters’ federation, FKNK.\nHe said the project would re-establish a barn own population in environments suitable for Malta and Gozo through their release in the natural environment. A special technique that had been successfully practiced in the United Kingdom would be used.\nMr Camilleri said that the scheme was being financed through hunting related fines.", "comment_count": 28, "id": 4037}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man currently facing drug-trafficking proceedings following his arraignment last month has been granted bail after spending a month under preventive arrest.\nJosef Mahouchi had been arrested in January together with a Dutch man who had admitted to conspiracy to traffic some 300 grams of cocaine and possession of drugs not for personal use.\nMr Mahouchi had denied the charges and was remanded in custody.\nHowever, the Criminal Court, presided over by Madam Justice Consuelo Scerri Herrera, on Wednesday upheld an application filed by defence lawyer Mario Mifsud requesting bail.\nAlthough having a foreign surname, the accused was a Maltese national, had strong ties in Malta and had also cooperated fully with the police. Moreover, most of the civilian witnesses had already testified, the court was told.\nThe Attorney General had countered that the charges were serious and the accused was not trustworthy, since he had allegedly committed an offence while under a suspended sentence.\nWhile observing that the gravity of the charges was not to be taken in isolation, the court further noted that, though not spotless, “it could not be said that it is a terrifying criminal record, as this court is often faced with”.\nMoreover, pending testimony by civilian witnesses was not a sufficient bar to the granting of bail, the court said, therby upholding the application against a deposit of €25,000, a personal guarantee of €25,000, an order to sign a bail book twice daily and to abide by a curfew.\nInspector Anthony Scerri prosecuted, while lawyer Elaine Mercieca appeared on behalf of the Office of the Attorney General. Lawyer Mario Mifsud is defence counsel.", "comment_count": 0, "id": 4038}, {"keywords": "", "author": "", "article_body": "A public consultation process for the introduction of cremation services has been launched by Health Minister Chris Fearne and MP Rosianne Cutajar.\nThe consultation period is open until March 29.\nIt will then be evaluated and discussed before a Bill is moved for debate in Parliament.\nThis would be moved by Ms Cutajar as a Private Member’s Bill.\nRead: The trial that led to cremation’s legalisation in the UK\nDr Fearne said Malta was the only country in Europe which did not have a law on cremation and burials on the island were primarily and in their great majority in cemetery vaults. There were a few requests for burial at sea.\nEvery request for cremation had to be executed in a foreign country. Malta did not even have a regulatory framework on cremation which, among other things, covered the grant of the required licence.\nIn 2015, the Planning Authority published a policy on cemeteries as well as guidelines on crematoria.\nRead: Cremation must be green and affordable - Malta Humanist Association\nIn November 2017, a debate at parliamentary committee level was embarked upon.\nMs Cutajar said public research showed that a third of the population wanted an alternative to traditional burial. Cremation had the least negative impact on the environment and gave relatives the opportunity to retain a memento of their loved ones. It also cost much less than traditional burial.\nOn the viability of crematoria in Malta, Ms Cutajar considered due to the lack of a regulatory framework.\nRead: Dying to be sustainable – burial or cremation? - Anne Zammit", "comment_count": 19, "id": 4039}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Long-awaited works at the Il-Magħluq marshland in Marsascala are likely to go ahead after the Planning Authority indicated its approval of dredging plans filed by the government’s environment agency.Ambjent Malta has applied to dredge silt and sand that is currently blocking water circulation at the Natura 2000 site, one of only two saline marshlands in the south of the island and an important habitat for the endangered Maltese killifish (bużaqq).The works are intended to address the poor water quality at the reserve, a longstanding cause of frustration for the Marsascala local council.The plans had been recommended for refusal on procedural grounds as they lacked final endorsement from environmental and cultural heritage authorities. However, at a hearing on Thursday, the PA board unanimously indicated its intention to approve the works, with Environment and Resources Authority (ERA) chairman Victor Axiak urging members not to shoot down the “crucial” project. A final vote will be taken at a future hearing. Il-Magħluq consists of the salt marsh proper and an elongated lagoon, both of which are ecologically important. This area once consisted of two interconnected fish ponds, but the direct link between them was cut off when the current road was built. Pipes placed to allow water circulation between the bay and the ponds have become partially blocked by silt, debris and other accumulated material. Concerns were raised during the PA hearing about the impact of works on the protected killifish. The species, the only local fish that lives in brackish water, has been declining in numbers at Il-Magħluq due to litter, predators and poor water circulation at the habitat. Ray Caruana, coordinator of the national killifish conservation project, proposed that work take dredging works should not be carried out in winter, since the killifish generally kept to the muddy substrate or shelter in the submerged algae during the cold months.\nHe said that works were best becarried out between July and October, after the peak breeding activity was over.", "comment_count": 1, "id": 4040}, {"keywords": "", "author": "Claire Caruana", "article_body": "Less than two per cent of drivers involved in serious accidents are being breathalysed, a study among insurers has revealed. \nCarried out recently by the Malta Insurance Association among all its members, the study showed that the authorities breathalysed only a few of those involved in such accidents. \n“While insurance companies are obliged at law to compensate third parties, they have to go through a lengthy court process to ascertain whether a drunk driver – hence driving illegally under the influence of alcohol – was to blame,” association head Adrian Galea said.\nThis newspaper sought the insurers’ views after data tabled in Parliament this week by Home Affairs Minister Michael Farrugia showed that in recent years, the number of motorists tested for alcohol remained relatively constant. \n \n\nLast year, 165 drivers were tested, of which 106 were found to be driving under the influence of alcohol. \nIn the previous year, 155 drivers were breathalysed while in 2016, this figure stood at 241, the highest in four years. There were just 146 drivers tested for alcohol in 2015.\nOn these figures, the association head insisted that insurers remained sceptical, questioning whether promises by the authorities of efforts being stepped up were truly being kept. \n“While it needs to be acknowledged that on-going, road-safety campaigns together with the introduction of the penalty points system may contribute to greater awareness, enforcement needs to be stepped up.\nTwo tests every five days considered way too low\n“An average of 160 breathalyser tests per annum [between 2017 and 2018], or two tests every five days is considered, by any stretch of imagination, way too low, hence this degree of scepticism,” Mr Galea said.\nSimilar concerns had already been raised by the insurers earlier this year when it emerged that during the festive period, only five of the 558 drivers stopped on New Year’s Eve were given a breathalyser test. \nBy law, the police can only conduct such a test if they have reasonable suspicion that the driver had been drinking.\nApart from introducing mandatory breathalyser tests when there are serious accidents, insurers are also insisting on more random breath testing, especially in places where the police know that alcohol is being consumed in large quantities. \nSuch testing should also be stepped up at times when prevalence of drink-driving is high, Mr Galea went on. \n“Regular, on-going presence on our roads sends a very strong message that drink-driving is not tolerated and that abusive, drunk drivers should not be behind the wheel,” he said. \nThe Malta Insurance Association  head also reiterated concerns that apart from testing for alcohol, the police needed to also start checking for drivers under the influence of drugs, adding that the police needed to be in a position to do so and this required changes in legislation.\n“The police need to be empowered, through changes in legislation, which needs to reflect and acknowledge this reality we now face and through better resources to help them cope with the call for better enforcement,” he said.", "comment_count": 57, "id": 4041}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Logistical obstacles hampering criminal proceedings involving the daughters of former EU Commissioner John Dalli appeared to have been surpassed on Thursday, with the court upholding a request for the two to be tried separately since health problems are making it difficult for other co-accused to show up in court.  \nCriminal charges were issued more than a year ago against Louise Dalli and Claire Gauci Borda, alongside foreign nationals Eloise Marie Corbin Klein, Charles Ray Jackson, Elizabeth Jean Jackson and Robert Mitchell McIvor.\nBut no progress was made since then on account of health issues afflicting the four foreign co-accused. All six were charged over allegations of money laundering, misappropriation of funds, fraud, making a false declaration to a public authority and the falsification and use of documents.\nRead: John Dalli's daughters appear in court on fraud charges\nMs Gauci Borda stands separately charged with breaching the Money Laundering And Financing Of Terrorism Act and with failing to carry out her professional duties as an accountant and auditor.\nOver the past months, one of the co-accused, Robert Mitchell McIvor, passed away, while the health of the other foreign co-accused deteriorated. Their lawyer Arthur Azzopardi informed the court that Ms Jackson had survived a stroke, while Ms Corbin Klein had mobility problems which meant both were impeded from being present in court.\nMr Jackson has also began to show signs of serious health problems.\nWhile the court, the prosecution and the parties’ lawyers sought to solve the impasse, lawyers Stefano Filletti and Stephen Tonna Lowell, assisting the Dalli siblings, insisted upon the separation of proceedings to pave the path to a speedier course of justice.\nWhen the joint proceedings resumed on Thursday, the court, presided by Magistrate Aaron Bugeja declared that in view of an application by the Commissioner of Police, requesting a separation of the proceedings and since the defence lawyers did not object, the request was being upheld by the court.\nThe court declared that criminal action is to be taken firstly against Ms Gauci Borda and Ms Dalli, secondly against Ms Corbin Klein and thirdly against Mr Jackson and Ms Jackson, with fresh charges being issued respectively.\nHaving also been presented with a copy of the death certificate of Mr McIver, the Court declared that in this respect “the criminal action is to be deemed extinct.” ", "comment_count": 0, "id": 4042}, {"keywords": "", "author": "", "article_body": "The former Fisheries department director general, who is suspended after reports of alleged misconduct, insisted on Thursday that an audit report had not found any shortcomings in her regard but had pointed to problems in her department because of an acute manpower shortage.\nReacting to comments in parliament by Nationalist MP Jason Azzopardi, who tabled the 100-page Internal Audit and Investigations Department (IAID) report, Andreina Fenech Farrugia said it was manifestly unfair to try to attribute to her shortcomings made by operators or others, over whom she had no control.Andreina Fenech Farrugia\nShe said she had always sought to address the problems in her department to the best of her abilities and according to the resources available.\nAs a result of the 2010 audit, an action plan was drawn up providing for an increase in staff. It was because resources were improved that the situation in the department improved in the following two years.\n\"That report is itself the best evidence that the problems of the time were due to a lack of resources and not shortcomings by me,\" Dr Fenech Farrugia said.\nShe insisted she had always flagged any shortcomings to the competent authorities. When she was appointed director general after a public call, she had herself asked the IAIA for an update of their audit.\nOther audits were carried out annually by DG Mare. For years while she was in her post, the DG reported it was satisfied with operations, she said. \nHowever as the sector grew, the department found itself lacking 65 members of staff. She had repeatedly drawn attention to this situation, which she could not address herself.\nAn internal inquiry conducted in 2017 by Dr Paul Cachia did not appear to have found any irregularities by her, Dr Fenech Farrugia continued. That inquiry was not about her, but about how the Aquaculture Department operated. That department was not led directly by her.\nIn her statement, Dr Fenech Farrugia again insisted she had never acted irregularly and was always professional, fair and impartial in the conduct of her duties.\nThose making allegations about payments could easily verify that the payments were made to her as Director General of Fisheries in terms of the law. She strongly denied ever having solicited or received personal payments, and any allegations of bribery were therefore unfounded.\n2010 audit report reflected badly on PN government\nMeanwhile, Labour MEP candidate Josef Cutajar said in a press conference on Thursday that the internal investigation report of 2010 revealed the shortcomings in the Fisheries Department when the PN was in government.\nFurthermore, the PN government “hid” the important investigation. Mr Cutajar said it appeared that only Dr Azzopardi and the PN government knew about this investigation.\nAsked by the Times of Malta if the Labour government was aware of this investigation, which found shortcomings in the sector, Mr Cutajar said it was not in Dr Fenech Farrugia’s file.\nWhen it was pointed out that records of such an investigation must have been retained elsewhere, the parliamentary secretary for fisheries Clint Camilleri suggested that the question be addressed to Dr Azzopardi.\nMr Camilleri said that the government always took immediate action when irregularities were found. He said stricter controls had been imposed on fish farms by this government.\nQuestioned why Dr Fenech Farrugia was reappointed to her role by the Labour government in 2013 after being transferred in 2010, Mr Camilleri said the Public Service Commission had found her to be the most competent person for the job.\nHe clarified that her previous role was that of director, whereas the role she took up in 2013 was of director-general.\nMr Camilleri said efforts were under way to attract more manpower to the fisheries department, although this was not easy.", "comment_count": 31, "id": 4043}, {"keywords": "", "author": "", "article_body": "It is the duty of regulatory authorities to ensure foreign workers brought to Malta for jobs carried out by foreign contractors are not subjected to unacceptable conditions that would also give them an unfair advantage, the Malta Developers' Association warned on Thursday.\nIn a statement in the wake of reports started in Times of Malta about the workers being housed in mobile homes in quarries, the MDA said all workers, irrespective of nationality, and employed in the construction industry in Malta should have the same rights and conditions.\nREAD: Turkish workers moved into quarry sleeping compound\n\"Accommodation for such workers should be of a good standard that is acceptable in a modern European state and that such accommodation should be adequately serviced with water, electricity and drainage services,\" the association said.   \nIt also called on the Ministry of Finance to ensure that foreign contractors in Malta were subject to the same level of taxation that Maltese contractors are obliged to observe.\nTimes of Malta reported that dozens of Turkish employees, working for TACA Construction, are reported to already be living on site, housed in a former residence in the same quarry and now turned into a number of small bedrooms.\nHowever, due to an influx of more workers expected to arrive in the coming months, a large area in the Mqabba quarry is now being turned into a ‘small village’ to host the foreign workers.", "comment_count": 35, "id": 4044}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated Thursday 11.09am\nApplications to build fuel stations on outside development zones near Ħal Far and Żabbar were withdrawn on Thursday, just before the Planning Authority was about to take a decision about them.\nThe applications had both been recommended for refusal, on grounds that the chosen sites are not eligible for new ‒ as opposed to relocated ‒ fuel stations, and the “excessive” amount of land they would take up.  \nThe Żabbar application, submitted back in 2010, would have taken up an area of agricultural land on Triq Villabate amounting to 3,700 square metres, above the maximum threshold of 3,000 square metres set by the Fuel Stations Policy, although the actual built-up area would have been smaller. \nThe fuel station would have included a parking area, a commercial outlet, office space, industrial units and a garage. \nIt ran into opposition from the Agriculture Directorate, Transport Malta and the former Environment Protection Directorate, the last describing the project as “upfront objectionable”. \nThe directorate said the proposal was of significant concern as it would commit the entire site, part of a designated Area of Agricultural Importance, and currently subject to an enforcement notice for illegal works, to a development which it said was not acceptable on ODZ land. \nMeanwhile, the Ħal Far application, occupying a massive 4,200 square metres adjacent to a shooting range, similarly drew objections from environmental authorities as well as the Birżebbuġa local council and NGOs. \nNo end in sight to long-promised review of planning policy\nThe Environment Protection Directorate said the proposal would create a precedent for further development along the arterial road, in an area which acts as an open gap between the Freeport and Ħal Far industrial estate. \nDin L-Art Ħelwa and Nature Trust had also objected to the continued uptake of virgin land for the building of fuel stations.\nLawyers representing the developer of the Ħal Far site asked for a reassessment as the applicant had submitted new plans indicating that a kerbside fuel station in Victoria (Gozo) would be decommissioned, making this case a relocation. The PA board, however, board ruled that such a change could not be made at this stage and that the application would have to be resubmitted. The applicant withdrew the case before a vote could be taken. \nThe two applications were set to be the seventh and eighth decided on since the Fuel Stations Policy review was announced in January 2018. Two have been approved, one a renewal, while four were rejected. \nSeveral new applications have also been submitted in the same time, which will all eventually be assessed under the existing policy. \nThere has been no word on the review since the Environment and Resources Authority (ERA) presented its proposals for a new, more restrictive, policy last April. \nIn an interview with The Sunday Times of Malta, planning Minister Ian Borg suggested that the revised policy would still allow relocated fuel stations to be built on ODZ land, barring only entirely new facilities.", "comment_count": 32, "id": 4045}, {"keywords": "", "author": "Keith Micallef", "article_body": "Resurfacing work to repair the ‘wavy’ parts of the Mellieħa Bypass, which cost taxpayers €2 million, are yet to be carried out, despite the government’s pledge that it would be done at the turn of the year.\nCompleted in June last year, the project was mired in controversy from the very start in the wake of the decision to narrow part of it and accommodate a service road next to a massive block of apartments under construction. \nFaced with a public outcry, the government said it would be “reconstructing” the bypass and retain the four-lane configuration. \nHowever, once the project was completed it transpired that the speed limit in the narrow part had to be halved to 40 kilometres per hour for safety reasons. The controversy was revived a few months later, when motorists started complaining that parts of the newly-laid asphalt were bumpy. \nThe contractors would start the job as soon as possible in the coming weeks\nLast October, Labour MP Clayton Bartolo flagged the matter in Parliament to Transport Minister Ian Borg. In his reply Dr Borg said that tests were under way on the quality of the asphalt itself, and the “longitudinal regularity” – the term used to determine if the bumps or depressions are within acceptable limits. \nFrom another parliamentary question, this time filed by Opposition MP Chris Said, it transpired that parts of the arterial road had to be resurfaced as they were not up to standard. Furthermore, the Transport Minister had insisted that the contractor would have to carry out the work at his own expense.  \nInfrastructure Malta, which was responsible for this project, pointed out that the resurfacing would be done after the festive period. Yet, nearly two months down the line, the bumpy ride along parts of  bypass is still there.\nAsked when the repairs would be carried out, a spokesman for Infrastructure Malta declined to give a specific timeframe saying that the contractors would start the job “as soon as possible in the coming weeks”. \nAccording to the spokesman all the required assessments on the road quality were only completed this month, even though preliminary tests had immediately indicated that parts of it were not up to scratch.", "comment_count": 23, "id": 4046}, {"keywords": "", "author": "Sarah Carabott", "article_body": "It is time to ‘walk the talk’ when it comes to protecting unaccompanied children who are on the run from persecution, United Nations Special Representative Virginia Gamba is urging.\n“I call on stakeholders to start implementing what we have discussed for three years. We need to ensure a human rights approach and that whatever transit or destination countries do, they do it in the best interests of the child, the Special Representative for Children and Armed Conflict told the Times of Malta.\nMs Gamba is in Malta for the third edition of the Lost in Migration Conference: Global Strategies and Political Commitments, organised by the President’s Foundation for the Wellbeing of Society and Missing Children Europe.\nChildren on the move include those whose families are trying to protect them from army recruitment, sexual abuse or abduction, while other fleeing minors have been left orphans by the conflict.\nShe noted that some children who were abducted by armed groups and managed to run away also followed the flows of displaced people.\nIn 2015, Europol identified 10,000 displaced unaccompanied children, a figure that has increased six times. Since 2015, when the problem was first identified in Europe, there has been a lot of policy-generation in the European Union – a discussion in which Malta had a central role, especially when it comes to children, she said.\nMs Gamba referred among others to the Global Compact for Migration, which was adopted at the end of last year. \nThe inter-governmentally negotiated agreement, prepared under the auspices of the UN, stated clearly that statelessness should not remain an issue for unaccompanied migrants. \nIt had also noted that unaccompanied children had a right to a family, so they needed to be either reunified with their relatives or provided with a family environment.\nThe compact also called for improved data collection and identification of the most vulnerable children.\nThe UN, Ms Gamba said, called for the implementation of such recommendations, which would see member states working with NGOs, the UN and the EU.\nIn launching the conference, President Marie-Louise Coleiro Preca insisted that the unacceptable lack of national protection and ineffective solidarity among EU states was exposing migrant children to violence, exploitation, trafficking, and abuse. \nShe said she hoped this year’s conference would help increase pressure on addressing the “horrendous situation where thousands of children go missing on European soil”.\nAccording to the European Migration Network, more than 30,000 unaccompanied children went missing between 2014 and 2017, and the number of missing cases that are being solved is actually decreasing.\nRead: Refugee actors cancel Malta shows after immigration denies actor entry\nIn her address, she noted that preventing unsafe migration and the subsequent horrendous trafficking of children was the first step to effectively tackle the issue of unaccompanied migrant children. \nTo achieve this goal, the involvement of countries of origin and of transit was fundamental, she insisted.\nMs Coleiro Preca said that unfortunately, we were still a long way from effectively addressing the needs of children who have been victims of all sorts of violence, before and during their departure. \n“I am sad to note that the necessary referrals to national child protection systems are not always implemented, nor are they treated with the necessary urgency,” she said.\nDelays in determining the status of children who arrived in Europe and were considered ‘stateless’ was another challenge that further compounded the difficulty of assuring their rightful protection. \nIt was therefore crucial that authorities pinpointed appropriate people who were responsible for child protection at every stage of the identification and registration, she added.\nOn the other hand, frontline European states must be supported by the “entire family of European countries” to ensure the necessary expertise was provided in a consistent and sustainable manner.", "comment_count": 12, "id": 4047}, {"keywords": "", "author": "", "article_body": "Bright green water at Chadwick Lakes is a natural phenomenon and had no significant harm on the marine species there, a leading marine biologist said.\nMany were alarmed to see the water at Chadwick Lakes turn bright green, however, expert Alan Deidun noted, the waters there normally turn green towards the end of the rainy season. \nThis is mainly due to the high concentration of nutrients in the water.  \n“These nutrients most likely leach from the surrounding fields after runoff from heavy rainfall, as a result of intense fertiliser use in local agriculture,” Prof. Deidun said.\nThe nutrients fuel a bloom of phytoplankton populations in the water, turning it into a rather alarming shade of green. \nThe phenomenon, a disturbance known as eutrophication, can result in the depletion of oxygen levels and in blocking out sunlight, necessary for marine life using the light for photosynthesis, Prof. Deidun said.\nMost of the species in the water were probably adapted to its occurrence, given the site was a heavily-impacted and disturbed one. The site was also “far from pristine”, he said.\nThe phenomenon will fizzle out with the onset of the dry season in a few weeks’ time, he added.\nGreater promotion of organic farming, a lower reliance on artificial fertilisers and a greater reliance on slow-release natural fertilisers, such as manure, would help mitigate but not eliminate the annual phenomenon, Prof. Deidun said.\nAn extensive bioengineering programme will be included as part of a rehabilitation programme of Chadwick Lakes. Environmental authorities are looking to eradicate alien species and allow native habitats to thrive.\nAmbitious restoration plans for the sensitive valley and watercourse will involve the elimination of several plants, including species of acacia and prickly pear, which have a negative impact on existing habitats.\nPhytoplankton turned the water at Chadwick Lakes into a bright shade of green. Photo: Jonathan Borg", "comment_count": 34, "id": 4048}, {"keywords": "", "author": "Claire Caruana", "article_body": "No one at the Lands Authority is being held responsible for a massive data breach that this week was confirmed by the Data Protection Commissioner.\nA spokesman for the authority, which was slapped with a €5,000 fine on Monday after it was found to have infringed General Data Protection Regulations, said that following an internal investigation, it was found that the data breach was a result of a flaw that was designed in-house. \nThe employee who designed the technical mechanism that caused the flaw has since left the authority, the spokesman said in reply to questions on who should be held responsible. \nThe spokesman also confirmed that the authority would not be offering those impacted with any compensation. \nInstead, the entity is “informing its online applicants that it was found to be in breach of article 32 of the General Data Protection Regulations, in line with the instructions received from the Information and Data Protection Commissioner”.\nAsked to explain what this entailed, the spokesman said that there was a “whole process in place” that ensured those impacted were contacted. No replies were forthcoming when this newspaper re-quested further details on the process. \nThe data breach was a result of a flaw that was designed in-house\nOn what is being done by the authority to make sure that clients’ personal data was safe and that there would not be any similar breaches in the future, the spokesman said that penetration testing by foreign contractors was being carried out, while hosting has been migrated to MITA, the government’s technology arm, to “mitigate any potential risks”. \nDespite it being standard practice for government entities to store sensitive data on servers owned and managed by MITA, when the breach occurred, files and information of the Lands Authority were hosted on servers owned by the authority itself.\nOn the website, which had been designed by Weebee Ltd in 2017, the spokesman said that a new site has not been designed but it was slightly modified to ensure “the highest level of performance”. \nQuestions on how much this cost and whether the same developers were engaged also remained unanswered. \nThe data breach was exposed by the Times of Malta in a joint investigation with The Shift News in November, after a massive flaw in the authority’s website inadvertently dumped a huge amount of data online, with ID cards and e-mail correspondence being made searchable through a simple Google search. \nclaire.caruana@timesofmalta.com", "comment_count": 32, "id": 4049}, {"keywords": "", "author": "", "article_body": "The following are the top stories featured in Malta's newspapers on Thursday:\nTimes of Malta reports that breathalyser tests are carried out in less than two per cent of serious traffic accidents. It also reports on the fast-rising concerns about housing among the Maltese.  \nThe Malta Independent highlights the opening today of a major Church conference about how it deals with children. It also reports that the 'victims' of last year's double-decker bus crash have sued Transport Malta and the operator.\nIn-Nazzjon says the banking sector is feeling under threat as a result of Malta's reputational loss. It also reports that the CEO of the Foundation for Tomorrow's Schools has been sacked.\nl-orizzont highlights through a front-page picture, the opening of a new government primary school in Marsascala. Its main story, however, is about cleaners in the health sector who have seen a drop in their pay. The newspaper also discusses the various ways how people deal with the loss of a loved one.\n ", "comment_count": 0, "id": 4050}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Prime Minister Joseph Muscat had “lied barefacedly” when he claimed to have been unaware of any misconduct justifying the transfer of currently suspended Fisheries director Andreina Fenech Farrugia away from the Fisheries Department in 2010 Opposition MP Jason Azzopardi claimed on Wednesday.Dr Fenech Farrugia has denied claims of wrongdoing.\nSpeaking on the adjournment in Parliament, Dr Azzopardi said Parliamentary Secretary Clint Camilleri had also lied to Parliament when he stated that there was “no record” in Dr Fenech Farrugia’s file stating why she had been transferred in 2010.\nHe also claimed that Environment Minister José Herrera had known of a magisterial investigation into Dr Fenech Farrugia since October 2018, but had nevertheless only taken action when the tuna bribery allegations story broke on Spanish and Maltese media.\nRead: Malta's fishy business mapped out\nThe Opposition MP tabled a 100-page report compiled by the Internal Audit and Investigations Department (IAID), which falls under the Office of the Prime Minister and reports to the Principal Permanent Secretary.\nThe report, he said, had followed a request by European Commissioner for Fisheries Maria Damanaki for an administrative inquiry on the basis of Malta’s poor performance on bluefin tuna, and preceded Dr Fenech Farrugia’s removal in 2011.\nHe also tabled the minutes of a 2013 meeting held between Marlene Bonnici, who was at the time the Maltese permanent representative to the EU, and Lowrie Evans, director general of the EU Commission Department for Maritime Affairs and Fisheries, or MARE.\nRead: Fisheries corruption claims ‘just tip of iceberg’\nThe minutes quoted Ms Evans stating that the Maltese fishery had been “completely transformed” during the preceding two years, especially considering that the sector had been in dire straits in 2011.\nDr Azzopardi asked the Prime Minister to justify why he had instructed former environment minister and now a member of the European Court of Auditors, Leo Brincat, to appoint Ms Fenech Farrugia to the Fisheries Department’s top post.\nRead: Malta's fishy business mapped out\nBetween the IAID report, which was in Dr Fenech Farrugia’s file, and the minutes of the meeting with the director general of MARE, he had had plenty of information on her previous conduct.\nNevertheless - perhaps because of the enormous influence wielded by interests in the sector - he had removed the person responsible for the transformation of the Maltese fishery for the better and replaced him with Dr Fenech Farrugia.\nRead: Revealed - Tuna tycoon and Malta fisheries 'boss' phone calls\nEven now, Dr Fenech Farrugia had been suspended on full pay when an average civil servant under investigation for “stealing a bar of soap” would have been suspended on half pay.", "comment_count": 63, "id": 4051}, {"keywords": "", "author": "", "article_body": "Archbishop Charles Scicluna heaped praise on investigative journalism which exposed clerical child abuse and gave the Church the opportunity to tackle the problem and make amends.\n“Thanks to the media for their interest in this topic, not only from a journalistic point of view but for so many investigative stories that brought this topic to where it should belong.\n“Journalists became part of the solution,” he told a press conference at the Vatican.\nPope Francis has called a summit on preventing clergy sex abuse. The meeting, with almost 200 participants, will take place between Thursday and Sunday.\nThe organisers will meet a dozen abuse victims who have gathered in Rome to protest about the Catholic Church’s response to the crisis and demand an end to decades of cover-up by Church leaders. The victims will not address the summit but will meet organisers on the eve to discuss their aspirations and expectations.\nMgr Scicluna, the Vatican’s leading sex crimes investigator and an organiser of the meeting, said the summit will focus on the key aspects of dealing with the crisis: responsibility, accountability and transparency.\nJournalists became part of the solution\n“We need to come together to make the church a safe place. The Church is a no-go area if you’re not going to be responsible [for your actions],” Mgr Scicluna told journalists.\nAsked whether there was still omertà in the Church when dealing with clerical child abuse, as he said a few years ago, Mgr Scicluna replied: “Silence is a no-go. Whether you call it omertà or state of denial, it’s still a no-go. Whether it’s criminal or malicious complicity and a code of silence due to the trauma, we need to move away from it.”\nAsked why the summit was focusing on minors and not on wider clerical abuse, including on vulnerable adults, particularly seminarians, Mgr Scicluna said bishops will be discussing all misconduct and that follow-ups will be of essence.", "comment_count": 10, "id": 4052}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An elderly man who pleaded not guilty to sexually molesting his friend’s girlfriend, whom he allegedly lured to his home under a false pretext, was remanded in custody upon his arraignment on Wednesday.\nManweli Zahra, the 67-year old Birżebbuġa resident was charged with groping the 32-year-old vulnerable woman, forcing himself upon her in an unwanted show of intimacy, and demanding sexual favours.\nThe man had apparently lured the woman to his home on Sunday afternoon, telling her that he had news about her boyfriend whom she had not seen for a while.\nHaving chatted to her previously about her boyfriend and thus gained her trust, the man’s invitation was taken up by the unsuspecting woman who went to the accused’s home where the alleged offence was committed.\nThe man pleaded not guilty and requested bail, his legal aid counsel Yanika Bugeja stating that the man was still presumed innocent and further pointing out his clean criminal record.\nMoreover, given the man’s apparent mobility problems, the prospect of his escape from Malta was rather unlikely.\nHowever, prosecuting Inspector John Spiteri strongly objected to bail, not only because of the nature and severity of the offences, but also on account of the manifest fear of tampering since the alleged victim, although an adult, was a vulnerable person, susceptible to easy manipulation.\nMoreover, the case was still at a premature stage, noting further that the accused had first allegedly gained the woman’s trust and then committed the alleged crime.\nIn the light of these submissions, the court, presided over by magistrate Marse-Ann Farrugia turned down the request for bail.\nInspector Roderick Attard also prosecuted.", "comment_count": 0, "id": 4053}, {"keywords": "", "author": "", "article_body": "More than €1.3 million were invested at Castille in the past six years, Prime Minister Joseph Muscat said on Wednesday.\nReplying to a parliamentary question by Nationalist MP Jason Azzopardi, Dr Muscat said a good chunk of the investment, which came to €1,315,023, was on refurbishment.\nDr Muscat noted that nearly the same amount - €1,261,117 - had been invested in the refurbishment of Castille by the last Nationalist administration.\nThe aim of the investment carried out in the past years was to give the auberge the dignity it deserved as the Prime Minister’s office.\nWork carried out since 2013 included whitewashing and other works related to offices and halls, interventions on the lighting system to get this in conformity with modern standards, the replacement of furniture, work on office doors, skirting works, parquet floorings, gypsum works, floor polishing, work on office windows and halls, replacement of curtains, work on CCTVs and work on the restrooms and kitchenettes.\nDr Muscat noted that in the past six years, the auberge hosted a series of events related to the Commonwealth Heads of Government Meeting, the Valletta Summit 2015 and the EU Council Presidency in 2017. This was apart from 50 visits by foreign heads of states, prime ministers and other personalities.\nIn January 2014, there had also been a fire at parts of the reception area.The procedure followed for the works was in line with government financial regulations, Dr Muscat said.", "comment_count": 20, "id": 4054}, {"keywords": "", "author": "Luke Scicluna", "article_body": "It had not been in the government’s interest to expropriate the Fekruna lido, former Lands Commissioner Peter Mamo said on Wednesday.\nHe was addressing the Public Accounts Committee which was continuing with its discussion on a National Audit Office report into the 2013 land deal by the previous Nationalist administration.\nAccording to the report, on March 5, 2013, just days before a general election, the Land Department had signed a contract transferring two properties (one in Swieqi, the other in San Ġwann) worth €4.3 million jointly as payment for land expropriated at Fekruna Bay, Xemxija.\nThe Fekruna land was valued at €5 million and the difference in favour of Fekruna Ltd, €700,000, was offset against amounts due to the government by the company in lieu of capital gains tax and duty on documents.\nThe report found that taxpayers had lost more than €1 million through the deal.\nMr Mamo said that, in principle, expropriation involved a “forced” land transfer, where the seller was not a willing party to a sale.\nHowever, both the government and the landowners had been willing parties, and had carried out negotiations to identify the sites for which Fekruna would be exchanged even before the commencement of the expropriation process.\nThe government had gone ahead with expropriation because this was the only way for the landowners to be given government land in exchange, also known as permuta.\nAs a result, the €5 million at which the land had been valued - which had yet to be allocated - had appeared on the government’s books as expenditure.\nMr Mamo explained that he had “not been directly involved” in the Fekruna case beyond the drawing up of plans, as he was still a technical officer in 2013, and his testimony was, therefore, based on what he had read in the case file.\nHe identified various administrative shortcomings in the process leading up to the expropriation which, he said, he would not have permitted.\nThese shortcomings included the start of negotiations with landowners before authorisation was obtained from the minister who was politically responsible for the project which expropriation would make possible.\nIn this case, ministerial authorisation should have come from then Environment Minister Mario de Marco, as the expropriation was justified on the basis of environmental reasons.\nIn cases falling under his responsibility, where requests were made in the absence of such authorisation, or where authorisation had been provided by a parliamentary secretary in lieu of a minister, he had refused to carry them out before ministerial authorisation was provided, he said.\nOpposition MPs argued that the intention was to grant the public access to the foreshore, but Mr Mamo asserted that access had already been granted through a previous expropriation of that foreshore itself. What was expropriated in this case was the lido, so that it could be removed.\nMr Mamo also flagged the government’s willingness to resort to arbitration after the landowners rejected the government’s own valuation, and the consideration of valuations drawn up by architects acting for the landowners, as decisions with which he did not agree.\nThe expropriation should have been carried out on the basis of the government’s own valuations, with the landowners free to seek recourse should they have been in disagreement with the compensation given.\nArchitects evaluating parcels of land which the government was buying or selling should either be in the government’s employ or third-parties engaged on the government’s behalf, he said.\n“If land is being sold on behalf of the government, the government must evaluate their worth,” he said, adding that “in no way” should third-parties have been involved in the evaluation of government land.\nAsked to explain how he believed that such a process should be approached, Mr Mamo said that he would have expropriated immediately at a fixed value established by government architects, subsequently negotiating for which land was to be given in exchange on the basis of that fixed value.\nCarrying out negotiations with the underlying possibility of expropriation could be construed as “arm-bending”, he added.\nGovernment MP Robert Abela pointed out that the process had been concluded “just days” before the 2013 election. Asked by government MP Alex Muscat whether he recalled other high-value expropriations of this nature being carried out on the doorstep of an election, Mr Mamo replied that he did not.", "comment_count": 9, "id": 4055}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who allegedly devised a scheme to defraud some 13 individuals over a three-week span was remanded in custody after a request for bail, specifically to undergo rehabilitation, was turned down by the court.\nThomas Camilleri, a 30-year-old unemployed Gżira resident, was arraigned on Wednesday under arrest, pleading not guilty to no less than 30 charges, involving fraud and misappropriation of 13 individuals, one charge of aggravated theft and a charge of relapsing.\nThe man was further charged with breaching earlier bail conditions.\nPolice investigations had led to the arrest of the suspect who reportedly used to trick his victims by ordering goods, taking delivery of the order at the front door, disappearing from sight under some false excuse, only to slip away through some other exit without paying for the goods.\nUpon his arraignment, the accused’s lawyer, Yanika Bugeja, assisting him as legal aid, made a request for bail, limiting the request solely so that the man could immediately seize upon an opportunity to enter a drug rehabilitation programme.\nHowever, the request was strongly objected to by the prosecution, not only in view of the serious nature of the offences, but also because verification just before the arraignment had proved that there had been no arrangements regarding rehabilitation, as alleged by the accused.\n“This is not the usual request for bail,” Dr Bugeja insisted, “but it’s intended so that the man does not miss the opportunity to enter into rehabilitation”.\nHowever, in the light of such submissions, the court, presided over by magistrate Marse-Ann Farrugia declared that it was still too premature to request bail.\n“The court must have peace of mind that this man is truly going to undergo rehabilitation, after hearing testimony confirming this,” the court concluded, thereby denying bail in view of the accused’s untrustworthy character and criminal record.\nInspectors Colin Sheldon and Bernardette Valletta prosecuted.", "comment_count": 0, "id": 4056}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Planning and Environment Review Tribunal, which is hearing an appeal against a controversial development permit given to Transport Minister Ian Borg and his wife, is refusing to let an objector produce witnesses.\nThe list of witnesses includes former Ombudsman Joseph Said Pullicino.\nThe case involves a permit that allows the minister responsible for planning to turn agricultural land adjacent to his rural dwelling in the limits of Rabat into a large swimming pool and outside dining area.\nIn a decree given by chairman Martin Saliba, the Environment and Planning Tribunal insisted that all the witnesses presented by the objector, Noel Ciantar, were not relevant to the appealed case.\nAccording to the law regulating the procedures of the tribunal, it is up to its members to decide whether or not to accept the hearing of witnesses.\nThe list, produced by Mr Ciantar, included the then chairman of the Commission Against Corruption, Judge Lawrence Quintano, which had also investigated a related development permit given to Dr Borg and members of the planning boards granting the minister the permits.\nThe permit in dispute is related to a field which Dr Borg bought for €11,000 a few years ago. The field is adjacent to his newly-built dwelling in an Outside Development Zone in the hamlet of Santa Katerina.\nMr Ciantar is arguing that the swimming pool permit is abusive and against the law.\nWhile the minister is arguing that the fact he already has a house in the area makes the permit compliant with current polices, Mr Ciantar claims that even the first permit, issued in 2014, for the building of Dr Borg’s residence was illegal and abusive.\nThe witnesses presented were not relevant to the appealed case\nIn 2014, a few months after being elected to Parliament, Dr Borg was granted an ODZ permit to turn a decrepit rural dwelling into a 400 square metre matrimonial home.\nFollowing an investigation, the Ombudsman had found that the granting of this permit was “a grave error” on the part of the PA and should not have been issued.\nDespite the Ombudsman re-commending a review of the permit, nothing was done and the minister continued with the development of the area.\nDr Borg had originally applied for the permit using the name of a third party, an action that was condemned by the Ombudsman.\nInvestigating the case separately, the Commission Against Corruption had fully endorsed the Ombudsman’s recommendation but found no corruption on behalf of (then parliamentary secretary) Ian Borg.\nThe tribunal is now expected to submit a final decision on this appeal next month.\nA final decision by the tribunal can only be challenged in court.\nIvan.Camilleri@timesofmalta.com", "comment_count": 74, "id": 4057}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The unacceptable lack of national protection and ineffective solidarity among EU states is exposing migrant children to violence, exploitation, trafficking, and abuse, President Marie Louise Coleiro Preca told an international conference on Wednesday.\nAccording to the European Migration Network, more than 30,000 unaccompanied children went missing between 2014 and 2017, and the number of missing cases that are being solved is actually decreasing.\nPresident Coleiro Preca was speaking at the third edition of the Lost in Migration Conference: Global Strategies and Political Commitments, organised by her Foundation for the Wellbeing of Society and Missing Children Europe between Wednesday and Friday.\nAccording to the President, these conferences have flagged gaps in the system and drawn recommendations to address effective protection.\nShe hopes this year’s conference helps increase pressure on addressing the “horrendous situation where thousands of children go missing on European soil”.\nWe need to explore what is happening to children before they arrive in Europe, the dangers they face during their journeys, and after their arrival, she added.\n“In particular, we must address the unacceptable lack of efficient national protection systems, and the ineffective solidarity being shown among EU states when it comes to the protection of migrating children.\n“This situation is having the direct consequence of leaving our children more vulnerable to violence, exploitation, trafficking, and abuse.”\nIn her address, she noted that preventing unsafe migration and the subsequent horrendous trafficking of children was the first step to effectively tackle the issue of unaccompanied migrant children.\nTo achieve this goal, the involvement of countries of origin and of transit was fundamental, she insisted.\nREAD: Refugee actors cancel Malta shows after immigration denies actor entry\nPresident Coleiro Preca said that unfortunately, we were still a long way from effectively addressing the needs of children who have been victims of all sorts of violence, before and during their departure.\n“I am sad to note that the necessary referrals to national child protection systems are not always implemented, nor are they treated with the necessary urgency.”\nDelays in determining the status of children who arrived in Europe and were considered ‘stateless’ was another challenge that further compounded the difficulty of assuring their rightful protection.\nIt was therefore crucial that authorities pin-pointed appropriate people who were responsible for child protection at every stage of the identification and registration, she said.\nOn the other hand, frontline European states must be supported by the “entire family of European countries” to ensure the necessary expertise was provided in a consistent and sustainable manner.\nMeet the exploited girls\nAs a side event, the Salesians of Don Bosco are screening a documentary about the sexual exploitation of girls, which is one of the problems that lead to forced migration.\nThe 27-minute film called Love is being screened at St Patrick's School, on St John Bosco Street in in Sliema on Thursday (21 February) at 7pm.\nThe film-maker and the people running the service to help these girls get back on their feet, will be in attendance and will take questions.", "comment_count": 8, "id": 4058}, {"keywords": "", "author": "Denise Grech ", "article_body": "A decrepit building in Cospicua is set to be turned into a housing project for NGOs who wish to offer specialised programmes.\nSeveral unused properties around the island, including in Valletta, will be used for specialised housing projects, as part of a scheme unveiled by the housing secretariat on Wednesday.\n€500,000 have been allocated for the project, Social Accommodation parliamentary secretary Roderick Galdes said.\n\"We are promoting social mobility, which we have been talking about for years,\" Housing Authority chief Leonid McKay said.\nNGOs will be selected after a call of applications issued on Wednesday. Winners will then be given a property, together with the necessary funds for its conversion, to offer special housing projects.\nThe scheme would ensure that housing would encourage people get the help they needed, Mr Galdes said. \"We do not want to simply give people keys to vacant properties,\" he added.\nChamber of Architects and Civil Engineers chair Rachael Scicluna said restoration would seek to be more inclusive. The Chamber was offering their help in restoring the run-down houses.\n\"We need an ideological change to keep the community in mind [when developing projects],\" she said.", "comment_count": 3, "id": 4059}, {"keywords": "", "author": "", "article_body": "A new government primary school has been inaugurated at Marsascala following a €6 million investment.\nThe school, was inaugurated by Prime Minister Joseph Muscat, Education Minister Evarist Bartolo and Youth Parliamentary Secretary Clifton Grima.\nIt will be welcoming 300 students and 37 educators.\nDr Muscat said this was the sixth new school opened in the past six years. The government had also invested in students, not least by programmes to help students improve their abilities, the use of tablets, revision classes for SEC exams and increasing the number of learning support educators to 3,500 from 2,200 in 2012. Sec and Matsec exam fees were also being waived. He appealed for more respect towards teachers and their work.Mr Bartolo spoke on the need to encourage more young people to enter the teaching profession saying that the country’s future depended on work in schools. The government, he said, wanted students to learn at a place they enjoyed, together with their educators for their abilities and values to be developed.\nThe school includes energy-saving features, air conditioning and an underground parking lot. ", "comment_count": 6, "id": 4060}, {"keywords": "", "author": "", "article_body": "Malta International Airport saw its profit rise to €30.3 million last year from €24.2 million the year before.\nIn a statement, the company said performance improved in both its aviation and non-aviation activities.\nGroup revenue for the year which ended on December 31 was €92,191,719 up from €82,369,154 in 2017.\nAviation revenue grew by 11.1% to €65.5 million, largely attributable to an increase of 13.2% in traffic, which reached a new all-time high of 6,808,177 passenger movements in 2018.\nRevenue from non-aviation activities increased by 14.1% to reach €26.7 million.\nThe company’s VIP products registered an increase of 36.3% over 2017.\nThe board of directors recommended the payment of a final net dividend of €0.090 per share (gross €0.138) on all shares settled as at close of business on Monday 15th April 2019.", "comment_count": 8, "id": 4061}, {"keywords": "", "author": "", "article_body": "A London-based company starring refugee actors has been forced to cancel performances in Malta after one of its members was refused entry by Maltese immigration officials.\nPhosphoros Theatre actors were invited to Malta by the President’s Foundation of Wellbeing for Society, to perform the autobiographical play Pizza Shop Heroes.\nBut those plans were thrown into disarray after the travel certificate presented by one of the actors, an Afghani asylum seeker, was not accepted by Malta Immigration.\nIn a statement, the President’s Foundation said that the asylum seeker had failed to apply for a travel visa. The travel certificate presented is not accepted by Malta Immigration as a valid Schengen document for entry into Malta, the Foundation said. \n“It is with a heavy heart that we have to announce that the shows have to be cancelled but Malta’s laws must be respected,” a spokesperson for the President’s Foundation for the Wellbeing of Society said.\nThe theatre company’s director, Dawn Harrison, insisted the travel certificate presented was valid for travel.\nRead: From hiding in lorries to performing on stage\n“Three of the young men have refugee travel documents and one has a certificate of travel, all issued by the UK Home Office,” she told Times of Malta.\n“Air Malta first denied them boarding saying they needed a visa, but then backtracked the next day and said the issue concerned the certificate of travel”.\nImmigration’s refusal to allow the performers into Malta is especially ironic given the subject matter of Pizza Shop Heroes, which features asylum seekers discussing their difficult journeys to make it to Europe.\nTwo performances scheduled for Thursday at Spazju Kreattiv had sold out and the troupe was expected to raise awareness about the plight of unaccompanied children fleeing persecution.\nData shows that over 30,000 such children went missing between 2014 and 2017.  \n\n\n\nOne of the actors, Haleem Najibi, had noted the significance of their Malta performances in an article published in the Times of Malta.\n“It’s really significant for us to go back to mainland Europe because this time we will be travelling across the borders with legal paperwork in hand,” he said, before immigration troubles put paid to those hopes.\nMs Harrison expressed dismay at the way things had worked out.\n“It’s ironic and devastating,” she said. “The boys are broken. They would have loved it. We were invited as guests and we have been turned away,” she said.", "comment_count": 0, "id": 4062}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The heirs of a Bulgarian tourist whose life was cut short in a double-decker sightseeing tragedy that shocked the nation last year have filed a judicial protest holding the bus operator and Transport Malta liable for damages.\nThe accident occurred on April 9, when two passengers sitting on the top deck of a sightseeing bus operated by City Sightseeing Malta Limited were hit by tree branches on Triq il-Belt Valletta, Żurrieq. They died on the spot. Dozens more were injured. \nAlmost one year after that tragic episode, the heirs of one of those victims, Elisaveta Danielova Avdala, filed a judicial protest before the First Hall, Civil Court against the transport watchdog and the bus operator, “whose lack of diligence had caused the fatality which could have been avoided”.\nRead: What caused the tourist bus to hit the Żurrieq tree?\nThey argued that Transport Malta had failed to implement a number of regulations, directives and laws intended to prevent such road accidents.\nIn spite of a directive aimed at ensuring better road safety, no safety inspection has apparently been conducted on Maltese roads to date, the judicial act read.\nIf such checks had been effected by local authorities, the tree branch which caused the fatality would have been noted and the inherent danger removed.\n“There was no justification for the fact that today we have a situation where trees are practically and directly part of the roads… an alarming reality when one considers that there are no safety barriers or signs to inform drivers of what lay ahead,” the protest went on.\nRead: 'He was a force to be reckoned with': tearful tribute to double-decker bus crash victim\nThe setting up of an agency this year to implement strategies relating to road construction and infrastructure did nothing to obviate the responsibility of Transport Malta who was the relative authority when the accident occurred.\nAs for the bus operator, the protesting parties argued that the driver, an employee of the company, had been driving recklessly and negligently and had failed to keep the established distance from the side of the road.\nHis negligence was to be borne by the company in terms of civil law, the protesting parties went on, calling upon the defendants to liquidate damages within 30 days, failing which they were to be held responsible at law.\nLawyers Lorna Mifsud Cachia and Nicole Sultana signed the judicial act.\nRead: Transport Malta has long recognised trees as road hazards - but did it act?", "comment_count": 0, "id": 4063}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "Citizens worried about plans to build 12-storey blocks at Mistra Bay have sprung into action after the St Paul’s Bay local council declined to oppose the project.\nThe group of citizens and residents have four days to raise the €7,350 needed to fund an appeal against the project, and have turned to the public to donate to the cause.\nFiling an appeal against the project is expected to cost the group €3,550, with a further €3,500 to €3,800 going to an environmental lawyer who will be tasked with arguing the case.\n“If we do not collect the amount needed to file the appeal by February 24, we will refund the amount donated in full,” the group said.\nPlans to build 744 residential units at the former Mistra Village site were revived last year, having previously fallen by the wayside. They were approved by the Planning Authority last month.\nDeveloper Charles Camilleri submitted the application on behalf of Gemxija Crown Ltd, a joint venture between a group of Kuwaiti investors and local firm JPM brothers that was behind the original plans for the site. \nThe environmental regulator opposes the plans, with ERA chairman Victor Axiaq having cited concerns about noise and air quality.\n “This project will only bring traffic and congestion and bury us in darkness,” one of the residents told Times of Malta. It will be the final nail in Xemxija’s coffin.”\nLocal councillors fail to attend urgent meeting \nThe St Paul’s Bay local council was due to discuss the Mistra development at an urgent meeting held last Monday, according to a meeting agenda published on its website. \nThat discussion failed to materialise, with not enough councillors showing up for the meeting to satisfy quorum requirements.\nMayor Anne Fenech told Times of Malta that three councillors were abroad, with another five unable to make the last-minute meeting.\nShe declined to say whether she backed or opposed the project, saying she did not feel comfortable speaking about it without having discussed it with her fellow councillors first.\n“This project has been on the cards since 2008, previous councils had plenty of time to discuss it if they had wanted to,” she said.\nThe local council’s website does not include minutes of Monday’s meeting, with the last uploaded minutes being those of a meeting held in late November last year.\nA resident involved in the appeal had some stinging words for the local councillors who had failed to show up.\n “It’s like some councillors are secretly in favour of the project but they don’t want to look like they are,” he said.\nDonations are accepted via Paypal to mistraprojectappeal@gmail.com or else via Revolut by getting in touch with Priscilla Grima.", "comment_count": 8, "id": 4064}, {"keywords": "", "author": "", "article_body": "The historic 'language question' in Malta's courts has returned to haunt a former HSBC employee who sued the bank's board for allegedly not being paid outstanding wages upon termination of his employment.\nThe case was filed by the police after the bank allegedly failed to pay a former employee whose termination of employment was declared unfair by the Industrial Relations Tribunal in November 2015. The bank's failure was deemed to be a breach of the collective agreement.\nBefore going into the merits of the case, Magistrate Donatella Frendo Dimech observed that the summons had been filed in English.\nShe observed that the Constitution and the Criminal Code laid down that the language of the courts was Maltese. The Judicial Proceedings (Use of English Language) Act further laid down that where one or more of the parties was English-speaking and the Maltese-speaking parties made a declaration consenting to the proceedings being conducted in the English language, or where none of the parties was a Maltese-speaking person, the court may order that the proceedings be conducted in the English language.\nHowever, no such declaration had been made, nor was the court requested to issue such an order.\nThe court noted previous cases where cases were thrown out because of applications made in English.\nTherefore, the court said, once the summons was issued in English, it was considered as non-existent. It followed that the summons could not be seen as having interrupted the one-year prescription period from the decision of the tribunal. The prescription period was therefore considered as having expired on November 18, 2016.\nThe language question dominated Maltese politics in the 19th and early 20th century as the British colonial government sought to remove the Italian language from the courts, substituting it with English and Maltese. \nMaltese became the general language of the courts in 1932, the situation being further reinforced in the constitution some 50 years ago.  \nIn October last year a petition was filed on Parliament's website so that the use of the English language could be put on equal footing to Maltese in judicial proceedings. That petition made no progress.", "comment_count": 0, "id": 4065}, {"keywords": "", "author": "", "article_body": "A 41-year-old woman has been missing for the past five days, the police said in a statement on Wednesday. Ms Burke.\nJeanette Burke last made contact with her family in the UK on January 23. She was reported missing to the police last week, on February 15. The police urged anyone with information about Ms Burke or her whereabouts to get in touch with authorities on 212240001 or 119 or at any local police station.", "comment_count": 0, "id": 4066}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat on Wednesday said a House of Commons committee which had claimed that he met SCL, the group that set up the notorious data-mining company Cambridge Analytica, should come up with the evidence.\nQuestioned on the basis of the contents of e-mails published on Tuesday, Dr Muscat said those e-mails should be published, in full.\n\"You cannot disprove a lie\" he said. \n\"If this is the way in which the British parliament goes about its business, it's no wonder that the UK is in such a state,\" he added. \nAs for himself, he insisted he never met SCL or Cambridge Alanytica. But he was not too concerned about the allegations, in that he had been through worse, as proven by the Egrant lie against him. \nDr Muscat also expressed his regret over approval by a European Parliament committee of a resolution on the rule of law in Malta, which will be debated in a plenary sitting next month.\nThe government had noted the resolution and it would continue engaging and explaining that parts of it were factually wrong, he said.\nBut the government would stay calm and carry on.\nThe Prime Minister made his comments after inaugurating a new €6m government primary school in Marsascala. The school has facilities for 300 pupils. \nSee video above. ", "comment_count": 100, "id": 4067}, {"keywords": "", "author": "", "article_body": "Unemployment in January dropped by 10% from January 2018, the National Statistics Office said.\nThe number of persons registering for work stood at 1,796.\nUnemployment dropped across all age groups and irrespective of how long they had been registering for work. The largest decrease in registrants was recorded among persons who had been registering for more than one year.\nThe number of persons with a disability who were registering for work decreased by 68 persons when compared to the previous year, reaching 216. Men accounted for 70.4 per cent of total registrants with a disability.\nThe largest share of men and women on the unemployment register sought occupations as clerical support workers with 16.9 per cent and 37.2 per cent respectively.", "comment_count": 11, "id": 4068}, {"keywords": "", "author": "", "article_body": "A 20-year-old man was seriously injured after the boat he was in ran into the rocks off Ċirkewwa.\nPolice said that the incident took place at 5am, and that there were two men in the boat at the time, both from Mellieħa. They were assisted by the Civil Protection Department, the Armed Forces and a medical team from Mater Dei. \nThe condition of the other man - a 19-year-old - is not yet known.\nBoth were hospitalised.", "comment_count": 0, "id": 4069}, {"keywords": "", "author": "", "article_body": "Malta’s fishing authorities were warned about hundreds of tonnes of illegal tuna as early as 2009, a European Commission fax leaked to the Spanish press has revealed.\nThe fax, sent to then-fisheries director general Anthony Gruppetta as well as a number of other top officials including the now suspended Andreina Fenech Farrugia, said that an EU inspector would be coming to Malta on December 21 and 22, 2009 to oversee the destruction of 262 tonnes of undocumented Bluefin tuna.\nJust one day before the inspector arrived, the fish farm responsible announced that rough seas had wrecked tuna pens containing around 600 tonnes of the fish.\nAt this year's market prices we estimate to have lost €7.4 million,\" Ta’ Matthew Fish Farms Ltd. owner Ray Bugeja had told the Times of Malta at the time.\nAccording to Spanish news outlet El Confidencial, the fish farm was never sanctioned for the hundreds of unregistered tuna. \nAndreina Fenech Farrugia has denied wrongdoing.\n“Laundering illicit tuna by pretending pens were destroyed by bad weather is one of the industry’s classic ruses,” the news outlet wrote.\nTa’ Matthew Fish Farms was subsequently bought out by Malta Fish Farming in 2015.\nIntense scrutiny\nMalta’s tuna sector has come under international scrutiny following revelations, first published by El Confidencial, that Spanish police had recorded phone calls between tuna kingpin Jose Garcia Fuentes and several key officials, including Malta’s top fisheries official Andreina Fenech Farrugia.  Spanish police believe the Fuentes group used bribes and illicit documentation to launder thousands of tonnes of tuna into European markets.\nRead: Tuna tycoon and Malta fisheries 'boss' phone calls\nIn one of the transcripts published by Spanish media, Dr Fenech Farrugia appeared to demand payment from Mr Fuentes.\nDr Fenech Farrugia was one of the fisheries department’s top officials before she was transferred out in 2011. She was subsequently returned to the department as its director-general in 2013, weeks after Labour returned to power.\nHours after El Confidencial first published transcripts of conversations between Dr Fenech Farrugia and Mr Fuentes, Environment Minister Jose Herrera had ordered her suspension.\nDr Fenech Farrugia has denied any allegation of wrongdoing and said that she had received payments from fish farm operators in her capacity as head of the fisheries department.", "comment_count": 32, "id": 4070}, {"keywords": "", "author": "", "article_body": "The arguments made by Infrastructure Malta to justify the Central Link project were flawed, Alternattiva Demokratika has argued.\nIn its submission on the Environmental Impact Assessment, the party said the latter completely ignored the “clear and specific” objective of the National Transport Master-Plan 2025, that is a reduction in the number of cars on our roads.\n“The EIA presented by Infrastructure Malta fails to consider the implementation of this objective among the various alternatives that can be used to address traffic congestion,” AD said.\nThe party argued that during 2018, 53.4 million people had used public transport: an increase of 11.25 per cent over 2017, saying this was a clear sign that the public was responding to sustainable transport options which were being made available.\n“The Central Link will push the main Valletta-Rabat public transport service further away from residents, making it less accessible. A road map for implementing the objective of reducing the number of cars from our roads is the only sensible way forward. It is the long-term view which is missing in our transport policy. Once this road map is clearly defined, then it would be easier to reassess – and probably substantially redefine and downscale – the Central Link project on the basis of a realistic alternative,” AD said.", "comment_count": 10, "id": 4071}, {"keywords": "", "author": "", "article_body": "A Greek man has been jailed for 13 years after admitting to conspiring to import cocaine, orgsanising the importation of the drug and having it in his possession.\nThe drug with a total weight of 3.2kg and a purity of around 55%.\nXenofon Florakos pleaded guilty to all charges. \nThe prosecution and the defence agreed that the punishment should be that of 13 years and six months imprisonment and a fine of €30,000.\nThe court upheld the agreement reached by the parties after noting the provisions of the law, the early guilty plea and the fact that the accused had no previous convictions.\nAll assets belonging to the accused were seized.", "comment_count": 0, "id": 4072}, {"keywords": "", "author": "", "article_body": "Updated at 3.17pm with President's reaction \nThere has “never been legal proof” of wrongdoing by Pilatus Bank, President Marie-Louise Coleiro Preca told an Oxford Union audience earlier this month.\nMalta’s head of state was speaking to the prestigious student society during an hour-long session in which she touched upon a variety of issues ranging from social justice to gender quotas and the importance of media education to curb the spread of fake news.\nIt was her reply to the very first question from her audience, however, which pricked up ears.\nHad Malta learnt any lessons from the Pilatus Bank scandal, President Coleiro Preca was asked.\n\nThe President, who is coming to the end of her tenure, did not seem to be in a reflective mood.\n“Pilatus Bank is closed,” she replied. “As yet, there has never been legal proof of what Pilatus Bank was doing.”\n\n\n\n \nShe told the audience that the disgraced bank did not form part of a case before the US courts against the bank’s former chairman, Ali Sadr Hasheminejad.\nMr Hasheminejad stands accused of having funnelled more than $115 million from Venezuela through the US, evading sanctions.\nLicence withdrawn\nPilatus Bank had its banking licence taken away by the European Central Bank late last year, some months after it had been placed into administration following its chairman’s arrest.\nThe bank came under scrutiny following the murder of journalist Daphne Caruana Galizia, who had alleged that the bank was being used to hide millions in dirty money.\nIt had already been flagged by Malta’s Financial Intelligence Analysis Unit back in 2016, when a report had cited a number of shortcomings in its anti-money laundering provisions.\nA follow-up report by the FIAU had concluded that those shortcomings “no longer subsisted”.\nNevertheless, the European Banking Authority found “general and systematic shortcomings” in the bank’s application of AML directives.\nThe bank’s directors have vehemently contested the decision to shut down the bank, saying that it was the victim of a “witch-hunt” by “racist” politicians and suing Malta’s financial regulator, the MFSA, for having acted in bad faith and beyond its powers when closing the bank down.\n\nRemarks 'taken out of context' - President's Office\nIn a statement issued on Wednesday afternoon, the Office of the President said that President Coleiro Preca's comments had been taken \"completely out of context to create sensationalism\". \nThe President's remark about there being \"no legal proof of what Pilatus Bank was doing\" referred to evidence in court, since the case against the bank's chairman was still pending, her office said. \nNo further legal proceedings against the bank were under way in Malta, it added. \nOther issues\nIn other parts of her speech, the President spoke about a range of other issues.\nOn Daphne Caruana Galizia's murder: One of the saddest moments in our recent history. The evidence of how this horrendous act has been taken seriously is that the government involved the Dutch and Finnish [security services], FBI and Scotland Yard. Investigations will continue until we find the person or persons who commissioned the crime. \nOn populism in Europe: Populists thrive on fear, and everything that goes wrong is blamed on migrants. We need strong leaders, and that is why I am urging you to be the strong leaders of tomorrow.\nOn female politicians: I would love to see more women in parliament. Now there is the political will to address that. Quotas will help with that transition. They work.\nOn reproductive rights: I can’t understand how the issue of an embryo is a woman’s right, because if I neglect my daughter, the State will intervene. It won’t say ‘it’s her daughter, it’s her right’. But I respect other people’s opinions on this.\nOn fake news and hate speech: Fake news has become the order of the day. This is abuse.\nAbuse does not feature at all in our fundamental freedoms. We need media education.\nOn human rights: Human rights have no borders. It took the European Union – the champion of human rights – three weeks to decide on 49 people, including children.\nOn social justice: I believe in empowerment, not handouts. Once I leave office I will probably stay in the social sector as I’ve been all my life.\n ", "comment_count": 125, "id": 4073}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 11.25am \nThe house where the body of a British woman was found in a decomposed state on Monday evening, was in a filthy and unsanitary state when the body was discovered.\nPolice sources told the Times of Malta how the two-storey house where the woman and her husband have lived for many years was in an almost abandoned state, with garbage littering the entire place. According to the sources, the fact that the body was in such an advanced stage of decomposition suggested the woman might have died some three months ago.\nAuthorities found a dead dog underneath a bed and six hungry cats in the property, animal welfare activist Moira Delia wrote on Facebook on Wednesday. \n\"Please help us rehome these poor cats,\" Ms Delia urged her followers. \nNeighbours were still in shock on Tuesday after learning that the woman had been found dead in the house, saying they had never suspected anything might have been amiss.\n\nAccording to one neighbour, the woman’s husband told her that his wife, who friends said went by the name Jan, was “fine” and “all right” some three weeks ago when she asked for her after not seeing her around the neighbourhood for some weeks. The neighbour, the owner of a clothes shop in the quiet St Paul’s Bay street, described how she had asked the man how his wife was doing after hearing she might have been in hospital.\nPolice called at the couple's home on Monday after a relative contacted the British High Commission to say that he had been trying to speak to her without success for months. The High Commission then alerted the police.\nA High Commission spokesman confirmed that it was “supporting the family” of the British woman, adding that its staff were in contact with the Maltese authorities.\nMeanwhile, a friend of the woman who spoke to the Times of Malta on the condition of anonymity, described her as a “lovely lady” who was a quiet, but cheerful, person. She said Jan had been diagnosed with cancer some 18 months ago and had since been to the hospital on several occasions.\nThe friend insisted that when Jan was still alive she would “always keep her house in order”, adding that she was very fond of her cats and dogs. When Times of Malta visited the St Paul’s Bay street yesterday, one of the cats could still be seen inside the home.\n'We never heard or saw anything,' a neighbour said. Video: Chris Sant Fournier", "comment_count": 25, "id": 4074}, {"keywords": "", "author": "", "article_body": "MEP David Casa has had meetings in Istanbul with investigative journalist Pelin Ünker and her legal team. Pelin Ünker is part of the International Consortium of Investigative Journalists and was sentenced to 13 months in prison after reporting on the Paradise Papers.\nMr Casa said journalists in Turkey suffer the consequences whenever the actions of people in power are exposed.\n\"While this is by no means exclusive to Turkey, Turkey stands out because of the severity of punishment as well as the sheer number of journalists that have been detained as a direct result of their investigative work. When the facts that have been reported are uncontested it makes the handing down of a prison sentence all the more grievous,\" he said.\nMr Casa said he would be inviting Pelin Unker to visit the European Parliament and would be taking further action at EU level in an effort to prevent the cruel sentence from being enforced. \nPelin Ünker is now facing an additional case based on the same series of articles but concerning the son-in-law of President Erdogan.", "comment_count": 2, "id": 4075}, {"keywords": "", "author": "Denise Grech ", "article_body": "Oversight and “unintentional errors” by crew and ground handlers may have contributed to an airplane crash that caused “tens of thousands” of euros in damages, investigators have found.\nA Falcon 7X aircraft broke free from its parking position in December 2017, ploughing through a perimeter fence and into the road before crashing into a building owned by Polidano Group. The plane’s nose, including the cockpit, ended up inside the building. \nForce 7 winds moved the aircraft from its parking position, but the report found “at most” three out of six wheels were chocked – chocks are placed against an aircraft’s wheel for safety in addition to setting the brakes – “even though the crew had every opportunity for all wheels to be chocked”.\nRead: Watch: Dramatic new photos of unmanned aircraft crash show extent of damage\n“Following strong winds, the [aircraft’s] rotation continued up to a point where the angle between the tyre and chock became acute enough to dislodge the front chock, a movement that left the aircraft completely free,” the Bureau of Air Accident Investigation report said. \nEvidence from the site of the accident suggested the aircraft was chocked on the nose-wheel and the left main-gear only, leaving the right main gear unchocked.\nThe investigation also suggested that the distance between the chocks and tyre marks were not blocking the nose wheel from moving, as they were intended to. The handling agent also told investigators additional nose wheel chocks “should have been requested”. \nA weather briefing on the adverse conditions on the day was not offered by the handling agent nor requested by the crew, the report said. \nGround handlers “could have taken the initiative” to check that all aircraft left in their care were adequately secured for the weather conditions of the day and if need be, add another set of chocks on the right main gear, the report said.\n “There was plenty of time to do an appropriate walk around the aircraft to make sure that the recommended procedures were followed and that the aircraft was adequately secured for a long stay,” it added.\nCombined efforts by the crew and ground handlers, establishing better lines of communication and paying more attention to detail, may have prevented this accident from happening, it concluded.", "comment_count": 10, "id": 4076}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Maltese community in Blacktown, Australia, is up in arms following the decision by the Missionary Society of St Paul (MSSP) to leave this New South Wales suburb after 30 years of pastoral service due to a shortage of priests. \nHowever, Fr Mark Grima from the MSSP’s headquarters in Rome told the Times of Malta that if a Maltese priest from Melbourne or even from abroad would be able available, they would consider holding certain services on special occasions. \nFounded in 1910 by Mgr Giuseppe DePiro, the missionary society has established several houses not only in Australia but in other parts of the world such as Peru, Pakistan, Canada and the Philippines. \nThe MSSP’s departure from Blacktown was communicated in a letter from the Australian provincial Fr Ivan Burdian who announced that Fr Noel Blanco would be leaving on February 17. \nHis departure was attributed to ill health and to the fact that the Society did not have enough priests to continue this pastoral service.\nThe correspondence was read during the Saturday evening Mass on February 2, at a jam-packed St Francis chapel which is part of the La Valette Social Centre. The latter is a hub for the Maltese community, which incorporates a home for the elderly, many of whom are Maltese.\nAccording to The Voice of the Maltese, a bilingual fortnightly online magazine focusing on Maltese living abroad, the announcement left those present in shock. \nMoreover, it pointed out that the MSSP’s departure would also bring to an end the migrant chaplaincy in the Parramatta diocese as of April 21.\nAggrieved Maltese migrants in Blacktown contacted this news-paper to express their disagreement with this decision.\n“If the number of priests are dwindling, we believe that the Maltese communities should be given priority over other parts of the world where the MSSP is also present,” they said. \n“One option would be to relocate a priest from one of these countries, or else from within Australia,” they added. \nHowever, when this newspaper contacted the MSSP’s headquarters in Rome, the Society threw cold water on this possibility.             \nWhile acknowledging that their departure from Blacktown would be sorely missed, Fr Grima noted that MSSP members did not limit themselves to celebrating Mass, but were very active in hospital visits, ministering the elderly in homes and supporting families. \n“As the Provincial of Australia, Fr Ivano Burdian has shared with the congregation it was after a long process of discernment that we came to this decision to pull out,” he said. \nHe pointed out that the ministry was very particular as it could only be served through a Maltese priest. \n“Our Maltese priests in Australia are getting older (some are still ministering at the age of 80 and over, while others had to retire) and Maltese vocations in Australia or Malta are few,” Fr Grima said. \nConsequently, the Society’s options were limited, he added.\n“However we still keep our options open,” he added.\n“Should a Maltese priest from Melbourne or abroad be able to temporally offer his service on special occasions, I see no reason why it should not happen.”", "comment_count": 7, "id": 4077}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 7.15pm, adds PA statement\nHundreds of Turkish construction workers flown to Malta recently to work on massive construction projects are expected to start living in a quarry in Mqabba, which is being turned into a sleeping compound, the Times of Malta can reveal.\nDuring a visit to a quarry owned by construction magnates Bonnici Brothers on Tuesday, foreign workers equipped with cranes and heavy machinery were erecting prefabricated homes, expected to serve as makeshift bedrooms for the construction workers.\nDozens of Turkish employees, working for TACA Construction, are reported to already be living on site, housed in a former residence in the same quarry and now turned into a number of small bedrooms.\nHowever, due to an influx of more workers expected to arrive in the coming months, a large area in the Mqabba quarry is now being turned into a ‘small village’ to host the foreign workers.\nTACA Construction – based in Turkey capital Ankara – is a giant construction firm which has entered into agreements with Maltese developers behind the erection of massive buildings around the island.\nThe Sunday Times of Malta had revealed plans by TACA to import some 2,500 Turkish workers over the coming months. Discussions were held with the government’s employment agency, Jobsplus, to ‘fast-track’ the required permits.\nPrime Minister Joseph Muscat has recently indicated expectations of a new wave of foreign workers, warning that this was necessary for the country to be able to continue increasing social benefits and pensions.\nResidents living in the vicinity of the Mqabba quarry said they recently noticed increased activity in the area.\nHowever, they admitted that they didn’t know anything about the place being turned into a new living quarters for tens of workers.\n“Trucks have been coming and going over the past weeks carrying foreign workers in and out of the quarry,” a neighbour said.\nThey leave early in the morning and come back late in the evening\n“They leave early in the morning and come back late in the evening. Some of them are quite loud and speak an unrecognisable language,” another neighbour said.\nEfforts to speak to a representative of the Bonnici Group on Tuesday proved futile despite various messages left with company representatives.\nIt is not yet known what connection, if any, there is between the Bonnici Group and TACA Construction.\nNo Planning Authority permit could be seen on site in the area where development works were being carried out yesterday. \nIndustry sources said “the turning of a quarry into a residential area is strange to say the least, and probably illegal”.\nEarlier this week, the Times of Malta reported that some 300 Turkish employees of TACA have started working on the construction of a massive site in Tigné, where the Fortina developers are expected to erect a massive hotel and office complex.\nThe imported workers are being paid €4.50 an hour, the equivalent of the local minimum wage. The minimum wage in Turkey stands at €380 a month, half Malta’s threshold.\nLocal construction companies complained that they cannot compete with the prices being offered by the Turkish company, as their labour costs are much lower than the costs of those employing Maltese and workers from other countries.\nApart from the Fortina project, TACA Construction is expected to work on other massive projects on the island, including the City Centre development in St George’s Bay. \nThe Seabank db Group, which acquired from the government some 25,000 square metres of public land for €15 million, is planning to turn the area into a five-star hotel and a 38-storey residential tower.\nThe Turkish construction giant is also negotiating with other developers on other big projects.\nPA statement\nIn a statement on Wednesday evening, the Planning Authority said that following publication of this article it inspected the quarry and found no evidence that any persons had been living there.\nIt said a tent was pitched illegally in the quarry so it issued an enforcement notice and the structure would be removed.\nThe owners of the quarry told the PA that the tent was intended to be used as office premises and not for residential purposes.\n ", "comment_count": 223, "id": 4078}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Wednesday's newspapers:\nThe Times of Malta reveals new details about the tragic story of the corpse of a woman found in Qawra, three months after she had passed away. It also reports on Turkish workers being housed in a quarry compound.\nThe Malta Independent reports that Fisheries Commissioner Karmenu Vella had not met with the Spanish tuna magnate at the heart of a quota bribery scandal. It also carries a story by MEP candidate Peter Agius saying that the Commission cannot limit passport sales but that it could impose restrictions on holders' freedom of movement.\nThe Malta Today says that Environment Minister Jose Herrera was willing to publish the internal inquiry into the tuna quota scandal, while In-Nazzjon reports from the opening of the Nationalist Party's general council.\nL-Orizzont reveals an afforestation project is planned for the south of Malta, and also reports that the Housing Authority would build units as and when they were needed. ", "comment_count": 0, "id": 4079}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Nationalist party was going for the MEP elections as the \"underdog\" and a work in progress, the party's general secretary said adding that \"the tougher the conditions, the greater our determination to work hard\".\nSpeaking during the opening of the PN general council, Clyde Puli encouraged people not to lose heart. \nThe party faced tough challenges, working against a government that \"used fake news\" and was not afraid of character assassination, he said.\nMr Puli said that had it not been for the PN's media, only the governments voice would be heard.\n\"Our message is often distorted,\" he noted. The party spoke on things that affected the country, but the message was not reaching people, he warned.\nWe will not shut down the party's media, despite insistence to do so, he said.\nReflecting on his first year as secretary general, Mr Puli said 2018 was the year the party designed a future for itself. It reformed its finances to gain financial sustainability which would guarantee that the party could focus on its work.\nThe party saw the highest number of paid-up members in 13 years last year, raising €1.5 million in the process, Mr Puli said.\nDuring 2018, it worked to defend workers, pensioners and consumers. It also exposed the risks associated with a new electronic voting system. The Nationalist party had sounded warnings on a voting system set to be used for the MEP elections, saying it could be used for the \"buying of votes\".\n\"We were preparing for electronic counting, we exposed the risk of fraud in the process,\" Mr Puli said. \"We will not let anyone buy votes and get away with it,\" he added.\nThe Nationalist party also went on to take the government to court on key issues such as the Vitals deal and the Egrant inquiry, he added.\nOpposition leader Adrian Delia had filed a lawsuit against Prime Minister Joseph Muscat, the Attorney General, Malta Industrial Parks and Vitals Global Healthcare calling for Karin Grech, St Luke’s and Gozo hospitals to be returned to the people because contract conditions had not been respected.\nDr Delia took responsibility for the case, adding that Vitals could file a counter-claim.\nThe opposition leader had also filed a court case requesting access to a full copy of the Egrant inquiry since only the conclusions of the inquiry were made public, putting the Opposition at a disadvantage.", "comment_count": 19, "id": 4080}, {"keywords": "", "author": "", "article_body": "Repubblika, the NGO that promotes the rule of law, has been invited to meet President Marie Louise Coleiro Preca and the Labour and Nationalist parties to give them their proposals for a new Constitution, activist Manuel Delia said.\nMr Delia made the announcement while addressing a vigil outside the Law Courts in Valletta on the 16th month anniversary of the assassination of journalist Daphne Caruana Galizia. The vigil was organised jointly by Repubblika and Occupy Justice, the activist movement led by women which was formed in the aftermath of Ms Caruana Galizia’s murder.\nMr Delia told those gathered: “The Constitution is a pact between the people and those whom the people temporarily appoint to govern. Political parties are on one side of that contract. They can’t simply agree amongst themselves how to restrain their own powers while we simply watch them shake hands.”\nHe added: “We are making it abundantly clear that we will let no one scare us into silence by branding us traitors. We will raise the alarm if and when we see politicians grasp more power than it is absolutely necessary to lend them in the interest of us all.”\nMr Delia said Maltese civil society must be the guardians and the speakers for the people in negotiations with parties who bargain on their own behalf.\n“We seek your support. We need your financial help to mobilise the resources we need for this crucial task. For those in political parties who intend to wag their tongues to cut off ours, it should be clear that we have all permits required by law to raise funds for this aim.\n“Help us and join us in Repubblika to give a proper contribution to our community. We want to leave them a country in better shape than the one we inherited. Clearly we are not on the right path for that objective. We have to be the ones to put our country back on the right path,” he said.\nThe vigil was also addressed by Vicki Ann Cremona, Sammi Davis and Joe Pace Asciaq.\n ", "comment_count": 9, "id": 4081}, {"keywords": "", "author": "", "article_body": "Missing Children Europe’s new secretary general has called on EU member states to develop a sustainable, long-term solution to protect children who arrive at European borders, ahead of a conference in Malta tackling children lost in migration.\nAagje Ieven said inefficient cooperation between countries and the shortcomings of national asylum and child protection systems led children to mistrust the current systems and seek out dangerous solutions to reunite with their families and to have access to a better quality of life, or simply stay safe.\nMs Ieven is urging European leaders to address the lack of solidarity within Europe and to introduce a relocation mechanism following disembarkation.\nTogether with high-level European, UN and African representatives, Ms Ieven will be in Malta this week for the third ‘Lost in Migration Conference: Global Strategies and Political Commitments’, being held at the University of Malta Valletta Campus between tomorrow and Friday.\nOrganised by the President’s Foundation for the Well-being of Society and Missing Children Europe, the conference is geared to look beyond Europe towards the full migratory journey of the child.\n“As a society, it seems we are still unable to see that those stranded in the Mediterranean are children first and foremost,” Ms Ieven said.\n“We dehumanise these children and neglect their basic human rights because they are foreigners. If they were European, it’s doubtful we would accept situations like these,” she added.\nCurrent data shows that over 30,000 unaccompanied children went missing between 2014 and 2017 and Ruth Farrugia, director general of the President’s Foundation, said Europe had a collective responsibility to protect all children.\n“National reports show that children continue to go missing due to poor conditions in some reception centres, lack of information on their rights and options, slow and complex procedures for protection, lack of training for professionals in contact with children and lack of coordination at national and cross border level,” Dr Farrugia said.\n“When it comes to Maltese children, we are galvanised into action to seek out and protect every single missing child – but all children deserve the same degree of protection.”\nAs part of this conference, the President’s Foundation has also secured the participation of Phosphorous Theatre of the UK which is composed of four young men who were themselves asylum-seeking children.\nTheir play, Pizza Shop Heroes, will be performed during the conference, with two free performances for the public on Thursday at Spazju Kreattiv, Valletta.", "comment_count": 0, "id": 4082}, {"keywords": "", "author": "", "article_body": "The government has officially requested the European Commission to report to the European Council on the economic and social situation of Gozo and, in particular, on the disparities in the social and economic development levels between Gozo and Malta.\nIn a statement on Tuesday, the government said it has done this as part of the ongoing discussions on the future of the European Union Budget and on the basis of Declaration 36 on the island region of Gozo annexed to the Treaty of Accession of Malta.\nThe government said it was convinced that further efforts were required to adequately support island territories to ensure that these regions were not undermined by the territorial handicaps they faced.\nThe declaration called for action to be taken before the end of each budgetary period in an effort to mitigate these challenges in future.\nThe government said it believed that to address the specific situation of Gozo, a tailor-made approach specific to the island's needs was required with the aim of bolstering its economic activity while protecting its inherent and distinctive natural features.\nFor this purpose, during the last two programming periods, it had earmarked 10% of Structural and Cohesion Funds specifically to address Gozo's needs.\nCognisant of the investment undertaken in recent years in a number of areas in Gozo, such as basic infrastructure in transport and environment, tourism and health related projects as well as training and employment opportunities; a comparison of socio-economic development levels indicated, that notwithstanding the investment made, disparities persisted and the development of Gozo lagged behind Malta's, primarily for reasons relating to its double insularity.\nWithin this context, the government invited the European Commission to propose appropriate measures to enable the further integration of Gozo within the internal market.\nWhile this approach aimed to provide a renewed impetus for the development of Gozo, the objective was to foster sustainable development within Gozo which would contribute towards a better quality of life for those living on the island now and in the future.", "comment_count": 7, "id": 4083}, {"keywords": "", "author": "", "article_body": "The Opposition wants to enshrine Gozo as a regional island in the Constitution enabling Gozitans to get the executive powers to take their own decisions about the island.\nAddressing a news conference on Tuesday, Nationalist Party leader Adrian Delia said the Opposition wanted to set up a regional council for Gozo that would be elected directly by Gozitans and would have executive powers on all that affected Gozo and its development. It would also be given adequate finances including from European funds.\nThe Labour government was, on the other hand, setting up an authority for the regional development of Gozo which authority was to be controlled by the minister.\nA Bill setting up the authority was currently being debated in Parliament.\nDr Delia said the authority was not what Gozo and the Gozitans deserved. Such an authority would not empower Gozitans to take their own decisions but the minister would keep taking decisions on their behalf.\nThe authority would be appointed directly by the minister and it would take over from the government enforcement responsibilities. It would not have executive powers or finances to implement projects.\nDr Delia said this showed yet again that the government was not interested in Gozitans and wanted to continue to take decisions for Gozo. This was not what Gozo deserved so the Opposition would be voting against the authority.\nIn a reply, the Gozo Ministry said the Nationalist Party’s position was hindering the development of Gozo and Gozitans.\nFor through the authority, Gozitans would be ensured of sustainable development, more jobs and economic growth in line with a planned strategy that would take the island to 2030.\nThe authority would have a central and executive role in all this and would revise this plan every three years to ensure sustainable development that would safeguard the island’s natural environment.\nGozo was currently enjoying an unprecedented number of visitors which was growing and the unemployment rate was among the lowest to have ever been registered. All this could be sustained through the authority, the ministry said.", "comment_count": 10, "id": 4084}, {"keywords": "", "author": "", "article_body": "The Fisheries Department’s second-in-command has been temporarily promoted to director general following the suspension of his former boss.\nRandall Caruana, who served as director within the department, took over the departmental reins from Andreina Fenech Farrugia last week, a note in the Government Gazette revealed.\nMr Caruana has been given the post temporarily, until August 12.  \nDr Fenech Farrugia was suspended on full pay last week after Spanish media published police transcripts of phone calls she had with tuna kingpin Jose Garcia Fuentes.\nIn those phone calls, Dr Fenech Farrugia – who had been returned to the Fisheries Department in 2013 after having been transferred out two years earlier – appeared to demand payment from Mr Fuentes.\n“You have to pay me,” the transcripts noted her telling Mr Fuentes, whose interests include local tuna ranching firm Mare Blu. “I am in Bulgaria just for you”.\nSpanish police suspect that Mr Fuentes was paying bribes to ensure he could harvest more tuna than his quota allowed him to.\nDr Fenech Farrugia has denied having done anything inappropriate, saying that it was her job as director general to demand payment from ranchers who wanted to increase their quotas.\nThe notice announcing Mr Caruana's temporary appointment.", "comment_count": 47, "id": 4085}, {"keywords": "", "author": "Keith Micallef", "article_body": "A tribunal has ruled that HSBC Bank breached the data protection rights of one of its employees by sharing sensitive information without the worker’s consent.\nThe incident happened in April 2016 when the bank notified the Malta Union of Bank Employees that one of its members had been suspended for disciplinary reasons.\nTthe aggrieved employee, who since then has joined another union – the Independent Bankers Union which was set up in 2017 – had sought redress before the Data Protection Commissioner. However, in September 2016, the commissioner dismissed his complaint saying no violation of the Data Protection Act had been committed. \nNonetheless, the employee challenged the ruling and the commissioner’s decision was eventually revoked by the Data Protection Appeals Tribunal.\nIt transpired that the plaintiff was covered by the bank’s collective agreement under the clerical and managerial category.\nHe had felt aggrieved by an e-mail sent by MUBE president William Portelli on April 11, 2016, to 10 recipients.\nA big win for HSBC employees\nIn the correspondence, Mr Portelli remarked that the human resources department had “confirmed that a member of the union had been suspended”.  This was further corroborated by a bank official who testified that HSBC had notified MUBE about the suspension, in line with standard practice which had been in place for years.\nThough Mr Portelli had not been mentioned by name in this e-mail, the tribunal ruled that it was convinced that the correspondence was referring to the employee in question.\nCiting European case law, it remarked that the subject was easily identifiable under the circumstances and that the fact that the plaintiff was not named did not protect his anonymity.\nThe tribunal also ruled that the nature of the information at the heart of the case was of a sensitive nature in line with the parameters established by the Data Protection Act. \nMoreover, from the proceedings it transpired that the bank had shared such information without his consent.\nIn view of this, the tribunal, presided by Dr Anna Mallia and Charles Cassar, upheld the appeal and revoked the decision of the Data Protection Commissioner.\nConsequently, the tribunal referred the matter back to the commissioner to be reconsidered again in light of this decision.\nLegal procurator and IBU president Mark Muscat appeared for the employee.\nIn a statement, IBU described this development as a big win for HSBC employees, saying it elevated the status of workers’ data protections rights above partisan interests and organisational practices.\nThe union said it expected the bank to take action against the bank’s CEO Andrew Beane who “admitted partaking in such illegal disclosure which brought disrepute to the bank”.", "comment_count": 0, "id": 4086}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man currently facing criminal proceedings over the violent rape of his wife was again in the dock on Tuesday after he breached a court order by sending the woman love letters from jail.\nThe 30-year old Libyan man, currently under preventive arrest at Corradino Correctional Facility, had been arraigned shortly before Christmas. He had pleaded not guilty to the rape and was remanded in custody.\nA Protection Order issued by the court had barred the accused from approaching or contacting his alleged victim in any manner whatsoever.\nYet, on the eve of the court sitting during which the woman was to testify, the man had apparently thrown caution to the wind and contacted his wife on the phone from prison, asking her for forgiveness.\nHe even allegedly sent her love letters from jail, prosecuting Inspector John Spiteri explained when supplying the court with an overview of the circumstances which led up to Tuesday’s arraignment.\nThe prosecution requested a ban on the publication of the man’s name to safeguard the interests of his wife.\nThe court, presided over by magistrate Rachel Montebello, upheld the request.\nThe man pleaded not guilty to breaching the court order and harassing his wife. He was remanded in custody.\nLawyer Victor Bugeja was legal aid counsel.", "comment_count": 0, "id": 4087}, {"keywords": "", "author": "", "article_body": "Two containers full of contraband cigarettes were intercepted by Customs at the Freeport, the department said.\nThe containers, which were on their way to Croatia from Vietnam, were ostensibly carrying bamboo furniture, but searches and scans revealed otherwise.\nThey were intercepted following coordinated work between several customs sections including the Container Monitoring Unit, the Intellectual Property Rights Unit and the Scanning Team. The department’s scanner was also used.\nEach container was carrying 7,680,000 cigarettes. \nIn 2018, the department seized 56,612,956 contraband cigarettes and 16,209,2 kilograms of narcotics.", "comment_count": 3, "id": 4088}, {"keywords": "", "author": "", "article_body": "Malta's shift to electric cars should start in Gozo, Prime Minister Joseph Muscat said on Tuesday.\nSpeaking during a “Cabinet with the People” meeting held at the Salina Natural Reserve, Dr Muscat spoke about the gradual change of combustion engine cars to ones with electric motors.\nWatch: Government consultation to set cut-off date for diesel and petrol vehicles\nHe said that there was plenty of preparatory work to do, but that one of the ideas being floated was that Gozo would be the first place to \"completely switch\" to electric vehicles. \nDr Muscat did not provide any further details.  \nMalta has yet to set a cut-off date for the sale of combustion engine vehicles, though Environment Minister Jose Herrera had told Times of Malta last November that it could be \"much closer\" than the 2040 deadline being floated. \nThe Energy Ministry was working to develop incentives for people who bought electric cars and charged them at their personal garage at particular times, Dr Muscat added on Tuesday. \nPublic transport\nThis change, he said, coincided with the government’s work in the public transport sector. Youths and students were increasingly using public transport - which has been made free for them -  and the government had now also announced that public transport between Malta and Gozo would be free once a tunnel linking the two islands was built. The plan was to eventually have free public transport for all.\nThe Prime Minister said it was encouraging that many tonnes of waste had started to be used as a resource including for the generation of energy. The difference was already being felt but more needed to be done.\nPlastic bottles\nAnother change in culture would come through the plastic bottles refund scheme, he said.\nThe scheme will see beverage containers increase marginally in price, with those price increases refunded when bottles are returned for recycling. \nDr Muscat predicted criticism when the scheme began, though he reminded people that consumers would get their additional outlay if they returned empty bottles instead of throwing them away. It was positive that industry had united to administer the scheme, he said.\nThe Prime Minister said that following the conversion of oil to gas in the energy sector, traffic pollution was now to be addressed for the environment to be improved in a real way.\nAfforestation zone in Bengħisa\nEnvironment Minister Jose Herrera said that the Environment and Resources Authority was looking at recognising a number of further sites as Natura 2000. This would ensure they were protected and received detailed management plans.\nHe also said that talks were underway with several entities for 30,000 square metres of land in Bengħisa to be transformed into an afforestation zone. Some 5,000 indigenous trees and shrubs could be planted on this land, he said. \nThe minister said that, in a few weeks, a holistic policy on single use plastic was to be published while the Waste Management Plan for post 2020 would be issued for public consultation.\nOn organic waste, the minister said that 6,775 tones of waste had been separated so far. This meant a 25 per cent reduction in waste going into the black bag.", "comment_count": 52, "id": 4089}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A man whose estranged partner had reported him to police for cocaine possession returned the accusation in court on Tuesday, with his lawyer alleging that the couple’s child had seen drugs being used at the mother's house.\nThe 44-year old Marsascala resident pleaded not guilty upon his arraignment on Tuesday to having threatened his ex and caused her to fear violence.\nPolice had been set on the case on Monday, after the mother filed a report alleging violence and cocaine possession by her ex.\nSpeaking in court on Tuesday, the man’s lawyer painted a different picture of events.\nThe two had argued on Sunday but nothing had resulted of that, defence lawyer Andre Portelli said.\nThe report had only been filed on Monday after the father had refused to hand the daughter back to the mother, he said.\nAccording to Dr Portelli, the man had done so because the child was being made to witness drug abuse when staying with her mother.\n“That was why he refused, as any father would,” he argued.\nDr Portelli noted that police had searched his client’s home for drugs, finding nothing.\n“Such a search was illegal,” Dr Portelli stressed, also strongly objecting to prosecutor’s request to subject his client to a drug test.\n“This goes against the right of the accused against self-incrimination in criminal proceedings, is diametrically opposed to the presumption of innocence as well as the procedural rights of the accused as safeguarded under article 6 of the EU Convention,” the lawyer minuted in the records of the case.\nIn the light of the drug possession charge, the lawyer further reserved the right to request an investigation into the search effected at his client’s home, since there had been no search warrant, the court was told.\nWhilst reserving its decision on the requested blood test to a later decree in chambers, the court upheld a request for bail against a €300 deposit, a personal guarantee of €5000 and an order to sign the bail book twice a week.\nDuty magistrate Rachel Montebello also bound the accused under a Protection Order, allowing only “minimal” contact with the alleged victim, such as was necessary for matters of access to their child. Senior Inspector Trevor Micallef prosecuted.", "comment_count": 0, "id": 4090}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who allegedly intended to scare an unwelcome guest out of his home but ended up injuring him, has been handed a suspended jail term.\nTripoli-born Mousa Sulayman Mousay Bin Husayn, 26, residing at Pieta’, was charged with having unintentionally injured the man to whom he had been lately acting as host.\nProsecuting Inspector Robert Vella explained how the accused had wanted to part company with the other man, but ended up arguing with him.\nIt was during that argument that Bin Husayn grabbed a kitchen knife in an attempt to scare the other man.\nBut the altercation somehow resulted in the other man suffering slight injuries to his thigh.\nMr Bin Husayn had later turned up at Pieta’ police station to report the incident.\nInspector Vella further explained that the knife had been cleaned, as had the area of the house where the incident took place. The knife, sealed in brown packaging, was handed to the court.\nThe accused pleaded guilty, saying he never intended to hurt the other man but had simply wanted to scare him away.\nThe court was informed that the victim would shortly be released from hospital where he is receiving treatment for slight injuries.\nMagistrate Rachel Montebello condemned Mr Bin Husayn to a 2-year jail term suspended for four years.\nThe court also bound the accused under a €1,000 personal guarantee for one year, not to approach the victim in any manner.\nLawyer Victor Bugeja was legal aid counsel to the accused.", "comment_count": 0, "id": 4091}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The Customs Department is offering to move out of its historic premises in Valletta to new offices near the former Air Malta headquarters, with director general Joseph Chetcuti saying the site would be the logical one for another free zone.\nJoseph Chetcuti\nThere is currently only one free zone in Malta – at Malta Freeport – which is regulated by the Free Zones Act, and falls under the remit of the Economy Ministry.\nMr Chetcuti said it had been confirmed that his department would oversee them. In August 2016, Aaron Farrugia, then the CEO of the Freeport Corporation had said that it was the logical authority which should take over free zones, which set off a huge backlash with wrangles go on behind the scenes for some time.\nRead: No use crying over spilled milk\n“I was concerned,” Mr Chetcuti admitted, “but not any longer. Malta Enterprise and the Economy Ministry, when they were talking about the logistics hub, were originally envisaging passing the control to another authority. We resisted that and the final outcome respects the common good,” he said.\n“Free zones should be either near a sea port or the airport – as then they can be securely enclosed and controlled 24/7 by Customs, which would man every gate round the clock. The operator would have to keep detailed records. It is not too different to the bonded warehouse concept – where taxes are suspended unless they are moved into the community.\n“But the goods in a bonded warehouse are covered by a bank guarantee – whereas there is no fiscal cover in a free zone. Hence, Customs are responsible for the revenue – and this is not just Maltese revenue but European Commission revenue, which gets 80 per cent of it. This is why we are subject to audits,” he stressed.\nMr Chetcuti, who took over the department three years ago after three decades at the department, has had his hands full with preparations for Brexit but has also been thinking outside the box. One of his ideas is for a free zone at the former Air Malta headquarters.\nFree zones should be either near a sea port or the airport\n“It is linked to the sea port and it could attract new investment. Why not have a fine arts warehouse in a free zone, as some airports do? And you can have a tunnel linking the Freeport, the airport and the logistics hub planned for Ħal Far.”\nHe explained that there was already a Customs presence at the Freeport and Ħal Far, but if the department had its headquarters at the edge of the Luqa zone, it would easily be able to offer 24/7 coverage there too.\n“Customs House is one of the very few non-sacred buildings built by the Knights, which is still used for its original purpose.\n“I am sure that a better use could be found for it,” he said.\n“When it was built, Grand Harbour was the main port. Today, all you need here is a small office to handle passenger traffic. And industry is no longer centred around Grand Harbour. Being in Luqa would be much more convenient for industry.”\nAnd what about other sites?\nHe said that he would have no objection to the Mediterranean Maritime Hub becoming a free zone, once the site – which is also connected to a port – was segregated and secured. The oil, gas and yachting hub currently has a public road going through it to ease traffic while the Addolorata junction is redone.\n“Once that road is closed, we will grant it. Everything is in place.”", "comment_count": 2, "id": 4092}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Lack of progress on the new Public Domain Act is simply down to “teething problems”, Environment Minister José Herrera said in response to criticism that the environmental protection law had been left on paper.\n“If there was no political will, we would not have passed the law. I was directly involved in drafting this legislation and I can assure everyone that there was consensus in Cabinet,” Dr Herrera told the Times of Malta.\n“However, we do not want to create a law that could stir up economic disruption or create panic among landowners.”\nIntroduced in 2016, the law is intended to add extra levels of protection to sites of environmental or cultural significance, allowing them to be designated as public domain and obliging the government to preserve them for future generations. However, the first list of sites nominated for public domain status in 2017 remains on the drawing board, and the legal deadline for fresh nominations the following year passed without the process ever beginning.\nStakeholders, including NGOs who nominated the sites and Opposition MP Jason Azzopardi, who piloted the law, have complained that implementation has stalled and that the government appears to have no will to see the process through.\nThere was consensus in Cabinet\nAsked about the delays, Dr Herrera stressed the law’s importance and admitted his dissatisfaction that it had not been fully implemented, but said he was hopeful the process for the first list of sites could be completed “in the coming months”. \nThe delays, he said, came about after the parliamentary environment committee had received legal advice to clarify ownership issues within the nominated sites to ensure that no individual rights were affected.\n“The law does have provisions to protect private owners, so we could have just forged ahead, but it was felt that for consistency’s sake and to prevent confusion, it would be better to determine which areas are private and which are not, and this has taken some time,” he said.\nDr Herrera was speaking at the launch of a new environmental initiative in Wied Għomor, San Ġwann, which the minister said he wishes to nominate for public domain status but which has not yet been formally considered because of the legal delays.\nThe new initiative will see more than 100 kilometres of valley around Malta and Gozo surveyed to gather new data on water systems, ecology and land-use, with the eventual aim of developing a master plan for their conservation and management.\nThe ambitious project is a joint initiative by Ambjent Malta and the Energy and Water Agency, funded by the EU’s Life programme, and is expected to take around a year, gathering information and filling in data gaps on 11 different catchment areas.\nDr Herrera said his ministry had already set up a taskforce to clean and rehabilitate valley systems, and that the new studies would help to guide further conservation efforts by providing detailed scientific data on the valleys’ ecological make-up and development pressures.", "comment_count": 5, "id": 4093}, {"keywords": "", "author": "Jacob Borg", "article_body": "A European Parliament committee on Tuesday voted in favour of a resolution raising rule of law concerns in Malta.\nThe rule of law resolution about Malta and Slovakia sailed through the civil liberties committee, with 40 votes in favour and seven against.\nMEP Sophie in’t Veld, who led the rule of law missions to the two countries, heralded the large majority in the committee expressing “severe criticism” of the Maltese and Slovakian governments for the insufficient action being taken against corruption and crime, and for not finding who ordered the killings of Daphne Caruana Galizia and Jan Kuciak.\nThe resolution will be voted on in plenary next month.\nThe civil liberties committee called on a full and independent public inquiry into the murder and into the response by the public authorities to it.\n'Hate speech and disparagement'\nAccording to the resolution, the Maltese authorities have not yet sought to obtain data stored on Ms Caruana Galizia’s laptops and hard drives from the German federal police. The data was handed over by representatives of the Caruana Galizia family.\nThe resolution raises concerns about the “hate speech and disparagement” of the memory of Ms Caruana Galizia.\nWatch: What Justice Minister Bonnici told MEPs in financial crimes committee\nThe committee backed calls on the Maltese government to publicly and unambiguously condemn such acts and urges strong action to be taken against any public officials fuelling hate.\nIt also called for the immediate publication of the Egrant inquiry report and on Malta to stop selling EU passports.\nFinal vote to be taken next month\nThe final resolution that will be voted on by all MEPs next month urges the European Commission to enter into a dialogue with the government in the context of the rule of law framework, a three-stage process whereby Brussels issues an assessment, makes recommendations and monitors the EU country’s follow-up.\nDemands are also made on the government to investigate investigation into the Panama Papers revelations and the links between the Dubai-based company 17 Black and the Prime Minister’s top aide, Keith Schembri, as well as Tourism Minister Konrad Mizzi.\nOpinion: Rule of law, you say - Ranier Fsadni\nPN MEP Roberta Metsola said the massive cross-party majority in the committee was yet another signal to the Prime Minister.\n“He would be wrong to ignore it yet again. The sad part is that he will inevitably continue with his partisan attacks instead of taking the action necessary”.\nDr Metsola said the report was not about pushing a partisan agenda but about implementing the guarantees that EU membership gave to the Maltese.\n“I hope the Prime Minister now takes heed and sends a clear political signal of his willingness to tackle abuse, publishes the Bugeja inquiry report in full, stops the state-sponsored hate campaign against Daphne Caruana Galizia and ends this association with Henley and Partners.\n“He has a chance to do this before the vote in March, but sadly once again I have no doubt that he will choose the interests of Konrad Mizzi over the interests of the people of Malta and Gozo”, she said.", "comment_count": 48, "id": 4094}, {"keywords": "", "author": "Claire Caruana", "article_body": "The husband of the woman found in a decomposed state on Monday told neighbours she was “fine” when they asked about her some three weeks ago.\nNeighbours of the British couple living in St Paul’s Bay, who spoke to the Times of Malta on Tuesday, described how they had last met the woman’s husband some three weeks ago and as they had not seen or spoken to the wife in some weeks, they asked him how she was doing.\n“I saw him walk past some three weeks ago and I asked him about her because we hadn’t seen her in weeks. He said she was “all right” and continued on his way,” one neighbour, the owner of a clothes’ shop across the street from the couple’s house, said.\nThe shop owner said that she only learnt that her 69-year-old neighbour had died after news of her death started making headlines on Monday evening. She had not seen, heard or smelt anything that suggested the Briton had been dead for months.\n“The windows and doors of the home were always shut so we never heard or saw anything. We knew that the woman had been to hospital some time ago, but that’s it. Their pets, cats and dogs I believe, didn’t even make any strange sounds, as one would expect,” the woman said.\nThe neighbours described the 69-year-old as a quiet but educated woman who, while not one to spend her days chatting away with those who lived nearby, would always smile and exchange pleasantries with those she met on the quiet St Paul’s Bay street.\nVarious neighbours also described how up in the past, the woman would often be seen walking to the pubs in the area with her husband in the evenings.\nOn whether the pair ever had any visitors, the neighbours said they never saw anyone walking in or out of the house, pointing out that there had been one occasion last year when a relative had stayed with the couple for some days.\nPolice called at the two-storey home on Monday after a relative contacted the British High Commission to say that he had been trying to speak to her without success for months. The High Commission then alerted the police.\nAccording to reports, the woman was found on her bed, with her widower keeping the body at home because he did not want to be parted from her.", "comment_count": 32, "id": 4095}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A director of a cleaning company who was convicted of misappropriating some €85,000 in VAT payments has had his conviction revoked on appeal since he had been wrongly prosecuted in his personal capacity.\nCharles Le Brun was prosecuted 12 years ago after the Commissioner for Revenue informed the police that the taxpayer “for and on behalf of Cleanwell Services Ltd….has submitted various Value Added Tax returns without payment or with part payment.”\nHe was convicted 10 years later, landing a two-year jail term suspended for four years. He was ordered to refund the VAT Department €85,112.93 within seven days from date of judgment.\nIn an appeal, Mr Le Brun’s lawyer argued for revocation because the action was time-barred, as well as the fact that the prosecution had failed to prove that the misappropriation had actually occurred since invoices issued did not automatically mean that the relative payments had been received.\nThe court of criminal appeal, presided by Madam Justice Consuelo Scerri Herrera, prior to entering into the merits, considered whether Mr Le Brun had been charged in his personal capacity or as director of the company.\nIt emerged that although from the outset, the intention of the Commissioner for Revenue had been to instruct prosecution against the director for failures allegedly committed by his company, criminal charges had eventually been issued against Mr Le Brun in his personal capacity.\nIndeed, there had been no indication in the original writ of summons that Mr Le Brun was being prosecuted in terms of his liability as director of Cleanwell Services Ltd.\nThe court also observed that, even if the alleged misappropriation was to be proved, there was nothing to prove that such wrongdoing had been committed personally by the accused, rather than by the company. Although the VAT registration form had named Mr Le Brun, all tax notices had been issued in the name of the company and duly signed by the appellant as director.\nIn the light of all this, the court upheld the appeal, revoked the conviction and cleared Mr Le Brun of all criminal liability.\nLawyer Stefano Filletti was defence counsel.", "comment_count": 0, "id": 4096}, {"keywords": "", "author": "", "article_body": "Updated 2.50pm\nThe Commissioner for Voluntary Organisations approached HSBC Bank Malta asking it to reconsider its new account maintenance fees - but was rebuffed.\nThe commissioner had asked the bank to reconsider its decision because it put a 'disproportionate burden' on the organisations.\nHis protests, however, were to no avail, the Office of the Commissioner said on Tuesday.\nHowever, bank CEO Andrew Beane told the Times of Malta that HSBC has exempted those involved with pure philanthropy, such as those entities involved in health, wellbeing, and those in need.\n\"The cost of providing accounts in these days of enhanced compliance at a commercial reality. The maintenance fees do not cover the bank's expenses in full - but HSBC will continue to subsidise its customer,\" he said, referring to customers in general.\nHe added that the bank only recoups some 75 per cent of its account handling fees from the fees, and stressed that the bank would not extend these fees to its retail customers.\nMr Beane said that bank took its social responsibility very seriously and had invested €400,000 last year on community initiatives.\nThe Times of Malta revealed on January 8 that companies banking with HSBC have to pay a maintenance fee of up to €360 a year as from this year. Clubs and associations will have to pay €27 a month, while sole traders and condominiums will pay €12. \nRead: New HSBC €360-a-year maintenance fee angers businesses\nHSBC Malta on Tuesday said its profit was down by 23 per cent to €38.6 million in the financial year ended December 2018.", "comment_count": 2, "id": 4097}, {"keywords": "", "author": "", "article_body": "Provisional agreement has been reached between the EU's institutions for a Regulation setting, for the first time, strict CO2 emission standards for trucks.\nBut it will not happen any time soon. The rule will apply only to new trucks, from 2030.\nTuesday's decision follows the agreement reached in December on new CO2 emission standards for cars and light vans in the EU for the period after 2020.\nAs part of the sets of legislative proposals on clean mobility introduced by the Juncker Commission, it is a further stepping stone for modernising the European mobility sector and preparing it for climate neutrality in the second half of the century, the European Commission said.\nIn terms of Tuesday's agreement, emissions from new trucks will have to be 30% lower in 2030 compared to the 2019 emissions. \nCommissioner for Climate Action and Energy Miguel Arias Cañete said: “With the first-ever EU emission standards for trucks agreed, we are completing the legal framework to reach the European target of cutting greenhouse gas emissions by at least 40% by 2030. The European Parliament and Council have reached an ambitious and balanced agreement. The new targets and incentives will help tackle emissions, as well as bring fuel savings to transport operators and cleaner air for all Europeans. For the EU industry, this is an opportunity to embrace innovation towards zero-emission mobility and further strengthen its global leadership in clean vehicles.” ", "comment_count": 21, "id": 4098}, {"keywords": "", "author": "", "article_body": "Partit Demokratiku has complained to the chairperson and the members of the Petitions Committee in parliament about delays in the consideration of a petition against the proposed doubling in the number of tuna pens in the north.\nThe petition had been signed 1,865 citizens in May 2018.\nRead: Extra tuna ‘cages’ are empty, Environment Minister says\n“The right to freedom of opinion, expression and association are fundamental human rights. Petitions are such a right, and their timely execution defends such rights,” stated MEP candidate Martin Cauchi Inglott.\nThe petition objects to the doubling of pens, from 12 to 24, of a tuna farm operation off the Northeast coast of Malta.\n\"Its operations have already shown that it has been of detriment to residents and swimmers and is causing damage to the marine environment through oil slicks, fish residue and waste products from the tuna confined to these pens,” added party leader Godfrey Farrugia.\nPD is favour of a strategy that sustains aquaculture and but wants to \"bring the authorities to their senses so as to protect public interests\".\nMEP candidate Camilla Appelgren stressed that the Environment and Resources Authority had already testified that the slime coming out of the fish farms was an imminent danger to the environment.", "comment_count": 1, "id": 4099}, {"keywords": "", "author": "", "article_body": "A man was critically injured on Tuesday at 9am when his truck crashed into the valley at the bottom of Ġnejna hill.\nThe truck was being driven down the hill and failed to take the turn. It crashed through a barrier and ended up on the valley floor, several metres below.\nThe driver's cabin was badly crushed and the tip came off and was thrown several metres. \nThe driver, a 24-year-old Albanian residing in Żabbar, was pulled out of the wreckage by rescuers of the Civil Protection Department and taken to hospital.\nPhotos: Mark Zammit Cordina.", "comment_count": 0, "id": 4100}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated at 5pm with Henley & Partners statement\nLeaked e-mails sent in June 2011 show that SCL, the group behind data mining company Cambridge Analytica, offered to broker a meeting between then-Opposition leader Joseph Muscat and passports czar Christian Kalin. The e-mails, seen by the Times of Malta, feature correspondence between SCL and Mr Kalin about a potential meeting with Dr Muscat.  “He is young, very determined and very savvy for international investment,” the SCL e-mail to Mr Kalin reads.  Mr Kalin responded positively to the offer for a meeting, the e-mails indicate.  The correspondence sent by the election consultancy firm also questioned if some polling should be conducted.  Mr Kalin advised holding off on the polling “since its [sic] too far away from election time”.  Asked by SCL if he would be helping source any election funds, Mr Kalin replied that he was not in the business of campaign funding.  SCL also approached the Nationalist Party just ahead of the 2013 election, the party's then-secretary general Paul Borg Olivier has said. \"I am proud to have kicked out both Christian Kalin and SLC from sneaking further into the PNHQ,\" he wrote on Facebook.\n\n \nDenial and pushback\nThe government denies there ever being any contact between SCL and Dr Muscat.  Despite these denials, a House of Commons report published on Monday said SCL held meetings in Malta, and that Mr Kalin, of Henley & Partners, was introduced by SCL to Dr Muscat in 2011.  The government pushed back when references to such a meeting first appeared in an interim report by the UK Parliament’s Digital, Culture, Media and Sport Committee last year.  Despite diplomatic representations and the engagement of a PR firm, the House of Commons final report kept the references to the SCL meeting, citing “confidential information” as confirmation that the Labour Party had dealings with SCL. \nFacebook controversy\nThe report said that SCL Elections and its associated companies, including Cambridge Analytica, worked on campaigns that were not financed in a transparent way, overstepping legal and ethical boundaries. The London-based company Cambridge Analytica was last year accused of using the personal data of 50 million Facebook members to influence the US presidential election in 2016.\nSCL is the group behind the now-defunct Cambridge Analytica. Photo: Shutterstock\nIts executives have also been filmed in an undercover sting operation suggesting they could use honey traps and potentially even bribery to discredit politicians and help influence voters in St Kitts and Nevis.   Personal data from more than 6,000 Maltese Facebook users was shared with Cambridge Analytica.  More Maltese citizens were targeted than Estonia, Latvia and Luxembourg, countries with higher population numbers.\nHidden hand\nThe committee was told that behind much of SCL Elections’ campaigning work was the hidden hand of Christian Kalin, who arranged for investors to supply the funding to pay for campaigns, and then organised SCL to write their manifesto and oversee the whole campaign process. In exchange, Henley & Partners would gain exclusive passport rights for that country, under a citizenship-by-investment (CBI) programme.  Such a scheme was controversially launched by the Labour government months after the 2013 election. No mention of passport sales was made in Labour’s pre-election manifesto. \n'Interaction with SCL, but no partnership' - Henley\nIn a statement, Henley & Partners acknowledged that there had been \"a certain amount of interaction\" between it and SCL, though it flatly denied that it \"worked in partnership with SCL or in any way sought to gain from the outcomes of any elections.\"\nIt expressed concern that the House of Commons committee had relied on several anonymous sources \"without any seeming interrogation of the motivation behind the disclosure\". \nLess than 1 per cent of all applicants to its various citizenship-by-investment schemes had been \"nefarious\", it said, and the committee report's criticism of the sector was \"without justification and \"one-sided\", the company said. \n\"The important value created by investment migration for sovereign states and their people have been entirely ignored,\" it said. ", "comment_count": 230, "id": 4101}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "HSBC Bank Malta has seen its profits slide by 23 per cent to €38.6 million in the financial year ended December 2018.\nA bank statement issued on Tuesday blamed the results on low interest rates and excess liquidity in the market, adding that there were scant opportunities for investment.\nHowever, CEO Andrew Beane also warned about the danger to the sector as a whole: \"2018 was difficult for the local financial services sector which suffered further reputational damage. It is essential that all market participants ensure anti-money-laundering standards are fully implemented without delay in order to avoid more significant long-term risks. We welcome new initiatives announced by the local authorities which the industry must fully embrace and support,\" he said in the company announcement.\nThe bank has seen a reduction in its loans to corporates - which among other things resulted in a 10 per cent decrease in net interest income. It did however, register a boost in the number of mortgages approved - which increased by 10 per cent. Net loans and advances to customers decreased by 1% to €3,110m, driven by risk management actions and a reduction in non-performing loans. Retail lending grew by 2 per cent.\nOperating expenses were 5 per cent lower compared to the year before, but the lower income resulted in a higher cost efficiency ratio of 73 per cent compared with 66 per cent in 2017.\nThe bank said that it expected credit losses of €3.5 million, €4.7 million higher than 2017 when it managed to reverse €1.2 million in loan impairments. It has, however, managed to reduce non-performing exposures by over 19 per cent compared with December 2017.\nTo ensure that the bank holds sufficient capital to support future growth as well as meeting these new requirements, the board recommended a final dividend pay-out ratio of 30 per cent of net profit. This will bring the full year 2018 dividend pay-out ratio to 47 per cent.\nThe final gross dividend will be 1.8 cent per share, which brings the total dividend for 2018 to 5.8 cents. This brings the full year 2018 dividend pay-out ratio to 47 per cent.\nMr Beane said that the bank's reduced profitability had led to a \"stronger and safer bank for our shareholders, customers, employees and the jurisdiction\".CEO Andrew Beane\n\"It is a clear that the new European Central Bank requirements relating to the treatment of non-performing loans (NPLs) mean that Malta’s current framework for the recovery of security in the event of default requires reform.\n\"Banks will be required to hold additional capital against fully secured NPLs as a direct result of the long time to recover through current legal processes. For HSBC the expected impact relates to loans where the bank does not expect to incur additional losses even though the recovery process currently takes years,\" he said.\n\"While we will sustain the bank’s position as a strong dividend generating company, the board has recommended a final dividend pay-out ratio of 30 per cent in order to allocate additional capital to grow the business and meet the new ECB NPL requirements in the event that reforms to the current system are not forthcoming.”", "comment_count": 91, "id": 4102}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government has been ordered to reveal the contents of a controversial €274 million contract awarded to James Caterers and a subsidiary of the Seabank db Group, following a complaint filed under the Freedom of Information Act by the Times of Malta.\nReversing various decisions made by the Ministry for the Family, which turned down requests for the contract’s publication, including by MPs in Parliament, the Information and Data Protection Commissioner upheld this newspaper’s complaint, chiding the government for its lack of transparency.\nThe Times of Malta protested against the stance of Family Minister Michael Falzon and Parliamentary Secretary Anthony Agius Decelis to keep the contract under wraps. This newspaper argued that since the contract concerned public health and involved the spending of hundreds of millions of public funds, full transparency was in the public interest.\nIn his decision, Commissioner Saviour Cachia ruled that while it was true that some aspects of the contract for a 500-bed extension at St Vincent De Paul may be commercially sensitive, “the decision taken by the government to refuse, in toto, the request by the Times of Malta is not entirely justified”.\nHe said that “without considering providing partial access by redacting or otherwise masking the exempt material (in the contract), is not considered to be in line with the transparency spirit” as contemplated by the Freedom of Information law.\nThe commissioner ordered the government to let this newspaper inspect all the contracts and agreements it had entered into on SVDP after redacting certain information including personal data and commercial rates.\nLegal sources familiar with the FOI Act hailed the decision of the Information and Data Protection Commissioner, describing it as “a first” when it comes to revealing public contracts of a certain magnitude.\nAmendment outside the scope of the original tender\nThe controversial mega-contract goes back to November 2015 when the government published a tender for a public-private partnership involving the provision of daily meals for residents and staff at St Vincent De Paul over a 10-year period and the construction of a new kitchen.\nIn an ‘abnormal’ request inserted in the same tender, the government included an “additional investment” clause, through which the awardee was expected to give a “gift” to the government at no additional cost.\nDuring the evaluation, a company owned by the Vassallo Group submitted the cheapest offer for the provision of meals and the building of a kitchen.\nHowever, the government chose to award the tender to a consortium formed by James Caterers and a Seabank db Group subsidiary, as they had made an additional investment offer to build a 250-bed extension at the old people’s home on public land.\nFollowing the publication in The Government Gazette of a record €274 million direct order related to this tender, the Times of Malta found that from the original €60 million the value of the tender more than quadrupled.\nJustifying this phenomenal increase, the government explained that, following the original award of the tender, the James Caterers/db Group consortium entered into fresh negotiations with the government and submitted an “improved offer” proposing to build a 500-bed extension at SVDP instead of its original 250-bed offer.\nIn exchange, the government agreed to grant the same consortium through a direct order a contract for the management of the same extension and paying them €274 million over 10 years.\nExperts told this newspaper that this latest amendment to the tender was “outside the scope of the original tender” and potentially infringed EU public procurement rules.\nThe Democratic Party had called upon the National Audit Office to investigate the contract and the government agreed. Vassallo Group did not appeal the final decision following the award of the tender.\nivan.camilleri@timesofmalta.com", "comment_count": 44, "id": 4103}, {"keywords": "", "author": "", "article_body": "The following are the stories making the newspaper front pages on Tuesday.\nTimes of Malta and In-Nazzjon feature a House of Commons report claiming that the Labour Party had pre-election meetings with Cambridge Analytica.\nTimes of Malta also reports how the Lands Authority was fined by the Data Protection Commissioner for a data breach. \nThe Malta Independent says the Planning Authority board on Thursday will decide two applications for petrol stations. \nl-orizzont highlights a report about dementia and the need to tackle it. It also says the Labour Party is expected to win four seats in the forthcoming European Parliament elections.", "comment_count": 0, "id": 4104}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 2.45pm\nThe \"cure\" for gay entertainer Chucky Bartolo is an assault rifle's bullet to put him out of his misery, according to one of several hate messages he has received over the past months.\nAnother social media user believes Mr Bartolo has mental issues or was “abused in the lift as a kid” – accusations that the LovinMalta host condemned because it made light of abuse victims.\nMalta's LGBT community might have made great strides in recent years but the online resentment and hateful stereotype directed at gay people still persists.\nOther messages aimed at Mr Bartolo tackle \"pre-conceived notions\" of how a man should behave or look, he says in Times of Malta's #stophate campaign.\nFor the last month, the campaign has seen personalities reading out the hate messages levelled out at them on social media.\nRead: Malta has highest online hate speech in EU - Eurobarometer\n\nThe project also seeks to raise awareness of the impact hate speech can have on its recipients and the responsibilities that come with freedom of speech.\n“I cannot believe that we are at a point where we have to ask people to stop spreading such negativity online... You may have noticed that I’m human so these messages do get to me,\" Mr Bartolo says. \nHowever, he is especially concerned about young LGBTIQ people who look up to him but might feel they have to change when faced with such comments.\nThe Facebook user who had suggested an assault rifle as a \"cure\" for Mr Bartolo told Times of Malta he had been misunderstood. \n\"What I meant is that if he actually shot a gun, he would feel manlier as opposed to be into makeup and dressing up,\" he told Times of Malta. \nHe said that he has now apologised to Mr Bartolo. \nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com\nWatch: ‘I wish migrants would rape your wife’ - Peppi Azzopardi\nWatch: ‘You will go down like Daphne’ - Godfrey Farrugia\nWatch: 'I have a bullet ready for you' - Lara Dimitrijevic\n ", "comment_count": 169, "id": 4105}, {"keywords": "", "author": "", "article_body": "Updated 11.20am \nThe badly-decomposed corpse of a woman was found in a residence in St Paul's Bay by the police on Monday evening.\nSources said the body was that of a 69-year-old Briton resident in Malta. \nPolice called at her apartment in Triq San Luqa after a relative contacted the British High Commission to say that he had been trying to speak to her without success for months. The High Commission alerted the police.\nAccording to unconfirmed reports, the woman was found on her bed, with her widower keeping the body at home because he did not want to be parted from her.\nShe is believed to have died in November.\nTVM said the widower is being questioned by the police.\nA police spokesman said that a preliminary investigation was still in progress, but that so far there was no suspicion of foul play. An autopsy will be held on Tuesday to determine the cause of death.\n ", "comment_count": 0, "id": 4106}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "More than a year after it was planned to be completed, the Valletta ditch public garden was inaugurated by Prime Minister Joseph Muscat in a ceremony on Monday.“This place was once a neglected car park with poor accessibility, lacking in light and security. It has now been transformed into a place where families can spend time together, a positive example of urban greenery, and a new tourist attraction uniquely surrounded by the Valletta bastions,” Dr Muscat said.The regeneration of the capital, he said, had unlocked new possibility for public spaces around the city, which had yet to reach its full potential. The €5 million Lapparelli Garden, named after the architect who designed Valletta, represents the final piece of the puzzle for the nearly decade-long regeneration of the capital city entrance. The regeneration has also included the new City Gate and Parliament building, as well as the restored Triton Fountain and square. Originally planned as part of the City Gate project, the garden was shelved soon after the Labour Party was elected to government in 2013. It was then revived by the Grand Harbour Regeneration Corporation in 2016, planned to be finished before the start of the Valletta 2018 programme for the European Capital of Culture, before further delays pushed completion first to July and then to January. The new garden is accessible by a lift from City Gate and a staircase from the Parliament building, as well as the end of the ditch on Great Siege Road.Surrounded on all sides by the Valletta bastions, it includes open spaces, benches and green landscaping. Speaker Anġlu Farrugia, tourism minister Konrad Mizzi, parliamentary secretary for Valletta Deo Debattista, and GHRC chairman Stefan Zrinzo Azzopardi were also present for the opening.", "comment_count": 53, "id": 4107}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Free zones should be well-regulated, but the model used in its operation should be from the outset based on a public-private partnership founded on a framework agreement with the Chamber of Commerce, Opposition MP Claudio Grech insisted in parliament on Monday.\nSpeaking during a discussion on the new legislation, he said free zones were “a no-brainer”, and the Opposition was in favour, explaining that the policies and vision which the government was now espousing had been PN policy for decades.\nHowever, he said that considering the environmental impact that these free zones would inevitably have, it was appropriate for proposals to be discussed before the Environment and Development Planning Committee. Furthermore, the risk of abuse by organised crime should be taken into account, as activities carried out in these zones posed the risk of money-laundering.\nOpposition MP Edwin Vassallo added that the space in the free zone should be offered for a nominal fee, but that the government should avoid tarnishing the sector with corruption, and “keep its hands off”.\nGovernment MP Aaron Farrugia spoke highly about the potential that free zones would have for the establishment of logistics hubs which offered high-value-added products, especially considering the premium on space in Malta.\nAccomplishing this would require human resources on the ground with the required experience, and MCAST and other institutions would soon be offering courses in logistics, he noted.\nPlans for a logistics hub mooted in 2016 had flopped when an international request for proposals had not even received a single bid. However, since then, the idea of free trade zones has taken over, as they would offer entities the possibility to bring goods into Malta without having to go through customs procedures, as long as were not take out of the zone.", "comment_count": 0, "id": 4108}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, give, a jail term over his alleged involvement in a robbery from a Żabbar residence almost 10 years ago, is to have his case heard anew after an Appeals Court quashed the judgment on the basis of a formal defect.\nChristopher Scerri, 40, had been handed a 2-year effective jail term in connection with the burglary, alongside his alleged partner-in-crime, Freddie Delia, 40, who was given a suspended sentence.\nMr Scerri’s lawyer had filed an appeal challenging the conviction on the grounds of a wrong appreciation of facts by the Magistrates’ Court, where the prosecution’s case had pinned upon the testimony of Omar Pisani as a dubious witness and one who was “absolutely not credible”.\nThe latter had admitted to his involvement in the burglary and had testified against the other men, and his version was corroborated by the circumstantial evidence which in reality “led to nowhere,” the appellant had argued.\nIndeed, a Pajero allegedly driven by Mr Scerri had left the scene of the crime some three quarters of an hour before the robbery took place, its driver being identified through a “green T-shirt” later discovered at his ex’s home.\nHowever, the court of criminal appeal, presided over by Madam Justice Consuelo Scerri Herrera, did not enter into the merits of the appeal, observing instead ‘ex officio’ that the judgment was null since the first court had failed to specify, in the operative part of the judgment, the articles of the law upon which it had based the conviction.\nFor this reason the court annulled the judgment, sending back the case for re-hearing before the Magistrates’ Court.\nLawyer Franco Debono was counsel to the appellant.", "comment_count": 0, "id": 4109}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "The Fisheries Board has not met since the 2017 general election but is expected to be “reconstituted in the coming days,” a spokesperson for Environment Minister José Herrera said.\nThe board’s long and unusual hiatus was raised with The Sunday Times of Malta last week by sources in the fisheries sector, which has been rocked by Spanish investigations that uncovered a vast illegal trade in bluefin tuna.\nSpanish authorities have seized more than 80,000 kilos of the tuna caught in and around Maltese waters and fattened in Maltese tuna pens. Investigators in Malta and Spain said that the tuna ranching industry is feared to be rife with abuse.\nThe board, which is composed of fisheries experts and fishermen, representatives of cooperatives and of various government entities, has a wide advisory role established in the Fisheries Conservation and Man­age­ment Act. The board’s function is to provide “advice” to the minister on matters raised by the minister himself, as well as “generally in relation to the development, administration and conservation of the fisheries of Malta.”\nPrior to the election the board used to meet every six weeks or so, or about eight times a year.\nOne board member said that he has in the past spoken to senior officials about the board’s inacti­vity, and that no complete answers were given. Prior to the election the board used to meet every six weeks or so, or about eight times a year.\nThe spokesperson for the minister, who is responsible for fisheries, did not answer a question as to why the board hasn’t been convened for 20 months. The brief one-sentence answer only affirmed that the “board would be reconstituted in the coming days”.\nAdditional functions of the board outlined in law include making proposals to curb fishing on species in accordance with conservation exigencies, and to make “recommendations” on any matter raised by any board member, government department, or any person.\nThe board is supposed to draw up annual reports about its work.\nA long-time member of the board who preferred not to be named said the board’s erstwhile “true consultative role” had diminished over the years, especially in the past five to seven years, and the feeling was that decisions were taken elsewhere and presented in the board as a formality.\nOther members concurred and spoke of a split between traditional small-scale fishermen and those representing intensive or industrial fishing interests, including trawling. The ‘split’ has sown discord and paralysis in the board.  ", "comment_count": 14, "id": 4110}, {"keywords": "", "author": "Mark Wood", "article_body": "Fr Joe Inguanez, director of the Church research institute Discern, speaks to Mark Wood in the aftermath of its latest census on church attendance, which shows a continuing downward trend.\nThe Sunday Mass census painted a picture of falling attendance stretching into the future. In your introduction to the publication, you speak of the need for the Church to act immediately and not blame “the world”. What sort of action do you think the Church needs to take straightaway?\nThere is no single action which can solve this problem. However, if I were to choose one solution, I think what we need is to change. What the Maltese Church needs is a paradigm shift in its pastoral ministry.\nHowever, change always meets resistance. Both individuals and institutions suffer from the law of inertia. There is an urgent need to start a number of processes of re-evangelisation, and in certain cases evangelisation.\nIt is clear from the Gospel that evangelisation took place in a time of religious crisis. This first evangelisation was ushered by a man living in poverty, John the Baptist, who summoned his generation to a ‘metanoia’. This means no less than ‘a change of mind’.\nThis is what repentance implies. The Lord admonished us: “Unless you repent, you too will all perish… unless you repent, you too will all perish”. His repetition indicates the urgency. Do we think that the people whom Christ was addressing were worse sinners than we are?\nIt is appropriate to remember how we start every Mass, which is by confessing our mistakes, committed through “through my fault, through my fault, through my most grievous fault”. We start with our personal faults, not by pointing at the other.\nWhat are these faults that you point to?\nWe should not beat about the bush. I am grateful to the medical consultant who informed me of my illness without equivocating. This has greatly contributed to saving my life.\nThe liturgy should never be the simple repetition of liturgical texts, as if it were a mantra\nWe are faced with a crisis of faith. Attendance at Sunday Mass, important though this is, is not the main issue.\nRead: Mass attendance set to collapse in the years to come\nThe strongest signs of a weakening faith are the way that many Maltese people who still identify themselves with the Catholic faith are acting in all spheres of life, and the way they solve their personal and social problems.\nSocial problems cannot be ignored because we are all ‘political animals’. We cannot develop our personality without being involved in social action of all sorts.\nOur Lord Himself gave us a litmus test of faith when he said, “By their fruits you will recognise them”. In the same vein are the words of St James: “Faith without deeds is worthless… As the body without the spirit is dead, so faith without deeds is dead.”\nEveryone is shocked at the clerical sexual abuse against minors and majors around the world. In no way, manner or form do I want to look the other way when faced which such a horrendous human and spiritual aberration. However, the sexual abuse should not make us forget other abuses, clerical or otherwise. \nI am pleased with the many works of charity undertaken by the Church as an institution, both in Malta and globally, and also by individuals. However, much of our ministry is often restricted to our comfort zones. St Oscar Romero was not murdered because he had built a school, a hospital or a hospice, but because he challenged the injustices in his diocese and in his country.\nClericalism is one of our comfort zones. Clericalism was described by Pope Francis as one of the strongest challenges facing the Church. Even liturgical celebrations, holy though they may be, can become one of our clerical and lay comfort zones.\nOne falls into the trap of clericalism when one considers the priesthood as a privilege rather than a service, when priests become the ‘officers’ of the institution rather than the servants of the people, when they choose the front rows rather than at the back seat in the temple.\nThere is another trap: when the laity are considered or consider themselves as the ‘lunga manus’ of the clergy.\nThe Latin American Bishops were warned by the Pope not to create a “lay elite” consisting of those laity who work in the ‘things of the Church’ instead of helping ordinary baptised people live their faith in everyday situations. And this applies to us too.\nWhat is the new paradigm that you propose?\nThe paradigm shift which I believe in can be found expressed succinctly in the title of a book by Fr Bartolomeo Sorge SJ, Uscire dal tempio. Get out of the temple and its trappings.\nWe need a poor Church at the service of the poor and the lowly. It is in this way that shepherds can live “with the smell of the sheep”.\nIt is unfortunate that in our Church, we find different castes among clergy and laity, separated by a lack of a unifying pastoral vision arrived at after a structured pastoral dialogue. Some would argue that it is for this purpose that we had a Diocesan Synod. However, facts speak louder than documents.\nReal and effective dialogue in the Church and with the world is still weak. This is not only a very sad situation but also a deleterious one. Dialogue and communication are both a basic human and spiritual necessity, and a pastoral tool. In their absence, the “communion of saints” and the “joy of the Gospel” will remain a nice poem and a colourful dream.\nI am aware that there are members of both the clergy and the laity who do not agree that this is the situation we are in. However, I am sure that the silence of majority speaks louder than that!\nYou write in your introduction to the census that in the same way that a clerical garb does not make one a priest, liturgical vestments do not make the liturgy religious. What does make it religious?\nThe Italian proverb that the religious garment doesn’t make the monk can hardly be contested.\nLiturgical vestments can create an ambience which Rudolf Otto, in his analysis of religious, refers to as “numinous”, which he described as a fearful and fascinating mystery. Very often this is the way God has been presented.\nHowever, as far as Christian religious experience is concerned, this is only partially true. The Church itself is a mystery. It is a mystery because it is the Body of the Incarnate Christ. Christ is the Immanuel – God-is-with-us. Jesus was never the object of fear but of love. How could children and sinners rush after a man who was fearsome?\nThe aspect of Immanuel should be the heart of the liturgical action. In its millennial history the Church made many mistakes on this point. And we have some in Malta who want to present this type of liturgical drama which literally created a distance between the actors and the audience, the priest and the congregation.\nLet us take just one example. The Church has dropped the use of black liturgical vestments; yet there are still a few who doggedly ignore this and also cover the walls of their church with black drape. \nReligiosity entails several dimensions, and the liturgy is one of them. But essentially Christian religiosity entails the acceptance of the supernatural in all aspects of our life. The rest is consequential.\nIn terms of the liturgy then, what will make, in your words, “leavers or absentees return to Sunday Mass”?\nOf it nature, the liturgy is divine and human. Its main characteristic lies in the fact that it is communitarian, and participatory, and Christological. In fact, the priest was prohibited from celebrating Mass without a community; then through the biggest stretch of imagination, we reduced that community to the presence of an altar server or one person in the pews!\nThe liturgy should never be the simple repetition of liturgical texts, as if it were a mantra, but an expression of the joy and sorrow of God’s people in union with Christ as their Head.\nWhen immobilism taints the liturgy it will become ritualistic or worse rubricistic. It must celebrate the adoration of God ‘here and now’ in memory of Christ. Ritual in the liturgy should have a meaning to the congregation, otherwise it will be little more than the theatre of the absurd, thus rendering the liturgy irrelevant to human needs.\nCan something improve in the way celebrants are trained?\nFalling attendance is a symptom of a wider malaise that the Church needs to address urgently\nA lot. But please spare me the details. It’s enough to say that there is a consensus that several priests are failing in their homilies, that several commentators during the liturgy seem to be happier hearing their own repetitive comments than creating any enthusiasm among the congregation.\nAs far as singing is concerned, we cannot generalise and I am sure that many priests and laity are making a great effort. I do not think I can say the same about sacred music composers. It is ironic that we still sing a religious hymn on the tune of the song ‘The Carnival is Over’. This is one of the reasons why people are voting with their feet.\nIs the current model of the liturgy the cause of falling attendance or is it a symptom of a wider malaise that the Church needs to address?\nWithout underplaying the importance of the liturgy of the Sunday Mass, I believe falling attendance is one of the symptoms of a wider malaise that the Church needs to address urgently with a systematic and holistic pastoral plan.\nWhat we need is not specific programmes but a holistic, tenaciously pursued pastoral plan. One cannot cure a serious illness with painkillers.\nIs the local Church burying its head in the sand about the situation?\nThe way your question is worded already indicates the restrictive mentality inherited from liturgical texts. Why should we refer to the local Church and not to the Maltese Church? Did Paul ever say the local Church of Corinth? Does not Paul speak of the early Christian communities as Churches? Don’t you think that such expressions as ‘the local Church’ reflects a frame of mind that is still living in the fear of the Protestant Reformation?\nI must be honest. There are several parishes, groups and communities in the Maltese Church who are open to new and in no way unorthodox liturgical innovations.\nHowever, I am sorry to say that unfortunately, the Liturgical Commission, instead of becoming the motor for liturgical revival and keeping alive a post-Conciliar liturgical movement, has turned itself into an office. It would be more honest if we were to rename it as the Commission for the Official Translation of Liturgical Texts! And, from under the grapevine the translation I have at hand is not something to write home about!\nThis immobility might explain why in 2005, 35 per cent of the attendees went to Mass outside their territorial parish, and this percentage remained constant in 2017 when 35.2 per cent acted similarly. Are we aware that this will lead to the erosion of the territorial parish as community, if this exists, at all, thus undermining its main raison d’ être?\nThese is still another category who want to turn the clock back. For them this has become an ideology in the Marxist sense of the concept.\nAt the end of the day, the ultimate mission of the Church is to draw people closer to Christ, to experience him personally. So isn’t the emphasis on regular Mass attendance rather missing the point?\nI do not think that the Church is wrong in emphasising the regular attendance at Mass. Ours is a sacramental church; hence it is important for Catholics to understand that the Mass is a sign and an instrument of salvation.\nHowever, in my opinion it would be wrong if the Church were to make this ‘the’ central issue. The greatest emphasis should be on the Sermon of the Mount and specifically on the Beatitudes. This is the core of the Good News and the Gospel of joy.", "comment_count": 111, "id": 4111}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "A court has ordered the police to press charges against a dog owner whose pet permanently disfigured a shop attendant one year ago.\nSliema resident Lindsey Vella had ended up with a 5 per cent disability after she was bitten by the dog while stacking shelves at a convenience store at Gżira.\nThe dog owner had handed her a treat to give the animal, which was on a short leash at the time. It attacked her and tore at her lip, leaving her bleeding and in pain. The owner subsequently hurried out of the shop.\nMs Vella’s brother had gone public in an attempt to track down the dog owner.\n\"He just asked her if she was OK and then walked out of the shop,\" he had told Times of Malta.\nPolice subsequently identified the dog owner as Peter Attard, but did not press charges against him.\nWatch: 'A dog bit my sister in the face... help me find its owner'\nThat prompted Ms Vella’s lawyer to file a judicial challenge in which she called on the police commissioner to institute criminal proceedings against Mr Attard.\nIn a reply to the judicial challenge, the police commissioner had argued that Mr Attard had asked for permission to bring his pet into the shop and kept the animal on a short leash to retain “absolute control.”\nMr Attard, the commissioner argued, could not anticipate the animal’s instinct and had been acting in a friendly manner before it bit Ms Vella as she bent over to kiss the dog.\nThe victim’s lawyer, Stefano Filletti, had countered that a short leash was not the sole criterion for responsible pitbull ownership, arguing that the owner had to be responsible for the actions of his dog rather than invite people to play with it whilst providing treats or allowing them to approach the animal.\nOn Monday, magistrate Aaron Bugeja upheld Ms Vella’s challenge.", "comment_count": 0, "id": 4112}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Commissioner for Voluntary Organisations has warned that his Office is unable to fulfil its duties due to an acute staff shortage, a “crisis” which has not been addressed despite having been flagged by his predecessor in 2017.\n“Authorities seem to be totally unconcerned with the need to abide by the [Voluntary Organisations] Act and getting approval for even three additional staff is an unsurmountable obstacle incapacitating the workings of the Office and the need to carry out the necessary investigations as requested and required by Moneyval and the Auditor General,” Anthony Abela Medici lamented.\nDr Abela Medici sounded the alarm bells in his 2018 annual report, in which he gave an overview of his first few months in office,  after succeeding Prof. Kenneth Wain in May last year.\nHe remarked that last year brought about new responsibilities and obligations for the Office with respect to the fight against money laundering and terrorism. Moreover, new legislation obliging all voluntary organisations to enrol with the Office meant that the administrative capacity had to be beefed up to cater for the added workload. \nIn view of this, the NGO watchdog required lawyers, accountants and officers in order to investigate and scrutinise the annual returns submitted by the 1,600 organisations enrolled with it.\nAccording to the commissioner, his Office needs at least 30 persons to fill these roles but at the moment could only count on seven employees, excluding himself.\nHe said the need to increase staff had been also highlighted in a performance audit carried out last year by the Auditor General.\nOffice needs at least 30 persons to fill these roles but at the moment could only count on seven employee\nDespite this acute shortage, the only recruitment made was a lawyer who was released from the Courts of Law to join the Office.\nDr Abela Medici noted that his predecessor had also complained that the Office “had been relegated to an appendage of the ministry it was assigned to and that the whole operations of the Commissioner’s Office were compromised by the constant apathy in recruitment of staff”.\nQuoting from the 2017 annual report when Prof. Wain had complained that they had reached “crisis level”, Dr Abela Medici said he was “still finding exactly the same problems”.\n“We are still at crisis levels with staff complement not even minimal to address the much broader requirements of the Act,” he remarked.\nThe NGO’s commissioner reported that the existing shortcomings were even flagged by the Committee of Experts on the Evaluation of Anti-Money Laundering Measures and the Financing of Terrorism (Moneyval) during their mission in Malta last November.\nQuoting from the Moneyval report, he said the Office’s annual budget had been increased from €110,000 to €500,000 to be able to boost its staff. However, not a single new person had been allocated to the Office since then despite the lapse of three months.\nThe budget increase would be pointless if the Office could not recruit staff, he added.\n“It is futile to legislate if the enforcement of such legislation is rendered impossible through lack of staff.”", "comment_count": 7, "id": 4113}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Plans to use the University of Malta sports ground as a car park have sparked a backlash, but the student council has insisted the temporary measure was necessary to stave off a crisis.\nThe University Students’ Council (KSU) announced earlier this week that the sports ground would be used to compensate for the permanent closing of part of the largest car park on the Tal-Qroqq campus, which will be taken up by a new student living complex.\nThe measure, which was decided by the University administration, will only remain in place until the start of works on a new sports complex in October.\n“Although our long-term aim remains that of diverting the mentality from one of private-car use to the use of alternative modes of transport, such a situation is a particular one where the change has taken place drastically,” KSU said.\nHowever, in a flurry of responses to the council’s announcement, students and others who used the track complained about the take-up of one of the only available sports facilities in the area, and what some said was an unwelcome message in favour of continued private car use.\n\n“The hundreds of people who come here weekly in search for a less polluted and unbroken circuit to improve their health and wellbeing cannot and should not be expected to have their efforts blocked by vehicles every few seconds,” one athlete said.\nThis car park is in no way a solution\nResponding to the criticism, KSU president Carla Galea told The Sunday Times of Malta the council had spent years trying to promote alternative transport, but that the sudden loss of a large number of parking spaces made the temporary solution a necessary evil.\n“We have never campaigned to increase parking because we have been focused on reducing car use, and take-up has been much lower than we would have hoped,” she said.\n“With such a drastic change overnight, without even having enough time to inform students, we could hardly expect them to pick up alternatives in a matter of days.”\nMs Galea added that as the new car park would only be used for a few months there was now an urgent need for all stakeholders to redouble their efforts to promote alternative transport.\n“We now all have a deadline,” she said. “Everyone needs to work together and market the alternatives for students to get to University with peace of mind, or the chaos will be worse come October. This car park is in no way a solution, but it will give us time to come up with a solution.”", "comment_count": 63, "id": 4114}, {"keywords": "", "author": "Keith Micallef", "article_body": "The next President should be appointed with a two-thirds parliamentary majority to convey a strong message of unity, the Democratic Party is insisting.\nThe call was made on Monday afternoon at the end of a meeting between a PD delegation by Godfrey Farrugia, with President Marie-Louise Coleiro Preca, who is heading the steering committee tasked to pilot the Constitutional Convention.\nAddressing a news conference at San Anton Gardens, Dr Farrugia insisted there was still ample time to find agreement on a candidate who would enjoy the backing of both sides of the House.\nThe term of President Marie-Louise Coleiro Preca expires on April 4, but former Minister George Vella is already being touted as her successor. Under the existing constitution, the President is nominated by the government and is elected by a simple parliamentary majority.\n“If there is political will, there is still time [to amend the Constitution],” Dr Farrugia said.\nHe noted that since the Constitution would have to be amended to empower the parties have access to the ballot sheets of each and every voter, for three months after elections including those of May 25, he did not see why the constitution could not be changed to cater for the election of the President as well.\nDuring the news conference, PD outlined its other proposals for the convention. The party is proposing that in the first year, the steering committee holds wide-ranging consultations, so that in the second year a decision would be taken on “what model of democracy” should be adopted.\nFurthermore, PD is calling for the setting up of a technical commission which would use the recommendations submitted by the Venice Commission as a blueprint. Moreover, the steering committee should immediately establish the time-frames and terms of reference of the convention.\nThe party is also proposing a continuous educational campaign throughout the convention to keep the public abreast of what is going on.\nAsked whether the new constitution should be endorsed through a referendum, Dr Farrugia said there would be no need if the final draft was the result of genuine consultation.\nHe noted that holding a referendum would pose the risk of large sections of the electorate toeing the party line, rather than decide on the merits of the issues at stake. However, the PD leader noted that the convention should be a permanent process, presenting a report every two years on other changes required.\nMEP candidate Martin Cauchi Inglott outlined the party’s view on the role of the President, saying the ideal candidate should be somebody of integrity and competence - and who really deserves to be in such role.\nPD spokesman Marcus Lauri said there was a need to establish a rule of law to address existing shortcomings. One such example was the need to empower the Constitutional Court to annul unconstitutional laws and to strip government’s authority to suspend the Constitutional Court.\nOther suggestions are to reform the nomination mechanism for members of the judiciary and to bar anyone with past political connections from becoming a magistrate or judge.", "comment_count": 12, "id": 4115}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two men were taken to court on Monday after an argument between seven people in Żabbar on Sunday landed a man and a woman in hospital.\nThe argument was sparked by an estranged couple’s dispute over their young son.\nThe police arraigned a 23-year old from Żabbar, the woman’s estranged partner and father of the boy, and a 20-year old from Cospicua, who had fathered another son by the woman.\nThe court heard that the incident happened when the 25-year old mother had allegedly called at her former partner's residence to collect the couple’s four-year old son, at around 4pm.\nIn spite of a court decree regulating access to the child, the man had apparently been shifting collection points at will, sometimes asking the mother to go to Marsaxlokk, St Paul’s Bay and so forth, said the woman’s lawyer, Albert Zerafa.\nWhen the woman turned up at her ex’s Żabbar residence on Sunday afternoon, a violent argument broke out, with the young mother suffering grievous injuries, including fractures, the court was told.\n“My client is not present today because she is undergoing surgery at present,” Dr Zerafa explained, pointing out that Sunday’s incident had not been the first of its kind.\nThe man pleaded not guilty to having grievously injured his former partner, caused her to fear violence and breaching the peace.\nHis defence team argued that the accused satisfied all the requisites for the granting of bail, further informing the court that the couple had reached an agreement for the child to live with the father.\nThat agreement had been finalised but had been withdrawn at the eleventh hour because of interference by other people, the lawyers argued.\nYet, in view of the prosecution’s arguments that the alleged victim was still to testify, and in view of gravity of the offences and the fact that there had been other incidents previously, the court, presided by Magistrate Yana Micallef Stafrace, turned down the request for bail.\nAs the accused was led out of the courtroom, he was replaced at the dock by the 20-year old who had fathered another child with the alleged victim.\nThe accused had apparently rushed to the scene of the fight upon getting a call from the woman and had lost his temper upon catching sight of his terrified child.\n“I went for him,” the irate father had later told the police.\nThe man, who had reportedly been accompanied by the woman’s father at the time, pleaded not guilty to having threatened police officers, refused to obey legitimate orders and rendered himself a recidivist.\nIn view of the fact that there were no civilian witnesses to testify against the accused, the court upheld his request for bail against a personal guarantee of €20,000 and an order to sign the bail book every day.\n“I’m going to give you a chance. Violence will not solve things between you, but will only make matters worse for you and your children. I suggest that you abide by bail conditions, otherwise you’ll end up paying €20,000,” warned the magistrate.\nThe court imposed a ban on the publication of all names so as to safeguard the children involved.\nInspector Joanna Piscopo prosecuted.\nLawyers Clint Tabone, Paul Borg and Stephanie Caruana assisted the Zabbar man.\nLawyer Joseph Brincat was legal aid counsel to the Cospicua man.\nLawyer Albert Zerafa appeared parte civile.", "comment_count": 0, "id": 4116}, {"keywords": "", "author": "", "article_body": "Updated 6.15pm\nTwo women were injured when an electric vehicle overturned while on a tour of Senglea on Monday afternoon. \nPolice said the pair, aged 28 and 23 who were visiting from the UK, were taken to Mater Dei Hospital for treatment. The younger woman was only slightly hurt but the injuries of the 28-year-old were described as serious.\nThe vehicle, an electric 'golf cart' used for tourist excursions around the Three Cities, appears to have overturned after striking a pavement.\nThe incident occurred on Triq il-Vitorja, just outside the Senglea city gate, at around 1pm.\nTwo other people who were in the vehicle at the time did not require hospitalisation. \n ", "comment_count": 0, "id": 4117}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Some 300 Turkish construction workers have been deployed to Tigné in Sliema, signalling the start of a new wave of third-country nationals imported to work on massive construction jobs on the island. \nFollowing reports by The Sunday Times of Malta last week – that Ankara-based Taca Construction was conducting talks with the government on the possibility of fast-tracking some 2,500 Turkish builders to take over several construction jobs – the first few hundreds have arrived on the island. They immediately started working on the building of a massive building block to rise on the site formally occupied by the Fortina Hotel.\nHoarding around the massive construction site in Sliema, publicising the Turkish company, has been erected and containers, serving as offices for the contractors, were placed underneath the main road, on the foreshore next to the pool of a summer lido.\nSources said that the workers, flown directly from Istanbul, will be working around the clock on site, and are being paid the minimum wage of less than €800 a month.\n“They will be staying here for years and may also be shifted to other projects which Taca will be building for Maltese developers,” the sources added.\nThe Times of Malta has not been able to confirm that the construction workers are residing in makeshift containers turned into mobile homes in an area next to Malta International Airport.\nQuestions sent to Taca Construction were not answered by the time of writing.\nApart from the Fortina Hotel project, which is already marred in controversy due to the lack of agreement with the Lands Authority on a tract of public land incorporated in the project, this newspaper is informed that Taca has already agreed to build the City Centre project in St George’s Bay on the site formerly occupied by the Institute of Tourism Studies.\nMaltese contractors can never compete with low wages. We have been outpriced\nThe Turkish company is offering rates which are much lower than current market prices, undercutting Maltese contractors tendering for such works.\n“Although we are not yet equipped to build certain projects currently on the drawing board, such as high-rise buildings, Maltese contractors can never compete with low wages. We have been outpriced,” industry sources complained.\nApart from the City Centre project, the Seabank db Group was also keen to grant the building of a 500-bed extension of St Vincent de Paul residence to the Turkish firm despite competition from Maltese contractors.\nTogether with James Caterers, the Seabank db Group was awarded a controversial €274 million direct order by the government to provide meals at the elderly people’s residence and to manage the 500-bed extension it will be building for a 10-year period.\nMeanwhile, despite that the building of the Fortina office block is already in full swing, no agreement has yet been reached with the Lands Authority on the use of public land included in the project.\nAccording to public deeds signed years ago, the public land was sold to the Fortina developers on condition that it is only used for tourism purposes, mainly hotels.\nHowever, despite that a change in use necessitates the approval of a new parliamentary resolution, the Planning Authority already gave the Fortina owners, controlled by the Zammit Tabona family, permission to build a massive office block for speculation.\nConstruction has now started but the Lands Authority is still negotiating with the Zammit Tabonas.\nA few weeks ago, the Times of Malta revealed that Lands Authority CEO James Piscopo, was in business with members of the Zammit Tabona family in companies unrelated to the Fortina project.\nMr Piscopo, who did not tell the Lands Authority board about his conflict of interest before the revelations by this newspaper, said he was not involved in Fortina-related talks and had started the process of divesting himself from any private businesses.\nivan.camilleri@timesofmalta.com", "comment_count": 266, "id": 4118}]