[{"keywords": "", "author": "Edwina Brincat", "article_body": "A drunk man who damaged a motorcycle and a house facade was arrested when he was found asleep in somebody else's car, a court heard.\nRomanian-born Vasile Frumuzache, 29, having no fixed residence, pleaded guilty to having caused the damage while drunk last Saturday.\nHe damaged a motorcycle and the gate of a house in College Street, Rabat, before the police were alerted and tracked him down close by. \nDefence lawyer Yanika Bugeja, as legal aid counsel to the accused, said Mr Frumuzache was ready to pay for the damage, but no quantification had been made in the records of the case. \nShe also pointed out that Mr Frumuzache had been in Malta for two months, during which he had not been involved in any trouble.\nMagistrate Rachel Montebello condemned him to a 14-month jail term suspended for two years.\n ", "comment_count": 0, "id": 2119}, {"keywords": "", "author": "", "article_body": "The Floriana bastions overlooking Marsamxett are being restored thanks to a €1.6 million allocation by the Ministry of Justice and Culture. \nThe fortifications form part of what were known as the Floriana Lines, which were built to protect Valletta.\nThey were designed by Italian engineer Pietro Paolo Floriani during the Magistracy of Grand Master Antoine de Paule.\nThey were further improved during the 17th century by Italian military engineer Antonio Maurizio Valperga. Valperga also projected the La Vittoria Bastion to provide some form of enfilading defence. \nOver time the bastions have suffered as a result of weathering, vegetation, air pollution and bombing in the second world war. \nA section of the bastions was also restored in 2015. ", "comment_count": 2, "id": 2120}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A judge is to decide on May 14 whether to order the Attorney General to provide the Leader of the Opposition with a full copy of the Egrant inquiry report.\nThe inquiry was concluded at the end of July by Magistrate Aaron Bugeja but no information has been given other than a summary issued in a press statement by the Attorney General and a press conference given by the prime minister. The AG had said that the inquiry found that there was no evidence that the prime minister or his wife owned the secret Panama company known as Egrant.\nOpposition leader Adrian Delia has since been calling for the full report to be published. \nIn final submissions on Monday before the constitutional court, Dr Vincent Galea, representing Dr Delia, objected to a claim made by the Attorney General in written submissions that while NGOs and  investigative journalists may have a right for such information for their investigations, EU jurisprudence never made a mention of such a right for the  leader of the opposition.\nEU jurisprudence only mentioned journalists and NGOs because there never was a case anywhere where this type of information was not handed to the leader of the opposition, Dr Galea said.\nAnd didn't the Opposition leader also have a right to inform the public?”  \nHe argued that the AG's refusal to hand a copy of the report to the leader of the opposition meant that the prime minister had an advantage over other persons in the political arena. Indeed, copies had been handed to lawyer Pawlu Lia, the Justice Minister and Kurt Farriugia, who was the prime minister's spokesman, although these were not mentioned in the AG's written submissions.\nWas there anything to hide? \nFurthermore,  throughout the hearing of the case there had been strong opposition to the summoning of certain witnesses.\nREAD: Failure to publish Egrant report means people cannot be held to account - lawyer\nWhen the Police Commissioner was summoned to testify, certain questions had not been allowed. The witness had made reference to ‘ongoing investigations.’\nWhen were these to be concluded? Was the country to remain in this state of uncertainty?.\nDr Galea stressed that it was for the Attorney General to prove that his refusal to hand over a copy of the report had been justified.\nThe AG could at least have been granted Dr Delia permission to see the report at the AG’s Office, a right sometimes afforded to journalists. But not even a redacted copy had been offered. In this case there was an outright refusal, Dr Galea stressed. \nBut since the document had effectively been published, the Opposition Leader had a constitutional a right to a copy so as to inform the public.“Was the AG's decision to refuse a copy proportional to the breach of the Opposition leader's right for such information?\nDr Galea urged Mr Justice Robert Mangion, to obtain copy of the report and take it into account before delivering judgment, thus being in a better position to assess whether the AG’s refusal was proportional to the alleged breach of the opposition leader's rights.\nMoreover, if the conclusions exonerated the PM’s wife, “why not publish the relative facts contained in the first part of the report? It would have added weight to the conclusions”, Dr Galea argued.\nIn his reaction, the Attorney General said this had been an administrative decision that was subject to judicial review and Dr Delia therefore ought have resorted to the ordinary courts rather than seek a constitutional remedy.\nHe pointed out that it had stated, in a press conference, that a copy of the report had been given to the prime minister.\nAlthough the Egrant inquiry had been requested by the prime minister in his personal capacity, it had acquired a constitutional status since the PM’s office had been involved in its outcome.  \n“Hence one needs to distinguish between the PM and others who just want a copy of the report for sake of political debate,” Dr Grech went on.\nAs to whether a redaction of the report should have been made available, he argued that this would have immediately prompted speculation as to the parts blocked out. Hence redaction was not an option.\n“As for the argument that other persons had access to the report for the purpose of publication, this found no basis in the court proceedings and was not supported by evidence. Here we are in the realm of speculation.” Dr Grech argued.\nThe case was adjourned for judgment on May 14.", "comment_count": 0, "id": 2121}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "One of the men accused of murdering journalist Daphne Caruana Galizia has doubled down on claims that he is not receiving adequate medical care while behind bars.\nGeorge Degiorgio filed a judicial letter claiming that failure to be provided with adequate medical care amounted to inhuman and degrading treatment. He had already filed a similar letter against the prison director three months ago. George Degiorgio.\nIn his latest letter, Mr Degiorgio claimed that “no concrete steps” had been taken since he had filed his first one on December 4, in which he had noted that he was not receiving treatment for “persistent and unbearable pain in his shoulder”.\nAlthough he had informed the prison authorities of his trusted medical consultant, prison authorities had simply given him pain killers, which “masked the pain for a while but did not in any way constitute the required care”.\nThe pain continued to develop and his condition was worsening, Mr Degiorgio’s letter read.\nHis lawyer William Cuschieri noted that this was happening while his client was in custody and totally dependent on prison authorities. This amounted to inhuman and degrading treatment which breached his client’s fundamental rights, he said.\nMr Degiorgio, alongside his brother Alfred and Vincent Muscat, is currently facing criminal proceedings over the trio’s alleged involvement in a car bomb assassination of Ms Caruana Galizia on October 16, 2017.", "comment_count": 0, "id": 2122}, {"keywords": "", "author": "Ivan Martin", "article_body": "Haphazard parking, unlocked exits and the need for a “culture of safety”, have been highlighted as the main shortcomings in a security audit of Malta’s schools. \nThe audit, being conducted by security review firm Shield Security Consultants, at five State schools, was requested by Education Minister Evarist Bartolo last month.\nIt comes after two persons were arraigned in connection with an assault at Pembroke secondary school in February.\nA 15-year-old boy was hospitalised after he was attacked by another student in the incident. The latter’s father later allegedly showed up at the school accompanied by two other men.\nTwo staff members, understood to be an assistant head and a teacher, were hurt as they tried to break up the fight.\nThe brawl was followed by another incident a few days later, where a student and a school official got into a fight at the St Ignatius College secondary school in Qormi.\nTeachers’ representatives have subsequently complained that such incidents were becoming increasingly common in many of Malta’s schools and action needed to be taken to ensure schools were safe.\nMajor John Schembri, who is conducting the review of the schools – including those of Pembroke and Qormi – told the Times of Malta that one of the major shortcomings was the way cars piled in front of schools at drop off and pick up times. In some schools, this was coupled with no clear entry and exit pathways, as well as a mess of multiple entrances to the school grounds.\n“Dropping off or picking up children from school needs to be structured. It cannot just be something you do at the last minute in a disorganised way, but more like when you go to the airport to catch a flight,” he said. \nIn some cases, issues of doors being left unlocked had been also been uncovered, but Mr Schembri insisted that this was not a widespread issue.\nOnce completed in the next few weeks, the audit will help the education authorities devise a national school security policy.\nThis, Mr Schembri said, would have to work throughout Malta’s diverse schooling set-up.\nMany of the island’s schools, he said, were different and posed unique challenges. \n“Take the Pembroke school for instance, that was originally built as a hospital and so has a particular lay out. We may have to have individual plans for specific schools coupled with guidelines for the whole schooling system,” he said.\nAn Education Ministry spokesman said the government would be looking into the possibility of new security systems, including camera networks at schools after the audit was completed.\nMr Schembri said that in the absence of previous reviews, the security audit had first started with the setting of a minimum standard to establish a baseline against which the schools were assessed. \n'Room for improvement'\nSo how did schools do? Mr Schembri said there was “room for improvement”, but he had not come across any major issues that could not be overcome with “investment and the right attitude”.\n“Most of the security issues we’ve encountered can be dealt with through the introduction of ‘soft measures’, like having a policy that promotes safer behaviour. This, coupled with a few hard infrastructural amendments, will address the situation,” he said.\nThe solutions, he added, would have to be sustainable and cost effective. At this point the ministry spokesman was quick to point out that the budget allocation for school security had been beefed up to around €280,000 this year.\n Schools in Malta have protocol for security, for instance for when parents visit the premises for a meeting with teaching staff. \nNeed for a behavioural shift\nIn some cases, Mr Schembri said, amendments to these protocols were now being drafted.\n“We don’t expect schools to be a fortress environment. But there has to be a behavioural shift towards respect and safety,” he said.\nThe ministry spokesman said a lot of unruly behaviour by students could be pinned down to youths not engaging with the educational experience. \nMeanwhile, the Malta Union of Teachers have presented their own proposals for improved security in schools. The union said its officials had held a meeting with the Education Minister and presented nine proposals.\nThese included a review of the physical access to schools to ensure there was only controlled access.\nOther measures it proposed included the allocation of a fund for security in schools and the deployment of security personnel, a revision of the allocation of Prefects of Discipline with an increase in personnel and a ban on mobile phones in schools and its respective enforcement.\nMUT welcomes initial report\nThe Malta Union of Teachers said it welcomed the initial findings of the report and looked forward to more details on the way forward together with the immediate implementation of measures, particularly those identified as most crucial, for the improvement of security in schools\nIt said it had already held two meetings with the Audit team and shall be following the outcome.\nThe Nationalist Party in a statement said the issue of security at schools needed to be taken seriously by the government immediately.\nIt said a lack of commitment by the government was demotivating teachers.  ", "comment_count": 6, "id": 2123}, {"keywords": "", "author": "Jacob Borg", "article_body": "A court last week overturned a “legally flawed” decision to grant Electrogas power station businessman Mark Gasan permission to build a 200sqm one-storey villa in an outside development zone falling within Wied il-Ħesri, Żebbuġ.\nThe businessman’s attempts to develop what was once an illegal chicken farm have been twice thwarted by the Planning Authority, only for the decisions to be overturned by the Environment and Planning Review Tribunal (EPRT). \nMr Justice Mark Chetcuti found that the tribunal’s latest decision in December continued to give weight to a 2007 outline permit to build a 120sqm villa, while selectively applying a provision in the 2014 rural policy and design guidance allowing the businessman to extend this development to 200sqm.\nIn the court ruling, the judge upheld arguments by a third-party objector stating that the tribunal could not simply cherry-pick parts of the rural policy that favoured Mr Gasan.\nThe application had to be decided exclusively on all provisions contained in the policy, the court said.\nTribunal could not simply cherry pick rural policy\nMr Gasan’s permit had been rejected by the Planning Authority for not being in conformity with this policy.\nThe court ordered a revocation of the tribunal’s decision, and ordered the same tribunal to decide on Mr Gasan’s application solely on the basis of the 2014 policy.\nA previous refusal by the Planning Authority was overturned by the EPRT in October 2013 on the grounds that demolition of the illegal farm should be considered a planning gain as the illegal farm was causing an “adverse visual impact”.\nPrior to the December decision by the tribunal, Mr Gasan filed an application for full development of the site in 2015 but the Planning Authority rejected it.\nIt concluded that the application for two villas, including swimming pools and semi-basement levels for a games room, gyms, offices, stores and parking areas, went far beyond the one-floor unit envisioned in the outline permit and would breach numerous policies.\nAccording to the case officer’s report on the application, the Environment Protection Directorate expressed concerns that the villas would “obliterate” existing rural features and intensify urban use within the countryside.\nThe directorate had also expressed concerns about possible further future pressure for any other ancillary interventions and further similar developments in the countryside that would lead to a cumulative change in the appearance of the locality.\nThe case officer’s report said the development as proposed would lead to adverse visual impacts on the surroundings and ran counter to the strategy for the protection of rural areas.", "comment_count": 0, "id": 2124}, {"keywords": "", "author": "", "article_body": "A 62-year-old motorcyclist was seriously injured in a collision with a car in Balzan on Monday.\nPolice said that the accident took place on Vjal de Paule at 7.30am.\nThe car was being driven by a 40-year-old woman from Balzan.\nThe injured man also hails from Balzan.", "comment_count": 0, "id": 2125}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Mercury House developers are looking to add a 22-storey tower adjacent to the already approved 32-storey high-rise currently being built in Paceville.\nA new development application foresees a block incorporating 88 apartments, a hotel, swimming pool, retail and office space, as well as an underground spa and car park.\nThe developer, Joseph Portelli of J Portelli Projects, is also seeking to raise the height of the tower approved in January 2018 – which already hosts 275 apartments – by around eight metres to incorporate a residential floor, an amenity floor and a pool and bar at roof level.\nMercury House, a Grade 2 scheduled monument, and the surrounding site have been earmarked for development since a development brief approved in 2005, which originally limited the building height to 15 storeys.\nAn application approved by the Planning Authority in 2012 extended this to two adjacent office towers of 19 and 18 floors respectively.\nAlthough the second tower was dropped in plans for a single 32-storey tower approved by the PA last year, it now appears to have been placed back on the table.\n The latest proposal is one of several for high-rise development in Paceville currently being considered by planners.\nAmong them are a 15-storey hotel proposed by the same developer close to the Intercontinental Hotel, and a 25-storey mixed-use block proposed by PX Lettings on an adjacent site.\nThese applications are all being considered in the absence of the long-promised Paceville master plan, a first draft of which was published in September 2016 but quickly scrapped after a public outcry.\nThe document fuelled controversy after it emerged that UK planning firm Mott MacDonald, which was commissioned to draft it, had been the leading consultant on the Mercury House project.", "comment_count": 45, "id": 2126}, {"keywords": "", "author": "Ramona Depares", "article_body": "Dark clouds are gathering over the head of one “especially loveable” horse that has spent most of its life being cosseted as a beloved pet, as his owner finds herself unable to continue taking care of him due to failing health.\nAnimal lover Gina Curmi, who has spent most of her life rescuing horses and giving them a second chance at a happy life, has launched an appeal for a kind-hearted person to offer a home to the 12-year-old stallion before she is forced to put the noble animal to sleep.\n“Xitan is a beautiful, and absolutely loveable, horse and he’d make a wonderful pet,” Ms Curmi told the Times of Malta, adding that his choice of name was far from being a bad reflection on his character, and that it was quite the opposite.\n“I call him Xitan – Maltese for ‘demon’ – because he is black, and he has a cheeky character, mischievous to the right degree and it makes him especially loveable. I figured the Maltese pet name fits him to a tee, used affectionately, of course,” she said with a sad smile.\nBut health problems and increased financial constraints arising from medical necessities mean that Ms Curmi can no longer offer a home to the horse.\nThe condition means that his stifle is somewhat deformed, and thus his legs are misshapen\nSadly, Xitan suffers from health problems of his own, a genetic stifle joint problem that means he cannot be used for riding. The condition is likely the result of inbreeding, a common problem in Malta, with Xitan’s mother having been mated with her own biological father.\n“The condition means that his stifle is somewhat deformed, and thus his legs are misshapen. His back is fine, but horses with stifle problems cannot be used for riding as they could easily fall and injure both themselves and the rider,” Ms Curmi explained.\nFalling in love with Xitan is an easy enough matter, as the horse appears to be extremely friendly and affectionate, even with strangers.\nWhat this means, in essence, is that anyone willing to rehome Xitan needs to be in a position to keep him purely as pet. Ideally, the young woman adds, the horse is kept somewhere where he can get plenty of exercise as otherwise the joints tend to stiffen up very fast.\n“If this is not possible, a stable will also be fine as long as the new owner is willing to give Xitan plenty of exercise,” she adds.\nWith Malta’s handful of horse rescue shelters full to the brim and Xitan’s particular requirements, finding an alternative home for the beautiful beast is turning out to be more difficult than anticipated, but Ms Curmi has not yet lost hope of finding a suitable home before she has to do the unthinkable.\n“It breaks my heart to think of having to put him down. I have been going crazy contacting everyone I know and explaining the situation, but so far no-one has worked out. But I will not be able to keep him for very long and I will have to take the final decision soon, but I really hope that maybe someone will fall in love with Xitan and save his life.”\nFalling in love with Xitan is an easy enough matter, as the horse appears to be extremely friendly and affectionate, even with strangers. And the act of kindness will undoubtedly be repaid a thousandfold in terms of love and horse snuggles.\nMeantime, Ms Curmi is appealing to anyone who may be in a position to save the life of her “cheeky boy” to get in touch by calling on 7999 7543 or by sending an e-mail to ginacurmi@gmail.com.", "comment_count": 5, "id": 2127}, {"keywords": "", "author": "Keith Micallef", "article_body": "Entry of non-EU nationals into Malta’s employment market should be limited to highly-qualified workers, as too much emphasis on cheap labour will negatively impact wage levels, UĦM Voice of the Workers has warned.\n“We are not advocating an overnight expulsion of low-income foreign workers but the implementation of the principle of ‘equal pay for jobs of equal value’,” UĦM CEO Josef Vella is insisting.\n“No Maltese workers will accept to get paid at €4.33 per hour as that would be way below the minimum required for a decent living, but for a third country national this might sound like an attractive offer,” he added.\nMr Vella sounded this warning when the Times of Malta sought his reaction to a recent report by EU agency Eurofound from which it transpired that Malta had registered the lowest minimum wage increase among all member states. \nWhile in 2019 the rise in Malta was of just 1.9 per cent, in countries like Spain the rise was more than 10 times higher, at 22 per cent.  However, Malta’s minimum wage was still classified as being at medium level when compared to other EU countries.\nIn his reaction, the UĦM head warned that Malta’s economy could not sustain an influx of low-income foreign workers for the long term.\n“While they might be contributing for pensions, you have to look at the wider picture such as the impact on the environment, transport, healthcare, housing and salary levels,” Mr Vella remarked.\nHe also pointed out that even though there were officially 4,000 workers on minimum wage, in reality the number was much higher due the influx of third country nationals.\nAs things stand Malta has the highest proportion of foreign workers in its labour market and this influx has taken place overnight rather than gradually, he said. \nSuch trend will clearly impact the wage setting, Mr Vella added.\nIn view of this the UĦM is calling for the implementation of the second part of the 2017 minimum wage agreement, whereby the lowest pay rates across different sectors would be established in line with existing collective agreements.\nThe union is insisting that such model is already in place through the wage regulation orders.\n“We could either opt for such model or else seek to find a compromise on one flat minimum wage rate,” Mr Vella said.\nThe UĦM is also calling for measures to encourage workers, even foreigners, to enrol in a trade union, saying this would serve as a deterrent against abuse.\nSuch move would also help for compensation levels across all levels to keep up with profits, Mr Vella added.", "comment_count": 34, "id": 2128}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "Architect Richard England sees a black hole ahead in the path of the construction machine. He spoke to Fiona Galea Debono.\nRichard England’s most recent publication, Chambers of Memory, is the closest he could get to penning an autobiography, but in speaking about his past, he also indirectly sheds light on the present – and, quite frankly, it is “not as good”.\nIn fact, it is probably worse than that: “We have lost the plot,” he says categorically. “We are on a pathway to a black hole and it’s not going to change, because construction is a money-making machine… unless the bubble bursts, which I think it will. Meanwhile, people have money in their pockets and are not interested in what is happening at the top.”\nAs for the future: “Sadly, I don’t think we are going to leave any heritage and legacy that is in any way equivalent to that left by our forefathers.”\nWithout much nostalgia and emotion, Prof. England harks back to the youth in the 1960s, saying it was the first time people forgot World War II and the future looked so positive. “I remember Malta as a virgin… which implies that it is now a whore.”\nWhen the idea to write an autobiography was floated by family members, who joked about him doing it before dementia set in, he rejected it, saying it would be nothing but ‘autofiction’ – a means to “flex my muscles and say that if it were not for me, the world would have been a worse place”.\nBut he is not out to boost his ego. “Architects need more eco than ego”, he says later on.\n\nThe end result contains the 81-year-old’s memories about what influenced him, his mentors, the places he visited, the books he read, those who passed away, which are becoming more frequent, as well as humorous anecdotes to “pepper it up”.\nGiving credit to his great masters, who taught him the intellectual and philosophical side to architecture, he says a building can either make you happy or ruin your life.\nQuoting blind Argentinian author Jorge Luis Borges, Prof. England says that when asked why he travelled, the writer replied: “It is more important to feel a place than to see it.”\nIt is also more important how a building influences us than how it looks, Prof. England continues, though both concepts seem to be alien today. And his belief that architecture should enhance the spirit and uplift the soul is even more outlandish.\nI remember Malta as a virgin… which implies that it is now a whore\nArchitecture is about commodity, firmness and delight, he explains, quoting Roman architect Vitruvius. But if the focus is on the first two qualities only, they merely add up to construction – what Malta is “littered” with.\nRecently asked to talk about the state of architecture on the island, he corrected the question, saying it was the state of the “building industry”.\nAgainst the concentration of high-rise buildings in one area, he highlighted the problems of infrastructure and traffic that inevitably arose around them. Referring to Sliema, he said the towers in the area would mean thousands more occupants, and therefore, thousands more cars on the streets, which could not be widened – even though that was not the solution to the traffic problem anyway.\n“The problem is not the parking spaces but getting these cars to move into and out of the underground car parks altogether at around the same time,” he pointed out, adding that it would also be impossible to cope with a fire.\nThen there was the issue of building a tower in the same way that you do a five-storey building and adding floors to it. “It doesn’t work that way!”\nWhile he was not against development and the need to go high, Prof. England has been harping on the fact that it would have been better to have a mini Manhattan and plan the roads and infrastructure around it.\nBut the problem with the Planning Authority was that it did not want a master plan as it would not be convenient to have to stick to it. Developers got permits and set the so-called standards, Prof. England says of the scenario, which is merely a money-making machine – a point he had already laboured during an interview a decade ago when he turned 70.\nThe only difference is that, back then, he had said: “Not all is lost. Malta is still in time to save things.\n“Take SmartCity,” he had said 10 years ago. “Let’s hope the architect is smart. It is a chance in a million to produce something great.” And the rest is history…\n“We know the price of everything and the value of nothing,” Prof. England points out. “Some developments are so out of scale that they just do not make sense,” he continues, referring to the St George’s Bay and Paceville area. The Planning Authority does not want a master plan as it would not be convenient to have to stick to it\nBut it was not only the fault of architects; they needed to have good clients. In fact, the best architecture was coming from the younger generations, who were working mainly with individuals building their own homes.\n“My own best clients over the last few years have been the Church and institutions that have to do with the spiritual aspect.”\nProf. England’s study is covered in his intricate pen drawings. And he is already working on another book about Lazarus, “one of the most frustrating persons you could ever come across…\n“The bastard spent four days in the afterlife, and when he came back, he told us nothing!”\nIt is a “fascinating” story; Jesus’s most important miracle, which Prof. England recounts in his upcoming publication, together with what he envisages had happened during that time in the tomb.\nThe architect may not see a sign of life at the end of that black hole. Nevertheless, he is not depressed about the situation, being forever an optimist.\n“But I am disappointed to see my native land, which I love, and which inspired me with its unique heritage, gradually destroying the very spirit of the place.\n“I can do my reading and my writing and listen to my music, which in a way are an escape. I can block my ears and speak my mind. I don’t wish to sound arrogant, but I have made my contribution.”\nProf. Richard England recently spoke at the Architecture Alive talks, organised by studjurban and supported by Places: Design & Living magazine, an Allied Newspapers publication. The next in the series of talks by leading international architects will be addressed by Claudio Silvestrin on May 18.", "comment_count": 173, "id": 2129}, {"keywords": "", "author": "", "article_body": "A judge has ordered a surgeon to pay a patient over €123,000 in compensation after a surgery to fix a back problem left him paralysed from the neck down.\nMr Justice Robert Mangion found that neurosurgeon Antoine Zrinzo had been responsible for the 75 per cent disability suffered by Lawrence Mercieca, who was 56 at the time of the operation in July 2001 at St Luke’s Hospital.\nThe court heard how Mr Mercieca had gone to the consultant neurological surgeon who certified him as suffering a compression in the cervical spinal cord.\nHe referred him for an MRI which confirmed the diagnosis and he went under the knife.\nPrior to the operation, Mr Mercieca claimed that Mr Zrinzo had told him that the four-hour operation carried no risks but the surgeon denied this in court, insisting that he had explained the routine risks of such surgery.\nThe court, however, disbelieved the patient, saying that Mr Mercieca knew of the risks he was facing, as evidenced by the apprehension he had before the day. \nOn the other hand, the court gave weight to a report drawn up by a foreign expert, John Wadley, who concluded that the procedure carried out by Mr Zrinzo was “historical”.\nHe also established that the choice of the surgery was “negligent”, given the patient’s ailments, and that this was more prone to complications afterwards.\nThe court also heard how Mr Mercieca had high blood pressure prior to going under the knife and how this was controlled with medication. The situation, however, took a turn for the worse during the procedure, when Mr Mercieca’s blood pressure continued to fall, forcing doctors to give him other medication to reverse the effect of the previous ones.\nMr Zrinzo was not found responsible for the complications that may have been caused by the blood pressure but was criticised over his failure to visit his patient after the operation when both of his legs were paralysed. \nMr Justice Mangion ruled that Mr Zrinzo deviated from a general and approved practice, resulting in a 75 per cent disability for his patient who was paralysed from the neck down.\nHe therefore ordered Mr Zrinzo and the Director General of the Health Department, as his employer, to jointly pay Mr Mercieca €123,383 in damages, including €5,000 in expenses he incurred to improve his physical condition.", "comment_count": 0, "id": 2130}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta reports on shortcomings in schools' security systems, as well as on a €123,000 pay-out for a patient left paralysed after back surgery.\nL-Orizzont reports on the prime minister's comments on temporary ways to establish gender equality, as well as a tribute to Ronnie Pellegrini who died over the weekend.\nIn-Nazzjon reportes on the speech made on Sunday by Opposition leader Adrian Delia saying that unity would help the party.\nThe Malta Independent carries a story with former judge Giovanni Bonello saying that it was not illegal for a women to seek an abortion abroad. It also quotes Tourism Minister Konrad Mizzi saying he was doing on he could to persuade Joseph Muscat to stay on as prime minister.", "comment_count": 0, "id": 2131}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "The European Court of Human Rights repeatedly raises the damages awarded by the Constitutional Court to owners of requisitioned or rented properties. Victor Paul Borg unwraps the issue.\nAfter a legal battle in Valletta and in Strasbourg stretching longer than 15 years, Edward Zammit Maempel balks in the face of partial victory. “I don’t know what to do,” he says. “We have lost many years in a ruinous battle.”\nMr Zammit Maempel* is talking about the family house in Qormi that he has never been able to call his own. “If I had had a chance to renovate the property and rent it, it would have made a huge difference in my life. Now even the compensation is not enough to fix the damage and degradation sustained by the place over the years [lost in court battles]. This whole saga shows the incompetence of the court.”\nIt’s become a familiar lament in property cases abusively requisitioned by the government or rented out privately for a pittance.\nBut now the disputes have been electrified by the emergence of a new scenario. Malta has lost case after case taken by complainants to the European Court of Human Rights (ECHR), whose rulings have overruled Malta’s Constitutional Court at considerable financial and reputational cost to Malta. \nExtensive research of ECHR archives by The Sunday Times of Malta has found a cluster of eight cases decided since the beginning of 2018, all lost by the Maltese government at a cumulative cost of more than €1 million (see below) in damages awarded to plaintiffs, as well as unquantifiable costs in human resources and overheads.\nThe losses have become so consistently beleaguering that two weeks ago the government brokered out-of-court settlements with the applicants in four cases that were pending in front of the ECHR.\nThe predictability of these cases has turned them into a source of bounty for a handful of lawyers. One in particular – whose name is known to this newspaper – has become the go-to lawyer for filing these cases in the ECtHR. The probability of winning the case is so high that this newspaper is informed of “a couple” of lawyers who solicit clients with the offer of only charging a fee for their work if they win the case.\n“It is futile for the Maltese Constitutional Court to continue to rule differently if the ECHR found a human rights breach in a particular type of case,” says Joe Zammit Maempel, a veteran lawyer who has recently handled one such case.\nI think there is an element of pride in judges not wanting to submit to rulings of the European Court of Human Rights\n“Eighteen judgments were delivered by the Constitutional Court on a day before Christmas including my case. Damages awarded by a lower court were reduced in each of those cases.”\nIn Dr Zammit Maempel’s client's case the government had requisitioned 2,500 square metres of land in Żebbuġ without having paid any compensation 50 years after the expropriation. In 2017 the convolutedly-named Civil Court First Hall (Constitutional Jurisdiction) – which will be shortened here to Civil Court – awarded his clients €50,000 in damages. The government appealed, and the Constitutional Court slashed the damages to €20,000. Now the complainants are taking the case to the ECtHR in Strasbourg.\n “The Constitutional Court has to accept that there is a superior court where human rights are concerned, which is the ECHR, and that it has to bow to that court’s directions and review its judgments accordingly,” said Dr Zammit Maempel.\nSigns that Malta’s Constitutional Court has adapted in response to the ECtHR’s snubs of its decisions are yet to be seen. The cases have become a pattern.\nIn the case of the Zammit Maempel family mentioned at the beginning of this article, for example, their house had been rented in 1986 for 21 years. Then, in 1992, the housing department requisitioned it, flouting the principle of “protection of property.”\nThe Zammit Maempels requested damages amounting to €98,000, the Civil Court awarded them €50,000, which was truncated to €12,000 by the Constitutional Court after the government appealed.\nThen the ECHR topped that by €33,000 last January, bringing the total figure to €45,000 – which is €5,000 shy of the initial amount set by the Civil Court. \nAsked why the government was now suddenly settling claims out of court, Dr Zammit Maempel used an analogy. “If you cause a car accident and you cause damages you either pay the other party, or you are taken to court. If you do not have a case in court, then it would be better to settle out of court to avoid court expenses.”\nQuestions sent to Justice Minister Owen Bonnici – including the implications of the government settling out of court with four plaintiffs two weeks ago, and what message that gives to Malta’s Constitutional Court – remained unanswered by the deadline set in the email. \nSenior lawyers who spoke to the newspaper were scathing of Malta’s Constitutional Court. One lawyer who spoke on condition of anonymity described its decisions as being “nonsensical.” He talked of a “post-colonial hangover in its stubbornness to accept the superior status of the ECHR. It’s as if there is this attitude that no one is above us anymore.”\nAnother lawyer also speaking anonymously concurred: “I think there is an element of pride in judges not wanting to submit to rulings of the ECHR.”\n“Unfortunately,” he added, “instead of being the paladin of the individual’s human rights, the Constitutional Court often takes other considerations and attempts to defend the government. One of those considerations may be that awarding significant damages in these property cases could create a large financial burden on the State.”\n“But that is false reasoning in human rights, and we have to observe the parameters established by the ECHR.”\nThe squeeze of property rights\nMalta is party to the Council of Europe’s European Convention on Human Rights which is enforced by Europe’s highest court, the European Court of Human Rights (ECHR).\nInitial recourse for redress to human rights’ violations rests with the domestic courts: the Civil Court (in its constitutional jurisdiction) in the first instance, the Constitutional Court in the second instance. Anyone aggrieved by decisions of these courts can then resort to the ECHR. \nAll cases listed below were filed for breaches of one or both ECHR principles: “protection of property” and “right to an effective remedy”.  All but one of the judgments were delivered since the beginning of 2018.\nCase of Zammit Maempels: €50,000 damages awarded by Civil Court in 2013, lowered to €12,000 by Constitutional Court after government appealed in 2014, raised by an additional €33,000 on January 15, 2019 by ECHR.\nCase of Grech and others: In 2011 the Civil Court fixed compensation for pecuniary damages at €7,535, the Constitutional Court awarded an extra €5,000 in non-pecuniary damages in 2014, and ECHR upped the amount again by an additional €13,400 on January 15, 2019. \nCase of Cachia and others: After government requisitioned property, the Civil Court ordered restitution of property and payment of damages of €30,000. Constitutional Court overturned decision of lower court on government’s appeal. ECHR held on January 22, 2019 that there was breach of ‘protection of property’ but did not award damages on a technicality, without prejudicing any claims made in Maltese courts. \nCase of Buttigieg and others: In 2014 the Civil Court dismissed claim with costs to applicants, a decision that was reconfirmed by the Constitutional Court in 2015. In 2018 the ECHR awarded them €35,500 in damages. \nCase of Bradshaw and others: Pertaining to King’s Own Band Club in Valletta, in 2013 the Civil Court awarded damages of €300,000, a decision overturned by the Constitutional Court in 2015. In 2018 the ECHR set damages at €610,700. \nCase of B Tagliaferro and Sons Ltd: In 2012 the Civil Court assigned damages of €20,000, and in 2013 the Constitutional Court raised non-pecuniary damages by €30,000. In 2018 the ECHR added yet an additional €214,500 in damages. \nCase of Galea and others: In 2012 the Civil Court awarded €40,000 in non-pecuniary damages, the Constitutional Court truncated the amount to €13,000 in 2013, and five years later the ECHR topped it by an additional €25,000. \nCase of Cassar: In 2011 the Civil Court ordered tenants to vacate a property, a decision overruled by the Constitutional Court. In 2018 the ECHR awarded owners €183,000 in damages.\nCase of Apap Bologna: In 2011 the Civil Court set damages at €21,000, which were lowered to €16,000 by Constitutional Court the following year. In 2016 the ECHR awarded an additional €40,000 to claimants.  \nLawyers probe Constitutional Court in test case over ‘exhaustion of ordinary remedies’\nIn an 18-page application filed last Friday, three lawyers led by Franco Debono are probing the Constitutional Court following a partial vindication in a judgment delivered by the Civil Court First Hall (Constitutional Jurisdiction) on  February 28, 2019.\nIt arises from the case of Stephen Pirotta who was sentenced to 18 years imprisonment over a road-rage incident that led to stabbings in 2005.\nIn the initial application three years ago, Dr Debono and his colleagues – Marion Camilleri and Amadeus Cachia – posited that denial of lawyer at the point of arrest and interrogation, and non-disclosure of the police file to the arrestee, amounted to violation of the “right to a fair trial”.\nThe court in its constitutional jurisdiction, presided by Judge Joseph R Micallef, adjourned the case 13 times over an 18-month period, prompting the lawyers to file a judicial protest last January 25, claiming that the delay was an additional breach of Mr Pirotta’s rights. Judgment was then delivered a month later, on February 28.\nAmong others, the court’s judgment entered into the merits of whether the statement given to police by Mr Pirotta was consequential to the establishment of guilt, and whether removal of statement would have determined the outcome of the prosecution. Another point made was that Mr Pirotta or his lawyers at the time of trial and criminal appeal – who were not the same lawyers filing for human rights breaches at this point in time – did not object to the police statement being used as evidence in court. An argument is made that any party who does not make use of ‘ordinary remedies’ (in this case, not objecting to inclusion of police statement) during the course of the trial or process itself could then, after the sentence is handed down, resort to “constitutional” remedies in a bid to revoke the sentence. \nThis reasoning, which is often invoked in Maltese human-rights rulings, has been denounced by justice grandee Judge Emeritus Giovanni Bonello in his recent book Misunderstanding the Constitution. Judge Emeritus Bonello, who sat on the ECtHR for 12 years, wrote that “the constitutional courts have subverted the Constitution, ludicrously and fatally, by refusing any redress to victims of human rights abuse, ‘because they have not exhausted ordinary remedies’.”\nIn the application to the Constitutional Court, the lawyers latch onto the fact that the court did find a breach in human rights and awarded Mr Pirotta €3,000 in damages. They then argue that the police statement was indeed a crucial piece of evidence. They also emphasise the Maltese state’s tardiness in introducing the right to lawyer at point of arrest, and that the ECHR has in the past snubbed Malta for attempting to narrow such right. The ECHR had argued that by introducing a caveat to this right – the “vulnerability of the defendant” – the Maltese Constitutional Court had “chose[n] to contradict the letter and the spirit of the Grand Chamber’s judgment”.\nOn these points, the lawyers are requesting the Constitutional Court to reconfirm the breach of human rights and grant suitable remedies – by implication, the nullification of the sentence and retrial of the case.\n* Dr Zammit Maempel has nothing to do with the case of Edward Zammit Maempel and his sister mentioned in the article. Although the two of them are distant relatives, their respective cases mentioned in this article are unrelated (Dr Zammit Maempel 'case' refers to his clients' case) and they feature in this article coincidentally.", "comment_count": 12, "id": 2132}, {"keywords": "", "author": "Ivan Martin", "article_body": "Parents and teachers have a week to weigh in on whether to ditch traditional school uniforms in favour of tracksuits, the Education Ministry said. \nOne parent believes comfortable polo shirts and trousers, or divided skirts should be chosen, not a tracksuit to breed a generation of hoodies. Photo: Matthew Mirabelli\nA one-week consultation will begin on Monday after students gave their feedback earlier this year. \nBack in 2013, Education Minister Bartolo had launched a public consultation asking parents, students and teachers whether State school uniforms should remain as they were, be simplified or abolished.\nRead: School uniforms should be mostly generic with a few distinctive features - report\nInitial feedback had shown that parents were in favour of simplifying the uniforms, with some deeming them too costly.\nA ministry spokeswoman told The Sunday Times of Malta that students at both primary and secondary government schools had been asked whether they would prefer to stick with the traditional school uniform of blazer, shirt and tie, or ditch it in favour of a sporty tracksuit. \nSome 1,600 middle and secondary school students from 21 schools took part – 91% said they would prefer a tracksuit. Just five per cent said they would prefer to stick with the traditional get-up and the remaining four per cent wanted neither. \nThe authorities also held focus groups, each with 10 to 30 primary school students, mostly made up of the peer-elected student council representatives from 20 schools. Some 85% preferred the sporty option over 15% who wanted to keep wearing formal attire. \nThe next step, the spokeswoman said, would be to have parents and educators weigh in. On Monday morning, parents will be sent an SMS and educators will be sent a link via e-mail taking them to a voting page.\nThe more comfortable they are, the happier students will be\n“A while back we asked parents whether they preferred ditching uniforms entirely, and they were understandably in favour of retaining them. Now we are taking the next step and seeing what sort of uniform this should be,” the spokesperson said. \nRead: Right dress code for schools\nIf parents and teachers back the students’ choice the next step would be to decide whether to introduce one tracksuit for all schools or if each school should have their own colours and design.\nBack in 2017 Education Minister Evarist Bartolo had tested the waters on his Facebook profile page. He shared an article published about the Children’s Commissioner’s proposal for uniforms to be comfortable, practical and flexible. The minister said several parents had suggested their children wear an official tracksuit to school rather than the current uniform.\n“What do you think?” Mr Bartolo asked his Facebook followers.\nIn just a few hours, the minister’s post garnered 1,200 reactions. The majority gave their blessing, with some saying that the more comfortable they were, the happier students would be. With a tie and a blazer, students looked like they were heading to Parliament, not to school, one social media user had commented.\nHowever, others pointed out that wearing a uniform in school instilled in children a sense of discipline, preparing them for adulthood.\nOne parent protested: “If we want our children to be in comfortable clothes, why a tracksuit? To breed a generation of hoodies? We can find a compromise… comfortable polo shirts and trousers, or divided skirts.”\nRead: Is it time for school uniforms to go?", "comment_count": 27, "id": 2133}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Adrian Hillman, the former boss of Allied Newspapers and now the government’s representative on the Board of Trustees of the American University of Malta, caused a public relations headache for the Office of the Prime Minister last Friday during the inauguration ceremony of the Cospicua campus.Former Allied Newspapers boss Adrian Hillman seen turning away from the Prime Minister after being told not to accompany him on the tour of the campus.\nOPM officials were seen rushing over to ask Mr Hillman not to be seen with Dr Muscat during a tour of the campus, due to the presence of the media.\nAt the start of the tour, led by the AUM’s Jordanian owner Hani Salah, Mr Hillman – who is the subject of two money-laundering inquiries – was one of the first to greet Dr Muscat and start to accompany him around the building.\nHowever, this lasted only a few moments before an official from the OPM’s communications team, possibly concerned at the potential embarrassment that pictures with Mr Hillman could cause the Prime Minister, took Mr Hillman to one side and spoke to him.\nMr Hillman immediately turned away while Dr Muscat carried on with his tour.\nIn an unscripted announcement during the speeches preceding the tour, Prince Jean of Luxembourg, chairman of the AUM’s Board of Trustees, announced that Mr Hillman had been selected by the OPM to represent the government of Malta as its trustee.\nIn comments to the media after the tour, Dr Muscat did not reply to the question of why Mr Hillman was not accompanying him. However, he said he “had no problem with Mr Hillman”, despite the former Allied Newspapers managing director being the subject of two magisterial inquiries on alleged money-laundering along with the Prime Minister’s right-hand man Keith Schembri.\nAsked to explain why OPM officials had asked Mr Hillman to stay away from Dr Muscat, the OPM did not reply.\nDr Muscat said he had 'no problem' with Mr Hillman being involved. Video: Mark Zammit Cordina\nIn 2016, soon after the Panama Papers leaks, Mr Hillman resigned from all his positons within the Allied Group following revelations that he owned a secret company in the British Virgin Islands, similar to the ones set up in Panama by Nexia BT’s Brian Tonna for Keith Schembri and Cabinet minister Konrad Mizzi. Later, following an investigation, the anti-money laundering agency FIAU concluded there were “reasonable suspicions” that Mr Schembri was involved in money laundering after he transferred hundreds of thousands of euros to Mr Hillman.\nDespite the FIAU reports, the police took no action, forcing the PN opposition to ask the court to conduct a magisterial inquiry, which is still ongoing.\nBoth Mr Hillman and Mr Schembri deny money-laundering allegations.\nAs managing director of Allied Newspapers, Mr Hillman was in charge of a multi-million investment in a new printing facility for Progress Press. The tender to supply the new machines and related technology was won by Kasco Group, owned by Mr Schembri. Mr Hillman later resigned.", "comment_count": 31, "id": 2134}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Air Malta unveiled a new integrated control centre on Sunday as part of upgrades which the airline said would allow it to respond more effectively to any disruptions or emergencies.The new control room at the airline’s Skyparks offices will bring together key decision makers on different parts of the airline’s operations, including controllers, engineering, and commercial personnel.CEO Clifford Chetcuti said the airline’s emergency response room had also been upgraded. Senior management will be located directly adjacent to the response room, allowing decisions to be taken quicker and communicated to customers more effectively.Mr Chetcuti said the upgrades were part of a drive to improve the airline’s operations to allow it to continue moving forward after encouraging results in recent years.Tourism minister Konrad Mizzi said Air Malta was aiming to become the “airline of the Mediterranean”.Apart from the operational upgrades, he said, the airline would continue strengthening its route offerings, with services to Cairo set to begin soon and plans to extend into medium-haul routes, starting with Mumbai.Dr Mizzi said the once-ailing airline had continued to post encouraging financial results, adding that the upcoming annual general meeting would “reveal a nice surprise”.", "comment_count": 11, "id": 2135}, {"keywords": "", "author": "", "article_body": "Updated at 4.55pm, adds GWU statement\nFormer General Workers' Union section secretary Ronnie Pellegrini passed away on Sunday after a long illness.\nRonnie Pellegrini. Photo: Facebook\nMr Pellegrini, who lived in Marsascala, was a Labour Party militant and former chief canvasser of the late Lorry Sant.\nLast year, he was appointed part-time adviser to the Transport Malta chairman Joseph Bugeja. He was also full-time advisor to Justice Minister Owen Bonnici.\nThe Labour Party paid tribute to Mr Pellegrini saying that at different times, including challenging ones, he was a point of reference to many structures within the party.\nHis career, the party said, was bound to the social democratic commitment and he focused on safeguarding and improving the rights of the lower classes.\nIn a tweet, PL deputy leader Chris Fearne said Mr Pellegrini had dedicated his life to the party and country.\n\nIn a statement, the General Workers' Union said the news meant that the union had lost a friend who till his end believed in the principles that built workers' achievements.\nMr Pellegrini held dear the principles which built his union work in favour of the workers and the vulnerable. He never stopped working for the implementation of the socialist principles he loved and believed in.\n \n ", "comment_count": 0, "id": 2136}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Tourism minister Konrad Mizzi has rubbished reports that he met with MEP Miriam Dalli and health minister Chris Fearne to discuss his intentions over the forthcoming Labour Party leadership race.“It’s a bunch of baloney,” Dr Mizzi told Times of Malta, insisting he had not held any meetings or discussed the leadership with Dr Dalli or Mr Fearne, both considered frontrunners in the race which would be triggered by Prime Minister Joseph Muscat’s planned departure ahead of the next general election.\nIllum reported on Sunday that the meeting between the three potential candidates had taken place on Saturday and concerned Dr Mizzi's rumoured intention to contest the top job. Dr Mizzi, who has faced sustained pressure ever since his involvement in the Panama Papers scandal in 2016, also denied having discussed his potential candidature with the Prime Minister or having been instructed by Dr Muscat not to run.The Sunday Times of Malta reported that Dr Mizzi had contacted cabinet ministers and PL delegates seeking their support for a leadership bid, and had had what one source described as an “argument” with the Prime Minister about his plans.Dr Mizzi on Sunday again deflected questions about his leadership ambitions by insisting he remained fully behind Dr Muscat and would be working to convince him to stay on as Prime Minister.Dr Muscat has repeatedly stated he would step down before the next general election, and reinforced this pledge on Saturday when he said he would welcome the introduction of a two-term maximum tenure for Prime Ministers.", "comment_count": 26, "id": 2137}, {"keywords": "", "author": "Denise Grech ", "article_body": "Mariposa* was angry as she recounted her experience of being kicked out of a doctor’s office after seeking advice on abortion.\n“He was judging,” she told Liza Caruana-Finkel, who looked at the stigma surrounding the issue as part of her Masters dissertation.\n“I felt very isolated,” another woman told her. “That is… the worst of it. The fact that…[you’re] like a criminal, you know,” she said.\nAbortion in Malta has always been a contentious matter. The country has some of the strictest laws in the world and remains the only country in the EU to ban it under any circumstance.\nMs Caruana-Finkel interviewed six women who had an abortion abroad and one who accessed the morning after pill illegally.\nThe study was qualitative and does not necessarily represent the views of the majority of women who have gone through the experience.\nSometimes, she found, abortion was a way to escape an abusive relationship. In other cases, as with a woman who was suicidal on finding out she was pregnant, the procedure was a lifeline.\nSecrecy and silence still dominate Maltese society, which perpetuates the stigma of abortion and prevents most women from speaking up\nMs Caruana-Finkel said almost all stories reported in the media spread the false message that women who terminate their pregnancy are victims of a terrible and shameful decision. With her study she wanted to shed light on a different reality – one where women did not feel regret but stigma kept them in the shadows.\n“I never regretted my abortion... not for a second,” one woman told her.\n“It is not that the women were glad to have an abortion but that they saw it as an opportunity to start anew, without having to be ‘tied down’ by abusive partners or single motherhood, for example,” Ms Caruana-Finkel explained.\n“A sense of relief was noted by all the women who had an abortion, which has actually been shown in research studies as the most common emotional response post-abortion,” she said.\n“Secrecy and silence still dominate Maltese society, which perpetuates the stigma of abortion and prevents most women from speaking up.”\nSociety was unkind to women who underwent the procedure and shamed them for not living up to the ideal of motherhood and womanhood.\n“When women’s stories remain hidden, the prevalence of abortion is underestimated,” she said. “And so, those who oppose abortion miss out on interactions which might make them more tolerant and empathic towards women who seek and have abortions,” she told attendees for the launch of Voice for Choice Friday evening.\nThe pro-choice coalition said it will be campaigning for the decriminalisation of abortion and advocating for laws that ensure the health of pregnant women is protected.\nRead: Abortion Support Network expands service to Malta\nVoice for Choice said it had launched its campaign to strive for a society based on equal respect and justice free from discrimination for all genders and minority groups.\nShe also warned of a vicious circle – speaking about experiences is indispensable to a change in public perception, but women refuse to speak up because the same public stigmatised them.\n*This name has been changed\nRead: Women should have access to abortion in at least four circumstances - paper says\nBishop on protection of life\nIn the first in a series of regular articles being published in the Christian spirituality page of The Sunday Times of Malta, Auxiliary Bishop Joseph Galea Curmi argues that just as Malta has applied for the humble ftira to be included in Unesco’s list of intangible heritage of humanity, so too should our country make a case for the principle of the protection of human life, starting from conception, to be included in the same list.\nMoreover, he says that, as a people, our default position should be that of zero tolerance to all threats to life, and offering support to whoever is at risk, whether they are the unborn, pregnant women, the elderly, migrants, recreational drug users, those living in precarious conditions, or indeed the environment.", "comment_count": 484, "id": 2138}, {"keywords": "", "author": "", "article_body": "Luring pigeons into cages to poison them is an unethical way of controlling the bird population, the Democratic Party has said.  \n\"Other more humane methodologies are available, utilizing non-lethal substances that interfere with the birds' reproductive processes. Such approaches have been successful in European cities such as Genoa and Barcelona,\" said PD's Mark Zerafa, who heads the party's animal rights policy group. \nThe PD statement comes in reaction to news that authorities plan to curb the pigeon population by feeding them death-inducing substances.\nIn the past, authorities have organised culling sessions in which the birds were literally shot out of the sky.\n PD said that such culling exercises were only short-term solutions, as pigeons from surrounding areas quickly filled voids caused by culls. \n\"It is said that a country can be judged by how it treats its animals, so let us set a high standard,\" urged party deputy leader Timothy Alden. \nRather than killing pigeons, cities like Barcelona and Genoa have tackled the problem by feeding them contraceptive-laced food, effectively stopping them from reproducing without killing them. \nLisbon has gone for a different approach, building a purpose-built nesting tower for the birds, in the hope of stealing their eggs before they hatch. ", "comment_count": 24, "id": 2139}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The struggling American University of Malta has embarked on an intense marketing campaign in China aimed at luring a substantial number of wealthy Chinese students to fill some of the hundreds of still-empty desks at the Cospicua campus.\nAUM sources said that as part of this “blitz campaign”, spearheaded by the AUM’s owners, Jordanian construction magnates the Sadeen Group, a permanent office was opened in Shanghai last month. The hope is to attract, in particular, prospective Chinese students aspiring to gain a foothold in Europe.\nSimilar campaigns are being conducted in India and Ghana.\n“The AUM owners are trying to give their project a last shot and have instructed university officials to fill the university with Chinese students,” a faculty member told The Sunday Times of Malta.\n“Apart from opening a permanent office in Shanghai, with ‘diplomatic’ help from the Maltese government, AUM officials flew to China several times in order to sign ‘collaboration’ agreements with Chinese universities on sending students to Malta at least for part of their degrees.”\nMassive discounts on tuition fees are being offered, according to another official: “The priority now seems to be to show that the Maltese campus is alive and kicking.”\nThe AUM has entered into ‘collaboration’ agreements with Chinese universities including the East China Normal University and Shanghai ECHO Education Group, both promising to start sending hundreds of students to Malta as part of a Chinese language and culture programme.\nDr Muscat speaking at the inauguration ceremony on Friday. Photo: Mark Zammit Cordina\nThe language problem\nAUM insiders said that although the collaboration with the Chinese could well be the university’s “turning point”, language is a problem. “Unfortunately, most Chinese students have such a low standard of English that they don’t even qualify to start a degree course in Malta. Still, the university is trying to satisfy their requirements as their presence on campus is crucial,” one source said.\nDuring last Friday’s official inauguration of the AUM campus, the university’s president Lewis Walker put the number of students on campus at about 100.\nAlthough no details were given about how many students are enrolled in  each course, this newspaper is informed many of the students are not actually following a degree yet but are still learning English. The AUM introduced a one-year ‘English for Academic Purposes’ course aimed at instructing students in basic English, to enable them to eventually proceed to a degree course. The students are being ‘guaranteed’ an automatic admission to a degree course once they complete the English course successfully.\n“Of the 50 additional students recruited recently, almost none meet the English language requirements for acceptance at the AUM’s accredited academic programmes. They need to learn basic English first,” a source said.\nThe Sunday Times of Malta is informed several owners of local English language schools have complained of “competition” from the AUM. They claim the government-appointed National Commission For Higher Education is not showing any “keen interest” in checking operations at the Cospicua campus.\n“Although the AUM was supposedly set up to offer degrees it has ended up as an English language school for foreign students,” an official of a leading English language school told this newspaper.\nControversy from the start\nThe AUM project was shrouded in controversy from its inception in 2015. Some smelled a rat when the Jordanian construction company was given red carpet treatment by the Office of the Prime Minister. Despite the company having no experience whatsoever in education, the government agreed to grant it a large tract of ODZ land in Marsacala, known as Żonqor, to build a huge campus where hundreds of dormitories would have unspoilt sea views.\nPolitically, the project was spearheaded by Prime Minster Joseph Muscat, who defended his decision tooth and nail promising that the AUM would “transform the economy of the South”.\nOpening its doors in 2017 – a year later than planned – the AUM has so far struggled to recruit many students.\nIt is also embroiled in controversies and court actions filed following the laying off of most of its original faculty and administration staff only a few days before their six-month probationary period was set to expire.\nDuring Friday’s inauguration ceremony, attended by more guests than students, Dr Muscat again defended the project saying he was sure the AUM would fill its campuses with students in the near future.\nivan.camilleri@timesofmalta.com", "comment_count": 63, "id": 2140}, {"keywords": "", "author": "Keith Micallef", "article_body": "Voters staying at home in the forthcoming European and council elections will be endorsing Malta’s corrupt government and abstaining in the fight of good against evil, Nationalist Party leader Adrian Delia said on Sunday.\n“Whoever does not come out to vote is rewarding Labour, whoever does not join us in the fight against corruption is corrupt,” Dr Delia said in a political activity at the party headquarters in Pieta.\nThe event was held prior to the start of a fund raising marathon on the party’s television station.\nHis appeal was made amid indications and concerns that the PN is set to suffer an even bigger landslide in the May 25 election than in the 2017 general election, when the gap was 36,000 votes.\nRecent opinion polls suggest that the PN’s major hurdle will be to mobilise its own faithful to come out to support the party, as  a significant chunk are yet to warm up to Dr Delia amid serious allegations about him, which he has persistently denied. \nGovernment taking over institutions\nIn his address the PN leader lashed out at the government for “taking over” major institutions such as the police force, the Malta Financial Services Authority, the anti-money laundering agency (FIAU), the army and even the judiciary.\nIn this respect he echoed the concerns raised by former European Court of Human Rights Judge Giovanni Bonello in The Malta Independent on Sunday.\nDr Bonello noted that in 16 out of the last 17 appointments, the magistrate or judge had clear political connections.\n\nWhile noting that in just six years, Labour had ruined all of Malta’s checks and balances, he warned that the country’s democratic system had “collapsed”.\nGender equality regression\nThe PN leader also criticised government’s track record with regards to women, saying that a host of indicators revealed that since 2013 the country had gone backwards.\nDr Delia cited the increasing gender pay gap, with Malta falling 19 places worldwide down to 106 from 149 countries, a relative drop in healthy life expectance, from 78th down to 120th place, and a decline in women in decision-making positions in State corporations from 30 to 15 per cent.\n“All of this happened under the watch of a government which portrayed itself as the most feminist in history,” the PN leader remarked.\n“However, the situation on the ground is not what government’s marketing strategy is depicting”, he added.\nEgrant case\nRounding off his address, Dr Delia referred to the ongoing court case instituted by the party in order for the government to publish the full Egrant inquiry report.  He noted that on Monday he was due to appear in court for the final submissions in the case.\n“It is shameful that in the 21st century an Attorney General of a democracy EU member state is defending the Prime Minister rather than country constitution, freedom of expression and political balance,” he said.\nPitching his address to disgruntled PN votes he urged them to re-join the party, which he said was getting stronger and become more united.\n“Our doors are wide open to those who left the party and even those who never militated within it,” he said.", "comment_count": 54, "id": 2141}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 1.45pm with PN reaction\nEquality between men and women in Malta existed only on paper, and the country having the largest pay gap in the EU was unacceptable, Joseph Muscat told party followers in Pieta.\nThe Prime Minister was speaking at the Labour club on Sunday, 80 days in the run-up to the European Parliament and local council elections.\n“In Malta we have laws in place that guarantee equality while the government also wants to push equality, however, equality between men and women does not exist,” Dr Muscat said.\nHe noted that while more women had taken up employment, supported among others by initiatives such as free childcare, the gender pay gap was increasing, rather than decreasing.\nThis meant that women were either being paid the minimum wage or entering employment at the lowest levels.\nAccording to the latest data, there is an 11 per cent wage difference between men and women who do the same job, meaning that symbolically, women in Malta work for free between November 19 and the end of the year.\nAccording to Dr Muscat, there was also a gender element to poverty in Malta, where a substantial amount of those suffering material deprivation were women.\nIn keeping with the topic of gender issues, the Labour leader flagged the absence of women from the judiciary and parliament.\n\nSo far, none of the retired magistrates and judges have been women, bar Judge Ena Cremona who gave up her local post for one in the EU.\nA Labour government had therefore made it a point to “short-circuit the system” with 57 per cent of its nominations for the Malta Courts being women.\nThis saw an increase of female presence in court from 37 per cent to more than half.\nParliament had a similar history.\nDr Muscat said that since elections started taking place in Malta, only 27 women (including former Speaker Myriam Spiteri Debono) were elected to Parliament, which had in the meantime hosted hundreds of male MPs.\nIn order to create more balance, something this government had been given a mandate to do, we will be proposing “a mechanism that provides more space to women”, rather than quotas, he added. These positive measures will be temporary.\nA public consultation will kick off in the coming weeks, however, such constitutional amendments needed the backing of two-thirds of the House, he noted.\nThe Prime Minister had a word for “men who did not care” about gender issues.\n“Remember that everyone has a mother, a daughter or a granddaughter, and I don’t know of any man who wants their daughter or granddaughter to be worse off than their son or grandson.” Remember that everyone has a mother, a daughter or a granddaughter\nGeorge Vella best person for the job\nIn looking back at this week’s events, Dr Muscat defended the nomination of George Vella as Malta’s next President.\nHe said that despite criticism that the government had lost the opportunity to nominate a person from the opposing political camp, Dr Vella was the best suited person for the job.\nThe government had looked at Dr Vella’s qualities, and not his political affiliation, just as it had done with the appointment of George Hyzler as Parliamentary Commissioner for Standards.\nThe PL leader also referred to the inauguration of the American University of Malta, which currently hosts fewer than 100 students.\nThe AUM is expected to host some 4,000 students over the next four years, he said, adding “let’s see whether those laughing at the fact that there are currently 90 students will continue to do so when there are hundreds of students.”\nIncrease in pension for next year\nEconomic growth, which last year stood at 6.6 per cent, would see another increase in pensions, Dr Muscat said.\nThe 6.6 per cent GDP growth rate was double that of other European countries, with the country producing €12.3 billion, he added.\n“As a result, in October we will announce another increase in pensions for the 2020 budget.”\nDespite the increase in growth, wealth inequality persisted, he said, and there were still people who were finding it difficult to keep up with the rent and their everyday expenses.\nWhile material deprivation had been halved, the government will continue with its efforts to decrease poverty, Dr Muscat said.\n'We've gone backwards' - PN\nThe Nationalist Party suggested that Dr Muscat had \"conveniently forgotten\" to note how Malta had actually gone backwards in terms of gender equality during his time in office. \nIt listed several metrics, published in international reports, which showed that gender equality in Malta was even less likely now than previously. \nAmong those figures were a significant increase in the gender pay gap, from 7.7 per cent in 2011 to 12.2 per cent this year, and a second-from-bottom place across the EU when it came to the share of women on boards. \n\"After promising the most feminist government in history, Joseph Muscat's government has led to gender equality being a long distance away,\" the PN said. ", "comment_count": 41, "id": 2142}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Police Sergeant Edward Falzon, better known among his colleagues as It-Tenur, is being investigated over the possibility that he breached disciplinary rules contemplated in the Police Act after posting politically loaded messages on Facebook.\nIn one video-post, now deleted, the police officer described himself as a Labour “soldier of steel” – suldat tal-azzar – while warning against PN “turncoats” who he said joined Labour in droves for opportunistic reasons.\nReplying to a number of parliamentary questions on this incident, Home Affairs Minister Michael Farrugia confirmed that the police disciplinary board, set up as an independent body, is investigating the case and will take necessary action if Mr Falzon is found to have breached the rules.\nMembers of the police force are not supposed to participate in any form of political activity or canvassing.\nThe police officer described himself as a ‘soldier of steel’ while warning against PN ‘turncoats’\nHowever, Mr Falzon, from Cospicua, continues to compose politically loaded messages, showering with praise Prime Minister Joseph Muscat while deriding members of the Opposition.\nMr Falzon had already made the headlines some years ago when, in 2016, he became the first ever police officer to be reinstated in the force despite having a blue badge issued by the Commission for the Rights of Persons with Disability, declaring him as having difficulties in walking properly.\nEdward Falzon known as It-Tenur.\nMr Falzon had left the police force in 2005 as a police constable.\nFollowing Labour’s return to power in 2013, a grievances board had found he had suffered injustices in the past and ordered him to be reinstated.\nAfter being re-employed as a police officer 11 years after having left the force, Mr Falzon was immediately promoted to the rank of sergeant and given light duties serving at the airport’s VIP section. He had publicly thanked Prime Minster Joseph Muscat for his promotion.\nSenior members of the police force could not understand how Mr Falzon could have passed a medical fitness test, an obligatory requisite for reinstated police officers, once he was carrying a blue badge that had been issued to him in 2011.\nMr Falzon had also publicly derided former police commissioner Michael Cassar in another of his social media posts. Mr Falzon was called to re-join the police corps a few years after Mr Cassar had resigned from his post and was replaced by Commissioner Lawrence Cutajar.", "comment_count": 73, "id": 2143}, {"keywords": "", "author": "", "article_body": "A motorcyclist was taken to Gozo General Hospital on Sunday morning after he was hit by a van in Għajnsielem, the police said.The 28-year-old Suzuki GSX rider, who lives in Sannat, was hit by a Fiat Doblo Panorama driven by an Għajnsielem man, 62, while on Triq l-Imġarr.Police were told of the incident at around 9.30am. ", "comment_count": 0, "id": 2144}, {"keywords": "", "author": "", "article_body": "The Sunday Times of Malta leads with news that inspections of tuna farms found that most were breaking the law, but were allowed to continue operating.\nThe newspaper also gives prominence to news that the American University of Malta is hoping to lure wealthy Chinese students to its campus.\nThe Malta Independent on Sunday reports that the president of the Chamber of Advocates sees no conflict of interest in lawyer Pawlu Lia’s multiple roles.\nThe newspaper also quotes judge Giovanni Bonello, who criticised several members of Malta’s judiciary as being there to “rubber stamp” abuse.\nMalta Today reports that HSBC had been warned last year of the hacking group which subsequently infiltrated Bank of Valletta.\nIl-Mument leads with the headline ‘Stay home: get Labour’, with PN leader Adrian Delia urging government sceptics to vote PN in May’s elections.\nIt-Torċa reports that Air Malta will have two new planes as of this coming summer.\nIllum reports that the PN has set itself a target of garnering 100,000 votes and being 50,000 behind Labour in May’s MEP elections.\nThe newspaper also reports that Prime Minister Joseph Muscat held a meeting with his deputy Chris Fearne and minister Konrad Mizzi, to discuss the latter’s hopes of running for PL leader once Muscat steps down.", "comment_count": 1, "id": 2145}, {"keywords": "", "author": "Ramona Depares", "article_body": "It’s becoming a trend: towns and villages where clubs and bars stay open late for the entertainment of patrons who tend to shun Paceville and Buġibba – and it is leading to disturbed nights for residents. Ramona Depares zooms in on one particular area where the weekends have become a nightmare for some.\nMore residents have come forward with complaints of excessive night-time noise emanating from bars after The Sunday Times of Malta sounded the alarm about village cores being turned into unofficial entertainment zones.\nĦamrun appears to be one of the hard-hit localities.\nA number of residents have contacted this newspaper to lament the loud amplified music and groups of equally loud revellers hanging around outside bars up to the early hours of the morning.\nThey seem to have become a regular occurrence, turning Friday, Saturday and even Sunday nights into a nightmare of noise and drunken people for those living in the vicinity.\nThe problem area is reported to be concentrated in the stretch of road between Ħamrun and Santa Venera, which some residents have dubbed a ‘no man’s land’ due to it being located away from the centre of either town, with infringements less likely to be noticed by authorities.\n“Three particular bars are the worst in terms of noise and even loitering about,” one irate resident said, while showing me an exchange of e-mails with the Ħamrun police station, all providing details of specific days and times when the infringements allegedly occurred. Some include photo evidence and footage of groups of people outside the places in question.\n“People regularly get drunk, or worse, at these spots and I have personally informed the police on duty multiple times. It has become so bad that I even installed CCTV cameras all around my house in order to keep a close eye on the situation,” the resident said.\nThe cameras turned out to be particularly useful after a bar patron who was “off her face” broke into his car.\n“Thanks to the cameras I had evidence of her actually doing the act, and it was easy to identify her,” he said.\nThe woman was called in for questioning after the footage, seen by this newspaper, was passed on to the police.\n“But she was released shortly after and I don’t know what happened with the case since then,” the resident said, visibly exasperated.\nAnother resident echoed these comments, saying that she had taken to sleeping at her boyfriend’s house as the noise was unbearable.\n“Added to the loud music, I also have to put up with the vibrations running through the stone work and the window panes. I am being chased out of my home,” she said, adding that one of the worst offenders was a bar that opened every fortnight, “when people receive their pay and have money to spend”.\nWe have a right to a peaceful life like everyone else\n“I have complained to the police multiple times, yet these bars remain open and nothing seems to happen to them. Are they above the law?”\nPolice say the matter cuts both ways\nBut sources within the police force insisted that all complaints about excessive noise are acted upon immediately, with the offenders being taken to court in case of repeated violations and some bar operators even having their licence suspended or withdrawn.\n“In many cases, however, this is not possible as the majority of residents that file a complaint do so anonymously, which leaves us without any witnesses in case of a prosecution,” the source insisted.\nWhile residents’ complaints were taken very seriously, he said, this was a “two-way street and those experiencing problems need to stand up and be counted”, in order for the full force of the law to be able to be applied in an effective manner.\nHowever, when asked to explain the judicial process following an anonymous complaint, lawyer Stefano Filletti said that even when no third-party witnesses came forward, police were legally entitled to initiate court proceedings against offenders.\n“The prosecuting officer in the case provides his own testimony. The law allows for the police to be the effective witnesses,” he said.\nBut he added that anonymous complaints could indeed jeopardise the outcome of the prosecution in cases where the police were dispatched to investigate complaints regarding excessive noise only to turn up on site and find no evidence of this.\n“This is not necessarily because no infringement was committed, of course. The music may have stopped by the time they show up, or people may have gone elsewhere... But the truth is that if police officers show up at a bar and find no evidence of excessive noise, then they cannot initiate proceedings unless an independent witness comes forward.\n“The only instances when police officers can act as witnesses are when offenders are caught red-handed by the law. Otherwise, they cannot be witness to something that they didn’t, in fact, witness. In such cases, the likelihood is that no legal steps would be taken against the bar as the case would fall flat upon its face,” Dr Filletti said.\nMeantime, residents lamented the impasse, with one particularly upset complainant claiming that it is “ridiculous” to place residents in a situation where, if they want to enjoy a good night’s sleep, they had to be willing to get involved in court proceedings.\n“We have a right to a peaceful life like everyone else. Why should it be our responsibility to get the issue resolved? I don’t want to show my face and give evidence against someone who may bear a grudge against me and my family just to be able to enjoy my right to a quiet night,” the resident insisted.", "comment_count": 53, "id": 2146}, {"keywords": "", "author": "Ivan Martin", "article_body": "Gozo’s population would have to explode to 150,000 people for a metro line on the sister isle to be deemed feasible, according to the consultancy firm working on the government’s mass transportation plans.\nGovernment sources said the UK engineering firm Arup had in recent weeks informed Transport Minister Ian Borg that the sister isle’s population would have to increase fivefold for it to be economically viable to extend a metro service beneath the channel. \nTalk of a 20-year mass transport project has been swirling around in recent months with the government last month confirming that plans for a comprehensive system were at an “advanced stage”.\nAnd, although some have questioned whether this would incorporate the Malta-Gozo tunnel, Prime Minister Joseph Muscat in February gave an indication that Gozo would not be part of his metro metropolis.\n “We need to ask ourselves – do we want more building on Gozo to facilitate this population growth?” he had told a political gathering in the Gozitan capital of Victoria. \nMeanwhile, Arup have told the Infrastructure Ministry that Mellieħa’s population would also have to grow significantly for it to make economic sense to extend the metro line even that far north.\n“Mellieħa would need to experience a large growth from its current population of 10,000 to 50,000,” the company said. \nDo we want more building on Gozo to facilitate this population growth?\nThe preferred model\nGovernment sources told The Sunday Times of Malta that the preferred model for a metro system would service what Arup have identified as the “Principal Urban Area” – which would include the densely populated North Harbour region of the island.\nThis line would service a residential catchment of around a third of the population, Arup estimate, running in a loop of about 30 kilometres.\nBy way of comparison, a Gozo line would have some 550 per cent fewer residents per kilometre.\nThe principal line would also cover around 70,000 workers’ commutes, while a Gozitan line would cover only around 6,000, the experts told the government.\nMany metro plans  \nIn the run-up to the 2017 general election the Nationalist Party had proposed a “state-of-the-art” metro system of its own which it expected to cost at least €2.3 billion, saying it would be delivered over a period of four legislatures.\nAnd, more recently, a detailed proposal was also put forward by Konrad Xuereb, a director at KonceptX, an architectural and structural engineering firm with offices in Malta and London.\nHe believes his proposal, which includes a Gozo link and would be carried out across three phases, is not only feasible but could solve many of the island’s traffic-related problems.\nBased on the use of two tunnel boring machines, the first phase of the proposed metro could take just five years to be completed. The second and third phases would be anticipated to take a further two and three years respectively, he believes.\nThe government, however, is keeping its plans close to its chest, releasing few details on how its metro vision for the island would look. ", "comment_count": 71, "id": 2147}, {"keywords": "", "author": "", "article_body": "‘Country paths turned into highways’\n\nConcerns have been raised that country paths in Wied l-Isqof and Wied is-Sewda are being turned into ‘highways’. Concrete also spilled off the side of the road into a water gulley on the side of the country lane (inset). An Infrastructure Malta spokesman said the agency is currently implementing several projects to reconstruct over 40 kilometres of rural roads which had been left in a state of disrepair for many years.\nWhat made the headlines\nBank hackers ‘planned back door option’: Hackers who broke into Bank of Valletta’s IT systems last month and took €13 million could have tried to keep a ‘back door’ to try and regain access, but this was noticed and blocked, the Times of Malta revealed. Sources close to the investigation into the cyberattack said that in the days after the breach, files were found hidden in the bank’s systems, possibly intended to allow the hackers to regain access at a later stage. Sources said that BOV recovered more than €3 million of the funds stolen; the bulk of the rest being frozen in foreign jurisdictions.\n€23m underpass on hold after award blunder: A €23-million underpass project at the Santa Luċija-Tarxien roundabout was frozen after a legal wrangle erupted over a blunder during the evaluation process, the Times of Malta learnt. Sources said the tender was put on hold following the direct intervention by the Director of Contracts, Anthony Cachia, a week after it was awarded to RM Construction Ltd. Industry sources said a committee appointed to evaluate the contract “appeared” to have overlooked the fact that the successful bid was not up to the required standards requested in the call. Sources said a lower grade of concrete was being proposed and a crucial central wall was missing in the proposal made.\nGeorge Vella\nGovernment nominates George Vella as next President: Prime Minister Joseph Muscat announced he was nominating George Vella, 76, as Malta’s next President. Dr Vella is expected to take over the steering committee on constitutional reform, even though President Marie-Louise Coleiro Preca had signalled her intention to continue chairing the committee after she leaves office on April 4. The Nationalist Party said it would vote in favour of Dr Vella’s nomination even though Dr Muscat had missed an opportunity to look beyond partisan interests and pick a President favoured by at least two-thirds of the House of Representatives. A medical doctor, Dr Vella served as Deputy Prime Minister and Foreign Minister in the 1996 – 1998 Labour government and Foreign Minister in the 2013 – 2017 Labour administration.\nMobile data rates in Malta among most expensive: Maltese mobile phone users pay among the most expensive rates for data in any country in the world, according to a new global ranking. With an average price of €16.61 for one gigabyte of data, Malta was placed in 209th place out of 230 countries in an analysis of more than 6,313 mobile data plans worldwide carried out by British comparison service Cable.co.uk. In Europe only Switzerland, Cyprus and Greece were found to have more expensive data than Malta, while prices in Finland, the cheapest European country for data and the 14th cheapest globally, were 16 times cheaper than those in Malta.\nWarning over ‘imminent’ arrival of lethal drug: A lethal drug 100 times stronger than morphine and 50 times more powerful than heroin will be reaching our shores imminently, the authorities warned. Assistant Police Commissioner Dennis Theuma said fentanyl was already wreaking havoc in many countries. It only takes two to three milligrams of fentanyl – equivalent to about one grain of salt – to slow down a person’s breathing. Its derivative – carfentanyl – was about 5,000 times more powerful than heroin. Fentanyl can enter the body by inhalation, ingestion or muscle injection.\nPA approves Manoel Island project: The Planning Authority approved new plans for the mega-development on Manoel Island, amid continued concerns from NGOs and Gżira residents. The plans feature an extensive residential and commercial complex including 600 apartments, a hotel at the historic Lazaretto, retail outlets, a yacht marina, streets and plazas, as well as the restoration of several heritage buildings and 80,000 square metres of new parks.\nSimon Busuttil in new Panama Papers battle: Former PN leader Simon Busuttil argued in court that the “institutional paralysis” over the Panama Papers scandal breached EU laws. In a 77-page application calling for a magisterial inquiry into allegations emerging from the leaked documents, Dr Busuttil argued that the failure by various institutions to act against the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi breached the EU’s anti-money laundering directive and treaties as well as Maltese laws.\nWhat trended\n‘The MCA should protect the consumer’\nAn international study this week confirmed what any Maltese who has lived overseas has long known: local mobile data rates are eye-wateringly high.\nJust 20 countries out of the 230 surveyed offer cheaper rates per gigabyte, the survey found. Finns, for instance, pay tariffs 16 times lower than ours for that blessed 4G.\nThe news drew a variety of reactions from our readers.\nĊikku was quick to demand explanations from the competition watchdog.\n“I hope the MCA who should be protecting the consumer does not come out defending the mobile phone operators as it usually does,” he typed.\nMarcus predicted a boilerplate reply to complaints.\n“We’re too small is what they’ll tell you,” he wrote, before adding in his own assessment. “The reality is that they will not allow another company to come here and set up shop because strong competition would wipe out the companies there are now.”\nGeorge felt the survey did not tell the whole story, and noted that many of the countries included in the study had far lower living standards.\n“What costs €1 in India in fact is much more expensive than what costs €10 in Europe,” he argued, adding that in many countries mobile operators only offered decent service in metropolitan areas.\nStefan had a solution for all the people who felt ripped off.\n“Go and buy plans abroad to use in Malta,” he suggested. “Maybe then the prices would decrease here”.\nThe next President\nGeorge Vella will be Malta’s 10th President, with the Prime Minister announcing his pick this week.\nMany readers’ first reactions concerned Dr Vella’s anti-abortion views.\n“I hope that President George Vella would not betray his conscience and remain against abortion if a Bill is presented to him,” Steve wrote.\nJoseph felt that argument was flawed and said presidents who refused to sign Bills presented to them had only one option.\n“Resign. End of matter. Malta is a parliamentary democracy, not a dictatorship,” he argued.\nCh. J. was disappointed by the decision to pick a politician from Labour ranks, instead of an unaffiliated one.\n“All smacks of a lingering Mintoff ‘culture’,” he wrote – prompting a sharp retort from Vince who noted that Mintoff was “the only Prime Minister that nominated a non-political individual to the position of President”.\nWhat they said\n“I have no problem with Mr Hillman.”\nPrime Minister Joseph Muscat defending his decision to appoint Adrian Hillman, the disgraced former managing director of Allied Newspapers who is being investigated for money laundering, as the government’s representative at the American University of Malta.\n\n“Unfortunately, I have to say that there was very limited improvement, so we keep encouraging [the Maltese authorities]. We are ready to engage in open discussion on what to do because it is so important for this country, for its citizens and for the rest of Europe.”\nJyrki Katainen, European Commissioner for Jobs, Growth, Investment and Competitiveness, and a former prime minister of Finland, speaking about the little progress made by Malta after rule of law shortcomings were flagged by the European Commission, on the fringes of a conference organised by Nationalist MEP Roberta Metsola.\n\n“Malta is in desperate need of decency at the moment – I entreat the Midi Group to be the beacon that lights the way.”\nAstrid Vella, co-founder of the environmental NGO Flimkien għal Ambjent Aħjar, writing in the Times of Malta where she urged the Midi consortium to turn Manoel Island into a heritage and nature park with Fort Manoel as its jewel in the crown, instead of the planned mega project consisting of 600 units.\n“I think we should let the government communicate its decision on this.”\nPresident Marie-Louise Coleiro Preca, asked to comment about the fact that George Vella is expected to chair the steering committee on constitutional reform when he succeeds her as head of State, despite her having previously signalled her intention to continue in that role after she leaves office on April 4.", "comment_count": 0, "id": 2148}, {"keywords": "", "author": "Claire Caruana", "article_body": "Lack of information about the new ‘applied’ subjects, to be introduced in State schools next scholastic year, is prompting concern among teachers and their union.\nThey have not yet been told how many pupils have opted for these subjects, for which teachers are expected adopt a hands-on approach, while the plans on how to introduce them have not yet been communicated, they complain.\nThe new subjects will be rolled out starting in Year 9. Students in Year 8 (formerly known as Form 2) last month made their subject choices which included, for the first time, the applied subjects that would lead eventually to an applied version of the SEC certificate.\nThe 13 applied subjects include topics such as Engineering Technology, Health and Social Care, Hairdressing and Beauty, and Retail, while the core subjects of Maths, English, Maltese and Science can also be taken in the applied versions.\nThey will be taught in workshops rather than through the traditional theory-based techniques.\nAbout 60 teachers recently did a 10-day training course to help them make the shift.\nHowever, teachers who spoke to The Sunday Times of Malta on condition of anonymity say they have yet to be supplied with information on the planned changes, including who of them will be teaching the new subjects. With only three months remaining in the current scholastic year, they are worried there will be little time to plan ahead.\nThey also fear that if teachers of traditional subjects suddenly start being moved around to teach the applied ones, come September there could be a crisis, with not enough educators to cover all the subjects.\nOne expects the directorates to make their plans known to teachers\nThe Education Ministry has come in for criticism over lack of preparation for other projects in the recent past, notably summer schools and free transport.\nMinistry officials told The Sunday Times of Malta last month that the applied subjects would be rolled out “come what may”, prompting the teachers to question whether the change would be introduced even if still “half-baked”.\nWhen asked about the number of students who had opted for the applied subjects and which of the subjects were the most popular, the Education Ministry’s permanent secretary Frank Fabri said the “the process is still ongoing”.\nOther questions remained unanswered.\nNo 'specific information' - union\nContacted about the matter, Malta Union of Teachers’ head Marco Bonnici said the union did not have “specific information” on the number of students that had applied for each of the new subjects. \n “Neither does the union have any information about what plans the ministry is drawing up for all students to have enough teachers by the next scholastic year – in both applied and traditional subjects – and which of them will be teaching the new subjects.\n“What the union can deduce, however, is that after all the promotion given to these new subjects, many students have applied and the requirements will be significant,” Mr Bonnici said.\nHe described the change as “yet another reform” in which educators were not only being excluded from all decision-making but were not being informed about what was happening.\n “One expects that, at least for the sake of reassurance, the directorates to make their plans known to teachers, especially to those who will be directly and indirectly impacted by these changes.”\nTeachers of non-applied subjects, he said, had approached the union saying they were feeling “disadvantaged” because promotion and investment was being directed only at these new subjects while “traditional subjects are being ignored”.\n“The MUT asks whether in the current circumstances the ministry can afford to continue alienating currently employed teachers,” the union head said.\nThe Education Ministry has said it expects each school to have at least one group of students for every subject on offer next year. It envisages requiring about 29 teachers for the new subjects. However, ministry officials would not talk numbers when speaking to The Sunday Times of Malta last month, insisting that it was “too early”.\nclaire.caruana@timesofmalta.com", "comment_count": 7, "id": 2149}, {"keywords": "", "author": "Ivan Martin", "article_body": "Inspectors found major irregularities in most of Malta’s tuna farms during routine checks last year but the operations were allowed to continue on, The Sunday Times of Malta has learnt.\nSources in the Fisheries Department said that inspections on the island’s tuna pens between September and October of 2018 uncovered how ranchers had concealed hundreds of extra fish, amounting to at least €4 million in illegal catches.\nSome pens also had missing fish – believed to have been sold on the black market – while others had included tuna that was not at the right age, with inspectors suspecting the extent of the alleged irregularities could have stretched into several millions of euros more.  \nShortly after the department’s inspections, the police were roped in along with the Attorney General, triggering a magisterial inquiry into the suspected abuse in the sector. \nA senior source in the sector said that while the directorate had moved to suspend the licence of the tuna ranchers due to the extent of the abuse, a meeting had been called at the Environment Ministry during which the decision was taken to allow the farms to continue operating until the magisterial inquiry was completed.\nPolice sources said the inquiry by the courts was ongoing. Meanwhile, a department source said that other inspections carried out earlier in 2018 had found even more irregularities.\n“In April we found fish farms that had landed tuna illegally, killing fish without inspectors present and without the necessary permits. We also found cages that were not meant to have fish in them, containing fish,” the source said. \nWhy is the tuna sector under the spotlight?\nThe island’s tuna farming industry has been cast in the spotlight after an international investigation found that it was at the centre of an EU-wide black market operation. \nThe months-long investigation by Spanish authorities, dubbed Operation Tarantelo, overseen by Europol, uncovered a network of shell companies and distributors that have allegedly been funnelling illegal tuna catches from Maltese waters and Malta-based fish farms to Spain via Italy and France.\nIndustry generates more than €120 million a year\nA network of 79 individuals – none Maltese – have been arrested, and more than 80,000 kilos of illicit bluefin tuna were seized. \nRead: How the tuna racket operates\nPhone intercepts between the now-suspended fisheries department head Andreina Fenech Farrugia and a Spanish tuna rancher operating in Malta also feature in the investigation.\nDr Fenech Farrugia has denied allegations that she had solicited bribes from the Spanish tuna kingpin in exchange for a lucrative increase in his tuna quotas. A separate magisterial inquiry is looking into these allegations.\nHow did the racket come to light?\nThe wide-ranging Spanish investigation started mostly by chance, after a string of food poisoning cases hit Spain back in 2016. Investigators discovered that the smuggled tuna behind the poisoning cases was not being treated with the minimum sanitary requirements and had dubious origins.\nTwo Malta-based ranchers have been named in the investigation – Mare Blue, owned by Spanish fishing giant Ricardo Fuentes and Sons, and Malta Fish Farms, owned by former Elbros owner Saviour Ellul.\nJapan is the chief destination market for farmed tuna, which has the right consistency of fat to meat ratio that is highly valued in sushi.\nAround 70 per cent of tuna fattened in the Mediterranean is exported to Japan, where it fetches prices so high that Malta’s legal tuna industry now generates more than €120 million a year.\nSpanish authorities believe that for almost every consignment shipped to Japan an equal amount from the illegally sourced stock was being shipped to Spain. Tests conducted on some of the irregular fish by Spain’s consumer rights authority found it contained a dangerously high level of histamines and had not been properly refrigerated during transportation. \nSpanish investigation sources have told The Sunday Times of Malta that the irregular tuna catches which originated from Italy and Malta would often start to decay en route but still get sold to consumers.\nThe main problem with supplying such tuna to the market is the dramatic increase in harmful histamines in the meat. Histamines can be toxic from 50 milligrams per kilo of product, although EU sanitary regulations allow an absolute maximum of 200 milligrams. \nThe Spanish sources said consumers who ended up hospitalised in Seville ate tuna containing 2,584 milligrams per kilo. Histamines in these proportions can cause heart failure and lung disease, according to an expert report incorporated in the Spanish court case.", "comment_count": 41, "id": 2150}, {"keywords": "Education", "author": "", "article_body": "Digital education in schools is the theme of a half-day event to be held on Friday from 9am to 12.30pm at the MITA Data Centre, Santa Venera, by the eSkills Malta Foundation, in collaboration with the Ministry for Education and Employment.\nOutside educational circles, and sometimes also within them, few people and organisations know what digital education is being given to students at primary and secondary level.\nEveryone now accepts that people from all walks of life will increasingly need digital skills and knowledge. This is because digital technology will be used not only by children or employees at the workplace, but practically everybody, including women at home. \nDigital technology will be used by people at every level of an organisation or society to increase their quality of life, by students to get better education and by teachers to transmit more effective lessons.\nIndividuals who are not digital savvy will suffer in one way or another; they may even become outdated and lose their job. To thrive in the workplace of the future, people will need to have the right digital education. Whether at school, at university or on the job, the digital transformation that is under way is making IT skills more important every day.\nThere will be the opportunity to hear, discuss and provide feedback. It is therefore important that people from industry (whether in digital sector or not) and education attend\nIt is therefore crucial that students receive the right education. All governments and educational institutions around the world are transforming education and learning by way of content, the way it is delivered and the tools being used both by students and teachers.\nIn Malta, the Ministry of Education started this journey some time ago, but outside educational circles, and sometimes also within it, few people and organisations know what digital education is being given to students at primary and secondary level. Their educational path is a very important one as these formative years will transform students up to adult life.\nPeople from both industry and the education sectors have contacted the eSkills Malta Foundation expressing interest in becoming more aware about the various initiatives that Malta’s Education Ministry has embarked on, or is embarking on, in the sphere of digital education. The umbrella of digital education is wide and touches all levels, from the formative years to adult and lifelong learning. \nDuring this Friday’s event there will be the opportunity to hear, discuss and provide feedback. It is therefore important that people from industry (whether in digital sector or not, but especially from the digital sector) and education attend. The eSkills Malta Foundation therefore encourages all ICT industry and education players to participate. Attendance is free.\nProspective participants are kindly asked to register at the link below.\nwww.eskills.org.mt/digitaleducationinschools", "comment_count": 0, "id": 2151}, {"keywords": "Education", "author": "Joseph Falzon", "article_body": "The fourth industrial revolution, or Industry 4.0, is rapidly shaping our present and future. While the first, second and third such revolutions brought economic benefits, increased productivity and advanced welfare, it is often argued that wealth distribution was not equitable and benefits came at the cost of climate change and environmental sustainability.\nRapid advances that are characterising Industry 4.0 will also provide benefits and opportunities in present contexts; however, it is predicted that these will happen much faster. Unpredictable issues due to rapid changes would therefore require fast remedies in policies, regulations and action. Our educational systems and curricula will succeed depending on its capabilities of anti­cipation, prevention and preparedness for Industry 4.0 and on its capacities of enabling infrastructure that supports our societies.\nSimilarly, strategies in construction methodologies should be more aligned with the more digitally developed industries. This process is revolutionising not only the way physical structures are designed and constructed but also the way buildings are maintained and used.\nIt is often argued that the latter factors are commonly undermin­ed, and in most buildings, ignored. Factors determining new ways and methods of building design have to be shifted from the conventional approach. The mindset of the design, function, geometry, structure and aesthetics of buildings where we live and work needs to be seen also from the perspectives of building climate, building technology, building energy and environmental consciousness.\nAlmost 50 per cent of EU’s ener­gy consumption is used for heating and cooling, of which 80 per cent is used in buildings. So the achievement of the Union’s energy and climate goals is closely linked to efforts to renovate its building stock by giving priority to energy efficiency, and making use of the ‘energy efficiency first’ principle, as well as the deployment of renewables.\nThe achievement of the EU’s energy and climate goals is closely linked to efforts to renovate its building stock\nThe EU’s revised Energy Performance of Buildings Directive 2018/844, which entered into force last July, demands that EU countries have to transpose the new elements of the directive into national law by 2020. The new directive has huge potential for efficiency gains in the EU building sector, the largest single energy consumer in Europe. It includes measures that will accelerate the rate of building renovation towards more energy-efficient systems and strengthen the energy performance of new buildings, making them smarter.\nBesides political and legislative provisions, which react through strengthening efficiency and renewable source management measures, cultural and business demands are starting to focus on environment-protecting construction issues. As a result, the building industry will change decisively, requiring high-performance ar­chi­tecture in buildings and settlements.\nThe interdisciplinary planning approach invites, or rather necessitates collaborative working in the aspects of architecture, building services systems, building power, urbanism, settlement planning and environmental engineering. Building information modelling, building physics, building energy, mathematics, climatology, aerodynamics, fine arts and lighting engineering are shaping new ways in building supply chain.\nOur societies are without doubt experiencing rapid transformations in all aspects and forms of life brought about by Industry 4.0. Autonomous robots, simulation, system integration, Internet of Things, cybersecurity, cloud computing, additive manufacturing, augmented reality and big data are characterising this fourth industrial revolution, and hence the way we shape our built environment within the realm of sustainable environment and sustainable societies – all this underpinned by research and innovation.\nIf our societies need to reap the benefits of Industry 4.0, business and communities will not only need to ensure that the workforce have the right expertise and culture but also a clear ambition and vision for what success looks like.\nDr Joseph Falzon, PhD, LEED AP (US), is an architect and programme coordinator of the Mcast MSc in High Performance Buildings, and a senior lecturer at the college’s Research and Innovation Centre.\nPhoto: Prof. Dr István Kistelegdi, Hungary.", "comment_count": 0, "id": 2152}, {"keywords": "Education", "author": "", "article_body": "The University College of the Malta College of Arts, Science and Technology (Mcast) is next month launching a new master’s degree programme in High Performance Buildings.\nStudents on the MSc in High Performance Buildings will learn about optimised building concepts, integrating various components of holistic design methodology, building physics, building climatology and comfort, energy-efficiency, environmental sources, building services systems, build­ing aerodynamics, thermal and fluid dynamic CFD simulations, lighting design, building operation, as well as green building modelling.\nThe programme will encompass the entire built environment, including concepts of high performance as applied to regeneration and retrofitting of historical buildings and structures, modern and contemporary buildings, high-rise buildings and urban settlements. It will provide for advanced skills in specialisation and scientific research of building physics, coupled with architectural design, and prepare students for professional, as well as research and development settings at national and international levels.\nAs a one-time opportunity, the first cohort on the master’s programme will be offered the entire course free of charge\nAs a one-time opportunity, the first cohort on the master’s programme will be offered the entire course free of charge.\nThe master’s is certified at Level 7 on the European Qualifications Framework, and has 90 European Credit Transfer and Accumulation System (ECTS) credits. Students may leave and re-enter the programme at several points: postgraduate certificate at 30 ECTS (Year 1); postgraduate diploma at 60 ECTS (Year 2); and the master’s degree at 90 ECTS (Year 3).\nThe programme is designed to cater for participants who are either students or are engaged in work or professional practice. It will be run on a blended format, in part via e-learning modules and the remainder via weekend sessions that run on Friday evenings and Saturday mornings.\nStudy unit focus on group discussions, thereby motivating academics, re­searchers, managers and industrial participants to share research findings.\nApplicants may register interest in the programme by e-mailing their CV and a copy of relevant certificates and transcripts to university.college@mcast.edu.mt.\nApplications close on Friday, March 15.\nThe course is part-financed by the EU through the European Social Fund under ESF3.003: Development of Training Programmes at MQF Level 7, through Operational Programme II of the European Structural and Investment Funds 2014-2020 ‘Investing in human capital to create more opportunities and promote the well-being of society’.", "comment_count": 0, "id": 2153}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Tourism Association chairman Paul Scicluna, addressing the annual general meeting, spoke about the need to keep improving every type of connectivity to the island and stated that the association is in favour of more connectivity, especially by the introduction of an airlink.\nGozo Minister Justyne Caruana.\nMr Scicluna mentioned that the GTA was commemorating its 20th anniversary this year and stressed the need for an upgrade of tourism establishments in order to maintain a sustainable tourism industry in Gozo. \nThe meeting, held at the Grand Hotel, Mġarr, was also addressed by Gozo Minister Justyne Caruana, Tourism Minister Konrad Mizzi and Malta Tourism Authority chairman Gavin Gulia.\nThe members and distinguished guests present were also given a presentation on industry updates and developments, with a focus on Gozo tourism by Leslie Vella and Carlo Micallef from the MTA.\nDr Mizzi spoke about the initiatives being undertaken by his ministry together with the Gozo Ministry and the MTA to continue sustaining Gozo’s tourism sector. While commending the contribution of the GTA towards tourism in Gozo, Dr Mizzi stressed the need to continue diversifying arrivals by exploring new markets like the Polish and Hungarian ones, and therefore the GTA participation in international tourism fairs should extend and cover such markets. \nIn her concluding speech, Dr Caruana said the numbers of tourist arrivals needed to be complemented with events in Gozo, something her ministry was delivering on regular basis. She stressed that the tourism industry in Gozo needed to be sustained by the ongoing upkeep of the touristic product.\nDr Caruana said that the introduction of the fourth ferry to complement the present fleet and a helicopter service between Malta and Gozo were additions to further  improve the connectivity.  \nWhile auguring more achievements to the GTA, she said all stakeholders needed to continue delivering in a synergised approach for the benefit of Gozitan tourism.  \nGTA CEO Joe Muscat delivered an audiovisual presentation on the performance of the association during 2018 and gave an overview of the Gozitan touristic performance. He also gave a detailed report of the work and initiatives undertaken by the association over the past year.\nThe financial report was read by the treasurer, Joe Muscat Sammut.\nThe GTA council for 2019 is made up of Karl Azzopardi, Marvic Borg, Mark Busuttil, Michaela Cordina, Ludgard Gatt, Mario Loporto, Joseph Mercieca, Joseph Muscat Sammut, Joe Rapa, Konrad Scicluna, Paul Scicluna, Pauline Spiteri and Amand Veranneman.  ", "comment_count": 1, "id": 2154}, {"keywords": "Gozo", "author": "", "article_body": "A presentation on the sea tunnel between Gozo and Malta was delivered by ophthalmic surgeon Franco Mercieca (pictured) and Infrastructure Malta CEO Fredrick Azzopardi during the Gozo Business Chamber’s AGM.\nThe meeting, held at Tiġrija Palazz in Victoria, was introduced by chamber president Joseph Borg, who also introduced the chamber’s new CEO, Daniel Borg.\nMr Borg thanked all those present and highlighted the importance of a healthy debate on the planned tunnel and the chamber’s role in putting the issue on the policy agenda.\nThe meeting was also addressed by Gozo Minister Justyne Caruana.", "comment_count": 0, "id": 2155}, {"keywords": "Gozo", "author": "", "article_body": "Former European Union Commissioner and Nationalist MP Tonio Borg (pictured) gave a lecture on the ‘Judicial review of administrative action’ at Il-Ħaġar, St George’s Square, Victoria.\nPhoto: Charles Spiteri\nDr Borg delved into this aspect of our legislation, explaining practical applications and giving details of actual case law, including polemical examples and criticising shortcomings. He made a number of suggestions to strengthen this constitutional safeguard for the common citizen.", "comment_count": 0, "id": 2156}, {"keywords": "Gozo", "author": "", "article_body": "Carnival is undoubtedly one of the most colourful events in Gozo. Carnival provides five days of revelry with many people dressing up in colourful costumes and wearing masks. The main activities took place at It-Tokk (Independence Square) and in Nadur. Victoria’s celebrations were the usual carnival fare, much like those in Malta, with floats, costumes and merry-making.", "comment_count": 0, "id": 2157}, {"keywords": "Gozo", "author": "", "article_body": "• The feast of St Gregory the Great will be celebrated in Kerċem today. Gozo Bishop Mario Grech leads a Pontifical Mass at 9am. A procession with the saint’s statue, led by Mgr Franġisk Sultana, will leave the church at 5pm with the participation of the St Gregory Band of Kerċem.\n• The Friends of the Sick and Elderly in Gozo are organising a charity sale at the private road between Gozo Colleges off Fortunato Mizzi Street today from 7am to 1pm. The cost is €10 per car space.\n• Creed II (12A) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n• A blood donation session will be held at Xewkija District Health Centre on Tuesday from 1pm to 5pm.\n• Il-Fergħa Ewkaristika (Gozo) will be holding an hour of adoration at Our Lady of Pompeii church, Victoria, on Thursday from 9am to 10am. Rosary will be recited at 8.45am. Everyone is invited.\n• Films to be shown at Don Bosco Oratory on Children Cinema Day on Saturday are How To Train Your Dragon: Hidden World (PG) at 2pm and Bumblebee (12A) at 4pm.\n• The 13th edition of Gaulitana: A Festival of Music continues this week.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 2158}, {"keywords": "Education", "author": "", "article_body": "Final-year Executive MBA students taking the Entrepreneurship and Innovation elective with Nathaniel Massa at the University of Malta’s Faculty of Economics, Management and Accountancy recently completed feasibility analysis projects for start-up business ideas or intrapreneurial concepts. The concepts ranged from lifestyle, convenience-oriented and health related services, to tech-based sourcing and mobility solutions.\nThe students’ semester-long, team-based applied business start-up projects formed an integral part of the elective. It entailed identifying a novel business idea or concept targeting a market need or value generation potential. Following fine-tuning, the MBA participants worked in teams researching and undertaking a full feasibility analysis under the guidance of Dr Massa.\nThe teams then submitted a comprehensive feasibility report and delivered a final presentation pitch, including working prototypes and live demos. Together with Maltese participants, the students in this year’s cohort included those of Indian, German, Italian and Russian nationalities.\nIn order to assess their respective product’s technical, market, organisational and financial feasibility, as well as conduct a competitor analysis for their business start-up concepts, they engaged in extensive research, in various instances conducting surveys, focus groups and leveraged contacts and networks, including technical expertise.\nParticipants are now looking into the prospects of possibly taking their enterprise idea further\nDuring the semester, the MBA start-up project teams also had the opportunity to stress-test and present their early-stage ideas to a panel of seasoned professionals at a Global Entrepreneurship Week event. The professionals hailed from areas associated with mentoring, foresight and creativity, knowledge management and IP, crowdfunding, and business consulting and are active in the entrepreneurship scene.\nThe event was part of a broader international network spanning 170 countries powered by the Kauffman Foundation, hosted locally by the University of Malta’s Edward Debono Institute.\nThe Executive MBA cohort was also hosted by Takeoff, the University’s incubator and start-up facilitator, and given an overview of the support and facilities on offer.\nFollowing the Executive MBA entrepreneurship project, various participants are now looking into the prospects of possibly taking their enterprise idea further.\nParticipants in the Executive MBA programme are mostly professionals active in industry and various enterprise sectors, generally in management and executive positions, as well as practitioners in specialist and technical roles. Their exposure and diverse experiential knowledge contributes to the applied learning environment fostered by the Faculty and its multi-faceted team of expert and engaged practising academic staff on this part-time evening master’s programme.\nThe programme is tailored for practicing professionals, managers, executives and others aspiring to stretch their competencies and extend their skill-sets, strategic foresight, execution and leadership capability.\nBeyond prospecting higher positions of responsibility within corporate environments, the Executive MBA offers participants an equally sound foundation and critical insight towards effectively growing and running one’s own business in increasingly competitive, globalised contexts.\nFor further information on the Executive MBA programme call Sandra Said Zammit on 2340 2702 or e-mail sandra.said-zammit@um.edu.mt.", "comment_count": 0, "id": 2159}, {"keywords": "", "author": "Jacob Borg", "article_body": "Foreign Minister Carmelo Abela has earned a stiff rebuke from the association of Kosovo journalists during a visit to the country this week.\nMr Abela said during the visit that both Malta and Kosovo share the same European values.\nIn a statement, the association of journalists said that Mr Abela could earn the right to preach about the respect of European values only once journalists in Malta were protected and the Daphne Caruana Galizia case was solved.\nThe association expressed its solidarity with Maltese journalists and appealed to the Maltese State and government to shed light on the assassination as soon as possible.\nIt noted that over 500 days had passed since her murder in October 2017.\nAllow a public investigation\nThe journalists said the mastermind behind the car bombing was still unknown, and Prime Minister Joseph Muscat continued to reject requests by her family for a public inquiry.\n“The association appeals to Minister Abela and Prime Minister Muscat to shed light on her murder, allow a public investigation as requested by the family, and ensure that Maltese journalists are adequately protected,” the statement read.\nIn a jibe at the Foreign Minister’s statement about European values, the association said one of the key values of the EU was the right to freedom of expression and protection of journalists.\n“Every attack against journalists is an attack against public interest, democracy and the rights of all citizens,” the association said.\nThree men have since been charged with planting and detonating the bomb that killed the 53-year-old journalist.\nForeign investigators have questioned the reluctance of the Maltese police to proceed against more suspects, believed to be between three and five men.\nThe Sunday Times of Malta reported last month the people “who were involved at the commissioning stage” of the murder have been identified but there are different opinions among Maltese investigators as to whether there is enough evidence to prosecute.\nA local source said arrests would follow once all the necessary evidence was in place.", "comment_count": 118, "id": 2160}, {"keywords": "", "author": "", "article_body": "An area of fog and mist covered parts of Malta and Gozo on Saturday afternoon.\nSea fog forms when a warm and moist air mass from the south moves over a cooler area of sea. As the air cools, the temperature falls to dew point, with the air becoming saturated and its water vapour condensing. \nWhen winds are light, the result is sea fog, explained Maltese Islands Weather site administrator Andrea Muscat. \nMistra Bay. Photo: K E Lewins\nA light wind allowed the air mass to slide slowly over the cooler area of sea, increasing the chances of saturation and condensation.\nNormally, sea fog dissipated as it moved inland.\nHowever, given that the air on land was very similar to that of the sea at this time of year, the fog may persist inland, Mr Muscat said.\nThe phenomenon hit the islands two weeks after a devastating storm left millions of euros worth of damage across the island. \nDo you have pictures to share? Send them to us on mynews@timesofmalta.com\nSt Paul's Island. Photo: K E Lewins\nFog over Valletta. Photo: Anna Cassar\nPhoto: John Bonello Ghio\nAs seen from Mellieħa. Photo: Anatole Scerri Diacono\nDwejra. Photo: Chantelle Shaw\nA sailing boat can be barely seen in this photo taken from the coast of Sliema. Photo: Doriana Mamo", "comment_count": 0, "id": 2161}, {"keywords": "", "author": "Jacob Borg", "article_body": "A member of the national broadcaster’s editorial board, which is tasked with ensuring the station’s impartiality, has publically endorsed a Labour MEP candidate.\nThe candidate and former L-Orizzont editor Josef Caruana this week unveiled a video endorsement by Charles Flores, in which the PBS editorial board member starts off by speaking about how impressed he was with Mr Caruana’s professionalism and determination when he used to edit L-Orizzont.\n“I am convinced that in European politics, Josef Caruana will be offering and providing the same tenacity, determination, loyalty and professionalism,” Mr Flores says in the video clip.\nCharles Flores's endorsement was filmed.\nIn the 50-second clip uploaded on Mr Caruana’s Facebook page, the PBS editorial board member speaks about how he got to know the MEP candidate through L-Orizzont.\nMr Flores used to have a regular column in that same paper.\nHe has since switched to writing in The Malta Independent, frequently providing scathing commentary about politics.\nReplying to questions by Times of Malta about the video endorsement, editorial board lawyer Joseph Refalo said that while the situation was not desirable, Mr Flores did not endorse or support a party, but spoke about the qualities of a candidate through his experience in journalism. \n“Mr Flores’s experience and track record in office makes him perfectly capable of remaining impartial as required by law when he has to make decisions at editorial board level, on which former PN candidate Martin Fenech also sits, and chaired by Joe Sammut who has no political affiliations,” Dr Refalo said.\nMartin Fenech is one of the legal aid lawyers defending Alfred Degiorgio, who is accused of carrying out the car bombing on journalist Daphne Caruana Galizia.\nPBS has long been seen as a tool wielded by Nationalist and Labour governments alike to push their agendas and steer clear of controversial issues raised by the independent media. \nA 2017 election monitoring mission by the OSCE had suggested revising the rules for the appointment of members of the broadcasting regulator and PBS management in a manner which enhances independence, so as to increase public trust and foster representation of wider political and societal interests.", "comment_count": 27, "id": 2162}, {"keywords": "", "author": "Claire Caruana", "article_body": "Europe is finally experiencing a “shift of awareness” on climate change, the Greens’ lead candidate Ska Keller believes. \nAddressing a press conference on Saturday morning, together with Alternattiva Demokratika chairman Carmel Cacopardo, Ms Keller expressed satisfaction that Europe was finally coming to the realisation that something had to be done to address climate change issues. \nWhile pointing out that it would have been better had countries acted on climate change before, Ms Keller pointed to the massive storm that battered the Maltese islands at the end of last month as an example of how much the issue was impacting everyone. \nGiving an outline of the party’s main rallying call for the upcoming European Parliament elections, Ms Keller said that while environmental issues would remain at the top of the Greens’ agenda, there were a number of other issues that would also be addressed. \nSocial issues, she said, were very important to the party, insisting that certain minimum standards on such issues should be secured for all European citizens. \n“We do not have rules on minimum wages, on no citizen going without healthcare…the way forward is to have those social targets and that we ensure that these are in place for everyone,” the candidate said. \nDemocracy would also be among the key issues addressed by the party, she said, since “in many states, the rule of law is under threat”. \nOn his part, Mr Cacopardo said that the party’s local manifesto would be launched soon, pointing out that this would focus on a number of “pressing issues” such as accountability and the issue of regulating lobbying.", "comment_count": 4, "id": 2163}, {"keywords": "", "author": "Denise Grech ", "article_body": "A man accused of raping a woman in February in St Julian’s was released on bail on Saturday.\nAhmed Hamed, 22, was charged with raping the Spanish woman while they had gone out for a walk after a night in Paceville.\nThe unemployed man, 22, from Syria, was charged with raping and sexually abusing the victim.\nThe accused and the alleged victim had been drinking in a bar before going for a walk, the court heard. \nThe accused was arrested after being identified by the victim in Paceville. Inspector Matthew Spagnol said the accused did not recognise the victim. He pleaded not guilty.\nIf granted bail, the man would go live with his cousin, as he was living in shared accommodation at the moment, defence lawyer Noel Bianco said.\nBail was granted on condition that not to approach the victim and to sign the bail book twice a week. He was also ordered not to go to St Julian's or Paceville.", "comment_count": 0, "id": 2164}, {"keywords": "", "author": "Denise Grech ", "article_body": "There was commotion in a court room on Saturday as the mother of a 23-year-old man wept in court as her son stood accused of domestic violence.\nThe woman walked into court red in the face and as she sat down behind her son hearing the accusations.\nThe man, born in the US and living in St Julian’s, was arraigned over allegations he slightly injured his partner, who he was not living with at the time.\nThe court heard that the woman filed a police report on Friday evening saying the man had injured her slightly. Police arrived on the scene and deemed the situation to be \"high-risk\".\nThe accused pleaded not guilty as defence lawyer Franco Debono turned to inspector Matthew Spagnol insisting he ask to woman to give the accused some peace and quiet.\nThe court granted bail against a personal guarantee of €5,000.\nThe man was also ordered to sign the bail book and to refrain from making contact with the victim. ", "comment_count": 0, "id": 2165}, {"keywords": "", "author": "", "article_body": "Insurers are still collecting data on the damage caused by the massive storm at the end of last month, Times of Malta has learnt.\nDubbed the worst since 1982, the storm that battered the islands during the last weekend of February caused damage everywhere, so much so that insurers are still grappling with claims.\nRead: 'Worst storm since 1982' saw record gusts of 133km/h\nIn comments to the Times of Malta, insurers’ association head Adrian Galea said that it was still “too early” to establish the amount that would be claimed adding that the data is yet to be received.\nWhile insurers also had to establish what the claims would be, Mr Galea said that he expected the majority to be related to buildings and their contents, building sites and vehicles. He again insisted it was still “early days” and he could not yet say for certain what would be claimed.\nStill too early to establish the amount that would be claimed\nAccording to the government, following the storm, it was urgently carrying out an assessment to quantify the damage and would seek funds from the EU, if eligible.\nMalta tapped into the fund in 2004, when it received over €960,000 to help deal with floods in September 2003.\n\nIn 48 hours, the Civil Protection Department received and assisted in 486 calls. In some cases it was backed by the police and the army. A total of 14 people were evacuated in Sliema and 12 from two different areas of Vittoriosa.\nThe damage was mostly felled trees, demolished walls, water tanks, PV panels, collapsed roofs and balconies and downed masts and wires.\nThe storm saw wind gusts reach a record 72 knots or 133km/h.", "comment_count": 3, "id": 2166}, {"keywords": "", "author": "Denise Grech ", "article_body": "There is nothing to show that an underwater tunnel will effectively address Gozo's challenges at this stage, 13 NGOs said on Saturday, as the controversial project looms on the horizon.\nThere was also nothing to show that the tunnel's social, economic and environmental impacts will be sustainable, they added, saying they feared authorities were not taking a decision based on evidence.\nThe government said last December a call for tender for the Malta-Gozo tunnel project is expected to be published within the next six months.\nThe current proposal will lead to the creation of a 13km-long tunnel with a seven metre radius and one traffic lane heading in either direction, with an additional safety lane.\nTraffic analysts predict that around 6,500 vehicles will use the tunnel on a day-to-day basis.\nSpeaking at a news conference in front of the parliament building, Gozitan Julia Camilleri lamented the lack of public information saying people did not have access to the studies the government kept citing.\n“Buses were not reliable and I had to resign myself to live in Malta. I’m lucky I do not need to go to Gozo everyday, but I know people in those situations,” she said.\nThe public still does not know why a fast ferry option has not been studied, Ms Camilleri added.\nA decision on whether the tunnel is the best solution should only be established after serious studies are carried out and after a public consultation, the NGOs said.\nThe NGOs addressing the news conference.\nWatch: Gozo tunnel will be built and run by the private sector\nTunnel will only damage the environment further\nMalta’s environment is already depleted and problems will only worsen with the tunnel, Ingran Bondin from the Ramblers' Association feared.\nArable and natural land will be eaten up for the tunnel’s two entrances and the authorities have to somewhat cater for the unprecedented volume of one million cubic metres of waste generated from the tunnelling.\nThe traffic going to Gozo may become four or five times worse with traffic, he added.\nThe NGOs called for a strategic environmental assessment to compare the tunnel to other options and the Maltese public and stakeholders needed to be informed.\nThey wanted to know the impact on the road network and whether the construction of a tunnel would turn Gozo into a Maltese suburb instead of an island in its own right.\nThe authorities were acting like the discussion is over, when in reality it has not even begun, they lamented.\nThe NGOs who joined foreces were the Ramblers Association, Din l-Art Ħelwa, Archaeological Society Malta, Moviment Graffitti, Birdlife Malta, Kamra tal-Periti, Nature Trust Malta, Flimkien Għal Ambjent Ahjar, Friends of the Earth Malta, Għaqda Siġar Maltin, Isles of the Left, Bicycle Advocacy Group and Żminijietna.\n ", "comment_count": 133, "id": 2167}, {"keywords": "", "author": "Sarah Carabott in Brussels", "article_body": "While gender quotas prove effective in most scenarios, it was up to Maltese youths to push for gender balance in Parliament, according to the head of the EU’s centre on gender equality.\nVirginija Langbakk told the Times of Malta that a European Institute for Gender Equality (Eige) study on the upscaling of low-skilled women had flagged a challenge in Malta where a whole generation of women who had been expected to skip tertiary education and take care of their family, had missed out on reaching their full potential and as a result will be receiving low pensions.\nBut while that particular generation of women might not have been interested in joining political parties as a consequence of traditional expectations, it was time for the younger generation to bring about balance, the director of the Eige said.\nMs Langbakk was speaking to the Times of Malta during a European Parliament seminar on the occasion of International Women’s Day, where it was noted that the glass ceiling was also present at EU institutions, with women being nearly absent from roles above middle management.\nMeanwhile, only 36 per cent of European Parliament members are women – up from 17 per cent 40 years ago. Finland tops the list with 77 per cent of its MEPs being women, while only one out of the six Estonian and Cypriot MEPs are female.\nMalta currently shares fourth topmost place with Sweden, as half of its MEPs are women.\nWhen the European Parliament elections were held in 2014, four out of the six elected Maltese MEPs were women, however, only 10 out of the 67 current national MPs are female, placing the island second-to-last in political representation by women in the EU.\nThe share of women in national parliaments in the EU28 is around 30 per cent.\nAsked whether gender quotas could work in Malta, Ms Langbakk noted that there was no single answer to whether quotas were the best way to introduce balance. However, out of the nine EU member states that had introduced quotas, eight (except for Croatia) had seen an increase in the share of women in Parliament.\nNonetheless, quotas were an interim solution as they kicked off a discussion and forced decision makers and party leaders to start actively looking for alternatives.\nSo what would be the solution for Malta to create some balance?\nApart from party leaders and gatekeepers kicking off a discussion, the younger generations should be supporting women in politics, talking about women in politics, and participating in politics themselves, she said.", "comment_count": 8, "id": 2168}, {"keywords": "", "author": "Claire Caruana", "article_body": "The increase in Malta’s minimum wage this year was the lowest when compared to those of all other European countries, a review by a European Union agency has established.\nThe agency, Eurofound, published preliminary findings ahead of its annual minimum wages review, which will be released later on this year. Eurofound is a European Union agency that oversees the improvement of living and working conditions in Europe. \nAccording to the fresh findings, while the majority of the EU countries increased their minimum wage rates between this year and last year, the rate of increase varied significantly between different member states.\nAccording to Eurofound, the hourly rate of Malta’s minimum wage went up from €4.25 last year, to €4.33 in 2019.\nWhile Malta’s minimum wage was classified as “medium level”, alongside that of Portugal, Spain, Greece and Slovenia, the agency noted that the island’s increase was notably lower than the rest of these countries.\n“Percentage increases were lowest in Malta (+1.9 per cent), followed by Portugal (+3.5 per cent) and Slovenia (+5.2% per cent),” the agency pointed out, adding that both Spain and Greece had “exceptionally high changes” this year.\nIn Spain, the minimum wage increased by 22 per cent while in Greece it went up by 11 per cent.\nIn Spain, the minimum wage increased by 22 per cent\nOfficial EU data issued last month showed that the average minimum wage across the EU was €924 – a far cry from the €762 earned by minimum wage earners in Malta.\nBulgaria has the lowest gross minimum wage across the EU, at just €286, while Eastern European member states had minimum wages of between €400 and €600 a month.\nRead: Minimum wage to go up €8 per week by 2019\nIn 2017, an agreement was signed by unions, social partners and political leaders to increase the minimum wage by €8 per week. That year, just under 4,000 people were on the minimum wage.\nNGO Moviment Graffiti had noted the increase would only kick in once workers completed two years of employment, meaning it did not really raise the statutory minimum.\nBack in 2012, Prime Minister Joseph Muscat had called for the introduction of a “living wage” – a calculation of how much money a person needs to live a decent life – that would be significantly higher than the current minimum wage of €158 per week. Dr Muscat had later said it was “irresponsible” to raise the minimum wage.\nContacted for a reaction, the General Workers’ Union told the Times of Malta that as a member of Eurofound, it had reviewed the report.\nThe increase, the union said, is based on a mechanism agreed to by all social partners.\n“In our view the increase is not adequate and the whole concept needs to be revamped. This issue further resolves our commitment that the best way to tackle wages is by having all employees in a union of their choice so wages and working conditions can be improved,” a union spokesman said.\nThe spokesman noted that, with a revamp of the whole mechanism, different measures can be implemented, such as the concept of the living wage.\nOn whether the government was doing enough to address the issue, the union spokesman said that this is not just the responsibility of the government. \n“It is the responsibility of everyone, all political parties, social partners and NGOs. We need to discuss a way forward to help those most vulnerable, if we want to have a healthy society. This is what social mobility is all about”.\nQuestions sent to the UĦM– Voice of the Workers remained unanswered.", "comment_count": 92, "id": 2169}, {"keywords": "", "author": "", "article_body": "Prime Ministers should serve for no longer than two terms and MPs should retain their seats for no more than four parliamentary terms, according to Joseph Muscat.\nDr Muscat's comments to reporters on Friday reinforced his pledge to step down before the next general election.\n“Speaking for myself, I grew tired of seeing politicians who only care about their seats and who remain stuck to them. I want to send out a message that politicians are there to serve the country for a period of time, after which they move on. Everybody has a life,” the prime minister said.\nHe said he hopes the issue of term limits should be discussed in the country's new convention. \nRead: Joseph Muscat insists: I will step down by next election\nSpeculation has been growing that Dr Muscat would rethink his decision to extend his political career, especially after a resounding electoral victory in June 2017, but his recent comments and back-room trading confirmed that a change at the top could be imminent. \nHealth Minister Chris Fearne, Transport Minister Ian Borg, and MEP Miriam Dalli are those often cited as potentially interested in the post. \nDr Muscat said he would not speculate on minister Konrad Mizzi's potential candidature for the post of party leader and eventually prime minister.\nCabinet ministers and Labour Party delegates confirmed last week that Dr Mizzi, a former deputy leader, had made contact with them to ask for their support should he decide join the contest for control of the Labour Party.", "comment_count": 253, "id": 2170}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers.\nTimes of Malta reports that the increase in Malta’s minimum wage this year was the lowest when compared to those of all other European countries, according to a new review. It also quotes Prime Minister Joseph Muscat saying that the American University of Malta has so far respected its commitments.\nL-orizzont cites official figures showing the economy grew by 6.6 per cent in 2018. The newspaper also gives prominence to a story which says a number of workers were earning less than €7,500 a year.\nIn-Nazzjon quotes Opposition leader Adrian Delia saying women should be an integral part of our society at every level. \nThe Malta Independent also puts the focus on the inauguration of the American University of Malta, saying that former Allied Newspapers managing director Adrian Hillman was representing the government on the trustee board.", "comment_count": 0, "id": 2171}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Żebbuġ local council will be meeting on Monday to discuss its position over the proposed 11-storey tower on the site of the Toyota showroom, according to mayor Sarah Agius Saliba.\nShe told the Times of Malta when contacted that the council had already discussed the matter informally but was meeting on Monday to take a definite position on the project.\nDescribing it as a “monster”, Ms Agius Saliba said the 11-storey building being proposed would be more than twice the height of the tallest buildings in Żebbuġ, which are usually limited to five floors.\n“We have already discussed it and there seems to be consensus among us against the proposal. But we shall meet again to discuss it formally,” she said.\nThe nine-person council has five Labour representatives and four representing the Nationalist Party.\nShe said that following the position that will be taken on Monday, the council will attend a meeting being called for residents on Wednesday, to inform them of the latest news on the project as well as to decide on a way forward. \nThe project is being proposed by Rohan Arch Ltd, a company held jointly by Michael and Geoffrey Debono, which was incorporated in February 2018 and registered on the Toyota Showroom address in Mdina Road. \nThe site on which the company is proposing to develop the massive project stretches on three roads: Triq l-Imdina, Triq Ġanni Bonnici and Triq is-Siġġiewi.\nAccording to documents filed with the Planning Authority, the developers are proposing the demolition of existing buildings, currently housing the Toyota showroom, parts section and the body repair centre, and the excavation for three levels of parking, the construction of parking and a “medium-rise building” for commercial and office space.\nThe project is expected to include restaurants and retail outlets at ground level, with the overlying nine floors and a receded penthouse at the top level, all earmarked for office space. A separate five-storey block being proposed on Triq is-Siġġiewi will in-clude a 1,200 square-metre supermarket at ground level with medical facilities above.\nMs Agius Saliba said Żebbuġ had experienced an increase in construction projects over the past couple of years and residents were now fed up of the situation, let alone with such a major project.", "comment_count": 34, "id": 2172}, {"keywords": "", "author": "", "article_body": "Gender based violence, inequality and low participation of women, were all issues that still required the country’s attention, President Marie Louise Coleiro Preca said on Friday.\nSpeaking on International Women’s Day, the outgoing President said the country still needed to make a mental shift when it came to gender equality and for a culture of inclusion could truly take hold.\nWomen’s day, she said, gave the country the opportunity to celebrate women, but also served as a reminder of the challenges that remained.\nThis was a chance to take stock of where Malta stood as a country on the matter of equality.\nEarlier, Equality Minister Helena Dalli launched proposals for an equality action plan aimed at weeding out gender discrimination.  \nThe empowerment of women, President Coleiro Preca said, had been a priority throughout her five-year term as head of state.\n“I am proud that we managed to bring women’s groups together on one platform,” she said, referring to empower, which was set up back in 2017.\nHer presidency had also seen the setting up of an observatory on femicide.\nPresident Coleiro Preca said she was sure there was still much to be accomplished to ensure that women were given enough visibility and that the obstacles they faced were removed.\nRecent findings published by the European Commission showed how one in three women in the EU were victims of physical or sexual violence.\nWe need to respond to this situation, President Coleiro Preca said.\nAbove all, she said it was imperative to spread a message of hope, and a vision of Malta that treated all its citizens equally whether they be men, women, boys, or girls.", "comment_count": 3, "id": 2173}, {"keywords": "", "author": "", "article_body": "Three men and a woman were arrested in a police drug raid in Pietà on Thursday.\nThe police said on Friday they raided a residence in Mountbatten Street, where illegal substances, including cocaine and heroin, were allegedly being consumed.\nDuring the raid the police found items related to the sale of cocaine and heroin as well as cash.\nThey said the people arrested, aged between 29 and 48, attempted to destroy evidence by throwing drug sachets in acid. The men hailed from Attard, Pietà and Tarxien while the woman was from Dingli.\nAn inquiry is being held.", "comment_count": 3, "id": 2174}, {"keywords": "", "author": "", "article_body": "The government’s proposals for increased female participation in politics would not lead to women replacing men but would increase space for women, Prime Minister Joseph Muscat said on Friday.\nSpeaking on the occasion of Woman’s Day, Dr Muscat said that unless the system was shocked, change would not materialise. He said that Malta still lacked equality although it had started progressing in a number of sectors.\nCourageous decisions had helped jolt the system but political will had been required. He said that in the judicial sector, six of every 10 persons nominated - 57%, were women. Previously, only 35% of the judiciary were females. This was a silent but important revolution.\nIn the public sector, only 31% women were directors in 2012. The number had now gone up to 39%. The number of female assistant directors rose from 31% to 50%.This happened because of a clear policy that encouraged greater participation, he said.\nDr Muscat said that in a few weeks the government would be launching its proposals to encourage more women enter public and political life. He reiterated the need for an open debate including with the Opposition in the coming months.", "comment_count": 1, "id": 2175}, {"keywords": "", "author": "Claire Caruana", "article_body": "The vast majority of Maltese politicians’ websites lack adequate security, a new study has found.\nPublished by British technology research company Comparitech, the study found that 86 per cent of Maltese politicians’ website lacked basic HTTPS encryption, exposing anyone using the sites to privacy and security risks. A total of 7,600 websites of politicians in 37 countries were reviewed for the study.\n\nThe study found that more than a third of Malta’s politicians had their own website. Of these, almost all of the websites by Labour Party politicians were found not to be secure (94.7 per cent) while 70 per cent of those from the Nationalist Party did not have adequate security measures.\nPoliticians have little excuse for not properly securing their sites\nAccording to Comparitech, HTTPS encrypts data in transit so that unauthorised third parties cannot intercept and decipher it.\nRead: Japan's cyber security minister admits he's never used a computer \n“Valid SSL certificates also authenticate websites, helping to ensure voters they are on the politician’s genuine site and not a fraudulent one. Obtaining an SSL certificate and implementing HTTPS is not difficult nor expensive, so politicians have little excuse for not properly securing their sites,” the researchers commented.\nAccording to the study, Malta’s rate ranked among the bottom five of the countries reviewed, alongside those of politicians from South Korea, Poland, Hungary and Canada. At the other end of the scale, the politicians from the United States, the United Kingdom, Germany, Australia and Denmark were less likely to have websites that were not secure.\nData for the study was collected in November, the researchers said, and while information was gathered from 72 countries, information from only 37 could be included because data from the remaining countries was not sufficient.\nMany local politicians have yet to implement the HTTPS protocol on their websites.", "comment_count": 1, "id": 2176}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man has been jailed eight months and fined €1,000 over a drug-related offence dating back five years ago at the peak of carnival celebrations on the sister island.\nGozitan Ian Bonnici, 31, had been arrested back in March 2014 when his suspicious behaviour had caught the attention of officers from the Drugs Squad who were carrying out inspections in Gozo at the peak of carnival festivities.\nThe man had been spotted in the very early hours in a Suzuki Jeep parked close to a club at Victoria in the company of another man and a young lady.\nAs officers zoomed in on the vehicle, its two male occupants had at first resisted arrest.\nA personal search of the accused had yielded 14 sachets of whitish powder, later certified to be cocaine. The woman was allowed to leave the scene since nothing illicit had been found in her possession.\nA court-appointed scientific expert had subsequently confirmed the substance to be 5.94 grams of cocaine of 18% purity, which the accused claimed to have purchased from a third party.\nThe man was accused of aggravated cocaine possession, of supplying the drug within 100 metres of a place frequently visited by youngsters, as well as with relapsing.\nThe court, presided over by magistrate Joseph Mifsud, made reference to the UN Convention Against Illicit Traffic In Narcotic Drugs which states that an accused’s intent to supply drugs “may be inferred from objective factual circumstances”.\nGiven the scenario of the case, the court observed that “though not considerable in amount” the drug had been apportioned into 14 sachets.\nAlthough the accused had testified that he was a drug user, no evidence had been put forward to support this claim, nor whether he had sought treatment to overcome his addiction, the court observed.\n“The manner whereby he sought to justify this [possession of 14 sachets] did not convince the court,” declared the Magistrate, thereby concluding that the first charge had been sufficiently proven.\nNot so the second accusation, since the prosecution had failed to prove that the drug-trafficking had actually taken place within the 100-metre parameters laid down by law.\nMaking an appeal for future reference, the court called upon the prosecution to request the appointment of a court expert to draw up a plan of the crime scene, including relative measurements, “so as to do away with any doubts such as those arising in this case”.\nAs for the final accusation, the court concluded that the prosecution had failed to put forward any copies of judgments proving the accused’s previous convictions.The court declared the accused guilty and pointed out that a prison sentence and a fine were mandatory in this case in terms of law.\nThe court also ordered the destruction of the drugs.", "comment_count": 0, "id": 2177}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Malta topped the European list of the gender employment gap, according to data flagged by the European Commission’s statistics office.\nAccording to Eurostat data, the employment rate of women aged between 20 and 64 in 2017 stood at 66.5% – a total of 11.5 percentage points lower than that of men (78%).\nThe largest employment gap between men and women was registered in Malta with 24.1 percentage points, followed by Italy and Greece with 19.8 and 19.7 percentage points respectively.\nRead: Malta remains worse than EU average for gender equality\nAt the opposite end of the scale, the gender employment gap was lowest in Lithuania with one percentage point, followed by Finland and Sweden.\nCompared to data of five years before, the gender employment gap decreased in the EU by 0.7 percentage points.\nHere too, Malta topped the scales, with the largest decrease in the employment gap between men and women being recorded on the island at 7.3 percentage points, followed by Luxembourg which saw a decrease by 6.5 percentage points. \nHowever, the gender employment gap increased in 11 EU states – mostly in Hungary, Ireland and Bulgaria.", "comment_count": 2, "id": 2178}, {"keywords": "", "author": "", "article_body": "A total of 603 wine bottles on which excise duty had not been paid were found by customs officials at a shop in San Ġwann on Friday.\nIn another operation in Vittoriosa, they found whiskey bottles which had been illegally imported.\nThe department appealed to the public to anonymously report instances of alcoholic beverages without the excise duty strip on 2568 5124 or 2568 5200.", "comment_count": 1, "id": 2179}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A former Times of Malta journalist has successfully appealed two judgments ordering her to pay €10,000 by way of libel damages to the husband of Equal Opportunities Minister Helena Dalli.\nThe judgments were over a series of articles regarding a controversial Żejtun property.Caroline Muscat had been targeted by two libel suits filed by Patrick Dalli following five articles carried by Times of Malta in 2014 about illegal works carried out at a Żejtun farmhouse owned by Pada Builders Limited, a company with 99% shareholding in favour of the Dalli spouses.\nIn two parallel judgments handed down on Friday, the court of appeal declared that a series of facts reported by the journalist had been proved “substantially true,” even confirmed by testimony and photographic evidence in support of her writing.\nCiting the Bordeaux Declaration of 1954 by the International Federation of Journalists, the court pointed out that “Respect for truth and for the right of the public to truth is the first duty of the journalist”.\nA number of facts disclosed by Ms Muscat’s writings had indeed been proven, the court observed, listing the fact that illegal works had been carried out at the farmhouse situated in an ODZ area and that works were ongoing at the time when the story was published.\nMoreover, it was true that an application to sanction the works had been filed, that the property had been hit by an enforcement notice and that the case officer at the Planning Authority had recommended a refusal.\nFurthermore, the court observed that the journalist had contacted Mr Dalli before going to print.\n“This was not a case where the journalist just published facts without first communicating with the person concerned, giving the latter the opportunity to explain,” said Mr Justice Anthony Ellul presiding over the appeals.\nThe fact that Mr Dalli had denied any knowledge of the said ongoing works had been left to the readers to judge, given that it was public knowledge that the applicant lived close by to the property at issue, the court went on.Although the first court had concluded that no illegal works had been carried out at the Żejtun property, the evidence put forward had clearly indicated otherwise.After the story had first been leaked to Times of Malta newsroom by means of a photo and explanatory note from an anonymous source, a former journalist at the newsroom had snapped a photo of workmen on the roof of the Żejtun property two days before the picture was uploaded on the Times of Malta portal, captioned 'Workers captured on site Two Days Ago,' namely on November 12, 2014.The testimony of that journalist together with that of Jason Desira, who had entered into a promise of sale on the farmhouse at the time of the publication of the story, proved that works were ongoing.\nPhotos of the site had even shown machinery, including a bobcat and a truck, which served as further proof of said works, the court said.\nRead: Patrick Dalli submits new plans for Żejtun farmhouse\nAs for Mr Dalli’s complaint of having been unduly defamed by Ms Muscat’s writing, the court questioned the applicant’s concern when years before he had carried out “considerable development at the site, not in conformity to the development permit,” consisting of some 120 square metres of floorspace in excess of that approved.\n“It was evident that when originally doing all that development without a permit, the applicant did not bother to safeguard his reputation nor that of his wife, a member of Parliament and hence a public person,” the court observed.\nNow he had no right to complain of damage to his name, the court went on.\nAs for the reference to “hidden assets,” the court said that this had clearly referred to the minister and not her husband, explaining that in terms of the MPs Code of Ethics, the minister was not bound to declare the immovable property of the company in which she held shares.\n“A journalist has a duty to investigate and report on matters of public interest,” declared Mr Justice Ellul, adding that although Minister Dalli was not an entrepreneur she had a “substantial patrimonial interest in PADA Builders Ltd and hence there was nothing irregular in her being subjected to scrutiny and criticism”.\nThough not a public figure, Mr Dalli was married to a high-ranking government official who was the target of the report, the court said. “Were it otherwise, the report would have had little news value.”\nUnfortunately, the first court had “taken on board,” the applicant’s “pure speculation,” the court remarked.\nWhile upholding the appeals and declaring that the articles were not defamatory, the court ended its judgment with a word of praise for the minister concerned remarking upon her “political maturity” by not “rushing to knock at the court’s door but accepted all criticism leveled against her,” thus serving as a “classical example of how the law of libel was not to be used by a public figure as a political weapon to suppress freedom of expression”.\nLawyers Paul Micallef Grimaud and Stefan Frendo were counsel to Ms Muscat.", "comment_count": 0, "id": 2180}, {"keywords": "", "author": "", "article_body": "A pro-choice coalition, made up of civil society organisations and individuals who want to campaign for reproductive rights and justice in Malta has been set up.\nThe Voice for Choice coalition will be campaigning for the decriminalisation of abortion and advocating for laws that ensure the health of pregnant women is protected and in line with international human rights standards through proper abortion care.\nIn a statement on Friday, they pointed out that abortion in Malta continued to remain criminalised under all circumstances. Still, the reality was that women in Malta were still seeking and having abortions at a financial and social cost, as well as at the cost of their physical and mental health, amid fear, stigma and shame.\nRead: Abortion Support Network expands service to Malta\nSocial policy academic Andrea Dibben said abortion was still a reality in Malta, but one for which women were paying a hefty price.\n“We are here to ensure every person is helped and protected, whatever their choice,” she said.\n“We want to add pressure to ensure that women have access to reproductive healthcare and that our reproductive laws are on the same level as international ones,” Dr Dibben said.\nShe stressed that women should not be considered criminals for terminating their pregnancy.\n“There are a lot of myths and this is a topic we could not talk about when we were younger,” Dr Dibben said.\nThe launch, she explained, was an invite for the government and policy makers to join the conversation surrounding abortion.\nIn the last decades, Malta made great strides to be a more inclusive society so it was also time for laws related to abortion to follow suit, the organisation said.\nVoice for Choice said it had launched its campaign to strive for a society based on equal respect and justice free from discrimination for all genders and minority groups.\nIt wanted to ensure that barriers in accessing sexual and reproductive health and rights were removed, promote equality in the area of sexual and reproductive health and rights, and remove shame and stigma related to sexual and reproductive health and rights.\nThe coalition will be organising activities to raise awareness in the community and combat the stigma and shame surrounding abortion, providing up to date information to support evidence-based policy.\nRead: Women should have access to abortion in at least four circumstances - paper says\nA social media campaign called '50 abortion myths: Get the facts straight' is being launched on Saturday.\nThe coalition’s founding members are: Women’s Rights Foundation, Men Against Violence, Moviment Graffitti, Malta Humanist Association, Integra Foundation, Aditus Foundation, and co-founders Francesca Fenech Conti, Jelena Bezzina and Liza Caruana-Finkel.", "comment_count": 45, "id": 2181}, {"keywords": "", "author": "Claire Caruana", "article_body": "The European Parliament’s financial crimes committee has concluded that Malta, together with six other EU member states, displays “traits of a tax haven” while also facilitating “aggressive tax planning”. \nIn a report which has just been adopted, the Special Committee on Financial Crimes, Tax Evasion and Tax Avoidance (TAX3) listed a series of recommendations as part of efforts to ensure “fairer and more effective taxation” and better tackling of financial crimes.\nIt noted that the European Commission had criticised seven member states – Malta, Belgium, Cyprus, Hungary, Ireland, Luxemburg and the Netherlands – for shortcomings in their tax systems, adding they “can be considered as jurisdictions facilitating aggressive tax planning globally”.\nThe report will now be passed on to the European Parliament for discussion during the second March plenary session in Strasbourg later this month.\nThe committee also called for the so-called golden visas and passports to be phased out as these were deemed “problematic”.\nRead: MEPs urge EU Commission to regulate golden visa programmes\nOn the island’s cash-for-passports scheme, the committee noted that, together with Cyprus, Malta operated a programme that potentially posed “a high risk to the integrity of common reporting standard”.\nCitizenship schemes like the one operated in Malta have long come under fire by European institutions. In January, the European Commission had said in a report that such schemes posed security, money-laundering and corruption risks. MEPs have, on several occasions, urged the Commission to regulate such programmes, arguing it was no longer acceptable to dismiss the issue as a national one.\nFielding questions from MEPs at an exchange of views during a TAX3 meeting last month, Justice Minister Owen Bonnici described Malta’s scheme as one of the most transparent, saying the government published the names of individuals who obtained citizenship and carried out rigorous due diligence checks, which, he said, were also public.\nRead: Fact-checking Owen Bonnici's claims to MEPs\nNames of those who obtain citizenship through the scheme are included in a general list of people who become Maltese citizens over a one-year period. The list, published by the government, does not identify which of these new citizens bought Maltese and EU citizenship under the cash-for-passports scheme.\nAccording to figures published by Eurostat this week, 23.5% of the citizenships were granted to people from Russia, followed by those from Saudi Arabia (17.3%) and the United Kingdom (9.9%).", "comment_count": 47, "id": 2182}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Polish man caught in the act of importing a kilo of cocaine two years ago was jailed nine-and-a half years and fined €23,000.\nPatryk Henryk Stawicki, 25, had been facing criminal proceedings over the illegal importation and aggravated possession of the drug.\nThe man had been arrested upon his arrival at Malta International Airport after being checked by officers from the Drugs Squad and customs, who had discovered 100 capsules of cocaine in his possession.\nThese amounted to 957 grams of the substance.\nFour months later, in the course of compilation proceedings before the Magistrates’ Court, the accused had registered an admission, bringing into play a legal mechanism whereby the Attorney General and the defence counsel could request the Criminal Court to mete out punishment agreed upon between the parties.\nThe Criminal Court, presided over by Mr Justice Giovanni Grixti, in view of the amount of drugs involved and also the punishment handed down by local and foreign courts, upheld the parties’ joint application.\nIt further ordered the confiscation of the accused’s property, movable and immovable, as well as destruction of the drug.", "comment_count": 0, "id": 2183}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Comments by a consultant gynaecologist that a number of rape claims are made up and that he has not come across a single pregnancy as a result of rape have outraged human rights activists.\nIvan Galea, who took part in a students’ debate on abortion at the University of Malta, initially came under fire by activist Francesca Fenech Conti for allegedly claiming that rape cases in Malta were fake and that women claim they were raped for insurance purposes.\nRead: 47% of Maltese believe women 'exaggerate' rape, abuse claims\nPosting in the Facebook group 'Women for Women', she said his comments were \"hilarious and scary\" at the same time.\n\"If some of our doctors who worked in hospital spoke this way, then it was really worrying,\" she added.\nHowever, Dr Galea claimed he had either been misunderstood or those making the allegations were deliberately twisting the facts.\nIn a Facebook post, he said that in his 21 years of practising obstetrics, he had never come across a pregnancy from rape.\n“This doesn’t mean it doesn’t happen, but it must be rare... It is a fact that not all claims of rape are real. That is why a civilised society like ours has institutions in place to investigate claims of rape.”\nHowever, Lara Dimitrijevic, who heads the Women’s Rights Foundation and also took part in the debate, confirmed Dr Galea's comments about insurance claims.\nShe knew of at least seven women who had fallen pregnant, were raped by their partners to intentionally impregnate them, or as a couple of them put it in court, ‘ġibta red hot biex toqgħod’ (I turned her on so she remains obedient) or ‘dik posta fil-forn bħal tal-ħobż’ (her place is in an oven like a loaf of bread).\n“So with all due respect, as a professional, especially one coming from the medical field, to come out publicly with such comments is nothing but a disgrace and an insult to women,” she wrote on Facebook.\nAcademic and activist Andrea Dibben also took exception to the doctor's comments about insurance claims as well as his doubts as to why women were afraid to report rape.\nShe said that when she was running a shelter for homeless women between 2003 and 2005 as a social worker, she had met five women who got pregnant from rape or incest.\n“I also know of two women from my personal circle. So no, it is not rare, you are just living in a bubble of privilege.”\nDr Dibben also flagged the fact that Malta has the highest rate in Europe (47%) of people who believe that ''women make up claims of rape''. Malta also the highest rate (20%) of people in Europe who believe rape is justified if the victim was wearing sexy or provocative clothes.\nNo, it is not rare. You are just living in a bubble of privilege\nOther social media users commented that if the doctor made his opinions public this way, pregnant patients would be reluctant to tell him they were rape victims for fear of judgement.\nHis comments on Facebook that rape victims should file a police report and that they had no reason to fear any repercussions, angered people even further. \nDemocratic Party MEP candidate Cami Appelgren noted that as victim of \"close relationship abuse\" his words were a reminder of why women feared reporting.\nRead: Three out of four women are sexually harassed at work and one-third believe victims have themselves to blame\nThe comments are not being aired by KSU\nAlthough the students’ council put up a video of the debate, the footage omits Dr Galea's alleged claims.\nKSU President Carla Galea told Times of Malta student organisations had agreed beforehand that only the panel discussion would be made public.\nDr Galea, she said, was speaking ahead of the debate, during “an intervention by medical experts” invited by KSU from the pro-life and pro-choice camps.\nMeanwhile, noting that she had never called him a monster as he had implied, Ms Fenech Conti told Times of Malta it was very disappointing that a debate where doctors were specifically invited to speak the truth and mention medical facts had not been recorded.", "comment_count": 120, "id": 2184}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat has said he is hopeful that more students will flock to the American University of Malta in the coming years, comparing the campus to a start-up. \nAlmost two years after it first opened its doors, an official ceremony on Friday inaugurated the Cospicua campus, which according to the AUM currently hosts fewer than 100 students. \nDuring Friday's ceremony, guests outnumbered the roughly 60 students in attendance. \nIn his speech, Dr Muscat said that despite criticism about enrolment numbers, the university was now gaining traction.\nHe reiterated that a campus planned for Żonqor would still be built, but only once the Cospicua campus was full. He did not reply to questions about how many students that would take. \nWhen questioned, Dr Muscat said he had no problem with the government nominating Adrian Hillman as its representative at the university.\nMr Hillman previously served as managing director at Times of Malta publishers Allied Newspapers before quitting after being accused of having received secret payments from a company owned by Dr Muscat's chief of staff, Keith Schembri. \nMr Hillman and Mr Schembri are currently the subject of two magisterial inquiries, after the FIAU found that they were involved in suspicious money laundering activities. \nAUM has been mired in controversy since its inception. Originally, the Prime Minister announced that the university would open its doors in September 2016 with more than 300 students in the first year.\nHowever, the opening was delayed by a year and only a handful of students were attracted in the first academic year.\nThe AUM also scaled back its operations, dismissing all its faculty just a few days before their six-month probation was up.", "comment_count": 139, "id": 2185}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man in the midst of separation proceedings was granted bail after he allegedly assaulted his wife following an argument over their daughter.\nThe court heard the incident took place on Thursday morning when the woman refused to discuss their child’s medical needs.\nThe 46-year old Marsascala father was arraigned under arrest on Friday morning.\nProsecuting inspector Joanna Piscopo told the court that the man had apparently visited his wife’s residence to check upon the couple’s six-year old daughter who was unwell.\nIn view of the child’s condition, the father had knocked on the woman’s door to discuss whether the girl ought to be taken to a doctor or to hospital. However, the woman initially refused to answer the door.\nAn argument ensued, and the woman, a Belarussian national, filed a police report alleging she had been assaulted by her estranged husband and that he had insulted and threatened her.\nDefence lawyers Alfred Abela and Albert Libreri explained in court that the couple had been locked in separation proceedings before the Family Court for the past three years.\n“In these three years, [the woman had filed] not one application for access. In three years, this woman has not made any effort to see her children,” the lawyers pointed out.\nAfter hearing submissions on bail, the court, presided over by magistrate Doreen Clarke, upheld the request upon condition that the accused would only communicate with his wife through SMS, limitedly for the purpose of caring for their minor children, unless otherwise authorised by the Family Court.\nThe man was granted bail against a deposit of €1,000 and a personal guarantee of €3,000.", "comment_count": 0, "id": 2186}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A young man at the centre of a family incident on Wednesday afternoon was remanded in custody on Friday after pleading not guilty to having threatened his mother and sister.\nThe 28-year old Latvian was arrested after police showed up following an incident allegedly about some spilt food.\nThe man, who has previous history of domestic violence reports being filed against him, allegedly began threatening his female relatives during that argument.\nHe was arrested and arraigned over charges of having threatened his relatives, caused them to fear violence as well as breaching the conditions of a bail decree delivered in October.\nProsecuting Inspector Oriana Spiteri told the court that the man had in the past allegedly threatened his mother with a pair of scissors.\nDefence lawyer Joseph Bonnici said his client suffered from psychiatric problems which needed medical attention.\nMagistrate Doreen Clarke turned down a request for bail, noting the serious nature of the offences and the fact that the man’s only residence was the same one shared with his alleged victims.\nThe court also took note of the man’s medical problems and consequently recommended to the Director of Prisons that the accused be detained at the forensic ward.\n ", "comment_count": 0, "id": 2187}, {"keywords": "", "author": "Denise Grech ", "article_body": "It was time for a fourth, greener Industrial Revolution, Labour MEP Miriam Dalli told industry players during a summit on e-mobility held on Friday.\nStakeholders had to to rethink the current economic paradigm, keeping climate change and its challenges in mind, she said.\nThis was the time to stay ahead of the curve and create opportunity and quality jobs for people, the Labour MEP said.\nSufficient emission reductions needed to happen during the next years if final targets were to be reached, she insisted. This required a coherent policy framework that covered wide-ranging issues from vehicles, employment and electricity grids, she noted.\nMember states should decide which country they want in the next 15 years and they should have policies that deliver that transition, she said.\nDr Dalli has spearheaded efforts to curb emission targets across the EU. \nThe MEP’s ambitious plan to cut carbon dioxide emissions from cars and vans by nearly 40 per cent by 2030 was given the thumbs up by the European Union earlier last year.\nThe move had enjoyed wide-ranging support from environmentalists and every-day citizens, but the matter did go down well with Malta’s car sales lobby.\nThe Labour MEP echoed Prime Minister Joseph Muscat's wish for Malta to become a test-bed for pilot projects on clean technology.\nWe need to encourage and stimulate this move and stimulate innovation. I’m convinced that it will happen, Dr Dalli said.", "comment_count": 29, "id": 2188}, {"keywords": "", "author": "Denise Grech ", "article_body": "A lethal drug 100 times stronger than morphine and 50 times more powerful than heroin would be reaching our shores imminently, the authorities warned yesterday.\nAssistant Police Commissioner Dennis Theuma said the substance, fentanyl, was already wreaking havoc in many countries and the authorities in Malta were not taking it lightly.\n“By wreaking havoc I mean causing deaths. We are not taking this lightly,” he told a gathering of police officers and drug experts meeting to discuss how to deal with the drug that has killed numerous first responders when they made contact with it abroad.\nA medical form of the drug is already available to doctors at Mater Dei Hospital, where it is used for the treatment of chronic, severe pain and major trauma.\nIts powdered form, however, is a lethal drug that has authorities worried. \nThe biggest concern was that the drug would kill paramedics, policemen and Customs officers who could come in contact with the substance on the job.\nRead: Fentanyl - the drug that killed Prince\nIt only took two to three milligrams of fentanyl – equivalent to about one grain of salt – to slow down a person’s breathing. Its derivative – carfentanyl – was about 5,000 times more powerful than heroin. It was akin to a “chemical weapon”, chemist Emmanuel Sinagra said.\nFentanyl can enter the body by inhalation, ingestion or muscle injection. Inhalation and incidental ingestion are the greatest threats to first respondents.\nDrug experts caught wind of the opioid copycat drug about five years ago, drug expert Godwin Sammut said. This led the European Monitoring Centre for Drugs and Drug Addiction to ask member states to issue guidelines for first respondents who might encounter the substance.\nI mean causing deaths. We are not taking this lightly\n“It’s important to spread as much knowledge as possible about this problem, which will probably affect us in the months to come,” chemist and University of Malta rector Alfred Vella said during the meeting.\nDr Sammut said it was only a matter of time before the drug reached Malta. Because of the drug, nurses and paramedics were “reluctant” to help because they feared white powder could be fentanyl, he said.\n“It’s mixed with heroin but I cannot exclude that it is being mixed with other substances as well,” Dr Sammut said. “It’s a white powder, so it can be mixed with anything,” he added.\nWhile drug users were mixing fentanyl for an extra kick, they were sometimes unaware that a small amount was enough to kill, he warned.\nAdvice for first responders\nAvoid actions that could cause even small amounts of drug powder to become airborne such as removing clothing, searching, reviving and transferring a patient who has come in contact with the drug.\nDo not eat, drink, smoke or use the bathroom while working in an area with known or suspected fentanyl.\nDo not touch the eyes, mouth, nose or skin after touching a potentially-contaminated surface and wash hands thoroughly after leaving a scene where fentanyl was present.\nWear protective equipment when working in an area with known or suspected fentanyl.\n ", "comment_count": 40, "id": 2189}, {"keywords": "", "author": "Claire Caruana", "article_body": "Gender quotas were merely “numbers for statistics”, Chamber for Small and Medium Enterprises (GRTU) head Abigail Mamo insisted on Friday morning.\nSpeaking at an event by the Nationalist Party to mark Women’s Day, Ms Mamo said she first heard the term “quotas” in reference to fish.\nThe first of a series of speakers who took the stage to speak about their experiences, both as women and men, Ms Mamo insisted that discrimination based on sex, whether positive or negative, was still a form of discrimination.\nSpeaking about her experience as head of the body for the past five years, Ms Mamo said that she formed part of several boards and while as a young woman raising a family, she often faced certain prejudices, the last thing she wanted was to be met with hostility because she is given someone else’s seat.\n'Shiver down my spine'\n“Whenever I hear the term ‘quotas’, I get a shiver down my spine. The first time I heard the term quota, it was in reference to fish. Five years ago, the GRTU council, with a male majority, approached me to be CEO, not because I was a woman.\nRead: GRTU shoots down plans for 10 days of paternity leave\n“I cannot begin to imagine the reaction I would been met with had I been chosen for the role only because I am a woman and my chair was there ready for me just because of my sex,” Ms Mamo argued.\nShe went on to point out that having women on boards and other decision-making positions should be “the last thing we have”, insisting that an exercise on paper would not work.\nPrime Minister Joseph Muscat has said he favours quotas to bolster the presence of women in Parliament, insisting that more women were needed there. \nMalta has the EU's second-lowest rate of women in parliament. The event was also addressed by Life Network Foundation chair Miriam Sciberras, sociologist Albert Bell and entrepreneur Charlene Mercieca, who spoke of how their own life experiences shaped their view on the importance of equal rights for all society.\nBarriers still exist - Delia\nIn closing remarks, PN leader Adrian Delia noted that not all women enjoyed equal rights and some were facing struggles on a daily basis.\n“I would like to wish a good day to all women. But I cannot. I know that unfortunately women in Malta do not have the same rights as men, there are still barriers and we also cannot forget that there are countries were women are still objectified,” Dr Delia said.\nRead: Women are not tuna, says PD\nUrging people to understand why women’s day was still celebrated every year, the PN leader said that it was only once women were on par with their male counterparts that there would no longer be the need to mark the day.\nHe insisted that as long as women still faced certain barriers and girls were held back, the day should serve as a reminder that there was still more that society needed to achieve.", "comment_count": 11, "id": 2190}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 1pm\nA special tariff will be given to those who buy electric cars and charge them at home, Prime Minister Joseph Muscat announced on Friday.\nAddressing industry experts during the first E-mobility summit, Dr Muscat said the government was in talks with Enemalta to enrol a pilot project offering special tariffs to those charging their cars at home.\nDr Muscat used his speech to set Malta an ambitious target.\n\"We are ready to listen to proposals on how we can make the Maltese Islands the first European state running its cars on electricity,\" he said. \nAffordability was a key issue the government was studying, he said, adding the question of whether people could afford electric vehicles could not be ignored.\n\"Can authorities require a person to buy an e-car when their own car is still working?\" he asked. \"These are important questions which cannot be sidelined,\" he added.\nAnother major consideration was whether the national power grid could sustain an increase in demand, Dr Muscat said.\n\nA national consultation on clean technology was also envisaged, Dr Muscat said, adding a report on electric vehicles would be completed soon. \n\"There are barriers but innovation should hold the key to overcoming them,\" he said. \"We want to be trend-setters in Europe and in the world, changing the way we live and work,\" Dr Muscat added.\nEarlier this year, Dr Muscat had suggested Gozo as the ideal test ground for a widespread rollout of electric vehicles.\nHe also praised \"the best MEP in the European Parliament\" - Miriam Dalli - for her work in curbing transport emissions. \nThe MEP’s ambitious plan to cut carbon dioxide emissions from cars and vans by nearly 40 per cent by 2030 was given the thumbs up by the European Union last year. \nMEP candidate Peter Agius had stressed some time ago that the users of electric cars needed incentives to compensate for their consumption costs.\n ", "comment_count": 54, "id": 2191}, {"keywords": "", "author": "Ivan Martin", "article_body": "A new gender equality action plan will weed out discrimination at the workplace, Equality Minister Helena Dalli said on Friday. \nAddressing a press conference to mark International Women’s Day, Dr Dalli announced the start of a public consultation on a new action plan that aims to mainstream equal rights between genders at the workplace. \nThe plan was drafted by the newly set up Gender Mainstreaming Unit within the Human Rights and Integration Directorate, and will eventually be translated into laws that will stamp out “inherent biases that persist in society today”, the minister said. \n“The government needs to set the standard that will then be implemented by the private sector - this is our approach,” Dr Dalli said.\nShe explained that the action plan was spread across eight pillars: the right to equal treatment; equal access and opportunities and tackling the gender pay gap; financial independence, access to knowledge and education; co-responsibility and balance of work, private, and family life; access to health and general wellbeing; and intersectionality, which will aim to ensure equality for all women, no matter their unique characteristics. \nThe ultimate law will focus on amending existing legislation that retains discriminatory functions, introducing new provisions for the elimination of the gender pay gap and setting up a new structure to mainstream gender equality in society as a whole, Dr Dalli said. \nThe public is being asked to weigh in on whether the eight pillars sufficiently address the problem as well as to propose specific measures. The public can also highlight discriminatory provisions in the law for possible amendment, as well as indicate preferred models for legislative reform. \nSubmissions can be sent via email to humanrights@govt.mt or by post to The Human Rights Directorate, A3Towers, Level 0, Triq L-Arkata, Paola, PLA 1211.\nSubmissions must be received by April 8.", "comment_count": 0, "id": 2192}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Four of Malta's six elected MEPs are women, but only 10 of the 67 House of Representatives are. Does this mean anything? Sarah Carabott spoke to Miriam Dalli and Roberta Metsola on International Women’s Day.\nVoters can never elect a gender-balanced Parliament unless the number of female candidates to choose from is bigger, according to the two front runners of the upcoming MEP elections.\nWhen people have a more balanced choice they are given an opportunity to elect their representatives irrelevant of gender, Dr Dalli said. The Labour MEP pointed out that while a quarter of the candidates for the 2014 European Parliament elections were women, only 14 per cent of those running for the national election a year before were female and this dropped again to 11 per cent in 2017.\n“How can the electorate elect more female MPs if they are not given a credible choice? How can the electorate choose female MPs if female candidates are fielded on the eve of an electoral campaign? In my opinion, this is not a question of having more female MPs but, rather, of ensuring a balanced representation of society,” she said.\nRead: PD slams quotas, saying 'women are not tuna'\nDr Dalli believes more women should be attracted to politics, giving them the opportunity to gain experience and become valid candidates. If there were more female candidates, more women representatives would be elected either as MEPs or MPs, she said, adding that this was the idea behind the Labour Party’s Lead initiative, which she was heading.\nIf the electorate had more female candidates and knew what those candidates stood for, then they would have a wider choice and would not have to continue doubting whether they should choose a man or a woman because, ultimately, it was a choice about who represented constituents best, Dr Dalli added.\nDr Metsola, a Nationalist MEP, also believes there is need for political parties to have “many more” female candidates on their lists: “The issue is not with the electorate not wanting to elect female MPs but, rather, that we do not have nearly enough female candidates on certain districts on a national level. We can and we must do much better on this front.” Dr Metsola admits she hopes people choose to elect her because they think she is the best person for the job and not the best woman for the job.\nI hope people choose to elect me because they think I’m the best person for the job and not the best woman for the job – Roberta Metsola\nBoth Dr Dalli and Dr Metsola have so far sat in the European Parliament and not in the Maltese Parliament. They pointed out that being an MEP was quite a task. Being an MEP meant splitting your weeks between Malta, Brussels and Strasbourg: “You have to shuttle every single week and that is not always easy to do with a family and children, whether you are a man or a woman,” Dr Metsola noted.\nFor her, it was never a choice of one or the other, adding she felt very strongly about Malta’s place within a strong EU and always thought she could best contribute to advancing the interests of the Maltese people within the European Parliament.\nRead: Gender quotas are backed by the Constitution, says equality commission\nHowever, she noted that as an MEP she worked full-time, meaning she could dedicate her time to her constituents, which was a must when your constituency happened to be the whole of Malta and Gozo, rather than a particular electoral district.\nDr Dalli admitted that being an MEP gave her the opportunity to legislate in areas that had an impact on all EU member states. She too pointed out that an MEP had to commute every week between Malta and Brussels or Strasbourg.\n“If we do not shock the system, then everything will remain the same” – Miriam Dalli\n“I spend a lot of hours at airports and on planes and have to make sure that in the days I am in Malta I cover as much ground and meet as many people as possible. It is a juggling act to ensure I give as much importance as possible to my work in the European Parliament, my work in Malta and my family,” Dr Dalli remarked.\nEvery career had its advantages and disadvantages and it was futile to compare the working conditions of an MEP to that of a member of Parliament in a member State, irrespective of the gender, she said. \nWhat had to be ensured, she added, was that the Maltese Parliament was more family friendly, where both male and female MPs had better conditions to help them balance their work and family.\nIs it time for Malta to have a full-time Parliament?\nDr Dalli replied there was definitely a need to rethink the way Parliament functioned. If parliamentarians were to act as legislators they had to have the resources and time to do so, she added.\nDr Metsola has a more definitive reply: MPs should have the chance to do their job full-time if they so wished and that should be part and parcel of a whole range of reforms of how the Maltese Parliament functioned.\nWould gender quotas work in the Maltese scenario?\nRoberta Metsola: No. Quotas simply paper over the cracks, give a false sense of security and do nothing to tackle the underlying problem with female representation in Malta and Gozo. It is regression.\nIn my view, quotas hold women back and simply lay new barriers for the next generation of women to overcome. Our representatives must be chosen on the basis of votes and merit, not gender. We cannot and should not escape from that principle.\nMiriam Dalli: Before 2017, I was of the view that we should not resort to gender quotas. Since the 2017 election, I am convinced that if we do not shock the system, then everything will remain the same. Only yesterday, I was speaking to someone who is against gender quotas because “we have a patriarchal mentality” and it is precisely this situation that I want to challenge.\nWe should not have a “patriarchal mentality’. We should have a mentality where people who are capable of moving things forward are given a chance to do so irrespective of their gender, sexual orientation, disability or background.\nQuotas are only a temporary measure to ensure there are more female role models and for more people to understand you can deliver positive results whatever your gender. We are in this together and if we have the best people representing us as a society then we can be sure we would move forward together as a society", "comment_count": 12, "id": 2193}, {"keywords": "", "author": "", "article_body": "The construction sector grew by 10.3 per cent in 2018, beating the services industry, new figures released on Friday show.\nThe statistics, released by the National Statistics Office, give an indication of how – and where – Malta’s economy grew throughout that year.\nDuring 2018, Gross Value Added (GVA) increased by €832.4 million or 8.3 per cent when compared to 2017.\nDomestic demand was behind most of the 6.6 per cent GDP growth registered over the 12 months of 2018, contributing 5.1 per cent. External demand made up the rest.\nExports of goods and services increased by 4.3 per cent in nominal terms and 2.1 per cent in volume terms. Imports of goods and services increased by 3.6 per cent in nominal terms and by 1.3 per cent in volume terms.\nMalta’s construction sector grew by 10.3 per cent, or €37.1 million, and is now a €400 million industry. In 2011, it stood at just under €300m.\nReal estate activities grew even faster, reaching €526m from the €466m the year before.\nArts, entertainment and recreation, repair of household goods and other services registered an increase of 11.3 per cent to reach €1.6 billion while administrative and support service activities – another €1.6 billion sector - increased by €145.2 million or 9.8 per cent.The largest single increase was in the agriculture and fishing sector, which grew by a massive 24.7 per cent. That increase in what is a small sector (€111 million) however masks a steep decline in 2017, and the sector remains smaller than it was in 2016.\n ", "comment_count": 2, "id": 2194}, {"keywords": "", "author": "", "article_body": "On March 8, 2017 at about 9.40am, Gozo lost one of its most famous landmarks once and for all when the iconic Azure Window, the 28-metre high natural arch, collapsed during a violent storm similar to the one the islands experienced a couple of weeks ago.\nSeveral partial collapses had occurred over the past three decades.\nWhat remains on the second anniversary of it-Tieqa tad-Dwejra’s natural destruction are treasured memories and thousands of recorded images.\nSince its collapse, researchers have discovered photos which suggest the iconic window existed in the 1820s - 50 years earlier than previously believed - and a Russian designer has proposed rebuilding the window in steel.\nAn international call for design applications launched by the government just days after its collapse flopped, with no proposals submitted bar one by a Gozo developer to build a hotel in the area.\nTo mark the second anniversary of its fall, the Gozo Ministry and the San Lawrenz local council will be holding various activities on Sunday between 10am and 6pm themed ‘Dwejra looking beyond the fallen Azure Window’.", "comment_count": 6, "id": 2195}, {"keywords": "", "author": "", "article_body": "Updated at 12.32pm with MAPHM statement \nLegalising recreational cannabis would be giving out a very \"unhealthy and contradictory message\", mental health practitioners have argued.\nThe Maltese Association of Psychiatry and the OASI foundation, which provides drug and community services, said stronger policies guiding enforcement was needed. \n\"The state was responsible to give clear messages to the general public, but studies showed cannabis use had counterproductive effects on memory, concentration and sensorimotor activities,\" the groups said.\nThe organisations also said they were concerned with the increased availability of drugs. Treatment demand indicators show an increase in recreational drugs, mostly cocaine and cannabis.\nThe groups said there was a decrease in onset heroin use but drug use nowadays was not tied to any social strata or cohort.\n“We believe that punishing illegal use is often counterproductive, although we have encountered cases where law enforcement was a motivator towards a more satisfying and fulfilling life away of all substance abuse,” the group said.\nThey also warned users would not look into the effects of cannabis beyond the \"euphoria experienced during the period of intoxication\".\nThe groups also warned employers needed support and guidance on how to deal with cases of intoxication.\nThey reiterated calls for a Poison Unit in Emergency Departments that would monitor intoxication levels and cases in hospital. “The country needs more data,” the groups insisted.\n\"We do not believe the legalization recreational purposes will eliminate cannabis illegal supply.\"\nTheir comments echo warnings by academic Andrew Azzopardi, who argued the government's harm reduction approach to cannabis legalisation would not solve anything.\nProf. Azzopardi said regulating the use of cannabis around a harm reduction rationale would not solve anything and the dangers of the underground illicit drug trafficking would remain \"active and lively\".\nLater on Friday, the Malta Association of Public Health Medicine issued a statement backing the psychiatrists' statement. \nThe MAPHM had already come out against cannabis legalisation in the past. \nSince our last evidence-based statement, yet more research has emerged tohighlight the risk of facilitating use of cannabis by adolescents’ even at very lowlevels,\" the association said. ", "comment_count": 10, "id": 2196}, {"keywords": "", "author": "Keith Micallef", "article_body": "Democratic Party leader Godfrey Farrugia insisted they were dead set against abortion but, at the same time, would not object to having pro-abortion candidates as long as they toed the party line.\nDr Farrugia was asked to clarify the party’s position in the wake of a paper published yesterday outlining the party’s beliefs. In the document, the PD declared itself as being pro-life, pro-choice (the slogan used by the abortion lobby) and anti-abortion.\nIn its position paper, the party said it was pro-life “in a wider context than is usually understood” saying it was advocating sexual education campaigns and calling for more support to those contemplating abortion in order to avoid going for such an option.\nDeclaring itself to be pro-choice too, the PD said: “Women should have a real choice against terminating an unwanted pregnancy because their child can be taken into proper care, or they can bank on active institutional support should they decide to keep a child from an unwanted pregnancy themselves.”\nMoreover, the party said it believed in freedom of conscience and allowed its members and representatives to pursue their own beliefs and mores on such a sensitive subject.\nContacted by the Times of Malta, Dr Farrugia denied that the decision to use the term pro-choice was meant to be a vote catcher within the pro-abortion lobby.\nWatch: AD candidate calls out politicians for refusing to discuss abortion\n“One of the choices the government should be offering is the possibility to women having an unwanted pregnancy to still keep their baby but donate it to the State,” he said. Dr Farrugia, a family doctor by profession, noted he used to come across three to four unwanted pregnancies a month.\nThe party said it believed in freedom of conscience\n“If a woman is resolute in not wanting the baby it is very hard to persuade her to change her mind. Giving birth at an earlier stage would make it easier to handle her trauma, even for the simple fact that her pregnancy would be less noticeable,” he added.\n“I am as pro-life as I am pro-choice but the latter option is not just between the morning-after-pill or abortion. The right to life prevails over everything,” he insisted.\nDr Farrugia also took a swipe at the Prime Minister, saying the PD’s values and beliefs were based on principles and not to score political points.\n“Joseph Muscat at times poses as the champion of certain minority groups and exploits sensitive issues, such as his U-turn on embryo freezing, to deflect attention away from other issues,” he commented.\nThe Council of Europe’s Commissioner for Human Rights, Dunja Mijatović, yesterday denounced countries like Malta for not legalising abortion. Her remark was made in a message on the occasion of Women’s Day.\n“A few states still maintain highly-restrictive legal frameworks which prevent or limit women’s access to safe and legal abortion care and criminalise assistance given to it,” she said.", "comment_count": 14, "id": 2197}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government rejected a request to publish the memorandum of understanding it signed with the Corinthia Group four years ago, arguing it contained “trade secrets”.\nRead: Corinthia MOU signed in 2015 remains hidden\nThe request was made by Times of Malta in terms of the Freedom of Information Act, but the Tourism Ministry said the document was “commercially sensitive” and its details could not be divulged.\nThe newspaper has filed a complaint on the ministry’s denial, arguing the contents of the agreement were in the public interest since it was about valuable public land being transferred to the private sector under new conditions.\nThe agreement had been signed in 2015 but its existence only became public last December when Tourism Minister Konrad Mizzi asked Parliament’s National Audit Office Accounts Committee to approve a new deal with the hotel chain.\nDr Mizzi had planned to obtain approval during the same session, a day before the House rose for the Christmas recess, but Opposition MPs insisted on more time.\nContents of the agreement are in the public interest\nThe new agreement proposed that, in contrast with a previous deal under which Corinthia could use public land on St George’s Bay peninsula for tourism purposes, 100,000 square metres of apartments and offices for speculation could be built. In return, Corinthia would upgrade two of their three hotels there and pay a €17 million premium over a number of years.\nEstate agents had put the current market value of the land in question at about €700 million.\nThe controversial deal was shot down by the Opposition and a number of NGOs and business organisations criticised it, accusing the government of selling the island on the cheap.\nA private consortium of developers sent a legal letter to the government, making it clear that if the deal went ahead it was likely to be accused of violating State aid provisions.\nIn a move to try to unblock the impasse and avoid further criticism, the government announced it would revisit the original proposal, adding that talks on a new deal would commence. The original proposal was officially withdrawn from Parliament and no date has yet been given as to when a new draft agreement will be presented.\nIn 2015, Prime Minister Joseph Muscat and Corinthia chairman Alfred Pisani had announced a €400 million investment in the group’s three existing hotels. No mention of an MOU or a concession agreement had been made then and the project they had spoken about never took off.\nDefending the proposed deal, Dr Mizzi said the terms granted to Corinthia were identical to those given to the Seabank db Group for the site where the Institute for Tourism Studies used to stand. That deal, through which 25,000 square metres of prime land were effectively sold for €15 million, is being investigated by the National Audit Office.", "comment_count": 63, "id": 2198}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Friday's newspapers:\nTimes of Malta reports that a lethal drug 100 times stronger than morphine and 50 times more powerful than heroin would be reaching Malta's shores imminently. It also reports that former PN leader Simon Busuttil will argue in court today that the ‘institutional paralysis’ over the Panama Papers scandal breached EU laws.\nL-orizzont tackles the issue of abortion with interviews carried out with pro-choice and pro-life activists. \nIn-Nazzjon reports that students from Msida were being denied from attending their own school. \nThe Malta Independent quotes Minister Ian Borg saying that underground mass transit studies were at an \"advanced stage\". It also reports that the Manoel Island project had been approved. ", "comment_count": 0, "id": 2199}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 3.45pm, adds filing of application by Repubblika\nFormer Opposition leader Simon Busuttil will argue in court on Friday that the ‘institutional paralysis’ over the Panama Papers scandal breached EU laws, the Times of Malta is informed.\nIn a 77-page application calling for a magisterial inquiry into allegations emerging from the leaked documents, Dr Busuttil argues that the failure by various institutions to act against the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi breached the EU’s anti-money laundering directive and treaties as well as Maltese laws.\nRead: Reactions as court rejects Simon Busuttil’s request for a Panama Papers inquiry\nDr Busuttil says the country’s institutions “flagrantly and consistently” failed to act against the two top government officials over a three-year period after the Panama Papers leak revealed they opened secretive offshore structures.\nHe questions the use of bearer shares to further obscure the ownership of the Panama companies opened by Mr Schembri and Dr Mizzi as well as the mystery Panama company Egrant.\nUsing such shares was a classic layering technique used in money-laundering to guarantee the company’s owner absolute secrecy, Dr Busuttil argues in the application.\nThe use of bearer shares means the only evidence linking a person to the company is the physical share certificate. Nexia BT, the financial advisory firm that set up the three companies, negated the use of such shares.\nFlagrantly and consistentlyfailed to act\nThis is the second time Dr Busuttil will be petitioning the courts to open an inquiry into the Panama Papers leaks.\nAcknowledging that his previous attempt was quashed on the strength of an appeal filed by the Prime Minister, Mr Schembri and Dr Mizzi, among others, Dr Busuttil notes that his new application highlights facts that were not in the public domain in July 2017 when the first request for an inquiry was presented to the courts.  The application says that Mr Justice Giovanni Grixti, who had decreed against opening an inquiry, did not have access to an e-mail linking 17 Black, owned by power station investor Yorgen Fenech, to Mr Schembri’s and Dr Mizzi’s Panama companies.\nRead: Busuttil identifies ‘avenues for justice’ on Panama Papers\nThe demands for a new inquiry also refer to findings by the Auditor General that bidders in the government’s multi-million euro power station project were not treated equally.\nNexia BT is also in Dr Busuttil’s crosshairs. In his court application, he submits it was clear that managing partner Brian Tonna and its money-laundering reporting officer, Karl Cini, had misled the Financial Intelligence Analysis Unit and failed to pass on Panama Papers correspondence.\nDr Busuttil says that German journalist Bastian Obermayer, who received the Panama Papers leak, is willing to vouch for the authenticity of the e-mails that outed Mr Schembri’s and Dr Mizzi’s plans to receive payments of up to $2 million from 17 Black. \nThe application is signed by fellow Nationalist MP Jason Azzopardi.\n‹›-+Page:  /  \nRepubblika files similar application\nA similar application was later by Repubblika on Friday.\nIn its application, Repubblika listed a series of legal provisions they alleged were breached by Mr and Dr Mizzi to hide or to try to hide proceeds from crime and corruption.\n“As a civil society organisation that is committed to promoting good governance, the protection of the rule of law and the fight against corruption, we feel it is our mission as Repubblika to insist institutions do their job,” Repubblika said.\nIn this case, they argued, the police failed, the Attorney General failed, the FIAU failed and in some decisions that have been made, the judiciary also failed.\nEvery day that passed the Prime Minister also failed because when he harboured crooks, he made himself one. “Those who harbour crooks are just as crooked. This is a flagrant breach of our values and of European democratic values that uphold the rule of law.”\nRepubblika also saluted the late Daphne Caruana Galizia, killed 17 months ago fighting for the rule of law and against corruption and illegality. “Our duty is to ensure that her fight does not die with her.”\n ", "comment_count": 148, "id": 2200}, {"keywords": "", "author": "", "article_body": "Updated Friday 7.30am\nThree men and a woman were arrested following a drug raid in Blata l-Bajda on Thursday evening.\nThe police entered a private residence and asked people who lived in the vicinity to stay inside.\nThe residents said they heard shouting coming from a residence as well as the sound of glass breaking.\nMountbatten Street was closed to traffic during the operation.\nThe Armed Forces and the Civil Protection Department took part in the operation.", "comment_count": 0, "id": 2201}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Calls to address a “serious security risk” at the law courts were being ignored by the Justice Ministry and the court administration, Times of Malta was told.\nCourt employees complained of being tasked to carry large amounts of money every day from the court building in Valletta to a venue in the capital, which is not being divulged for security reasons, without the necessary security protocols and precautions such an operation necessitated. The task is usually carried out by staff members assigned to chauffeuring members of the judiciary and court marshals.\n“Every day, one of us is assigned to transport large amounts of cash in an unarmed car. The vehicle is always the same one but we do not get any protection whatsoever,” one employee lamented.\n“We take bags full of cash, without any escort, in a car that is totally rundown. We follow the same route everyday and it’s a miracle no incident has ever occurred. But this is not on,” another said.\nCash is deposited in court for various reasons, including bail, fines and fees.\nThe employees said that while some “cosmetic” investments were being made in the law courts so “the minister can run a feature on the news”, their complaints over the archaic money transfer system fell on deaf ears.\nSecurity system is stuck in the 1970s\n“The law courts’ security system is stuck in the 1970s and few things have changed. No-one can imagine the confusion and mayhem there is inside that building,” a staff member remarked.\n“The way we carry cash is just the tip of the iceberg, in terms of problems,” a court driver said.\n“The system has been the same for at least the past 20 years and on many occasions we argued that the time has come to have a private security company tasked to handle this operation. Still, no one bothers to take any action until one of us is either killed or maimed.”\n“We have informed various ministers, court director-generals, judges, magistrates and anyone we could think of about this pitiful situation but no one has bothered to take any action. We are told that our complaints are justified but that is small consolation,” another frustrated employee said.\nQuestions sent to the Justice Ministry remained unanswered at the time of writing despite reminders.\nTimes of Malta asked whether the government had any intention of changing the cash transfer system by issuing a call for tenders to engage a professional security firm to handle the task.\nThe court administration spends hundreds of thousands of euros a month on various farmed-out services including the provision of ushers, the hiring of cars as well as cleaning and other services. Millions of euros are also spent on court experts at the discretion of the judiciary.\n“It seems the government has money for everything except for the protection of our health and our families,” an employee, who said he was counting the days before retirement, complained.\n ", "comment_count": 8, "id": 2202}, {"keywords": "", "author": "", "article_body": "Guests at a boutique hotel in Buġibba had to be evacuated on Thursday evening due to a kitchen fire.\nNo one was injured but one person was treated for smoke inhalation.\nThe Civil Protection Department said the guests were evacuated while they extinguished the kitchen fire.\nThe department thanked the police and a medical team from Mater Dei for the assistance provided.\nPhoto: Peter Paul Coleiro, Civil Protection Department\n \n ", "comment_count": 3, "id": 2203}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Labour MP Rosianne Cutajar said in court on Thursday she wanted to send out a message to all women that derogatory language was not appropriate and acceptable in a democratic society.\nThe young politician was testifying in libel proceedings instituted against Godfrey Leone Ganado and Rachel Antoinette Williams over Facebook posts wherein she was likened to a “prostitute” and “call girl”.\n“I was hurt by those comments both personally and especially as a woman,” Ms Cutajar explained, adding that in today’s society much was said about violence, including verbal violence, which could possibly have a negative psychological impact upon its target.\nWatch: “You have no right to call me a whore” – Labour MP\nReferring to Mr Leone Ganado, the MP pointed out that she had been targeted by the man on previous occasions.\n“I know that just as he attacked me, he also attacks others. He called me a prostitute and a whore, representing prostitutes in Parliament,” Ms Cutajar went on, adding that this speech was insulting since at the end of the day, she was a person who rendered a service to the country.\nAs for Ms Williams, the MP pointed out that the respondent had not attempted to put a stop to offensive comments posted on her Facebook wall in similar vein.\nRather than invite commentators to criticise Ms Cutajar without resorting to insulting speech, Ms Williams, showing no feminine solidarity, had replied with an hekk hu or qed tghid sew to comments that had likened the MP to a prostitute.\nDuring Thursday’s hearing, Mr Leone Ganado also took the witness stand, being first shown a screenshot of a Facebook post wherein he had written “However, hamalli, prostitutes and call girls have a right to be represented in Parliament”.\n“I wrote that because I felt that that was what I ought to write. After all, all groups should be represented in Parliament,” said Mr Leone Ganado.\nWhen asked how his comment related to Ms Cutajar, the witness explained, “I qualify them as political prostitutes because they are given other jobs so as to keep their mouth shut. The majority of government MPs and persons of trust are political prostitutes.”\nAsked about another comment which had read, “Does she no longer render personal services in Catania under the Cicciolina franchise?” Mr Leone Ganado pointed out that the comment had been posted by someone else.\nLawyer Andrew Borg Cardona was counsel to the respondents. Lawyers Edward Gatt and Mark Vassallo were counsel to Ms Cutajar.", "comment_count": 0, "id": 2204}, {"keywords": "", "author": "", "article_body": "A 64-year-old woman was grievously injured on Thursday when she was hit by a car in Marsaxlokk.\nThe accident happened in Triq Xatt is-Sajjieda at 2.10pm.\nThe police said the Dutch woman was hit by a car that was being driven by a 21-year-old man from Żebbuġ.\nThe victim was taken to Mater Dei Hospital by ambulance. \nThe police are investigating.", "comment_count": 0, "id": 2205}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Planning Authority board chairman Vince Cassar hit out at the loss of Malta’s traditional streetscapes as plans to convert a 19th-century Sliema townhouse into an apartment block were turned down.\nThe proposal would have seen the addition of two extra floors and internal demolition of a two-storey building in Cathedral Street, within the Sliema Urban Conservation Area, that is part of a well-preserved row of five commissioned by the Mdina Cathedral between 1870 and 1886 for clergymen from renowned families.\nDuring a PA board hearing on Thursday, Mr Cassar lamented the fact that traditional streetscapes were being destroyed and insisted mistakes made in the past could not continue to be used to justify new damaging developments.\nThe decision to turn down the plans was welcomed by the Sliema local council and heritage groups, who have long called for the protected building – granted Grade 2 scheduling status in 2017 together with the neighbouring properties - to be safeguarded.\nRead: 150-year-old Sliema townhouse remains on dath row\nThe Superintendence for Cultural Heritage had also objected to the development, noting that the house contained various internal architectural elements which demanded preservation.\n“This townhouse is of cultural heritage value and deserves to be restored and retained, since it represents an era of architecture which is practically lost in Sliema,” the Superintendence wrote in its comments to the PA.\nThe proposal was recommended for refusal by the PA’s case officer despite amended plans reducing the number of additional floors, among other changes.\nHowever, the latest plans were still deemed unacceptable by the case officer, who concluded that the internal alterations were “excessive”, the design of the additional floors alien to the building’s surroundings, and the proposed height incompatible with planning policy for the area.\nRead: 25 properties scheduled in Sliema\nFlimkien għal Ambjent Aħjar, Din l-Art Ħelwa and the Sliema Heritage Society all sustained their objections to the project, highlighting the architectural significance of the building and streetscape and calling for it to be preserved for posterity.\nDuring the hearing, Sliema local councillor Paul Radmilli also argued that approving the application would set a precedent for other Grade 2 buildings by implying that only buildings with the very highest scheduling status could be protected.\nThe project architect, meanwhile, argued that the proposed height was in line with planning policy in light of a taller building further down the same row, and that the new plans proposed a stepped transition as had been requested by the authority.", "comment_count": 12, "id": 2206}, {"keywords": "", "author": "Ivan Martin", "article_body": "President designate George Vella is expected to take over from his predecessor, Marie-Louise Coleiro Preca, the helm of the constitutional reform steering committee, Times of Malta has learnt.\nThe former foreign affairs minister had apparently set such a role as a condition for accepting to become President, sources said.\nThe steering committee is tasked with laying out the ground work ahead of a highly-anticipated reform of the Constitution.\nPresident Coleiro Preca had previously signalled her intention to continue chairing the committee after she leaves office on April 4, telling the media this was what she expected to happen.\nMs Coleiro Preca was coy when asked about the matter on Wednesday: “I think we should let the government communicate its decision on this. I’m sure we will hear about this matter soon enough.”\nWatch: Constitutional reform committee to handle reform\nThe President would not comment further saying she preferred not to weigh in on the matter.\nI think we should let the government communicate its decision on this\nDr Vella’s nomination was announced by the government on Tuesday.\nThe government statement and a tweet by Prime Minister Joseph Muscat on Dr Vella’s nomination did not refer to President Coleiro Preca’s role at the helm of the constitutional convention steering committee.\nRead: Calls for referendum on Constitutional reform.  \nA lobby group on Wednesday urged the President not to support and endorse constitutional changes proposed by the political parties as that could put the presidency in confrontation with others who might be in disagreement.\nNGO Repubblika insisted that constitutional change could not be the product of “inter-party consensus after a closed-door horse-trading exchange”. Instead, reform should be led by citizens, rather than political parties, who, the group warned, could fear losing part of their hold on the country.\nThe NGO, which is focused on rule of law matters, said that if Dr Vella intended to lead the process of defining constitutional reform, it had a “grave concern” that political parties could be moving towards consolidating their powers.\n“George Vella may have all the good intentions in the world and we wish him every success in his new role,” the NGO said.\n“But, independently of his character, his record, his political affiliations and the wholesomeness of his intentions, we are dismayed by the prospect that a President could assume, while in office, a political role taking the sides of political parties against civil society in the crafting of Malta’s basic law and the fundamental rules of democratic life in Malta.”", "comment_count": 8, "id": 2207}, {"keywords": "", "author": "", "article_body": "Passenger traffic at Malta International Airport in February totalled 359,395 passenger movements, a 2.9% growth over the same month last year.\nThe airport said the growth was registered alongside an increase of 8.9% in aircraft movements and an improvement of 6.4% in seat capacity. Measuring the occupancy of seats available on flights operated from Malta Airport, seat load factor for February stood at 75.9%. Last month, the United Kingdom moved back to the top of the list of Malta International Airport’s main drivers of passenger traffic, after having dropped a place in January.\n\nThe UK market was followed by Italy, Germany, France, and Spain, which were cumulatively responsible for more than 60% of all passenger movements recorded in February. While the top three markets all registered a decrease in passengers raging between -0.8 and -5.5%, France and Spain continued the growth trend observed at the beginning of the year.\nFrance posted growth of 15.6%, partly stemming from developments such as the operation of the Bordeaux and Paris Beauvais routes during the winter season for the first time and better flight frequencies on the Paris Charles de Gaulle route. On the other hand, a spike of 75.4% was observed with regard to passenger movements from Spain, resulting from improved connections with this market throughout the winter season.", "comment_count": 1, "id": 2208}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Czech man’s legal struggle against a second extradition request by authorities back in his homeland has resulted in a judgment pronouncing his discharge from police custody.\nMarek Drga, 40, residing in Gozo, had been facing a second round of extradition proceedings sparked off by a European Arrest Warrant issued by Czech authorities, calling for the man’s surrender to face prosecution in his homeland for alleged tax evasion, tax fraud and complicity dating back to 2011 and 2012.\nMr Drga had already undergone extradition proceedings last year, faced sentencing abroad and had returned to Malta pending an appeal, before being targeted by a fresh request for extradition by the Czech authorities, who, defence lawyer Roberto Montalto had claimed, were “abusing the system.”\nWhen tracing the course of events which had led to Mr Drga’s second round of extradition proceedings, the court, presided over by magistrate Donatella Frendo Dimech, observed that the man had been taken into custody in the Czech Republic in February 2018 after the first round of extradition proceedings in Malta had resulted in a final judgment in January of that year.\nAfter spending some six months in a Czech prison and while criminal proceedings in his regard were still ongoing, Mr Drga had been released from custody “under supervision by a probation officer”.\nAfter stepping out of jail, the man had returned to Malta, while appeal proceedings were still ongoing, communicating his move in writing to his probation officer, calling probation services on the phone and confirming that he had returned to Malta “for reasons of work etc.”\nYet no European Arrest Warrant had been issued by the Czech authorities requesting Mr Drga’s return specifically on the grounds that he had fled justice, the court observed. “None was filed.”\nOn the basis of evidence put forward, the court ascertained that Mr Drga had “violated no conditions governing his release,” with respect to ongoing proceedings in his home country.\nTurning its focus upon the second extradition request, the court said that this failed to conform to the speciality rule as enshrined in a Council Framework Directive which stated that a wanted person could not be tried for “an offence committed prior to his or her surrender other than that for which he or she was surrendered”.\nThis principle did not apply if the wanted person, having had the chance, did not leave the territory “within 45 days of his or her final discharge”.\nIn this case, there had been no ‘final discharge’ since Mr Drga’s case in the Czech Republic was still ongoing when he returned to Malta, the court said, meaning that the specialty rule remained “unfettered and unaffected”.\n“When the wanted person left the Czech Republic, proceedings against him were not yet concluded and hence there had been no final discharge,” declared the court, concluding that Mr Drga’s return to his homeland was barred and thus ordering his release from police custody.\nThe court finally ordered that the AG and the Justice Minister be notified of the judgment.", "comment_count": 0, "id": 2209}, {"keywords": "", "author": "", "article_body": "Tanya Mercieca, assistant auditor general within the National Audit Office (NAO), has been appointed member of Eurocontrol’s Audit Board. Orland Bonavia, NAO audit manager, has been appointed deputy member. Their term of office will start on July 1 and end on June 30, 2023.\nBoth Ms Mercieca and Mr Bonavia were recommended for the posts by Auditor General Charles Deguara. The recommendation was endorsed by Charles Pace, member of the Provisional Council for Malta.\nEurocontrol is the European Organisation for the Safety of Air Navigation. It is an international organisation working to achieve safe, efficient and environmentally-friendly air traffic management across the European region. Founded in 1960, it currently has 41 member states and is headquartered in Brussels.The audit board is a standing board of the Eurocontrol Commission and ensures an external audit function.\nAll its members are independent of the agency, and their scope is to review all agency operations.\nFor this purpose, members are given full access to the relevant Eurocontrol procedures, decisions and documents. The board reports to the Commission via the provisional council, where the financial management of the route charges system is concerned.", "comment_count": 1, "id": 2210}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The curtain has been drawn on five libel suits filed by Minister Konrad Mizzi over allegations he faced stemming from the Panama Papers, after a Magistrates’ Court formally declared on Thursday that the cases had been ceded.\nTwo of the suits had been filed against slain journalist Daphne Caruana Galizia who had claimed in a blog post that a company owned by one of the two daughters of Azerbaijan ruler Ilham Aliyev, had transferred very large sums of money, described as “loan payments”, to secret companies Hearnville Inc, Tillgate Inc and Egrant Inc.\nThe transfers had allegedly been made by Al Sahra FZCO, a company owned by Leyla Aliyeva incorporated in Dubai's free zone, with Ms Aliyeva as the ultimate beneficial owner, the blog post had claimed.\nThe payments were made through Al Sahra FZCO’s account at Pilatus Bank, Ms Caruana Galizia had alleged.\nAnother two suits had been filed against former Opposition leader Simon Busuttil, with another being filed against ex-PN deputy leader Beppe Fenech Adami.\nHowever, in a statement last month, the minister had said that he had decided to withdraw the suits after the courts had ruled against Dr Busuttil and MEP David Casa in January, finding that there were no grounds to launch an inquiry related to Panama Papers revelations.\n“While some defendants might rejoice to know they would not have to shoulder a monetary cost for their lies, it should also be clear to them that they had already lost their political credibility,” the minister had declared in a statement issued through the Department of Information.\nAlthough the cases featured on Thursday’s case list, the court, presided over by magistrate Francesco Depasquale, declared that the applicant had withdrawn the lawsuits, thus bringing the matter to its formal end.\nDr Mizzi’s withdrew the suits days before Nexia BT partner Karl Cini was due to testify about emails relating to mystery Dubai company 17 Black.\nAn email sent by Mr Cini indicated the company as one of the target clients of Dr Mizzi’s own secret Panama company, which he set up when he was Energy Minister. \nThe email informed Mossack Fonseca in Panama that 17 Black would pay up to $2 million to offshore companies owned by the Prime Minister's chief of staff Keith Schembri and Dr Mizzi.\nA joint investigation by Times of Malta and Reuters revealed that 17 Black is owned by Electrogas power station director Yorgen Fenech.\nDr Mizzi has denied any links to the Dubai company, most recently when being cross-examined as part of the libel proceededings on January 10.", "comment_count": 0, "id": 2211}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Some of the financial services watchdog’s most experienced executives are expected to ‘retire’ in the coming weeks after being offered lucrative golden handshakes to make way for ‘new’ recruits.\nAmong those expected to be leaving soon are Anton Bartolo, a lawyer who led the Malta Financial Services Authority’s enforcement unit and served as deputy head of the Financial Intelligence Analysis Unit, industry sources said.\nAt least five other senior officials were also expected to end their long stint working for the regulator, the sources added.\nThe ‘offloading’ exercise was being spearheaded by the new CEO, Joseph Cuschieri, who had been handpicked for the job by the Office of the Prime Minster, the sources noted.\nRead: Handpicked boss of MFSA given €11,500 monthly salary\n“The senior officials who have been asked to leave have been surgically targeted so their posts are filled by people close to the CEO. Since these senior officials could not just be sacked, they were offered a lucrative golden handshake, paid by taxpayers, of course, so they would go in peace,” a knowledgable financial services operator commented.\nThe industry sources said Mr Cuschieri, who enjoyed a remuneration package exceeding €130,000 a year, had already embarked on a new recruitment drive placing one of his closest collaborators at the Malta Gaming Authority, which he used to chair, as his de facto number two at the MFSA.\nThe MFSA was asked what sort of golden handshakes were being offered but no information was forthcoming at the time of writing. However, a spokesman did say that “an early voluntary scheme in order to facilitate a number of structural changes and planned organisational restructuring” was put in place a short time ago.\nAgain, no replies were forthcoming on how the scheme fitted in with plans announced recently by Mr Cuschieri to significantly increase the number of MFSA employees and to “retain its best resources”.\nSources close to the financial services watchdog expressed concern at certain decisions being made, mainly because these were all being made by a small team of officials, all accountable to Mr Cuschieri.\n“As happened in other regulators over the last years, it seems that even at the MFSA power is being concentrated and this is very worrying,” a senior official said, insisting on anonymity.\nStill, the industry sources pointed out that Dr Bartolo’s departure “may make some sense” as it was under his watch that the major controversies in which the MFSA was recently involved, particularly the Pilatus Bank and Satabank debacles, happened. However, they were quick to note that the moves were being made mainly to “ac-commodate certain people and the industry”, which they deemed as not being in the MFSA’s interest.\nEfforts to contact Dr Bartolo, including via e-mails, failed by the time of writing.\nThe MFSA has come under intense pressure during recent years, particularly by the International Monetary Fund and the European Union, after Maltese banks and their clients, including senior politicians, were mentioned in the Panama Papers and other leaks.\nBrussels has been insisting that the financial services watchdog must act independently and pull up its socks to be able to supervise a massive sector that was much larger than the Maltese economy.\nThe IMF last week warned against the concentration of power at the MFSA and said that enhanced checks and balances were needed in the decision-making process.\nThe MFSA welcomed the recommendations made but insisted it would be going ahead with the reform that the IMF warned against.\n ", "comment_count": 50, "id": 2212}, {"keywords": "", "author": "Sarah Carabott", "article_body": "An entire generation of Maltese women missed out on its full employment potential and will end up with low pensions because they were expected to skip tertiary education to take care of their family.\nBut while traditional expectations might have cut short the political ambitions of that particular generation of women, it is time for younger generations to bring about balance, the director of the European Institute for Gender Equality told Times of Malta.\nInformation about that ‘lost generation’ emerged from an Eige study on the upscaling of low-skilled women, Virginija Lambakk explained.\nShe was speaking to the Times of Malta during a European Parliament seminar to mark International Women’s Day, where it was noted that the glass ceiling was also present at EU institutions, with women being nearly absent from roles above middle management.\nOnly 36 per cent of MEPs members are women, though that is a 17 per cent increase from 40 years ago. Finland tops the list with 77 per cent of its MEPs being women, while only one out of the six Estonian and Cypriot MEPs are female.\nMalta currently shares fourth topmost place with Sweden, as half of its six MEPs are women.\nA fourth female MEP, Therese Comodini Cachia, quit her seat in 2017 when she was elected in Malta's general election.\nShe is now one of just 10 women MPs out of Malta’s 67 MPs. That ratio places the island second-to-last in political representation by women in the EU. The share of women in national parliaments in the EU-28 is around 30 per cent.\nPrime Minister Joseph Muscat has said that he intends to introduce gender quota legislation during this legislature.\nHow political representation stacks up across the EU. The green dots represent male shares, while yellow is for female ones. Graph: EIGE\nAsked whether gender quotas could work in Malta, Ms Langbakk noted that there was no single answer to whether quotas were the best way to introduce balance. However, out of the nine EU member states that had introduced quotas, eight (except for Croatia) had seen an increase in the share of women in Parliament.\nNonetheless, quotas were an interim solution as they kicked off a discussion and forced decision makers and party leaders to start actively looking for alternatives, she noted.\nSo what would be the solution for Malta to create some balance?\nApart from party leaders and gatekeepers kicking off a discussion, the younger generations should be supporting women in politics, talking about women in politics, and participating in politics themselves, she said.", "comment_count": 18, "id": 2213}, {"keywords": "", "author": "Jacob Borg", "article_body": "About 50 investors were awarded €300,000 in compensation over the past six months after the financial arbiter found that Bank of Valletta mis-sold them what was understood to be a low-risk investment product.\nThe La Vallete Fund, launched in 2005, had been suspended three years later and eventually wound up after making losses of €33 million.\nThis was the second tranche of investors to be awarded significant compensation by the financial arbiter, although, this time, the compensation claims were based on individual complaints rather than a class action suit.\nCompensation claims based on individual complaints\nIn February 2018, over 400 investors were awarded €3.4 million plus interest by the arbiter in a class action complaint. Bank of Valletta has appealed the decisions including on all claims that were handled by Finco Treasury Management.\nThe arbiter warned in his 2018 ruling that any delay in implementing the compensation decision could negatively affect the bank’s reputation.\n“This case had been dragging on for years and the current management has an opportunity to close this case once and for all,” the arbiter said.\nRead: Out of court settlement for La Valette Property Fund investors\nIn the latest awards, handed down in September and January, the financial arbiter again found that BOV had failed to act in the best interest of its clients. He noted in his various rulings that the bank had failed to provide convincing or sufficient evidence that it had fulfilled its obligations in this regard.\nThe bank was fined €203,000 by the Malta Financial Services Authority in June 2012, with the regulator saying it had failed to act in the best interest of investors, as required in terms of the applicable regulatory framework.\nThe bank had already offered investors 75c per share in May 2011, amounting to €14.5 million, with a total buyout value of €45 million. However, not all of the investors had accepted it and an out-of-court settlement was reached in 2014 for those whose interests were handled by Finco Treasury Management.\nBoV said it had not entered settlement agreements on any claims following decisions of the arbiter, whether the claims were handled by Finco Treasury Management or otherwise.", "comment_count": 2, "id": 2214}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated 2.20pm \nThe Planning Authority on Thursday approved Midi's planned mega-development on Manoel Island, amid concerns from NGOs and Gżira residents.\nThe plans feature an extensive residential and commercial complex, including 600 apartments, a hotel at the historic Lazaretto, retail outlets, a yacht marina, streets and plazas.\nThe developers are promising the restoration of several heritage buildings and 80,000 square metres of new parks and family areas around Fort Manoel, which will itself comprise galleries, museums, shops, restaurants after earlier plans for a hotel at the fort were dropped.\nThirteen board members voted in favour and one against. NGO representative Annick Bonello voted against, citing the environmental NGOs’ concerns, while Labour, Nationalist Party and Gżira local council representatives all voted in favour.\nBoard members stressed that the plans under consideration were an improvement on the original 1999 masterplan, which remained valid and which Midi still had the right to develop if the current plans were rejected.\nThe board also confirmed that 8,000 square metres of development space removed from the plans would be transferred to Midi's development at Tigné, with no increase in building space allowed at Manoel island. \nGżira mayor Conrad Borg Manché, once a staunch critic of the project, told Times of Malta after the hearing that while, like residents, he would have preferred to see a public park, his approach had been limited by the legal rights Midi had to the development. \nThe approved plans, he said, were an improvement and included several important changes secured through the guardianship agreement signed between Midi and the local council, including the use of the fort as a cultural centre instead of a hotel, the preservation of swimming zones, and the limitation of building heights. \n“It’s important for people to understand the full perspective,” he said. \nThe Gżira mayor's favourable reaction to the new Midi plans. Video: Chris Sant Fournier\nThe hearing followed an earlier one in December where a decision was put off as the board sought more information on building heights and the differences to the earlier plans.\nMidi’s architects presented photomontages on Thursday which they said showed that the new plans represented a reduction in built-up footprint over the 1999 masterplan, increased open spaces, and improved the building profile to better respect the island’s context.\nThe developers also committed to incorporating a slipway for small boat owners, after complaints by the local fishing community.\nArchitect Carmel Cacopardo, representing objectors, challenged the legal basis for the changes to the masterplan, arguing that a planning control application would have been required to change the local plan, by which the original plans have been kept alive.\nSliema local councillor Michael Briguglio slammed the limited social impact assessment for the project, which consisted of a survey of passers-by on the basis of which the authors concluded broad support for the project.\nConcerns were also raised over the loss of open views and the discovery of archaeological remains which objectors say could be impacted by the construction of new bridges. The remains still have to be considered by the Superintendence for Cultural Heritage, although the developers said they would abide by any conditions the watchdog imposed for the final plans. In a packed and occasionally heated hearing, residents also reiterated concerns over the loss of parts of the Gżira promenade and open spaces.\n\nMore than 6,000 people had signed a public petition in recent weeks calling on the government to turn Manoel Island into a wooded park with heritage buildings and save the iconic views from Gżira and Ta’ Xbiex.\nSpearheaded by new residents’ group Inħobbu l-Gżira (We love Gżira), the campaign called for a complete scrapping of a project that has been on the cards since the granting of a concession to Midi in 2000 but which residents say will lower the quality of life of thousands for the benefit of a few.\nMeanwhile, a guardianship agreement signed between Midi and the Gżira council, ending months of hostility over public access and a widely-slated first draft master plan, seeks instead to hold the developers to its key pledges if the project is approved.\nUnder the agreement, a jointly-set up foundation will be able to take the developers to court if they alter building heights, build up any part of a promised public park surrounding Fort Manoel or go back on other aspects of the agreement.\n“We have to seek some kind of guarantee and permanence to the status of Manoel Island, its green areas, its swimming areas and the use of the fort as a cultural centre,” Manoel Island Foundation chairwoman Claire Bonello told the Times of Malta.\n“As a foundation, we have worked to find a legal way to guarantee permanent public access to Manoel Island. If there are other people who have a different approach, I welcome that,” Dr Bonello said, stressing the uniqueness of the agreement’s enforcement mechanism.\nContinued concerns from residents and environmental groups have centred on the height of the planned apartment blocks closest to the island entry-way, which objectors say are oversized and will obscure important vistas.\nResidents have also lamented the loss of a part of the Gżira promenade to accommodate new bridges, one of which will be reserved for pedestrians and cyclists to access the largely vehicle-free island, and the narrowing of the current sea channel.\nThe Environment and Resources Authority had not objected to the plans, although an impact assessment warned of significant negative effects during the eight-year construction phase.\nThe Democratic Party condemned the PA's decision and the fact that both the PL and the PN had voted in favour. It said the island would be overdeveloped, views from Gżira would be ruined and Gżira creek would be narrowed by land reclamation. ", "comment_count": 92, "id": 2215}, {"keywords": "", "author": "", "article_body": "A magistrate has postponed a decision on whether the Office of the Prime Minister's Chief of Staff Keith Schembri may be questioned about secret company 17 Black in a libel case instituted against former Opposition leader Simon Busuttil.\nMagistrate Francesco Depasquale had been due to give a decision on Thursday, but it was postponed to give Mr Schembri’s lawyers a chance to reply to submissions by Dr Busuttil's lawyers on why he should be ordered to give evidence.\nIn terms of law, Mr Schembri has a right to file a reply to Dr Busuttil’s written submission, which was filed after the case had been adjourned for decree.\nMr Schembri had sued Dr Busuttil over comments he made about the Panama Papers during a public activity in March 2016.\nDuring a hearing on January 24, Mr Schembri's lawyers objected to questions about 17 Black on the grounds that information about it came to light after the libel proceedings were instituted.\nBut Dr Busuttil's lawyers argued that 17 Black is a secret company named in leaked e-mails as one of two companies that would pay $2 million to Mr Schembri's and Konrad Mizzi's secret Panama companies.\nThe case has been put off to next month.\nCorrection March 8, 10.25am: The story has been updated to make it clear that the magistrate was legally obliged to give Mr Schembri time to file a written reply. ", "comment_count": 0, "id": 2216}, {"keywords": "", "author": "Edwina Brincat, Herman Grech", "article_body": "Three men accused of killing Daphne Caruana Galizia were back in court on Thursday morning, as the compilation of evidence against them resumed. A contested IT expert was the main witness.\nHighlights from Thursday's case:\n\nDevices used were never used again after the bomb was sparked. \nThousands of phone calls were analysed, but two particular numbers stood out at the moment of the explosion.\nDefence lawyers demanded to know if there had been any threats made to Daphne Caruana Galizia on her phone call profiles - despite a court order which said those logs should be protected.\n\nMinute-by-minute:\n11.02am: The case has been adjourned to April 12. \n10.57am: The IT expert insists that he can only tell the court that there was a communication between two devices but not who was behind each device, and who made the call. Dr Bajada's testimony is over. \n10.50am: Elaborating on the devices used, Dr Bajada says GPS is used for a variety of reasons. Some GPS relay messages to another device to get it to do something. In this case there were two particular IMEIs (International Mobile Equipment Identity). They were never used again after the day of the explosion. \n10.40am: Lawyers from the prosecution and defence are engaging in a verbal ping pong over safeguarding the rights of their clients. Each accuses the other side of raising their voices.\n10.37am: If you're catching up with us now, Martin Bajada, an IT expert who analysed the phone data after the car bomb, is on the witness stand giving testimony. His testimony is being challenged by defence lawyer William Cuschieri. \nExperts and top army officials investigating the scene of the crime. Photo: Mark Zammit Cordina\n10.33am: Dr Bajada says that before the arraignment of the three men, a cloned phone had not been fully analysed. He says he now has the full information but since the magisterial inquiry is still underway he cannot reveal the information. \n10.23am: Lawyer Cuschieri challenges Dr Bajada to say whether his sources were journalistic in nature. Magistrate warns Dr Cuschieri not to put questions which could breach a court ban.\nLawyer Therese Comodini Cachia intervenes making reference to decree given by Magistrate Anthony Vella to protect Caruana Galizia’s sources, following a case filed by the Institute of Maltese journalists in late October 2017.\n10.21am: \"Could you say with moral certainty that that message set off the  bomb,\" lawyer asks.\n\"I never said that and it was not my brief to determine that,\" Bajada replies in a calm tone at the witness stand.\n\"I never said that GPS is illegal or that a GPS set off the bomb. I am not an investigator. My brief was to analyse facts.\"\n10.15am: The devices were used on three dates - on January 10, 2017, in August and on the day of the bombing. The SMS sent on the day of the car bomb was linked to the Bidnija antenna.\n10.09am: The IT expert says that at the specific moment when the bomb was sparked a particular device was used. It was a Nokia 105 communicating with the other device. He reached this conclusion through call profiles analysis.\n10.07am: Dr Bajada says he checked all the phone calls made at the time of the explosion. Thousands of phone calls were analysed, but two particular numbers stood out at the moment of the explosion, the IT expert says.\nWere the users identified, the lawyer asks.\n\"It doesn't work that way. A SIM device was analysed. It’s a unique number of a mobile or device, like a chassis.\"\nLawyer grills expert over the device - \"so you couldn’t tell with moral certainty.\"\nDr Bajada hits back. \"Yes, I could. That message could not be sent to a mobile but to a specific device.\"\n10am: The IT expert says his only contact with the FBI was a meeting with them at the police headquarters.\n9.56am: Questioned by the defence lawyers, Dr Bajada replies that he was authorised to investigate each of the tasks he was assigned to.\nWas there an explicit magisterial decree, lawyer William Cuschieri asks.\n\"I don’t know if there was a decree. But I was expressly authorised by the magistrate,\" Dr Bajada replies. \n9.50am: The case finally gets going. Martin Bajada takes to the witness stand. \nHe says he analysed call profiles, reconstruction of cell calls of the victim and hand on the data to Europol. He also analysed 112 calls on the day of the car bomb and inspected CCTV footage, among others.\nToday, this data cannot be presented because the magistrate had imposed a ban on sources.\n9.33am: Two armed guards stand outside the courtroom as family members and lawyers assemble.\n9.25am: Thursday morning's session has already been hotly contested before it started. A judge last week rejected yet another attempt to stop court-appointed IT expert Martin Bajada from testifying in the ongoing compilation of evidence against the three men. Alfred Degiorgio, one of the accused, filed a constitutional application claiming that his right to a fair hearing would be breached if the expert was allowed to testify.Daphne Caruana Galizia pictured in 2017.\nThe controversy stems from a 1993 case where Dr Bajada was convicted of theft and fraud by the UK courts.\nHowever, his position as expert was green lighted by a decision of the superior courts in 2017.\n9.15am: In a sitting three weeks ago, the almost three-hour session featured some ill-tempered exchanges between lawyers and the bench, with defence lawyer William Cuschieri in particular getting into some tense conversations at times.\nRead: Lawyers argue as Daphne murder suspects return to court\nBackground:\nDegiorgio brothers Alfred and George and Vince Muscat face charges of having planted and detonated the bomb which killed the journalist in October 2017.\nCourt experts have testified about a boat spotted entering and exiting the Grand Harbour on the day of the murder, which investigators say is Alfred Degiorgio’s Maya.\nPolice witnesses also testified about items they had confiscated from a Żebbuġ site on the day police had arrested the three suspects.\nThe three suspects have filed separate proceedings against authorities, saying their arrest and searches of their homes had breached their fundamental rights.\nThe key players:\nMagistrate Claire Stafrace Zammit is presiding.\nLawyer Martin Fenech is appearing for Vince Muscat, known as il-Koħħu, 55.\nLawyers William Cuschieri and Martha Muscat are representing Alfred Degiorgio, known as il-Fulu, 53.\nLawyer Josette Sultana is appearing for Alfred's brother George Degiorgio, known as iċ-Ċiniz, 55.\nPhilip Galea Farrugia from the Attorney General's office and inspectors Keith Arnaud and Kurt Zahra are prosecuting.\nLawyers Jason Azzopardi and Eve Borg Costanzi are appearing parte civile.", "comment_count": 0, "id": 2217}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 12.20pm\nOffshore wind farms, like most renewable energy plants, have been lauded as an efficient and green alternative to fossil fuel energy but lack of wind to provide power or electricity still cause headaches.\nThree Maltese researchers have come up with an innovative idea that is gaining traction abroad: a device that is similar to a ‘battery pack’ that acts as an energy storage system in cases of emergency.\n“The storage system is so innovative because renewable energy companies can generate electricity even when there is no sun or wind,” team leader Tonio Sant said. If there is less wind or sun, and energy is needed, this ‘battery’ can be used to keep the grid going, he added.\nThe project is dubbed FLASC: Floating Liquid Piston Accumulator Using Seawater Under Compression.\n“It is also a play on words, since the equipment is basically like a water container,” engineer Daniel Buhagiar said.\nThe system has two pressure containers underwater that compress air. FLASC uses the compressed air for energy storage while maintaining a stable pressure.\nThe technology then converts the renewable energy supply into output.\nReliability is everything\n“Think of it like a battery: the issue with renewables is the sun is not always shining and the wind is not always blowing. Most of the time, as consumers we expect a certain fixed output, so there is a need for this buffer,” Dr Buhagiar continued.\nRenewable energy is intermittent and is consequently hard to predict.\n “We want to change that intermittency into a guaranteed power supply,” Dr Buhagiar said.\nEngineering experts (left to right) Tonio Sant, Daniel Buhagiar and Robert Farrugia next to their ‘emergency battery’.\nMany foreign wind turbine offshore farms have tried to solve the problem by turning to large-scale batteries. However, these can be fire hazards and are dangerous when used out at sea, Prof. Sant pointed out.\nOil and gas infrastructures are also looking for renewable energy to power their processes.\n“An oil rig can demand 95MW of energy, a quarter of the power Malta demands,” Dr Buhagiar said.\n“They look to wind turbines as an option to power their system but it is a process that runs every day and all the time, so reliability is everything.”\nA prototype of the FLASC project is situated at Dock No. 1, in Cospicua.\nThe researchers from the Faculty of Engineering and Institute for Sustainable Energy at the University of Malta are now eyeing Northern European markets.\nThe project is supported by the Fusion R&I Technology Development Programme of the Malta Council for Science and Technology (Project R&I 2015-044-T), the Maritime Seed Fund of Malta Maritimma, the University Research, Innovation and Development Trust and industrial partner Medserv plc.\nMaltese scientists have developed an innovative offshore energy storage system that was awarded a Statement of Feasibility by an independent certification body. The prototype of the structure is pictured here in Vittoriosa. Photos: Matthew Mirabelli", "comment_count": 19, "id": 2218}]