[{"keywords": "Health, European Union", "author": "Edwina Brincat", "article_body": "A baby died in its mother's womb because staff at Mater Dei Hospital were more concerned about sorting out payment issues for the non-EU father, a couple claimed in court on Monday.\nIn a judicial protest claiming compensation, the couple, a Romanian woman and her Serbian partner, described how they went to hospital for the delivery of their daughter after a problem-free pregnancy earlier this month.\nBut the baby died inside the mother’s womb owing to lack of professional prudence, diligence and care by hospital staff and the authorities, directly or indirectly responsible for such staff, they claimed.\nThe couple pointed out that the mother, as an EU national, was the holder of a European Health Insurance Card which entitled her to free medical treatment or reduced fees in case of emergency care in public hospitals.\nYet, they said the hospital staff appeared to have been more concerned with how the non-EU father would pay for medical services at the state hospital, making “no effort to control or address the situation” brought to their attention by the expectant mother.\nSuch professional negligence and discriminatory treatment in their regard as non-Maltese nationals led to the death of their unborn child, the parents said.\nThe protest was filed against the Director General of Health Services, the Chief Government Medical Officer, the Prime Minister, the Health Minister, his Permanent Secretary, the CEO at Mater Dei Hospital, the Director (Nursing Services) and the Attorney General. They asked them to liquidate damages within 15 days, whilst reserving the right to further legal action.\nLawyers Natalino Caruana De Brincat and Ivan Mifsud signed the judicial act.", "comment_count": 0, "id": 2319}, {"keywords": "Construction, Joseph Muscat", "author": "Keith Micallef", "article_body": "Proposals aimed to safeguard properties from damage caused by adjacent excavation and construction works were published by the government on Monday in the wake of the recent spate of building collapses. The most recent collapse was four days ago when the wall of an apartment fell into a building site in Hamrun.\nIn terms of the proposals issued by the Infrastructure Ministry, architects and site managers will have to adhere to stricter procedures and regulations and in case of any breach, fines may go up to €50,000. \nA five-day public consultation period closes next Friday. Submissions can be made on newbuildingregulations@gov.mt. However, so far, only a power presentation of the proposals has been published and not the full text of the amendments to Legal Notice 72 of 2013.\nIn a statement the Infrastructure Ministry said that over the past months it had also been working on legislation to establish the Malta Construction and Building Authority. The new authority will have the remit to consolidate all rules and regulations in the building and construction industry.\nHowever, in view of the recent incidents and due to the fact that the process to establish the new authority is “a laborious and intricate one”, the ministry said it felt that the new regulations had to be established with immediate effect.\nThe main proposals are the following\nExcavation studies\n· A geotechnical design report specifying the type of rock, its geometry, existence of any fissures, strength characteristics and the structures of nearby buildings must be submitted by the architect before excavation starts.\n· The architect who compiles the geotechnical design report shall be responsible for its content and implementation and must certify the foundations. If needed a geological survey must also be carried out.\n· It is only once this report is in hand, that a decision can be taken on what machinery may be used to excavate the site.\nResponsibilities of architects and site managers\n· Every developer will be obliged to appoint a site manager, who shall be responsible to ensure that the method statement issued by the architect of how to excavate and demolish the site, is adhered to.\n· Method Statements will be published online two weeks before the start of works, in order for affected residents to ensure that it is being adhered to.\n· Condition reports will have to be sent to neighbouring third-party owners two weeks before the start of works\n· Only the architect himself or a competent person who has the architect’s full trust will be allowed to be nominated site manager.\n· Site managers will have to be physically present on site when decisions affecting the method statement, or third-party properties will be made.\n· Site manager will have to sign the method statement, be held liable, and be present when the condition reports are being drawn up during inspections to neighbouring third-party properties.\n· Site managers will be obliged to alert the architect and the Buildings Regulation Office in case the method statement is breached.\n· Site managers must immediately alert the contractor and architect upon the reception of an enforcement notice and halt all works immediately.\n· All details of each and every constructor or sub-contractor must be specified in advance.\n· From now onwards only those interventions whereby the architect certifies they will not affect neighbouring third-party properties will be exempt from a method statement and a bank guarantee.\nFines and insurance cover\n· Minimum insurance cover will have to increase from €500,000 to €750,000 and must be extended until all construction works are certified as complete.\n· Fines for breaching the method statement will increase from €500 to €10,000, while in cases involving breaches of an enforcement notice will rise from €10,000 up to €50,000.", "comment_count": 28, "id": 2320}, {"keywords": "Properties, Construction", "author": "Edwina Brincat", "article_body": "A homeowner has taken court action in a bid to stop the developer of a nearby property from proceeding with works which, he said, pose a threat to the structural integrity of neighbouring properties.\nMsida resident Jeffrey Azzopardi, who had objected to the granting of a development permit, filed a judicial protest against the proposed development on the site of the former Mireva Buildings, close to the University of Malta campus.\nThe site is earmarked for a hotel including a ground floor lobby, toilet and breakfast area versus cafeteria and nine storeys of accommodation, a pool deck area at level 9 and ancillary facilities at basement level.\nMr Azzopardi argued that parts of the planned construction project would require excavation works, which would not observe the statutory 76cm distance from the neighbouring tenement.\nMoreover, the developer was legally bound to undertake geological surveys on the subsoil before carrying out the works so as to ensure that there was no danger to life or property.\nThe presence of a number of large wells in the substructure directly beneath the neighbouring properties, presented an added threat to the structural integrity of the properties, especially if the wells were somehow affected by the proposed excavation works.\nMr Azzopardi called on the developer not to undertake any works, even if covered by a Planning Authority permit, until all necessary measures to safeguard neighbouring properties were taken. \nHe warned in a formal judicial protest that even in the event of a successful application by the applicant, he should still take the necessary precautions to safeguard the property rights of client.\nThe judicial act was signed by lawyer Anthony P Farrugia.\nThis judicial protest comes days after Prime Minister Joseph Muscat ordered a nationwide halt to all building excavation works following three properties collapsed onto neighbouring construction sites.  \n ", "comment_count": 14, "id": 2321}, {"keywords": "Construction, Architecture, Msida", "author": "Ivan Martin", "article_body": "Updated at 4.20pm\nFears that a five-storey building in Msida is resting on a flimsy column of bricks have led to a Chamber of Architects investigation. \nThe Kamra tal-Periti is investigating whether the building on Santa Venera road was sanctioned by a warranted architect, following concerns on social media about the apartment block's structural integrity. \nPictures of the building were shared widely on social media on Monday, with many raising concerns that the apartment block appeared to be supported by two flimsy rows of concrete bricks set up in a makeshift column.\nThe building in Msida appears to be held up by a few bricks\nA source at the Kamra tal-Periti said they had received word of the issue and were looking into whether the construction was overseen by an architect. It was too early to give any sort of position on the matter, they added. \nMeanwhile, another member of the Chamber said they were receiving a number of similar reports from their members and from the public.\n“More and more people seem to be getting concerned about building site safety in the wake of recent incidents,” the veteran architect said.\nThe reports come just over a week after a building collapse in Mellieħa and the wall of an apartment fell into a building site in Guardamangia.\nIn April, an apartment block next door to a building site also crumbled in the dead of night.", "comment_count": 77, "id": 2322}, {"keywords": "Banking, Joseph Muscat, USA", "author": "Ivan Martin", "article_body": "Bank of Valletta will be losing the services of its last remaining US dollar correspondent bank because it was doing well and not because it was doing poorly, Prime Minister Joseph Muscat said on Monday.\nFielding questions from reporters, Dr Muscat weighed in on news that BOV's last correspondent bank for US dollar transactions, Dutch bank ING, would be pulling the plug on the relationship come December.\nING will stop clearing US dollar transactions for BOV as of December 14, the Maltese bank said in a brief statement to the market on Monday morning.\nDr Muscat was reluctant to get into specifics, but said he was informed that BOV was working on plan for \"fall back positions\".\nRELATED STORIESBOV to lose its last USD correspondent bank\nWithout referring to ING specifically, Dr Muscat said large banks were de-risking their business relationships with other institutions due to their own internal situations, and not due to Bank of Valletta's specific circumstances.\nRumours that ING was on the verge of ending its relationship with BOV began circling months ago, with the Dutch bank reportedly keen to cut ties with smaller jurisdictions it considers to be “too risky”, after paying a €775 million settlement for money laundering violations.\nJoseph Muscat fields questions about BOV's correspondent bank loss. Video: Chris Sant Fournier\nBOV 'totally different' - Muscat\nA lot of the major changes occurring in the European banking sphere, Dr Muscat said, were due to banks failing, being tied down by non-performing loans or \"falling apart\". \"The situation with BOV is totally different. It is growing and strengthening so much… this is not happening because the bank is doing poorly, but because the bank is doing very well,\" he said.\nBOV had grown exponentially – partly due to HSBC scaling back operations in Malta following legal troubles in the US - and was often viewed as being too big relative to the size for the Maltese economy.\n“So this is a new skill that we need to hone, to do that type of de-risking. I know that BOV is looking strategically in this direction, and I am certain that decisions will be taken in coming weeks,” he said.\nIn comments to Times of Malta, BOV chairman Deo Scerri said that the bank was working behind the scenes to reduce its risk profile and had hired \"two global consultancy firms\" to guide the process. ", "comment_count": 60, "id": 2323}, {"keywords": "Murder, Crime, Għaxaq, Court", "author": "Edwina Brincat", "article_body": "The mother and daughter murdered in their Għaxaq home in March had been shot in the head and then hit with a \"heavy object\" that smashed their skull, the pathologist who carried out the autopsy testified on Monday. \nDetails of the cause of death of the two alleged victims emerged in court in the ongoing compilation against 38-year old Joseph Bonnici, the man currently accused of murdering his mother and sister.\nPathologist Marie Therese Camilleri Podesta’ who performed the autopsy on both corpses together with Ali Salfraz on March 30, confirmed the report under oath, explaining that in the case of the mother, Maria Lourdes, the cause of death had been a bullet wound to the head.\nHer daughter Angele had been killed by two bullets to the head, Dr Camilleri Podesta’ confirmed, stating that two bullet wounds had been found on the victim’s head, with blood seepage on the inside.\nRELATED STORIESGħaxaq murder was third deadly crime for familySister had accused brother of rape, father tells court\nAsked to comment about the nature of the injuries observed on both victims, the pathologist said that the trauma was compatible with a heavy object since both of the women’s heads had been “smashed” (\"mifqugħin\")\nInspector Charlot Casha next presented a report with a DVD containing some 158 digital photos related to the crime.\nPC Shaun Micallef, stationed at the Forensic Science Laboratory, presented a report on his findings as scene of crime officer at the Għaxaq field where the two corpses had been discovered on March 30. They had been buried under the soil close to a small room from where samples of soil and a whitish powder, suspected lime, had been lifted.\nAt the end of Monday’s sitting, the Court, presided over by magistrate Joseph Mifsud, upon a request by Dr Yanika Bugeja, said that it was still waiting for confirmation from the Attorney General to grant authorization to the accused’s girlfriend to access her former home, which she had shared with Mr Bonnici for the past 10 years.\nThe case continues in July. \nInspectors John Spiteri, Keith Arnaud and Roderick Attard prosecuted.Lawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2324}, {"keywords": "Pensions, Economy", "author": "", "article_body": "Malta’s pension entitlements amounted to €25.1 billion at the end of 2016, around two and a half times the country’s GDP, according to NSO figures.The data shows that the overwhelming majority of these entitlements were social security pensions, which rose by €4.8 billion between 2012 and 2016. Social contributions paid under the pension system rose to €1.6 billion, an increase of more than €400 million from 2012. Total pension payments amounted to €700 million by the end of 2016, more than three quarters of which was used to cover old age pensions. In 2016, there were nearly 219,670 social security contributors compared to 82,745 pension recipients.\n\nMeanwhile, treasury pensions - which accounted for 10% of the total - dropped by around €100 million. The NSO said this was a result of the treasury pension being replaced by the two-thirds pension in 1979, and hence being closed to any new government employees, while those currently eligible were increasingly reaching retirement age.On an international level, Malta was ranked in 11th place among 29 European countries (EU member states, Iceland, Norway and Switzerland) for pension entitlements as a proportion of GDP. The UK recorded the largest entitlements-to-GDP ratio with 402% followed by Austria (376%) and France (369%). At the other end of the spectrum, Denmark registered the lowest share with their obligations amounting to 96% of their GDP by the end of 2015.", "comment_count": 6, "id": 2325}, {"keywords": "Technology, Government", "author": "Ivan Martin", "article_body": "€40 million will be invested into the digitization of government services over the next three years including the gradual introduction of artificial intelligence and blockchain, Prime Minister Joseph Muscat said on Monday.\nA strategic plan for the digitization of public administration was launched this morning, with the primary aim of introducing the ‘once-only’ principle for online services.\nThe ‘once-only’ principle is an e-government concept that aims to ensure that citizens, institutions, and companies only have to provide certain standard information to the authorities and administrations once.\nOn this, Dr Muscat said Digital Ledger Technology, often referred to as the blockchain, would be integral.   \nRELATED STORIESMalta e-government services top EU surveyMalta Digital Innovation Authority unveiled\nDr Muscat said the strategic plan included around 150 measures with definite timelines for their implementation that would transform the public service's servizz.gov platform.\nPrinciple Permanent Secretary Mario Cutajar, the head of the civil service, said the reforms that will take place over the next three years would continue the overhaul of the sector that started a few years ago.\nThe aim was to bring the public service up to date, but to also prepare it for future emergent technological shifts such as artificial intelligence and DLT.\nWhat are the reforms? \nAccording to the document, digitization reforms will be carried out at at several different entities.\nIdentity Malta will see reforms particularly through the introduction of a new public registry system.\nAt the Health Department changes will be done to the pharmacy of your choice program, and a cross-border eHealth service will be introduced among others.\nThe Social Security Department will see a multi-phase reform of its elderly case management system.\nThe Education Department will undergo several changes including a school transport parent notification system.\nIn the sector of Finance, tax clearance certification will move online, customs will introduce a new tack and trace function, and artificial intelligence will be merged into the taxation system.\nIn the Tourism and Culture sphere, tourism zone monitoring will be digitized, and Gozo-specific services will migrate online.\nThe national emergency services will introduce a reverse 112 emergency notification system for citizens in danger. The emergency medical system will be integrated to the online system. Global navigation satellite systems will be used to detect emergency locations, and digital radios used by first responders will eventually be replaced by integrated communication tools.\nIn the transport sector, a number of new initiatives will be rolled out including a new bumper-to-bumper app, a smart parking pilot project for Xlendi, a Gozo ferry boarding prediction, and an online vehicle registration system by 2021.\nThe energy sector will see the launch of new services online and an overhaul of equipment used.\nIn the environmental sector a new Environment and Resources Authority website will be launched as well as a responsive website and mobile service for green public procurement. An online environmental applications system will be introduced, and a geo-portal for the management of valleys and water catchment.\nFor farmers, EU funding application systems will be improved, a new field monitoring system will be rolled out, and a new veterinary regulation division will system will be introduced. Finally, the reform will also see the introduction of a new system for the management of registration and transfer of properties.", "comment_count": 1, "id": 2326}, {"keywords": "Crime, Court", "author": "Edwina Brincat", "article_body": "A man suspected of being involved in a string of thefts spanning a three-month period, the latest dating back to February, was remanded in custody after pleading not guilty upon his arraignment on Monday.\nAliosha Emnadze, a 24-year old unemployed Georgian national, with no fixed address, was charged with five separate instances of theft from private residences at Msida and St Paul’s Bay and three other attempted thefts from a St Paul’s Bay flat and two Fgura homes, the latest being on June 1.\nHe was further charged with conspiring to commit such burglaries.\nUndisclosed amounts of cash and jewellery had allegedly been stolen in the burglaries.\nFollowing police investigations, the suspect was finally targeted and arrested, pleading not guilty to all the charges in court on Monday.\nNo request for bail was made at this stage.\nInspectors Shawn Pawney and Joseph Mercieca prosecuted. Lawyer Martha Mifsud was defence counsel.", "comment_count": 0, "id": 2327}, {"keywords": "Hunting and trapping, Environment", "author": "", "article_body": "More than 350 turtle doves, bred in captivity by members of the hunters’ lobby, have been released into the wild in Ta’Qali.The release was the third annual event in an ongoing project by the FKNK: 400 turtle doves were released in Buskett Gardens in 2017, and 700 at the shooting ranges in Żebbuġ, Gozo, last year. The FKNK said numbers this year were slightly lower because several birds were distributed to members for use as breeding stock. Moreover, the FKNK said it would later this year be setting up its own main breeding aviary, which would allow thousands of birds to be released into the wild in the next few years. “The released amount can serve as a compensation measure for turtle doves that may be taken from the wild in the Maltese islands,” it said. Turtle dove hunting has been suspended under a moratorium imposed in 2017 to address declining population numbers, but the FKNK lobbied unsuccessfully for the ban to be lifted ahead of this year’s spring hunting season. The FKNK said that, since 2017, it had organised a pool of large-scale breeders selling the birds’ stock offspring to the group for eventual release.“The species reproduces at a steady rate in captivity and large numbers in offspring are thus obtained and since a good number of the birds are being bought from different breeders, this ensures genetic diversity,” it said. “This project constitutes Malta’s concrete evidence’ contribution towards the species conservation status in the wild and the released birds will augment the wild migrating population.”The release was held at the start of the Game & Country Expo, a hunting industry showcase organised by the FKNK at the MFCC in Ta’Qali. Clint Camilleri, parliamentary secretary for agriculture, attended the event.", "comment_count": 27, "id": 2328}, {"keywords": "Court, Justice", "author": "Carlos Bugeja", "article_body": "The facts of the case of Francine Cini v Robert Galea, which was decided on June 3, were rather straightforward, if horrifically graphic.\nThe plaintiff, a nurse by profession, was at the respondent’s property, which held a variety of exotic animals, including a lion. She extended her hand into the lion’s cage in an attempt to stroke it. True to its primal instincts, the big cat grabbed the lady’s hand in its powerful jaws and mauled her arm, causing her substantial injuries.\nShe sued the lion’s owner, claiming that it was he who had encouraged her to stroke the lion, and therefore he was to be blamed for the accident. Presumably, she was acting in terms of Article 1040 of the Civil Code, which states that the owner of an animal, or any person using an animal during such time as such person is using it, shall be liable for any damage caused by it, whether the animal was under his charge or had strayed or escaped.\n\nUnsurprisingly, the defence brought forward by the respondent was that the injury suffered by the plaintiff was self-inflicted; in other words, he pleaded to the rule known by the Latin maxim volenti non fit iniuria.\nUnder our law, fault is a tricky concept. It is generally stated (in Article 1031 of the Civil Code) that every person shall be liable for the damage that occurs through his fault. It is further stated in Article 1032 (1) of the Civil Code that a person shall be deemed to be at fault if, in his own acts, he does not use the prudence, diligence, and attention of a bonus paterfamilias (a standard of care analogous to that of ‘the reasonable man’).\nIn tort (personal injury) cases, fault is often the principal contention; parties often entertain contradicting versions as to who is to be blamed for the event causing the injuries. But sometimes, one finds oneself asking deeper questions, such as: What if the event is not the respondent’s fault? What if it was the injured person’s fault? What if the injured person appearing as the plaintiff willingly and knowingly assumed predictable risks inherent to the activity in which he was participating at the time of his injury?\nThe plaintiff’s behaviour – albeit foolish – was hers and hers only\nSimply put, the doctrine of volenti non fit iniuria states that if someone volunta­rily places himself in a position where he knows that some degree of harm might result, he may not subsequently bring an action in tort against a third party. It exonerates that person who would otherwise be deemed to be responsible, for the fact that the victim would have knowingly assumed a certain level of risk for that act that caused the injury.\nThis is not a new concept; indeed, it can be traced back to ancient times, in the maxim famously formulated by the great Roman jurist, Ulpian: nulla iniuria est, quæ in volentem fiat (meaning: ‘no injustice is done to someone who wants that thing done’).\nThis defence is somewhat similar to another defence often brought forward in tort cases, that of ‘contributory negligence’. This is provided for in Article 1051 of the Civil Code, which states that if the party injured has by his imprudence, negligence or want of attention contributed or given occasion to the damage, the court, in assessing the amount of damages payable to him, shall determine, in its discretion, the proportion in which he has so contributed or given occasion to the damage which he has suffered, and the amount of damages payable to him by such other persons as may have maliciously or invo­luntarily contributed to such damage, shall be reduced accordingly.\nThe resemblance is apparent, but nevertheless, the legal difference is noteworthy. When one pleads ‘contributory negligence’, it means that one is stating that the claimant contributed to the damage suffered thereby and that the damages awarded are to be reduced in proportion to that fault, usually manifested in a percentage number which is cut from the compensation awarded (in proportion to the apportioned blame). The defence of volenti non fit iniuria is different; it is a ‘complete’ defence, in the sense that it seeks to totally exculpate defendant from any liability whatsoever.\nThe court considered in this case that there was no doubt that the plaintiff was aware of the possible consequences of putting one’s hand into a lion’s cage. She knew what could (or rather, would) happen, yet she decided to reach into the cage nevertheless, voluntarily assuming certain risks inherent to that same act. It found that it seldom mattered whether the respondent had encouraged her to do so, as the lion’s reaction was to be expected.\nThe lion was confined into a cage for a reason, and it was rather obvious that the lion would not react graciously to an unfamiliar intruder. As the saying goes – true, the lion is a mighty, noble animal, but it is an animal nevertheless!\nThe court found that the plaintiff had not managed to prove that the respondent had in any way acted in an illicit manner. The lion was properly registered and well maintained. There was nothing to indicate that the respondent had in any way forced the plaintiff to reach into the cage, and ultimately, the plaintiff’s behaviour – albeit foolish – was hers and hers only. She had acted with a profuse lack of prudence, so much so that she had voluntarily placed herself into unnecessary risk and danger.\nTherefore, if there was anyone to blame, it was the plaintiff.\nIn conclusion, the court moved to reject plaintiff’s request for damages, and also ordered her to pay the costs of the case.\nCarlos Bugeja is senior associate at Azzopardi, Borg & Abela Advocates.", "comment_count": 12, "id": 2329}, {"keywords": "Health, Crime", "author": "", "article_body": "Doctors For Life has challenged the Office of the Commissioner for Children to take an unequivocal stand to protect the unborn child, saying that recent reports indicate that the current position might be “wavering”.\nThe Commissioner for Children’s chief function, according to the law, is to “promote special care and protection, including adequate legal protection, for children both before and after birth”.\nLovinMalta recently reported that the Commissioner had tentatively given a green light for the government to adopt the UN’s recommendations for adolescent girls to have safe access to abortion and post-abortion services.RELATED STORIESDecriminalisation of abortion recommended\nDoctors For Life said in a statement that, since human life begins at fertilisation, the pre-born child was deserving of the full protection of the law.\n\"This is clearly the case here in Malta. It is our intention to ensure that this continues to be so.  Doctors For Life therefore expects the Commissioner to fulfill her statutory role and unambiguously state her position in defense of the life of the pre-born child,\" the statement said.\nDoctors for Life incorporating 670 doctors, was set up in reaction to a pro-choice group last month, called Doctors for Choice.", "comment_count": 49, "id": 2330}, {"keywords": "Banking, Finance", "author": "", "article_body": "Updated at 12.58pm with BOV chairman's comments\nBank of Valletta’s last correspondent bank for US dollars transactions is pulling the plug on its relationship with the Maltese bank come December. ING will stop clearing US dollar transactions for BOV as of December 14, the Maltese bank said in a brief statement to the market on Monday morning. “Bank of Valletta plc has intensified its endeavours to engage alternative correspondents to minimise any possible operational disruption to its business and its clients,” BOV said in its statement. Talk of ING ending its relationship with BOV has been swirling for several months, with the Dutch bank reportedly keen to cut ties with smaller jurisdictions it considers to be too risky to be worth serving. That de-risking exercise follows a hefty €775 million settlement ING agreed to pay for money laundering violations. Back in May, a BOV official had told Times of Malta that it was preparing for the eventuality of ING ending its relationship with the bank. “We are preparing for all eventualities and will find ways and means to widen the pool [of US dollar transaction providers],” the official had said.Bank of Valletta had already lost US dollar services through Deutsche Bank two years ago. Banks form relationships with other banks to ensure they can move capital quickly and easily between jurisdictions. A 2017 World Bank study found that these correspondent banking relationships have been gradually declining worldwide, as banks become less keen to take on risk and seek ways to cut compliance costs.  \n'Smaller jurisdictions badly hit' - BOV chairman\nBOV chairman Deo Scerri made reference to this general de-risking across the banking industry when speaking to Times of Malta about ING's decision. \n\"Smaller jurisdictions like Malta are being particularly hard hit, since the volumes of business they generate are not sufficient to be of interest to the larger players,\" he said. \n\"In their view, such business does not produce sufficient revenue to justify the costs incurred and the inherent risk\". \nMr Scerri said the bank was stepping up efforts to find an alternative US dollar clearing house, while also working internally to reduce its risk profile and strengthen its anti-financial crime structures, which would make it more attractive to potential correspondent banks. \nTwo \"global consultancy firms\" were overseeing this process, he added. \nPrime Minister Joseph Muscat sought to cast BOV's correspondent bank troubles in a positive light, arguing that they were due to the bank's growth over the past years. \nAs it grew, so too did its risk profile, Dr Muscat told reporters. ", "comment_count": 72, "id": 2331}, {"keywords": "Politics, Adrian Delia, PN", "author": "Keith Micallef", "article_body": "The Nationalist Party’s executive committee will be meeting on Monday evening to debate the “political situation” as embattled leader Adrian Delia faces calls from his own MPs to resign.\nThe timing of the meeting could be pivotal for Dr Delia’s future as it will take place 24 hours before the expiration of the ‘ultimatum’ given to him last week by the majority of his parliamentary group members.\nThe Sunday Times of Malta reported that, in a marathon session last Tuesday, ending at about 2.15am on Wednesday, Dr Delia was told to consider his position despite having been at the helm for less than two years.\nSuch drastic action was sought in the wake of last month’s electoral disasters and allegations that have dogged him even before he became leader.\nRELATED STORIESPN leader given until Tuesday to tell MPs what he intends to do\nHe is expected to come back with a reply on Tuesday evening, when the parliamentary group reconvenes. However, party sources said Dr Delia could make one last-ditch attempt to save his position if he manages to secure the support of the executive committee in Monday’s meeting.\nApart from the timing of the meeting, suspicions that such a move could be on the cards were further fuelled by the fact that the agenda includes a debate on the “political situation”.\nTiming of the meeting could be pivotal for Delia’s future\n“In the circumstance, it could be the case that Dr Delia will seek the support of the executive committee to be able to put himself in a strong position when facing the parliamentary group the following day,” they said.\nNonetheless, some of the PN leader’s fiercest critics said such a ploy would neither help to regain the trust of the parliamentary group nor make him electable.\n“The very fact that Dr Delia is finding the full backing of the Labour media not to relinquish his post speaks volumes about his potential to become prime minister,” they said.\nDr Delia was conspicuously absent on Sunday as he neither addressed political activities nor gave comments on the PN’s radio station, as is the norm on Sundays. This was even more telling when considering that fresh allegations were levelled against him by a former business partner, Kris Bajada, in a news item appearing on Malta Today.\nAccording to Mr Bajada, who was also a close friend of the PN leader, Dr Delia’s signature on documents at the heart of a money-laundering investigation was genuine.\nThe existence of the documents, which had been reported by the Times of Malta last March, cropped up during an investigation by the government’s anti-money laundering agency, FIAU.\nIt was looking into claims that Dr Delia had been involved in a prostitution racket in London, some 15 years ago.\nWhile denying any wrongdoing, Dr Delia had insisted his signature had been falsified to the point that he had asked the Police Commissioner to launch an investigation into the matter.", "comment_count": 49, "id": 2332}, {"keywords": "Human rights, Gender, Media", "author": "", "article_body": "A man who wrote that pro-choice activists should be shot “in the head one by one” has been reported to the police. The Facebook comment, posted by a user beneath a TVM article about a demonstration in Valletta, said activists carrying pro-abortion banners deserved to be killed.\nActivists from Moviment Graffitti and Voice for Choice held up signs reading \"my body, my life, my choice\" and urged authorities to \"trust women\".\nRELATED STORIES'I have a bullet waiting for you'\nLawyer and activist Lara Dimitrijevic highlighted the comment on her Facebook wall and said she would be reporting the person to the police.\n“Right to peaceful protest is a right as much as is freedom of speech,” she wrote.\nShe subsequently told Times of Malta that she had filed a report about the comment with the police on Sunday afternoon. \n\nHate speech and incitement to violence are both crimes under Maltese law. A 2018 Eurobarometer survey found that Malta has the highest rate of online hate speech across the EU.\nDr Dimitrijevic is no stranger to reading hate speech or death threats: her work as director of the Women’s Rights Foundation makes her a prime target for abuse and threatening language, as she told Times of Malta last February.", "comment_count": 278, "id": 2333}, {"keywords": "Construction, Demonstration", "author": "", "article_body": "Updated 12.30pm\nMembers of Repubblika’s executive committee will be taking part in the anti-construction protest being organised on Tuesday by Moviment Graffitti and is encouraging its members and the public in general to join them.\nThe protest will start from St Luke’s Hospital at 6pm and proceed towards the Malta Developers’ Association offices.Repubblika said it agreed with Moviment Graffiti that developers were doing \"as they please” all over Malta, to the detriment of residents who have to face, day to day, noise, dust, road closures, traffic, illegal dumping of waste, physical hazards, and the arrogance of the developers.\n“We have reached a point where construction workers’ lives are being systematically sacrificed as developers ignore health and safety rules.\"It is evident that the Planning Authority is yet another captured state institution, which instead of promoting the common good enables the greedy developers’ illegitimate exploitation of our country’s natural resources,” Repubblika said.\nLeftist think-thank Żminijietna also announced on Monday that it would be joining the protest. In a statement, the group said: \"It is the responsibility of the state to protect residents from such behaviour. Authorities should be given greater powers to make it easier for them to act. To have families being evacuated from their homes due to the arrogance of building developers is no longer acceptable.\"", "comment_count": 10, "id": 2334}, {"keywords": "Politics, Gozo", "author": "Ivan Camilleri", "article_body": "Dredging works at Mġarr harbour, which ‘pushed’ the Gozo Ministry to offer a free crane service not to inconvenience pleasure boat owners, were suspended as the equipment was required to replenish two bays in Malta, the Times of Malta is informed.\nA few days before the European elections last month, the Gozo Ministry offered a free crane service to owners of private boats wanting to launch their craft for the summer season.\nThat raised a few eyebrows, amid accusations it was “another vote-catching exercise by the Gozo Ministry”. However, Gozo Minister Justyne Caruana immediately defended the decision, saying it was necessitated by the ongoing dredging works at the main harbour that were scheduled to take some time.\nDredging works stopped soon after the May 25 elections and machinery transferred to Malta\n“The Minister for Gozo offered this service since the ongoing dredging works at the harbour precluded the use of the main slipway in Mġarr,” a spokesman had told this newspaper.\nNow it seems the works would take even longer, thus causing more inconvenience to private boat owners, because the dredging works stopped soon after the May 25 elections and machinery was transferred to Malta to be used on two other projects in Birżebbuġa and Marsaxlokk.\n“If there were doubts that the Gozo Ministry’s free crane service was an election ploy, they have now been removed,” maritime industry sources said.\n“If the Gozo Ministry truly wanted to ensure boat owners were not inconvenienced it should have pressed for the works to be speeded up rather than be temporarily suspended,” the same sources remarked.\nThe Times of Malta has received photographs of the works showing the same dredger, owned by Bezzina Shipyards, that was used in Mġarr engaged in other works at Marsaxlokk a few days after the election.\nWorks in Mġarr are expected to continue once the job at Għar l-Aħmar Bay, in Marsaxlokk, is completed.\nThe replenished beach at St George’s Bay, Birżebbuġa, was officially opened yesterday.", "comment_count": 13, "id": 2335}, {"keywords": "Court", "author": "Keith Micallef", "article_body": "Long-awaited changes to the competition law meant to restore the watchdog’s teeth fall short of expectations amid concerns they will result in long-drawn out court proceedings even in minor cases.\nThe criticism was made by the Consumers’ Association and an expert in competition law when the Times of Malta sought their views on the amendments approved by Parliament at the end of last month.\nThe changes had been in the pipeline for three years, following two landmark judgments involving the Federation of Estate Agents against the director for competition in 2016 and a recent decision in the case the Nationalist Party instituted against the Electoral Commission.\nIn both cases, the Constitutional Court concluded that the imposition of fines was a matter of criminal nature and, consequently, could only be handed down by a proper court.\nOver the past three years, the Office for Competition within the Malta Competition and Consumer Affairs Authority could not impose any fine, thus becoming effectively toothless.\nIn its reaction, the Consumers’ Association said its main worry would be that practically all cases would have to go to court, regardless of whether to have a fine imposed or an order to stop a malpractice. The Constitutional Court concluded that the imposition of fines was a matter of criminal nature\n“The main effect is that whereas previously we used to wait months if not years to get a decision from MCCAA [through its respective DGs], now we have to wait much longer to get the decision, since these DGs need to institute proceedings before the court, defend their case and then wait for a judgment, which, incidentally, is subject to appeal before the Court of Appeal,” it noted.\nIt remarked that this model did not bode well for effective regulatory intervention whether for consumers or businesses.\n“The effects of malpractice - for example, misleading advertising - are felt immediately and having a decision prohibiting such a practice years later doesn’t make sense,” the association commented.\nIt pointed out that, apart from Austria, whose model was like Malta, EU countries had a much more practical way to come to a decision while still fully respecting fundamental human rights.\n“The legislator should have tried to find a better balance between, on the one hand, the public’s interest, notably that of consumers in general, to curb in good time malpractices – some of which can be pretty serious - and, on the other hand, the protection of the rights of the person under investigation,” it said.\n“The law as amended fails to achieve such a balance and, in our opinion, actually aggravates matters insofar as the protection of consumer rights is concerned,” it added.\nA competition lawyer, who preferred to remain anonymous, said the amendments did not provide for any measures impacting the powers of entities like the Electoral Commission. Consequently, he expressed concern that other lawsuits would be made to contest the powers enjoyed by other public authorities to impose fines.\n“The government should have considered addressing matters in a holistic manner. However, for reasons which have not been explained, this was not done,” he said.\nFurthermore, the lawyer pointed out that one of the points made by the Constitutional Court in determining that ‘administrative fines’ were of a criminal nature was the substantial amount of the fines.\n“Yet under the new procedure, all cases, irrespective of the quantum of the fine, must be referred to court,” he noted.\nThe changes appeared to have gone beyond what was required by the Constitutional Court in the Federation of Estate Agents’ judgment, the lawyer pointed out.\nThe director for competition was forthwith required to apply to court, not only for the imposition of a fine in case of a breach of competition law but also to issue compliance orders, he said.", "comment_count": 3, "id": 2336}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe need for harsher penalties and tighter rules in the construction industry was the main story in the Times of Malta, with proposals to be published on Monday. It also had a story on concerns over changes to competition laws.\nThe Malta Independent also features the proposals for the construction industry but its main story is the battle against single-use plastics which will gain momentum this summer.\nL-Orizzont gives prominence to the construction laws story with its headline quoting the prime minister as saying that lives should come before the millions being made by developers. The newspaper also notes that its staff are finalists in three categories of the media awards.\nIn-Nazzjon delves into the problems being caused by the rapid influx of people requiring work permits, saying that not only the foreigners but also Identity Malta staff were suffering from the resulting pressure. It also reports that police are still waiting to be paid for extra duties carried out.", "comment_count": 0, "id": 2337}, {"keywords": "Civil society, Justice, Daphne Caruana Galizia", "author": "", "article_body": "Civil society activists and well-wishers gathered at the Great Siege Memorial in Valletta on Sunday evening for a monthly vigil marking the assassination of journalist Daphne Caruana Galizia. \nPeople placed candles and flowers at the foot of the memorial, which they have used to remember Ms Caruana Galizia in the months following her murder in October 2017. \nFive people read out prepared speeches at the vigil. Among them was Spanish whistleblower Ana Garrido Ramos, a former local government employee who exposed a kickback scheme that stretched to the highest levels of power. \nThe 300-page dossier she compiled proving the corruption eventually led to the downfall of Mariano Rajoy’s government in 2018. \n“There are many cases in the world like Daphne's or like mine; in which the system hits us hard punishing us for doing the right thing,” Ms Garrido Ramos told the audience. \n“We all know how the system works, with its large tentacles of power. But just as corrupt psychopaths weave their nets; we, those of us who believe that we can transform the world, fight against injustice and lack of protection, and without hardly realising it, we are also weaving our networks”.\nJoanna Agius, Manuel Delia, Mario Grech and Sabatino Caso from the Comunita' di Sant' Egidio in Italy also spoke. \nMr Delia used his speech to lambast Prime Minister Joseph Muscat for having made it a point to tell EU leaders last Friday that Malta enjoyed freedom of speech. \n“Here we are open in everything, in the sky and in the freedom of speech,” Dr Muscat told leaders during a South EU summit in Valletta, in an apparent nod to protesters outside.\nMr Delia said the protest had shocked Dr Muscat.\n“A king who has to constantly remind us that he respects free speech, does not respect it at all,” he said.\nMs Agius told people that the Muscat government had been caught in flagrant acts of impropriety but remained put and said that the re-election of MEPs David Casa and Roberta Metsola was proof that the fight for truth and justice for the Caruana Galizia family was bearing fruit.\nMr Grech urged the audience to remain “consistent, persistent and insistent” in their demands for transparency and justice, while Mr Caso said that the memory of brave men and women who battled injustice could, over time, change societies. \n“I saw in Sicily how the memory of Falcone and Borsellino, and many more mundane ones, gave rise to a movement which over time changed a historic, structural culture consenting to injustice - to the Mafia,” he said.", "comment_count": 16, "id": 2338}, {"keywords": "Court", "author": "Victor Paul Borg", "article_body": "The Justice Minister’s evasive replies in Parliament to basic questions on the Committee for Judges and Magistrates, a constitutional organ for sanctioning errant judiciary, has raised doubts about the functioning of the committee.    \nIn a parliamentary question, Claudette Buttigieg asked when the CJM began to function after its establishment in law three years ago. She also requested data on the number and nature of sanctions every year.\nOn May 29, Dr Bonnici “referred” Ms Buttigieg to “the reply given to parliamentary question 13811”.\nThat PQ goes back 10 years to a different administration, when a different justice minister was asked whether meetings of the Commission for the Administration of Justice had been adjourned indefinitely. He had replied that although it was not his role to “supervise the conduct” of the Commission, he was informed that “the meetings of the Commission had not been adjourned sine die [indefinitely].” The CJM is a subcommittee of the Commission.\nThe Sunday Times of Malta asked Dr Bonnici why he couldn’t provide information to Parliament that’s presumably contained in reports: the Constitution obliges the Commission to compile annual reports to the justice minister “on its activities during the previous calendar year”.\nThe minister was also asked whether the Commission’s operations are “relevant to parliamentary oversight and discussion”.\nHe did not reply.\nDr Bonnici’s evasiveness will exacerbate concerns over the justice system that have been heightened since the Council of Europe’s Venice Commission – the constitutional body for ‘democracy through law’ – made a raft of recommendations last December to buttress Malta’s weaknesses in rule of law and judicial independence.\nJustice analysts say that the trust deficit in the judiciary is enhanced by the opacity of the Commission for the Administration of Justice, whose organs are tasked with appointing and sanctioning the judiciary. \nThe Commission does not engage with the media nor give any information about its procedures.\nFor example, a complainant told the newspaper on Saturday that she has not heard back from the Commission 10 weeks after making a complaint. Lynn Zahra, a lawyer who presides over a local tribunal as a Commissioner of Justice, delivered her complaint against recently appointed judge Francesco Depasquale for “abuse of judicial powers” on April 5. \nThe Sunday Times of Malta has no perspective on the substance of the complaint since it is not privy to the accused’s response: it is being summarily reported here in the context of the Commission’s accountability and functionality.  \nAn email sent to the Commission asking if complainants are informed in the event that the Commission decides not to proceed with the case after considering the accused’s response remained unanswered.    \nGovernment ‘acting in bad faith’\nAn expert in constitutionalism and Malta’s legal system last week accused the government of “acting in bad faith” in its patchy adoption of Venice Commission recommendations.\nHe was referring to those recommendations that have been transposed into a parliamentary bill designed to reassign the Attorney General’s (AG) current advisory role to government to a new office. \nKevin Aquilina, former dean of Faculty of Law of the University of Malta, also wrote in the Online Law Journal that the government is “purposefully dragging its feet” in implementing the Venice Commission’s recommendations.\nThe professor argues vehemently against the Bill within the context of upholding separation of powers, rule of law and judicial independence. \nMalta rapporteur at the Council of Europe’s Parliamentary Assembly, the Dutch MP Peter Omztigt, also criticised the bill for “fall[ing] short of Venice Commission recommendations in several important respects”.\nThe Bill, currently in its second reading in Parliament, has intensified criticism that was already febrile after the government’s “rushed” judicial appointments on April 25 prior to carrying out recommended reforms.  \nThe European Commission last week called for “strengthening the independence   of the judiciary, in particular, the safeguards for judicial appointments and dismissals.”\nThe Council of Europe’s Parliamentary Assembly shall this month formally “call upon Malta to implement as a matter of urgency the reform packages recommended… in their entirety”.\nThe Bill currently in Parliament is incompliant “with modern notions of rule of law”, according to the Venice Commission, by omitting to introduce legal provisions for judicial review or challenge of the AG’s discretion in commencing or abandoning criminal prosecutions.\nIn its piecemeal, fragmentary approach, the government has failed to address the AG’s other impingement on judicial independence: his presence on the Commission for the Administration of Justice and the Judicial Appointments Committee (JAC), which assesses candidates for the judiciary.\nThe European Court of Human Rights (ECtHR) denounced the presence of state prosecutors, or the AG in Malta’s terminology, on bodies that appoint and sanction the judiciary as “a potential threat” to judicial independence and impartiality.  \nThe seminal judgment – Volkov vs Ukraine – spoke of a “deterrent effect on judges” and enunciated that the prosecutor or AG sitting “on a body concerned with the appointment, disciplining and removal of judges creates a risk that judges will not act impartially in such [court] cases [that prosecutors participate in] or that the Prosecutor General will not act impartially towards judges of whose decisions he disapproves”.\n‘Threat’ to impartiality\nA source familiar with deliberations of the ECtHR in Strasbourg told this newspaper that the presence of the two other lawyers on the Commission is equally or more questionable for the same reasons.  \nOne of them, Louis de Gabriele, sits on the Commission and JAC by virtue of being the president of the Chamber of Advocates. The JAC assesses candidates for judicial appointment or promotion and the Commission hears appeals to disciplinary decisions against the judiciary by the sanctioning committee.\nThe other lawyer, Pawlu Lia, sits on the Commission as the Prime Minister’s appointee. Controversy has dogged Dr Lia’s appointment since it emerged that he has represented the Prime Minister as his private lawyer in the past, and more recently after his daughter-in-law, Nadine Lia, was appointed to the bench on April 25.\nThe source close to the ECtHR said that the presence of litigating or prosecuting lawyers on bodies that appoint or sanction the judiciary would work against Malta in potential cases taken to Strasbourg for breach of fair-trial provisions.\nMalta has one of the worst track records in Strasbourg: recent analysis by Judge Emeritus Giovanni Bonello showed that nine out of 10 cases are lost by the Maltese government.\nChamber president  on ‘intellectual integrity’ of judiciary\nThe president of the Chamber of Advocates, Louis de Gabriele, took a line implicitly critical of the constitutional lawsuit of Repubblika in his speech during the recent inaugural session of one of the latest judicial appointees. The NGO has filed an ongoing constitutional challenge to the system of judicial appointments, including the latest complement of appointees, within the context of judicial independence and fair-trial provisions. Dr de Gabriele said that any reform to the system of judicial appointments is “a political matter” and “great care is needed before attempting to address it via judicial process.” Asked to elaborate in view of the fact that justice experts have been telling this newspaper that the constitutional court is an appropriate venue for Repubblika’s challenge, Dr de Gabriele said the issue “can only properly be dealt with by the political class. Even if, hypothetically, a court were to find merit in the Repubblika case, it is still the political class that will have to fashion a remedy if the law in its current state were to be found wanting.” The Sunday Times of Malta has also in recent weeks carried reports in which experts in EU law – including Monica Claes, a Dutch professor who has authored many papers on EU constitutionalism – have said that Repubblika’s request in front of Malta’s constitutional court deserves to be settled at the European Court of Justice. In his expanded comments on the subject, Dr de Gabriele maintained that “it would be an over-simplification to equate judicial independence simply to the mechanism of appointment”, even if it’s “albeit a fundamental feature.” In his speech and comments he alluded to the “intellectual integrity” of the judiciary several times as another measure of judicial independence. In one instance in his speech he talked of “an important tradition” of the judiciary showing the “intellectual integrity” to transcend any predilections or sensibilities of their former roles, and maintained that he had “no doubt” that the new judge in front of him, Joanne Vella Cuschieri, would live up to that tradition. This is an allusion to the political party provenance of much of Malta’s judiciary.Madame Justice Vella Cuschieri was a failed Labour election candidate in 2013 before being appointed magistrate in 2014. She has since build a reputation in court for being decisive, hard-working and for not taking nonsense from lawyers or litigants. In its jurisprudence, the European Court of Human Rights (ECtHR) talks of two measures of judicial impartiality in respect of possible breaches of fair-trial provisions: the “subjective” or personal prejudice of the judge as well as “the requirement of objective impartiality” that is a correlate between the manner of judicial appointments and judicial impartiality. The ECtHR elaborates that “to establish” whether a court “can be considered independent, regard must be had, inter alia, to the manner of appointment of its members and their term of office, the existence of safeguards against external pressure and the question whether the body presents an appearance of independence”.It adds that “even appearances may be of a certain importance or, in other words, ‘justice must not only be done, it must also be seen to be done’. What is at stake is the confidence which the courts in a democratic society must inspire in the public”.In his speech Dr de Gabriele echoed the criticism of the government’s discretion in making judicial appointees and talked of the “superior model of lessened participation by the executive organ”. This chimes with the Venice Commission’s exhortation of the “potential political influence” on the judiciary though the Prime Minister’s “power to influence [judicial] appointment”. The current system has also been faulted for shallowness of the assessment criteria, absence of competition among candidates for specific vacant posts, and the opacity and composition of the assessing body. In contrast to increasingly impatient criticism from other justice experts, Dr de Gabriele’s criticism of the system of judicial appointments is comparably muted. He points out that it “has been with us since independence”, it has “served its purpose well over time”, and then adds that “it can, like any other system, be improved.”In other comments that are incongruous with the spirit of jurisprudence of the ECtHR, he also told The Sunday Times of Malta he does “not believe there is any conflict of interest at all” in his participation, by virtue of being president of the Chamber, on the committee that assesses candidates for judicial office and promotion, as well as the body that hears appeals to disciplinary decisions on the judiciary.", "comment_count": 11, "id": 2339}, {"keywords": "Construction, Justice", "author": "Ivan Martin", "article_body": "Architects would have to report on the measures being taken to protect neighbouring buildings from demolition and excavation works, under proposed laws to be published on Monday.\nThe legal amendments were drafted by the authorities and sent to industry stakeholders last week following a series of consultative meetings. \nThe recommendations come at the end of a week which saw a building collapse in Mellieħa and the wall of another fall apart in Guardamangia. In April, an apartment block next door to a building site had crumbled in the dead of night.\nStakeholders have been given a week to provide feedback on the proposals amid a temporary ban placed on all demolition and excavation works. \nThe proposals, seen by The Sunday Times of Malta, call for the introduction of what is being called a “geotechnical design report”.\nThis would be drafted by an architect and would detail, among other things, what measures are to be taken to protect the structural integrity of neighbouring properties throughout the demolition and excavation works on a site.\n It would also detail the measures to be taken to ensure third party properties would not be impacted throughout the construction phase of a project.\nDevelopers would be obliged to conduct a structural investigation of the area to be excavated, before digging can commence.\nThe proposals also seek to iron out loopholes when it comes to site managers, who must either be architects or appointed by an architect.\nThe events of the past weeks have thrown a spotlight on the industry\nSite managers are currently appointed by the developer and, aside from architects, are responsible for ensuring that all which has been proposed by the architect, such as the method of demolition or excavation, is properly implemented. \nIn the future, if a site manager were to note any irregularities they would be legally obliged to notify the Building Regulations Office and architect involved in the project. \nCurrently, the law states that sites are to be covered by a minimum €500,000 insurance policy.  The proposals seek to increase this minimum to €750,000. The policy would have to remain valid until the completed works are certified by an architect. \nThe proposals also call for the fines faced by those who do not adhere to the method statement to be increased from €500 to €10,000. \nIgnoring an enforcement order would carry a fine of up to €50,000 – it currently stands at €10,000.  \nMeanwhile, architects and developers will be meeting this week to “iron out differences” and come up with a common position on the future of the construction sector. \nThe Kamra tal-Periti and the Malta Developers’ Association were scheduled to hold a meeting at the end of this month but the sit-down was brought forward to this Tuesday in the wake of the latest building collapse. \nArchitects and developers, the KTP said, have reached an understanding that in this critical juncture for the industry, it is important to converge towards a common position for the good of the country.\nSources said that while the MDA and KTP agreed on the main thrust of the architects’ proposed reform, sticking points on liability and sensitive wording of legislation re-mained. Architects have also called an extraordinary general meeting of the chamber for this Friday.\nThe KTP is also holding talks with various industry stakeholders about its reform proposals.\nFurther meetings are also scheduled to take place with the Chamber of Engineers, the Chamber of Commerce and the Building Industry Consultative Council.\n“The events of the past weeks have thrown a spotlight on the industry as a whole, including on the profession, which most certainly has its own responsibilities to carry with regard to the current state of affairs, as do all the other operators involved,” the KTP said.\n“The issues we are facing are complex, and the fast pace of the industry is stretching resources beyond capacity, yet none of this justifies relaxation of standards and lack of diligence.”\nA historical note\nThis is not the first time that the authorities have been called upon to halt works on construction sites on the back of serious incidents. \nTurn the clock back more than 100 years to October 1914 and the then Instituto dei Periti Architetti (Institute of architects) had written to the Chief Secretary to Government, requesting legal intervention. \nWriting in Italian, the institute had said that “given the repeated disasters” that had occurred due to buildings being built without an architect’s guidance, the government should intervene.\nA unanimous vote among architects at the time had called for no permit requests for buildings or other edifices to be considered unless underwritten by an architect.\nThey had also called for building works conducted without the direction of an architect to be considered illegal and for the authorities to intervene in such cases.\nAD’s reaction\nBuilding industry regulators are little more than “letterboxes” set up to receive reports, Alternattiva Demokratika said on Saturday.\n“Building industry regulatory authorities do not have the resources to carry out their responsibilities, which they have abdicated,” AD chairman Carmel Cacopardo said at a press conference in Guardamangia.\nThe government, he said, would now be rushing through emergency regulations in the coming days. While these would only serve as a temporary fix, the long-term solution was to ensure that enough resources were made available to continuously monitor the construction sector.", "comment_count": 28, "id": 2340}, {"keywords": "Politics, Aviation", "author": "Ivan Camilleri", "article_body": "Air Malta pilots will be meeting on Tuesday to discuss their future following the launch of Ryanair subsidiary Malta Air, amid fears the national airline will be driven out of the market.\nThe meeting is being organised by the pilots’ union ALPA. Malta Air was set up following agreement with the government, which has welcomed it into the market.\nHowever, pilots are expressing concerns. “We are mostly worried not because of the new airline, as Ryanair has been here for many years,” a cockpit veteran said.\n“We are more concerned about the government’s real intentions over this deal, teaming up (it has 1 Ordinary B share in the new airline) with a company which has practically brought Air Malta to its knees,” he told The Sunday Times of Malta.\n“The problem is not competition,” said a first officer. “The real problem is the long-term hidden agenda. We are not stupid. Malta Air – or Air Malta in reverse – will slowly dilute the national airline and make us irrelevant. The unwritten intention is to drive us out of the market. A slow death.”\nSo far in the highly unionised national airline, only ALPA appears to have expressed worries about this major development in the local aviation sector. The GWU, which represents the bulk of the airline’s staff, has not yet voiced any concerns and neither have the cabin crew and engineers’ unions.\nFollowing the Malta Air announcement last week, the government, through Air Malta chairman Charles Mangion, a political appointee, met the unions individually to reassure them that Malta Air will not compete with Air Malta. He is expected to tell the pilots the same thing on Tuesday.\nWhat’s the deal?\nRyanair, the most successful of low-cost carriers, has been operating in Malta for at least a decade. It offers cheap flights to many destinations, eating away at Air Malta’s market share, which as a legacy carrier cannot compete despite changing its business model.\nRyanair operates six planes in Malta, flying to 61 destinations. Over the past few years it has surpassed Air Malta in the number of passengers carried in and out of the country, despite the fact that Air Malta also increased the number of passengers and destinations, save for a period when the government was trying to shrink the airline to sell it to Alitalia.\nThrough the new deal with the government, the six Ryanair planes will be painted with Malta Air colours – the same red and white used by the national airline, together with a similar logo – the Maltese cross – used on Air Malta tails.\nExperts describe the livery and the name of the new Ryanair subsidiary as “a clone of Air Malta,” deliberately chosen. According to the few details given, it will register its planes in Malta while its 350-strong staff manning the current fleet, will pay taxes in Malta.\nWhat will Ryanair change?\nSo far nothing – just its marketing which will be boasting some connections identical to Air Malta’s. In the long term, Ryanair intends to boost its Malta Air fleet to 10 planes – a similar number to Air Malta’s – and increase flight frequency and destinations.\nIt will also look to having the maintenance of its planes carried out in Malta. The service is already offered by Lufthansa Tecknik and SR Technics to several other airlines.\nAccording to experts, this could possibly lead to the future “sale” of Air Malta’s hangars and engineering team. The government already had plans to hive off these facilities.\nWas government needed?\nNo. Ryanair is much bigger than Air Malta and generates a turnover of nearly €7.5 billion.\nAn industry expert who spoke to The Sunday Times of Malta described the new partnership as “very strange” – the Maltese government is the largest shareholder in Air Malta and Ryanair is its largest and harshest competitor.\nAir Malta employees who spoke to this newspaper expressed their disbelief that one of their own directors, Ronald Mizzi, had signed the deal with Ryanair on behalf of the government as Tourism Minister Konrad Mizzi’s Permanent Secretary.\n“They really have lost the meaning of conflicts of interest,” a senior Air Malta official observed.\nUnder EU rules, Ryanair could have done whatever it did without the permission or involvement of the Maltese government.\nWhat’s in it for the government and Ryanair?\nAccording to experts, the deal is “an excellent one” for Ryanair as it has tied the government’s hands whenever it needs any form of support. Ryanair already benefits from millions of euros in subsidies from Maltese taxpayers given in the form of “marketing” help whenever they open a new route, in order to get around EU competition rules.\nUnder this deal, Ryanair would find it easier to “pull strings” at the Malta Tourism Authority if it needed to, an aviation expert said. At the same time, despite what the government is describing as “a golden share”, it will have absolutely nothing to do with the running of Malta Air.\nMalta Air is formed of 150,000 Ordinary A shares owned by Gulliver Holding Ltd – a Ryanair subsidiary – and just one Ordinary B share held by the Tourism Ministry.\nWhile the government has accepted that it will not be represented on the airline’s board of directors, and is a dormant shareholder, it only tied Ryanair to the condition that it will need the government’s permission to change the name of the airline.\nHowever, Ryanair is not tied down by any conditions on how and when to invest – it can always decide to close down Malta Air and open a new airline with a new name.\nCan the airlines co-exist?\nSome experts have their doubts, particularly due to the constraints of the Maltese market, even though on paper there is nothing precluding this. Despite Prime Minster Joseph Muscat’s reassurances that the two airlines will not compete against each other, the reality may be quite different.\n“Do not buy what Dr Muscat is saying,” one expert said. “Ryanair and Malta Air will fly to Rome, London, Catania and Brussels, sometimes to different airports but to the same destinations. These are among Air Malta’s most popular routes. Through the new airline, and now with the help of the government, Malta Air will eat further into Air Malta’s pie. That is obvious.”\nMissing details?\nThe deal is seen by some as a long-term strategy to let Air Malta die a natural death and re-open a new Maltese airline.\n“Obviously, Malta cannot depend on Malta Air (Ryanair in disguise). At the same time, Air Malta as it is cannot survive,” one expert argued.\n“Our reading of the latest development is quite clear. It’s a long-term plan for Air Malta to shut down and transfer operations to a new airline in a seamless, undisrupted way. That will give the government the opportunity to have a new airline, with fewer staff, higher efficiency, new working conditions and less unions.\n“So far the deal looks excellent for Ryanair, good for Malta’s tourism industry, bad for Air Malta and disastrous for its employees’ future. Obviously, no government will admit this plan, openly.”\nNeither the government nor Ryanair answered questions sent by The Sunday Times of Malta until the time of writing.", "comment_count": 80, "id": 2341}, {"keywords": "Health, Society", "author": "Sarah Carabott", "article_body": "Widows are at a higher risk of suicide than widowed men, according to figures from the last 24 years.\nThe study looked at completed suicides in Malta between 1995 and 2018. It found that nearly half of the people who died by suicide were married.\nThe study, which was presented by consultant psychiatrist Ethel Felice at a seminar on suicide prevention organised by the Maltese Association of Psychiatry, was based on 635 suicides. Men made up 80 per cent of the victims.\nRELATED STORIESSuicide data can help police prevent death - inspectorPlea to ‘break the silence on suicide’\nInformation on marital status was available for 559 people in all: 46.5% were married, 4.7% widowed and 6.8% separated. The marital status was similar across genders. \nHowever, only two per cent of the men who died by suicide, compared to 14.7% of the women, were widowed. \nDr Felice flagged marital status as a significant finding.\nStudies abroad have shown that men benefit from marriage more than women, given women’s investment in caring for the family. This would place widowers at a higher risk of dying by suicide than widows.  \nSignificant others need to be taught to recognise signs and refer them to the appropriate services\nHowever, the contrary appears to be true in the local context, according to Dr Felice. The figures show that being widowed puts women at a higher risk for suicide than men.\nRELATED STORIESMen committed 20 of 25 suicides in 2017Opposition calls for return of 24/7 Crisis Intervention Unit\nDr Felice made a series of recommendations, including having more accurate and consistent classification and recording of suicide according to intent.\nShe also suggested national data collection through regular surveillance or a suicide database. This would be essential to the implementation of a national strategy or action plan for suicide prevention. At the moment, there is no national suicide prevention programme for the Maltese population. \nAnother important recommendation was to improve the provision of mental health care. Given that nearly half of the individuals in the study had never had contact with psychiatric services, significant others needed to be taught to recognise signs and refer individuals to the appropriate services. \nInterventions ought to target men, people in the 30 to 49 age group and those at risk of unemployment, said Dr Felice. \nThe data shows a fifth of the 467 people about whom employment status was available were unemployed. More than a quarter were pensioners while 4.5 per cent were students.\nIn numbers...\n■ One person dies by suicide every 40 seconds in the world – a total of 800,000 every year.■ It is second leading cause of death globally for those aged between 15 and 29.■ Debt and unemployment were the factors most strongly associated with rises in suicide during the recession in Europe.■ In almost all regions of the world, suicide rates are lowest under the age of 15 and highest over the age of 70.■ Mediterranean countries have overall lower suicide rates than other European countries. However, while European countries have shown a clear drop in suicide rates, rates in Malta have shown a notable increase.", "comment_count": 15, "id": 2342}, {"keywords": "Tourism, Environment, Beach", "author": "Philip Leone Ganado", "article_body": "A new sandy beach at St George’s Bay in Birżebbuġa has been opened to the public for the first time after being replenished with sand dredged from the seabed.The ‘temporary re-nourishment’ project is one of three planned for bays in the south of Malta this summer. It involved the dredging up of 1,500 cubic metres of sand, extending the beach by around 25 metres. Opening the beach on Sunday, Tourism Minister Konrad Mizzi said the project had the full blessing of the environment authority and, since the sand had come from the bay itself, would have no negative impact. In the coming days, he said, similar beaches would be opened at Sliema's Balluta Bay, which will be financed by the new Marriott Hotel, and L-Għar l-Aħmar in Marsaxlokk, where a barrier will be put in place to protect the new beach.\n\nMeanwhile, he added, the environment authority had just given the go-ahead for works at Il-Fajtata, a small inlet in St Thomas Bay, Marsascala.“This is all part of government's commitment to improve the tourism project and help people better enjoy these bays,” Dr Mizzi said. The replenishment projects follow a pilot project at Balluta Bay last summer, which lasted just seven months after storms swept the sand away.The agreement with the nearby Marriott to repeat the project includes a commitment by hotel owners to replenish the bay for the next five years.\nAuthorities have pledged that the beach will remain public, with no concessions granted to the hotel, although the mayor of St Julian's has nevertheless expressed concerns over the arrangement. The Marsaxlokk project, meanwhile, is planned to be a semi-permanent fixture, with a roughly 15-year lifespan depending on intermittent top-ups. A submerged beam is intended to stop the sand from escaping back beneath the waves when the first storms hit at the end of summer.The new beach at St George’s Bay, by contrast, has been put forward as a “temporary extension”.", "comment_count": 12, "id": 2343}, {"keywords": "Construction, Politics, Joseph Muscat", "author": "Keith Micallef", "article_body": "Updated at 11.56am\nHarsher fines for construction lawbreakers, tighter regulations for site managers and architects, and new procedures to close existing loopholes in industry laws are among the changes set to be unveiled on Monday, the Prime Minister announced on Sunday.Joseph Muscat was speaking in an interview broadcast on Labour’s radio station in which he spoke at length about the recent spate apartment block collapses next to construction sites. The Prime Minister defended his decision to halt all excavation works with immediate effect, pending an overhaul of the existing legislation. He pointed out that architects who believed stopping works mid-project would actually increase risks could allow them to continue, provided they assumed liability in the case of an accident. While noting that the majority of architects and contractors adhered to the law, he said that some of the current practices had to stop.\nDr Muscat speaks to the press at a briefing earlier this week. Photo: Jonathan Borg\n“Some architects were doing method statements [a plan outlining the procedure to be adopted when carrying the works] without ever going on site, through WhatsApp,” he said.This was completely unacceptable, the Prime Minister said.\nExcavation ban was 'obvious' decision\nCommenting on the temporary demolition and excavation ban, he said his decision was “clear and obvious” and all stakeholders had unanimously agreed with it.Most existing legislation was up to scratch, Dr Muscat said, but there were certain grey areas which needed to be addressed.\nHe added that the objective of the changes in the pipeline was to avoid a situation whereby everyone passed the buck.\nOn the other hand he insisted that the government could not send enforcement officials to monitor every construction site around the clock.\nArchitect liability and site manager changes\n“We must clarify the architects’ responsibility, who must abide by the method statement using specific procedures. If the contractors fails to adhere, they are the ones liable,” the Prime Minister said. He also noted that some of the changes were meant to ensure that whenever major decisions or works were being carried out, the site manager or the architect had to be present on site.\nRELATED STORIES'They told us it was safe'Janet's anger is our voice - Sandro Spiteri\nDr Muscat added that it would no longer be acceptable to have site managers concurrently responsible for up to 15 different sites. If site managers were the building owners or lacked the necessary qualification, the architect would be liable in case of an accident.\nA police officer stands guard outside the collapsed Guardamangia property. Photo: Jonathan Borg\nThe changes will also oblige developers to undertake a geological survey even when excavating less than three metres in depth, and to record any potential structural faults for future reference.\nMassive increase in fines\nFurthermore, all engineering works and services of buildings under construction will have to be recorded for future reference, in order to avoid causing damages.Fines will be raised from €500 to €10,000, and in case of a pending enforcement notice the upward revision would be from €1,200 to €50,000. Apart from this, a new regulator, the Building and Construction Authority will be set up to incorporate all existing entities under one roof.\nMalta Air\nThe Prime Minister also dismissed concerns that the setting up of Malta Air by Ryanair could jeopardise the future of Air Malta.\nWhile noting that there were no restrictions to setting up more airlines in Malta, he said that the two carriers would “complement” each other.\nDr Muscat said that Malta Air would not delve into existing markets where Air Malta was strong, but seek to operate to new routes.\nLow-cost airlines such as Ryanair were a different kettle of fish to the national carries, he said.\nRyanair does not cater for business class passengers, has huge limitations on the amount of luggage passengers are allowed to carry, does not carry cargo, has tighter operating schedules and flies to different airports, he said.\nFrom a financial perspective, he said that Malta Air would result in up to 50 planes being registered in Malta, which would translate to an annual revenue of €1 billion.\nOn the other hand, Air Malta would continue to expand its fleet up to 11 aircraft as part of a plan to become the airline of the Mediterranean, he said.\nThe Prime Minister noted that Malta had a “golden share” in Malta Air meaning that it could veto any decisions which it would feel would go against the country’s interests.\nAG’s dual role\nThe Prime Minister said he was baffled by the Opposition’s decision to vote against a Bill splitting the Attorney General’s existing dual role of prosecutor general and government’s legal advisor.\nThe government was acting on the advice of the Venice Commission, he said, and the Opposition’s only objection was on the procedure used to appoint the candidates holding such posts.\nThe Opposition’s call to appoint them with a two-thirds parliamentary majority would be a first as there was no EU country with such a criterion, he said. Moreover, he said that the Venice Commission had made no such recommendation.\n“I fear that the PN has been taken over by the negativity of those who lack ideas,” Dr Muscat said.", "comment_count": 76, "id": 2344}, {"keywords": "Society, Health, Childcare", "author": "Sarah Carabott", "article_body": "There are several men who would not be celebrating Father’s Day today had it not been for blood donors for their children, as John Chircop knows all too well.\nTogether with his wife Josephine he is now joining forces with other parents whose children also needed the lifesaver, to help ensure blood stocks are always replenished.\n“As a father I cannot put a price on finding blood readily available for my children. But apart from expressing gratitude, we also want to provide support proactively to those parents who might need blood for their children,” he told The Sunday Times of Malta.\nMs Chircop recounted how she first developed a condition known as pre-eclampsia during pregnancy 26 years ago. Their daughter was born at seven months but she sadly passed away 13 days later.\nAll went well with the pregnancy and birth of their second daughter, now aged 24, but the couple passed through the same ordeal during their third pregnancy 16 years ago.\nDoctors induced the birth at seven months to ensure the baby’s and mother’s safety. The infant was immediately put in an incubator and at just a few days old she needed several blood transfusions.\nYou don’t really understand the true value of blood donation until your loved ones need it\nBorn weighing less than a kilo, she spent a month and a half at the Neonatal Paediatric Intensive Care Unit while her mother recovered from a critical condition at hospital.\nA life-changing ordeal\nThe ordeal was a life-changer for the family. Ms Chircop, who had only donated blood when she was 18, became a regular donor.\n“You don’t really understand the true value of blood donation until your loved ones need it and this is why we have joined other parents whose children needed blood.\n“Our children found blood when they needed it, and we want to give something back by raising enough awareness so that there will always be blood for children in need. We hope to encourage more parents or their relatives to donate.”\nThe blood transfusion unit has a daily demand of 50 bags, often struggling to keep up. Those who wish to give blood and have returned from abroad over the past four weeks should phone 8007 4313 to check if they are eligible to do so. Donors should take their identity card, driving licence or Maltese passport with them.\nTo keep updated, visit the National Blood Transfusion Service – Malta Facebook page.", "comment_count": 0, "id": 2345}, {"keywords": "Politics", "author": "", "article_body": "The Times assistant editor dies aged 55\nThe assistant editor of the Times of Malta, Ivan Fenech, died aged 55, a day after he felt suddenly ill at the newsroom in Mrieħel. Mr Fenech was widely respected for sticking to his values and principles even if these were not in line with public opinion. Many knew him under a different guise, thanks to the TV persona he had taken up many years ago living in the fictional land of Iċ-Ċukaj as part of the TV satirical show Aħna Aħna Jew m’Aħnix in the 1980s. His dry and caustic humour, which was also reflected in this fictional character, kept many entertained. He will be greatly missed.\nWhat made the headlines\nPN youth report blames leadership: A siege mentality, a divide-and-rule approach, attacks against independent media and a sense of denial following two historic defeats are to blame for the current state of the Nationalist Party, a report concluded. The damning analysis was made by the party’s youth section, the Moviment Żgħażagħ Partit Nazzjonalista, in a report which focused on the period from when the current leadership led by Adrian Delia took office in September 2017 until the present.\nOpposition to vote against separation of Attorney General’s roles: The Nationalist Opposition will be voting against the splitting up of the Attorney General’s dual role of legal adviser to the government and chief prosecutor, PN MP Carmelo Mifsud Bonnici, a former justice minister, said in Parliament. Dr Mifsud Bonnici said the Opposition had no choice but to vote against the Bill at the second reading due to the fact that the government had failed to allow for the appointment of the Attorney General and State Advocate by a two-thirds parliamentary majority.\nAdrian Delia\nPN MPs call for Delia to assume responsibility: Tensions within the Nationalist Party’s parliamentary group reached boiling point on Tuesday night when a huge majority of MPs asked the leadership to assume responsibility for the recent electoral losses and step down, the Times of Malta reported. A meeting of the parliamentary group that started at about 6pm dragged on until 2.15am on Wednesday. Only two MPs – Edwin Vassallo and Carm Mifsud Bonnici – spoke in favour of party leader Adrian Delia staying on. Meanwhile the PN’s Mosta sectional committee wrote to the top echelons of the party, calling on them to shoulder responsibility for the recent electoral results. And the Mellieħa sectional committee wrote to all Nationalist MPs urging collective responsibility to be shouldered.\nFamilies evacuated after wall collapse: Families living in a block of apartments in Mimosa Street, Ħamrun, next to a construction site, were evacuated early on Thursday morning after a wall collapsed. The Ħamrun incident came less than a week after a three-storey block adjacent to a construction site collapsed in Mellieħa, slightly injuring a woman who was trapped in the rubble. And last month a building collapsed in Guardamangia. After this latest incident in Ħamrun, Prime Minister Joseph Muscat said all permits for demolition and excavation were being suspended until new regulations come into force in a few weeks’ time.\nCruise ships’ pollution 148 times worse than cars: The pollution caused by 83 cruise ships that visited Malta in 2017 was 148 times the sulphur emissions produced by the island’s entire car fleet, according to new data. The campaign group Transport & Environment (T&E) used satellite data to track 203 cruise ships as they sailed around Europe in 2017, comparing the air pollution caused to passenger car emissions. In Malta, the estimated 283,000 road vehicles together generated 3.4 tonnes of toxic sulphur oxides (SOx) compared to a staggering 502.8 tonnes from the 83 cruise ships that visited the island.\n97 migrants brought to Malta: A group of 97 migrants was brought to Malta after being rescued by an Armed Forces patrol boat on Monday night. Their arrival was the second large group in less than a week – 370 migrants were rescued and brought to Malta the week before. Some of the migrants are believed to be Nigerian and the group included two women and two children.\nEx-drama teacher confesses to murder: Former drama teacher Erin Tanti was sentenced to 20 years in jail after pleading guilty to the murder of Lisa Maria Zahra, 15, at Dingli Cliffs in 2014. Mr Tanti had been accused of wilful homicide, with having assisted his teenage student to commit suicide and of having defiled the girl at the time when he was her teacher. The couple been discovered at the bottom of the cliffs on March 19, 2014. Ms Zahra was dead and he was badly injured. Mr Tanti was expected to stand trial on Tursday but before the jury had been empanelled, he filed a last-minute admission to receive a mitigation in punishment.\nWhat trended\n‘Concrete’ action\nThere was plenty of online scepticism in reaction to the Prime Minister’s announcement about the suspension of demolition and excavation works soon after an apartment wall collapsed into a building site in Ħamrun, the second such incident in a week and the third in two months.\n“We need to start seeing ‘concrete’ action here – prosecutions, fines; compensation to those incurring damages should be the order of the day. Also ordinary people’s lives are being disrupted by these incompetent developers and their cranes, concrete mixers, trucks and fumes, and yet this whole melée seems to have the blessing of the government, who are now crying crocodile tears).\nJA added: “Soon couples, who bought property on plan, will start complaining that contract dates are going to be delayed and that they have deadlines for their wedding day and extra charges on late bank loans. This is all one big mess. That’s what happens when there’s no law enforcement.”\nGodwin was more cautious: “Thanks Prime Minister, thisis the way forward. Now just let us know where we can report the infringements.”\nTo which J replied: “Infringements? They start digging at between 6.15am and 6.30am. You call the police and no one comes.”\nJJ was blunt and to the point: “As expected, a predictable knee jerk reaction from the people at Castille, in a desperate effort to save face.”\nJoe responded: “Knee jerk reactions are part and parcel of our culture no matter who is in government. It has to stop, and to blame one party to get political mileage is an insult to injury to the victims.”\n‘Something must be shady’\nMany questions were asked about Prime Minister Joseph Muscat’s comment that Malta Air and Air Malta could both “live happily ever after”, as the Ryanair subsidiary airline was launched with a set target of five million passengers within five years.\n“Is this the first move of handing over Air Malta to Ryanair? If Mizzi is involved in these negotiations, something must be utterly shady and suspicious,” asked M.\nAlfred pointed out that if Air Malta is to be considered a serious company it should have started legal action against the use of the name Malta Air.\n“It is too similar to Air Malta and it can confuse customers. Yet I guess since Air Malta belongs to the government they will just carry on regardless,” he pointed out.\nJ, however, took a different approach: “[Tourism Minister] Konrad Mizzi is a genius! Hehas proven himself over and over again – with miraculous results. Energy, health, aviation!  What’s next?”\nWhat they said\n“I don’t think the Opposition would listen to my advice if I had to give it, but I believe the country needs a uniform Opposition that agrees on the direction it wants to take the country towards.”\nPrime Minister Joseph Muscat, speaking on ONE radio about the current state of the Nationalist Party.\n“Let us talk about unity instead. People are tired about hearing about division.”\nNationalist Party leader Adrian Delia taking on his internal critics, while speaking on Net FM radio.\n\n“It had been clear since Labour’s accession to power in 2013 that all institutions were at the beck and call of the Prime Minister.”\nNationalist MP Simon Busuttil speaking in Parliament where he criticised the government for not ensuring that the Attorney General and State Advocate were appointed by a two thirds parliamentary majority.\n“With him, what you see is what you get: a highly intelligent, loyal and genuine person.”\nTimes of Malta editor Ray Bugeja summing up his colleague Ivan Fenech, assistant editor of the Times of Malta, who sadly died on Wednesday.\n\n“We gave them a platform, media and two parliamentary seats. And now they dance and celebrate to the beat of hatred towards us.”\nPN secretary general Clyde Puli writing on Facebook after sharing a video of Democratic Party MP Marlene Farrugia being carried on people’s shoulders as they chanted along to a vulgar anti-PN chant during the feast of St Philip in Żebbuġ.", "comment_count": 0, "id": 2346}, {"keywords": "Adrian Delia, PN, PL", "author": "", "article_body": "Posters implying Adrian Delia's PN leadership is good for the party's political rivals were affixed to the front of Labour Party clubs across the island overnight. \nThe A4 posters feature a mock masthead of General Workers Union newspaper It-Torċa, a photo of Dr Delia and the headline \"Give Adrian Delia room to work\". \nThat headline is the same as that featuring on a separate set of anonymous posters which appeared on the facades of Nationalist Party clubs earlier this week. Earlier this week, a different set of posters used the same headline to urge PN supporters to back Delia.\nPosters were stuck to Labour Party clubs across Malta and Gozo, from Qala to Attard.  \nThe anonymous group behind the poster campaign said Dr Delia had \"strong connections to people very close to the Labour Party\" and predicted that PL media would leap to his defence on Sunday. \n\"Just as we knew we would be in government for as long as Alfred Sant was leader of the Labour Party, they know that as long as Delia is our leader, we will be stuck in Opposition,\" the group said. \nRELATED STORIESOpinion: Bad-deal exit for Delia - Mark Anthony Falzon\n\"If we go into a general election with Delia as our leader, we risk turning the country into a dictatorship with a government powerful enough to change the constitution as it wishes,\" they argued. \nThe Sunday Times of Malta has reported that PN MPs will be meeting with Dr Delia on Tuesday, when they will be expecting him to announce that he is stepping down as party leader.\nAt a parliamentary group meeting held earlier this week, just a handful of PN MPs reportedly stood by the party leader. \nPL clubs across the island had posters stuck to them.", "comment_count": 39, "id": 2347}, {"keywords": "Environment, Maritime, Beach", "author": "Ivan Martin", "article_body": "A colder, wetter spring is to blame for the “zillions” of stinging jellyfish that are plaguing bathers at the start of the swimming season, but they will soon disappear, according to marine biologist Alan Deidun. \nA fried egg jellyfish.\nProf. Deidun, who leads a local jellyfish monitoring programme, told The Sunday Times of Malta that the island was currently experiencing the tail-end of the annual mauve stinger jellyfish bloom, with stingers washing up en masse along with northern shores in recent days.\nNormally, this annual bloom would be experienced earlier in spring, in April and May, as the result of a massive reproduction event happening in early winter every year.\nThe delayed appearance of the pests this year could be attributed to the prolonged rainy and cold spell that hit Malta in the spring.\nProf. Deidun explained that rainfall patterns on land impinged on jellyfish populations given that rainfall leads to runoff, which in turn disperses zooplankton populations within coastal waters that the jellyfish depend upon.  So the jellies blossomed later than usual.\nThat said, any bloom or swarm is unsustainable because of the massive volumes of food that the umbrella-shaped floaters consume. So Prof. Deidun expects such blooms to all but disappear in the coming days and weeks.\nThe jellyfish species spectrum, he said, was very broad and local populations were not solely composed of the mauve stinger.\n“In recent weeks, in fact, many have observed the washing up on our beaches of what looks like a giant sheet of plastic, which in reality consists of loads of dead by-the-wind sailors (Velella velella), which are endowed with a bright indigo colour when they are alive.”\nThe frequency and magnitude of jellyfish blooms has increased in recent decades\nThese colonies of polyps are propelled by a ‘sail’ protruding out of the water consisting of chitin, the same stuff insect wings are composed of.\nThese ‘living sailing boats’ (tellingly known as ‘qlugħ’ in Maltese) normally appear much earlier in the season, once again in testimony to the inherent response of jellyfish communities to variability in climactic conditions. \nThere are approximately 50 jellyfish species recorded to date in Maltese waters and, with the exception of a few – such as the mauve stinger – most of these species appear at specific periods of the year, such as the fried egg jellyfish (qassata in Maltese), which normally blooms during the lampuki fishing season in late summer.\nBy-the-wind sailor.\nJellyfish, Prof. Deidun said, have been blooming since time immemorial, “as records maintained in the Mediterranean since the 1800s for the mauve stinger aptly show”.\nHowever, it is true that the frequency and magnitude of jellyfish blooms has increased in recent decades.\nHe is also keen to dispel the belief that all jellyfish species are stingers, insisting the vast majority are not.\nThe stingers one should steer clear of are the mauve stinger, the Portuguese man o’ war (which is actually a colony and not a single jellyfish and which is responsible for the only fatality known from a jellyfish sting in the Mediterranean), the box jellyfish (common in yacht marinas) and the nomadic jellyfish, an alien species native of the Indian Ocean.\nThe remaining 30 to 40 species present in Maltese waters, Prof. Deidun said, are “pretty much innocuous”.", "comment_count": 6, "id": 2348}, {"keywords": "Construction, Guardamangia, Accident", "author": "Denise Grech ", "article_body": "Traumatised residents have been waking up in shock and reliving the terror of Thursday’s collapse of an apartment block wall bordering a construction site.\nThis was the third such incident in a few months, leading to the evacuation of 16 adults and two children living in the block of five apartments on Mimosa Street, Guardamangia. The area has previously been referred to as Ħamrun by the authorities.\nOne of the residents, Janet Walker, told The Sunday Times of Malta her seven-year-old niece and 64-year-old mother had spent the last two nights waking up in the middle of the night at any sound, terrified the building they now occupy was going to fall apart.\nAnother victim of the incident, Nicholai Brincat, said he had spent the last couple of days waking up at night and re-imagining the horror of finding himself homeless after parts of his childhood home came down.\nHe recalled that, months ago, he used to hear dust falling in his room due to works on the construction project next door.\n“We used to move across the room when works were underway because the furniture would start shaking,” Mr Brincat said.\nHis father, Ray Brincat, said he woke up on Thursday morning to see sunlight flooding his apartment – only to realise the wall was falling apart.\n'They only cared about their pockets'\nFor Mr Brincat and his family, the tragedy highlights developers’ greed.\n“They only cared about lining their pockets,” his sister, Anthea Brincat, said.\nThe next-door plans include a basement garage, two shops at ground level, 15 overlying apartments and two penthouses, according to the Planning Authority website.\nConstruction lobby boss Sandro Chetcuti at the Guardamangia site. Photo: Chris Sant Fournier\nThe Brincats were speaking just hours after having spent the night sleeping in Ms Brincat’s car, after they realised there was no security outside their home.\n“On Friday I was under the impression that there was some security in front of the building but when I checked it out I did not see any police,” she said. “Then I just decided to walk right into the building to see if anyone would stop me,” she said. “And when no one did, I realised there was no policeman on site.”\nMs Brincat and her brother then spent the night in her small red Citroen, watching over the site to make sure no one entered to steal their personal belongings.\nRELATED STORIES'Down with developers' dictatorship' - Graffitti plan Tuesday protest\nA policeman went to the site after Ms Brincat voiced her concerns on social media. But residents are still worried about their homes being left unguarded and their doors wide open. They are concerned that police reassurances they will monitor the site are “just empty talk”.\nPiecing life back together\nThree days after the incident, the Brincat family feels they have not yet started to come to terms with the tragedy that took place on Thursday.\n“We simply have not yet had the time,” Ms Brincat said. Her father’s wallet, ID cards and credit cards could no longer be accessed and they have been too preoccupied with trying to find alternative accommodation to deal properly with what took place.\n“We need to get cash, we need to get new ID cards, we need to have our credit cards with us,” she said.\nThe apartment wall caved in, leaving the family's home exposed. Photo: Chris Sant Fournier\nOn Thursday, some of the residents said they wondered how they were going to get food to eat, since they rushed out of the house with no cash.\nThe older ones also needed to get their pills out from their apartments. They then had to think about where they were going to stay.\n“The authorities helped, but not immediately,” Ms Brincat said. “We had to reach out to them, they did not come to us.”\nThe Housing Authority on Saturday announced it had stepped in to help the families who ended up with no home.\nThe families can start moving in by Monday to apartments described as being in “good condition”. The authority said the contractor responsible for the damage would foot the bill for the costs until there is no more danger and the families could return to their homes. \nThe collapsed wall in Guardamangia.\n‘No voice’\nMs Walker has said she filed multiple reports on the construction adjacent to her building.\n“We had already started seeing cracks in the wall,” she said as she stood  outside her damaged home on Thursday.\nAccording to Pietà mayor Keith Tanti, many residents are worried they may be next. Mr Tanti, who also forwarded reports on the site to the authorities, said several residents had contacted him worried their building would soon collapse.\n“We never had any problems before. Then when construction started some months ago, we started seeing water leakages, the floor moving,” Mr Brincat said.\n“It’s clear people no longer have a voice,” his sister concluded.\nTwo previous incidents\nA four-storey apartment block in Mellieħa collapsed earlier this month, with an elderly British woman lucky to survive as her bedroom stayed intact and the rest of the building came down. A neighbouring property is under construction.\nAn apartment block in Guardamangia next to a construction site collapsed in April, with residents escaping in time to avoid injuries or fatalities. Prime Minister Joseph Muscat had said the incident should not be used to characterise the construction sector.", "comment_count": 39, "id": 2349}, {"keywords": "Media", "author": "", "article_body": "These are the leading stories in local newspapers this Sunday.\nThe Sunday Times of Malta reports that Nationalist Party MPs have given Adrian Delia until Tuesday to consider his future and then step aside as leader of the party.\nThe newspaper also reports that residents of a block in Guardamangia are traumatised after a wall in the building adjacent to an excavation site collapsed.\nThe Malta Independent on Sunday reports on the situation at Mount Carmel, citing insiders as saying the hospital is reminiscent of scenes from Florence Nightingale’s era.\nThe newspaper also quotes Council of Europe rapporteur Peter Omtzigt as saying the Maltese government should adopt Venice Commission reforms in one go as a package, rather than in piecemeal fashion.\nMalta Today writes that a long-time friend and business associate of Adrian Delia has accused the PN leader of \"spin\" in his claims that he had never opened a Jersey bank account investigated by the FIAU. \nThe newspaper also reports that a university study has found traces of fireworks chemicals in tap water. \nIt-Torċa reports that Air Malta is considering maintenance services for newly-created airline Malta Air.\nIl-Mument writes that Adrian Delia held his first meeting with Gozo PN members.\nKulħadd reports on trouble within the PN, writing that an initial deadline handed to Adrian Delia has passed and pressure is now mounting on sectional committees to stick their necks out and condemn him.\n ", "comment_count": 0, "id": 2350}, {"keywords": "Politics, Adrian Delia, PN", "author": "Ivan Camilleri", "article_body": "The Nationalist Party’s parliamentary group is expecting leader Adrian Delia to relay a decision about his future on Tuesday after having given him a “few days” to reflect, consult and decide.\nDr Delia has been unequivocally told by the majority in his parliamentary group to “make way” so that the PN can start regrouping and re-establishing itself as “a real Opposition and a credible alternative government”.\nTwo sessions of the party’s parliamentary group were held last week, one of them ending in the early hours of the morning. The embattled PN leader found himself facing the reality that most of his MPs would like him to relinquish his post and let others come forward to take over the ardent task of rebuilding the PN from scratch.\nHe also discovered that some of his most loyal supporters had deserted him, The Sunday Times of Malta is informed.\nThe parliamentary group is now planning to hold another meeting on Tuesday at which Dr Delia is expected to give his final answer.\n'Cordial and civilised' meetings\n“The PN group meetings were very cordial and civilised. There was no shouting and everyone expressed his opinion liberally,” said one of the MPs who would like Dr Delia to step down in the party’s interests.\n“The majority of MPs told Dr Delia that despite all his efforts, it was clear the PN is not electable with him at the helm. He was given some time to decide what he wants to do but doing nothing is not an option.”\nAnother MP, who also wanted to remain stay anonymous, said: “Delia should leave, not necessarily leave politics, as he can still contribute and has his core supporters. But as has been evident from day one, he cannot lead and his close collaborators don’t even let him.”\nDespite all his efforts, it is clear the PN is not electable with him at the helm\nYet another MP said: “Results speak louder than words and the reality is that Delia’s ‘New Way’ is not appreciated by many traditional Nationalists who preferred to stay home than cast their vote. If he really loves the party more than himself, Dr Delia should already have left. The writing is in the wall and I am sure that he doesn’t want to destroy the PN.”\nTwo staunch defenders\nParliamentary group sources told The Sunday Times of Malta that the only MPs who stood up for Delia during the meetings were Edwin Vassallo and Carm Mifsud Bonnici. The latter argued that if Delia went, there was the risk of losing the backing of his supporters in which case the situation would remain the same.\nRELATED STORIESAnonymous posters link Delia to LabourOpinion: A bad-deal exit for Delia - Mark Anthony Falzon\nHowever, many MPs argued that this was not a valid reason to “keep racing with a dead horse”, as one put it.\n“A new, young and energetic horse can be found who will be able to work with all those who want to pull up their socks and move on. Delia can also be an important part of a new team but he cannot lead it as many don’t identify with him and his actions or lack of them.”\nThe PN leader is being viewed negatively across several PN structures, including the youth section, the MŻPN, and sectional committees, as well as by PN diehards. Many however also point a finger of blame at Delia’s close advisors, among whom are general secretary Clyde Puli and media head Pierre Portelli.\nThe PN leader is being viewed negatively across several PN structures. Photo: Matthew Mirabelli\n“Delia is ultimately a good man and his sudden entrance in the political ring was evidently not the best decision he made in life. It has ruined his family and dented his personal reputation with all the stories that came out,” an MP close to Dr Delia said.\n“However, his biggest mistake was to surround himself with those who adopted a divide and rule, siege mentality,” he said.\n“He was warned, many times, to stay away from those who put themselves and their family’s interests before the party’s. Unfortunately, he ignored us. Now he has the results and he is not ‘saveable’ any longer,” the MP said.\nAsked whether the parliamentary group could find a realistic replacement for Dr Delia, in view of the ‘poisoned chalice’ that his position is perceived to be, several MPs noted that “there are those who are ready to make the sacrifice and start picking up the pieces as a team.\nRELATED STORIESMŻPN points finger at leadershipGonzi urges Delia to put leadership to the test\n“However, there has to be the vacancy first and Delia should give the PN the chance to restart by making way.”\nWhat if Delia stays?\nWhat happens if Delia is advised to cling on, this newspaper asked MPs.\n“He would obviously have continued to take advice from the same people. The PN would pass through a new bloodbath and would continue to suffer.\n“The ball is now in his court. We will take measures according to what he decides. No one is bigger than the party,” the MPs said.\nDecision time for Adrian Delia is fast approaching. Photo: Chris Sant Fournier\nPN parliamentary group: \nWant Delia to hang on:Edwin VassalloCarmelo Mifsud Bonnici\nWant Delia to make way:Mario DeMarcoClaudio GrechJason AzzopardiRyan CallusBeppe Fenech AdamiTherese Comodini CachiaMarthese PortelliClaudette ButtigiegChris SaidSimon BusuttilKarol AquilinaIvan BartoloKarl GouderDavid Casa\nTake no sides:Deputy leader David AgiusKristy DebonoMaria DeguaraFrederick AzzopardiRobert CutajarMario GaleaKevin Cutajar*Want action but don’t specify what:Stephen SpiteriToni Bezzina\nDefend themselves (not Delia)Clyde PuliDeputy leader Robert Arrigo\nExcused:Roberta Metsola\n• This was Kevin Cutajar’s first meeting as a PN MP.", "comment_count": 186, "id": 2351}, {"keywords": "Accident, Traffic, Santa Venera", "author": "", "article_body": "Two drivers were injured, one of them seriously, following a four-car collision in Santa Venera on Saturday afternoon. \nPolice said the incident happened around 1pm in Triq il-Ferrovija when a Toyota Yaris, driven by a 19-year-old from Birkirkara, a Peugeot 106, driven by a 61-year-old from Birkirkara, a BMW driven by a 21-year-old woman from Santa Venera and a parked Mercedes.\nThe 61-year old sustained grievous injuries, and the 19-year-old suffered light injuries, the police said. \nThe police are investigating the incident in what turned out to be a day of traffic accidents. \nEarly on Saturday, a 41-year-old motorcyclist died following a traffic accident in Birkirkara. Another motorcyclist was injured in Żebbuġ later and a pedestrian was hit by a car in Luqa. ", "comment_count": 0, "id": 2352}, {"keywords": "Justice, Construction, Sliema", "author": "Ivan Camilleri", "article_body": "Work on a development project in the heart of Sliema, belonging to Marco Gaffarena, continues unabated despite an injunction issued at the request of the government.\nThe Times of Malta is informed that the works were stopped after the Lands Authority initiated court procedures last month in relation to public land transferred illegally to Mr Gaffarena in 2015, a scandal that led to the resignation of then parliamentary secretary Michael Falzon.\n“It seems Mr Gaffarena still enjoys protection because workers can still be seen on site every day carrying out works, including on the part of the property that should have been returned to the public,” sources said.\nThey said work had appeared to have been stopped soon after the court issued the injunction but it then continued “in full blast” over the past weeks.\nAn on-site visit by the Times of Malta showed a number of people at work, including on a ground floor shop the court had ordered to be returned to the government.\nThe Sunday Times of Malta reported last month that despite the court decision that all property exchanged with the government through the controversial deal had to be returned to the public, Mr Gaffarena was still proceeding with his plans to build apartments on land in Sliema that was part of the deal deemed illegal.\nThe Lands Department had at first said the property indicated by the Times of Malta was not government property but accepted it was when more information was furnished by the Times of Malta.\nPrime Minister Joseph Muscat said he had learnt about the latest developments from this newspaper. His office had officially said the properties in question had been returned to the government.\nIt seems he still enjoys protection because workers can still be seen on site every day\nThe Lands Authority later filed a judicial letter asking Mr Gaffarena to desist from doing any further work on the public property in question. It held the developer responsible for damages and threatened further action.\nYet, work on the project still continues.\nMeanwhile, another piece of land forming part of the property scandal and which was also supposed to be returned to the public, is still registered in Mr Gaffarena’s name and being considered for development by the Planning Authority.\nMr Gaffarena has applied to turn the large plot of land in the area of Tal-Ħandaq, in the limits of Qormi, into an agritourism project. Illegal structures, including a restaurant, owned by Mr Gaffarena, stood on the outside development zone land.\nThe agritourism project application was signed by architect Martin Debono, a former Labour candidate and a government consultant.\nThe court had decided last year that the Qormi land should be returned to the government because its transfer to Mr Gaffarena was illegal.\nDr Muscat had subsequently declared the public interest had been protected.", "comment_count": 92, "id": 2353}, {"keywords": "Police, Crime", "author": "", "article_body": "The police have sought the help of the public to identify a man in connection with a crime. \nThe police would only say that the man is a Maltese national but would not say what he is wanted for or his location when the photo gleaned through CCTV footage and shot on May 18. \nThe suspect is seen wearing a cap and smoking a cigarette.\nAnybody with information is asked to contact the police on 2122 4001 or 119.\nPhone calls may be made anonymously, the police said.", "comment_count": 1, "id": 2354}, {"keywords": "Environment, Valletta", "author": "", "article_body": "The wreckage of a car was among several items of junk elevated from the seabed off Valletta during a clean-up on Saturday morning. \nIt is not yet known how the car ended up in the sea though it could have been the result of last February's vicious storm, which caused record damage.\nThe police are investigating. \n\nAccording to the clean-up organiser Mark Camilleri, several car tyres, poles and heavy engines were collected from the seabed. \nIn total, almost 20 kg of non-recyclable plastic, 90kg of metal and 13kg of batteries were elevated, together with almost 500kg of bulky waste. \nThe event was mainly organised by the QLZH foundation, an offshoot of Quicklets and Zanzi Homes with the help of Dive Systems, Żibel Malta and Wave of Change.\n ", "comment_count": 10, "id": 2355}, {"keywords": "Accident, Żebbuġ (Malta)", "author": "", "article_body": "A young man riding a Yamaha motorcycle was grievously hurt on Saturday afternoon in a collision with a pickup truck in Żebbuġ.\nThe 22-year-old was riding an MT-03 motorcycle in the Xindi area on the edge of Żebbuġ when he collided with a Toyota S-LN107 pickup being driven by a 75-year-old man. The collision happened at around 10.45am. \nBoth men involved live in Żebbuġ, the police said.\nThe younger man was taken to Mater Dei Hospital by ambulance and is receiving treatment there, they added. A police investigation is under way.\nIt was the second major crash of the day and the third significant traffic incident reported on Saturday.\nOvernight, a motorcyclist dies when he smashed into a parked truck in Birkirkara, while later in the day a woman walking in Qormi was badly injured when she was hit by a car in Luqa. ", "comment_count": 0, "id": 2356}, {"keywords": "Accident, Luqa, Transport", "author": "", "article_body": "A pedestrian walking close to the St Vincent de Paul care home in Luqa was hit by a car on Saturday afternoon and is now in hospital with serious injuries, the police said.\nThe 38-year-old Qormi woman was hit at around 12.20pm by a Toyota Starlet being driven by a 47-year-old man from Siġġiewi.\nAn ambulance took her to hospital, where she is receiving treatment. A magisterial inquiry into the case is now under way, the police said.", "comment_count": 0, "id": 2357}, {"keywords": "Construction, Accident, Guardamangia", "author": "", "article_body": "Families which saw their apartments damaged in a construction incident in Guardamangia last Thursday will be accommodated in four apartments, the government said. \nThe Housing Authority has stepped in to accommodate the four families until they can return to their homes.\nRELATED STORIES'We did everything to warn them the wall will collapse'\nThe families can start moving in by Monday to apartments, which were described as being in \"good condition\".\nThe alternative properties were found thanks to collaboration with the Foundation for Social Welfare Services.\nThe authority said the contractor responsible for the damage will foot the bill for the costs until there is no more danger and the families could return to their homes. \nThe Parliamentary Secretary for Social Accommodation said he will continue monitoring the situation. \nResidents had initially complained that the authorities had ignored their concerns about the construction and then not helped them enough to find alternative properties.\nIt was the third construction incident in a month which left innocent neighbours with damaged properties. \nRELATED STORIESBuilding collapses in Gwardamanġa, residents out in the streets\nAfter Thursday's incident, the prime minister announced plans for the quick introduction of new regulations on excavation and construction practices shortly after announcing he was suspending demolition works, amid widespread anger at the construction industry.\nIn spite of the suspension, Times of Malta received complaints of ongoing works carried out all over the island.", "comment_count": 29, "id": 2358}, {"keywords": "Politics, Parliament, Government", "author": "", "article_body": "Malta’s two major political parties are doing a poor job of steering Constitutional reform and it is clear that Prime Minister Joseph Muscat has little interest in fixing the country’s “broken” political system, the Democratic Party has charged.\n“The political duopoly of the Steering Committee on Constitutional Reform is turning out to be ineffective and seems to be tied by the agenda of the Executive, as is apparent by the half-baked amendments presented in Parliament this week,” PD MP and outgoing leader Godfrey Farrugia said on Saturday.\n“We need a radical reformation of our Constitution, and this must be addressed immediately through effective consultation with all stakeholders,” he said. “This is not being observed”.\nThe PD has repeatedly said that it is opposed to the “secretive” manner in which the Labour and Nationalist parties are discussing constitutional reform and called for broader representation from across society. \n\nSpeaking in parliament, Dr Farrugia said it was now clear that there was no political will to introduce proper checks and balances or ensure institutions were truly independent and accountible, regardless of assurances made by government spokespersons.\n“If Prime Minister Dr Joseph Muscat really wants to unite a nation, reconciliation must be triggered through democracy, good governance and the rule of law,” he said.", "comment_count": 34, "id": 2359}, {"keywords": "Construction, Guardamangia, Industry", "author": "", "article_body": "Building industry regulators are little more than “letterboxes” set up to receive reports, Alternattiva Demokratika charged on Saturday.\n“Building industry regulatory authorities do not have the resources to carry out their responsibilities, which they have abdicated,” AD chairperson Carmel Cacopardo said at a press conference in Guardamangia.\nMr Cacopardo was speaking at the end of a week which saw two separate buildings collapse, just a few days apart, in Guardamangia and Ħamrun. Those two collapses came just a  few months after another apartment block in Guardamangia crumbled at night.\nResidents of all three buildings had expressed concern about the construction works happening next door to them, Mr Cacopardo said. No authority had acted on the warnings, or referred them for action.\nRELATED STORIES'We tried to warn them that it would collapse'Building collapses in Mellieħa\nMr Cacopardo dismissed the government’s decision to halt all excavation and demolition works as a knee-jerk reaction borne out of “panic”.\nInstead of saying it was preoccupied, he said, the government would have better served its citizens by being preoccupied before, by ensuring the Building Regulation Office had enough resources and staff to do its job and that other authorities investigated complaints without delay.\nGovernment would now be rushing through emergency regulations in the coming days. While these would be a temporary fix, the AD leader argued, the only long-term solution was to ensure that enough resources were made available to continuously monitor the construction sector.", "comment_count": 15, "id": 2360}, {"keywords": "Environment, Trade", "author": "Claire Caruana", "article_body": "No new fuel stations should be allowed once the new policy governing the sector was introduced, the Malta Chamber of SMEs (GRTU) said, echoing a similar request by civil society.\nIt said that, like civil society organisations, it believed that applications in the pipeline or awaiting a decision should be stopped.\n“We believe it makes little sense to advocate such a policy on one side and doing the complete opposite on the other. Should current applications continue to be considered, the policy will immediately become irrelevant and it will be pointless to carry forward.\n“Simply addressing the issue as a forwarding-thinking policy without addressing the waiting list was simply a cosmetic exercise,” the GRTU remarked.\nIt said it agreed “perfectly” with the Environment and Resources Authority that the policy must incorporate a distance requirement of a minimum 1.5-kilometre radius between the applicant station and any other existing similar facility.\nThough a lot of emphasis was placed on fuel station standards, this contrasted sharply with other existing operations that also carried a risk and which “should be regulated accordingly”, it continued.\nRELATED STORIESA better policy... if loopholes are removed - GraffittiWhich fuel stations could be cut down to size?\n“It is essential that garages and other operations that keep fuel stored are also required to have all the necessary permits in relation to ERA, planning authorities and the Regulator for Energy and Water Services.\nThe GRTU believes that no new permits for storing of fuel should be given\n“Apart from this, the GRTU believes that no new permits for storing of fuel should be given. This with the only exception of stationary objects such as generators, compressors, etc. \n“This exception must naturally come with the necessary permits. \n“In such cases, the amount of fuel permissible to be stored should be indicated and this should be at a bare minimum. Current and future approved storage should also be required to put up visible warning signage as is regular with potentially dangerous operations and relevant storage facilities,” the organisation said.\nIt declared it was not in favour of using outside development zone land for fuel stations. \n“This is something that we have always been against. Just because mistakes were made in the past does not mean we should keep going,” its CEO, Abigail Mamo, told the Times of Malta.\nShe said no members had complained about the stand adopted by the GRTU, adding certain wrong decisions made in the past had cast a shadow on the sector.", "comment_count": 10, "id": 2361}, {"keywords": "Migration, Human rights", "author": "AFP  ", "article_body": "Mediterranean countries say they have taken a key step towards finding out the fate of thousands of migrants - many fleeing Syria's war - who have gone missing while trying to reach Europe.\nAt a meeting of the International Commission for Missing Persons in The Hague this week, Cyprus, Greece and Malta pledged to coordinate and beef up their efforts to trace nearly 18,500 migrants who have disappeared since 2014 while making the perilous journey across the Mediterranean.\nItaly - which has taken a hard line on migrants under its populist government and interior minister Matteo Salvini - did not sign up to that new joint statement due to what the ICMP described as internal government issues.\nThe four countries are the main point of entry to Europe for many of the migrants fleeing the war in Syria and other regions.\nFinding out what happened to those missing - whether they are eventually found alive or whether they have been confirmed dead and their remains found - provides crucial closure for families.\n\"We are starting a process that is extremely important,\" Queen Noor of Jordan, one of the ICMP's longest-serving commissioners, told AFP in an interview.\n\"Helping the families and communities that have lost their members in conflict can create a path to truth, justice and reconciliation - and where possible, accountability,\" said the Jordanian royal.\nBorn out of the conflicts in the former Yugoslavia and set up in 1996 in Sarajevo by then US president Bill Clinton, the ICMP uses increasingly sophisticated DNA technology to trace missing persons.\nIt has already succeeded in identifying around 70 percent of the 40,000 people who went missing in the Balkans conflicts of the 1990s, including around 90 percent of the nearly 8,000 killed in the 1995 Srebrenica massacre.\nBut it is now turning its attention to one of the biggest human catastrophes of recent times - the migration crisis that has hit the Middle East, North Africa and Europe since 2014.\n'Give them hope' The plan to better locate and identify missing migrants fleeing conflict and economic hardship in the Middle East and Africa was launched in Rome last year.\nBut this week's meeting of the southern European states was key to pushing the process forward.\nTop ICMP representatives nevertheless called for more to be done to help find the missing migrants, particularly those from Syria's war where the fate is of an estimated 85,000 people is not known.\n\"What we are implicitly saying to states is that they have a responsibility to deal with this, but that it is also in their interest to deal with it,\" former Dutch foreign minister Bert Koenders told AFP.\nThe ICMP also wants to obtain permission from Syria's neighbours to start mapping the thousands of refugees fleeing the bitter eight-year war - in a move that could one day help identify war crimes, Queen Noor said.\nCollecting and having access to data about these refugees will make it easier in future to identify \"where crimes may have occurred, where mass graves exist - and where families and relatives may be,\" she said.\nBut the longer-term aim is to bring millions of displaced people back to their homes.\n\"I can see in a future that is hopefully not too far off that we can set in motion steps that will provide greater hope for many of the migrants and refugees to Europe.\"\n\"To give them hope that they can return home,\" she said.", "comment_count": 8, "id": 2362}, {"keywords": "Health, Court", "author": "", "article_body": "A mechanic who suffered permanent nerve damage during an operation to remove a lump of tissue from his neck has been awarded more than €90,000 in damages by a civil court.\nEtienne Ellul had gone under the knife in 2013 to remove the lipoma and was told that the operation was a success, with no follow up needed.\nHowever, the swelling never subsided and he began feeling considerable pain in his shoulder. He underwent further tests, which revealed that he had a large lipoma in the same area where he had been operated.\nAlmost two years passed and Mr Ellul was operated for a second time to remove the tissue. Following this second operation, a consultant told him that his severe shoulder pain was due to irreparable nerve damage caused to him during his first operation.\nMr Ellul subsequently sued for damages, arguing that the surgeon responsible for his care, Mark Schembri, and the surgeon who had operated on him, Drazen Djukic, had caused him a 21 per cent permanent disability.\nThe court heard from Mr Schembri and Mr Djukic as well as from ENT consultant Mario Said, who operated on Mr Ellul the second time and who told him about the nerve damage he had suffered.\nA third surgeon which Mr Ellul had consulted, Carmel Sciberras, also told Mr Ellul that he had suffered nerve damage during the initial operation.\nDefendants argued that the lipoma had covered the nerves, making nerve damage an inevitable consequence of the operation to remove the growth.\nMr Said, however, had told the court that the damaged nerve was a superficial one which could have been avoided during surgery.  \nThe court, presided by Mr Justice Lawrence Mintoff, also noted that although an ultrasound had indicated that Mr Ellul’s operation would be more complex than most other similar cases, doctors had not ordered an MRI, which would have allowed them to clearly see nerve pathways to ensure they were not damaged during surgery.\nCiting case law, the court ruled that Mr Djukic had taken an unnecessary risk in deciding to operate on Mr Ellul without ordering an MRI first and that Mr Schembri was ultimately responsible as Mr Djukic formed part of his firm.\nUsing an established formula to calculate loss of earnings Mr Ellul had incurred as a result of the incident, the court found the defendants jointly responsible and ordered them to pay Mr Ellul €92,054.68 in damages.\nMr Ellul was represented by lawyer Leslie Cuschieri. ", "comment_count": 0, "id": 2363}, {"keywords": "Media", "author": "", "article_body": "A 20-year prison sentence handed down to a drama teacher who admitted to the murder of one of his 15-year-old students dominates front page headlines of local newspapers this Saturday. The Times of Malta reports on Erin Tanti’s admission of murder but gives greater prominence to the South EU summit held in Valletta on Friday, during which leaders of six southern EU member states agreed, among other things, to push ahead with developing proposals for an EU minimum wage. The Malta Independent describes the murder admission as “sensational” and reserves a front page photo for political leaders attending the South EU summit. L-Orizzont quotes the family of Lisa Marie Zahra, the girl killed by Mr Tanti, as saying the man had “taken a beautiful girl away from us”. The newspaper also reports on teaching unions, which have said that importing foreign teachers is not the right way to solve a teacher shortage. In-Nazzjon highlights news of the murder case but also gives front page prominence to reports that an appeal filed by PN leader Adrian Delia in an attempt to obtain a copy of the Egrant inquiry has been scheduled to begin on June 24.", "comment_count": 0, "id": 2364}, {"keywords": "Accident, Birkirkara", "author": "", "article_body": "A motorcyclist died in the early hours of Saturday morning after he lost control of his motorbike and smashed into a parked truck in Birkirkara. Mark Bishop, a 41-year-old Gozitan from Sannat, was riding through Valley Road when he appeared to lose control of his Honda CB5000FA bike at around 4am.\nHe ended up crashing into a parked DAF truck that was parked along the side of the road.Paramedics were quickly called in but the man died at the scene of the incident. Magistrate Ian Farrugia is leading an inquiry into the case, with the police saying they are investigating further.", "comment_count": 0, "id": 2365}, {"keywords": "PN, Politics, Adrian Delia", "author": "", "article_body": "Updated at 10.45am with Mellieħa committee statement\nThe Nationalist Party’s sectional committee in Mosta has written to the PN's top echelons, calling on them to shoulder responsibility for the recent electoral results and the prevailing situation within the party.\nThe letter was sent to leader Adrian Delia, general secretary Clyde Puli, deputy leaders David Agius and Robert Arrigo and the presidents of the party’s three main organs.\nSigned by president Norvin Spiteri, the letter called on “everyone” to shoulder responsibility for the mess the party was in.\nPro-Delia posters which appeared on the doors of PN clubs.\nIt said general secretary Clyde Puli’s declaration following the heavy defeat that it was better than the party expected was “shocking” and uncalled for. \n“This is not how a party should be led. The party should see why the gap between the parties was growing rather than find excuses,” the sectional committee commented. \nIt also mentioned the meeting MPs Herman Schiavone and Kristy Debono had with 17 Black owner Yorgen Fenech. Responsibility should have been shouldered on that occasion too, the letter said.\nAfter that meeting was revealed by Times of Malta, Mr Schiavone had suspended himself from the PN parliamentary group and said Ms Debono was not to blame. \nMellieħa committee joins the fray\nThe Mellieħa sectional committee sent a letter to Nationalist MPs, noting it would have never imagined that the party with a glorious 140-year history would be in such a “terrible mess”. It said this had long been coming and there was no space for the blame game.\nOn the other hand, it noted, collective responsibility had to be shouldered and all action must be taken, however difficult, before a “total collapse” materialised.\nIt said solutions had to be found within the party’s four walls, away from the social media, in an honest and sincere way.\nUnconfirmed reports on Friday indicated that at least two other sectional committees had taken similar action.\n'We wrote to all MPs' - Mellieħa committee\nIn a statement issued on Saturday morning, the Mellieħa committee made it clear that it had written to all the party's MPs and urged them to assume \"collective responsibility\" for the electoral result and find solutions to help the party move forward. \n\"The impression given is that we asked for the leadership to assume responsibility or resign, when this was not the case,\"the committee said. \nPoster battle\nMeanwhile, a day after anonymous posters calling for Adrian Delia to quit as party leader were plastered on the doors of PN clubs, posters calling for him to remain appeared on Friday.\nPosters urging people to “allow Adrian Delia to work”  were affixed to some PN clubs on Thursday night.\nThe posters, which feature the masthead of the party’s weekly paper il-Mument, also noted that Dr Delia’s predecessors, Lawrence Gonzi and Simon Busuttil, had lost elections by 36,000 and 40,000 votes, respectively.\nTheir format was a clear response to the other posters, which featured the old masthead of the PN daily In-Nazzjon Tagħna and which said “we want a leader who does not embarrass us”.\nDr Delia continues to battle for his political future within the PN following a poor showing at last month’s European Parliament and local council elections.\nDuring a parliamentary group meeting that stretched into the early hours of the morning on Wednesday, irate Nationalist MPs reportedly gave him until the end of this week to step down.", "comment_count": 34, "id": 2366}, {"keywords": "Roads, Transport", "author": "Keith Micallef", "article_body": "Three years after their installation, electronic traffic signs are yet to become “intelligent” though the system is nonetheless getting an “upgrade” through the installation of more cameras.\nThe stove-like structures being installed by Transport Malta as part of a project to have more eyes on the roads.\nEvidence of the project emerged in recent weeks when stove-like black structures were installed on arterial roads across the island, fuelling the curiosity of both motorists and pedestrians.\nIt transpired that these poles will be used to install cameras so the regulator, Transport Malta, will have more eyes on the roads. This plan was confirmed by a spokesman when Times of Malta asked about the new structures. He noted that the EU-funded project was a continuation of the first national traffic control centre set up a few years ago. Its ultimate objective was to develop a more sophisticated system, he added.\nThe spokesman said that use of such technology was part of Transport Malta’s commitment to employ new means and resources to improve road safety.\nEmploying new means, resources to improve road safety\nRELATED STORIESNo 'intelligent' traffic signs, but consultants still getting their monthly retainer\nInstalled in 2016, the “intelligent” electronic signs, 34 in all, were meant to convey real-time information to motorists, such as unexpected road closures due to accidents and traffic build-ups. Such information would be relayed from an operations centre from where Transport Malta would be monitoring major roads thanks to its roadside camera network.\nFollowing initial delays, the system was meant to go live in January last year but, to date, its use is still limited to displaying educational messages such as those warning motorists not to drink and drive.", "comment_count": 18, "id": 2367}, {"keywords": "Environment, Waste, Technology", "author": "Philip Leone Ganado", "article_body": "Next time you see a broken public bench, or chance upon illegal dumping or an overflowing rubbish bin, the authorities are hoping you can resist the urge to turn to Facebook long enough to open an app and report it.\n\nA new app developed by the government, called Clean and Upkeep and already available on the App Store and Google Play, allows anyone to direct an issue of cleaning, maintenance or general upkeep straight to the relevant authority by simply opening the app, taking a photo and sending in a report.\nThe app then sends the geo-tagged report automatically to either the Foundation for Tourism Zone Development (FTZD), which takes care of the general management and upgrading of tourist areas, or the cleansing and maintenance division. Once the report is sent, users can follow the case progress within the app, while progress notifications will be sent through the app by the entity responsible.\n“The aim of the platform is to reduce bureaucracy and provide a centralised space where users can easily voice their concerns and suggestions, with the peace of mind that these will be delivered through the proper government channels and tackled as quickly as possible,” foundation chief executive Emren John Vella told Times of Malta.\nUsers can easily voice their concerns\nHe said the tourism zone foundation had a dedicated team administering the platform and ensuring that reports received through the app were tackled as quickly as possible.\nMr Vella warned that not all cases could necessarily be solved directly by the foundation, adding that, in such cases, it would follow up with the relevant authority, be it the local council, Transport Malta or others.\nThe Clean and Upkeep app forms part of Maltapps, the government’s combined platform for mobile services and follows the setting-up of the foundation within the Tourism Ministry in 2015, which was intended to ensure a better overall experience at beaches, promenades and other tourist areas.", "comment_count": 17, "id": 2368}, {"keywords": "Health, Government", "author": "Sarah Carabott", "article_body": "Patients who reacted poorly to a change in ADHD treatment will revert back to branded medication, however, the government is non-committal on when the change will occur.\nMedication available worldwide allows 95 per cent of children with attention deficit hyperactivity disorder to be treated with one form of medicine or another.\nLocally, a branded medicine, Concerta, was recently swapped for a cheaper generic one. Some ADHD sufferers had subsequently reported their condition had regressed. \nPsychiatrists have warned that changes in medication provided by the government were having a detrimental effect on children and adults.\nADHD Malta has also warned against the temptation to play around with medication.,  while the Association for Child and Adolescent Mental Health flagged “adverse effects” as a result of the medicine switch.\nThe government has insisted that it supplied high-quality generic medicine and had commissioned an independent study to look into a number of cases.\nNationalist MP Simon Busuttil last week commended the government’s efforts in looking into the matter but asked when the branded medication would be made available again. Every day without the medicine caused an inconvenience for those who depended on it, he said. \nSwitch to cheaper generic \nHealth Minister Chris Fearne said in Parliament those patients who would benefit from reverting to Concerta, according to a special technical committee, would be switched back to the branded medicine.\nHe said the government used to provide Concerta but, once the patent expired, the tender was given to the cheaper generic, as required by law. He said experts had been brought from abroad to look into the matter and it transpired that a number of patients did not react well to the generic medicine. \nHowever, the current tender could not be dropped as this would be in breach of the law.\nTimes of Malta also asked how many patients would be given access to the branded medicine, and by when that would happen. A Health Ministry spokeswoman said patients who had been approved by the Exceptional Medicines Treatment Committee to switch back would be notified by the Health Department. \nThe process to procure the branded medicine was under way, she added.", "comment_count": 3, "id": 2369}, {"keywords": "European Union, Migration, History, Joseph Muscat", "author": "Denise Grech ", "article_body": "Updated at 9.30pm\nLeaders of southern European countries convened in Malta on Friday and pledged to continue working to develop a sustainable, comprehensive migration system. \nChannels for legal migration, improved control of the EU’s external borders, enhanced external action and a reformed and harmonised common European asylum system that included solidarity between EU member states all featured in a declaration agreed upon during the sixth South EU summit. \nThe declaration also called on all rescue vessels operating in the Mediterranean to respect international laws and not obstruct operations of the Libyan coast guard. \nDuring the course of the mini-summit held in Valletta, leaders of Cyprus, France, Greece, Italy, Portugal, Spain and Malta discussed issues ranging from the possibility of creating an EU-wide minimum wage to the importance of tackling climate change. \nOngoing migration concerns, however, weighed heavily on leaders' minds.  \n\"We need to step up work on the internal aspects (such as the “Dublin” reform and the protection of Schengen), namely through the reform of the Common European Asylum System with swift adoption of all the legislative proposals with a view to establishing a legislative framework based on shared responsibility and solidarity as a matter of priority for the next Commission,\" the Valletta declaration said.\nPermanent and predictable solutions, they said, were now a matter of urgency and had to continue to be sought. \nThey agreed that the EU should provide third countries with the highest percentage of departure of migrants a long-term, predictable and stable political and financial association framework.\nDr Muscat also thanked the Libyan coastguard, saying they were doing “a handsome job” carrying out migrant rescues.\nThe declaration in full can be read in the pdf link below.\nEuropean minimum wage\nAddressing a news conference following the summit, Dr Muscat said the southern European states had agreed to push forward discussions for a European minimum wage. This, however, could not be discussed between Southern European countries alone.\nClimate change and turmoil in Libya were also on the agenda of the summit, which sought to find common ground ahead of meetings in Brussels next week.\nOpening the conference, Dr Muscat said the leaders had agreed that climate change needed to be at the centre of the European agenda. Europe needed to focus on issues related to plastic and an ongoing transformation to e-car mobility.\nThey also discussed migration, he said, and agreed that the issue could not be decoupled from the importance of freedom of movement. Issues related to Africa and migration should be taken in a global context, he said.\nItalian 'frustration'\nItalian Prime Minister Giuseppe Conte said this was a very delicate moment since this was the first meeting of the six countries since Europe went to the polls in May.\nHe expressed his \"frustrations\" at European states for taking decisions on migration a year ago and not yet implementing them in practice.\n“It is unacceptable to declare solidarity but not translate this into practice,” he said. “It risks creating more dissatisfaction among Europeans,” he warned.\nOn climate change, Mr Conte said Europe should reduce emissions by implementing common objectives. He insisted no country could face climate change alone.\nFrench President Emmanuel Macron said all six states shared the same vision on the ongoing turmoil in Libya. They had also shown solidarity with each other in burden-sharing following the disembarkations of migrant rescue vessels, he added.\nHe reiterated calls for a mechanism to help Libya, and said the meeting showed consistencies in different positions.\nSpanish Prime Minister Pedro Sanchez and Portugal Prime Minister Antonio Costa both reiterated the calls for a greener Europe, while Greek leader Alexis Tsipras called for Europeans to support the accession of Northern Macedonia and the Balkans.\nAll leaders reiterated support for Cyprus amid the ongoing conflict with Turkey.\nCypriot leader Nicos Anastasiades thanked the leaders for their support, saying that despite the conflict, countries were ready to work together to find a viable solution to the problem.\nReference to Mintoff\nIn a reference to his predecessor Dom Mintoff during his address to the leaders at the beginning of the summit, Dr Muscat said there could not be any security in Europe without security in the Mediterranean.\nFormer Prime Minister Mintoff had held up a 1975 conference in Geneva, insisting that that statement had to form part of the CSCE conference declaration.\n“Security in Europe meant nothing to Malta unless linked to security in the Mediterranean,” former representative of the CSCE talks Evarist Saliba had subsequently explained.\n \n\nProtesters outside Castille\nWhile political leaders discussed inside Castille, protesters outside had other things on their mind.\nThe #OccupyJustice members stood behind a metal barricade in Castille square, holding photos of murdered journalist Daphne Caruana Galizia and posters noting that former MP Manuel Mallia was lobbying to discredit a Council of Europe report critical of the Maltese government.\nOther posters simply said “Daphne was right”. \nAs the conference was under way, protestors chanted “Justice for Daphne,” and “shame on you”.\nDr Muscat seemingly referenced the demonstration at the end of the conference, turning to other leaders and saying “here we are open in everything, in the skies, and in freedom of speech”.\nAnother civil society group, Repubblika, used the pen to make their point.\nAn #OccupyJustice activist explains why they are protesting.\nIn a letter to the various leaders who had convened in Malta, they urged them to insist with Dr Muscat that Malta had to comply with the European norms of democracy and rule of law, protect freedom of speech, guarantee judicial and institutional independence and stop the use of Malta for the illicit purposes of international criminals.\nRepubblika also urged the leaders to join its call for the Muscat government to open an independent, international inquiry into Ms Caruana Galizia’s murder.\nThe Muscat government had victimised whistleblowers while allowing a minister and chief of staff to remain in office, despite having been caught opening secret companies in Panama.\nThe two had secured “considerable bribes” to tie Malta into unfavourable public procurement from Azerbaijan, Repubblika claimed.\nIt said senior figures in that dictatorship used Malta to launder money until the bank they used, licensed by the intervention and with the blessings of Malta’s government, was shut down by the European Central Bank.", "comment_count": 155, "id": 2370}, {"keywords": "Court, Justice, Crime", "author": "Edwina Brincat", "article_body": "A man convicted of trying to kill his former partner’s 15-month old baby has had his 14-year jail term reduced to 10 years on appeal.\nAkande Rotimi Williams, a 29-year-old Nigerian residing in Malta, had been accused of attempted willful homicide, grievous bodily harm and ill-treatment of the child entrusted to his care. The baby was found stiff and unresponsive in its cot.\nThe case dated back to April 2013 when the baby boy had been rushed to hospital, arousing the suspicion of doctors who said that the child had already been admitted to hospital some two weeks earlier with symptoms suggesting 'shaken baby syndrome’, a medical condition indicative of abusive brain trauma.\nCriminal action was taken against Mr Williams for leading to a trial by jury which ended in July 2017 with an 8-1 guilty verdict on both counts.\nThe accused was condemned to a 14-year jail term and had filed an appeal.\nThe Court of Criminal Appeal observed that medical research over the past decade had led a growing movement of doctors to question the causes which could lead to a diagnosis of the “shaken baby syndrome”, since accidents and certain diseases could result in “identical conditions”.\nAll doctors testifying in the case had been asked to confirm whether the child’s injuries could have been triggered by some underlying medical condition.\nUnfortunately, the only court-appointed medical-legal expert who could express an opinion “although highly qualified in the field of forensic medicine, lacked a specialisation both in neurology, in ophthalmology and in paediatric medicine,” the court said.\nOnce his testimony had not been supported by that of other medical specialists, his conclusions could not be deemed “completely watertight” even since the prosecution had put forward “no other circumstantial evidence”.\nFor this reason, the court, presided over by Chief Justice Joseph Azzopardi, Mr Justice Joseph Zammit Mckeon and Madam Justice Edwina Grima concluded that the jury’s verdict had been “unsafe and highly unsatisfactory,” since the intent to kill had not been proven beyond reasonable doubt.\nHowever, the medico-legal evidence, the non-accidental nature of the injuries as well as scratch marks, bruises and fractured ribs on the child, did prove that force had been inflicted upon the child.\nFor this reason the court upheld the jury’s verdict in so far as it had found the accused guilty of grievous bodily harm, observing that Mr Williams had been “the sole carer at the time of both incidents,” but reduced his jail term to 10 years and confirmed the €1,644 fine payable within 15 days.\nLawyers Franco Debono and Amadeus Cachia assisted the accused at the appeal stage.", "comment_count": 0, "id": 2371}, {"keywords": "European Union, Politics", "author": "Denise Grech ", "article_body": "Activists took to Valletta ahead of a southern EU countries summit on Friday to say that women and girls in Malta are treated as \"just incubators\".\nThe protestors from Moviment Graffiti and Voice for Choice held up signs reading \"my body, my life, my choice\". They urged authorities to \"trust women\".\nAbortion is illegal in Malta under any circumstance, with no exceptions for rape, incest or when life is at risk, another sign pointed out.\nThe demonstration comes as leaders from several southern European countries arrive in Malta to discuss issues such as migration, regional security and Brexit.\n\nWatch the summit proceedings live above\nThe sixth southern EU countries summit is bringing together leaders from Cyprus, France, Greece, Italy, Portugal, and Spain and Malta.\nThe two-hour mini-summit meeting is also seen by political observers as an opportunity for Prime Minister Joseph Muscat to lobby for one of the EU’s top jobs.\nA senior diplomat had pointed out that the mini-summit in Malta will coincide with the time when European leaders will be making up their minds on who should get what in the EU institutions.\nDr Muscat has downplayed interest in EU institutions, saying people should be more concerned with the EU’s direction rather than who will take the top jobs.", "comment_count": 117, "id": 2372}, {"keywords": "Court, Justice", "author": "", "article_body": "An appeal’s court on Friday overturned a decision to extradite a man wanted in Italy over the laundering of mafia money.\nAntonio Ricci, listed as a company secretary to the Malta company Harvey Gaming, had been arrested in late April through a European Arrest Warrant issued by a court in Calabria, on suspicion of laundering ‘Ndrangheta mafia funds.\nMagistrate Donatella Frendo Dimech had upheld the request for his extradition in May, ruling that the legal prerequisites had been satisfied.\nBut Mr Ricci appealed the decision, claiming that the investigations by the Italian authorities had not been concluded yet so the Maltese court could not decide to extradite him. \nMadam Justice Consuelo Scerri Herrera upheld this argument and overturned the magistrate’s decision. She ruled that Mr Ricci should not be extradited because the Italian authorities’ investigation into his dealings had not yet been concluded.\nThe judge clarified that the man was wanted over the investigation and not for the prosecution over alleged charges. For this reason, she said, the court could not treat him as though he had been or would be accused of committing any crime.\nNot only had court proceedings against Mr Ricci not yet started, the court noted, there was a chance that they would not start at all and that the man would be released before being charged.\nThe documentation provided by the Italian authorities was unclear and at times confusing and contradictory, the judge continued.\n“Before these conflicts emerging from the acts, this court is not of the opinion that the appellant is required for the purposes of prosecution but it emerges that the investigation is not yet closed… On the basis of these considerations, this court does not agree that the European Arrest Warrant was issued for the purposes of prosecution but believes that there are other instruments which that could have been used…”\nFor this reason, the sentence ordering his extradition was revoked and the court ordered Mr Ricci’s immediate release.\nLawyers Franco Debono, Arthur Azzopardi, Stephen Tonna Lowell and Mario Mifsud appeared on behalf of Ricci.\nPolice Inspectors Mark Galea and Robinson Mifsud prosecuted.\nLawyers Matthew Xuereb and Charles Mercieca appeared on behalf of the Office of the Attorney General.", "comment_count": 0, "id": 2373}, {"keywords": "Accident, Construction", "author": "", "article_body": "A family which had part of its apartment demolished in an incident on Thursday is appealing for help to find a wheelchair-friendly apartment in a central area.\nThe woman interviewed after the accident.\nA total of 14 adults and two children were evacuated from three apartments after the collapse in Guardamangia, the second such incident in a week.\nJanet Walker wrote on Facebook that on Thursday night the family were hosted at the Diplomat Hotel. They had now been offered an apartment in Qawra which, however, did not meet the family’s needs. They were also offered a room in at St George's Park in Paceville for Friday night.\nRELATED STORIESWatch: 'We did everything to warn them the wall will collapse'\nMs Walker said she worked in Kirkop, her sister in Paceville, her niece's school was in Ħamrun and her mother needed constant attention.\n“Do you think we should be treated better? We are literally exhausted. Please help me push this forward,” she pleaded.\nReplying to a comment, Ms Walker said that she had been offered therapy but what the family wanted was a roof over their heads.\nThe architect, the builder and the owner “should step out of their homes and try this life” if need be, she said.", "comment_count": 43, "id": 2374}, {"keywords": "Environment, Politics, Human rights", "author": "Denise Grech ", "article_body": "Updated at 5.40pm with Mr Mizzi's comments\nGuardian for Future Generations Maurice Mizzi resigned on Thursday, three weeks after sparking controversy with remarks about Muslims. \nIn a letter to Environment Minister Jose Herrera, Mr Mizzi said that he was stepping aside to spare him trouble over the case. \n\"I know you are facing a difficult decision,\" he wrote. \nSpeaking to the Times of Malta, Mr Mizzi said that it was the second time he was resigning in 10 days. An initial offer to resign, he said, had not been accepted. \nEarlier this month, Minister Herrera had said that he would be considering Mr Mizzi's position, having heard him out following comments he made while being interviewed. \nIn an interview with The Sunday Times of Malta last month, Mr Mizzi made several controversial comments about Muslim people, saying Malta was a Catholic country, and \"when I die, I want to die in a Catholic country\".\nHe had said there were \"so many Muslims coming - they are all having nine babies, next to our two - and they will take over eventually\".\n“Muslims don’t change,\" he had added. \nRELATED STORIESMaurice Mizzi's anti-Muslim remarks 'completely unacceptable' - PresidentMinister 'considering' Maurice Mizzi's position after anti-Muslim tirade\nHis comments sparked multiple calls for his dismissal, with NGOs criticising his “racist discourse”. President George Vella also expressed outrage at his comments, saying they were absolutely appalling.\nEnvironment Minister Jose Herrera had told Times of Malta he disagreed with the comments but stopped short of saying he should resign. Just a few weeks ago, he said he was still “considering his position”.\n'I was honest' - Mizzi\nIn his resignation letter, Mr Mizzi reiterated his conviction that his comments were \"in the best interests of our islands and of their present inhabitants\".\n\"I also had in mind our children, grandchildren and those who have not yet been born,\" he added. \nHis comments, he said, were personal and did not reflect the views of other members of the Guardian for Future Generations.\nNoting that he employed many migrants at his company and cared for several more indirectly as the benefactor of the Spiro Mizzi Foundation, he said his comments were \"only echoing what two politicians said without offering their resignation\" and inspired by Cardinal Burke's views.\nEarlier this year, US cardinal Raymond Burke had argued that “to resist large-scale Muslim immigration in my judgment is to be responsible\" and called Muslim migrants \"opportunists\". \nMr Mizzi said he had received \"hundreds of emails and phone calls\" backing him and his stance. Those who had criticised him were somewhat hypocritical, he suggested. \n\"Not only do I believe that immigrants who are living in Malta should continue to live and work here but I am disillusioned by the way that they are being treated and given the lowest jobs with the worst pay,\" he wrote. \n\"I wonder what those few people who criticised me are doing in order to help these immigrants\". \nMinistry thanks Mizzi for his work\nIn a statement, the Environment Ministry said Dr Herrera thanked Mr Mizzi for the dedication shown in his work during his past two years of his tenure. He also thanked him for the valuable feedback given on various subjects related to sustainable development.", "comment_count": 70, "id": 2375}, {"keywords": "Construction, Accident, Demonstration, Civil society, Pieta’", "author": "", "article_body": "A protest against “developers’ dictatorship” following three building collapses in two months is being organised by Moviment Graffitti on Tuesday.\nThe protest will be held in front of the Malta Developers’ Association offices on Tuesday, kicking off from St Luke’s Hospital at 6pm.\nThe NGO is calling on residents and associations from localities across Malta to “show their displeasure at the way they have been treated by the developers’ lobby and their dictatorship”.\nIt encouraged all those who are angry, fed up and worried about this situation to join this protest.\n“Graffitti has repeatedly warned about the sad state of affairs. Developers do as they please all over Malta, to the detriment of residents who have to face, day to day, noise, dust, road closures, traffic, illegal dumping of waste, physical hazards, and the arrogance of the developers who clearly have no interest in anything but making millions.\n“All this is happening with the tacit blessing of the Planning Authority, which rarely takes action against these developers, and of other authorities who never intervene.”\nRELATED STORIESGovernment announces reform after stopping all demolition, excavation worksWatch: Building collapses in Mellieħa\nGraffitti added that following the first incidents, which included numerous deaths in various construction sites, nobody had stepped up to take responsibility.\nAdditionally, the MDA \"arrogantly\" stated that \"these are accidents that happen”.\nIt was only after people started losing their homes, together with bad publicity and media pressure, that the government started to address this “uncontrollable problem”.\nThe civil society activities drew up a list of urgent demands which it said would help safeguard residents' safety. \nThey include:  \n- A limit on permits issued\n- An end to the laissez-faire attitude prevalent in the planning sector\n- Restricted hours for construction and excavation works and a limit on the number of parking spots taken from residents\n- A law that imposes decent standards to safeguard the residents’ health and safety in areas close to construction sites\n- Serious enforcement of construction laws, to protect both workers and residents\n- Ensuring responsibility is assumed for such incidents. So far, Graffiti said, nobody has taken responsibility for any of these accidents.\nFamily appeals for help finding suitable apartment\nThe family who ended up on the street after Thursday's collapse are meanwhile appealing for help finding a wheelchair friendly apartment in the central area.\n\nJanet Walker wrote on Facebook that on Thursday night the family were hosted at the Diplomat Hotel. They had now been offered an apartment in Qawra which, however, did not meet the family’s needs. They were also offered a room in at St George's Park in Paceville for Friday night.\nMs Walker said she worked in Kirkop, her sister in Paceville, her niece Thea’s school was in Ħamrun and her mother needed constant attention.\n“Do you think we should be treated better? We are literally exhausted. Please help me push this forward... share,” she pleaded.\nReplying to a comment Ms Walker said that she had been offered therapy but what the family wanted was a roof over their heads.\nThe architect, the builder and the owner “should step out of their homes and try this life” if need be, she said.", "comment_count": 26, "id": 2376}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A mother-of-five facing prosecution alongside alleged drug kingpin Jordan Azzopardi was remanded in custody on Friday after being re-arrested at the dock on Thursday, following allegations of attempting to bribe a witness.\nThe woman’s unexpected re-arrest came at the end of a charged sitting during which a former customer of the alleged druglord claimed that the woman had spoken to him last week over the phone and asked him not to testify, offering him €10,000 and a further €10,000 after the court hearing.\nThe witness described how he had been pestered by similar calls from a third party.\n“I’m speaking out because I’ve had enough. They’ve been threatening me even up till last week,” the man insisted under oath on Thursday.\nRELATED STORIES'I had a fit and nobody called for help' - witness recalls drug lord incident\nThe young mother had been taken back into police custody following the claims, despite her disbelief. \nRELATED STORIESDrug kingpin hid money in shower walls, court toldCocaine-hooked chef recalls how Jordan Azzopardi beat him\nAs police investigations continued, the 31-year old Madliena resident - whose name was banned under court order in separate proceedings - was escorted once again to court on Friday, pleading not guilty to the charges.\nA request for bail by defence counsel Franco Debono was strongly objected to by prosecuting inspector Mark Anthony Mercieca, who pointed out that not only were the charges “immensely serious” but she had already wasted another chance at bail.\nThe court, presided over by magistrate Ian Farrugia, after hearing submissions by both parties, turned down the request, remanding the woman in custody.", "comment_count": 0, "id": 2377}, {"keywords": "Police, Crime, Msida, Naxxar", "author": "", "article_body": "Three men believed to form part of a drug ring bringing cocaine and cannabis into Malta have been arrested by police in an anti-drugs operation that stretched over two days.\nOfficers found around €70,000 in cash, two kilogrammes of cannabis and two kilogrammes of a white powder which tests revealed was a cutting agent often used by drug dealers selling cocaine.\nCocaine is often cut with a variety of adulterants and substitutes, allowing dealers to bulk it up and increase their profit.\nAll three men – two Britons and one Maltese – live in Malta, with homes in Naxxar, Żabbar and Msida. Police did not provide their specific ages but said they ranged in age between 28 and 37.\nThe anti-drugs operation began when officers searched the car of one of the men in Naxxar and found two kilogrammes of cannabis, packaged and ready for sale. They then searched his home and found the cutting agent.\n\nOfficers then searched the home of a British national who lives in Msida. There, they found more than €70,000 in cash and two watches with an estimated €24,000 value.\nIn a statement announcing the arrests, police said they suspect the three of forming part of an organised crime ring which imports “substantial” amounts of illicit drugs into Malta.\nAll three arrested men are expected to be arraigned on Friday or Saturday. They will most likely be charged with drug trafficking crimes, aggravated possession of dangerous substances and possibly money laundering.\nMagistrate Natasha Galea Sciberras is leading an inquiry into the case.", "comment_count": 0, "id": 2378}, {"keywords": "Construction, Government", "author": "Claudia Calleja", "article_body": "Updated at 4.50pm with FAA statement\nThe Prime Minister’s decision to suspend all excavation and demolition permits may expose the government to potential claims for damages, according to a lawyer specialising in construction.\n“Government has put its head on the line … by resorting to this extreme action. The collapse of a number of buildings is an indictment against government for failing to act, while exposing the administration to potential claims for damages.\n\"Construction companies who may incur penalties owing to this delay will have a right of recourse against government if they can prove that there was no justification for this extreme action in their regard,” the lawyer said.\nThe lawyer, who preferred not to be named, was reacting to government’s decision to suspend all excavation and demolition permits pending new regulations aimed at addressing safety in the construction industry.\nPrime Minister Joseph Muscat made the announcement on Thursday, hours after an apartment wall collapsed into a building site in Ħamrun, the second such incident in a week and the third in two months.\nLast Saturday a three-story apartment block collapsed in Mellieha. Another apartment block, adjacent to a building site, collapsed in Guardamangia in April.\nThe lawyer said the blanket ban decision confirmed that responsible authorities had abdicated their responsibilities \"to harness and rein in third-world practices in construction with scant regard for the safety and well-being of residents\".\nInstitutions have sadly failed residents in Malta\n\"These institutions have sadly failed residents in Malta and have exposed individuals, including construction workers, to dangerous situations,” the lawyer said.\nCan the Prime Minister do that?\nSince Thursday’s announcement, many questioned whether the Prime Minister had the authority to order a blanket nation-wide ban on excavation and demotion. Technically this is the role of the Building Regulations Office.\nSo, what happened? Following consultation with stakeholders, the Prime Minister instructed the BRO to set in motion a legal provision that allows permit-holding construction activity to be halted.\nArticle 18 (2) of Legal Notice 72 of 2013 states that, if the director of the BRO “deems that the cessation of construction activity is to be immediate because of imminent severe damage to contiguous properties of danger the public…”, the enforcement notice and the required preventive measures may be issued on site in a verbal manner and later confirmed in writing.\nSo, while the Prime Minister was announcing the measure to the public, police were visiting sites where there is ongoing demolition and excavation and halting works on the back of the legal notice.\n'Too little, too late' - FAA\nDr Muscat's decision to freeze all excavation and demolition works did not impress NGO Flimkien Għal Ambjent Aħjar, which in a statement said the measure was \"too little, too late\". \n\"The Prime Minister's words do not address the plight of residents who have lost their homes and suffered trauma through developers’ callous abuse,\" the NGO said. \n\"How are residents compensated speedily for losing their homes suddenly and for the shock and inconvenience of being uprooted and left in limbo...for how long?\" \nThe NGO said that along with making geological surveys obligatory, authorities should enforce existing laws and ensure all cranes, concrete mixers and trucks were periodically certified.\nPoliticians were the ones responsible for the sorry state of affairs, FAA added, saying that they had encouraged over-development, allowed developers to do as they please and even given the developers' lobby NGO funds. ", "comment_count": 103, "id": 2379}, {"keywords": "Accident, Police", "author": "", "article_body": "An eight-year-old boy was seriously injured on Friday morning after getting hit by a car.\nPolice said that the incident occurred on Triq id-Dawr in Mosta at 7.50am.\nThe car was being driven by a 32-year-old woman from Mosta.\nInvestigations are still under way.\n ", "comment_count": 0, "id": 2380}, {"keywords": "Gozo, Construction, History", "author": "Sarah Carabott", "article_body": "The back wall of an 18th century town house that collapsed during the development of a boutique hotel was rebuilt with controversial apertures onto the Gozo Citadel ditch, the Times of Malta has been told.\nWhen contacted, Wirt Għawdex said it was extremely disappointed that the authorities responsible for safeguarding and protecting the heritage had allowed such development to continue.\nTogether with the Victoria local council, the Gozitan NGO last year flagged the opening of windows and a door onto the Citadel ditch as part of the conversion of an 18th-century house of character into a boutique hotel.\nDuring development on the site at It-Tokk, which lies within a historical area of archaeological importance, the back wall of the house collapsed and the Planning Authority stopped all works.\nThe back wall had collapsed during development in April of 2018\nWirt Għawdex president Giovanni Zammit told the Times of Malta on Thursday the NGO was not against the development itself because it encouraged the rehabilitation and regeneration of abandoned buildings, especially in the town core. \n“However, we are totally against the opening of the apertures since this has breached and damaged the ditch perimeter walkway of a recently-restored potential Unesco historical site,” he remarked.\nNobody asked for permission to open the apertures\nIt was also pointless having a gate to secure the ditch at night since this commercial development would allow uncontrolled access to the ditch, he added.\nRELATED STORIES'Revoke permit for windows and doorway overlooking Cittadella'\nThe NGO is concerned that the opening of a door in future could lead to the setting up of tables, chairs and umbrellas for commercial purposes.\nAt the same time, the new height of the development would obscure the sight of the Citadel clock from the main square, changing a centuries-old vista, Mr Zammit said.\nAsked whether the NGO had received any feedback since it flagged its concerns with the authorities last year, Mr Zammit said the only formal replies were from the Planning Authority and the local council.\nThe PA had informed Wirt Għawdex the only way to stop the permit was in cases of fraud, incorrect information, error on the face of the record or public safety.\n“Since none of these factors were in play, the permit could not be revoked. The Victoria local council, which is the lessee for the ditch confirmed that nobody had asked either their or the Lands Department’s permission to open the apertures overlooking the ditch.”", "comment_count": 33, "id": 2381}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "One day after anonymous posters calling for Adrian Delia to quit as Nationalist Party leader were plastered onto the doors of PN clubs, a different set of posters calling for him to stay on have appeared. Posters urging people to “allow Adrian Delia to work” were put up by unknown people on the PN clubs on Thursday night. The posters, which feature the il-Mument masthead, also remind voters that Dr Delia’s predecessors Lawrence Gonzi and Simon Busuttil had lost elections by 36,000 and 40,000 votes respectively. Their format was a clear response to posters affixed to PN clubs one day prior, which featured the old masthead of PN newspaper In-Nazzjon Tagħna and said “we want a leader who does not embarrass us”.\nDr Delia continues to battle for his political future within the PN following a poor showing at European Parliament and local council elections held last month.\nEarlier this week, during a parliamentary group meeting that stretched into the early hours of the morning, several irate PN MPs reportedly gave him until the end of this week to step down. \nDifferent posters calling for the direct opposite - Dr Delia to go.\n ", "comment_count": 66, "id": 2382}, {"keywords": "Crime, Justice", "author": "Claire Caruana", "article_body": "Updated 12.30pm - Added timeline\nFormer drama teacher Erin Tanti on Friday pleaded guilty to charges he murdered 15-year-old Lisa Maria Zahra at Dingli Cliffs in 2014 and was handed a 20-year prison sentence.\nMr Tanti had been accused of wilful homicide as well as with having assisted his teenage student in committing suicide, after the two had allegedly been discovered at the bottom of the cliffs on March 19, 2014.\nThe man was also accused of having defiled the underage girl at the time when he was her teacher.\nMr Tanti admitted to committing all the charges against him.\nHis trial by jury was due to start on Friday but as the case was about to begin and before the jury had been empanelled, he filed a last-minute admission to receive a mitigation in punishment.\nJudge Consuelo Scerri Herrera, presiding over the case, handed down a 20-year six-month sentence.\nTony Zahra, the father of the victim, hurled abuse at the accused as the sentence was read out.\nLawyers Michael and Lucio Sciriha served as defence counsel.\nRELATED STORIESPolice hope to quiz cliff tragedy teacherLisa-Marie Zahra case: Bail for drama teacher after 15 months in custodyFamily speaks out\nIn comments after Mr Tanti’s guilty plea, the victim's cousin, Winston Zahra, speaking on behalf of the family, said that the past five years have been extremely difficult for all the family, who had to come to terms with the death.\n“Apart from the trauma of what happened, the long drawn-out legal process and the fact that as a family we could not publicly discuss the case to correct the misconceptions reported by some of the media, despite having seen all the clear evidence that Lisa Maria was murdered, made matters more difficult,\" he said.\nThe victim's family with lawyers outside court. Photo: Matthew Mirabelli\n“Today we can finally speak out. By Mr Tanti’s own admission in court this morning, on March 19, 2014 Lisa Maria Zahra was murdered by the very person who had a duty of care to look after her. Erin Tanti was an adult. He was Lisa Maria’s drama teacher. Lisa Maria was his 15-year-old student who would still be alive today were it not for this man.\n“We have always known as a family that this was a case of murder and finally after a long drawn out five years Erin Tanti has admitted in court to the crime of murdering Lisa Maria,” Mr Zahra said.\nSpeaking about the foundation set up in his cousin’s name, the Lisa Maria Foundation, Mr Zahra said the foundation will continue to work hard in her name to do “whatever possible to help safeguard our children” and continue to ensure that there are the necessary checks and balances in place when people are employed and entrusted with the care of children.", "comment_count": 0, "id": 2383}, {"keywords": "Politics, European Union, Justice", "author": "Claire Caruana", "article_body": "Labour MP Manuel Mallia has urged colleagues to use Friday's mini-EU summit to lobby against the Council of Europe report on the rule of law in Malta.\nThe former national security minister, who heads the Maltese delegation to the Council of Europe, made the appeal yesterday in a WhatsApp message to MPs who sit on the delegation. They are Labour MPs Stefan Zrinzo Azzopardi, Etienne Grech and Rosianne Cutajar and Nationalist MPs Carm Mifsud Bonnici and Jason Azzopardi.\n“Mini summit tomorrow between six countries is fertile ground for lobbying against Omzigt’s report. Anyone taking the lead?”, Dr Mallia wrote.\nA two-hour mini-summit meeting is being held in Malta on Friday, aimed at regrouping leaders of southern member states in preparation for talks in Brussels next week. The leaders of France, Italy, Spain, Portugal, Greece and Cyprus are attending the Malta meeting.\nRELATED STORIESMalta's rule of law undercut by frail checks and balances - Council of Europe reportSchembri, Mizzi enjoy ‘total impunity’ with Muscat’s protection – Council of Europe\nNone of the delegation members had replied to Dr Mallia by the time the message was viewed by Times of Malta.\nI shall keep working against misinformation spread about my country\nLast month, Dr Mallia presented over 40 amendments to the report drawn up by Council of Europe rapporteur Pieter Omtzigt, a Dutch MP. He had sought to delete critical passages referring to the government and watering down references to the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi.\nThe draft report, approved in committee last month, stuck to the conclusion that Malta’s rule of law is seriously undermined by the “extreme weakness” of its system of checks and balances. It points out that top officials like Mr Schembri and Dr Mizzi enjoy impunity under Prime Minister’s Joseph Muscat’s personal protection.\nDr Mallia had last year requested the withdrawal of the mandate to Mr Omtzigt as Council of Europe rapporteur monitoring investigations into Daphne Caruana Galizia’s murder. The request was rejected.\nAsked why he felt the need to ask his colleagues to “lobby against” the report and whether he had discussed the matter with the Prime Minister, Dr Mallia said: “As a member of Parliament and as head of the Maltese delegation to the Parliamentary Assembly of the Council of Europe, I am in duty bound to work in the interests of Malta. Contrary to some Opposition MPs who are lobbying very hard against Malta, I shall keep working against misinformation spread about my country.”", "comment_count": 63, "id": 2384}, {"keywords": "Construction, Accident", "author": "", "article_body": "The Nationalist Party has offered to work “hand in hand” with the government and other stakeholders to set up a regulatory framework for the construction industry, saying it was in favour of an authority which would function effectively.\nThe government is proposing to set up the Malta Building and Construction Authority, but while this was still at the consultation stage, a number of buildings have collapsed, putting pressure on the sector to reduce the dangers.\nThe government on Thursday – following the collapse of yet another apartment wall in Ħamrun ¬– temporarily suspended demolition and excavation works unless to do so would pose even more danger.\nPN spokesmen Marthese Portelli, Claudette Buttigieg and Toni Bezzina expressed solidarity on Friday with the residents that had to be evacuated on Thursday. They also said that the party agreed with the suspension imposed by the government with immediate effect.\n“This should be in force until regulations and procedures are in place which regulate the sector in a serious, coordinated and holistic way,” they said, saying that apart from third parties affected by shoddy work, the safety of workers was also at stake.", "comment_count": 17, "id": 2385}, {"keywords": "Migration", "author": "", "article_body": "Updated at 11.39am\nA migrant rescue vessel which Italian media claimed was heading to Malta is seeking to disembark in Lampedusa, the NGO behind it has insisted. \nThe Sea Watch 3 rescued 52 people on Wednesday from a rubber boat in distress, about 47 miles off Zawiya, Libya.\nItalian media on Friday claimed that the ship and its crew were en route to Malta, having veered east after nearing the Italian island of Lampedusa. \nHowever, a spokesman for the NGO denied this. \n\"We have no indication [of where the vessel can disembark]. As long as we have no indication, we follow the law and head to Lampedusa,\" the spokesman told Times of Malta. \"It is the closest port of safety\". \nUnder international law, ships which rescue people in distress should take their rescued passengers to the closest port of safety. \nA Maltese government source told the Times of Malta they had no request from the NGO to head to Malta. \nThe Sea Watch 3's mission was further complicated on Thursday when Italian Deputy Prime Minister Matteo Salvini ordered law enforcement authorities to take all necessary measures to prevent the entry into or transit through Italian waters of the ship.\n\nThe Dutch-flagged vessel is currently cruising at 3.6 knots.\nThe incident coincides with a two-hour mini-summit meeting being held in Malta on Friday, aimed at regrouping leaders of southern member states in preparation for talks in Brussels next week.\nThe leaders of France, Italy, Spain, Portugal, Greece and Cyprus are attending the Malta meeting.\nMore as the story unfolds.", "comment_count": 0, "id": 2386}, {"keywords": "Accident", "author": "", "article_body": "A 70-yeaar-old woman from Qormi was seriously injured after the car in which she was a passsenger crashed into four parked car in Triq il-Wied in her home town.\nShe was being driven by an 84-year-old man from Pieta', who did not sustain any injuries.\nPolice said that the accident took place at 6.30pm on Thursday night.\nThe police also reported that a Briton was grievously hurt after falling a substantial height from a private residence at Marsalforn at 1.30am.\nThey did not give details of the man's age.\n ", "comment_count": 0, "id": 2387}, {"keywords": "Transport", "author": "Keith Micallef", "article_body": "The interests of car owners whose vehicle was registered before 2009 would be “at the forefront” of government deliberations with Brussels in talks on registration tax, the Finance Ministry said.\n“The Maltese government is in the process of evaluating the merits of this case with a view to finalising its submissions to the European Commission. In its deliberations, the government is being informed by the values of fairness and equity,” a spokesman told this newspaper.\nThe ministry was asked about the way forward following the announcement a few days ago that the Commission was requesting Malta to change its legislation on the annual circulation tax for cars.\nIn its reaction, the Finance Ministry insisted that the issue did not cover the entire Maltese registration and licensing of motor vehicles regime.\nThe issue concerns second-hand cars imported and registered in Malta after January 1, 2009 but which had already been registered in other EU countries prior to the same date. It also affects the annual circulation tax in respect of cars registered locally before January 1, 2009.\nThe issue did not cover the entire Maltese registration and licensing of motor vehicles regime\nIn its letter of formal notice, as it is called, Brussels asked the Maltese authorities to amend the rules on car taxation. It noted that, under the existing legislation, the category of second-hand cars in question were taxed more heavily than similar vehicles registered in Malta before that date, even when the imported car had already been registered in another member state.\nThe Commission said it considered Maltese legislation as “not compatible with EU law”. Malta must reply within two months or the Commission will escalate its action by sending a reasoned opinion. This would be the second of three stages that lead to the opening of an infringement procedure under which the matter would be referred to the European Court of Justice for a final decision.\nThe Association of Car Importers spokesman told the Times of Malta that, due to the limited information publicly available, the grounds which formed the basis of the Commission’s proceedings against Malta were not clear.\nHe said the association recognised the need for Malta to ensure that any car registration tax system it applied would be in full compliance with the EU’s internal market rules.\nThe spokesman emphasised the importance for the national authorities to ensure that all second-hand vehicles being imported had to comply with other relevant EU legislation, particularly laws that formed part of the environmental acquis.", "comment_count": 27, "id": 2388}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe collapse of an apartment building's wall in Ħamrun dominates the Times of Malta, which also reports on the government's decision to suspend all demolition and excavation works.\nThe Malta Independent also hones in on the government's decision following the accident, and also reports that the first of Mount Carmel's refurbished wards will be opening next week.\nIn-Nazzjon has a similarly dramatic photo of the apartment collapse on its front page, while L-Orizzont couples its own main story with a criticism from the General Workers' Union of \"certain contractors and speculators\".", "comment_count": 0, "id": 2389}, {"keywords": "LGBTIQ, Religion", "author": "Philip Leone Ganado", "article_body": "Maltese LGBTI Catholics have responded with concern to a new Vatican document that calls out an “educational crisis” over current understanding of gender identity.\nThe document – published on Monday and entitled “Male and female He created them” – is intended to help Catholic school teachers counter ideas which “deny the natural difference between a man and a woman”.\nThe 31-page paper by the Church’s education ministry calls for dialogue but also criticises modern notions of gender identity as “nothing more than a confused concept of freedom in the realm of feelings and wants”.\nIt warns of attempts to “annihilate the concept of nature” and lays down that it is a person’s biological sex which “on the biological, psychological and spiritual levels, make that person a man or a woman”.\nRELATED STORIESMalta remains role model in EU for LGBT inclusivityMalta fourth in best tourism destinations for LGBTI+ people\nReleased as LGBTI people worldwide celebrate Pride month, the document has been harshly criticised by international advocacy groups.\nChristopher Vella, from the Maltese Catholic LGBTI group Drachma, told Times of Malta that while he welcomed the document’s call for dialogue, he questioned the genuineness of its approach.\n“If you start from the position that the other side is bad and wrong, there can be no dialogue,” he said. \n“The way the document speaks about intersex and trans people fails to understand what such people are going through. Simply imposing a gender binary is a non-starter.”\nIf you start from the position that the other side is bad and wrong, there can be no dialogue\nMr Vella said the Church in Malta had shown a significant willingness to listen and engage with the community and also expressed hope that the Vatican document – not signed by the Pope – would be a starting point and not the final word in the conversation.\n“If Christian anthropology was developed at a time when current scientific understanding was not available, it needs to be informed by that if it’s going to move forward,” he said, insisting people’s lived experiences could not be dismissed as ‘ideology’.\n“We are all people trying to live our human dignity and Christian vocation as sons and daughters – and whatever else – of God.”\nMalta is among the most progressive countries worldwide for intersex and transgender rights, with laws based on the right to gender-identity recognition and self-determination. \nCurrent educational policy requires schools to “promote the learning of human diversity that is inclusive of trans, gender variant and intersex students”.\nSilvan Agius, head of the government human rights and integration directorate, said the Church in Malta had repeatedly shown itself supportive of efforts to promote inclusiveness.\n“With that in mind, I would be very surprised if the Catholic Church in Malta were to start distributing this document round schools saying they must follow it,” he said.\nAcknowledging that the government’s educational policy was not law, he said elements of the Vatican document, particularly ‘gender normalising’ procedures on intersex infants, were illegal under Maltese law.", "comment_count": 127, "id": 2390}, {"keywords": "Accident", "author": "", "article_body": "A 36-year-old man was grievously injured on Thursday when he was hit by a car in Lija.\nThe police said the accident happened in Triq il-Mosta at 6.15pm.\nThey said the man, who lives in St Paul’s Bay, was hit by a BMW Z4 that was being driven by a 29-year-old man from San Ġwann.\nThe victim was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2391}, {"keywords": "Health", "author": "Claudia Calleja", "article_body": "A United Nations committee has recommended the decriminalisation of abortion “in all circumstances”, urging the government to ensure adolescent girls have “access to safe abortion and post-abortion care services”.\nThe Committee on the Rights of the Child, tasked with monitoring the implementation of the Convention on the Rights of the Child made its recommendation in a report on Malta’s progress in this area.\nA Health Ministry spokeswoman said: “The UN report is noted. Malta’s position remains unchanged.”\nThe government has been insisting it does not have a mandate to change abortion laws and says the right to life is an inherent right of every human being, including the unborn child, from conception.\nMalta has the strictest anti-abortion laws in the world. \nWomen who willingly procure an abortion are liable to a prison term ranging from 18 months to three years.\nIn a section dealing with adolescent health, the report noted that “while recognising the State party’s efforts to provide guidance, support and counselling services to pregnant girls, the committee notes with concern that abortion remains a criminal offence under the Criminal Code with no exception, including in cases when the pregnant girl’s life or health is at risk or when the pregnancy is a result of a criminal act such as rape or incest”.\nThe UN committee recommends the development and implementation of a comprehensive sexual and reproductive health policy for adolescents. This, it adds, would ensure that sexual and reproductive health education is part of the mandatory school curriculum and targeted at both adolescent girls and boys, with special attention on preventing early pregnancy and sexually-transmitted infections.\nIt also proposes ensuring that adequate sexual and reproductive health services are available for adolescents, in particular access to modern contraception methods.\nFinally, it recommends decriminalising abortion in all circumstances and ensure access to safe abortion and post-abortion care services for adolescent girls, ensuring their views are always heard and given due consideration as part of the decision-making process.\nThe abortion debate has been gaining momentum on a national level over the past months and both pro- and anti-abortion lobby groups were formed.\nA group of 670 doctors joined forces earlier this month to form Doctors for Life, declaring their stand against abortion and insisting that life starts from conception and that it should be given the opportunity to develop.\nWe hope that our local decision-makers treat this issue seriously\nA pro-choice lobby called Doctors for Choice, represented by medical professionals, most of whom remain anonymous, favours introducing safe abortion on the island.\nDoctors for Choice Malta co-founder Alexander Clayman said the report echoed the lobby group’s mission statement in recommending comprehensive sex education, accessibility to contraception, decriminalisation of abortion and provision of safe abortion services for adolescent females.\nSince, as the UN report correctly noted, abortion in Malta was a criminal offence without exception, there was “no legal mechanism whereby a doctor can legally perform an abortion on a child in Malta if her life is threatened, regardless of purported ethical loopholes such as ‘double-effect’... as well as causing unimaginable pressure on a child’s body, mind and life development, underage pregnancy is very often the product of rape. \n“It is reassuring to note that the UN is in agreement with Doctors for Choice and we hope that our local decision-makers treat this issue seriously and enact swift changes that will safeguard Malta’s children,” Dr Clayman said.\nA number of NGOs joined forces in March to form the first Maltese pro-choice coalition, Voice for Choice, that is campaigning for the decriminalisation of abortion and advocating for laws ensuring that the health of pregnant people is protected in line with international human rights standards through proper abortion care.\nVoice for Choice is made up of the Women’s Rights Foundation, Men Against Violence, Moviment Graffitti, the Malta Humanist Association, Integra Foundation, Aditus foundation and individual co-founders Francesca Fenech Conti, Jelena Bezzina and Liza Caruana-Finkel.", "comment_count": 42, "id": 2392}, {"keywords": "Health", "author": "Claire Caruana", "article_body": "There are only nine social workers assigned to assist residents at St Vincent De Paul Residence and Mount Carmel Hospital, it has emerged.\nInformation tabled in Parliament this week shows there are just five social workers at the mental health hospital in Attard and four at the Luqa old people’s home, which has more than 1,000 residents. The data was supplied by Family and Social Solidarity Minister Michael Falzon in reply to a parliamentary question tabled by independent MP Hermann Schiavone.\nIn a breakdown outlining where the 246 social workers engaged by the government’s Foundation for Social Welfare Services are stationed, it emerged that among the lowest numbers could be found at Mount Carmel Hospital and the St Vincent de Paul home.\nSir Anthony Mamo Oncology Centre has eight social workers while 14 work on cases involving domestic violence. Thirteen social workers are assigned to Mater Dei Hospital and 10 form part of the Drugs Community Team. Others are assigned to community services in various localities.\nDr Falzon said the social workers at the home for the elderly carried out various jobs. \nThese included work with residents deemed as having “social problems” and providing assistance with regard to pensions and any other pending payments. \nThey also provide “guardianship” by helping residents with any legal issues, allegations of abuse, relationship problems with relatives or other residents, substance abuse, funds management and relocation issues.\nThe social workers also carried out an initial assessment of every new inmate entering the home and assisted those being provided respite. \nIn addition, they supplied information sought by residents and relatives and ran awareness campaigns.\nThe minister did not refer to the functions of the social workers at Mount Carmel.\nQuestions sent to the government on whether the numbers reflected the requirements of the two entities and if there was need for more personnel remained answered by the time of writing.", "comment_count": 1, "id": 2393}, {"keywords": "Accident, Construction", "author": "Denise Grech ", "article_body": "Thea Walker’s family has been moved by the support they have received from the public after the young girl lost her Holy Communion dress following a building collapse in Guardamangia.\nThe seven-year-old girl was one of the two children who had to evacuate their homes as the wall of the building they were living in collapsed. \nFollowing the incident, the seven-year-old girl’s aunt told reporters her Holy Communion dress was inside the building, which was still unsafe to enter.\nBut Janet Walker said she had been moved by the dozens of messages she received offering her niece another Holy Communion dress for the ceremony on Sunday.\n\"We are very grateful,\" she said. \"It is in these moments you really realise how much the Maltese help each other\".\n\"People messaged on Facebook and a few shops offered my niece a Holy Communion dress as well,\" she said.\nThe family is staying at a hotel until alternative accommodation is provided. The local council has come forward to help, although mayor Kevin Tanti has said the situation was \"still very fluid\". \nAlthough Ms Walker was still angry at authorities and the contractor, she said she was moved by how many people came forward and offered to help.\nYoung Thea with her Aunt Janet. Photo: Facebook\n“Everyone is worried it will be their turn tomorrow, since the whole country is under construction,” she said. \"People are coming forward to help because they are worried they will be next,\" she added.\nThe family was earlier on Thursday trapped outside their house with nothing but the clothes on their back. They could not even buy food to eat since they ran out of the house with no cash, and were stranded outside in the sweltering heat.\nThe young girl went to stay at a friend’s house until accommodation was sorted, and in spite of her shock, she tried to lighten the situation by joking with her mum.\n\"We had gone on holiday recently, so she quickly told her mum: this is no problem, we’ll just go on holiday again until the place is fixed up,\" Ms Walker said.", "comment_count": 31, "id": 2394}, {"keywords": "Culture, Health, Police", "author": "Sarah Carabott", "article_body": "Four out of every five people who died by suicide jumping off bastions did so in the morning, suggesting the need for police patrols at that time of day, a conference was told on Thursday.\nSenior Inspector Melvyn Camilleri believes that data could help officers prevent suicide.\nAmong others, statistics show that between 2003 and 2017, some 16 people had jumped off bastions, 13 of whom died between 5.45am and 9am.\nHe suggested the deployment of more police officers patrolling such areas during these hours.\nInsp. Camilleri was addressing a conference on suicide prevention and self-harm behaviour organised by the Maltese Association of Psychiatry.\nHe urged officers to assist their colleagues within the force and do away with the current culture of self-sustainability, referring people at risk to other professionals for support.\nIn his address, he said that while fighting crime helped prevent suicide, officers could take a more leading role. The police came in touch with thousands of people on a daily basis at stations across the island.\nOfficers needed to be trained to recognise patterns and warning signs that indicated suicide risk or other emotional problems, and ensure that those at risk were referred to the necessary services, he said.\nHis call on mental health professionals to seek support was reiterated by Mental Health Commissioner John Cachia.\nDr Cachia also warned professionals that they were not immune to stress, especially considering their exposure to an environment where they had to care for other people.\nHe also recounted how the stigma surrounding a woman who was being treated at Mount Carmel Hospital drove her young nephew to suicide.\n“A woman told a radio live audience that her son, who committed suicide a year ago, was the life and soul of his group of friends, but quite a loner at home, allowing no one to step into his bedroom.\"\nRELATED STORIESHigh number of suicide attempts among migrantsSuicide rate much higher among men than women\n“The caller said that her son died by suicide because an aunt, a patient at Mount Carmel, was spoken about by those who knew her in a deriding manner. This behaviour discouraged the young man from seeking support.”\nDr Cachia urged mental health professionals to look beyond data and reflect on stigma.\nWe need to break the silence, he reiterated, referring to “pleas” from young people to speak about suicide.\nWe are treating people, not psychiatric conditions, and each one of us plays a role in ending stigma and changing societal approaches to suicide, he said.\nThe Commissioner also called on young professionals to look into studies about suicide contemplations and attempts across acute admissions and analyse further links to depression, bipolar and anxiety disorders.\n\n\n\n\nSuicide in numbers between 2003 and 2017 \n313 men; 46 women\n57 were non-Maltese, including 5 seaman passing through territorial waters\nThe youngest person to die by suicide was 14 and the oldest 98\nAugust is the most common month for death by suicide\n\n\n\n\nThe aftermath of suicide\nSuicide is a solitary act that impacts at least six other people, with the victim’s feelings and emotions ending up being transferred to the survivors.\nEmma Micallef-Konewko noted that suicide left relatives and close friends with a lot of unanswered questions and a sense of emptiness.\nSome families tended to create myths and keep secrets around the way their family member died to avoid stigma, pain, responsibility or guilt, she added.\nSurvivors tended to show higher feelings of blame, guilt and responsibility than other mourners. It also left them with a sense of unfinished business, as they could believe that they were responsible for the death.\nShe warned that if surviving family members felt guilty and responsible, they might feel undeserving of support, so they were discouraged from reaching out.\nFinding meaning was often crucial in terms of recovery and making sense of the events. However, this could also be a never ending process since there was no one to answer questions.\nShe suggested that professionals working with suicide survivors should not be afraid to ask the survivors how they were coping and to have difficult conversations with the family - similar to a “psychological autopsy”.\n\"We all have skills, but the most important thing is not to forget to be human,\" she added.", "comment_count": 5, "id": 2395}, {"keywords": "Court, Justice, Crime", "author": "Edwina Brincat", "article_body": "Two witnesses claimed there had been numerous attempts to make them change their mind about testifying in the case of alleged drug kingpin Jordan Azzopardi, as more alarming claims were made on Thursday.\nA vivid picture of Mr Azzopardi's former lifestyle was painted by two witnesses as they testified.\nThey took the witness stand in the compilation of evidence against Mr Azzopardi and a mother-of-five currently facing drug-related and fake currency charges since their arrest in March.Jason Zammit, currently serving time behind bars, took the witness stand under the watchful gaze of Mr Azzopardi, seated at the dock alongside the unnamed mother and co-accused also undergoing compilation proceedings.\nMr Zammit, a self-confessed drug addict, recalled one episode when he had allegedly suffered a fit while visiting the drug lord’s Birkirkara garage and yet none of the 10 persons or so present at the time had dared call an ambulance after the boss himself had forbidden them to do so.\nRELATED STORIESSeries of thefts linked to drug kingpin, court hearsSuspected footsoldier of alleged drug kingpin taken to court\n“I was unconscious at the time,” the witness explained, “but when I regained my senses I saw Jordan, calmly sitting on a footstool, working at his bills. As though nothing was out of the ordinary.”\nRegaining his composure after a brief pause, visibly overtaken by emotion, the witness went on to describe how on that occasion, someone had slipped a spoon into his mouth to prevent suffocation during the fit.\nIt was one of the 15 or so times that the witness visited the Birkirkara garage, a large place with seating cushions where addicts could go to buy their drug dose, monitored by cameras, with lots of metal fixtures and a pellet of stone blocks always ready at hand “in case the need arose”.\n“It was like a lotto booth,” the man said, explaining that the inner end of the premises were closed off behind a metal grate in such manner that “the customer could not speak to the person on the other side”.\nRELATED STORIESAcid tanks, white powder and fake €100 notes: court hears of drug trafficking operationCocaine-hooked chef recalls beating by Jordan Azzopardi and his henchmen\n“He employed people at a wage,” the witness went on, saying that there was a worker at the door and another at the inner quarters.\nMr Zammit had first met Mr Azzopardi some two years ago at Mosta and had been enticed to work for the man by an offer to get 20 grams of drugs on loan.\nThat was how he got hooked, as the dose sometimes went up to 50 grams and even 100 grams at times.\n“Did you fear testifying today?” prosecuting Inspector Mark Anthony Mercieca asked. “Not at all,” came the sharp reply.\nYet the witness explained that he had been approached by several inmates recently, all telling him to change his testimony.\n“Many came to me. He kept insisting,” said Mr Zammit, referring to Mr Azzopardi. “I just ignore them.”\nAs the first witness walked out under escort, his place was taken by Luke Vella, a young man and former customer of Mr Azzopardi, who claimed that the drug lord owed him money.\nMr Vella had rented the Pietà premises to set up a ‘BnB’, the court was told.\nHowever, while serving time behind bars, Mr Azzopardi had allegedly taken over the premises, converting them into one of his drug stores.\nVisibly agitated witness claims threats \nOnce regaining his personal freedom, Mr Vella had squarely asked the drug lord for €10,000 to repair the place that had been targeted in one of the police raids.\n“I’ll give you €20,000,” Mr Azzopardi had allegedly replied. None of that money had ever been pocketed by Mr Vella who, however, claimed he had recently been bombarded by calls from a third party offering €10,000 and a further €10,000 after Thursday’s court hearing.\n“I'm speaking out because I've had enough. They've been threatening me even up until last week,” said the man, visibly agitated.\nDuring one such call, he claimed to have been addressed by the woman seated at the dock, prompting some shaking of the head by the subject of his allegation.\nThe witness recalled how he would visit the drug havens, let in by security, to get his dose of cannabis.\n“It was like a postal office. They catered for everyone’s needs. There was pop, smack, cannabis… You asked for it and you would be served.”\nThe man had also been asked by the drug kingpin himself to find a buyer for his rifle, a small machine gun and an AK 47, the witness claimed.\nReferring to one of Jordan’s workers, a man “who ended up a junkie and endured several beatings” at the hands of his boss, the witness recalled how he would often come across this man, locked up inside a room “like an animal” at one of the kingpin's premises.\nHe also claimed that the drug lord earned a quarter of a million euros per month and would drive to his havens in a white Range Rover worth some €125,000. Upon his arrival, drug supplies would be replenished.\nAs the sitting came to a close, Inspector Mercieca informed the court, presided over by magistrate Doreen Clarke, that in view of the revelations made on Thursday, the female co-accused was to be re-arrested immediately and investigations into the fresh allegations in her regard were to be undertaken.\nAs Mr Azzopardi was escorted out of the room under tight security, his partner at the dock expressed shock and disbelief upon realising she was about to forfeit her personal freedom once again.\nAs an officer and other armed securities watched over her, the woman attempted to use her mobile phone. However, the inspector would have none of it.\n“You’re under arrest now!” came the stern warning, as he swiftly removed the gadget from the woman’s hands.\nThe case continues.\nLawyers Alfred Abela and Rene Darmanin were counsel to the accused.", "comment_count": 0, "id": 2396}, {"keywords": "Construction, Accident", "author": "", "article_body": "A 23-year-old man has been hospitalised after yet another construction site accident.\nThe man, from Mali, fell a height of four storeys - the latest in a string of similar falls over the past weeks.\nThe occupational accidents have been interspersed with alarming collapses of buildings and walls, the most recent on Thursday morning in Ħamrun.\nPolice said that the accident on Thursday afternoon occurred in Triq Annetto Caruana in Qawra and that the worker's condition was serious.", "comment_count": 0, "id": 2397}, {"keywords": "Daphne Caruana Galizia, Crime, European Union, Politics", "author": "", "article_body": "A number of organisations urged the leaders meeting in Malta to address “the ongoing impunity” in the case of assassinated journalist Daphne Caruana Galizia.\nIn a letter to the presidents of France and Cyprus and the prime ministers of Italy, Greece, Portugal and Spain, they noted that there was no process inquiring into the circumstances of the murder.\nThey noted that, so far, the Maltese government has blocked a public inquiry, leaving journalists continuing to work in Malta at great risk and forcing Ms Caruana Galizia’s family to take legal action against the Prime Minister’s refusal to hold a public inquiry into the assassination.\n“Only a public inquiry can determine how best to guarantee the safety of journalists and prevent future attacks,” they said. They noted that the Venice Commission Opinion on Malta stated Malta’s positive obligations in relation to the assassination.\nA public inquiry was the only process that could effectively address these positive obligations.\nThe call for a public inquiry was supported by a resolution by the European Parliament which requested the Maltese government to launch such an inquiry, and called on the EU institutions and member states to initiate an independent international public inquiry into the murder and the alleged cases of corruption, financial crimes, money laundering, fraud and tax evasion reported by the journalist, they said.\nThe letter was signed by the European Centre for Press and Media Freedom, Article 19, Ifex, the Index on Censorship, the International Press Institute, Pen International, and Reporters Without Borders.", "comment_count": 12, "id": 2398}, {"keywords": "European Union, Politics", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat will be hosting a two-hour mini-summit meeting at Castille on Friday, aimed at regrouping leaders of southern member states in preparation for talks in Brussels next week.\nSenior government sources told Times of Malta that although the meeting would discuss the ‘usual’ topics, including migration, Dr Muscat was expected to use the occasion as part of his personal lobbying efforts for one of the EU’s top jobs, a topic that would be discussed in Brussels the following week.\nDespite being coy when asked about his political future, it is an open secret Dr Muscat has been eyeing one of the top EU posts.\n“This informal mini-summit in Malta will coincide with the time when leaders will be making their minds on who should get what in the EU institutions,” a senior diplomat told Times of Malta.\nThe leaders of France, Italy, Spain, Portugal, Greece and Cyprus are expected to attend the Malta meeting. \nGovernment sources said Dr Muscat was hoping the southern European states would agree to work together to take a unified stand on who should take the top posts in the EU institutions.\nDr Muscat has publicly declared he did not intend to contest the next general election but has lately been evasive when asked about his next moves in his career.\nAccording to the government sources, Dr Muscat is particularly interested in the job of High Representative, practically the EU’s Foreign Minister. \nHowever, sources in both Brussels and diplomatic circles say his name is not among those being mentioned for this or other positions up for grabs.\nMuscat hopes southern European states would agree to work together\nThe unexpected good performance by the Spanish Socialists at the last European elections could negatively affect Dr Muscat’s ambitions. EU diplomats argue that now that the Spanish Socialists have become the largest delegation on the Socialist Group in Brussels, the government in Madrid stood a better chance of winning the Socialist nomination for one of the EU’s top posts.\nSpain, the diplomatic sources indicate, is pushing Foreign Minister Josep Borrell for the post of High Representative.\nThe Socialists are unlikely to get more than one of the five positions open for nominations, which also include the president of the European Commission, the president of the EU Council and the president of the European Parliament.\nThe European People’s Party, the largest political force in the European Parliament, the Liberals and the Greens are also lobbying hard for one or more of those positions.\nUnlike 2013, when Malta was among the first EU members states to nominate its candidate for the post of European commissioner – former tourism minister Karmenu Vella – this time round the government is taking its time.\nAccording to Maltese diplomatic sources, Dr Muscat could be delaying the nomination as he might ultimately decide to take up the post himself if he does not manage to secure any of the top jobs.\nAlthough the Office of the Prime Minister would not say whether Dr Muscat is eyeing the post of EU High Representative, a spokesman said he was not interested in nominating himself for the post of commissioner.", "comment_count": 34, "id": 2399}, {"keywords": "Health, Human rights, Attard", "author": "Sarah Carabott", "article_body": "Mental health services have no place at the “Victorian” Mount Carmel Hospital, according to the psychiatrists’ association, which said the place had been unfit to provide treatment for several years.\nThe Maltese Association of Psychiatry (MAP) was reacting to comments made by the chairman of Mental Health Services Anton Grech to the State broadcaster.\nMount Carmel was not adequate for modern treatment and parts of it were condemned, Dr Grech noted, adding however that no patient was in danger.\nThe comments came in the wake of shocking testimony given to a parliamentary committee last week by former chief operating officer Paul Dalli, who spoke about patients showering next to each other in the nude and in freezing cold water in wintertime, while avoiding dangerously cracked tiles.\nThe hospital, he said, had been left to rot into disrepair, a state of affairs that has, in fact, long been flagged up by the Mental Health Commissioner.\nThe association has said it supports plans to phase out the “unsafe and dilapidated” hospital and to develop a new acute psychia­tric facility. It said the new provision should be located within or connected to Mater Dei Hospital.\nThere should be a plan to shift the in-patient budget towards adequately staffed community mental health services providing evidence-based mental health interventions.\nThe new provision should be located within or connected to Mater Dei\nWith the development of a new psychiatry hospital and community services, it was no longer appropriate to provide psychiatric ser­vices from Mount Carmel, the association said. Otherwise there would be a two-tiered mental health service that would undermine efforts to bust myths about mental disorders. The stigma associated with Mount Carmel was insurmountable, it said.\n“MAP believes that Mount Carmel Hospital is a beautiful 1860s Victorian building which authorities could repurpose and be used for alternative arrangements, however one which has no connection to mental health services.”\nIn his 2014 report, Mental Health Commissioner John Cachia had said that Mount Carmel and the Gozo mental health wards needed extensive investment for proper refurbishment. Some wards had leaking roofs and damp walls and some bathrooms needed urgent upgrading.\nRELATED STORIESCommissioner Cachia's 2015 calls to move on from Mt CarmelWatch: Dangerous ceiling in most Mt Carmel wards\nIn 2017, he noted that corrective action at Mount Carmel was long overdue, after architects declared several wards to be unsafe for patients and staff.\nContacted yesterday, Dr Cachia said his office had continued to follow up issues linked to the physical environment of mental health institutions.\nThe most recent detailed assessment was carried out in November and December of 2018. The findings are still being evaluated.\n“Throughout the early months of this year we made several representations with Mount Carmel Hospital management urging them to address identified shortcomings without undue delay in the best interest of patient and staff safety and welfare,” Dr Cachia said.\nIn mid-May, during a meeting with the entire top management of Mount Carmel, Dr Cachia and his team were given details of the updated refurbishment work plan with milestones expected to be reached in 2019.\nIn the interest of patient rights, his office would be regularly monitoring the implementation of this work plan, he added.\nOn Tuesday, mental health organisation Richmond Foundation demanded the closure of Mount Carmel Hospital \"for all psychiatric conditions\".\nIn a statement it said the hospital was \"unfit to treat patients\" and has been in such a state for several years.\n\"Having consulted numerous clients of the Foundation we have the certainty to say that even though the care in the hospital may be good, the building is not conducive to recovery.\"", "comment_count": 2, "id": 2400}, {"keywords": "Tourism, Economy, Adrian Delia", "author": "", "article_body": "The news that Ryanair would be reinforcing its presence in Malta by setting up Malta Air has been welcomed by the Malta Hotels and Restaurants Association (MHRA), which said this was in line with its call for more connectivity.\nThe move would result in an increased fleet being based in Malta, more aircraft on the aviation register, and the servicing of aircraft, boosting the aviation industry, and staff relocated and resident in Malta, it said.\nPraising the initiative taken by Tourism Minister Konrad Mizzi, the MHRA pointed out that it has over the years consistently asserted that connectivity was “key for the tourism sector in Malta”.\n“Therefore this is certainly moving Malta in the right direction,” it said.\nIn the meantime, the MHRA also welcomed the Prime Minister’s assertion that this initiative would not clash with the operations of Malta's national airline Air Malta.\n“Air Malta remains pivotal for our islands and It’s important that it continues to be competitive and the main airline of the Maltese islands,” MHRA president Tony Zahra said.", "comment_count": 5, "id": 2401}, {"keywords": "Construction, Joseph Muscat", "author": "Denise Grech ", "article_body": "Updated 6.40pm\nThe prime minister announced plans for the quick introduction of new regulations on excavation and construction practices shortly after announcing he was suspending demolition works, amid widespread anger at the construction industry.\nSpeaking following a meeting with representatives of the construction industry, he said all permits for demolition and excavation have been suspended and no works will be allowed until the new regulations come into force in a few weeks.\nHis announcement came hours after an apartment wall collapsed into a building site in Ħamrun, the second such incident in a week and the third in two months.\nThe meeting with the construction sector had been arranged in the wake of the collapse, last Saturday, of a three-storey apartment block in Mellieħa.\nAnother apartment block adjacent to a building site collapsed in Guardamangia in April. \nWorks continue\nBut in spite of the suspension, Times of Malta received complaints of ongoing works from all over the island\nThe police said when contacted the Building Regulations Office (BRO) had not set any mechanisms in place so the police took over the task until Friday.\nThe police were, however, also short on manpower, since they had not had time to prepare to handle the suspension.\n\nDr Muscat explained that a reform would need to be put into effect before the suspension is lifted.\nHe said that on Monday, the government will be publishing draft regulations for public consultation. The consultation period will only last five days, and the authorities will continue to hold meetings to receive feedback.\nThe proposals will then be moved to parliament for approval in the following week.\nThe aim of the talks, Dr Muscat said, was for difficult decisions to be taken after  the arguments on all sides of the table were understood.\nMore obligations on architects, site managers\nThe proposed regulations will include an obligation for architects and site managers to be on site when crucial decisions are taken and when certain excavation works are done.\nGeological and geo-technical surveys are currently only done when digging exceeds three metres. The new proposal is for these surveys to be done for all excavation works.\nSuch studies need to be signed by the architect so that responsibility can be shouldered, Dr Muscat said.\nThose who continue carrying out works despite warnings will be fined €50,000, up from the current €2,000.\nA number of proposals will also be put forward to secure the walls of buildings overlooking construction sites.\nThose in breach of these regulations or found not to be abiding to the method statement were previously fined up to €500. Under the proposed regulations, they will be fined €10,000.\n\"This is a strong sign to anyone that breaking regulations will risk the development of your project,\" Dr Muscat insisted.\nNo authority can police all the country around the clock, he said, which meant architects and contractors needed to abide by the laws.\nArchitects during the meeting with the prime minister said the current suspension can endanger ongoing works. In those specific cases, architects have been asked to contact the Buildings Regulations Office and they will see to them on a case-by-case basis.\nWorks that will be allowed to continue will be the exception, not the rule, Dr Muscat insisted.  \nThe meeting, Dr Muscat said, had been productive with all stakeholders agreeing they needed to find a way forward quickly.\n ", "comment_count": 302, "id": 2402}, {"keywords": "Crime", "author": "Edwina Brincat", "article_body": "A Maltese man wanted by police investigators in Italy was freed from arrest on Thursday after a court dismissed an application for his extradition.\nThe Magistrates’ Court found that documentation presented by the Italian authorities for his arrest was defective.\nPaul Attard, a shipper, had been wanted in Italy for prosecution over his alleged involvement in illicit trafficking activities. He was arrested on the strength of a  European Arrest Warrant issued by the Giudice per gli Indagini Preliminari on May 2, 2019.\nMr Attard's defence counsel argued in court that the European Arrest Warrant  did not conform to the formalities laid down by an EU Council Framework Decision of 2002.\nMagistrate Donatella Frendo Dimech observed that the Italian authorities had departed not only from EU law but also from the relative national legislation.\nMr Attard had been right to complain about the light-handed manner whereby the Italians had made their request to the Maltese state, the magistrate remarked, observing further that there had been discrepancies in data concerning the place where the alleged criminal activity took place.\nWhereas the relative Schengen Information System Alert targeting Mr Attard had referred to “Catania and international waters,” the EAW indicated “various states, including Malta, Algeria and Egypt,” as the places of the alleged offence.\nMoreover, the EAW had also wrongly cited provisions relating to homicide, the court observed, expressing doubt as to whether this had actually been “Depozitato in Cancelleria”(filed in the Italian Court).\nThe corrected version had simply replaced the page containing the wrong articles of law, whilst retaining the original date and official stamp of the warrant as originally filed on May 3, the court went on.\nFaced with such defective documentation, in spite of the fact that the Italian authorities had twice been asked to rectify the situation, the court concluded that it could take no further cognizance of the extradition request, thereby ordering Mr Attard’s immediate release from custody.", "comment_count": 8, "id": 2403}, {"keywords": "Environment, Waste", "author": "Ivan Martin", "article_body": "Plastic waste in Malta increased by nearly a third over the past decade, making the island one of Europe’s worst performers when it came to curbing plastic use, a new report has found.\nPublished by the European Environment Agency earlier this month, the 10-year (2007-2017) review of plastic waste management puts Malta in fifth from bottom when it comes to reducing the amount of plastic waste being generated. Only the Eastern European states of Slovakia, Estonia and Poland, along with Hungary, fared worse in the list.\nThe EU average increase in plastic waste was just six per cent.\nMalta has experienced significant economic growth during the period reviewed in this study, however, its plastic waste efforts have not been as vigorous.\nThe government last month announced plans for a ban on single use plastics, the end of free plastic bags at shops and restrictions on other non-biodegradable products as among the green measures planned to be implemented in the next few years.\nThe reform, which is currently open for public consultation, largely follows an EU-wide policy adopted last year.\nMeanwhile, the EAA report says that demand for plastics is in-creasing rapidly worldwide. \nIn 2017, the demand for plastics in the 28 EU member states stood at almost 52 million tonnes, up from 46 million tonnes in 2010. Global production of plastics reached 348 million tonnes in 2017, an extra 13 million tonnes compared with the year before.\nThe use of plastic in products, the report says, keeps increasing because of its low price and the useful properties of the various plastic types, which make them effective in a wide variety of applications.\nUse of plastic in products keeps increasing\nPackaging is the sector identified as using most of the plastic produced, followed by the construction, automotive and electronics sectors.\nAlmost one fifth of the global plastics production came from Europe.\nIn 2016, a third of plastic waste was recovered in Europe – but only 63 per cent of that recovery actually took place in Europe – and only about six per cent of the current European demand for plastics was covered by domestic recycled or secondary plastics, meaning almost all the plastic on the EU market is freshly produced.\nMalta was a late adopter of recycling, with efforts to enforce it only having really picked up in recent years.\nFigures released by the National Statistics Office show that in 2016, a total of 8,714 tonnes of plastic waste were generated, of which 7,915 tonnes were recovered and treated.\nHowever, rewind to just a few years earlier and the figure shrinks to just a fraction.\nData from 2007 to 2017 for the 28 EU member states shows a recent relative decoupling of plastic packaging waste generation from economic growth. However, the EAA says there are big differences in the development of plastic packaging waste generation per capita in the individual countries over the same time period.\nOf the 28 EU member states, nine managed to decouple plastic packaging waste generation from economic growth.\nThe economic level, structure and development of the countries plays an important role in the level of waste generation, making it difficult to attribute changes in waste quantities to waste prevention measures alone.", "comment_count": 14, "id": 2404}, {"keywords": "Construction, Joseph Muscat, Accident", "author": "Denise Grech ", "article_body": "Updated 11.19am \nOne of the residents of an apartment block whose wall collapsed into a building site on Thursday morning spoke of her frustration about how those responsible for the site and the authorities had done nothing about her repeated warnings.\nJanet Walker, 44, spoke of the uncertain future her family now faces, unable to get into their house, not even to fetch a holy communion dress needed for Sunday.\nA total of 14 adults and two children were evacuated from three apartments after the collapse, the second such incident in a week.\nVideo - Chris Sant Fournier\n\nSandro Chetcuti, president of the Malta Developers' Association was on site on Thursday and reiterated his association's call for action. (See below)\nHe said new regulations should ensure that prior to works, investigations are carried out on the structural stability of existing buildings.\n\nMayor: All those living next to construction sites ‘worried they will be next’\nMayor Keith Tanti said he had received multiple complaints from residents and had forwarded reports on the site to the Building Regulations Office months ago.\n“They had told us they were following the matter,” he said.\n\nAsked whether he still had trust in the BRO, Mr Tanti said the entity had limited resources. \nMr Tanti said it was clear people were worried: “Everyone who knows the site next to him will be torn down is worried they are going to be next.\"\nThe mayor was on site following the collapse to help residents find alternative accommodation. \n“We are here to see that residents have all the basic necessities- what to eat, what to drink, and shelter from the heat,” Mr Tanti said.\nAsked whether alternative accommodation would be provided, Mr Tanti said the situation was fluid but that arrangements were being made.\nThe video below was recorded and uploaded to Facebook last month.\n ", "comment_count": 132, "id": 2405}, {"keywords": "Accident, Construction", "author": "", "article_body": "Updated 11.30am\nFamilies living in a block of apartments in Mimosa Street, Ħamrun, were evacuated on Thursday morning after a wall adjacent to a building site collapsed.\nThe incident happened shortly before 8am. The five apartments housed 14 adults and two children.\nSome of them could be seen with tears in their eyes as they surveyed the damage, evidently shocked by the fracas and their sudden evacuation. One said her daughter's holy communion is due on Sunday and she worried she could not get to the dress inside. \nOthers angrily protested that they had expressed concerns that this would happen, but been assured that the wall was safe (See video below). The residents said they had even engaged a private architect who had also warned them of danger.\nResident Janet Walker, 44, said she had filed multiple reports about the dangers of the construction next door. \nThe architect involved said works have been ongoing for two months and proper procedures had been followed. \n\nNo one was injured. The adjacent construction project plans the construction of a basement garage, two shops at ground level, 15 overlying apartments and two penthouses.\nMalta Developers' Association president Sandro Chetcuti was seen on site shortly after the incident.\nThe association in a statement later said it was shocked by what had happened.\n\"It is obvious that excavation works are being undertaken on sites without thorough investigations on the structural situation of party walls that are adjacent to proposed works and that the structural stability of such party walls cannot be taken for granted,\" it said. \nIt said something must be urgently done about this issue.\n\"In the light of such incidents, MDA will support any action taken by government on excavation works adjacent to existing buildings in order to safeguard public safety.\n\"The authorities should urgently appoint a steering committee to draw up regulations in the case of all sites where buildings with party walls are to be demolished and replaced. These regulations will make mandatory the investigations required on the structural stability of existing buildings and the drawing up of method statements on how they will be safeguarded,\" the MDA said.  \nThe incident comes less than a week after a three-storey block adjacent to a construction site collapsed in Mellieħa, slightly injuring a woman who was trapped in the rubble.\nAnd another Guardamanġa building collapsed last month, in an incident which shocked neighbourhood residents but resulted in no injuries.\nThe prime minister is due to hold a previously-arranged meeting with representatives of the construction industry later on Thursday.\nImmediate action to define responsibilities - PS\nParliamentary Secretary Chris Agius told the Times of Malta that solving the piecemeal approach to regulation of the industry was the key, stressing that steps were already under way to set up the Malta Building and Construction Authority, with the relevant studies being put together by architect Robert Musumeci.\nMr Agius said the authority would be up and running \"not later than year end\".\nHe said, however, that there was no time to waste and that as an immediate measure, responsibilities for projects had to be clearly defined.\n\"The law already makes it very clear who is responsible for what, but it is obviously not enough,\" he said, adding that the momentum of the sector had put pressure on the regulators.\n\"It is all a matter of resources. What the Building Regulation Office had to deal with three years ago is not what it is facing now, with the number of projects going up so dramatically.\" \nRELATED STORIESCollapse of yet another building 'totally unacceptable' - Malta Chamber\n ", "comment_count": 167, "id": 2406}, {"keywords": "Adrian Delia, Politics", "author": "", "article_body": "Anonymous posters were pasted on the facades of various Nationalist Party clubs overnight saying: 'We need a leader who does not embarrass us'.\nThey were an obvious reference to PN leader Adrian Delia, who is facing increasing pressure to resign.\nIn the wake of the European Parliament elections, notices had also been fixed to PN clubs saying: 'We deserve better'.\nWednesday's posters, printed under the old masthead of the PN newspaper, showed up on clubs as far apart as Safi, Birkirkara, Gzira, Zebbuġ and Zurrieq.", "comment_count": 57, "id": 2407}, {"keywords": "Government, Politics", "author": "Ivan Camilleri", "article_body": "The government resorted to rarely-used extraordinary public procurement rules to allocate a €1.5-million contract to a company in connection with a mini-EU summit on Friday.\nDespite knowing, at least since January, that Prime Minister Joseph Muscat would host six of his counterparts from Southern EU member states for an hour-and-a-half meeting at his office tomorrow, the tender for the necessary services was only issued in the beginning of May under the so-called “accelerated procedure”.\nThe rules, which according to law are only to be used in “a state of urgency”, allow the authorities to narrow the timeframe allowed for the submission of a tender to just 15 working days rather than the normal 35 days.\nThe Times of Malta was told that, as a result of the “accelerated procedure”, only one company submitted an offer and was eventually awarded the contract by the Office of the Prime Minister.\nThe company is TEC Ltd, which supplies the Labour Party with most of the equipment, including massive tents, for public activities during the electoral campaigns, including the most recent elections.\nTEC Ltd is owned by Carmel Magro, a former General Workers’ Union employee, who was given dozens of government direct orders since Labour was returned to power in 2013, particularly by the Office of the Prime Minister. \nIndustry sources said “no one even bothered to submit an offer” for the mini-summit, except for TEC Ltd.\nSeemed to be written for a particular company\n“It was also obvious from day one that the specifications of the tender seemed to be written for a particular company,” the owner of a large events company told this newspaper.\nQuestions to the Office of the Prime Minister on why the government employed the “accelerated procedure” remained unanswered by the time of writing.\nUnlike previous tenders issued on similar occasions, including events during Malta’s EU presidency and the organisation of the Commonwealth summit, this time round, Castille also decided to issue just one tender on a turnkey basis. \nThus, the company, which specialises in tents, was also engaged to organise all the aspects of the summit, including transport, public relations and accreditation facilities for journalists, security personnel, scriptwriting for documentaries and even the catering for the event, the sources said.\nThe mini-summit, in which the leaders of Malta, Cyprus, France, Greece, Italy, Spain and Portugal will be participating, aims at coordinating common positions for the crucial EU summit to be held in Brussels next week.\nSenior diplomats told this newspaper the summit was “the best lobbying opportunity” for the Prime Minister to try to persuade his colleagues to propose his nomination for one of the EU’s top jobs.\nivan.camilleri@timesofmalta.com", "comment_count": 38, "id": 2408}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta reports that there are just nine social workers to assist residents at St Vincent De Paul Residence and Mount Carmel Hospital.\nThe Malta Independent says the former dean of the Faculty of Laws has blasted the State Advocate Bill currently before parliament. He said it is a parody of the Venice Commission recommendations, repeating criticism made in Times of Malta on May 5.\nIn-Nazzjon says the government is ignoring plans for an all-encompassing Constitutional Convention and instead moving separate amendments to the constitution.\nl-orizzont reports on a strategic plan for equality in parliament, referring to gender equality. It also says that former workers of De La Rue's Identity Solutions subsidiary will enjoy the same working conditions when they are moved to HIV Global, which is taking over. ", "comment_count": 0, "id": 2409}, {"keywords": "Court, Crime, Politics", "author": "Philip Leone Ganado", "article_body": "Opposition leader Adrian Delia took up legal criticism of the bill splitting the dual role of the Attorney General as public prosecutor and lawyer to the government, insisting the changes would weaken the rule of law.\nThe government’s bill is intended to address criticism by the Venice Commission, but speaking in Parliament, Dr Delia highlighted and quoted extensively from law professor Kevin Aquilina’s recent criticism that the proposed law failed to live up to the commission's recommendations.\nProf. Aquilina, former dean of the University of Malta faculty of laws, slammed the proposed law in an article as “half-baked and ill-conceived, and has been drafted hastily, shabbily, superficially, and without enough thought and research put into it”.\nThe Opposition has already said it will be voting against the bill, primarily over its failure to adopt a proposal for the Attorney General to be appointed by a two-thirds majority in Parliament.\nSpeaking during the bill’s second reading on Wednesday, Dr Delia highlighted several other criticisms levelled at the bill, including that the Attorney General will still be appointed by the Prime Minister, whose already wide powers of appointment were highlighted by the Venice Commission, and that the Attorney General would continue to hold several other posts that had been flagged as creating potential conflicts of interest.\nDr Delia also noted that decisions on undertaking criminal proceedings will not be subject to judicial review, and that a proposed merger of prosecuting police with the Attorney General’s prosecuting office had not been taken up.\n“This law will strengthen the Prime Minister's powers to pick his people and keep them in their posts, while ensuring that their decisions cannot be challenged,” he said.\nRather than strengthening the rule of law, Dr Delia added, the bill would weaken it further.\nProf. Aquilina’s criticism – in which he argued that the government was “deliberately acting in bad faith” - followed similar analysis by Council of Europe special rapporteur Pieter Omtzigt, who said the bill fall short of the changes proposed by the Venice Commission.\n‘Criticism is farcical and dishonest’ - Herrera \nEarlier, Environment Minister Jose Herrera turned his guns on the Venice Commission members, arguing that flaws in their home countries’ national systems meant their criticism rung hollow.\n“If we had the systems the Venice Commission members' countries had, they would call us a dictatorship,” Dr Herrera said, proceeding to list issues in each country he said were similar to the criticism levelled at Malta.\n“Their systems, by their own yardsticks, are flawed and should be investigated,” he said.\nDr Herrera added that the bill the government had put forward went above and beyond to create a better system, and said the Opposition were weakening the new post – and hence the rule of law – by not agreeing to entrench the changes in the Constitution.", "comment_count": 16, "id": 2410}, {"keywords": "Health, Parliament, Human rights", "author": "Denise Grech ", "article_body": "Wards at Mount Carmel hospital are in such a dire state that €1 million would not make a dent in fixing just one of them up, the hospital’s former head of finance said.\nSpeaking at a parliamentary committee on Wednesday, Sean Camilleri said a government study had found it would take millions to fix up just some of the wards within the hospital, which have exposed beams, cracked tiles and \"condemned\" ceilings.\n\"Every day I would have someone come up to me to say there is water coming into this ward, or there is an exposed beam in another,\" he said.\n\"It would take more than a million to even make a dent in fixing one up,\" he said.\n\"I mean properly fix it up, not just paint it over,\" he added.\nHowever, he said, he had no remit to fix the wards, since his role was to be the financial controller of the hospital.\nMultiple warnings\nMental health practitioners and stakeholders have long criticised the state of the mental health hospital. Last week, former Chief Operations Officer Paul Dalli said patients had been made to endure freezing cold showers because there was no hot water.\nEarlier on Wednesday, mental health organisation Richmond Foundation said the hospital should be shut down “for all psychiatric conditions”.\n\nAddressing members during a hearing discussing the Auditor General’s report on Mount Carmel, Mr Camilleri also confirmed reports that the hospital had lacking security and cracked tiles.\nThe Auditor General’s report found that Mount Carmel Hospital had issued a direct contract to employ 60 people for clerical work but ended up engaging 134 workers. Many of the workers ended up actually performing maintenance work and security duties, the Auditor General had found.\nDuring the hearing, Mr Camilleri said he had realised the number of engaged workers had risen in a short period of time. He flagged the matter to the Director General, who said he would follow the matter. \nMr Camilleri insisted he could not provide a specific reason for the increase in engaged workers around the 2017 election, since he was not involved in employing people.\nDuring the parliamentary hearing last week, the former COO had admitted some \"clerks\" engaged had been employed as \"ladder holders and helpers\".\nMr Camilleri said people were sometimes engaged to help with fixing up a tumolo-sized (1,100 square metre) ward. \"There are only two qualified electricians working in Mount Carmel, but they could hardly change the wires for the whole ward,\" he said.", "comment_count": 13, "id": 2411}, {"keywords": "Health, Parliament, Society", "author": "", "article_body": "Social benefit cheques alone will not solve social problems, the Dean of the Faculty of Social Wellbeing told Parliament on Wednesday. Speaking to MPs during a meeting of the Social Affairs Committee, academic Andrew Azzopardi urged lawmakers to look beyond throwing money at social problems, but address the root causes.\n“We need to stop thinking that cheques can cure people. They are important, we even need more [social benefits] in some cases, but alone they solve nothing,” he said.\nProf. Azzopardi later added that what could appear to be a solution addressing social problems, could in fact be masking over them and potentially making them worse.\nThe committee heard from the academic, along with his colleague Marilyn Clark, who went over the findings of a nationwide research project on loneliness. Times of Malta first reported on the project’s findings last month. The researchers told the committee members that two out of every five Maltese suffer from loneliness.Nationwide surveyA total of 1,009 people aged 11 and up, from all regions across the islands, were surveyed for the study, which flags both emotional and social loneliness.\nThe National Statistics Office was commissioned to collect the data and the researchers used internationally-recognised tools so that the survey would provide data that is comparable with that of other countries.\nThe sample size, Prof. Clark told the MPs, was large enough to be able to extrapolate the findings and translate them into terms of the entire population.\nFor instance, a staggering 46,000 people in Malta do not feel positive about their life.\nSome 186,000 Maltese, Prof Clark said, reported experiencing some for of loneliness. \nRELATED STORIESMore than one in three have suffered from loneliness\nShe said the research team planned to continue studying this issue, in the years to come, with a view to inform social policy and laws. To undertake a research project like this just once, she said, would be almost useless.\nThe researchers will also be meeting other stakeholders to go through their findings.\nThe researchers undertook the project after discovering that almost no empirical data existed on the phenomenon.\nBack in 2016, Times of Malta reported how a breakdown of the calls made to the 179 support line since 2006, showed how callers were 10 times more likely to call because they were lonely than for drug or alcohol abuse related problems.\nSome 10,300 people called the number after feeling unbearably lonely, meaning one in every 10 of the 110,000 calls received by those operating the support telephone lines was from a lonely person.", "comment_count": 15, "id": 2412}, {"keywords": "Politics, Government, Crime", "author": "", "article_body": "Three ministers who appeared to quote from the Egrant inquiry in court should exhibit copies of the document as part of proceedings, a civil society group is arguing.\nIn an urgent court application filed on Wednesday, lawyers for Repubblika asked magistrate Claire Stafrace Zammit to order Konrad Mizzi, Edward Scicluna and Chris Cardona to present copies of the document they had quoted from in earlier proceedings.\nThe ministers had cited extracts from what appeared to be the Egrant inquiry as part of their defence against Repubblika’s legal request for them to face criminal proceedings in connection with a deal privatising three state hospitals.\n“The ministers mentioned had the gall to quote from a document which the same duty Magistrate doesn’t have access to and want to make a mockery of her,” Repubblika argued in its application.\nOnly 55 pages of the Egrant inquiry’s 1,500 have been made public, with the body of the inquiry text remaining tightly under wraps.\nIn the application, lawyer Jason Azzopardi argued that a document referred to by a witness or party to a case had to either be in the public domain or at least be accessible to the other party and, more importantly, the court.\nRepubblika cited the constitutional judgement Mark Charles Stephens vs AG, which found that “The right to a fair hearing supposes compliance with the principle of equality of arms. This principle, which applies to civil as well as criminal proceedings requires each party to be given a reasonable opportunity to present his case under conditions that do not place him at a substantial disadvantage vis-à-vis his opponent.”\nThey called on the court to declare a breach of the equality of arms principle and order the respondents to exhibit “in its entirety” the document which they had quoted from.", "comment_count": 0, "id": 2413}, {"keywords": "Court, Crime, Police", "author": "Edwina Brincat", "article_body": "A former couple entangled in a 12-year court saga was on Wednesday acquitted of their alleged involvement in a drug-trafficking conspiracy. And the main witness underpinning the prosecution’s case is to be investigated for possibly lying under oath.\nIvan Bajada, 43, from Sliema and Clare Borg, 40, from Gżira, were cleared of involvement in a heroin trafficking conspiracy as well as with relapsing. The woman was separately charged with threatening a police officer.\nThe case stemmed from a tip-off to the police in September 2007, whereby the couple was searched upon their arrival from Turkey at Malta International Airport. The two had even been X-rayed, but no drugs were found in their possession.\nThe following month, a second tip-off had resulted in a raid on a Ħamrun residence, owned by Eusebio Busuttil, wherein officers from the Drug Squad had come across the owner, another man named Alan Brown as well as the two co-accused.\nThe raid had yielded some 200.56 grams of heroin, later certified by a court-appointed scientific expert as having a market value ranging roughly between €10,000 and €15,000.\nOther drug paraphernalia was discovered in the search, as well as a significant amount of cash inside the woman’s handbag.\nThat cash, however, was later said to have been earnings from Mr Bajada’s family business which his father had entrusted him to deposit at the bank, the origins of the money being confirmed under oath.\nIn the course of criminal proceedings against the couple, the owner of the Ħamrun residence had testified that he and Mr Brown had met the co-accused at Paceville and had proceeded to his home where the drugs were to be purchased.\nHowever, this version did not tally with that supplied by Mr Brown who denied buying drugs from Mr Bajada, insisting rather that he had simply asked the couple to help him tow his faulty car, after meeting them at Ħamrun.\nWhile at Mr Busuttil’s home, the latter had allegedly asked Mr Brown to momentarily step aside while he “had a word with Ivan”.\nThe co-accused had also testified, admitting that they were addicts but denying that they were traffickers.\nIn the light of all evidence put forward and after dismissing the accused’s statements which had not been released under legal assistance, the court, assigned the case in 2015, concluded that “save for that stated by Mr Busuttil, the records bore no further proof” to support the prosecution’s case.\nMagistrate Neville Camilleri pronounced an acquittal as it observed that the case had resulted in “mere conjectures and nothing based on concrete evidence”. It ordered the Police Commissioner to determine whether Mr Busuttil had lied under oath and if so, to take the necessary steps accordingly.\nLawyers Michael and Lucio Sciriha were defence counsel.", "comment_count": 0, "id": 2414}, {"keywords": "Construction, Tourism", "author": "", "article_body": "Ongoing demolition and excavation works at the former Palm Court Hotel, in Qawra, has turned the seaside resort “into a war zone”, according to residents, mostly expats\nThe works, which had been going on for the past two weeks, included the demolition of the entire building in two days with trucks now carting away debris on a daily basis and white construction dust strewn all over the place, they said.\n“I have never seen such a savage way of demolishing a building,” a Briton who lives in an apartment close to the former hotel said.\n“In just two days, and amid noises reminiscent of an air raid, the whole building became a mountain of debris,” another resident recounted, showing Times of Malta pictures he took of what he described as “a new war zone”.\nCriticising the state of “despair” ‒ which, according to British expats, “the once idyllic island has been turned into by overdevelopment over the last few years” ‒ the residents complained that “the developers seem to ignore everyone as nothing ever happens” despite their various reports to the police about illegal activities.\nRELATED STORIESConstruction noise making life unbearable for Sliema residents\nThe residents said that, despite rules that demolition and excavation jobs could not take place in tourist areas on public holidays, works on the site continued unabated last Friday. \n“We called the police and they were here a few minutes later. However, for some reason, work continued a few minutes after they left,” a resident said.\nNever seen such a savage way of demolishing a building\nTimes of Malta was informed that, according to the rules in force, it is up to the Building Regulations Office to see that regulations are observed. \nHowever, industry sources commented that office was “practically inexistent”, adding that claims of close connections between officials and developers “are common among several industry players”.\nSo far, the Planning Authority has only given its consent for the demolition of the former hotel, which is expected to be turned into more than 100 apartments and penthouses for sale.\nFour development applications were submitted on the same site plan by four applicants ‒ a move, which, according to PA sources, was intended by the developers to try to reduce the need for further costly studies.\nThe applications were filed by Gozitans Maria Agius, Chloe Portelli, Daniel Refalo and Mark Agius who are known to be closely associated with construction magnate Joseph Portelli of J. Portelli Projects. The applications were signed by architect Annamarie Attard Montalto.\nAsked if the splitting of development applications over the same site for the same project was permitted, a PA spokesman said this could be done.\n“It is standard practice that when the authority receives multiple applications within an area of land, it assesses the cumulative impact of the development irrespective of whether it has a single or multiple ownership,” he noted.", "comment_count": 21, "id": 2415}, {"keywords": "Gender, Finance", "author": "Denise Grech ", "article_body": "The digital industry could be the first sector which would employ as many women as men, Parliamentary Secretary for Digital Innovation Silvio Schembri said.\nMr Schembri was speaking at the launch of the Women4IT project, which seeks to employ 100 young women in the digital sector with training being offered by stakeholders.\nThe current ever-growing digital sector currently had significantly fewer women than men, Mr Schembri noted at the event in Valletta.\nWomen with disadvantaged backgrounds would be given the chance to work in the digital sector through an engagement strategy with stakeholders and employers, Mr Schembri added.\nHe encouraged other initiatives, such as teleworking and flexible working arrangements, which he said were extremely valuable to women with caring responsibilities.\nThe €346,000 project, which runs between September 2018 and August 2021, was presented for the first time to the public last year.\nMalta partnered up with several other countries, including Norway, to provide innovative solutions to increase the number of girls and young women in the digital economy in seven European countries, Parliamentary Secretary for EU funds Aaron Farrugia said.\nThe initiative brings together 10 partners from nine European countries to teach digital competencies to young women \"at risk of exclusion from the labour market\".\nIt will include the development of a new online employability profiling tool and awareness-raising campaigns.\nIn 2017, the gender employment gap amounted to 11.6 percentage points for the EU, with a 76.9% employment rate for men and 65.3% rate for women.", "comment_count": 5, "id": 2416}, {"keywords": "Health, Unions", "author": "Claire Caruana", "article_body": "Patients will once again start being treated at the physiotherapy department as the nurses' union suspends directives it ordered last month. \nThe Malta Union of Nurses and Midwives (MUMN) decided to suspend the action after Steward Health Care provided promised upgrade timelines on Wednesday. \nIn comments to Times of Malta just moments after being handed the timelines for the work at St Luke's Hospital department, union head Paul Pace said that at first glance the timeframes \"seem ok\".\nHowever, he insisted, the union would be holding a meeting in the coming days to properly go through the information supplied by the US hospital operator and analyse it closely to ascertain that all was in place. Any clarifications, he said, would be sought after the meeting. \nThe directives were affecting about 300 patients every day. They came into force some weeks after Times of Malta reported that the department was in such a bad state that the physiotherapists were struggling to treat patients.\nSituated at St Luke’s Hospital and run by Steward Health Care, the US company that took over the 30-year government concession to manage three hospitals, the outpatient physiotherapy department is the only one of its kind on the island.\nReacting on Twitter, Health Minister Chris Fearne confirmed that following talks between Steward and MUMN, the directives had been suspended \"with immediate effect\". \n\nWhen the directives were ordered last month, a spokeswoman for Steward had said that the promised master plan for the physiotherapy department at the old St Luke's Hospital had not yet been unveiled because it needed to “dedicate enough time to planning so as to get it right”.\nPressed to provide specific dates when the master plan would be published, a spokeswoman for the US hospital operator would only say this would be available “within a few weeks or months”.\n \n ", "comment_count": 3, "id": 2417}, {"keywords": "Court, Senglea, Crime", "author": "Edwina Brincat       ", "article_body": "A man obsessed with a woman he knew since childhood has landed in the dock after allegedly pelting her car with stones and tomatoes.\nPaul Roberts, a 30-year old Senglea resident, was taken to court on Wednesday after harassing the woman, a childhood friend and neighbour who he followed around in spite of his unreturned “flirtation.”\nThe woman had filed several reports against Mr Roberts and even installed a CCTV system at her home, just around the corner from that of her unwanted suitor, prosecuting inspector Eman Hayman told the court.\nDespite that, the man kept up the harassment, following the woman around and “throwing things at her,” Inspector Hayman explained.\nMatters appear to have come to a head when the man, who later told the police that he had wanted to strike a conversation with the woman, had climbed onto the roof of neighboring property, aiming stones and tomatoes onto her car.\nThe attempt went wrong, however, with the stones damaging two cars parked nearby.\nMr Roberts denied throwing the items but admitted to the police that he was the man spotted in the CCTV footage, the Inspector said, objecting to a request for bail.\nHowever, defence lawyer Robert Galea stressed that the situation could be kept in check by a temporary supervision order.\nThe court, presided over by Magistrate Natasha Galea Sciberras, granted bail against a deposit of €200, a personal guarantee of €2000, an order to sign the bail book twice a week and to abide by a curfew. A probation officer was also appointed.\n“Avoid her. Don’t follow or even look at her,” was the court’s final warning.", "comment_count": 0, "id": 2418}]