[{"keywords": "", "author": "", "article_body": "St George's Square in Valletta has been transformed into a colourful floral installation formed by 190,000 potted plants for the sixth edition of the Valletta Green Festival.\nThis year's activity also aims to raise awareness of the environmental harm caused by the use of single-use plastic products. \nThe festival opened on Thursday morning and continues till Sunday. It has been organised by the Ministry of Justice and Culture and the Valletta Cultural Agency.\nJustice Minister Owen Bonnici hailed the event as a legacy of Valletta 2018.\nThe Environment and Resources Authority (ERA), Wasteserv and Ambjent Malta are also involved in the event.\nVarious stands disseminating information by NGOs, WasteServ, the Environmental Landscaping Consortium (ELC), the Environment and Resources Authority and Ambjent Malta have been put up.\nLocal band SterjoTipi will be taking part in the festival on Saturday starting at Freedom Square at 10am and then along Republic Street to  St George’s Square.\nAfter the end of the festival, the potted plants will be donated to local communities.\n\n ", "comment_count": 10, "id": 2619}, {"keywords": "", "author": "", "article_body": "Bank of Valletta has recovered €10 million of the €13 million stolen by hackers in February and it expects to recover most of the remainder, the bank's chairman has revealed.\nDeo Scerri also told TVM that the bank was earlier this week informed by police abroad that they had established who had carried out the cyber attack.\nMr Scerri said the bank had appointed lawyers abroad to assist it in the recovery of the remaining funds. \nThe source country of the perpetrators was not revealed. \nRead: How BOV hackers got away with €13 million\nContacted by Times of Malta, Mr Scerri said there were \"high hopes\" another €2 million will be recovered.\nThe chairman said it was thanks to prompt action that only €13m had been stolen, since far bigger amounts were normally stolen in such attacks.\nPrime Minister Joseph Muscat had said in a statement to parliament on February 13 that transactions from BOV had been traced in the UK, the US, the Czech Republic and Hong Kong and were \"being reversed\".\nFund transfers were blocked within 30 minutes and the banks alerted, the Prime Minister said.\nTimes of Malta later revealed that the hackers may have tried to keep a 'back door' open to regain access to the bank's system, but it was noticed and blocked.\nDays after the February 13 breach, files were found hidden in the bank’s systems, possibly intended to allow the hackers to regain access at a later stage.\nSources said that one potential suspect was the international hacking organisation known as Cobalt Gang, which wreaked havoc on the international banking sector. It is believed to have stolen as much as €1 billion from banks in as many as 40 countries in recent years.", "comment_count": 27, "id": 2620}, {"keywords": "", "author": "", "article_body": "Resurfacing works have been carried out on large parts of the road between Sliema Ferries and Balluta as a short-term measure because of the road's terrible state, Roads Minister Ian Borg said.\nHe said Infrastructure Malta recognised the needs of residents in every locality as it planned short and long-term. \nExtensive works on Manwel Dimech and Sir Arturo Mercieca streets in Sliema will be taken in hand 'soon' he said, and Tower Road, where the short-term works have been carried out, is earmarked for more extensive works in the future along with High Street.\nOther works will be announced shortly.\n ", "comment_count": 17, "id": 2621}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nearly 100 objections have already been submitted against a controversial application for the construction of an aparthotel on agricultural land outside the development zone in Mellieħa.\nThe objections were registered in a few days after the proposal came to light at the start of last week when a Planning Authority notice was put up at the plot of land earmarked for the project.\nLocated in Marfa Road, next to the cemetery dedicated to Our Lady of Mercy, the proposal is for a nine-storey aparthotel comprising 118 rooms, underground parking for 38 vehicles and a number of shops. \nThough Carol Peralta, a former magistrate, is listed as the applicant, some of the designs submitted so far are on behalf of Joseph Gaffarena whose son, Mark, made headlines over a 2015 Valletta property deal since branded ‘the Gaffarena scandal’.\nThe scandal erupted when The Sunday Times of Malta reported that Mark Gaffarena had made a profit of €685,000 on the sale of half a palazzo in Valletta to the government, just a few weeks after he had acquired it. \nSubsequently, an investigation by the National Audit Office, concluded that there had been collusion between the Lands Department and Mr Gaffarena. The deal was revoked in March last year, following a court case instituted by the Prime Minister.\nWhen contacted for his reaction and to explain his relationship with Joseph Gaffarena, Dr Peralta replied: “I am a private citizen and have every right to file an application like everybody else.” \nLocality is fast losing its charm due to overdevelopment\nDr Peralta declined to comment any further.\nThe objections filed so far, mostly by Mellieħa and Għadira Bay residents, were on grounds that the plot of land, which has a footprint of 5,500 square metres, would be a dangerous precedent as it would encourage further development of land outside the development zone. Moreover, they expressed concerns the locality was fast losing its charm due to overdevelopment.\n“The very fact that I’m seeing my hometown being butchered and sundered by this rampant construction is not only heartbreaking but disgusting,” one objector remarked.\nHe warned that the building of more hotels would risk killing the goose that lays the golden egg. \n“I’ve heard from numerous relatives, friends and acquaintances that most regular visitors they know have stopped coming to Malta and are no longer recommending it as a holiday destination. Also, residents are leaving not only the town but the island due to the state of our country’s environment, pollution levels and constant construction, which, as I’m sure you know, would not help,” he said.\nObjections were also raised with regard to the site’s immediate proximity to the adjacent cemetery as this would impede any future extension and, possibly, give rise to other issues.", "comment_count": 31, "id": 2622}, {"keywords": "", "author": "", "article_body": "A man was hospitalised after being seriously injured when hit on the head in his home in Xemxija on Thursday afternoon.\nOfficers found the man outside the residence at about 3.30pm.\nThe police said they were investigating the circumstances leading to the assault amid claims that the man was injured when he foiled a burglary possibly involving two persons. \nThe would-be burglars ran away but the police later made two arrests.", "comment_count": 0, "id": 2623}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A magistrate on Thursday deplored the actions of “an absolute minority of guests\" who paid no heed to Maltese laws.\nAlthough Malta had a long-established tradition of hospitality, the authorities should act against those who “commit serious offences in our country and cause unnecessary alarm in society,” he said.\nThe comments were made as a Syrian man was convicted of stealing three watches from a hotel apartment and possession of cocaine.\nMohammed Samer, 49, was arrested by police after they received a report of a fight at a hotel in Għajnsielem last October.\nUpon reaching the first-floor apartment, occupied by a member of the hotel staff, the officers came across a man lying on the floor, being pinned down by another.\n“I found this thief in my room. He was inside…..he stole all my watches,” the man who had held down the alleged intruder had said.\nA glance at the room revealed a ripped door netting and signs of disarray, with clothes flung across the floor.\nThe suspect thief later admitted under interrogation that he had stolen the three watches and had returned to the room in search of cocaine after having allegedly bought drugs from its occupant the previous day.\nThe police investigated this claim which, in fact, resulted in a lie.\nMagistrate Joe Mifsud, after hearing evidence from 14 persons, declared Mr Samer guilty of theft, the possession of cocaine and being a recidivist. He sentenced him to an 18-month jail term and a €100 fine.\nFurthermore, the court urged immigration authorities to repatriate him once his jail term had been served.\nAlthough Malta had a long-established tradition of hospitality, the authorities should act against those who “commit serious offences in our country and cause unnecessary alarm in society,” Magistrate Mifsud said.", "comment_count": 0, "id": 2624}, {"keywords": "", "author": "Denise Grech ", "article_body": "A relaxing week in Malta turned into a nightmare for a mother and daughter who found themselves in what they described as a “drug-fuelled frenzy” due to the Lost and Found festival.\nThe two said they experienced a “devastating” situation after the hotel they were staying in was taken over by teenagers who travelled to Malta for the festival weekend.\nThe annual rave has become a hotspot for party-goers but many have lamented the youngsters that descended upon the streets of St Paul’s Bay were only interested in debauchery.\nChristine Goodaire, who was raised in Malta but resides in the UK, said she found the Qawra Palace Hotel occupied by young people who, she claimed, were openly taking drugs. \n“We booked with the notion we would have seven wonderful days of peace and tranquillity but, unfortunately, our dreams were unexpectedly shattered when we saw our hotel overrun by teenagers,” she told the Times of Malta.\nFootage seen by the Times of Malta shows people laying poolside and appearing to be inhaling air from balloons. \nReports have recently emerged of Buġibba and St Paul’s Bay residents raising the alarm over consumption of nitrous oxide, which is often found in balloons and party cannisters.\nMs Goodaire said it seemed to her the hotel was not interested in dealing with the rowdy teenagers, adding the management insisted they “did not know how to prove” drug use.\nHotel general manager Tony Alamango said there was “definitely” no people taking drugs at their property, adding that the establishment beefed up security personnel prior to the festival.\nDuty managers were always on site, he said. The fact that there were teenagers who were “a little bit loud” was to be expected but it was very far-fetched to say there was use of drugs, Mr Alamango said.\nWhen he was told about the footage that appeared to indicate drug use, Mr Alamango pointed out that the managers would have intervened had they realised something was wrong.", "comment_count": 78, "id": 2625}, {"keywords": "", "author": "", "article_body": "Busy Valley Road in Msida was closed for traffic for most of Thursday while Infrastructure Malta workers laid 20-metre beams to widen the bridge that links Regional Road across the valley.\nThe bridge, built in the early 1980s will be extended to 25.5 metres to include three lanes in each direction and merging lanes to make it safer and improve traffic flow.\nSeven nearby junctions are also being upgraded as part of a €7m revamp of Regional Road. ", "comment_count": 32, "id": 2626}, {"keywords": "", "author": "", "article_body": "Any vote for Labour candidates in the European Parliament elections would be a vote for the European socialists, whose electoral manifesto backs abortion and its introduction throughout Europe, the PN spokesman on children's rights, Claudio Grech, said on Thursday.\nOn the other hand, a vote for PN candidates would be a vote in favour of life, Mr Grech told a party press conference. \nHe said Maltese MEPs had failed to persuade their European socialist colleagues not to push forward abortion and, instead, respect the different values of the people of Europe. \nIn the European Parliament, socialist MEPs such as Edite Estrela and Marc Tarabella had promoted abortion as a human right paid for by the people's taxes. It was only thanks to the European Popular Party that a report on abortion by Edite Estrela was not endorsed by the plenary assembly of the European Parliament. But should the socialists gain a majority in the European Parliament, they would, according to their own manifesto, ensure that abortion was available in all member states of the European Union. \nMr Grech insisted that it was the right to life which was supreme, especially the life of an innocent baby in the womb.\nA process was needed for better acknowledgement of the rights of the unborn and Malta should promote its values in favour of life in the European Union. \nPeter Agius, an MEP candidate, said Nationalist MEPs would work in favour of an EU which recognised the diversity of its member states and safeguarded Maltese values in ethical and traditional matters. \n\"It is not enough that PL MEP candidates declare that they are against abortion in Malta if they did not manage to amend the socialist manifesto in Madrid.\"\nHe stressed Europe should simply not interfere on issues such as abortion as these fall within the exclusive competence of member states.", "comment_count": 54, "id": 2627}, {"keywords": "", "author": "", "article_body": "A campaign to encourage young people to take up a career in nursing and midwifery was launched on Thursday afternoon as part of efforts to address staff shortages across the health system. \nAddressing a press conference, Health Minister Chris Fearne said that as more services are introduced, the need for more nurses and midwives would only increase with time. \n\nOver the past six years, Mr Fearne said, the government managed to recruit around 700 nurses, bringing the total from 2,900 in 2013 to 3,600 this year.\n\"In six years, we brought in 700 nurses. Because of what is already offered we  need at least 250 nurses and because of the expansion of these services, we need at least a further 150 nurses. Between today and two or three years’ time…we would need around 400 new nurses,\" Mr Fearne went on. \nThis year, he added, some 190 students were expected to graduate and join the public health system. \nAlso speaking at the press conference, Malta Union of Nurses and Midwives head Paul Pace described nurses as \"the backbone of the health system\". \n\"What is happening, unfortunately, is that while  demand is growing, the population of nurses is going down. That means that expectations are growing.\n\"It is worrying that as a union we sometimes come off as trying to halt the system. It is not our intention but sometimes for change you need to take drastic measures,\" Mr Pace said.\nThe union chief insisted that the population growth and its impact on the health system had to also be kept in mind when making certain decisions. \n \n ", "comment_count": 3, "id": 2628}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, with past convictions on his criminal record, landed a fresh one on Tuesday night after he was caught red-handed stealing from a Birkirkara petrol station.\nDennis Cremona, 43, an unemployed Marsa resident, was taken to court on Thursday to face charges of aggravated theft, willful damage to third party property and being in possession of tools used in break-ins.\nProsecuting inspector Elton Taliana informed the court that although the theft had yielded a minimal amount of cash, some €6 in all, the damage caused to the machine clocked up the bill to over €250.\nThe man, with past convictions for theft, was further charged with being a relapser.\nFollowing the accused’s admission, the court, presided over by magistrate Yana Micallef Stafrace, heard submissions on punishment wherein both the prosecution and defence lawyer Joseph Brincat agreed that the adequate punishment would be a six-month effective jail term.\nIn the light of these submissions and in view of the accused’s early guilty plea, the court condemned him to an effective jail term of six months.", "comment_count": 0, "id": 2629}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A matching fingerprint on each of three vehicles allegedly broken into by a suspect did not suffice to convince the court of the man’s involvement in the thefts.\nSimon Borg, 33, had been summoned for questioning by police investigating three separate reports of thefts from vehicles which took place at Tarxien, Rabat and Lija between 2005 and 2011.\nUnder interrogation, the suspect had not admitted any involvement in the thefts, answering “I don’t remember” or “I don’t know” all along. He had, however, admitted to a nine-year-long drug problem which occasionally prompted him to break into cars, resorting to theft to sustain his addiction.\nThe man was eventually charged with the three thefts, voluntary damage to third party property as well as committing such wrongdoing during the operative period of a suspended sentence.\nHe was further charged as a relapser.\nThe case pivoted upon the findings of a court-appointed expert who reported a positive match, consisting of one fingerprint on each of the three cars that matched one finger of the accused.\nThe court, presided over by magistrate Claire Stafrace Zammit, observed that this fingerprint was “the only tangible evidence” for the prosecution to prove the accused’s alleged connection to the thefts.\nOn the basis of case-law on the matter, the court said that not all circumstantial evidence such as this fingerprint carried equal importance and probatory value, adding that it was up to the court to “weigh each piece of evidence” to determine whether the prosecution had proved its case beyond reasonable doubt.\nIn this case, two of the alleged victims had chosen not to testify, whereas the third car owner had not actually witnessed the theft nor had been able to identify the suspect in court.\nThe accused had put forward no evidence to rebut the scientific proof, the court went on.\nHowever, since the allegedly tell-tale fingerprint had been lifted from the external surface of the vehicles, all parked in a public space, the court was not convinced that it had been left there by the accused when breaking into the cars, thus pronouncing an acquittal.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2630}, {"keywords": "", "author": "", "article_body": "All the 17 MEP candidates that responded to a survey organised by the Life Network Foundation said they would vote against any measure which would promote abortion.\nThe foundation contacted all the candidates asking them to state their stand on four key issues, but not all responded, and not all responded to all the questions.\nOn the issue of abortion, all 17 said they were against, but when it came to surrogacy, 13 were against and four were in favour.\nOn the question of one’s right to freedom of conscience, one was against and 16 said they were committed to defending it.\nThe final question was on euthanasia and/or assisted suicide, with 14 against and three in favour.\nThe full list follows, but the foundation said that it would update the results if further replies were received.\n‹›-+Page:  /", "comment_count": 44, "id": 2631}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An Italian man with suspected ties to the mafia, currently undergoing extradition proceedings before the Maltese courts, is to be repatriated to his homeland after the request for committal was green-lighted by the court.\nAntonio Ricci, arrested on Easter Sunday on the strength of a European Arrest Warrant issued by judicial authorities in Calabria, had been residing in Malta for the past 10 years and had strong family ties on the island.\nThe request by the Italian authorities had followed hot on the heels of a domestic arrest warrant issued against Mr Ricci in December last year, for prosecution over his alleged participation in a criminal organisation.\nThe alleged crimes were clearly listed in the warrant and had been confirmed by the Maltese court presiding over the committal proceedings who had expressly asked for official documentation from the Italian Justice Ministry.\nRead: Arrested ‘Mafia man’ formed part of gaming crackdown in which €1 billion were seized\nThe documents had confirmed the specific charges and details of the alleged criminal activity, supplying dates, places, other persons involved and the aim thereof.\nUpholding the request, the court, presided over by magistrate Donatella Frendo Dimech, observed that the offence over which the extradition was being sought was an extraditable one.\nIt turned down a request by the man’s defence team for a reference to the European Court of Justice.\nThe defence had also sought to challenge the validity of the procedure adopted by the Italian authorities, arguing that they should have issued a European Investigation Order rather than an arrest warrant.\nHowever, the court threw out this argument stating that it was not the role of the Maltese Courts “to usurp the function of the foreign judicial authorities and to dictate which instruments and which procedural action ought to be taken”.\nThe court remanded the man in custody pending his extradition, not before seven days, and subject to possible appeal.\nRead: Italian man with suspected mafia links can be named, court rules\nLawyers Arthur Azzopardi and Stephen Tonna Lowell were defence counsel. Inspectors Mark Galea and Robinson Mifsud prosecuted. Lawyers Matthew Xuereb and Charles Mercieca appeared on behalf of the Office of the Attorney General.", "comment_count": 0, "id": 2632}, {"keywords": "", "author": "Claire Caruana", "article_body": "The number of people admitted to hospital after consuming excessive alcohol shot up to more than 1,800 last year, the highest in a decade.\nThe figure is more than five times the average in the previous 10 years.\nA total of 388 cases had been registered in 2016, up from 168 the previous year. Figures for 2017 were unavailable but those for the previous years ranged from a low of 132 people in 2008 to 393 people in 2014, bringing the average over a decade to 270 people.\nThe figures for last year were tabled in Parliament earlier in the week by Health Minister Chris Fearne in reply to a question by independent MP Herman Schiavone. Data for the previous years had also been tabled in Parliament.\nThe figures for last year were tabled in Parliament earlier in the week. Photo: Shutterstock\nMr Fearne told Times of Malta on Wednesday the spike in numbers was worrying, noting that the majority of drunk patients tended to turn up at the emergency room over the weekends.\n“It does not matter whether they are Maltese people or foreigners, students or tourists. They are all patients and it is worrying,” the minister said, pointing out there was also a significant number of people who turned up at the emergency room but required treatment that could have also been given to them at clinics.\nMr Fearne had announced in 2018 that a medical clinic would soon be set up in Paceville to handle drunk revellers who were regularly crowding the emergency room.\nAsked on Wednesday for an update, he said that, at the time, there were no concrete plans and the concept was “still just an idea”. He added, however, that while the idea to have one fixed clinic in Paceville was found not to be viable, there were other plans that involved introducing mobile clinics that would be moved to areas where people were likely to be consuming large amounts of alcohol.\nMr Fearne said the plan was to have the new clinic up and running in “12 to 16 months’ time”.\nThe decision to set up the clinic at the entertainment hub had been announced in the wake of complaints by staff of Mater Dei Hospital’s accident and emergency department who said they were inundated with people in need of treatment either due to alcohol or drug abuse.\nAt the time, the department was seeing as many as 70 ambulance movements carrying alcohol-intoxicated patients to the hospital.", "comment_count": 20, "id": 2633}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 2.30pm\nThe government shut down a Mosta road illegally for a press conference on cleaning arterial roads that was \"invaded\" by Labour party candidates, the local council charged on Thursday.\nMayor Keith Cassar said the Mosta council was invited to a press conference by Parliamentary Secretary Deo Debattista, only to find the road was closed and blocked by two government cars. \nThe council had not issued a permit for the road at Triq Dawret il-Wied to be shut, he said. \n\"On top of this, what was supposed to be a government press conference ended up being invaded by Labour party candidates for the Mosta council,\" the PN mayor said.\nThe mayor and another councillor said they asked the parliamentary secretary to request that Labour party candidates move away from the press conference.  Dr Debattista, however, refused, the mayor added. \nThe mayor and the councillor said they then opted not to take part in the press conference, and criticised the lack of separation between the local and central government.\nThe council said it believed central and local government should not include partisan politics, adding national authority should be there for all residents. \nPolitical maturity calls for people to distinguish between local and national interests and partisan ones, the council said. \nDuring this legislature, the Mosta council never used people’s resources to push political agendas and it was not about to start now, it added. \n\nSpeaking to the Times of Malta, Dr Debattista said he was \"shocked\" by the Mosta local council's reaction.\nVehicles placed as part of the press conference impeded traffic flow, but the road had not been officially shut down, he said.\nAsked whether he asked Labour council candidates to move aside, Dr Debattista said he would never ask people to move away.\n\"As if I would ask people to leave,\" he said. “That would almost be arrogant- you can’t dictate what people should do,\" he added.\nAsked if Labour party council candidates were informed of the event, he said the press call was no secret and he did not know if they were informed from others.", "comment_count": 50, "id": 2634}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Planning Authority is trying to identify the owners of caravans located off the road in Baħar iċ-Ċagħaq, having already descended on illegally-parked caravans in Mistra.\nCaravans can only be parked on roads provided they have an inbuilt engine. Non-motorised campers and trailers can park on the road only if they are secured to or towed by a vehicle.\nCaravans have already started popping up at Mistra, Baħar iċ-Ċagħaq, Marsascala and Salina, in what appears to be an annual annoyance to bathers.\nAt Mistra, in particular, a restaurateur said he had been losing clients since campers started parking their caravans just outside his terraced restaurant around 2008. \nClaude Camilleri told Times of Malta the situation was forcing him to pack up his business and consider leaving the island.\nFor Mellieħa mayor John Buttigieg it was an issue of enforcement but questions sent by the newspaper to the police last week have yet to be answered.\nOver the past days, the PA and the transport watchdog slapped some caravans in Mistra with notices, urging them to get in line with the law.\nNotices allow regulator to take further action\nTransport Malta put up warnings to ensure the owners of a number of vehicles did not “encumber the bay to the detriment of others”. The notices allow the regulator to take further action against those not permitted to be in the area, including non-motorised caravans not attached to vehicles.\nWhile the transport watchdog can issue fines for illegally-parked vehicles (motorised campers), this is not an option for non-motorised ones. The notices enable it to tow them away at a later date if the obstruction persists.\nIn the meantime, towable campers not accompanied by motorised vehicles have appeared in St Thomas Bay, campers were seen parked off the road at Baħar iċ-Ċagħaq and others took up parking spaces at Salina. \nWhen contacted, a spokesman said the PA’s enforcement remit was to proceed against campers not parked on the road or in a parking area.\n“There is already a pending investigation on the campers parked in Baħar iċ-Ċagħaq and the authority is in the process of identifying the owners to issue instructions accordingly,” the spokesman said.\nQuestions sent to Transport Malta remained unanswered at the time of writing.", "comment_count": 135, "id": 2635}, {"keywords": "", "author": "", "article_body": "These are the main stories in Thursday’s newspapers.\nTimes of Malta says the government wants Marco Gaffarena to stop any further development on public property in Sliema that was supposed to be returned to the State following the 2015 Valletta deal scandal. It also says that the number of people admitted to hospital after consuming excessive alcohol shot up to more than 1,800 last year, the highest in a decade.\nThe Malta Independent says Tourism Minister Konrad Mizzi has decided not to appeal the court decision regarding an inquiry related to the Panama Papers.\nIn-Nazzjon leads with an appeal from Mġarr farmers for people to choose local produce.\nL-Orizzont says that the price of another 29 medicines has gone down.", "comment_count": 0, "id": 2636}, {"keywords": "", "author": "", "article_body": "A 20-year-old woman from Rabat was grievously injured in a traffic accident in the limits of Siġġiewi on Wednesday.\nThe police said the accident happened in Triq is-Salib tal-Għolja at 5.10pm.\nThe victim was a passenger in a Toyota Vitz that was being driven by a 19-year-old woman from Dingli. The Vitz was involved in a collision with an Isuzu NR-B that was being driven by a 67-year-old man, also from Dingli.\nShe was assisted by a medical team on site and then taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2637}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government wants Marco Gaffarena to stop any further development on public property in Sliema that was supposed to be returned to the State following the 2015 Valletta deal scandal.\nTimes of Malta is informed the Lands Authority has filed a judicial letter in court asking Mr Gaffarena and his wife to desist from doing any further work on the public property. This followed a report that appeared on The Sunday Times of Malta titled ‘Gaffarena developing government property’.\nMarco Gaffarena\nThe regulator also held the Gaffarenas responsible for any damage resulting from their actions.\nA spokesman for the lands watchdog confirmed that a judicial letter was filed and noted the government was also considering “further action”.\nThe Sunday Times of Malta reported that although the court had ordered Mr Gaffarena in 2016 to return the property to the government, this did not happen.\nInstead, the public property in question appeared in plans submitted by Mr Gaffarena to develop a prime site in Sliema into luxury apartments. Construction work had already started.\nThe property, a shop in Manuel Dimech Street, formed part of a deal struck with the government in 2015 through which Mr Gaffarena acquired over €3 million in cash and public land in exchange for half a palazzo in Old Mint Street, Valletta.\nThe deal was struck down by the court after the National Audit Office concluded that the negotiations between the government and Mr Gaffarena were illegal.\nPrime Minister Joseph Muscat, who following the court decision had declared he had won the case he had instituted “to protect the public interest”, said on Monday he learned about the latest developments through The Sunday Times of Malta. He said he had given instructions to look into the matter.\nA few weeks before the report appeared on The Sunday Times of Malta, a spokesman for the Office of the Prime Minister said the government had taken back the public property involved in the Valletta deal.\nThe government had taken back the public property involved\nThe Lands Authority had told The Sunday Times of Malta that, although Mr Gaffarena had filed an appeal against the court decision, which was still pending, an injunction had been issued safeguarding any transfer of property involved in the case.\nInitially, the regulator said the development in Sliema did not involve the government-owned shop but an adjacent property. However, when the newspaper pointed that this was not the case, a spokesman said that the lands watchdog was not aware of the development.\nThe 2016 investigation by the Auditor General had led to then planning parliamentary secretary Michael Falzon to step down, as also did the head of the estate management division at the now defunct lands department, Carmel Camilleri.\nDr Falzon was made Cabinet minister after the 2017 election and Mr Camilleri, who the Auditor General named as one of the protagonists of the scandal, joined the Lands Authority and was recently appointed acting head of the same office he used to run during the Valletta property scandal.\nDr Muscat told the Times of Malta that he did not know anything about Mr Camilleri’s latest promotion.\nRead: How the Michael Falzon/Gaffarena scandal developed\n ", "comment_count": 94, "id": 2638}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Water Services Corporation is insisting no slurry is being discharged into the open sea from its wastewater plant in Gozo but is nonetheless investigating whether there could have been a “one-off”.\nThis statement was made by a corporation spokesman when asked by the Times of Malta for an explanation about footage posted a few days ago on Facebook.\nShot by divers, the short video clip showed thick murky discharge flowing freely from an underwater pipe. The footage was reportedly taken at Ras il-Ħobż dive spot in Gozo, which is also the site of the island’s only wastewater treatment plant.\nIn recent years, there have been various instances where the popular rocky beach had been contaminated with sewage when the illegal dumping of animal waste in sewers damaged the plant.\nNew equipment installed last January was meant to address the problem permanently. According to the WSC, the equipment is capable of converting a bowser-full of slurry to a skipload of solid waste in just 15 minutes, with the liquid by-product being treated separately at the plant along with domestic sewage.\nThe plant did not experience any raw sewage bypasses over the past weeks\nAsked about the footage, a WSC spokesman insisted no slurry was being discharged into the open sea from the plant. Whenever there was a fault, the public would be immediately alerted through a press release, he added.\n“The said footage is being investigated but the plant did not experience any raw sewage by-passes over the past weeks,” he said.\nThe WSC also sent a photo of a sample, which, it said, was taken from the treated water prior to discharge into the sea. Though this newspaper could not verify the source of the sample, the spokesman said its colour was “much clearer” than the effluent captured in the footage.\nThe “discrepancy” in colour was being looked into by engineers and scientists to determine the cause or the nature of a “potential one-off”, he continued.\nThe spokesman said the plant was performing significantly better than it did last summer, thanks to a holistic strategy to improve its operations. He added that the animal waste treatment set-up, although already successful, would be further fine-tuned over the next weeks.\nMore upgrades were in the pipeline for the coming months, including the installation of a proper diffuser on the outfall, for which the tenders had been issued, he said.", "comment_count": 13, "id": 2639}, {"keywords": "", "author": "", "article_body": "A 63-year-old Italian man was seriously injured while working in a quarry in Gozo on Wednesday afternoon.\nThe police said the accident happened at 4.15pm at Għar Ilma near Kerċem.\nThe man has been hospitalised. ", "comment_count": 0, "id": 2640}, {"keywords": "", "author": "", "article_body": "A White Paper on the rental market has reached the stage where decisions are being taken on the way forward, Social Solidarity Minister Michael Falzon told parliament during a debate on the Housing Authority Estimates on Wednesday. However, the government would not seek to regulate the rental market or to intervene in it directly, but would restrict its involvement to guiding its direction.\nDr Falzon spoke on various schemes introduced by the government to assist persons to become homeowners for the first time, including the first-time buyer scheme and a subsidy to assist with loan repayments. He touted various social housing projects which would increase the country’s stock of housing units by 30%.\nHousing Parliamentary Secretary Roderick Galdes accused the Nationalist Party of sabotaging one of these projects in Siġġiewi, where, he said, the Nationalist mayor was “obstructing” a block of social housing units from reaching completion by appealing against the project and by putting unreasonable conditions on contractors.\nOpposition MP Ivan Bartolo said that it was unfair to allege that the Nationalist Party had done nothing on housing, calling the party a “pioneer” in the field and attributing to it the high rate of home ownership in Malta.\nMr Bartolo acknowledged that some of those waiting for social housing today had been waiting for over 20 years.\nHe referred to rising rental prices and but called for political intervention in order to ensure that prices remained at reasonable levels. Families, he said, were being faced with difficult decisions.\nEven well-paid employees working in the gaming sector were feeling the pinch, he added.\nThe Labour Party’s socialist credentials could not be taken seriously any longer, he concluded, as he accused its MPs of being “champagne socialists.”\nOpposition MP Claudette Buttigieg highlighted the disproportionate effects of the housing crisis on women, owing to a persistent gender pay gap which meant that women had less disposable income and lower pensions. Especially in situations where they were forced to seek accommodation of their own due to marital strife - a factor which Mr Galdes recognised as being a key reason motivating applications for social housing, particularly among women - women were increasingly vulnerable and often remained in abusive relationships to avoid the leaving the matrimonial home.\nSocial housing tax\nOpposition MP Godfrey Farrugia questioned why the Government had guaranteed ElectroGas’s bank loans but was not guaranteeing those of youths wishing to buy their own homes. He called for a low-interest or interest-free system of lending to continue the trend of high home ownership in Malta, and argued that those who constructed large blocks of apartments should pay a tax which went for social housing.\nConcluding, Mr Galdes asked for concrete proposals from the Opposition and laid much of the blame for the present situation at the feet of the previous Nationalist administration.\nFormer Prime Minister Lawrence Gonzi had attempted to solve the problem by calling fair game on development in many areas which had been formerly ODZ, but this had not solved the problem as the increased interest in development had only spurred prices on, he said.\nHe called for a consensus on efforts to improve the current stock of social housing, asking the Nationalist Party to stop its obstructionism in Siġġiewi and to support efforts to end the heredity of social housing units.\nMr Galdes also gave details of many schemes to improve extant social housing units and to alleviate the current demand for housing through collaboration with the private sector. He compared the efforts of his parliamentary secretariat to the “generational leap forward” achieved by former Prime Minister the late Dom Mintoff in the 1970s.", "comment_count": 13, "id": 2641}, {"keywords": "", "author": "", "article_body": "A man who killed his partner by stabbing her 49 times in 2004 has been convicted of slashing a prisoner in one of his eyes in the waiting room of the prison clinic.\nThe incident happened on June 1, 2010 when David Norbert Schembri attacked and injured Noel Borg.\nBorg instituted court proceedings against both Schembri and the prisons administration, and the court found in his favour, ordering them to pay him a total of €62,387 in compensation.\nThe court heard that the two prisoners had been previously involved in an argument and came to blows. Borg subsequently asked to be moved from the division where he was kept, fearing for his safety.\nNonetheless, the two met in the hospital’s sick bay and Schembri slashed him with a blade taped to a cigarette lighter, seriously injuring his left eye. The blade had been supplied by the prison authorities for shaving purposes.  \nThe prison authorities denied responsibility, claiming that the assault could not have been foreseen since Schembri had not been involved in any serious violent incident with other prisoners before. Furthermore, the incident happened in a flash before the prison guards who were nearby could intervene.\nREAD: 'I don't deserve life in prison' - murderer\nThe authorities insisted that Schembri was solely responsible for the incident and for the injuries caused to Borg.\nMr Justice Grazzio Mercieca said the prison authorities had a duty of care to ensure that the prisoners were safe and did not injure one another.\nThe prison authorities should have known that Schembri was dangerous and been more vigilant in his case, especially since he had killed his partner by stabbing her. The authorities had also been warned of the danger by Borg himself when he sought the transfer to another division.\nSchembri and the prison authorities were therefore jointly ordered to pay Borg compensation of €62,387 after the court heard that Borg had suffered a disability of 24%.\nMr Borg is no longer in prison.\nREAD: Murderer gets more jail time for setting cell on fire", "comment_count": 0, "id": 2642}, {"keywords": "", "author": "Claire Caruana", "article_body": "Health Minister Chris Fearne on Wednesday afternoon acknowledged that work carried out by Vitals had not progressed at an acceptable rate and said that the situation improved once Steward Health Care took over the hospital privatisation deal. \nVitals Global Healthcare (VGH) was supposed to invest over €200 million in the Gozo, St Luke’s and Karin Grech hospitals however the company had pulled out of the deal in December 2017. The 30-year concession for the running of the three hospitals was then taken over by Steward, with Mr Fearne heralding the change as \"the real deal\".\n\"Everyone knows, there is no need to beat around the bush, that when we were working with the original partners, there was a time when we wanted things to progress faster, those partners have changed and now we are working closely with Steward Health Care,\" Mr Fearne insisted.   \nNew orthopedic ward\nThe minister was speaking at the opening of a ten-bed Orthopedic Ward at the Gozo General Hospital, which saw Steward investing some €158,000.  Last year, over a hundred hip and knee replacement surgeries were carried out at the Gozo Hospital. \nOn the planned new Gozo hospital, Mr Fearne said that timelines would be made public by Steward in the coming weeks, insisting that work would commence soon.   \n\"We wanted the work on the anatomy centre to progress and then move on to the medical school. The building is ready and the plan is to have the furnishings and equipment installed in summer. Once this is completed, there are plans to have the new hospital at the start of 2020. Steward will publish timelines in the coming weeks,\" Mr Fearne went on. \nHealth Minister Chris Fearne is introduced to staff at Gozo hospital.\nAlso speaking at the event, Gozo Minister Justyne Caruana said that unlike in the past, where patients were forced to get certain treatment in Malta because the Gozo hospital was not equipped to provide such care, people in Gozo were now not only getting treatment on the island but also getting care which is of high standards.   \n\"The government’s vision is a holistic one. The service offered here needs to be as good, if not better, than that of Malta,\" Dr Caruana went on. \nMinisters Fearne and Caruana tour the hospital.", "comment_count": 19, "id": 2643}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Some 300 people who live in three remote areas around Rabat will finally be linked to the main sewer system after decades making use of private cesspits.\nThroughout the years, residents of tal-Landrijiet, is-Salvatur and Ġnien is-Sultan have had to put up with an inconvenient sewer system that saw the cesspit fill up after 10 days.\nThis system generated traffic because of the number of bowsers required to empty the cesspit, fuel consumption, unpleasant odours, emissions and sewage percolation to the water table.\nWater Management Minister Joe Mizzi said a new sewer system will be laid in Rabat, just as had been done in a similar project in Baħrija.\nThe Rabat project will see the installation of eight kilometres of piping and three pumping stations, designed specifically to take the sewage to ta’ Barkat.\nThere, it will be treated so that it can be used for irrigation purposes, among others.\nA fibre optic communication system installed by the Water Services Corporation in between pumping stations will ensure efficient maintenance and operation.\nMr Mizzi said the project, which he described as an environmental one, will cost some €4 million, mostly funded by the EU. It will take 90 weeks to complete.\nIt forms part of a larger €130 million WSC project that will, among others, improve the quality of potable water.\nWorks in the remote Rabat areas are expected to kick off in the coming weeks, as soon as the Superintendence of Cultural Heritage gives its go ahead, considering the archaeological remains in the area.", "comment_count": 14, "id": 2644}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Tenants in properties leased before June 1995 can no longer rest assured of their tenancy rights following a landmark ruling in a constitutional case on Wednesday which declared that the current legal regime breaches landlords’ fundamental rights.\nThe pronouncement was delivered in proceedings instituted by Anthony Debono and Simone Dimech as owners of a requisitioned property on Guze Ellul Mercer Street,  Sliema, rented to Stefan Mifsud who had lived there with the previous tenant, his grandmother and continued to do so after her death in 1986.\nThe house, formerly owned by the applicants’ father who passed away in 2004, had been Mr Mifsud’s matrimonial home against an annual rent of €203, subject to an increase in line with the Inflation Index, the last being in January 2019.\nThat was the ‘fair rent’ in terms of the current legal regime, as regulated by the Reletting of Urban Property (Regulations) Ordinance, whereby landlords whose property had been rented out prior to June 1, 1995 had no right to refuse renewal of the lease and had to make do with that ‘fair rent’ in spite of soaring market values.\nThe applicants argued that the situation gave rise to “an enormous discrepancy” between what they were earning by way of rent and the potential income their property could generate on the free market.\nA  court-appointed architect had estimated that the house was worth some €300,000 and could generate a monthly rent of €1,000.\nThe applicants also explained in court how back in 1996 they had to turn down a purchase offer of €450,000 since the tenants refused to accept alternative accommodation offered, thus blocking the sale of the premises.\nMoreover, the owners said they had “no real hope of gaining effective possession of the premises nor real income” therefrom given that the tenants’ children held a right to succeed in the enjoyment of the lease.\nThe First Hall, Civil Court in its constitutional jurisdiction, presided over by Mr Justice Lawrence Mintoff, observed that compared to the market value, the rent was low and the chance of regaining possession of the house for the landlords was “remote.”\nThe current regime created an unjust imbalance between the rights of the owners and those of the tenants, with the former having to shoulder, for years on end, the social burden induced by the current legislation which allowed sitting tenants the right to continue renewing the lease indefinitely at a paltry rent despite the amendments of Act X of 2009.\nThe State had clearly “failed to legislate to safeguard the rights of owners,” the court declared, stating that this should never be “unless adequate compensation was provided by the State.”\nSuch a situation clearly breached the applicants’ constitutional rights, concluded the court, awarding them €20,000 by way of damages payable by the Attorney General, together with all costs of the case.\nFinally, the court also ordered the tenants to no longer rely on the law which was thus declared unconstitutional, to retain their hold on the premises.\nThis effectively means that all pre-June 1,1995 leases, whether residential or commercial, are up for scrutiny. If the rent is disproportionate with market forces, then, the tenants shall no longer be able to claim protection for automatic renewal.\nLawyers Edward Debono and Karl Micallef assisted the applicants.", "comment_count": 0, "id": 2645}, {"keywords": "", "author": "", "article_body": "Twenty-nine medicines are having their price reduced, government officials announced on Wednesday. \nThey also announced the introduction of 14 generic medicines and 23 medicinal products of pharmacotherapeutic importance.\nParliamentary Secretary for Consumer Rights Deo Debattista said the price cuts include medicines to prevent the formation of blood clots, medicines indicated in erectile dysfunction, osteoporosis, neuropathic pain and anti-inflammatories.\nPatients can save up to €50 on the price of pregabalin prescribed in neuropathic pain which has been reduced by 67%. Other price reductions include 45% on eye drops for glaucoma, 30% on medicines for erectile dysfunction and 10% on antithrombotic medicines.\nSimultaneously, 14 generic medicines are now accessible on the local market with a competitive price.\nDr Debattista said that the medicine containing emtricitabine and tenofovir indicated for pre-exposure prophylaxis to reduce the risk of sexually acquired HIV infection is now available at a price of €95 for 30 tablets. Patients may benefit from discounts of up to 82% when compared to the originator.\nThe same applies to the antibiotic fosfomycin where patients can save up to a maximum of 50%. All these medicines are registered with the Malta Medicines Authority ensuring the quality, safety and efficacy standards in line with the European legislation.\nDr Debattista said that despite the challenges imposed by Brexit, accessibility to medicines has been improved by the introduction of 23 new medicinal products of pharmacotherapeutic importance. These include 13 point-of-care tests and new liquid formulations of the medicines fluoxetine and aripiprazole which are now accessible to patients who find difficulty in swallowing. \nThe full list of medicine price reductions can be accessed through the MCCAA website: https://www.mccaa.org.mt/", "comment_count": 11, "id": 2646}, {"keywords": "", "author": "", "article_body": "The Malta Developers Association has warned people planning to buy property 'on plan' to seek professional legal and architectural advice so as to avoid future disappointment and unnecessary aggravation that could lead to complicated legal action.\nThe association said it had received complaints from disappointed purchasers who found that they did not get what they expected. \n\"For a number of years, MDA has lobbied the authorities for the establishment of a register of approved developers to ensure that rogue developers are easily identified by the general public.\n\"In the absence of such a list, MDA advises would-be buyers to take both professional legal and architectural advice if they are considering buying a unit ‘on plan’ so as to avoid future disappointment and unnecessary aggravation that could lead to complicated legal action,\" the association said. ", "comment_count": 12, "id": 2647}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A domestic argument that spiraled out of hand landed a young man in custody he allegedly attacked his parents after a night of drink and drugs.\nThe 29-year old man from Swieqi was arrested after the police received a call for assistance from the distraught parents in the early hours of Tuesday.\nThe man was marched to court on Wednesday afternoon charged with attempting to grievously injure his father, without the intent to place his life in danger, slightly injuring both parents, threatening and assaulting them, as well as causing them to fear violence.\nHe was further charged with possessing ecstasy, cannabis and cocaine as well as with having stolen an undisclosed sum of cash from his parents.\nThe man pleaded not guilty and was remanded in custody after his legal aid counsel, Dr Leontine Calleja, informed the court that no request for bail was being made at this stage.\nUpon a request by the defence, unopposed by prosecuting officer Joseph Xerri, the Court, presided over by magistrate Caroline Farrugia Frendo, recommended that the accused be remanded to the Forensic Unit at Mount Carmel Hospital on account of his drug problem and a history of mental illness.\nThe court recommended that the young man be followed by a psychologist as well as social workers who could best tailor a treatment plan to enable him to combat his drug problems.\nUpon a request by parte civile lawyer Karl Brincau, the court further issued a Protection Order in favour of the concerned parents who were also present during the arraignment.\nFinally the court issued a ban on the publication of the accused’s name so as to safeguard the victims in this domestic violence incident.", "comment_count": 0, "id": 2648}, {"keywords": "", "author": "", "article_body": "John Bonello has been appointed the chairman of HSBC Bank Malta, replacing Sonny Portelli who had indicated that he wanted to step down after 12 years.\nMr Bonello was appointed as non-executive director of the Bank in July 2013 and is presently chairman of the bank’s Audit Committee and member of the bank’s Risk Committee.\nHe was formerly the chairman and senior partner of PricewaterhouseCoopersin Malta from where he retired in December 2009. \nMr Bonello’s appointment will become effective upon approval by the regulator.\nAndrew Beane, executive director and CEO said: “Sonny has chaired our bank with distinction through a period of unprecedented change in the financial services industry. He leaves with our thanks and admiration, and we wish him and his family well for the future.\"", "comment_count": 0, "id": 2649}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who admitted to almost-fatally stabbing a fellow Libyan national at the Ħal Far Open Centre three years ago has been condemned to 13.5 years in jail.\nAhmed Omar Aljuweeni, 34, stood accused of attempted murder after the violent episode which broke out over money which the victim allegedly owed the aggressor.\nThe accused, also charged with possessing a weapon and inflicting grievous injuries upon his victim, claimed that the other man had pulled out a knife and attempted to attack him after being approached over the issue of the pending debt.\nThe defence counsel had argued that the accused had wrestled the knife out of the other man’s grasp before the stabbing occurred.\nAfter a plea bargaining exercise between the prosecution and the defence, the accused entered a guilty plea and was condemned to a jail term of 13.5 years before the Criminal Court, presided over by Madam Justice Consuelo Scerri Herrera.\nHe was further ordered to pay €4,927.05 by way of court expenses.\nThe accused was remanded in custody.\nLawyer Marc Sant was defence counsel.", "comment_count": 0, "id": 2650}, {"keywords": "", "author": "", "article_body": "Updated 1.50pm with second accident\nTwo motorcyclists were hurt in separate accidents within hours of each other on Wednesday.\nA motorcyclist was seriously injured after he collided with a Land Rover on Princess Margaret Street in Msida.\nPolice said that the incident occurred at 7.30am.\nThe injured man was a 33-year-old from Kirkop while the Land Rover was being driven by a 24-year-old man from Sliema.\nA few hours later, there was an accident at Mannarino Road in Birkirkara, when a 57-year-old man on a motorcycle was involved in a collision with a car driven by an 82-year-old from Birkirkara. \nInvestigations are still under way in both cases.", "comment_count": 0, "id": 2651}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 6.11pm with PN reaction -\nMalta has the second highest increase in carbon dioxide emissions from 2017 to 2018, the latest figures have revealed.\nThe country registered an increase of 6.7 per cent, second only to Latvia, which registered an increase of 8.5 per cent.\nOn average, carbon dioxide emissions in European countries decreased by 2.5 per cent between 2017 and 2018. Malta was one of only eight countries to register an increase, the figures revealed. \nCarbon dioxide emissions are a major contributor to global warming and account for around 80 per cent of all EU greenhouse gas emissions. They are influenced by factors such as climate conditions, economic growth, size of the population, transport and industrial activities.\nIn Malta, carbon dioxide emissions have been largely attributed to transport and traffic. \nMalta has been lagging far behind its greenhouse gas reduction targets. In 2017, the country registered a substantial increase of 12.8 per cent – the largest increase across all the European Union. \nMalta’s inadequate results have cost the country tens of thousands, the Times of Malta has reported. Last year, the paper revealed the government had to resort to “flexibility measures” by funding a green project in Bulgaria to buy off extra emissions-reduction points.\nThe move seeks to mitigate for the poor results Malta received in a European Commission progress report. The report found the country failed to reach emission reduction targets every year since 2013 and that it was unlikely to reach goals set for 2020.\nPrime Minister Joseph Muscat conceded vehicle emissions were the biggest source of pollution in Malta.\nThe government will be seeking to set a cut-off date beyond which all new car purchases would have to be electric or similar, he said. Dr Muscat has also outlined his vision for Gozo to be the first island to shift to electric cars.\nMalta was one of eight countries to register an increase in CO2 emissions.\nPN reaction\nIn a reaction, the Nationalist Party said the Eurostat data confirmed how the Maltese government had no plan to tackle Malta’s environmental challenges and was ignoring the fact that poor air quality was detrimental to health.Stephen Spiteri, opposition spokesman for health, said deaths from respiratory disease had risen.\nOne of the reasons for poor air quality was emissions from cars, which were continuing to increase because the population had risen sharply without a proper plan.\nThe Eurostat data needed to be seen in the context of the latest report by the European Environment Agency that showed Malta having the fourth worse air quality and a 12% increase of carbon dioxide in three years.\nSome 600 people are dying every year as a result of respiratory disease, he said.\nEP elections candidate Roselyn Borg Knight said this was another blow after Euronews described Malta as 'The Dirty Man of Europe' because of its dismal waste recycling rate.", "comment_count": 116, "id": 2652}, {"keywords": "", "author": "", "article_body": "Only two of the 16 unused quarries that could take inert waste are being used as landfills, Partit Demokratika leader Godfrey Farrugia complained.\nHe said that although most of the sites were leased public land, their operators were resisting their use as landfills.\n“Government has the legal power to stop quarry operating licences and to withdraw agreements on the leases. Our national interest should dictate the way forward, more so if sites are public property,” he said.\nRead: Permits issued for 10 quarries to ease pressure on construction waste\nThe statement was part of a wider one which called on the government to curb its “runaway development policy”, saying that this was pushing Malta into dire straits.\n“Sustainable construction calls for the re-use of existing parts of buildings and materials; the separation of construction waste and its recycling even into another form; and the re-development or rehabilitation of unused buildings. Malta’s carrying capacity has been reached. These concepts decrease the burden on landfills,” MEP candidate Anthony Buttigieg added.", "comment_count": 5, "id": 2653}, {"keywords": "", "author": "Claire Caruana", "article_body": "The amount spent on fire protection per inhabitant in Malta is the lowest in Europe, it has emerged.\nOfficial figures published by the EU’s statistics office, Eurostat, show that the government spends a mere €17 per person on fire protection, or just over €8 million in 2017.\nGovernment expenditure on fire protection services across the EU’s 28 member states stood at €31.2 billion. Almost 300,000 people were employed as firefighters.\nOverall, the public expenditure on fire protection services remained stable as a percentage of governments’ total bill since figures started being recorded in 2004.\nFire protection government expenditure per inhabitant was above €100 in four EU member states in the period under review: Luxembourg (€113), Finland (€106), the Netherlands (€104) and Sweden (€100), closely followed by Germany (€96) and France (€93).\nBulgaria, Croatia and Portugal, Poland, Romania and Slovakia were among the member states that spent the lowest amount, none exceeding the €30 per inhabitant mark.\nThe ratio of government fire protection spend to total expenditure in Malta was also among the lowest, with only Denmark doing worse. According to Eurostat, the rate stood at 0.2 per cent in Malta, rising to 0.3 per cent in Portugal, Luxembourg, Ireland and Austria, 0.7 per cent in Latvia, Lithuania and Romania, and 0.8 per cent in Bulgaria.", "comment_count": 10, "id": 2654}, {"keywords": "", "author": "Keith Micallef", "article_body": "Auctions of impounded cars organised by Transport Malta have been an abysmal failure as only 10 out of more than 300 vehicles were sold over the last two years, the Times of Malta was told.\nIndustry sources explained that, more often than not, the vehicles on offer were “overpriced” as the buyer also had to foot the bill for any pending fines and registration tax.\n“In 2017, I attended two auctions, which were utter flops. Out of roughly 30 cars on offer each time, only two to four were sold,” a car enthusiast said.\n“One of the vehicles on offer was a left-hand drive Porsche but its starting price of €6,000 was prohibitive because apart from paying all seizure, towing and storage costs, as well as the registration tax, the car needed extensive repairs,” he added.\nThe ‘unwanted’ cars end up being destroyed as Transport Malta does not have enough storage facilities.\nAccording to official figures, the regulator impounded 637 cars since 2017, which translates to almost one every day.\n“These cars are seized following reports or during patrols,” a Transport Malta spokesman said.\nSuch action was taken in cases when the owners failed to regularise their position by accumulating road licence arrears or whenever the cars posed a danger, especially those whose owner could not be traced, he added.\nOnce seized, the cars are taken to Transport Malta’s compound and their owner would still have the right to reclaim them once any pending registration tax (in case of foreign-registered cars), fines and penalties were settled.\nThis could explain why only 266 cars, or fewer than half of the vehicles seized since 2017, were reclaimed.\nAs for the rest of the cars, Transport Malta said 321 vehicles went under the hammer, with just 10 being sold. The others were destroyed by authorised so-called ‘treatment facilities’. Another 50 cars at the transport watchdog’s compound are due to be auctioned or else were the subject of legal proceedings.\nTransport Malta’s spokesman pointed out that, since 2017, the regulator had increased the number of enforcement officers to crack down on unauthorised cars on Maltese roads.\nNevertheless, tracing the owner of a foreign-registered car, who may still be of Maltese nationality, remains a long shot for the authorities, including the police.\nThis is proving to be very frustrating, especially for law-abiding citizens, for example when applying for a temporary no-parking permit in front of a residence and a vehicle happens to be parked there.\nOne such case was recently reported in Gżira, when a resident vented her anger on Facebook after finding herself unable to carry out works, despite having all the necessary permits in hand for a crane to be used.\nThe obstacle, she claimed, arose because of a foreign-registered car with an expired road licence that was blocking the front of her residence. After contacting the police, she was told she would have to wait several days for the car to be removed.", "comment_count": 91, "id": 2655}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Hundreds of South Asian migrants are taking advantage of a new employment registration system to find a job through a temporary work permit issued by Identity Malta, the Times of Malta is informed.\nSources, particularly in the catering and restaurants sector, said they have been approached by dozens of Nepalese and Pakistani citizens in the past months asking them for work.\n“Many are turning up outside our establishments on a daily basis asking us for work, particularly low-level, unskilled jobs. To our surprise, when we ask them whether they have a working permit they produce a piece of paper issued by Identity Malta showing they were granted a temporary work permit,” a Gżira restaurant owner said.\nAn entrepreneur who manages a small hotel in St Paul’s Bay said he had been inundated by Nepalese citizens asking if they could serve in the kitchen or do some form of cleaning work.\nThe Times of Malta has seen copies of certificates issued by Identity Malta clearing the way for those holding a visa, particularly of Nepalese and Pakistani origin, to seek work in Malta on a temporary basis.\nMost of the third country nationals in possession of such documents obtained visas from the Maltese High Commission in New Delhi, the sources said.\nThey expressed concern the system could have been “abused”, even fearing a racket might well be involved in the issue of such temporary work permits.\nThe sources added that the system might be exploited for third country nationals to use Malta as their first entry point to the EU, then proceeding to other countries through the Schengen system.\nChange in system\nThe Times of Malta was told that, until some time ago, third country nationals wishing to work in Malta had to follow a thorough application process whereby only those who had already acquired a job could apply.\nFurthermore, they would only be able to travel to Malta once the permit was issued.\n#TimesTalk: 'Blaming foreigners for our problems is hypocritical'\nThe system was changed last year in a bid to facilitate the hiring of non-EU citizens. As a result, the sources noted, prospective foreign workers could travel to Malta even before a full permit was issued, on the basis of the temporary permit.\nThe third country nationals would then seek work in the period between their arrival and the eventual issue of a permanent employment permit, the sources noted.\nA spokesman for Identity Malta confirmed that “a temporary authorisation to work document has been introduced in 2018”.\nHowever, he made it clear “this was not an alternative to a single work permit but part of a process to grant work and residence authorisation to third country nationals once the necessary verifications and assessments were carried out by Identity Malta, Jobs Plus and the immigration police”.\nThe spokesman warned that if the temporary work permit were misused, the eventual single permit would be revoked.\nFuelled by an expanding economy, Malta has experienced a sharp rise in the number of foreign workers over the past years. Eurostat figures show that the number of foreign residents on the island more than doubled between 2013 and 2017.\nThird country nationals, who are only allowed to reside in Malta for work purposes or if they possess refugee and humanitarian status, were given more than 10,500 work permits in 2017, the last year for which data is available. This contrasted sharply with the figure for 2013, when just over 5,000 had been granted.\nThe government has insisted on the need for more foreign workers to sustain economic growth in the coming years.\nResidence permits issued\n\n\n\n \n2013\n2014\n2015\n2016\n2017\n\n\nEU citizens\n3,902\n5,531\n7,209\n7,120\n9,317\n\n\nThird country nationals\n5,078\n6,981\n7,939\n8,302\n10,675\n\n\nTotal \n10,897\n14,454\n16,936\n17,051\n21,676\n\n\n\nNote: Total includes permits issued for those applying while temporarily in Malta.", "comment_count": 132, "id": 2656}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Wednesday's newspapers:\nThe Times of Malta reports that there are hundreds of South East Asians seeking permits to work on the island. It also says that the Speaker of the House was unable to verify the declarations made by Opposition leader Adrian Delia with regards to his banking position.\nThe Malta Independent also leads with a story linked to the ministerial declarations of assets, noting that property-rich Gozo Minister Anton Refalo has also not declared any savings or current account. It also reports that the architect behind a bid to build a racetrack in Ħal-Far wants to ensure that the site is not earmarked for industrial use before he gets a chance to finalise his project.\nIn-Nazzjon picks up on the electoral campaign and its main story warns that a vote for 'Socialist' MEPs would be a vote against the island's interests. It also says that the European Commission report on Malta was a \"slap in the face\".\nMalta Today quotes Environment Minister Jose Herrera pledging that no land reclamation zones would be used to build skyscrapers and hotels. It also says that a plot originally earmarked for an extension to the Freeport would be used for woodland and a picnic araea.\nMore soon.", "comment_count": 0, "id": 2657}, {"keywords": "Media", "author": "", "article_body": "Herman Grech has been appointed as Times of Malta’s new editor-in-chief as Malta’s biggest news organisation undergoes an editorial revamp.\nWith effect from June 17, he will assume editorial control of all media platforms and will also sit on Allied Group's management board, following approval by the company’s board of directors on Tuesday.\nBertrand Borg was appointed Times of Malta online editor, while Mark Wood will be responsible for the seven-day operation of the newspaper, replacing Ray Bugeja, who will be retiring.\nAllied Newspapers Limited managing director Michel Rizzo said: “Herman, Bertrand and Mark have very strong roots in Times of Malta’s journalistic tradition and all are very passionate about quality news. I am delighted with the three appointments and I have no doubt they will do very well in their new roles. I have full confidence in their ability to handle these challenging times as we strive to take the much-respected Times of Malta brand further into the 21st century.”We have the best integrated newsroom in Malta and the latest appointments will go a long way in making the team stronger- Michel Rizzo\nHe said the media industry, both locally and abroad, is at a pivotal stage and a bold approach is necessary for news outlets to thrive.\n“We have the best integrated newsroom in Malta and the latest appointments will go a long way in making the team stronger. I would also like to take this opportunity to thank our outgoing print editor, Ray Bugeja, who has given his heart and soul to the Times of Malta. Ray will be sorely missed but will continue to serve the organisation in a part-time editorial advisory capacity.”\nWho are the three editors?\nHerman Grech joined Times of Malta in 1997, covering most of the major political and social milestones, including EU membership. He served as deputy editor of The Sunday Times (2007-2012), head of media (2012-2015) and online editor (2015-2018). Under his watch, the Times of Malta website has seen major growth in readership, especially in the 25-34 age segment.\nFive-times winner of the national journalism award, Herman conceived and produces the debate programme #TimesTalk, was behind the Times of Malta public debates, and has regularly contributed to media giants like BBC World, Deutsche Welle, DPA and The Economist. He is also a theatre director and the author and producer of the critically-acclaimed play De-terminated.\nBertrand Borg joined the Times of Malta in 2010, working as a reporter and senior journalist before being appointed online deputy editor. In that role, he introduced analytics into the newsroom and has encouraged data-informed decision-making. He also worked at Melbourne’s The Age, where he filled a number of online positions and worked on its award-winning news app.\nPrior to joining Times of Malta, Bertrand spent several years working as a human rights educator in Europe and sub-Saharan Africa. He graduated from the Mediterranean Academy of Diplomatic Studies.Ray Bugeja\nMark Wood entered journalism in 1992 after graduating in social work administration from the University of Malta. He first worked as a reporter with The Malta Independent and then as night reporter with the Times of Malta.\nSince 2003, he has occupied a number of senior editorial positions at Allied Newspapers Limited, including night editor and deputy editor of the Times of Malta, before taking over as editor of The Sunday Times of Malta three years ago. Mark is married and has one son.\nRay Bugeja will be retiring after 46 years in the business. He started his journalism career as a reporter in 1973 with Il-Ħajja, joining Times of Malta in 1980 before being appointed as one of the newspaper's youngest editors.\nHe joined Standard Publications in 1993 as editor of The Independent on Sunday before rejoining Times of Malta in 1998, and serving again as print editor from 2003.", "comment_count": 32, "id": 2658}, {"keywords": "", "author": "Ramona Depares", "article_body": "A group of Gozitan farmers and livestock breeders risk being forced to shut down their operations due to increasing expenses and an uneven playing field.\nSix farmers spoke on how the number of people working in the sector has diminished drastically, and that those who remain in business only do so because they have invested too much money to afford to pack it in now.\n“Farming is in my blood, my family is made up of livestock breeders. It has always been my wish to continue the family tradition but I wanted to do it properly, aided by technology and maintaining modern standards,” one young chicken farmer said.\nEncouraged by what he described as “promises that the farming sector would be given the attention it so desperately needed by the authorities”, he decided to take up a funding scheme that supports investment in cost-effective and environmentally efficient systems, in order to set up what he believed would be a worthy enterprise.\n“Like most funding schemes, this one does not finance 100 per cent of the capital outlay required, so I – and many others like me – had to take out a substantial bank loan that runs into hundreds of thousands. We were all led to believe that the investment would be recouped and that the farming industry was going to be revived, but it turns out that the opposite was true,” he said, visibly worried.\nInstead of seeing the improvements he was promised, he added, these past two years have actually seen a deterioration within the local market. Some periods were so dismal that, for over three months, he was even forced to halt production.\n“The market always fluctuates. It is to be expected. But not to this extent. At one point my middleman was selling nothing but imported chickens to his customers. He told me bluntly that he couldn’t guarantee any orders. I had to stop breeding for a while,” he explained.\nAsked why he decided to resume business, given that the sector has become so unreliable, his answer was dry and to the point: “Bank loans”.\n“At the moment we do have some orders trickling in. Before shutting down for good, I need to pay off as much as I can from the loan that I took in order to cover the expenses that funding didn’t. It’s a good thing that I am also doing another job, now, or I don’t know how I would be feeding my family. It is very rare that I manage to take money from farming back home,” he said.\nHis colleague, a cow breeder, nodded, his frustration at the situation visible on his face. Perhaps surprisingly, he added that while imports remained a major problem, it is the fact that the playing field is not a level one that is killing the local industry.\n“Maltese farmers and breeders have to work within a very strict framework of EU regulations, which would be fine if these were also applied to everyone else. But they aren’t. So here we are, spending money to make sure we work by the rules while others sail in with imported produce however they please,” he said.\nAsked what he meant by this, the farmer – another family man in his 30s – gave me a whole list of grievances where, he claimed, different standards are applied to Maltese and foreign farmers.\nThose who play by the rules are punished while those who bend them get richer\n“It’s a case of two weights and two measures. We know for a fact that foreign meats are imported to Malta in one container – pork, beef, chicken and whatever, all chucked together. An importer doesn’t even need to use multiple freezer trucks, so that’s one expense off the list. On the other hand, when Maltese farmers import livestock, we need to ensure there is separate transportation for every species. How is this a level playing field?” he asked.\nThe list continues. He mentions chicken imported from Italy that is repackaged with a ‘product of Malta’ stamp; produce originating in non-EU countries but imported with an Italian stamp; non-EU produce that is untested for Class 1 pesticides...\n“Of course, they are in a position to sell produce at a much cheaper price. We cannot export our produce, like the bigger countries do, so we have to rely on the local market. But we are not even protecting that. I can tell you that the pork that is being imported from Italy crosses over to Malta stacked up in normal vans. Not in freezer vans,” he said, adding that in the case of Maltese farmers, controls were applied “every step of the way”.\n“The model that we follow is fantastic. It comes with the highest standards of equipment and hygiene. At first, I was kind of excited about it. I mean, which farmer doesn’t want to be at the cutting edge of technology? But financially, it just isn’t working out. Our market is too small for us to function within a general EU framework,” he explained.\nHe believes that the Italian market remains the biggest competitor, with farmers there in a position to sell chicken meat at €1.80 per kilo.\n“We cannot sell our meat that cheaply. All the raw materials we need are more expensive in Malta, starting with fodder. We even pay more for that in Gozo than they do in Malta, let alone in Italy. If you factor in all the other costs we face – especially transportation – the figures speak for themselves. Many who are not involved in the sector accuse us of always bringing forth the same complaints, but since they have not been resolved, what else can we do?” he asked.\nA third farmer, who focuses on fruit and vegetables, expressed dismay at the way the sector is “deemed unimportant by all administrations, whichever party is in government”.\n“What happens when consumption of local produce falls from 30 per cent to zero? Prices will suddenly spike up, that’s what will happen. People don’t realise that the prices of imported foodstuffs are so low only because they need to beat local competition. As soon as there is none of that, suddenly your tomatoes and your chicken breast will become much more expensive. Is anyone planning for this eventuality?” he asked.\nThe likelihood of this happening, he continued, is not remote, given that very few youngsters show an interest in taking up farming.\n“Why would a 20-year-old pick a job where he’s expected to be on call at all hours, be up at the crack of dawn toiling the fields and generally have no life? Well, not unless there is a sensible structure to count on and the possibility of making a decent living, anyway.”\nThere is one thing that the farmers I speak to are all agreed upon: the system needs to change from the grassroots. Their vision is for a functioning farmers’ association to be set up; a grading station to be established; a direct selling system to be implemented in a regulated manner.\n“As it is, everything is too scattered. The regulations are there, but they are impractical and applied haphazardly,” yet another one complained, saying that many seemed to believe that thanks to EU funding farmers had “become rich overnight”, but that this was not the case.\nA pig farmer nodded and chimed in with: “The money we got was to help us partially fund new equipment. We all had to fork out a significant amount of capital, added to that, and we have seen no return at all from our investment. I used to kill 22 pigs a week, I now kill five.”\nAsked whether they see a solution, the farmers all give me the same answer – if the authorities really want to help the local industry, the only solution is to listen to what they really need and to introduce a measure of state aid to the sector.\n“Meantime, those who play by the rules are punished, while those who bend the rules get richer,” the pig-farmer concluded, the bitterness in his voice ringing loud.\nEating local\nThis is the fifth in a series of articles in The Sunday Times of Malta looking at different aspects of the local food industry in a bid to raise more awareness of this crucial, yet often neglected, sector.", "comment_count": 45, "id": 2659}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Another year and, it seems, another round of sewage problems at the popular Ras il-Ħobż dive spot in Gozo.\nFootage taken by divers last week shows murky discharge flowing freely into the sea from an underwater pipe, the latest in a series of incidents dating back years.\nSimilar problems at the coastal area beside Mġarr ix-Xini, and close to a sewage treatment plant, have been reported by divers since at least 2013, with no enduring solution yet found.\nGħajnsielem deputy mayor Kevin Cauchi, who has repeatedly flagged issues at the site, yesterday called on the authorities to address the “unacceptable situation” and put long-term solutions in place.\n“Even if the outflow has been treated, it is not a pleasant scene in a dive zone, especially when divers come from abroad and spend a lot of money specifically to visit sites like this,” Mr Cauchi told the Times of Malta.\nHe said the authorities had made progress in addressing a related issue at the same site, where clogged manholes were leading to sewage outflow over the land, but had so far failed to tackle the underwater situation.\nThe Water Services Corporation could not be reached for comment yesterday but a spokesman had said the footage was being investigated and that a durable solution was being sought.\nThe corporation also said it was working to improve the technology used to purify the water exiting the pipe.\nThe corporation had last year issued a tender to tackle damage in the undersea outfall, which discharges treated sewage effluent from the Gozo sewage treatment plant into the sea.\nThe end part of the pipeline, which extends 140 metres from the shore and down to a maximum depth of 80 metres, had been completely blocked off over the years.\nThe WSC said the damage had been caused by “improper use of the urban sewer system”, which was impairing the capacity of both the network and treatment plants.\nSimilar sewage incidents have also been reported numerous times at nearby Xatt l-Aħmar, which the authorities also pinned on illegal discharges into the system, blocking or damaging the infrastructure.", "comment_count": 12, "id": 2660}, {"keywords": "", "author": "", "article_body": "Upgrades to the reverse osmosis plants will produce more water using less electricity, Water Management Minister Joe Mizzi told parliament on Tuesday. This would reduce groundwater extraction by billions of litres and bring the proportion of purified water in Maltese taps to 70 per cent, with only the remaining 30 per cent coming from boreholes.\nMr Mizzi explained during a debate on the financial estimates for the Water Services Corporation that this would act to preserve Malta's aquifers while improving the taste of tap water.\nHe said the modernisation of the Pembroke plant, Malta’s largest, would double the amount of water produced there while saving almost €500,000 a year in energy costs.\nFurthermore, a new reverse osmosis plant at Ħondoq ir-Rummien, Gozo, would give Gozo water independence and better quality.\nMr Mizzi said the former government's lack of vision meant that the Gozo sewage treatment plant was pumping tonnes of untreated sewage into the sea. This plant had been refurbished and was functioning at the best levels it had ever functioned.\nOpposition MP David Agius criticised the fact that the WSC Annual Report had not been tabled in advance of the debate, arguing that it was impossible to argue concretely without access to this document.\nHe asked whether resurfacing works in Birżebbuġa, Marsascala, and elsewhere were complemented by works to replace the ageing water infrastructure. Otherwise, he said, “it would be like re-tiling a bathroom without replacing the pipes.” He also asked the minister to elaborate on how quickly faulty water meters were being replaced, and to provide details on how the aquifer was being managed.\nMr Agius said explanations needed to be given as to how electricity and water bills were being calculated. It had been four months since a review of the system by which these bills were calculated had been promised by the government, he said.\nHe questioned why the minister was dragging his feet on this reform, arguing that, if the rate according to which water bills were computed depended on annual consumption, there should be a clear indication of the start and end of the base year for this computation. He also hinted at discrimination within WSC, even between Labourites of different inclinations.\nReplying, Mr Mizzi insisted that bills were being calculated in the same way that they had been calculated during PN administrations, adding that a Nationalist government had changed the legal notice regulating the calculations of these bills to allow meter readings to take place every two months.\nPromising that the WSC Annual Report would be published shortly, he pointed out that this report had not been published in time for the estimates debate between 2011 and 2013, but that this had not hindered his ability to debate concretely.\nResponding to further points raised by Opposition MP Godfrey Farrugia, Mr Mizzi stated that systems would be in place to ensure that the new reverse osmosis plant in Ħondoq would be able to function even if there was a power cut. \nEarlier during the debate, Dr Farrugia had argued that Malta’s water supply was vulnerable due to the fact that the provision of water in Malta and Gozo was dependent on energy generated by an infrastructure which was owned by foreign nationals.\nDr Farrugia had also made reference to Malta’s overdependence on water bottled in plastic, which leaked microfilaments.\nHe called on authorities to ensure that new buildings had wells to enable rainwater capture, arguing that there was a lack of national preparedness in case of a crisis affecting Malta’s water supply. Malta, he warned, could only store two days’ supply of water at any given time.\nConcluding, Mr Mizzi said that the WSC had once again made a profit and had continued to reduce the debt which had been left by previous administrations.", "comment_count": 4, "id": 2661}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A €2 million facility tailored for the needs of residents aged under 60 will be built at the St Vincent de Paule residence. \nThe centre, Narċis, is aimed at younger residents - primarily people with a disability - who have so far been living with elderly residents at the main facility. \nThe project will include the development of a specialised multi-disciplinary programme tailored to younger patients' physical and psychological needs, and is being put forward as a step towards residents reintegration in society. \nThere are currently some younger 16 residents at St Vincent De Paule.\n\"The ultimate goal is for every person to be living in their own home in their community,\" Prime Minister Joseph Muscat said while unveiling the project on Tuesday. \n\"This should not be seen as a final destination or just another ward at St Vincent de Paule, but as a point of transition for people who have spent years living in a facility that was not directly aimed at them.\n\"We also recognise that some people, because of their needs, will be living here for the rest of their lives, and so it is important that the centre feels less like an institution and more like a home.\"\nThe setting-up of the centre follows a study carried out with stakeholders including Mater Dei Hospital and the national disability commission, which identified the need for a specialised program for physical and social rehab.\nResidents will have access to medical and psychological professionals as well as family therapy and social capacity building, and a transition period focusing on inclusion and independent living. \nServices will also be available on an outpatient basis.", "comment_count": 1, "id": 2662}, {"keywords": "", "author": "", "article_body": "The government is to plant 8,000 trees in a site perviously earmarked for the expansion of the freeport in what will be Malta's biggest afforestation project to date. \nTourism Minister Konrad Mizzi said an application to extend the freeport inward at Bengħajsa, limits of Birżebbuġa had been withdrawn, making way for the \"massive\" afforestation project.\nInstead, the freeport will now continue to grow towards the sea, away from people.\n\"The previous administration had earmarked this land for an extension of the Freeport terminals, effectively turning it into a container terminal,\" Dr Mizzi said.\nInstead, part of the land behind the freeport will be developed into a park. Another area will be developed as a camping site, Environment Minister Jose' Herrera said.\n\nIn total, 87 tumoli of land will be used and 8,000 endemic trees will be planted, he said. Maintenance for the camping site will be entrusted to an as yet undetermined NGO, Dr Herrera said.\nThe €400,000 afforestation project will also include the renovation of an underground bunker dating back to the British rule. \nThe inconvenience the Freeport creates on residents of Birżebbuġa had to be addressed, the Environment Minister said.  ", "comment_count": 41, "id": 2663}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Four men have been found not guilty of defrauding and exploiting a group of Pakistani nurses employed at Mater Dei Hospital.\nRaymond Bonavia, David Athwal, Frankie Agius and Stephen James Grech were accused of involvement in a criminal conspiracy to exploit and defraud the nurses, even through violence and harassment, as well as breaching employment laws.\nIt all began in 2011 when the Health Ministry issued a call for applications for the engagement of nurses at Mater Dei.\nThe call was open to both EU and third country nationals. A number of Pakistani nurses offered their services through a recruitment agency in their homeland, Deluxe Company Ltd.\nA Maltese company, Chrism Services Ltd, represented by Bonavia and Athwal, was handed a power of attorney to facilitate the transfer of the successful candidates upon completion of the selection process which involved two Skype interviews organized by the Health Ministry.\nThe chosen candidates eventually moved to Malta where they signed a second agreement with the local agency which also offered them accommodation against payment, as well as mobile, internet and television services.\nEach nurse was to fork out €3,000, paid out of their wages, a further €120 monthly rental payment and a monthly €85 management fee from the 13th month till the termination of employment.\nA group of nurses complained with the local authorities that they were being charged hefty sums of money by the persons involved in their recruitment.\nA nurse who felt his contract lacked sufficient formalities spoke to a friend who  set up an appointment with the Police Commissioner, thereby sparking off investigations into the suspect racket.\nAnother nurse allegedly told investigators that Mr Athwal had told them that the money was intended to bribe officials at the visa, police and health departments to obtain the necessary work documents.\nHowever, in the course of criminal proceedings against all four suspects, it was proved that the recruitment process had been a legitimate one.\nMeanwhile, the agency contract with Chrism Services Ltd had since been terminated and the nurses were refunded relative payments made.\nIn acquitting the accused of fraud and engaging in a criminal conspiracy, Magistrate Charmaine Galea concluded that it could not “decipher any formal or material element of fraud,” observing that it had been one nurse who had raised issues about the contract since the contract had not been signed before a notary and under the agency’s letterhead.\nThere was no proof of violence, nor any conduct amounting to harassment, the court said, noting that the nurses had all agreed to the terms of the contract before arriving in Malta.\nAs for the charge of criminal organization, there was “absolutely no proof” of this, the court declared, adding that the accusation of conspiracy also did “not hold water.”\nRegarding the charge of unlawful deductions from wages, the court observed that penalties were only applicable to employers. The relative legislation made no reference to intermediaries; a possible lacuna which effectively meant that the court could not sanction the accused in this regard.\nOn the basis of all evidence put forward, the court acquitted all four of the charges, finding Mr Bonavia and Mr Athwal guilty of breaching the Employment and Training Services Act by running an employment business without a licence and fining them each €200.\nLawyer Joseph Giglio was defence counsel to all four accused.", "comment_count": 3, "id": 2664}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The St Julian’s local council will forge ahead with its application before the Planning Authority, despite a new Infrastructure Malta plan for the village square. \nMayor Guido Dalli said that while the council’s proposal was meant to return the village square back to the people, with lots of open spaces, the Infrastructure Malta project will divert traffic into the square. \nThe roads agency said the council’s plans would have created more traffic and congestion so it decided to go ahead with its own project, which it hopes will improve traffic flow. \nBut Mr Dalli insisted that the project as the roads agency wanted it will be diverting traffic into the square rather than away from it.\n“We tried to do something which would give St Julian’s a proper square, something it does not have. We wanted to have an open space where people can relax and where visitors can take photos. What we have at the moment is an eyesore and it will remain an eyesore with the project Infrastructure Malta is doing here,” Mr Dalli said. \nDrivers would be diverted into the square around the Sacred Heart roundabout, one side of which will become a parking area for nine cars, mostly police vehicles for the St Julian’s police station.\nDrivers coming from Balluta will have to turn down and go around the Sacred Heart monument if they want to keep driving up towards Paceville.\nLocal council did not present any information about its proposal\nThe road near Tex Mex will become one-way going down while the parking areas in front of the St Julian’s police station and adjacent restaurants will be removed.\nAccording to Mr Dalli, this new traffic system will create more congestion, especially at intersections. He is also concerned that cars parked in the few parking spaces will need to reverse onto oncoming traffic to get out of their parking bays. \nA spokesman for Infrastructure Malta has insisted that the council had been asked to attend a meeting to discuss the junction upgrade plans required to ease congestion difficulties in this part of St Julian’s.\n“During this meeting, the local council did not present any information about its proposal to close this junction and part of St George’s Road but simply rejected Infrastructure Malta’s plans and left the meeting,” he said.\n“The ongoing junction upgrade works are essential to reduce travel time delays, related congestion pollution and improve road users’ safety in Spinola and several other nearby areas of St Julian’s and Sliema.” \nHe said the agency’s road planners explained to the council and its architect that its proposal will create increased commute delays and more air and noise pollution for residents and visitors in this area. \n“While the creation of new public open spaces in any locality is a commendable initiative, this should not be planned in isolation, without taking into consideration all related factors such as the area’s transport systems and other social, infrastructural, economic and environmental requirements,” he added.", "comment_count": 13, "id": 2665}, {"keywords": "", "author": "", "article_body": "A fire engine was called out in Victoria, Gozo to fill road barriers with water to stop  them from being blown away by the wind. The Civil Protection Department is now seeking payment for the water used, according to information given in Parliament.\nChris Said, shadow minister for Gozo, asked Home Affairs Minister Michael Farrugia why a fire engine was in Pjazza San Franġisk for a considerable time late on April 22.\nThe minister said the Works Department had asked the Civil Protection Department to fill 60 plastic jersey barriers with water to stop them from being blown away, endangering passers-by.\nThe Civil Protection Department has since asked the Works Department in Gozo to compensate it for the water used.  ", "comment_count": 11, "id": 2666}, {"keywords": "", "author": "Jacob Borg", "article_body": "Speaker of the House Anġlu Farrugia on Tuesday said he had no authority to verify if Opposition leader Adrian Delia had any bank deposits that were not listed in his financial declaration to parliament.\nDr Delia asked the Speaker on Monday to verify his financial declaration after The Times of Malta flagged the lack of current or savings account balances in the declaration.\nThe Speaker said he could not investigate whether any such balances were potentially set off against other balances.\nDr Delia declared over €670,000 in loans.\nThe Parliament declaration clearly states that MPs need to include information about bank deposits and any other financial interests. The MPs’ code of ethics also features such provisions.\nA spokesman for Dr Delia told The Times of Malta that Dr Delia’s declaration did not mean the Opposition leader did not have a savings or current account.\n“There is no such question in the declaration schedules. His parliamentary wage goes into a current account,” the spokesman said.\nThe Speaker said it was the Commissioner for Standards who had the power to verify MPs’ declarations.\nDr Farrugia said that on a prime facie basis, the Opposition leader had provided all the details required in the declaration.\nHe said anyone could pass on these declarations for verification by the Commissioner.\nSpeaking to Times of Malta prior to the Speaker’s ruling, Standards Commissioner George Hyzler said he had a duty to examine, and if necessary verify, the declarations made by MPs.\nWhile declining to comment on specific cases, Dr Hyzler said he had the authority to issue recommendations with regard to any person who either failed to make the financial declaration, or made an incorrect declaration in a manner which materially distorted the purpose of such declarations.\nAsked if the law allowed him to summon witnesses such as bank officials, the Standards Commissioner said the law did not set any limits in this regard.\n“As you may appreciate this will be the first time such an exercise will be carried out and I shall decide how best to carry out my responsibility after having had the opportunity of examining the declarations that I have already requested be passed on to me”, Dr Hyzler said.", "comment_count": 21, "id": 2667}, {"keywords": "", "author": "", "article_body": "The government is seeking a contractor who would be able to deploy a vessel within three hours to clear up flotsam and slime reported around the coast.\nThe service would have to cover not only ports, internal waters and bays but also coastal waters up to one nautical mile offshore. The tender, issued by the Contracts Department, says that the contractor would also have to provide the service on weekends and public holidays and at any time of day or night, as required.\nThe call for offers envisages that there would be a minimum of two people per vessel, with the appropriate vessels, equipment and different materials (disposable or otherwise) depending on the type of slime or flotsam. The vessels should not be smaller than 7m and should have an open deck which can be used to transport flotsam and possibly bulky items.\nThe contractor would also need to dispose of the waste collected, in collaboration with Wasteserv.\nThe service will cover the period from June 1 to October 31 for 2019 and 2020, meaning it will have to be offered within just 11 days of the May 20 closing date.\nThe islands have been plagued by reports of slime over the past years, with the feed used in tuna pens as the main culprit.\nWith regards to flotsam, a number of SeaBins have been deployed in marinas to gather surface material – but the scope of this contract goes well beyond the few kilograms a day that these can scoop up.", "comment_count": 14, "id": 2668}, {"keywords": "", "author": "Jacob Borg", "article_body": "Former PBS CEO John Bundy was given the go-ahead by the company's board to seek the lease of a new car fleet, former board director Frank Portelli told an Industrial Tribunal on Tuesday.\nMr Bundy is suing PBS after he was dismissed following accusations that he entered into a €500,000 car lease deal with Burmarrad Commercials without the board’s approval.\nThe lease deal for 14 vehicles includes Mr Bundy’s own car.\nTaking to the witness stand, Dr Portelli said the former CEO had flagged the fact that the company’s car fleet was ageing. The board gave Mr Bundy the go-ahead to seek a new lease deal in 2016, soon after his appointment that August.\nThe former PBS board director told the tribunal he had actually abstained in the board vote confirming Mr Bundy’s appointment, as he was not happy with the way his predecessor Anton Attard had been replaced overnight.\nMr Attard’s sudden removal meant PBS was contractually obliged to compensate him.\nREAD - ‘I don’t give a damn about the board’- John Bundy\nThe former PBS director said Mr Bundy would update the board from time-to-time about which companies he was seeking quotes from to replace the car fleet.\nAsked under cross-examination if these instances were minuted, Dr Portelli said the board secretary was very meticulous in his minute taking.\nPrior to Dr Portelli’s testimony, a representative from Burmarrad Commercials said negotiations with Mr Bundy always took place in the presence of other management officials from PBS.\nCorrespondence about the lease was also exchanged with multiple PBS management officials.\nAsked under cross-examination if he was aware Mr Bundy has no authority to sign the deal, the Burmarrad Commercials representative said this was never communicated to him by PBS.\nThe representative said Burmarrad Commercials was aware PBS was shopping around for quotes, and his company’s was the most competitive.\nMr Bundy has denied any wrongdoing in the deal.\nHe was booted out as PBS’ CEO after a no-confidence vote by the board of directors in November 2017.", "comment_count": 26, "id": 2669}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Tourism Minster Konrad Mizzi has added two new directors to the board of the national airline while refusing to explain the doubling of directors’ fees at Air Malta in just a year.\nFollowing the last annual general meeting, Dr Mizzi, representing the government as shareholder, nominated Labour election candidate Ian Castaldi Paris and his own permanent secretary, Ronald Mizzi to the board of Air Malta.\nMeanwhile, Dr Mizzi has so far failed to explain how the directors’ fees indicated in the latest set of accounts approved by the annual general meeting, have more than doubled, from €53,000 paid at the end of March 2017 to €113,000 by March 2018.\nThe two new directors, who have no experience in the aviation industry, join another eight on the Air Malta board, boosting its composition to 10 non- executive members.\nDr Castaldi Paris, a notary by profession and a former Nationalist Party mayor who had unsuccessfully contested a post in the PN’s pre-2013 administration, contested the last election on the Labour ticket but was not elected.\nApart from his recent directorship on Air Malta, Dr Castaldi Paris was also made chairman of Identity Malta, a government agency responsible for the issue of passports.\nNew appointees have no experience in the aviation industry\nRonald Mizzi, who hails from Żabbar - Dr Mizzi’s political district, was a junior civil servant until 2013. \nSoon after Labour was returned to power, Mr Mizzi was made permanent secretary at Dr Mizzi’s various ministries.\nAsked last month to explain why the airline has massively increased its directors’ fees, Dr Mizzi refused to reply. Reminders sent to his spokesman remained unanswered.\nAnnouncing the financial results for the year ending March 2018, Dr Mizzi declared an operational profit of €1.2 million, describing it as the company’s first positive results in two decades.\nThe airline’s results were boosted by one-time interventions, including injections from the sale of landing slots at London airports and a re-evaluation of property currently held by the airline.\nIn the report, the airline’s board forecasts another loss-making year in 2019 despite continued efforts to increase revenue and lower costs.", "comment_count": 29, "id": 2670}, {"keywords": "", "author": "", "article_body": "A woman who stole a bag containing €3,500 in cash from a partially blind shopkeeper in St Paul's Bay has been jailed for two years after failing to return the money.\nCarmela Cini, 46 of St Paul's Bay, admitted to having stolen the bag from Mounia Romano on February 5 last year.\nShe also admitted to having, a few days previously, also stolen cigarettes and other products worth €232 from the same shop.\nMagistrate Yana Micallef Stafrace in handing down the sentence, noted that the victim has sight problems, the accused has a 'colourful criminal record'  and she had failed to return the stolen cash despite having been given the opportunity to do so by the court.", "comment_count": 0, "id": 2671}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two jobless women who stole a tablet computer and an undisclosed amount of cash from a car parked in Sta Venera were handed a suspended sentence upon admitting the theft in court on Tuesday.\nMiriam Azzopardi, 40, from St Paul’s Bay and Rosette Borg, 40, from Birzebbuġa, were arraigned on the strength of CCTV footage. \nProsecuting inspectors Robert Vella and Matthew Galea explained how the images showed the women in the act of stealing the Samsung tablet and the cash from a parked Peugeot.\nMagistrate Neville Camilleri condemned them each to an 18-month jail term suspended for three years, after taking note of their early guilty plea, their cooperation with investigators and their relatively clean criminal record. \nLawyers Edward Gatt and Ishmael Psaila were counsel to Ms Azzopardi.\nLawyers Franco Debono and Marion Camilleri were counsel to Ms Borg.", "comment_count": 0, "id": 2672}, {"keywords": "", "author": "", "article_body": "Malta International Airport's passenger numbers grew by 10.5 per cent in April compared to the same month last year.\nA total of 653,100 passenger movements were recorded, along with 4,554 aircraft movements. As more passengers travelled through the terminal closer to Easter weekend, traffic peaked on April 18 with over 26,500 movements.\nMIA’s new summer schedule contributed to an increase of 6.3 per cent in seat capacity. Seat load factor gained 3.2 percentage points to stand at 83.3 per cent.\nThe airport’s top drivers of passenger traffic remained unchanged from the previous month, with the United Kingdom (+7.4 per cent) leading the way, followed by Italy (+6.8 per cent), Germany (+14.4 per cent), France (+14.5 per cent) and Spain (+13.5 per cent). ", "comment_count": 3, "id": 2673}, {"keywords": "", "author": "", "article_body": "The Office of the United Nations’ High Commissioner for Human Rights has expressed concern at how three teenagers who stand accused of leading an alleged hijack at sea are being handled.\nIn a statement on Tuesday, a spokesman described the charges the three suspects face as “exaggerated” and urged prosecutors to reconsider them.\nThe three accused – aged 15, 16 and 19 - have been charged with crimes amounting to terrorist activity.\nLast month, Times of Malta revealed they were being held at Corradino Correction Facility, a prison for adults. The two minors were subsequently moved to a prison for juvenile offenders.  \nThe El Hiblu 1 was taken over by Armed Forces of Malta personnel and brought to port late in March after its captain issued an alert saying the vessel had been hijacked by a group of migrants rescued at sea.\nAccording to accounts in court, some of the migrants brought aboard the vessel grew restless after discovering that the captain was taking them back to Libya.\nMany exhibited signs of torture, ill-treatment\nThe OHCHR also expressed alarm at the way in which the three were originally held in custody.\nRead: Teens ordered hijacked ship to 'go Malta', captain testifies\n“In spite of the fact that two of them are minors, all three of the accused were held in the high-security division of an adult prison after they were reportedly interrogated by the authorities without being appointed legal guardians or placed in the care of independent child protection officials, responsible for ensuring their best interests,” the OHCHR said.\n\nThe agency noted the difficult conditions many of the migrants aboard the El Hiblu 1 had escaped – “many were dehydrated and exhibited clear signs of torture and ill-treatment, including several children”. It urged Maltese authorities to take good care of them.\nLibya, it reiterated, was “very clearly” not a safe port with multiple, repeated accounts of indefinite detention, trafficking, starvation and beatings.\nAll three minors facing charges are due to appear in court on May 20.", "comment_count": 0, "id": 2674}, {"keywords": "", "author": "", "article_body": "A 40-year-old man was grievously injured when an iron tool fell on him while he was working at a construction site in Floriana on Tuesday.\nThe police said the accident happened in Triq il-Kapuċċini at 10am.\nThe victim, a Serbian national who lives in Msida, was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2675}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A trail of bloody handprints arching downwards towards the spot where a young Dutch woman had her last breath on a Santa Venera street, her neck a gaping wound, indicated she had clung to the wall after being knifed.\nThis graphic image reconstructing the final moments of Shannon Mak, the 30-year old gaming employee allegedly knifed to death by her Dutch colleague and former boyfriend Jelle Rijpma, 23, emerged as the murder compilation continued.\nTaking the witness stand, emergency physician Jonathan Joslin described the gruesome scene he saw when he had reached Triq il-Mastrudaxxi after answering a call for assistance on that early morning of August 3, 2018.\nVictim Shannon Mak\nThe young woman lay on the street, her back partly to the wall, between a parked vehicle and a garden wall upon which a trail of reddish handprints were clearly visible, forming an arch-like pattern right above the spot where the victim lay, her head in a pool of blood.\nAs Dr Joslin and fellow emergency doctor Michael Spiteri checked the victim, it immediately became evident that the woman had no pulse and was not breathing.\nRead: Murder suspect moved to flat days before ex's body was found nearby\nAn extensive wound was visible across her neck, exposing the trachea and causing catastrophic haemorrhage, which resulted in the pool of blood beneath her face where she lay on the ground, her clothes pulled up above her breasts, an ‘Evolution Gaming’ bracelet on her wrist.\n“It was what we refer to in Maltese as imħanxra,” Dr Joslin explained when describing the knife-inflicted injuries, adding how he had also taken note of the bloody handprints on the wall, possible evidence of those final moments when the victim had held on before slipping down.\nVictim's father weeps silently in court\nWhile the medical doctor described the scene, the victim’s father wept silently, as other family members, also gathered in the courtroom, sought to comfort him.\nShown images of the scene of crime, Dr Joslin confirmed, upon a question by parte civile lawyer Stefano Filletti, the position wherein the victim had been found by the emergency team.\nWhen the doctors had pronounced the woman “clinically dead,” they handed over the case to the forensic experts who took over once the victim was not “salvageable” through prime time emergency care.\nTwo police officers, among the team of four who had arrested the suspect later on during the day of the gruesome discovery, also testified in the compilation describing how they had gained access to the flatlet on Triq l-Istampaturi, metres away from the spot where the victim had been discovered, by means of a key handed to them by the landlady.\nUpon entering the residence, a garage transformed into a small apartment, they had come across the suspect lying on a sofa, half asleep.\nWhen the police ordered him to lie down on the floor, where he was handcuffed and given his legal rights in English, the man had offered no resistance, asked no questions, and remained calm all throughout the arrest until he was eventually taken away to the police headquarters for questioning.\n“He said nothing at all,” confirmed the police witnesses, as the accused sat at the dock, following the proceedings, giving away no outward signs of emotion.\nThe court, presided over by magistrate Simone Grech, adjourned the proceedings to June.\nInspectors Kurt Zahra and Robert Vella prosecuted.", "comment_count": 0, "id": 2676}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Labour Party turned down proposals in Parliament by the Nationalist Party, only to include them in its local elections manifesto, PN deputy leader David Agius said on Tuesday. \nIt also removed several initiatives that were instated by the Nationalist administration, only to propose them in this year’s manifesto, Mr Agius told a news conference.\nBoth parties have launched their manifestos for the upcoming local and MEP elections. \nPN MP Robert Cutajar noted several initiatives proposed by the Labour party had been proposed by the PN, and had been turned down.\nGiving an example, he said the Labour Party had rejected a Parliamentary proposal to include community policing in a Bill on local councils, only to come up with it now, Mr Cutajar said.\nIn Parliament, the government had also rejected a suggestion by the Nationalist Party to introduce more day and night centres, another initiative it was now proposing, Mr Cutajar added.\nMr Cutajar insisted this showed the Labour Party was cut off from what was going on in councils. The PL’s electoral manifesto was an “insult to people’s intelligence”, he said.\nDoes [the Labour party] know what it is doing- PN MP Robert Cutajar\nA Labour Party proposal to introduce more bus routes in hamlets had already existed under a Nationalist administration but was removed, he added. The measure was now being proposed in the PL electoral manifests.\nIt was also proposing that residential roads that had never been tarmacked would no longer be the responsibility of councils. However, these had always been the responsibility of Transport Malta and Infrastructure Malta, Mr Cutajar said.\n\"Does [the Labour party] know what it is doing,\" he asked.\nThe Labour Party's electoral manifesto was either drawn up in haste or by people cut off from reality, the PN MP said.\n ", "comment_count": 12, "id": 2677}, {"keywords": "", "author": "", "article_body": "The number of tourist arrivals in March increased by 3.5% to reach 172,971 when compared to the same month in 2018.\nThe National Statistics Office said 145,814 came for a holiday, while 16,748 came on business.\nArrivals from non-EU states went up by 21.4% to 27,742 when compared to the same month in 2018.\nMost tourists (38%) were aged between 25 and 44, followed by those within the 45-64 age bracket (33.8%).\nThe number of total nights they spent in Malta went up by 2.2% when compared to March 2018, surpassing 1.1 million nights.\nTotal tourist expenditure was estimated at €116.5 million, an increase of 0.5% over the same month in 2018.\nJanuary-March 2019\nArrivals for the first three months of 2019 amounted to 425,892, an increase of 2.8% over the same period in 2018. The total number of nights they spent in Malta went up by 4.2%, reaching nearly 2.8 million nights.\nTotal tourism expenditure was estimated at €272.4 million, 0.3% more than that recorded for 2018. Total expenditure per capita stood at €640, 2.3% less than in 2018.", "comment_count": 32, "id": 2678}, {"keywords": "", "author": "", "article_body": "The National Statistics Office's acting director general has been officially appointed to the role, the Malta Statistics Authority announced on Tuesday.  Etienne Caruana.\nEtienne Caruana, a mathematics and physics graduate with a Masters degree in statistics, was made acting director general in January 2018 following the resignation of his predecessor, Reuben Fenech. \nMr Caruana joined the NSO 18 years ago as a statistician. In 2005, he was appointed Manager with direct responsibility for Social Statistics including demography, education, national surveys such as the Statistics on Income and Living Conditions and the Household Budgetary Survey, and culture. In 2009, he became director, leading labour market, tourism, demography, migration, education and cross-sectional regional statistics. Mr Caruana was also responsible for the Economic Statistics Directorate. \nIn a statement announcing his appointment, the authority highlighted Mr Caruana's contacts with the European Commission, International Monetary Fund and United Nations, as well as national statistical institutes of many countries.\nFor many years, he was a member of the European Directors of Social Statistics working group and worked with Eurostat on sectoral reviews and technical assistance to non-EU countries.\nMr Caruana is also a member of the European Statistical System Committee, the highest decision-making body on statistical matters within the Commission. At the local level, he gave a contribution to several professional bodies, including the Pensions Strategy Working Group.", "comment_count": 9, "id": 2679}, {"keywords": "", "author": "Claire Caruana", "article_body": "The nurses' union is issuing a series of directives to its members working at the Intensive Therapy Unit as a \"long-standing\" shortage of 15 nurses persists.\nThe situation in the department is in such a dire state that the union said it is now fearing that a major accident would mean it would not be able to cater for an influx of patients.\nMalta Union of Nurses and Midwives head Paul Pace said on Tuesday that the staff complement in ITU has been depleted to the extent that unsafe practices have become the day-to-day “norm”.\n“Despite the stress, anxiety and burnout, the nurses still managed to maintain a sterling service to their patients.\"\nITU has a total of 15 vacancies which have been long-standing and not addressed, Mr Pace said.\nAccording to the union head, the situation has not improved despite the MUMN asking that the matter is addressed.\nShould there be a major incident causing a sudden increase in patients, Mr Pace said, the ITU does not have the reserve to cater for such incidents.\n“The situation has become very unsafe and such responsible nurses in ITU, who have the wellbeing of the patients at heart, have to take a stand,” he went on.\nAs from May 15, the union has instructed its members to not answer phones, except for the emergency line and their pagers.\nWhen the unit has more than two pairs of patients, more patients will only be brought from theatre when the transfers out of the unit occur. This is to protect the unit from having an increase in pairs, the union said. Nurses will also not ambulate their patients if they already have two patients.\nAdditionally, the ITU recovery will not be opened if the unit already has more than two pairs of patients.\nNurses will also not shroud patients who pass away.\n“The MUMN will remove the above directives when a total of eight nurses are sent to the ITU. By end of summer, MUMN expects that a further seven nurses are sent,” Mr Pace insisted.", "comment_count": 24, "id": 2680}, {"keywords": "", "author": "", "article_body": "Updated at 1.45pm with Ryanair statement\nA Ryanair flight from Edinburgh to Malta was forced to divert to the Netherlands after a passenger fell ill during the flight.\nThe aircraft took off from Edinburgh at 7am on Tuesday and was due to land in Malta later this morning, but was diverted to Eindhoven after declaring a 'mid-air emergency'.\nThe passenger got off the plane and was treated by medics. The plane then re-departed for Malta.\nA Ryanair spokesperson confirmed the incident. \n\"The crew called ahead to request medical assistance, the aircraft landed normally and the customer disembarked and was met by medics for further treatment,\" they said. \"The aircraft departed to Malta shortly after and Ryanair apologised to all customers for this short delay.\" ", "comment_count": 7, "id": 2681}, {"keywords": "", "author": "", "article_body": "A site formerly used by the British military to strengthen the defences of the western part of the island has undergone painstaking restoration and will now be used for didactic, research and outreach purposes as an observatory and field centre.\n\nA collaboration between the HSBC Malta Foundation, the University of Malta and the Mġarr local council, the I-Land Observatory and Field Centre represents a unique new concept in natural and cultural heritage management in Malta. The parties had originally embarked on plans for this project nearly eight years ago with restoration works getting under way in 2013.\nThe centre overlooks Fomm ir-Riħ Bay and spans the area formerly known as the Kunċizzjoni Electric Light Engine Room, built between 1897 and 1917, and features rare military building characteristics.\nAccording to Alex Torpiano, dean of the Faculty for the Built Environment at the University of Malta, the site used the latest military technology available for its time. Although only a few upright sections remain in the perimeter, the site made early use of barbed wire for coastal defence.\nOther defence features included prickly pear plants, the scarping of part of the perimeter slope, rubble wall infantry field defences, a musketry gallery, a fire trench and maxim machine guns.\nLouis F. Cassar, director of the Institute of Earth Systems at the University, explained that the centre will be used to showcase not only the site’s history and heritage, but also the various assets in the vicinity. These include the unique landforms, the geology, the rural landscapes and the very context within which this extreme end of the Victoria Lines of defence was constructed.\nAn exhibition narrating the unique history of the site overlooking Fomm ir-Riħ Bay is open to the public.\nAt the opening ceremony, HSBC Malta CEO Andrew Beane, who was formally educated in history, said: “This project has been a labour of love for us. It reminds us that we can learn something together if we keep one eye on the past while keeping one eye on the future, and to do so in a way that brings together the community, the university and other partners.”\nUniversity rector Alfred Vella added: “This project extends the university’s work outside of the campus and into the community and affects research that will circle back into cutting-edge studies.”\nAlso present at the opening was Parliamentary Secretary for Local Government and Communities Silvio Parnis, who lauded this initiative, saying that it is a reminder of a local council’s importance for its residents, while Mġarr mayor Paul Vella spoke of the change of use of the premises.\n“This place was built for keeping ‘the other’ from coming in and in-vading the area,” Mr Vella said.\n“Today, we are opening it up for all to come, visit and explore the bravery and brilliance of those who planned and erected this building.”\nAn exhibition featuring the history and the various stages of the often-complex restoration works is now open to the public.\nFor more information one may contact the Mġarr local council on 2152 0011.\n\nSchoolchildren exploring the exhibition on display in the musketry room.\nOne of the exhibition panels.", "comment_count": 5, "id": 2682}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Environmental groups have objected to a developer’s request to extend the Żabbar development boundary, potentially clearing agricultural land the size of two football pitches for development. \nAn application currently being assessed by the Planning Authority seeks to change the zoning of a massive 14,000 square metres of land off Labour Avenue, which is currently outside the development zone. \nResidents say the land is actively worked for agricultural produce, with strawberries currently being harvested, as well as being designated as a strategic open gap and agricultural area. \nIf successful, the application would clear the way for the land to be subjected to a full development application further down the line in much the same way the government’s 2006 rationalisation exercise opened up large amounts of ODZ land for development.\nHowever, the PA has not shown itself amenable to such requests from private developers, and two applications for the same changes in Għasri and Xlendi were unanimously rejected by the executive council last March. \nIn an objection to the Żabbar proposal, Flimkien Għal Ambjent Aħjar argued that planning policy specifically ruled out such modifications to the development zone, and pointed to the recent rejection of the two similar Gozo applications. \nResidents say the land is actively worked for agricultural produce\n“Such a request seeks to increase the development zone boundaries through fragmented applications compromising the integrity and overall protection offered to the rural area through the existing planning framework,” the NGO said. \nIt argued that the application could “under no circumstances be deemed as holistic or sustainable planning” and warned of the detrimental effect “on our environment and on the very integrity of our planning system”, calling for the PA to reject it outright.\nThe group Futur Ambjent Wieħed argued that the “chaotic piecemeal development of  ODZ” would have a devastating impact on the environment and show the “total futility of the planning system”. \nThe Żabbar local council has also indicated its intention to object to the proposal.\nThe application was presented by Jodie Camilleri on behalf of CA&S Limited and is open  for public consultation until May 29.", "comment_count": 44, "id": 2683}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Two out of every five Maltese who are aged 11 and over suffer from loneliness, according to  the first national scientific study on solitude.\nThe first wave of data from the study by the Faculty for Social Well-being also shows that at least one in 10 people – a staggering 46,000 – do not feel positive about their life.\nFor Dean Andrew Azzopardi, who led the study with Prof. Marilyn Clark, this figure was “quite worrying”.\nAnother telling find is that a third replied ‘yes’, or ‘more or  less’, when asked whether they experienced a general sense of emptiness. \n“The findings – the first of the sort – confirm that although we are not in the woods yet, we are heading there,” Prof. Azzopardi told Times of Malta.\nA total of 1,000 people aged 11 and up, from all regions across the islands, were surveyed for the study, which flags both emotional and social loneliness.\nThe National Statistics Office was commissioned to collect the data and the researchers used internationally recognised tools so that the survey would provide data that is comparable with that of other countries.\nIt was held after it transpired that Malta lacked empirical data about loneliness.\nA third replied ‘yes’ when asked if they experienced a general sense of loneliness\nProf. Azzopardi said young adolescents were included in the research as symptoms at such an early age could indicate whether they would suffer solitude at a later stage. \nThe findings show that the older people get, the more that solitude and loneliness trends increase. \nAt least two out of every 100 people suffer from severe or very severe loneliness, with another 41.3 per cent feel moderately lonely.\nMeanwhile, only two thirds know they can always call on their friends whenever they need them. Nearly 18 per cent said they had no friends to call or if they do, they cannot call them. Lack of support was a big concern as this often led to mental health issues, Prof. Azzopardi added.\nThe research also looked into people’s perception about their household income:  20 per cent, or nearly 84,000, do not have enough income.\nThe faculty will be meeting policymakers to present the data, which according to Prof. Azzopardi, prove the need to increase training among professionals in the social field, and strengthen available services provided through Caritas Malta, parishes and local councils, among others.", "comment_count": 40, "id": 2684}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says two out of every five Maltese who are aged 11 and over suffer from loneliness, according to the first national scientific study on solitude. In another story, the newspaper says Prime Minister Joseph Muscat expressed regret for saying that he would prefer having foreigners doing “unwanted” jobs such as waste collecting rather than Maltese. “I was insensitive, and I am sorry for it,” he said.\nL-Orizzont says Doctors for Choice are insisting on a debate on abortion, which they says is a right for women’s health.\nThe Malta Independent says 500 more new social units have been announced.\nIn-Nazzjon says the PN has launched an electoral programme for all localities with more than 2,000 proposals being made.", "comment_count": 0, "id": 2685}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A group of Maltese businessmen, led by Gozitan construction magnate Joseph Portelli, are behind the Turkish consortium currently in pole position to gain around €70 million in government contracts for the building of several roads across the island, Times of Malta is informed.\nIndustry sources told the newspaper that while the majority shareholder in Excel Sis Enerji Uretim Construction is a Turkish businessman from Istanbul, a group  of Maltese property developers, unknown in the infrastructure industry, have joined forces with the Turkish businessman to directly challenge established local road building companies.\nThe main Maltese businessman leading the pack is Joseph Portelli of J Portelli Projects, whose real estate company has grown exponentially over the past few years.\nCurrently the main developer of various controversial real estate projects across the island, including the multi-million  Mercury Towers in Paceville and a new hotel and over a hundred apartments in Mellieħa, given  a controversial green light by  the Planning Authority last month, he is joined by fellow developers Mark Agius, known as Ta’ Dirjanu and Daniel Refalo, both Gozitan businessmen in Excel Investments Ltd. The latter company, a significant shareholder in the Turkish Consortium, was registered just a month after the last general election.\nExcel Sis, which has submitted much cheaper bids than any of the established Maltese road building contractors, has also two Mellieħa-based businessmen as shareholders.\nKurt Buttigieg, a 29-year-old Labour candidate for this month’s elections of the Mellieħa local council, nephew of Labour’s  current Mellieħa major John Buttigieg, has a minority shareholding in the Turkish firm and sits on the consortium’s board.\nAnother company, Tangent Vector Projects Ltd, owned by James Fenech, an arms dealer, is the other minority shareholder.\nIndustry sources described the composition of the Turkish consortium as “very strange”, particularly due to the non-existent experience of the Maltese shareholders in complex road building projects.\nNo one can expect to be awarded a tender if their firm is not competitive\nLast week, Times of Malta revealed that the Turkish consortium is expected to take four out of the six major road building jobs issued by the government, as they submitted the cheapest offers. The other two major jobs are expected to be allocated to a Sicilian  firm, which also posted offers  millions less than their Maltese counterparts.\nSince the tenders issued by the government are regulated by EU laws, it is expected that the adjudication of these tenders will go to the cheapest compliant offerers.\nWhile most of Malta’s largest road building companies, including Bonnici Brothers, Polidano Brothers, Schembri Barbros and Penza, have all formed consortia to compete in this massive tender, their offers were significantly higher than those offered by the foreign firms.\nThis situation has led road building experts to question whether Maltese firms have been overcharging taxpayers for years for their various infrastructure works.\nAt the same time, the newspaper is informed of a total upheaval among the owners of the Maltese firms with most of them complaining directly to the Prime Minister over the situation, arguing that they have been short-changed.\n“Before the last election, many senior government officials at the OPM urged us to invest millions as a Labour win would have meant a lot of road building works for us. \n“However, they didn’t tell us that it will be given to the Turks,” the owner of one big firm told Times of Malta.\nIn direct reference to the Maltese businessmen involved with the Turkish consortium, another shareholder of an established road building firm complained that “it was not fair that those who have milked the current building boom are now also turning to our work, outpricing us with ridiculous offers,” he said.\nOn the other hand, sources close to the Contracts Department said that despite the complaints to politicians, rules have to be followed and no one can expect to be awarded a tender if their firm is  not competitive.\nThe government had pledged to spend some €700 million over the coming years to re-build most of the roads on the island.\nIvan.Camilleri@timesofmalta.com", "comment_count": 113, "id": 2686}, {"keywords": "", "author": "", "article_body": "Roads Minister Ian Borg had boasted about Infrastructure Malta embarking on a project to resurface several roads in St Paul's Bay/Qawra without having had the decency to point out that it was actually St Paul's Bay Council that was paying for the works, Nationalist MP Robert Cutajar told parliament on Monday.\nIn an adjournment speech, Mr Cutajar said the CEO of Infrastructure Malta had demanded an upfront payment of €1 million for the works, something which was disgraceful. The council deposited an initial €500,000 in the agency's account.\nThe government and the Labour Party were doing their best to discredit the PN-run council, Mr Cutajar said.\nSome councillors had repeatedly walked out of council meetings to ensure that there was no quorum, preventing decisions from being taken and bringing about paralysis to the detriment of the residents of St Paul's Bay.\nThe council had long been seeking to redo the roads, but contractors always said they were otherwise engaged by the government, Yet after the council engaged Infrastructure Malta, it was those same contractors who showed up to do the work.\nAs if to rub salt into the wound, work had now being brought to an abrupt halt, before the second stage of the works was started. The pretext, according to a Labour councillor was that one did not want to give the impression that the works were being carried out because of the proximity of the council elections.\nThis, Mr Cutajar said, was unfair on the residents of St Paul's Bay and on the council. It also contrasted sharply with what this government itself did just before the last general election, when a huge amount of appointments and promotions were given as polling day approached.  ", "comment_count": 9, "id": 2687}, {"keywords": "", "author": "", "article_body": "The Chamber of Engineers has protested after a bridging course meant to bring Mcast engineering graduates on par with those at University was halved, in breach of an agreement reached with the Engineering Board.\nThe chamber said it met the board on March 25 to address deficiencies of the past Mcast graduate courses and to ensure that the new courses were in line with the standard that needs to be attained.\nIt was agreed that graduates should bridge any deficiencies through targeted bridging studies at level 6 with examination-based assessment. These bridging studies would be reviewed by external reviewers.\nIt was also agreed that new Mcast courses should have the same number of credits as the university course based mostly on examination assessment as well as being reviewed annually by external reviewers.\nREAD: Mcast is still restructuring engineering courses - Chamber of Engineers\nBut late last month the Chamber received a notice from the Engineering Board that the bridging studies would actually be of 30 credits rather than the 60 credits which were agreed. \nThe past Mcast courses were based on 120 credits at level 5 and 120 credits at level 6 while the course from the University of Malta is a 240 credits course at level 6, the chamber observed.\n\"At the moment, the law requires that only equivalent courses to the University of Malta can lead to the attainment of the warrant,\" the chamber said.\nHaving Mcast engineering graduates with lower standards was unjust to current and past students of the B.Eng. (Hons.) course at the University of Malta, new Mcast students who will be taking a full course of 240 credits at level 6 and all current warrant holders who have gone through the University of Malta B.Eng.(Hons.) course.\nThe Chamber said it would consider various options at its disposal to tackle this issue and will call a meeting for all engineers, graduate engineers and engineering students.", "comment_count": 8, "id": 2688}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A court on Monday continued to hear arguments for and against a call by NGO Repubblika for a preliminary reference to the European Court of Justice on the manner of appointment of the members of the judiciary.\nThe Civil Society Organisation filed the case in the context of the recent appointment of three judges and three magistrates, arguing that the government should have first implemented the recommendations of the Venice Commission to guarantee the judiciary's independence.\nThe NGO is also calling for interim measures so that the newly appointed judges and magistrates would not be assigned their duties until this case is decided.\nLegal counsel Simon Busuttil said ordinary citizens had a right to take their grievance before the national courts where they could ask those courts to effect a reference to the European Court requesting a preliminary ruling on some point of European law. \nIn this case, the reference was to focus upon whether the prime minister’s discretion breached the principle of independence of the judiciary; whether the Maltese courts were to declare such system as irregular and order its suspension pending change; to declare appointments made under current system as null and void; and, that future appointments be blocked until a final decision on the merits of this case was taken.\n“It’s compelling to effect a reference. It’s crucial, if anything, for legal certainty,” stressed Dr Busuttil. He wondered what would become of judgments delivered by these newly appointed members of the judiciary if their appointment was to be annulled.\nWhat would happen in the case of European Arrest Warrant proceedings?\n“Imagine sending a person to another country for prosecution when he ought not have been sent, or vice versa?” \n“What worse harm can there be than a judge hearing a case when he should not have been a judge?”\nReferring to the most recent appointments of three judges and three magistrates in one day, Dr Busuttil argued that these were indicative of a “rush” on the part of the government to fill all those places.\nIt was in the interests of justice and legal certainty to avoid a situation of “irremediable” harm, he stressed, insisting there was no “halfway independence of the judiciary.”\nAttorney General Peter Grech, representing the prime minister and the justice minister, said that the case pivoted upon the government's discretion to nominate members of the judiciary.\nThe Venice Commission’s report, although authoritative, was not binding and was only an opinion, argued Dr Grech, pointing out that “with all due respect”, it would be “absurd” to base a reference upon an opinion.\nOpinions fell within the realm of the political process and the greatest danger in these proceedings was that a political issue was being discussed before the judicial fora.\nRepubblika’s request for a preliminary reference was frivolous, lacked basis and if entertained would ridicule the country, he said. \nThe Venice Commission had not made sweeping statements but had pointed out that the members of the judiciary were to be appointed on their merits and without any undue influence in the process, Dr Grech went on.\nAs for arguments challenging the validity of such appointments, Dr Grech remarked, “What if someone were to say that Malta’s independence was null, hence all appointments thereafter were to be annulled.”\nMr Justice Mark Chetcuti said a case involving the judiciary must not be left pending for weeks or months. He put off the case for judgement on May 29.\nThe sitting was attended by several members of Repubblika as well as by the justice minister who listened attentively throughout the proceedings.\nLawyer Karol Aquilina also appeared for Repubblika.", "comment_count": 9, "id": 2689}, {"keywords": "", "author": "", "article_body": "The government is considering a system whereby different towns and villages will be designated cultural capital for a year and will be the focus of a variety of cultural events by the central government, the prime minister said on Monday.\nHe was speaking during the launch by the Labour Party of an electoral manifesto for the local council elections and electoral programmes for each locality.\nHe said the manifesto and the electoral programmes were the fruit of long months of consultations.\nThe priorities, he said, were quality of life, quality time, quality administrative services, quality cleaning services and quality infrastructure. The environment, he said, was a priority for the councils.\nOther areas included alternative means of transport, security, a caring society, an active community and culture.  \nPN also launches programmes for local councils\nThe Nationalist Party also launched programmes for each of the local councils.\nParty general secretary Clyde Pui said the PN had always manifestly supported local councils and it was now making some 2,000 proposals across the various localities. \nThe proposals were centred on the need to strengthen communities and their identity, improve the environment and the quality of life, including the provision of day and night shelters in all localities and a system of community policing that helped the residents. \n\n \n ", "comment_count": 30, "id": 2690}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Environment minister José Herrera has framed plans for large-scale land reclamation as an ecological endeavour, arguing that the project can “save the environment” by preserving existing land from development.“This idea is being driven by the environment, not industry; the emphasis will be purely environmental,” Dr Herrera said during a Parliamentary environment committee hearing on construction waste on Monday.“Land reclamation takes place in some of the most beautiful countries in the world: I’ve just returned from the Seychelles where they are using it to preserve their parks and forests; they used just 20 per cent of the reclaimed area for residential projects and filled the rest with the trees.”Dr Herrera insisted that reclaiming land would create more space for “environmental activity”, which would be prioritised over any other type of development. “If you went anywhere in the world and said a small country like Malta was against land reclamation you’d be laughed out of the room,” he said.\nThis idea is being driven by the environment, not industry; the emphasis will be purely environmentalLand reclamation has risen up the agenda in recent months, with sources indicating it is seen as a solution to what industry has called a construction waste crisis, due to lack of adequate disposal options, as well as the massive amount set to be generated by the proposed Malta-Gozo tunnel. The Environment and Resources Authority (ERA) has drawn up a policy document - which Dr Herrera said has been finalised and presented to Cabinet for discussion - which sources said had indicated the coast around Xgħajra as the only suitable area for major reclamation projects, the rest of the island having been ruled out on environmental grounds.\nReclaimed land in the Seychelles. Photo: Shutterstock.\nUrgent need for construction waste depots to encourage reuse\nAddressing the committee on the construction waste issue, PA executive chairman Johann Buttigieg said the country urgently needed salvage depots where material from demolition could be stored and sorted for reuse. He said a lot of demolition material was already suitable for reuse, but that while some developers retained material of their own initiative, there was no system in place on a national level. Malta Developers Association chairman Sandro Chetcuti picked up the point, arguing that while such facilities could be bound by guarantees to prevent their redevelopment into real estate, there was no argument for them not to be built. Environment minister Dr Herrera said the construction waste policy document would address the issue, but warned that not every owner could expect to be allowed to convert their quarry into a depot.We have had half-baked policies in the past that have resulted in environmental disaster\"Most quarries are ODZ and the policy is that they must be reinstated, so we cannot eat up more ODZ. There will be no policy encouraging everyone with a quarry to exploit it economically.\"We have had half-baked policies in the past that have resulted in environmental disaster: if we give free rein, I am worried that the little we have will be destroyed.\"Dr Herrera noted that this represented 80 per cent of all Malta’s waste, compared to just 25 per cent in Europe, despite representing just 4 per cent of the island’s GDP, half the European average. He said that while two quarries were currently permitted for construction waste disposal, in principle 16 more were capable of taking such waste. In the worst-case scenario, he said, the law empowered the government to take over part of the volume of a quarry to use for this purpose, compensating the owner accordingly.", "comment_count": 130, "id": 2691}, {"keywords": "", "author": "Jacob Borg", "article_body": "Konrad Mizzi’s legal team is not ruling out appealing a decision to include the Tourism Minister in an inquiry into secret company 17 Black, a court heard on Monday.\nLawyer Aaron Mifsud Bonnici told the Constitutional Court that the time window for an appeal was still open as his client had only recently been officially notified about the decree handed down by Magistrate Doreen Clarke last week.\nThe magistrate deemed there to be enough evidence of a crime in the Panama Papers to warrant Dr Mizzi’s inclusion in the inquiry.\nPrior to the inquiry decree being handed down, Dr Mizzi filed a Constitutional application claiming his right to a fair hearing would be breached if a Panama Papers inquiry took place upon the request of former Opposition leader Simon Busuttil and NGO Repubblika.\nIn Monday's hearing about the human rights breach claim, Mr Justice Joseph Zammit McKeon rejected a request by Dr Mizzi to be able to appeal a decision by the Constitutional Court allowing Repubblika to be a party to the proceedings.\nDr Mizzi was not present for the proceedings.\nThis is the second time the minister has taken to the courts claiming a Panama Papers probe would breach his rights.\nHe dropped the first claim after a request made in 2017 for an inquiry was successfully blocked by an appeal.\nDr Busuttil and Repubblika filed a fresh request for an inquiry in March, decrying the country’s institutions flagrant and consistent failure to take any action against Dr Mizzi and the Prime Minister’s chief of staff after they were found to have opened up secret offshore structures.\nThe former Opposition leader’s request was upheld in part, as the court ordered the evidence presented to form part of a 17 Black inquiry being led by magistrate Charmaine Galea.\nFor this purpose, the court ordered that the evidence presented to it form part of the inquiry being led by Dr Galea.\nDr Mizzi, Mr Schembri, Nexia BT’s Brian Tonna and Karl Cini as well as LNG tanker agent Mario Pullicino will now form part of this inquiry.\nElectrogas power station director and businessman Yorgen Fenech had been named as the owner of the mystery Dubai company 17 Black.", "comment_count": 0, "id": 2692}, {"keywords": "", "author": "", "article_body": "Francis Zammit Dimech has joined consumer association calls for local and EU authorities to tighten regulations and testing for a potentially cancer-causing chemical found in some foodstuffs.\nThe MEP said member states had to make a greater effort to protect consumers from exposure to acrylamide, and welcomed a European Commission statement that maximum allowed levels of the chemical for certain foods were currently being discussed with member states.\nAcrylamide is a substance that forms naturally during high-temperature cooking and processing, such as frying, roasting and baking. It can be found in a variety of foods such as crisps and biscuits. Lab tests have indicated that it increases cancer risk in animals. Earlier this year, the European Consumers Association warned that many foodstuffs contained levels of the chemical that were higher than recommended levels, and called on the EU to make guidelines mandatory. Malta’s consumer association had joined the ECA call. Following the public outcry, Dr Zammit Dimech had tabled a question in the European Parliament, asking what the Commission was doing to keep levels of acrylamide low. Commission vice-president Jyrki Katainen told the MEP that maximum levels for acrylamide in certain foods are currently under discussion with the Member States and highlighted controls that existing regulations required of food manufacturers and member states. ", "comment_count": 0, "id": 2693}, {"keywords": "", "author": "", "article_body": "Nationalist MP David Casa has welcomed a decision by a Turkish court dismissing action against a journalist who had been facing a potential 13-month jail term for reporting how the Paradise Paper showed Turkish government officials having stashed funds outside the country. \nMr Casa said these had been worrying cases, not least because those who levelled the charges against  Pelin Ünker admitted that her reporting was not wrong.\nThe articles were about relatives of the Speaker of the House Binali Yildirim. \nIn March similar cases over articles involving the son-in-law of Turkish President Erdoğan were also dropped. \nMr Casa recalled meeting the journalist in Istanbul in February and hosting her in Malta where she was present for a vigil in memory of Daphne Caruana Galizia. Last month he presented a declaration of support signed by 65 MEPs to the Turkish ambassador in Malta. \nMr Casa said press freedom was fundamental for democracy and one could not close an eye when investigative journalists were persecuted for doing their work.  ", "comment_count": 6, "id": 2694}, {"keywords": "", "author": "", "article_body": "The Waterfront Hotel in Gżira has again lost its bid to be permitted to set up tables and chairs outside its premises, despite other establishments having been given such permits. \nThe hotel had been refused a permit by the new board of governors of the Lands Authority, a decision subsequently confirmed by the Administrative Review Tribunal.\nThe hotel launched an appeal in court challenging the tribunal's decision, arguing that the authority's board had not followed the recommendation of the authority's own officials and had acted against policy.\nThe hotel also claimed discrimination, pointing to other sites in the same street where permits for outdoor tables and chairs had been granted. \nThe court, however, upheld the authority's arguments that in terms of its own policy, \"each case shall be assessed on its own merits\". \nThe authority's board had argued that it had a right to change what could have been better done in the past, and what applied in the past was not necessarily still valid. It said it had therefore been decided to divide the street into blocks and where no permits had been issued so far, none would be issued so as not to lose parking space. No permits had been issued in the block of which the hotel formed part.\nMr Justice Anthony Ellul said the fact that encroachment permits had been given to other establishments in the same street did not mean that the hotel should have an expectation that its application would be upheld. \nThe policy was very clear. The hotel might have a reasonable expectation, but that did not mean a legitimate expectation.\nThe hotel had not been promised or been given to understand anything. Furthermore, the position of the hotel could not be considered as having been the same as the other establishments given permits before the Lands Authority was constituted, the court said. ", "comment_count": 0, "id": 2695}, {"keywords": "", "author": "", "article_body": "A number of White Mulberry saplings were stolen, days after having been planted at Triq l-Aħħar Ħbit mit-Torok between Zabbar and Zejtun. \nInfrastructure Minister Ian Borg said the trees were planted by Infrastructure Malta on Friday to replace others which had died of disease. Within two days, several of them had been stolen.\nHe condemned the 'shameful act'. \nThe road has been widened and spruced up in a €4m project.", "comment_count": 8, "id": 2696}, {"keywords": "", "author": "", "article_body": "A woman who blamed a driver for a traffic accident which caused her a 10 per cent disability has been found to have been partly responsible for the crash, which happened when she tried to get intimate with him as he drove.\nThe man had denied responsibility, claiming he was startled by the woman's actions.  \nThe case happened in San Ġwann in September 2012 when the driver and the woman had been heading home after having allegedly been drinking in a bar in Għargħur. The car crashed into a tree on a centre strip.\nFollowing the crash the woman suffered severe head injuries to the extent that she was in an induced coma for some time, and subsequently suffered disabilities which affected her social life and her work.\nThe woman subsequently sued the driver, his mother as owner of the vehicle, and Gasan Mamo Insurance.\nGasan Mamo successfully argued that the vehicle was insured on the driver’s mother and ‘any driver over 25’ but the driver was still 24 at the time.\nThe mother said she had not known that her son was not covered by insurance.\nThe driver said the woman, whom he had hardly known, was solely responsible for the accident as she had startled him when she tried to be intimate with him while driving. He insisted he had only had had \"a few sips\" of drink although he confirmed that he had invited her to meet him \"for a bottle of wine\".\nHe could not recall the woman’s position at the time of the incident.\nShe could not recall anything related to the incident or the messages exchanged earlier with the man, although she said it was likely that the messages were hers since they were sent from her phone.\nThe court said the evidence showed that the accident was not caused by excessive speed but by circumstances which led the driver to lose control.\nIt had resulted that the woman was not wearing a seatbelt. The driver had a strong smell of alcohol and refused a breathalyser test.\nWhile the allegation about the woman’s behaviour immediately before the incident could not be corroborated by other witnesses, court experts who had examined the vehicle found the position she was in contributed greatly to her injuries.\nThe fact that she had not been sitting as a passenger normally would was shown by the fact that parts of her hair were picked up near the car's airconditioning unit, leading the court to believe the version of events given by the driver.   \nThe woman’s injuries would not have been so serious had she been wearing a seatbelt, the court said.\nThe woman was found to be one-third responsible for the accident. The driver was two-thirds responsible because of negligent driving while under the effect of alcohol. He was ordered to pay damages of €10,725.12.", "comment_count": 0, "id": 2697}, {"keywords": "", "author": "", "article_body": "Voters in this month’s European Parliament elections should elect MEPs that believe in children’s rights and child participation in EU decision-making, President Emeritus Marie-Louise Coleiro Preca said.\nIn a keynote address in her capacity as President of Eurochild at the first EU Children’s Summit held in Bucharest under the Romanian Presidency, Ms Coleiro Preca said EU states should place children’s rights at the top of their agenda and work harder to make Europe “a model of child participation that other regions can follow”.\n“Child participation in decision-making needs to become a reality today and not in the future… It is essential that the European Union listens to children, and ensures they can influence decisions that directly affect them and all of us,” Ms Coleiro Preca said.\nAccording to the Europe Kids Want survey conducted by Eurochild and UNICEF, only eight per cent of child respondents feel that adults listen to their opinions when making decisions in their community.\nEurochild, a children’s rights advocacy network with 176 members in 34 countries, published the EU Children’s Declaration at the summit to guide European leaders on the way forward after conducting an extensive exercise to gather the views of children and experts on child participation in public decision-making.\nTwo Maltese children – 14-year-old Sharon Cilia, member of the Young People’s council and former member of the Eurochild Children’s Council, and 10-year-old Scarlett Engerer, who is a member of the Children’s Council – also took part in the summit.", "comment_count": 3, "id": 2698}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Speeding, Malta’s number one killer on the roads, appears to be less of a menace than it used to be, according to spot checks carried out by the police using recently acquired speed guns.\nThe police believe these speed monitoring devices are themselves serving as a deterrent and they have issued a call to double their number. \nThe state-of-the-art equipment is being used randomly on various roads, especially where drivers tend to exceed the speed limit. Among the notorious spots are the Mrieħel Bypass, the Coast Road and the road from Marsa to the airport.\nThe police last month took part in a European exercise to monitor speeding and the results, according to Police Inspector Pierguido Saliba, were encouraging: Malta fell within the EU average, an improvement over recent years when it was always above average in terms of speed.\nRead: Speed guns are catching around 26 motorists an hour\n“We caught just over 30 motorists overspeeding at each roadside check of up to two hours in several different locations all over Malta and Gozo throughout this week-long operation. This is within the European average.\nWe think motorists are becoming more aware of the risks\n“Most of those we caught were just over the speed limit while 20 per cent were driving at speeds exceeding the 15 kilometres per hour window over the limit,” he said.\nInspector Saliba said that in certain speeding hotspots, police caught motorists driving at double the limit.\n“However, on the whole, we’re seeing fewer detections. We think that motorists are becoming more aware of the risks of overspeeding. However, more can always be done,” he added.\nThe news ironically came day after a taxi driver was killed in a traffic accident where overspeeding seems to have been a contributing factor.\nAsked whether the police were concerned about the risk posed by the increasing number of high-powered vehicles on the road, Inspector Saliba said he was more concerned about the lack of driving experience. He expressed concern at the lack of safety features in the older cars.\nInspector Saliba sits on Tispol, an organisation that brings together the traffic police in a number of European countries, which share experiences and best practices with the aim of making European roads safer and bringing down the number of deaths and serious injuries.\n“Malta is a very active member,” said the inspector. “Our motto is ‘Crossing borders to save lives’.”\nEU police forces recently worked together to target trucks, minivans, coaches and taxis. Roadside checks were carried out with the collaboration of private operators.\n“We are achieving compliance through education rather than through fines. We found that private companies providing such services were very receptive and some are even looking into introducing alcohol spot checks for their own drivers.\n“The police cannot be everywhere all the time and we should not be, as we do not want Malta to become a police state. So that is where education and self-regulation come into the picture,” he said.\nHe said the Malta Road Safety Council was doing a sterling job to raise awareness of the effects of bad driving, overspeeding and drink driving.\n“We’re not after fines. We’re happy seeing road safety on the increase,” he said.", "comment_count": 130, "id": 2699}, {"keywords": "", "author": "Keith Micallef", "article_body": "The prime minister claims to have no details about a block of apartments being built on a Sliema site that should have been returned to the government following a court decision.\n“I have no details on this case. I read the story you are referring to but till this morning I had no details on the matter. It was this government which took the matter to court and shouldered full political responsibility for that,” he said when questioned during a press conference at Auberge de Castille.\nThe Sunday Times of Malta reported that Marco Gaffarena is developing a block of apartments on a site he had been ordered by a court to return to the government.\nThe site in question is a shop situated at 73, Manuel Dimech Street, Sliema. It was one of several government properties found to have been illegally bartered in a deal with Mr Gaffarena, in return for which he gave the government half a palazzo in Valletta’s Old Mint Street.\nThe deal was subsequently struck down by the court, which ordered that Mr Gaffarena return all government property that he had acquired under the arrangement.\nHowever, an investigation carried out by The Sunday Times of Malta over the past few weeks established that the shop now forms part of a mega development being carried out by Mr Gaffarena to turn it and an old townhouse into a block of luxury apartments.\nAccording to plans approved by the Planning Authority and seen by the newspaper, there will be at least two bedrooms where the shop now stands. Works were underway on the site when the Times of Malta paid a visit some days ago.", "comment_count": 49, "id": 2700}, {"keywords": "", "author": "Keith Micallef", "article_body": "The number of social housing units being financed through the sale of passports has been doubled to 1,000 thanks to “optimisation of resources and better planning” the prime minister announced on Monday.\nJoseph Muscat used a news conference at Castille to criticise the way Nationalist-led governments had failed to address the issue.\n“We are intervening to address market failure, following the State’s abdication 15 years ago not to build more social housing units,” he said.\nDr Muscat noted that the addition would mean that in a few years’ time the number of social housing units available would reach 1,700, thanks to an additional 500 being constructed through the National Development Bank.\nRead: €50 million from passports fund to be used for 500 social housing units\nMeanwhile, 500 additional units would be constructed using €10 million from the sale of passports, bringing the overall budget to €60 million.\nWhile no completion deadlines were given for these projects, the Prime Minister said that the additional units would address half of the existing waiting list of 3,200 applicants and increase the overall stock of social housing units in government’s possession by a third.\nHe insisted that no ODZ land would be taken up and that all units would meet the minimum standards.\nDr Muscat pointed out that thanks to detailed profiling of the applicants, the Housing Authority knew more accurately what was needed, such as the number of single-bedroom apartments.\nFurthermore, more space was allocated to accommodation since parking spaces were being provided rather than having a garage for every unit.", "comment_count": 12, "id": 2701}, {"keywords": "", "author": "Keith Micallef", "article_body": "Prime Minister Joseph Muscat on Monday apologised for controversial remarks on foreign workers, saying that his comment was “insensitive”.\nDuring a face-to-face debate with Opposition leader Adrian Delia in the run-up to the May 25 elections, Dr Muscat had stated that his vision was for foreign workers to toil in the sun instead of the Maltese.\n“I want the Maltese youths to get the skilled jobs. If I had to be given a choice, I would want Maltese workers to be managers or doctors. I would want them to move ahead as teachers and then I would get those helping workers in the sun to be foreigners.\n“If possible, I do not want the Maltese to be picking up rubbish from the streets. Every job should be dignified but I do not want a situation where the foreigner is comfortable and the Maltese breaking their backs,” Dr Muscat had said during the debate on TVM weekly show Extra.\nQuick to react to Dr Muscat’s claim, Dr Delia had said that this was a “fundamental statement” which translated to “a classist system”.\nDr Muscat on Monday admitted that his remarks were meant to flag Dr Delia’s increasing hard line stance against foreigners while making the point that his vision was for the Maltese to do the skilled jobs.\n“After seeing the footage, I think I came through as insensitive and I wanted to apologize for hurt in people’s feelings,\" he said.", "comment_count": 171, "id": 2702}, {"keywords": "", "author": "", "article_body": "A man who has spent the past 20 years waiting to face charges of having supplied a woman with heroin which led to her fatal overdose has started separate proceedings saying he is being denied justice within a reasonable time.\nLawrence Attard’s court saga started back in 1999, when he was charged with the unlawful procurement of heroin and with having allegedly, through negligence, supplied the drug that led to the fatal overdose of 25-year-old Theresa Agius, whose body was found floating at sea off the Delimara coast, hands and feet trussed up with blue nylon wire. \nFollowing a constitutional reference, the First Hall, Civil Court in its constitutional jurisdiction, had in 2004 declared that court delays amounted to a breach of the accused’s right to a fair hearing within reasonable time and ordered the Magistrates’ Court to deal with the case expediently.\nMr Attard was finally sentenced to six years in prison and to pay a €10,000 fine in November 2013.\nHowever, that judgment was annulled on appeal on the grounds that the Magistrates’ Court had cited the wrong provisions of law. The court of criminal appeal ordered the case to be heard all over again.\nTwenty years on, Mr Attard is still facing criminal proceedings for the 1999 incident. He has now filed a second application for a constitutional reference claiming that his right to a fair hearing is being breached.\nThe Court of Criminal Appeal, presided over by Madam Justice Edwina Grima, noted that the 2004 order for the criminal case to be dealt with promptly had not been implemented.\nFourteen years later, criminal proceedings were still pending, the court observed, concluding that in the light of such circumstances, Mr Attard’s request for a second constitutional reference was neither frivolous nor vexatious and thus merited being upheld thereby referring his grievance to the appropriate constitutional forum.\nLawyer Edward Gatt was counsel to the applicant.", "comment_count": 0, "id": 2703}, {"keywords": "", "author": "Jacob Borg", "article_body": "Nationalist Party leader Adrian Delia did not declare any current or savings account balances in the annual financial declaration MPs are obliged to make to Parliament.\nIn the filings seen by the Times of Malta, Dr Delia declared over €670,000 worth of loans but no current or saving account figures.\nAsked where his salary as Opposition leader and the proceeds from his business share sales went - if not into a bank account - a spokesman for Dr Delia said he “did not declare he does not have a savings/current account”.\n“There is no such question in the declaration schedules. His parliamentary wage goes into a current account,” the spokesman said.\nThe Parliament declaration clearly states that MPs need to include information about bank deposits and any other financial interests. The MPs’ code of ethics also contains such provisions.\nIn his 2017 declaration, Dr Delia had even declared his wife’s bank balance.\nAsked how Dr Delia now appeared to be interpreting the need for financial disclosure more narrowly, his spokesman said Dr Delia had no deposits, so there was nothing to declare.\n“In his 2017 declaration, he was privy to information pertinent to his wife’s paraphernal account. Today he is not. There has been no change in interpreting anything at all.\n“He has always been fully transparent and submitted far more information publicly than required”, the spokesman continued.\nDr Delia had published a statement of affairs days before successfully winning his leadership bid in September 2017 as questions about his finances mounted.\nThe Times of Malta reported in January that the PN leader faced loan, spousal maintenance payments and other monthly commitments, including the lease of a Jaguar, amounting to over €9,000,\nRead: Adrian Delia facing monthly payments of over €9,000\nDr Delia’s pay as Opposition leader leaves him with about €2,700 in hand every month.\nDr Delia assured the Times he was keeping up with his monthly commitments, which were also being funded by the sale of shares in his law firm and other business interests.\nDr Delia had declined to state the precise amount of the monthly payments for his shares when asked in January, insisting it was an agreement involving private individuals.\nHe had also said the eventual sale of his shares in Mġarr Developments Ltd would be a future source of income, though he acknowledged that the timing did not depend on him because units were still being sold and loans for the property deve-lopment paid off.\nThe loan amount stood at €7 million in 2017.", "comment_count": 74, "id": 2704}, {"keywords": "", "author": "", "article_body": "Almost 500 bottles of spirits were seized by Customs enforcement officials from an Msida mini-market.\nThe Customs officials were carrying out routine searches in Msida and discovered the spirits without excise banderols on the shelves.\nSubsequent searches in the shop and its stores lead to the discovery of a total of 477 bottles.The Customs enforcement section have been clamping down on the sale of beverages and spirits not bearing any excise tags, in an effort to hamper contraband operations and collect taxes which are being charged to the end consumer but not passed on to the government.", "comment_count": 2, "id": 2705}, {"keywords": "", "author": "", "article_body": "Updated at 8.30am\nPrompt action by the authorities prevented a fire from spreading to other vehicles after a parked bus caught fire at the Ċirkewwa terminus on Monday morning.\nPolice said there was no driver or passengers on board at the time.\nA Malta Public Transport spokesman said that the priority was to move the other buses away from the blazing bus to ensure that they were not damaged.\nThe operator said emergency procedures were activated and that a response team went on site to offer assistance to authorities. \nThe fire has been extinguished but witnesses said the bus was completely destroyed.\nInvestigations are still under way.\n\n ", "comment_count": 56, "id": 2706}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "A booklet displayed prominently at the health centre in Victoria promises that “you can expect to be seen by a doctor in 30 minutes”. But on most mornings you would be lucky if you’re seen within two hours.\nBy mid-morning a build-up of patients fill the flimsy plastic chairs and straggles of people are forced to stand and sometimes spill outside the door of Gozo’s only health centre.\nOpened in 1991, the centre has become too small for the volume of patients which, according to patients and staff, has been rising in recent years.\nOn busy mornings, clinical staff can barely cope in the small, cramped interior. Parents with children visiting for routine vaccinations – the immunisation clinic doubles as the office of the head nurse due to shortage of room space – sit next to patients waiting to see the GP.\n“Some of those patients might have infectious diseases, such as the flu in winter,” a member of the staff said on condition of anonymity, “which they could potentially pass to infants.”\nSpace is so limited that two or three members of the staff sit in the small, boxy reception when not busy attending to patients. The reception, an aluminum construction, lends the interior a shoddy feel. The small and dreary GP clinic forces doctors to keep the door open. \nStaff amenities are scanty. Food-related facilities are limited to a fridge and kettle – a toaster that used to trip the electricity was thrown out. Brooms and cleaning accessories are tucked into the small staff toilet. \nPlans come unstuck\nAll of this was supposed to change with the opening of a new health centre promised to be completed in the first half of this year. Health Minister Chris Fearne made the announcement last June to the press at a shell building that was rumoured to have been intended as a museum but would be repurposed for the new health centre. Yet the shell building – situated across the street from the Victoria bus station – remains as it was during the press conference 10 months ago.\nAsked what was holding up the works and when the new health centre would be opened, a spokesperson for Mr Fearne replied that “works are in progress, and the new premises is expected to open by the end of 2019”.\nThe door was padlocked on multiple visits to the place during working hours in the past two weeks. It looked like a derelict building site, surrounded by a perimeter wall and fence on which posters of upcoming events are affixed. Grass has grown between the outer fence and the shell building itself, and the tufty, erect grass on the aggregate ground outside of the door indicates that no workers have been walking in and out of the building. \nPatient pressures\nJust over a hundred metres away at the present health centre, the number of patients keeps rising. Sources have told The Sunday Times of Malta that this is due to an increase of foreigners – residents as well as tourists – and the growing population of Maltese residents moving to Gozo for its cheaper flat rents.\nOfficial figures show a sevenfold rise in the number of foreigners who used the health centre annually in the past five years, rising to nearly 5,000 last year and contributing to an average of 184 patients seen daily in 2018.\nThis figure was characterised as low by sources. Regular users of the health centre spoke of a growing problem of crowding, particularly in the mornings. In a visit by this newspaper recently, a member of the staff maintained that 150 patients had already visited that day and it was only 11.30am – the clinic is open from 8am to 8pm.\n“We’re relatively quiet at the moment,” the staff member said on condition of anonymity. “The flu season has passed but work will start to pick up soon as the hay fever season gets underway, and then it becomes tough in the summer during the tourist season. Several hundred people typically make use of the clinic every day at the height of the summer.”\nEight GPs, seven full-time and one part-time, are employed by the State’s Primary HealthCare in Gozo to serve at the health centre, at the 12 town clinics, as well as doing ‘home visits’. Overnight they work at the Gozo hospital’s Accident and Emergency department because the health centre is unsuitable to remain open at night given its dearth of facilities.\nA 30-minute promise... with a two-hour window\nThe new health centre will be designed to open round the clock and its services marginally expanded to cover mental health and podiatry. \nAt present, the only time patients tend to be served by a GP within 30 minutes – as promised in the booklet – is between 2pm and 4pm, when two doctors would be serving on most days. At other times, the single doctor on duty has to serve at the GP clinic and the ‘treatment room’, where he is intermittently called to examine walk-in patients.\nThe workload has also increased following administrative changes such as requiring GPs themselves to fill in forms of renewals of prescriptions for patients eligible for free medicine. \nSources said that there used to be a second doctor in the past, and the flow was speedier. Recent attempts to engage an additional doctor have been unsuccessful. No one applied for two successive calls for applications, although the sources said that attempts to engage a doctor continue.\nThe Health Ministry’s spokesperson did not reply directly to questions on whether a second doctor would be employed at the health centre, saying instead that “Primary HealthCare is currently enhancing and introducing new services, in Gozo and in Malta, thus it is also working on boosting the HR requirements”.\nMembers of the staff expressed apprehension at the prospect of another summer in the present health centre. The seasonal spike in patients, as well as the tendency of staff members to take vacation leave in summer, increases the burden on serving personnel. At peak times between July and September the glut of patients strains nerves and services towards breaking point.", "comment_count": 30, "id": 2707}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta leads with a message from the Archbishop Charles Scicluna on the perils of xenophobia, with his saying that we should not distinguish between citizens and migrants. It also reports on the political party leaders' Sunday meetings during which each was blaming the other for the country's ills, as the forthcoming elections approach.\nThe Malta Independent warns that the amount of irregular migrants crossing from Libya is set to increase due to the improving weather and worsening fighting there. It also reports that the owners of a small fuel station in Victoria are applying to move it out of the urban core - to a site in Birżebbuġa.\nL-Orizzont also reports on the speech made by Prime Minister Joseph Muscat on Sunday, in which he said that the May 25 election would be all about the 'credibility' of promises made, as well as a story about someone whose suicidal intentions were thwarted after a Facebook post raised the alarm.\nIn-Nazzjon quotes from Opposition leader Adrian Delia's speech, in which he warns that the European Socialist Party in the European Parliament want to remove sovereignty over fiscal decisions.", "comment_count": 0, "id": 2708}, {"keywords": "", "author": "Ivan Martin", "article_body": "It was one of the first warm mornings of early spring. Inspectors gathered in a Żabbar industrial park in preparation for a raid. They were about to uncover suspicious seafood stowed away in a secret room of a supplier’s warehouse.\n“This discovery of illegal fish catches was destined for Maltese buyers and raises concerns about health and safety from a consumer perspective,” a source close to the investigation told The Sunday Times of Malta after the raid.\n“We are still investigating and expect to uncover more in the coming days and weeks.”\nFishing in Malta has been put under the spotlight in recent months after the industry was rocked by revelations that Maltese tuna ranchers were smuggling illegally caught fish into southern Spain. The case, which allegedly involved a senior Maltese official, has raised serious concerns about enforcement in the sector.\nA Facebook post catches the eye\nHowever, unlike the international tuna racket, which is now caught up in the courts of Madrid and Valencia, the fish – all blue fin tuna – traced to the Ta’ Maġġi industrial estate last week, was not destined for the tapas bars of Spain. Instead, Maltese authorities believe it was due to be served up in local seafood eateries.  \nSources said it was a Buġibba restaurant’s Facebook post boasting of “fresh tuna” that first alerted the authorities to the possibility that illegally caught or mislabelled fish was on the menu.  \nWe found the fish behind a partition near the cold store\n“This post caught the eye of some people in the sector who asked how this person came to have this fresh tuna,” a source said. \nAn inspection at the restaurant turned up a consignment of fish that lacked the necessary paperwork to be deemed traceable. \n“This means that not only can we, as the competent authorities, not tell where the fish came from, but it makes it more difficult to say if it was stored and transported properly, or if it was tinkered with, and therefore what risks it poses to consumer health,” one source said. \nA catering middleman?  \nLiking the investigation to a drugs bust, health inspectors said subsequent visits to other restaurants had led them to the identity of a Maltese middleman who connects caterers with local fishermen.\n“This is like when you catch a youth with a small bag of marijuana, you can either make a show out of him or you can try and get to his dealer and stop the trafficking. That is what we were able to do in this case,” a source said. \nIn their joint operation, three State authorities – the Department of Fisheries and Aquaculture, the Directorate of Veterinary Regulations and the Directorate of Environmental Health – traced the fish from the open-air dining tables of the tourist hotspot to the rusty gate of a wholesaler’s Żabbar warehouse.\nAn initial inspection at this site had actually turned up dry and it seemed, for a moment, that the rogue dealer would get off the hook.\nBut in a room concealed behind a ‘fake wall’ at the far end of the building, inspectors then discovered boxes stuffed full of tuna, about 1,200 kilograms of it.\n“We found the fish behind a partition near the cold store, which meant it was cold but not properly stored,” a source said.  \nFish seized in the raid was sealed and confiscated.\nRepresenting the supplier, criminal defence lawyer Franco Debono has insisted that his client acquired the fish legally and will be providing the authorities with the receipts and documentation to prove his innocence.\nThe dealer also insists he had been waiting for clearance from the department for the consignment to be destroyed. \nSources in the Fisheries Department say the facts of the case will be established when the dealer is charged in court in the coming days.\nMeanwhile, more discoveries of illegal fish can be expected in the coming months, according to the sources, as the authorities cast a net to try and land more of those involved in this racket. \n“The sector has come under a lot of scrutiny and there are efforts being made now to try and address the abuse,” another source said.\nQuarter of Maltese white fish found to be ‘fraudulent’\nFigures on food fraud in Malta’s seafood industry are hard to come by. But one study by the European Commission does shed some light on the practice. The 2015 EU-wide report had looked into the prevalence of white fish being mislabelled on the European market.\nMore than a quarter of the white fish tested in Malta was found to have actually been something else – the highest in Europe. \nConfronted with the findings, industry sources last week were quick to point out that the local leg of the study was based on a limited sample of just 30 products so it could not be considered statistically sound. It was also unclear how much of the fish was local or imported produce.\nThat said, they conceded that the practice of mislabelling fish in Malta “certainly exists” and encouraged consumers to be diligent.\nThe main risk, they added – other than getting ripped off – was the possibility of contracting food poisoning from fish that had not been stored properly.\nIn a room concealed behind a ‘fake wall’, inspectors discovered boxes stuffed full of tuna – about 1,200 kilograms of it.\nFish poisoning: 22 cases in 10 years  \nIn a medical paper on the subject of fish-related food poisoning, consultant physician Martin Balzan reported on a minor outbreak of cases to hit Malta back in the early 1990s.\nThe paper tells the tale of a family of five who had contracted what is known as scombroid fish poisoning from a meal of fried lampuki (dolphin fish) in Żejtun.\nWithin just 30 minutes of finishing the meal, all members of the family developed strong allergic reactions to the fish, with one even suffering from minor breathing difficulties.\nScombroid fish poisoning, Dr Balzan writes, is caused by the ingestion of fish with a high histamine content, as a result of a bacteria that forms on the fish’s scales when the product is not refrigerated properly. \nAsked about the prevalence of fish poisoning cases in Malta, the health authorities said that while cases were “sporadic” they did exist.\nFigures supplied by the Health Department show that in the past 10 years, 22 cases of this sort of fish poisoning have been recorded on the island. The bulk, 18 cases, were linked to the consumption of tuna, two were linked to lampuki, one to imported salmon and one more to awrat (sea bream).\nHow fish fraud happens\nThis is not the first time that Maltese authorities have come across questionable fish being served up to consumers in the local market.\nA former inspector who spoke to this newspaper on condition of anonymity explained how every so often the authorities would catch sellers passing off “copycat fish” to trick buyers.  \n“When we inspected fish shops and even restaurants, what we would sometimes find is certain fish being intentionally mislabelled and passed on to unwitting buyers who can’t tell the difference. This is a practice where ‘inferior’ fish is presented as another more sought-after species – obviously with sellers pocketing the substantial difference in price,” he said. \nIn some instances, restaurants and fishmongers would sell yellow fin tuna as the far-pricier blue fin species.\n“When you see the meat of these two types of fish, they are almost identical. The difference comes in the quality when you cook it and serve it – and of course the cost price, which is very different,” the former inspector said.\nHe explained how authorities had in the past sent dubious fish overseas for DNA testing to be certain that the species were indeed what the sellers claimed they were.\nOther instances of food fraud included fish mongers passing off shark meat as mazzola (dogfish) and even as swordfish in some cases.\nivan.martin@timesofmalta.com", "comment_count": 26, "id": 2709}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government has again been slammed over its “lack of commitment” to strengthen the independence of the country’s legal system.\nLegal experts have shot down the latest Bill intended to separate the powers of the Office of the Attorney General as recommended by the Council of Europe’s Venice Commission.\nLiving in the past: King Henry VIII\nKevin Aquilina, a constitutional expert and the Dean of the Faculty of Law at the University of Malta, described the Bill as “a parody of the Venice Commission report”, saying it leaves much to be desired.\n“It is shabbily drafted and has conceptual flaws. It is legislative drafting mediocrity at its best and another example of how legislation should never be drafted,” Dr Aquilina said when contacted.\nLast week Dr Aquilina was highly critical of the government’s move to appoint six new members of the judiciary despite a pending lawsuit challenging the selection system over its failure to ensure judicial independence.\nAnother constitutional expert, who preferred to remain anonymous, said: “The government has once again failed the test as it will still be up to the Prime Minster to appoint both the Attorney General and the State Advocate.”\nAccording to the new Bill, presented to the media last week by Justice Minister Owen Bonnici, the current AG’s dual function – public prosecutor and legal advisor to the government – is to be split by creating the Office of the State Advocate.\nHowever, while the Venice Commission insisted on the independence of the appointees, the Bill still gives the Prime Minister the last word over who should occupy these posts.\nAnticipating the criticism expected from international institutions, including the EU, on this draft law, the government’s Bill introduces a so-called Appointments Commission to act as a filter for those applying for the post and which would present a report to the Prime Minister to make his choice.\nHowever, all members of the Appointment Commission will be chosen by the government, raising concerns over influence on the Commission’s decisions.\nExperts criticised the government for proposing another two appointment committees, arguing that the selection could easily done by the already established Judicial Appointments Committee whose remit could be extended to include the State Advocate and the Attorney General.\nAccording to Prof. Aquilina another flaw in the Bill is that the principle of separation of powers is breached through the introduction of a ‘Henry VIII clause’ whereby the Justice Minister may amend laws enacted by Parliament by means of delegated legislation (legal notices).\n“In Ireland, ‘Henry VIII clauses’ have been outlawed as through these clauses the government usurps the powers of Parliament. Yet our modern and progressive government is still living in the bygone days of King Henry VIII,” Prof. Aquilina said.\nSince the notorious king’s time, new legal, democratic and political concepts have evolved but “the Justice Minister is totally oblivious of these developments”.\nThrough this Bill, the government is also ignoring recommendations by the PN Opposition to at least appoint the Attorney General and the State Advocate on a two-thirds majority in Parliament, instead leaving the appointments up to the Prime Minister.\nWhat are Henry VIII clauses?\n‘Henry VIII clauses’ are clauses in a Bill that enable ministers to amend or repeal provisions in an Act of Parliament using secondary legislation, which is subject to varying degrees of parliamentary scrutiny.\nThe expression is a reference to King Henry VIII’s supposed preference for legislating directly by proclamation rather than through Parliament.", "comment_count": 44, "id": 2710}, {"keywords": "", "author": "", "article_body": "Two men who died when their fishing boat capsized in rough seas on Friday have been identified and named by Italian media. Toumi Zakaria and Luciano Sapienza were among four men aboard the Zaira, a small fishing vessel believed to have sailed from Syracuse on May 1. The bodies of both men were found on Saturday, following an overnight storm which left the sailors floundering. Mr Sapienza, who owned the Zaira, his son Fabio Antonio and two workers - Moroccan national Mr Zakaria and another man – manned the 45-foot Zaira during the trip. The four men got caught up in a squall on Friday night as they were fishing off Marsascala. According to La Repubblica, they were in the area with two other fishing vessels from Syracuse. While those two vessels managed to head north and avoid the brunt of the storm, the Zaira did not. “They were swept up by a large wave, “ the wife of the younger Sapienza aboard the ship told La Repubblica. “They set out on May 1. Our family relies on fishing to get by,” she said. The incident is now being investigated by local authorities.", "comment_count": 0, "id": 2711}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat and his family racked up the air miles in 2018 but their travels appear to have had little effect on their bank balance, with Dr Muscat declaring the same amount for the fifth year in a row.\nIn a financial declaration to Parliament last month, Dr Muscat declared €75,000 in his bank account – the same balance he has been declaring since 2014.\nPublic records and open sources indicate the Muscat family took regular trips abroad last year, once even turning an official visit to Australia in April 2018 into an extended family holiday.  \nThe Muscats appear to have taken at least three ‘pure’ family holidays that were not combined with official trips or Mrs Muscat’s charity work. The family of four visited Rome in May 2018 to see the Coppa Italia final between Juventus and the Prime Minister’s favourite team Milan.\nSeptember saw the family jetting off to Greece and they returned to Italy around the Christmas period. \nIn July 2018, the Muscats appeared to combine charity-related work by Mrs Muscat in the US with a trip to Chicago by the Prime Minister and his children.\nA request for information from the Prime Minister about the costs of all these trips and how they were funded was not answered by the time of writing.\nInside Muscatonomics\nDr Muscat’s pay as Prime Minister stood at €55,978 in 2018 plus €6,769 in allowances.\nAfter tax and national insurance, that leaves the Prime Minister with around €44,000 in hand. This figure also factors in a tax rebate for sending his children to a private school. He did not declare any credit card debt.\nAccording to the most recent household budgetary survey, published by the NSO in 2015, an average family with two dependent children spends around €29,000 annually.\nA private schooling\nThis NSO figure assumes that an average family spends €1,416 on education. The Muscats’ school fees amount to around €8,000, not including other expenses like books, uniforms and extra-curricular activities, which will not be factored in for the sake of keeping the estimate conservative. \nJust taking the €8,000 in school fees, less the €1,416 education expenditure figure already factored into the NSO survey so as not to inflate the overall number, takes the family’s spending up to €35,584 annually.\nAround the world with €40k\nThe €35,584 figure, going on the household budgetary survey estimates, assumes an average Maltese family would spend €5,000 on leisure activities. These activities are bundled into two broad categories named restaurants and hotels, with an average spend of €2,324, and recreation and leisure with an average expenditure of €2,603. \nTo avoid double counting, The Sunday Times of Malta is removing the €2,324 from the €35,584, although doing so also loses the Muscats’ local spending on restaurants.\nThe Muscat family shared this photo of their trip to Italy in May 2018.\nThis would leave the Prime Minister with €10,740 as a ‘holiday fund’ from his net salary before having to resort to his savings. \nThe frequency of the Muscats’ trips abroad undoubtedly put them above that of an average family.\nAccording to Eurostat figures released in 2018, Maltese residents spend an average of €646 per holiday.\nUsing this figure as a baseline would mean the three family holidays in Greece and Italy would put the Muscats’ spending at an estimated €3,876. This estimate factors in the spending of two adults.\nEstimating the expenses of the Australia and Chicago trips is more difficult, as it is not known to what extent the Muscats paid for flights, accommodation and spending money for each trip.\nFor the sake of calculating a conservative estimate for the flight costs, the assumption is that the Muscats funded the flights for their two children for Australia, and flights for the two children and one adult (the Prime Minister) for the Chicago trip.\nEstimates by The Sunday Times of Malta based on the cheapest economy flights show the Muscats would have spent just under €4,500 for flights to these two destinations.\nAccommodation and spending money for Australia and Chicago would easily have come in at another €1,000, bringing the Muscats’ estimated overall holiday spending to €9,376, or 21.3 per cent of the Prime Minister’s net taxable income.\nA narrow ‘surplus’?\nGiven that Dr Muscat’s ‘holiday fund’ stood at €10,740, this conservative estimated spending would have left him with €1,364 from his salary.\nThe Muscats also took their children to London for Commonwealth Day in March 2018, although no details were forthcoming about who paid for the children’s travel and accommodation expenses.\nOther expenses in the life of the Muscats vis-à-vis the average in the household budgetary survey are harder to estimate. The survey puts annual spending on clothing and footwear at €2,641. Given the Muscats’ penchant for fashion, their spending on such items could conceivably be higher than that of an average family.\nThe Muscats visited Chicago in July 2018, and shared a photo of the trip on social media.\nTransport makes up €4,500 of the figure in the survey, but the Muscats’ transport costs are likely lower as both parents make use of State cars. The survey attributes costs of €2,058 to housing, water, electricity gas and other fuels. Again, these costs could be lower as the Muscat family does not have a mortgage to pay.\nHoliday spending questioned in 2017\nIn 2017, the PN had raised questions about whether the Prime Minister had additional sources of income after a leaked receipt showed Dr Muscat paid €11,000 to stay in an exclusive Dubai hotel in March 2016, when the Panama Papers scandal was still emerging. A family trip to Greece. This photo was shared by the family to social media.\nThe Prime Minister had defended the trip for his 20th wedding anniversary, saying it was paid for using his own credit card.\nAn inquiry last year found no evidence linking the Prime Minister’s wife Michelle to an offshore shell company.\nThe unanswered questions put to the PM\nThe Prime Minister has for the seventh year in a row declared a bank balance in the €70k region, and for the fifth year in a row the exact same balance of €75k.\nCan you tell us if:\n■ The PM has any cash holdings, cryptocurrency holdings or deposits with Revolut?\n■ How many holidays on average the PM and his family take a year, and how much they cost?\n■ Can you confirm that the PM pays €8,000 a year on tuition for his children?\n■ Does his wife Michelle have any income?\nFollow up questions also asked for a list of how the Muscat family’s trips abroad cost and how they were funded.\n\nOPM replies on Sunday\nIn a 'right of reply', a spokesman for the Office of the Prime Minister accused the The Sunday Times of Malta of continuing \"in a vein that was started when the Egrant lies\" had been bandied about.\nHe said the Prime Minister’s income is all listed in his declaration of assets and holds no other income than what is publicly declared. The choice of schooling of the children is the family’s prerogative and falls within the family’s budget.\nHe accused the journalist of \"mixing up\" trips on official duties with the Prime Minister’s family holidays and said such information was available on open source information such as Parliamentary Questions.\n\"The Prime Minister’s Office follows government guidelines and long-standing procedures adopted for travelling undertaken by the Prime Minister on official trips. The family pays for the daughters when they accompany their parents. Holidays are always paid by the family. The details of the family trip in 2017 which the journalist refers to were all made public by the Prime Minister himself.\n\"It is shameful that the newspaper keeps using the same deceptive tactics before fact-checking, while trying to intermingle official duties with purely family matters. Facts have always belied such tactics,\" the OPM said. \nTimes of Malta replies: \nThe declarations of assets referred to in the Office of the Prime Minister's right of reply have not been made public since 2016. It is in this declaration that the Prime Minister and his ministers are obliged to declare their income.\nThe Sunday Times of Malta story was based on the annual filings MPs have to make to Parliament as well as publicly available information about the Prime Minister’s pay. MPs list their financial interests, and not their income, in such  declarations.\nThe story mentioned five trips. It was clearly stated that the two trips to Italy and the trip to Greece were family holidays.\nCosts for the official Australia trip were calculated on the assumption that the Muscat family paid for their daughters to join, as confirmed in the right of reply.\nThe costs for the Chicago trip were calculated on the assumption that the Prime Minister and his two daughters joined his wife, who was carrying out charity work in the United States.\nThe Sunday Times of Malta’s report was based on trips made in 2018.", "comment_count": 204, "id": 2712}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Archbishop Charles Scicluna delivered a pointed message against “stratifying” society between Maltese and foreigners during pontifical mass in Floriana, where he also mourned the loss of the historic St Publius arch.The Archbishop said in his sermon, on the occasion of the Feast of St Publius, that the 120-year old wooden arch had been part of the heritage of the parish and an expression of the town’s devotion, as well as that of the whole country. Those behind its destruction, believed to be an act of arson, must face justice, he said.“I join with those who mourn its loss, but what we need now is not tears but the determination to ensure that nobody can take from us what we hold dear,” he said. “Today it was a wooden arch; what could it be tomorrow? We can never allow ourselves to stand by in the face of violence.”Mgr Scicluna said that just as the arch should be rebuilt, so too should the values of “generosity, equality and human dignity” that the patron saint St Publius stood for.“There can be no distinction between citizens and foreigners,” he said, noting specifically that Publius lived in a stratified society where manual work was reserved for those who were not citizens, but that he had welcomed St Paul and the shipwreck survivors, and had seen his father healed “in the name of a carpenter from a far-flung, unremarkable province”. Though he did not reference it directly, his remarks came amid controversy over Prime Minister Joseph Muscat’s comments during an interview that he would prefer to see foreigners, rather than Maltese, carrying out non-skilled jobs, such as collecting rubbish or working in the sun. Activists have called the comments \"racist and classist\". Opposition leader Adrian Delia has also been criticised for his choice of language concerning foreign residents. Just two weeks ago, he told a St Paul's Bay crowd that \"clans\" of foreigners were frightening children and that Malta was being overrun by outsiders who are \"not of quality\".\nMgr Scicluna picked up the theme again at a visit to the St Publius Band Club with President George Vella and other dignitaries after the mass, where he praised the spirit of unity in response to the destruction of the historic arch. “Let us continue to promote our heritage, but also to think of those in need,” he appealed. Dr Vella, attending the celebrations for the first time as President, expressed similar sentiments: “Just as St Publius accepted those of a different religion and beliefs, we can do much more to make outsiders feel welcome and to create a more inclusive society,” he told those gathered.", "comment_count": 85, "id": 2713}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Magistrates’ Court on Sunday warned against the rising number of those caught travelling through Malta without valid documents saying this was a “constant phenomenon” which possibly undermined the security of the state.\nThis warning was issued during the arraignment of Adam Al Kali Hasaballa, a 28-year-old asylum seeker from Chad, who was arrested while on his way to board a flight to Pescara using an Italian passport and residence permit issued in the name of another person.\nOne could not close an eye to the fact that the immigration laws of the country were being breached, the court said, adding that in times of upheaval, conflict and terrorism, even within countries close to Malta’s shores, such illegal migration could pose a risk to innocent third parties.\nIn cases such as the one at hand, where a request for asylum had been turned down, the court urged local immigration authorities to take immediate action to repatriate the rejected applicant.\nUpon the accused’s guilty plea and his admission to having been living on the streets without a fixed residence, the court, presided over by magistrate Joseph Mifsud, deemed that an effective jail term was the appropriate punishment.\nIn view of the accused’s early guilty plea, his cooperation with the police as well as his clean criminal record, the court condemned him to a six-month jail term to be followed by repatriation upon serving his punishment.\nInspector Franks Sammut prosecuted.", "comment_count": 0, "id": 2714}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia on Sunday said the PN had always believed in the EU, unlike the PL, which he referred to as the “socialist” party. \nAddressing supporters in Għargħur, Dr Delia said the PN had for years believed in the European dream and what it represented. \nThe Opposition leader said Prime Minister Joseph Muscat could not accept that the forthcoming European Parliament elections were not about him. \n“He wants to turn it into a general election, making it all about him. He even used Castille at a backdrop [during the May 1 celebrations], emerging after everyone had spoken to make it a celebration about him”. \nDr Delia said May 1 was not a cult celebration or a celebration of a leader. \nHe reminded that May 1 marked the 15 year anniversary since Malta joined the EU. \nDr Delia accused “the socialists” of not believing a small country like Malta could grow in Europe. \nHe said the PN’s representatives in the European Parliament had fought for better border security, a better work-life balance and had also taken up the battle against cancer. \nThe Opposition leader said the election was about making sure the PN had enough of a voice to represent people’s interests in the EU. \n“This is not an election won by the PN or the PL. This is an election to give you a stronger voice in the EU”. \nHe said Manfred Weber, the candidate put forward by the PN’s political grouping in the EP for the position of European Commission president, had pledged to help Maltese businesses, farmers and fishermen. \nDr Delia said the socialist candidate for the same position had set his sights on Malta’s tax system. \nTurning to the local council elections, taking place on the same day as the EP ones, Dr Delia positioned the PN as the party that truly believed in local councils. \nThe Opposition leader said the PN had put forward 80 proposals to strengthen councils, yet the government had only accepted a few of them. \nHe said people should clearly vote for the party that had always sought to strengthen councils. \nTurning his guns on a declaration about foreign workers made by Dr Muscat during a television debate, Dr Delia said the Prime Minister’s was clearly intent on importing slaves. \nDr Muscat said during the debate that he did not want Maltese workers picking up rubbish. \nDr Delia said people were just a number to the Prime Minister, who was supposedly representing the workers’ party. \nThe Opposition leader hailed all those who worked hard to earn a living.", "comment_count": 12, "id": 2715}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Commuters could one day be paid to use public transport, but first, Malta needed to work towards having free public transport for all, Joseph Muscat told party supporters in Senglea on Sunday.\nSpeaking at the Labour-stronghold 20 days ahead of the local council and European Parliament elections, Dr Muscat said the solution for traffic in Malta was not an underground system, as the PN had proposed.\nThe solution was a vision, something that the PN lacked, he added.\nThe government was looking into the feasibility of an underground system, however, this project, which would cost hundreds of millions and take a quarter of a century to complete, needed critical mass.\nThis meant that it either required more people in the country, or a tax subsidy. However Opposition leader Adrian Delia had already accused Labour of filling Malta with foreigners and that people were financially burdened, Dr Muscat said.\nThe Prime Minister also questioned how the Opposition was raising concern over the disposal of excavated rock from the proposed Gozo-Malta tunnel, but wanted to excavate the whole island for an underground system.\nWhen you have no vision, you end caught up in contradictions, Dr Muscat said.\nHe reiterated his disbelief at the Opposition’s change of heart over the Gozo-Malta link, after backing the project in Parliament in April.\nHowever, this went beyond the tunnel issue. Credibility was the biggest currency in politics, he said.\n“It takes nothing to promise something... the work is all in the implementation. We promised free childcare, increased pensions, free transport, lower bills, more benefits and more work, and we gave you all of it,” he said to chants of “Joseph, Joseph”.\nA PN government had increased value added tax, national insurance contribution and fuel prices, and introduced an electricity surcharge, all unannounced, Dr Muscat said.\nTraffic management\nThe Opposition was currently complaining about traffic, but what did it plan to do about it, he asked.\nLabour’s plans included a seven-year infrastructural roadwork project and free public transport for all residents in the future.\n“At the moment, public transport is free for youths, pensioners and disabled people. I want a situation where people get paid for using public transport.\n“Rather than making cars more expensive, we would compensate people if they used public transport. One step at a time, and to do this we need to continue recording a surplus.”\nThe government was also working on setting a date from when all imported cars were electric, he added.\nCredibility issues\nDr Muscat insisted that credibility was an asset for the Labour government.\n“What we have given pensioners is nothing compared to how much more we will be giving them. We will be able to do this because we have credibility.”\nThe PN did not even have the right facts in hand, he said.\nWhile the PN had said that the number of teachers had decreased, data showed that people in the profession actually increased from 14,000 in 2013 to 17,500 this year.\nThe Opposition had also said that thefts had increased in Sliema. However, while there were 75 thefts from houses in Sliema in 2012, last year there were 55, he added.\nIn his last appeal to voters, Dr Muscat urged \"genuine PN voters\" to vote for Labour candidates to show their disgust at their party’s disrespect by not fielding enough candidates in the locality.", "comment_count": 80, "id": 2716}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The authorities have descended on Mistra Bay to warn a number of caravan owners to get in line with the law, after several parked their campers there illegally.\nCaravans can only be parked on roads and only if they have an inbuilt engine. Non-motorised campers and trailers can only be parked on the road if they are secured to or towed by a vehicle. \nOver the past week, caravans started appearing at and around Mistra Bay to the annoyance of bathers and a businessman who is considering closing his restaurant and leaving Malta.\nRestaurateur Claude Camilleri said he has been losing clients since campers started parking their caravans just outside his terraced restaurant around 2008.\nRead: 'I'm packing up and leaving the island' - Mistra restaurateur gives up\nDespite reports to several authorities, the caravans appear at the site every summer, with Mellieħa mayor John Buttigieg insisting it was an issue of enforcement. After the Times of Malta reported the return of the campers for the summer, Transport Malta and Planning Authority notices appeared on some of the caravans.Photo: Johnathan Borg\nA spokesman confirmed that TM had put up notices to ensure the owners of a number of vehicles did not “encumber the bay to the detriment of others”.\nThe notices allow the authority to take further action against those who do not have the necessary requirements to be in the area, including non-motorised caravans that are not attached to vehicles.\nWhile the transport watchdog can issue fines for illegally parked vehicles (motorised campers), this is not an option for non-motorised ones. The notices enable the authority to tow them away at a later date if the encumbering persisted, he explained.\nThe owners have seven days to remove the “encumbering” caravans – if they do not, they will be removed by the authority at the owners’ expense. The Planning Authority has also affixed enforcement notices on caravans – motorised or non-motorised – that are not parked on the road, a spokesman confirmed.\nIn 2011, the PA issued a notice warning campers not to park their caravans or set up tents at Mistra Bay without permission. A copy of this notice was affixed to a number of caravans on Friday, urging the owners to call a Planning Authority officer within three days. \nSome caravans were slapped with notices by both the Planning Authority and Transport Malta.\nEarlier this week, the Mellieħa mayor had explained that while motor caravans could park by the side of the road as they have a road licence and insurance, the owners could not place barbecues, chairs, tables and other beach furniture beside the vehicles, or pull out an extendable canopy.\nThe Transport Malta and Planning Authority notices which have appeared on some caravans at Mistra Bay. Photo: Jonathan Borg", "comment_count": 80, "id": 2717}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The government’s pledge to build a tunnel to Gozo has raised some seriousconcerns. Sarah Carabott speaks to Gozitan active citizen Daniel Cilia.\nThe biggest misconception about the tunnel is that it is going to have an emergency lane, Mr Cilia claims.\nAccording to Transport Malta’s project description, the tunnel will be a single tube with two lanes, one in each direction, with 90-metre-long emergency lay-bys at 250-300 metre intervals alternating on both sides and a one-metre-wide shoulder at either side. \nRead: Malta-Gozo tunnel: could a 'permanent link' become a traffic bottleneck?\n“There is clearly no planned emergency lane and there will be long tailbacks if a vehicle stops in one of the lanes,” predicts Mr Cilia.\n“How will an ambulance or a fire engine reach an accident site? I know many pro-tunnel people will say that this is scaremongering. I’m just being realistic.”\nMr Cilia drew comparisons between the proposed Gozo-Malta tunnel and that of Mont Blanc, connecting Italy with France.\nIn 1999, a Belgian truck carrying margarine and flour went up in flames inside the tunnel. The incident claimed the lives of 38 drivers and a firefighter.\nThe tunnel was closed for more than three years and opened only after extensive repairs and a redesign that included new security measures. Nowadays all merchandise trucks commuting through the tunnel are scanned for heat emissions, he said.\nMr Cilia, who spends a lot of time in Italy on work, said there were plans to excavate an adjacent tunnel to the one under Mont Blanc and another next to the Fréjus Road tunnel, which also connects France and Italy. These extensions would allow for an emergency lane to be accommodated.\nEach vehicle lane will be between 3.25 and 3.5 metres wide, and the two lanes will be divided by a central buffer of approximately one metre. This buffer might include rumble strips to warn stray vehicles. Where is the emergency lane?\nWhat if an accident happens?\nAre you in favour of the tunnel? “This isn’t an easy question to answer. Of course, after waiting for several hours in the queues at Mġarr or Ċirkewwa, one desperately dreams of having a tunnel.\n“But the dreams soon fizzle out with news of yet another accident in the two-lane Gotthard tunnel in Switzerland, which does not have an emergency lane either.”\nA recent fatal accident in April closed the tunnel creating a five-kilometre tailback.\nWhat if the tunnel closed for years?\nAccording to 2018 national data, 5,758,000 passengers and 1,666,000 vehicles travelled between the two islands. If the tunnel attracted most of these crossings, what would happen to the Gozo channel fleet – would it dwindle to a single ferry, he asked.\n“What if, due to some accident or refurbishment, the tunnel would have to close for years? Would we be able to quickly bring over ferries to cater for the sudden loss of vehicular traffic through the tunnel?\n“And if the ferries remain, can the tunnel compete financially with an efficient fleet that could offer trips to different harbours in Malta at a lower price?”\nWhat about a fourth ferry?\n“As the Gozo Minister Justyne Caruana has explained in the past, if a fourth ferry was adapted to berth at Mġarr and Ċirkewwa, there would still be a huge problem: where would it berth at night?”\nFinding a permanent night berth in Grand Harbour and keeping the new ferry at Mġarr could be a viable solution, according to Mr Cilia.\nBack in 1990, the Gozo ferry company was operating five vessels, including a fast one between Mġarr, Sliema and Sa Maison. Sometimes there were also stops at Marsalforn, Comino and St Paul’s Bay.\nIn 2015 it was decided that the yacht marina at Sa Maison would replace the Gozo Channel berth which had served in the transportation of merchandise to and from Gozo for decades.\n“When the Planning Authority gave its go-ahead to the Pieta yacht-marina, it was said that talks were being held with a view to relocating the Gozo Channel berth to the Grand Harbour. This was nearly four years ago. I guess these talks are taking a lot of coffee breaks.”\nThe tunnel is projected to be operational by 2024 but the official underwater geological studies are still to be presented. Will the faults (illustrated in red as per the 2012 Mott MacDonald Assessment of Road Tunnel Options between Malta and Gozo) make the tunnel more difficult to finish in time?\nRead: Construction of permanent link between Malta and Gozo unanimously approved", "comment_count": 118, "id": 2718}]