[{"keywords": "", "author": "", "article_body": "The government has been urged by the PN to hold a meeting for Maltese living in and around Edinburgh to keep them up to speed on their rights following Brexit.\nThe party spokesman on Brexit, David Stellini, said the PN had been urging the government to hold information meetings for Maltese residents in several parts of the UK, but so far only a meeting in London had been held. \nSome 10,000 Maltese live in and around Edinburgh.\nSuch people needed to know if they could continue to work and live in the UK and what access they would have to social benefits, education and health facilities, the PN said.\nStudents also wanted to know whether their tuition fees would be raised and whether there would be recognition of degrees.\nWould Maltese pensioners in the UK continue to receive their pension?  ", "comment_count": 13, "id": 3819}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A system that allows hospital authorities to automatically know whether a person is entitled to free healthcare is in the pipeline.\nThis would make collecting dues from these patients more efficient.\nAs things stand, those without a Maltese ID card have to present documentation to prove their entitlement.\nThis is already an improvement over the previous practice of ‘no questions asked’ and has helped the hospital increase its revenue from €300,000 to €1.2 million in a few years.\n“We have not changed any regulations – only the way we do things,” Mater Dei CEO Ivan Falzon told The Sunday Times of Malta.\nMr Falzon explained that following an exercise in 2015, his team realised that a potential €1.5 to €2 million in services were being given to non-entitled patients every year.\nWhen he first joined in 2014, Mater Dei used to collect between €300,000 and €400,000 from non-entitled patients. The current system started to be enforced gradually and last year the hospital collected up to €1.2 million in healthcare fees.\nThe funds are invested in the training of staff and hospital infrastructure. Last year, for example, the income helped fund part of Mater Dei’s air conditioning project.\nMr Falzon explained that in the past people would head to hospital with a referral ticket from their GP and given an appointment without any questions asked. It was only when they turned up for their appointment that those not entitled to free healthcare would be asked to pay.\nThis was a ‘lose-lose’ situation that led to confrontation, ghost invoices with the consequent loss of revenue for the hospital, and in some cases the treatment slot was lost, he explained.\nTherefore, to make things easier, a new standard operating procedure started being rolled out in 2017. All new referrals now require documentation – such as payslip or marriage certificate – to be presented before an appointment is set up. Those who are not entitled to free treatment are informed of the fee upfront.\nThis system is still being rolled out across the different hospital departments, so not all patients are being informed as yet.\nMr Falzon noted that on average, 90 foreigners are seen at the emergency department and another 200 by the outpatients’ services every day. Out of all these, between 60 and 70 people are sent to the billing department to prove their entitlement or otherwise, before they are seen by the professionals.\nForeigners need to present their payslip because so far there is no electronic system in place that checks the NI contributions of patients.\nMr Falzon said that the Health Ministry and the Family Ministry were working together on this issue, which has generated complaints from foreign patients.\n“The process we are aiming for is that rather than pushing data into the system, we pull data out of the system – for example we would input an NI number, and the system tells you whether you are entitled or not.\nRead: €2 million in unpaid bills fester at Mater Dei\n“At the moment we are asking patients to show us their payslip, pulling the information from the patient. It should be the other way round.”\nThe end result will either be a database with updated information about NI contributions, or an entitlement card issued together with the work permit for those without a Maltese ID card or a Reciprocal Health Agreement card.\nDirector of the Entitlement Unit Michelle Galea, from the Ministry for Health, noted that the current social security data was around a year old, and that is why people were being asked to present their most recent payslip dating to the previous month.\nFollowing an exercise in 2015, Mater Dei realised that a potential €1.5 to €2 million in services were being given to non-entitled patients every year. Photo: Chris Sant Fournier\nSo were people expected to carry a payslip with them in case they need urgent care?\n“At the emergency department we treat first and ask questions later,” Mr Falzon said.\nEmergency cases make up 15 per cent of the hospital’s cases, with the remaining 85 per cent being scheduled, therefore carried out by appointment. In such cases, questions were asked first and people treated once those questions have been answered, he added.\nWhat if you do not want to leave your payslip with the billing department?\nRevenue Manager Steve Ellul said patients had a right not to leave the payslip with the clerk because of data protection issues. In such cases, the staff had been instructed to contact him for approval and verify that they have seen the NI contribution document. He admitted the need for more fine-tuning of the system.\nThe patients’ experience…\n▪ A woman with Italian citizenship, dependent on her partner who pays NI in Malta, was rushed to Mater Dei by ambulance, where she was admitted for pneumonia-related complications. At the hospital she was reassured that she was entitled to free healthcare but she then received a €2,500 bill at home.\n▪ A Scottish man was asked for his payslip upon being admitted to emergency and asked to send it by e-mail as soon as he could, even though he was in pain. He questioned whether people were expected to carry their payslip around with them.\n▪ When a British woman turned up for an appointment, she was asked on the spot to present a payslip. When she did not want to leave her payslip with the billing department because of privacy, she was asked for a marriage certificate and her son’s birth certificate as he was the patient. What if her child is in the care of family friends, and they do not want to leave their payslip with them?\nHow much does it cost to stay at the hospital overnight?\nA general ward bed: €256.23 dailyA high dependency care bed: €489.17 dailyAn intensive care bed: €931.75 dailyCT scan: €465.87MRI: €698.81Normal pacemaker and leads: €3,494.06\nWhat do you need to take with you to hospital if you don’t have a Maltese ID card?\nWhat documentation do you need?\n*Unemployed TCNs or EU nationals married to unemployed Maltese qualify for free health**Unemployed TCNs or EU nationals, not married to Maltese/NI paying foreigner, do not qualify for free health care", "comment_count": 41, "id": 3820}, {"keywords": "", "author": "", "article_body": "Updated 6.30pm\nThe Data Protection Commissioner has imposed a €5,000 fine on the Lands Authority after an investigation of a major data breach in November.\nIn a statement, the commissioner said the matter was brought to his attention by the Times of Malta on November 23.\n\"The findings of the investigation established that the online application platform available on the authority’s portal lacked the necessary technical and organisational measures to ensure the security of processing,\" the commissioner said.\nThe Lands Authority was found to have infringed the General Data Protection Regulation and was served with an administrative fine of €5,000.\nThe level of the fine was reached after the Commissioner took into account the circumstances set out in the General Data Protection Regulation.\nThe EU's GDPR empowers supervisory authorities to fine companies up to €10 million or 2 per cent of their turnover for data protection breaches. Those fines can even double - to €20m or 4 per cent of turnover - in the cases of more serious breaches. \nA temporary ban imposed on the Lands Authority’s portal has been lifted.\nThe commission said the authority offered its full collaboration in the investigation.\nREAD: Website developers point fingers at the Lands Authority for data breach\nTimes of Malta had reported that a massive security flaw in the Lands Authority’s website inadvertently dumped a huge amount of personal data online.\nIdentity card details, e-mail correspondence, affidavits and other compromising data were made easily searchable on the internet thanks to the security flaw in the website.\nTimes of Malta was able to access over 10 gigabytes of personal data from the Lands Authority through a simple Google search.\nMuch of the data contained highly sensitive correspondence between individuals and the authority.\nWebsite back online\nThe Lands Authority said on Monday that it had chosen to respect the Commissioner's decision, notwithstanding the possibility to appeal, adding that his conclusion was based on the outcome of its internal investigation.\nThe Lands Authority’s website is once again available online, but the applications platform is still unavailable as the entire module has been recommissioned to ensure it is free from technical vulnerabilities.\nIn the meantime, however, the public can download application forms through its website and lodge applications via e-mail in order to facilitate the application process.", "comment_count": 15, "id": 3821}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 5pm with PN reaction\nA €70 million call to rebuild 170 residential roads will be issued on Monday, bringing the total of resurfaced roads for this year to 290.\n“There will be no compromise over the quality of the roads, and if contractors do not reach our expectations, they will need to redo the work,” Transport Minister Ian Borg told the media.\nThe projects form part of the larger €700 million scheme for roadworks in seven years, a government’s electoral pledge.\nAn Infrastructure Malta spokesman told Times of Malta that the roadworks contract included a five year guarantee on quality of works, however the roads were being built to last up to 20 years, depending on developments in the area and the frequency of use of the road.\nSuch roadworks were previously left in the hands of local councils, and would have taken tens of years to complete due to councils' financial limitations, the minister added.\nMost of the streets, such as Triq Ħadd in-Nies in Żabbar will need to be built from scratch as they had never been done before, while the rest will be resurfaced, Dr Borg told Times of Malta.\nPhoto: Matthew Mirabelli\nThe contractors need to guarantee the quality of the works and if tests, which are being carried out on the material and the completed roads themselves, prove that the roads are not of high standard, they will have to redo the roadwork, he added.\nThis was the case of the Mellieħa bypass, which has to be resurfaced at the contractor's expense as the quality of the works carried out did not meet the necessary standards.\nFollowing the first call for the rebuilding of 120 residential roads, there are currently five different consortia of contractors who are carrying out works on five sets of residential roads.\nWorks are nearing completion in Triq Ħadd in-Nies itself, Vjal Sir Temi Zammit in Ta’ Xbiex, Triq Wied Għomor in St Julian’s and Triq l-Għarnuq in Fgura.\nThe new tender will see work on 170 streets, totalling 52 kilometres of rebuilt roads and 85 kilometres of pavements. The work will include replacement and extension of services, work on stormwater systems and signage, among others.\nPN disappointed that government not moving services from under roads\nThe PN accused the government of going for quick wins, saying that it should be investing in the creation of channels to be used for infrastructural services, rather than spending millions just to surface the roads.\nIt called for a long-term plan which took such issues into account, to prevent roads having to be dug up again for service repairs.\nSee the list of newly-surfaced streets here.", "comment_count": 29, "id": 3822}, {"keywords": "", "author": "Jacob Borg", "article_body": "A UK parliament report about disinformation and fake news has flagged “dealings” it says Malta's Labour Party had in 2013 with the group that set up the notorious data-mining company Cambridge Analytica.\nThe claim, concerning PL involvement with SCL, was repeated despite Malta government denials last year.\nThe government issued a fresh denial on Monday, insisting there had been no such contact involving the government, the Labour Party or Joseph Muscat when he was Opposition leader. \nThe UK report states that SCL held meetings in Malta, and Henley & Partners' Christian Kalin was introduced by SCL to Joseph Muscat in 2011.\nThe London-based company Cambridge Analytica was last year accused of using the personal data of 50 million Facebook members to influence the US presidential election in 2016.\nIts executives had also been filmed in an undercover sting operation suggesting they could use honey traps and potentially even bribery to discredit politicians and help influence voters in St Kitts and Nevis.\nPersonal data from more than 6,000 Maltese Facebook users was shared with Cambridge Analytica.\nIn April, it emerged that more Maltese citizens were targeted than Estonia, Latvia and Luxembourg, countries with higher population numbers.Worked on campaigns that were not financed in a transparent way, overstepping legal and ethical boundaries\nThe report said that SCL Elections and its associated companies, including Cambridge Analytica, worked on campaigns that were not financed in a transparent way, overstepping legal and ethical boundaries.\nREAD: Was your Facebook data misused?\nThe committee was told that behind much of SCL Elections’ campaigning work was the hidden hand of Christian Kalin, who arranged for investors to supply the funding to pay for campaigns, and then organised SCL to write their manifesto and oversee the whole campaign process.\nIn exchange, Henley & Partners would gain exclusive passport rights for that country, under a citizenship-by-investment (CBI) programme.\nSuch a scheme was controversially launched by the Labour government months after the 2013 election. No mention of passport sales was made in Labour’s pre-election manifesto.\nMr Kalin met with both political parties prior to the 2013 election, the committee report continues, citing confidential information presented to it. The PN showed no interest in the proposed passport scheme.\nREAD: House of Commons 'fake news' report wrong about Malta - government\n'Claims based on unnamed sources' - government\nIn a reaction to the report, published on Monday, the government expressed its disappointment that the House of Commons report relied on “confidential information” claiming that there was a relationship between the Prime Minister and the company Strategic Communications Laboratories (SCL), when in fact there was never any contact with the company.\n“The government of Malta denies any claim that there was ever contact with SCL between the government, the Labour Party in Opposition or the Prime Minister when he was Opposition Leader.\n“This was made very clear in representations by the government of Malta to the Select Committee, which chose to base its claim on unnamed sources”, the statement said.\nIn a tweet, former Nationalist leader Simon Busuttil said he was not surprised the Maltese government has been caught lying by the House of Commons inquiry.", "comment_count": 153, "id": 3823}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A self-confessed drug addict has been jailed and fined after admitting in court to trafficking drugs at St Francis Square, Victoria, metres away from a school and gym.\nAnthony Said, a 44-year-old Gozitan, was arrested last month.\nHe was accused of trafficking cocaine, aggravated possession of cocaine and heroin, cannabis possession and with having allegedly committed such crimes within 100 metres of a place frequently visited by youngsters.\nMr Said admitted to the charges early in the proceedings.\nMagistrate Joseph Mifsud, citing an Appeals’ Court judgment, observed that criminal punishment “was not society’s vendetta against the guilty person,” but was rather intended to serve multiple purposes.\nBesides “repairing the social fabric, ripped apart by the criminal act,” punishment also had a reparative and reformative role.\nMoreover, punishment served to protect society by ensuring that “those who posed a threat to society were kept behind bars and thus out of circulation,” thereby also sending out a clear message intended to serve as a deterrent to others, the court went on.\nIn the light of the particular circumstances of the case, whilst taking note of the accused’s early guilty plea as well as his addiction, the court declared him guilty, condemning him to a two-year effective jail term and a €3,000 fine.\nThe court finally recommended that the Director of Prisons was to afford the man all help for rehabilitation.", "comment_count": 0, "id": 3824}, {"keywords": "", "author": "Claire Caruana", "article_body": "Some schools have tried to “minimise and hide” teachers’ concerns amid reports of violent incidents.\nAs a result, according to Malta Union of Teachers head Marco Bonnici, many educators have become reluctant to report cases of aggressive behaviour taking place inside the school gates as they were convinced this would not lead to any positive change.\nIt emerged in Parliament last week that since the beginning of the year there had been 23 reports lodged on the education department support website. The webpage is specifically designed to enable those educators who experience some form of aggression while in school to file an official complaint.\nAccording to the information tabled in Parliament by Education Minister Evarist Bartolo, in reply to a question by PN MP Clyde Puli, the 23 reports were related to nine separate cases.\nAsked whether the numbers provided by the minister were a true reflection of the situation inside school grounds, Mr Bonnici said that “a good number” of educators actually chose not to report cases of aggression.\nThis, he said, was a result of “a variety of reasons” but was mostly due to “a sense of helplessness” that had spread among educators as a result of “a general feeling that they do not feel supported”.\nMany teachers, he went on, have even claimed that some schools tried to minimise and hide their concerns and incidents, which meant that many were now reluctant to report incidents of aggression.\nA general feeling that they do not feel supported\nNo reply was forthcoming from the Education Ministry when asked for a reaction to the teachers’ claims that schools were downplaying their concerns.\nMeanwhile, a breakdown of the 23 cases provided by the ministry shows that there were three instances when more than one report was filed on the same case.\nIn one instance, 13 reports were filed on the same student with disability attending a resource centre. In another, two reports were filed on the same student while in a third case, three reports were filed regarding another student with disability attending a resource centre.\nOne report was also filed by a teacher on another teacher because of language used towards a black student.\nAccording to a ministry spokesman, the cases were all being followed up “weekly if not daily” by the Education Resources Director General.\nOn whether the cases were reported to the authorities, the spokesman said that three of the cases were taken to the police. He also noted that it is “within the discretion of the school” whether or not a situation needed police assistance and if so this is requested by the head of school.\nWhen required, the ministry’s legal team also provides assistance, the spokesman said.\nThe teachers’ concerns about aggressive behaviour come as safety at schools has again been making headlines in recent weeks.\nEarlier this month, two men were arraigned in connection with an incident at the Pembroke secondary school that allegedly occurred after a young student had to be hospitalised following an assault by another student.\nA student and a school official were involved in a fight at St Ignatius College secondary school, in Qormi, the day after.\nSince then, the union has said that it knew of more cases and that had also been reported to the authorities, resulting in teachers experiencing “a certain amount of apprehension” in some schools.\nDuring a meeting with the Opposition last week, Mr Bonnici also said he was informed that the government was finally moving to commission a plan to increase school security however this did not entirely address teachers’ concerns since only around a dozen of Malta’s schools would be covered by these new measures.\nAfter the spate of reports, the minister made a direct appeal to parents to stop aggression towards educators. Mr Bartolo said it was “unacceptable” for parents or other relatives to step into schools displaying aggressive or violent behaviour.\nclaire.caruana@timesofmalta.com", "comment_count": 6, "id": 3825}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Fitch credit ratings agency gets €40,000 a year from public coffers through a direct order issued by Finance Minister Edward Scicluna.\nAsked recently to say what the government was paying international credit rating agencies, Prof. Scicluna would not give details but said payments were being made to four agencies: Fitch, Standard and Poor’s, Moody’s and DBRS. It is not known what the payments, amounting to over €230,000 a year, are for.\nSo far, the Finance Ministry has only said what Fitch, one of the most reputable international credit rating firms, receives ­– €80,000 over two years.\nInternational credit rating agencies issue regular assessments on the economic performance of countries, banks and other institutions following thorough independent analyses. Such ratings are deemed crucial by economists and financial institutions when evaluating a country or an institution’s standing.\nInformation published recently in The Malta Government Gazette shows that various government departments continued to dish out direct orders in the second half of last year.\nRead: Payments to credit rating agencies soar to €230,000\nThe Finance Ministry, whose green light is needed before ministries and government entities award contracts without a call for tenders, spent €2.2 million in direct orders.\n\nThe largest disbursement, exceeding €2 million, went to Oliver Wyman, an international consultancy firm which assists the government in dealing with money-laundering legislation.\nMalta has been under the international radar amid suspicion and allegations of money-laundering activities including those connected to kickbacks on the sale of passports to gaming operators, mafia infiltrations and foreign banks.\nFormer tourism minister Edward Zammit Lewis has landed another government direct order, this time from the National Development Social Fund, which receives proceeds from the sale of passports.\nJointly with lawyer Veronique Dalli, Dr Zammit Lewis was hand-picked to provide legal services to the fund under a €40,000 direct order.\nSince losing his Cabinet post in 2017, Dr Zammit Lewis has received government contracts through direct orders originating, among others, from the Office of the Prime Minister, Identity Malta, the Lands Authority, the Energy Ministry and, now, the passport fund.\nSome of the latest direct orders\n\n\n\nEntity\nDirect Order\nTask\nValue\n\n\nMalta Enterprise\nJoseph Mangion\nPromotion in Middle East\n€49,500\n\n\nMalta Enterprise\nNadia Pace (The Pace Company)\nInvestment promotion\n€36,000 +success fee\n\n\nMalta Enterprise\nLeslie Skipper\nComm. consultant\n€37,000\n\n\nMalta Enterprise\nCory Greenland (Greenland services)\nConsultancy\n€6,000\n\n\nMalta Enterprise\nDF Advocates\nPlanning on production of veterinary products\n€9,600\n\n\nMalta Enterprise\nMifsud Bonnici Advocates\nLegal consultancy\n€10,000\n\n\nMalta Enterprise Nat. Development\nPhilo Meli\nConsultant\n€6,000\n\n\nSocial Fund\nEdward Zammit Lewis\nLegal services\n€38,135\n\n\nPlanning Authority\nHalo Pictures\nVideo clips\n€9,500\n\n\nPlanning Authority\nStriped Sox Ltd\nPR consultancy\n€18,000\n\n\nPlanning Authority\nHalo Pictures\nVideo clips\n€9,550\n\n\nPlanning Authority\nJoshua Zammit (Novargo Ltd)\nResearch\n€8,500\n\n\nPlanning Authority\nLuna Jets\nTravel of board member\n€8,750\n\n\nMITA\nSharp Shoot Media\nSponsorship in TV drama\n€5,250\n\n\nMITA\nChrysander Agius\nRadio endorsement\n€8,000\n\n\nFinance Ministry\nIkona Artworks\nPre-Budget campaign\n10,650\n\n\nFinance Ministry\nFitch Ratings (over two years)\nCredit rating\n€80,000\n\n\nFinance Ministry\nOliver Wyman\nSupport on anti-money laundering strategy\n€2,275,000\n\n\n\nivan.camilleri@timesofmalta.com", "comment_count": 100, "id": 3826}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Għargħur council has formally objected to the development of four terraced houses with pools instead of a farm.\nThe proposed development, on a site of agricultural land between Triq Kromb il-Baħar and Sqaq Charlotte, will replace a couple of rooms and its land with terraced houses complete with private swimming pools and ancillary facilities.\nThe proposed four-storey wall.\nOne of the main concerns, apart from the development being in an ODZ area, is the creation of a 60-metre, four-storey blank wall which would not only become an eyesore in such an area but would also dwarf surrounding buildings.\nAccording to residents, the site was until recently being used as agricultural land as it forms part of a stretch of fields bordering the urban conservation area of Għargħur and extending down into the valley on to Victoria Lines.\nMoreover, they argued, access to the land is extremely restricted with an alley barely three metres wide and just one entry and exit point. They insisted parking in the area was already a problem and this would only get worse if the proposed plan was given the green light.\nIt will ruin the skyline of this picturesque area\n“The area certainly cannot take any more development and traffic. Any further development within the area will not only aggravate the congestion and parking problems that already exist but will also undermine the social harmony amongst the residents,” a group of residents told the PA in their objections to the proposed development.\nThe proposal will destroy the very nature of this conservation and rural area in a zone close to the Victoria Lines that is registered as a listed area and a site of scientific importance, they added.\nIn its objection, the Għargħur council said the proposed development went against the local plan which described Għargħur as a rural village situated between Naxxar and Madliena.\n“The proposed development will ruin the skyline of this picturesque area which is within the Urban Conservation Area and which is located along a valley and along a popular public footpath leading to the Victoria Lines,” the council said as it requested to be present on the board when the decision on this development is discussed.", "comment_count": 16, "id": 3827}, {"keywords": "", "author": "Denise Grech ", "article_body": "Foreigners who wish to register their child in Malta have complained that they must “jump through hoops” to complete the process.\nA young Brazilian couple said they were unable to register their child’s surname as they wished for weeks, complaining they were told to register the mother’s surname as the last when they wanted it first.\nThey have been trying to register their baby with the father’s surname coming after the mother’s surname, but the identity office has been “rejecting it”, a relative of the family told the Times of Malta.\n“We are worried it will cause trouble back in Brazil because we might get asked questions at the airport,” the father, who spoke on condition of anonymity, said.\n“It’s been a frustrating process.”\nThe couple, who moved to Malta in search of work, said they were looking forward to register their child in the country.\n“We had long planned his name and we could not give it to him,” he said.\nIt has been a frustrating process\nBrazilian families have worked around the rule by registering the mother’s surname as the second name of the child, he said. The father’s surname would then be registered as the only family name.\nStill, the couple said, they did not want to change the name they wanted to give their child for months to simply “get around the rule”.\nAsked about the matter, a spokesman for Identity Malta said he could not comment about the specific case without being given more details. However, he said that generally, the regulator made distinctions between children conceived in or out of wedlock and those who applied for the publication of banns.\nAccording to the Civil Code, any “child conceived and born out of wedlock, if he has been acknowledged by the father, shall assume his surname, to which may be added the surname of the mother; otherwise, he shall assume the surname of the mother.”\nMoreover, another article of the Civil Code provides that children conceived and born in wedlock to parents who applied for the publication of banns prior to September 2017, “shall take the surname of their father, after which there may be added, the maiden surname of the mother or the surname of her predeceased husband.”", "comment_count": 5, "id": 3828}, {"keywords": "", "author": "Jacob Borg", "article_body": "Shareholders in a Maltese company behind a Russian online retail giant are locked in million-euro legal battles that have been playing out in London, the British Virgin Islands (BVI), Russia and Malta.\nThe Russian online retail giant Ulmart is owned by three shareholders through the Maltese company Ulmart Holdings Limited (UHL).\nThe London Court of International Arbitration ordered two companies with shares in UHL to pay a third business partner $67 million (€58.5 million) following accusations that they intentionally diverted money away from the Maltese company.\nUHL shareholders Koshigi Ltd and Svoboda Corporation were ordered to pay Donna Union Foundation the million-euro figure after the London tribunal found they had acted in concert to divert corporate opportunities away from the Maltese holding company in an unfairly prejudicial manner.\nThe two UHL shareholders were said to have participated in “sham transactions”, for the purpose of disadvantaging Donna Union.\nUHL insolvent and unable to repay its debts\nA judgment handed down by a BVI court last month, upholding a worldwide freezing and asset disclosure order against Koshigi Ltd and Svoboda Corporation, says the two UHL shareholders began to dissipate their assets prior to the London tribunal handing down its €58.5 million share buyout order.\nTwo of the Maltese company’s shareholders also feature in court cases in Russia.\nThe online retail giant’s founder Dmitry Kostygin, owner of Koshigi Ltd, has been charged in Russia with fraudulently obtaining a €13 million loan from a Russian bank. He denies all the charges.\nAnother UHL shareholder, Donna Union’s Michael Vasinkevich, was reportedly declared bankrupt in October on the back of a bankruptcy petition filed by Mr Kostygin.\nOn the local front, the Maltese company is facing an application for it to be dissolved and wound up by the courts over a $30 million (€26 million) debt owed to a Panama-registered company called Ledaro Investments SA.\nIn court filings, Ledaro Investment’s lawyer John Refalo noted that UHL has never filed any accounts and does not have an auditor.\nDr Refalo said that UHL does not appear to have assets apart from a number of subsidiaries in Cyprus and Russia.\nThe lawyer said that UHL’s online retail business in Russia appeared to be in financial difficult and did not have enough money to cover the $30 million loan given to it by Ledaro Investments.\nIn the court application, Dr Refalo said UHL is insolvent and unable to repay its debts.\nThe company should be dissolved and wound up by the court, Dr Refalo said.\nA Times of Malta request for comment from UHL’s local corporate service provider, Estera Corporate Services, was turned down.\njacob.borg@timesofmalta.com", "comment_count": 32, "id": 3829}, {"keywords": "", "author": "", "article_body": "The following are the stories making the front pages of Malta's newspapers on Monday:\nTimes of Malta reports that some schools have tried to “minimise and hide” teachers’ concerns amid reports of violent incidents.\nIt also reports that some 300 Turkish construction workers have been deployed to Tigné in Sliema, signalling the start of a new wave of third-country nationals imported to work on massive construction jobs on the island.\nThe Malta Independent says the Chamber of Pharmacists has warned its members against incorrect dispensing of the morning after pill. The newspaper also quotes the shadow minister for tourism, Robert Arrigo, saying the draft deal between the government and Corinthia would have created unfair competition. \nIn-Nazzjon leads with remarks by Opposition leader Adrian Delia that Gozo should be considered a region able to take decisions. \nl-orizzont gives prominence to a promise by the prime minister of free public transport between Malta and Gozo once the tunnel is completed. ", "comment_count": 0, "id": 3830}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "The 500-year-old Grade 1 scheduled Villa Barbaro in Tarxien may have withstood the onslaught of the Great Siege but it is under threat from an application to build an apartment block directly in front of it.\nThe development would dwarf the unique two-storey heritage country house and wipe out its all-important context.\nThe owner of the house, Marquis Antony Cremona Barbaro, who has been fighting a frustrating battle to extend the buffer zones around his pre-Great Siege property, has thrown down the gauntlet in the firm belief that the protection of the context of a historical building of the sort is as important as scheduling the country house itself.\nIn reality, he admitted, adequate buffer zones to ensure the proper safeguarding of these buildings and their gardens from disproportionately high surrounding development were seldom granted, with the result that many had already been “visually disfigured”, neutralising the purpose of the protective scheduling.\n“There is absolutely no point in giving maximum scheduling and supposedly full protection to these heritage buildings, as in the case of Villa Barbaro, if their setting is not safeguarded too,” he argued about the importance of context and the abject failure to understand it.\n“Sadly,” said the Marquis, “and most bizarrely – and despite my protests and repeated efforts over the last 10 years – the Planning Authority has still not extended the buffer zone to the most crucial and sensitive area directly in front of the villa.”\nThe “threat” of the proposed five-storey development in Żejtun Road was even more serious, the Marquis maintained, because it was directly opposite the lowest part of the villa’s façade – an early 17th century one-floor arched terrace.\nAs things stand, the buffer zone includes a number of houses on the private lane on one side of the property and a large plot of land directly behind it at the back of the garden on Church Street, which is a villa-only area.\nThe other side of Villa Barbaro is touching the Urban Conservation Area, so it is protected from that end, explained the Marquis, adding that it was unfortunate that the property was at the very edge of the UCA, leaving it open to the threat of towering surrounding developments.\nVirtually intact, the villa still enjoys its contextual integrity, the Marquis pointed out, thanks to the as yet unspoilt streetscape of Żejtun Road, with traditional two-storey houses, despite the “galling” fact that it is a development zone.\n“It is highly ironic that while the stated purpose of the buffer zone was to protect the vistas of the garden, the horrific impact of the proposed development would, on the contrary, irrevocably destroy the very vistas the authority seeks to protect, hemming in the garden and cutting it off from its original context,” he continued.\nMarquis Cremona Barbaro’s family has owned this pre-Siege country house since at least 1535 and he has vowed to “vigorously oppose this visual mutilation of one of the country’s important heritage gems with all the forces I can muster.\n“If this barbarity is allowed to go through, it will be the end for this gracious centuries-old country villa, which has been lovingly cared for and cherished over so many generations of my family”.\nThe pre-Siege country house is relatively intact and still enjoys its contextual integrity, for the time being. Photo: Matthew Mirabelli\nThe villa is one of the nation’s oldest country houses of the nobility, with strong stylistic affinities with the scheduled Inquisitor’s Palace in Girgenti and Palazzo Gomerino in Rabat. The early 17th-century walled gardens boast several impressive architectural features, including a unique two-storey-high prospettiva [pavilion], dated 1625, and are frequently visited by the Royal Horticultural Society.\nThe context of the villa would be irrevocably destroyed\nThe villa’s important heritage value was already recognised back in the 1920s when it was placed on the list of protected monu­ments by the museum authorities. This status was affirmed by the Planning Authority in 1996 when it scheduled the house with the highest level of protection, and the garden in 2009, creating a buffer zone. This has, however, proven to be inadequate.\nThe Marquis said it was an exception in Malta to be fighting for the scheduling of one’s own property, because owners usually wanted to leave open the possibility of selling it for development.\nThe recent application was “a direct result of the authority’s deplorable failure to properly enforce the villa’s scheduled protection, and the horrific impact on the villa’s garden façade is all too evident in the photomontage.\nPointing out an encouraging development in the ongoing saga, he said the Authority had, as instructed by the Environment and Planning Review Tribunal, commissioned a sighting report with a view to extending the buffer zone.\nThe appointed expert had submitted the report recommending the inclusion of the area opposite the villa’s façade (including the proposed development) within the two-storey buffer zone, and the Marquis now expected the authority to “finally see sense and comply with its own commissioned report”, which is currently before the tribunal.\nAlthough he remained in limbo because no action has been taken on the report, which would save the house if implemented, he was also confident that, with the backing of the Superintendence of Cultural Heritage, the authority would not allow the villa to be “reduced to nothing but a panorama for the towering blocks threatening to surround it, while the views and context of the villa and gardens themselves, from within the heritage property, would be irrevocably destroyed”.\nAs the authority charged with safeguarding the nation’s built heritage, Marquis Cremona Barbaro said it was expected to translate words into concrete action and show the nation it was truly committed to protecting its patrimony. “A Grade 1 scheduling is not a mere paper exercise,” he insisted.\n“I am the guardian of another Grade 1 scheduled heritage building and it cannot be mere coincidence that they are both gravely threatened by encroaching development,” he pointed out, referring to Villa Barbaro Bellosguardo in Attard, which housed a renowned private museum in the 18th century.\nThis was also facing the threat of a “disfiguring” four-metre-high development directly on the scheduled garden walls, as well as a bedroom just behind its baroque prospettiva.\n“All this can only be a reflection of the serious and disturbing crisis our built heritage is currently facing. Grade 1 scheduled buildings are described by the Planning Authority itself as having outstanding architectural or historical interest that should be preserved in their entirety and that no alterations impairing the setting would be allowed.\n“The measure of a country’s maturity and self-worth is in the extent to which it cherishes and respects its past and particularly the cultural heritage handed down by past generations. But if it wilfully turns its back on its past and stands by the wayside while the most splendid relics are systematically eradi­cated, it condemns itself to a very bleak future,” the Marquis concluded. “It becomes a nation without a soul.”  ", "comment_count": 45, "id": 3831}, {"keywords": "", "author": "", "article_body": "A man and a woman were seriously injured on Sunday afternoon when an argument involving seven people got out of hand.\nThe police said they were informed of the situation in Villabate Street, Zabbar, at 4pm.\nOfficers from the local police station and the Rapid Intervention Unit were deployed to calm the situation.\nThe argument involved a 26-year-old woman and a 20-year-old man from Cospicua, a 43-year-old woman from Vittoriosa, a 23-year-old man and a 53-year-old woman from  Zabbar, a 24-year-old woman from Qormi, and a 46 year old man, whose home town was not immediately known.\nThe injured were the 46-year-old man and the 26-year-old woman, who are being treated at Mater Dei Hospital. \nIt is understood that no weapons were used. ", "comment_count": 0, "id": 3832}, {"keywords": "", "author": "", "article_body": "A paraglider was lucky to escape injury on Sunday afternoon when he crashed into the cliff face at Mtaħleb.\nThe man ended up dangling from the chute which was stuck to the rocks, but he was pulled up safely by a team from the Civil Protection Department. ", "comment_count": 10, "id": 3833}, {"keywords": "", "author": "", "article_body": "Arnold Cassola has resigned from Alternattiva Demokratika, a party which he co-founded and led for several years, amid differences over the topic of abortion.\nHe told Times of Malta, however, that he will contest the European Parliament elections as an independent candidate.\nIn a letter to chairperson Carmel Cacopardo, Prof Cassola said that there were clearly differences between him and the party's executive over abortion.\nHe said he was strongly against abortion except where the life and health of the mother were in danger.\nOn Friday, AD's MEP candidate Mina Tolu said that political parties' refusal to discuss abortion and reproductive rights was \"frightening and unacceptable\".\nProf. Cassola had called on the party to dissociate itself from her comments and to reaffirm a position against abortion. This, he said, was a red line for him.\nMr Cacopardo had replied that AD had no position on abortion and the party executive would discuss Prof. Cassola's request at its next meeting. \nProf. Cassola in his resignation letter said it would be better for AD to be free to take its decisions without hindrance from his 'minority position'.\nHe said he was therefore, with regret, resigning from AD after 30 years of service but he would continue to militate on his own. \nIn a reaction to the resignation letter, AD secretary Ralph Cassar told Prof. Cassola that it would have been better had he awaited the internal discussion instead of publishing his resignation letter. \nHe confirmed that the party had no position on abortion but said that Prof Cassola's comment that he was against abortion except where the life and health of the mother were in danger was effectively a proposal which should be discussed. \nHe said he would welcome his input to the discussion.\nProf. Cassola was among the founders of AD in 1989 and secretary general of the European Greens Party between 1999 and 2006. He was a member of the Italian Parliament between 2006 and 2008.\nIn the 2004 election for the European Parliament he obtained 9.33% (or 23,000 votes) of the first-preference votes, just failing to be elected one of Malta's five MEPs.", "comment_count": 45, "id": 3834}, {"keywords": "", "author": "Anthony Manduca ", "article_body": "The employment agreement between Malta and Tunisia sends out a strong signal there is a legal way to migration, Tunisian Ambassador Zyed Bouzouita told The Sunday Times of Malta.\nThe agreement, signed during last week’s visit to Malta by Tunisian President Beji Caid Essebsi, paves the way for Tunisians to work here tempora­rily so as to fill the void in the Maltese labour market.\n“This agreement sends out a strong signal that there is a legal way to migration and that illegal migration certainly does not pay.\nTunisian Ambassador Zyed Bouzouita: “This agreement sends out a strong signal that there is a legal way to migration and that illegal migration certainly does not pay.” Photo: Matthew Mirabelli\n“The most important thing for us is that this exchange of workers between Malta and Tunisia is based on a legal framework, it shows that migration can be managed and illegal migration will be dissuaded. We want this to be a model project for other countries,” Mr Bouzouita said.\nHe said the accord was good for both countries. “Malta needs an influx of foreign labour and at the same time Tunisia has an unemployment problem – there are skilled workers who are looking for a job either in Tunisia or outside the country.”\nTunisia’s unemployment rate is currently 14 per cent, he said, so this agreement would help reduce the jobless rate among the young who would like to spend some time working outside their country.\nUnder Tunisian law, anyone working outside the country for at least two years is entitled to certain tax exemptions on return.\n “Tunisia and Malta are part of the 5 + 5 dialogue, and within this forum we are looking at giving a legal framework to migration,” he pointed out, stressing that migration was a cultural enrichment for both sides.\nMr Bouzouita said Malta and Tunisia shared many cultural characteristics “which makes migration to Malta easier”.\n“We must remember that at the beginning of the last century the largest group of foreign nationals in Tunisia were Maltese, who were more numerous that the French or Italians, so we have historic links.”\nThe employment agreement will be supervised by the Embassy of Tunisia in Malta. It will be implemented shortly, following the signing of an executive protocol between JobsPlus and the Tunisian employment agency. The Malta Chamber of Commerce, he said, will be involved in discussions before the actual protocol accord is signed. \n“JobsPlus are very keen about this agreement. Skilled Tunisian workers are very much sought after by Maltese entrepreneurs. We have received many requests for Tunisian workers from Maltese companies, especially those who have business interests in Tunisia.”\nThe agreement will allow Tunisians to work in Malta for two or three years, depending on their individual contracts, which will be renewable. Employees will come from all sectors, depending on the particular requests made by Maltese businesses.\nThe accord does not talk about numbers and this will depend on the demand by the Maltese side.\n“In practice, JobsPlus would make a request to Tunisia on behalf of a Maltese company, and this request will be handled by the Tunisian employment agency. There will be a selection process and we will try to bring the best type of people to Malta. Companies in Malta want specialised, technical workers from Tunisia and we can provide all types of employees: university graduates, skilled technicians, people in the services sector such as tourism, even agricultural engineers,” he said.\nThese employees will be required to speak English. If they don’t they will receive some intensive training before coming to Malta, to have a basic knowledge of the language.\n“I have also requested that an official from the Tunisian Em­ployment Ministry be based at the Tunisian Embassy in Malta to help manage this agreement. We will facilitate their stay in Malta (Tunisian workers) and supervise them throughout.”\nThe agreement also allows the families of Tunisian workers to join them here. The employees will pay tax and national insurance in Malta according to Maltese law, the ambassador said.\n“Malta needs 13,000 foreign workers this year – I got this number from Education and Employment Minister Evarist Bartolo. Considering the excellent relations between the two countries and peoples, we hope to be able to provide a considerable amount of jobs that are needed,” he said.\nHe said it was his wish for Tunisia’s economic relations with Malta to be at the same level “as our excellent political relations”.\nDuring President Essebsi’s State visit, three other agreements were signed between the two countries, namely a cultural agreement for 2019-2021, an MOU on early childhood and a protocol agreement on the elderly.", "comment_count": 14, "id": 3835}, {"keywords": "", "author": "Keith Micallef", "article_body": "All employees at Mellieħa Bay Hotel have been notified of their forthcoming redundancy amid a plan to demolish the complex and replace it by a brand new five-star resort.\nA company spokesman told The Sunday Times of Malta that the existing complex will cease operations later this year and while no precise date was given, no bookings are being accepted after the end of October.\nInaugurated in 1969, Mellieħa Bay Hotel was at the time Malta’s largest hotel with 428 beds and had cost £1 million to build. Its opening heralded a new era in Malta’s post-Independence economy, a major step in promoting the island in the UK market, through Thomson Organisation Ltd. Thomson had started operating chartered flights as part of an all-inclusive package offered to British tourists.\nThe hotel spokesman told the newspaper that, 50 years down the line, the ageing building requires a major overhaul and it has been decided to start this process by closing it down towards the end of the year.\n“The directors of the company are looking into a new project consisting of the building of a brand new five-star resort hotel that will be a major addition to Malta’s tourism product. The employees are being kept abreast of all developments through meetings with their union representatives,” he said.\nHowever, details about the new hotel, such as the number of beds, the facilities and the construction timeframe have not been divulged, with the spokesman saying that plans had not yet been finalised. In fact no development application has yet been submitted by the hotel which forms part of the Alf Mizzi & Sons Group.\nSources in the accommodation industry said the company had acquired a large adjacent property in Għadira Bay, formerly housing the Costa Del Sol Restaurant. However, it is not known if this land will be incorporated in the project.\nThough this newspaper is informed that a number of workers had already found alternative employment, those who had been on the company’s books for decades were “shocked” by the announcement.\nThe directors are looking into a new project that will be a major addition to Malta’s tourism product\nKenny Muscat, hospitality and catering section secretary of the General Workers Union which represents about 70 workers, said that compared to other hotels, Mellieħa Bay still had a large number of Maltese employees.\n“We estimate that by the time it ceases operations, the number of our members still on the company’s books will have gone down to about 25,” he said. \nThe union official insisted that as soon as it got wind of plans to demolish the hotel, it requested that management notify the workers about their future at least a year in advance.\nMr Muscat acknowledged that those who had spent their entire career working at the hotel would be the ones who would probably find it hard to adapt.\n“While the union cannot guarantee an alternative job for its members, it is working to mitigate the situation by securing financial arrangements to give some peace of mind to employees who have certain commitments,” Mr Muscat said.\nHe noted that this was no ordinary closure for refurbishment, in which case it would have been possible to find temporary arrangements.\n“From what we have learnt so far, the project will take at least three years to be completed,” he said.\nThe union is insisting that if the company needs to engage workers, it should first offer the opportunity to its existing employees so long as the nature of the work permits this. \nThe GWU official remarked that the employment law left much to be desired in cases of redundancy, as it only outlined the notice period. Redundancy gratuity is only given when workers are covered by a collective agreement, he added.\nIn this case the GWU negotiated an agreement under which employees who find a job elsewhere are being given the opportunity to leave straightaway, without working the mandatory notice period.\nAlternatively, those who prefer to work the entire notice period, which could be up to 12 weeks long, will be entitled to a sum as part of their ‘service award’ which is normally given at retirement age.\nEmployees who work right up the closing down will be entitled to the service award and the notice money, which could be equivalent to a sum of up to six months’ wages.", "comment_count": 50, "id": 3836}, {"keywords": "", "author": "Edwina Brincat", "article_body": "One of the two men involved in the hijack of an Afriqiyah Airlines Airbus 320 to Malta just before Christmas 2016 has been granted bail.\nThe plane was on an internal flight when it was hijacked and forced to land in Malta by pro-Gaddafi loyalists. The hijackers surrendered here and no one was injured. \nSoko Moussa Shaha Ali, and Ali Ahmed Saleh, both in their 20s, were arrested after releasing the 109 passengers and seven crew members on board.\nThey had threatened to blow up the plane but their weapons later turned out to be fake. \nREAD: Plane hijack drama in Malta ends; all hostages released \nThe two were arraigned on Christmas Day 2016 amid tight security and have been awaiting trial since, while facing the prospect of life imprisonment if found guilty.\nREAD: Libyan hijackers plead not guilty - taken to court under heavy escort\nBy means of an application filed last week, Mr Soko Moussa’s lawyer argued that his client was entitled to release from preventive arrest in terms of law, provided that he could adequately guarantee the observance of bail conditions.\nMoreover, the court was bound to grant bail once the maximum term of preventive arrest envisaged by law had run its course.\nReplying to the request, the Office of the Attorney General pointed out that not only had Mr Soko Moussa, been the mastermind behind the attack and the one who had played a major role in the hijack, but the accused also failed to satisfy the requisites for bail as expressly laid down by law.\nThe man had no ties in Malta, no fixed address and lacked financial means, making the risk of absconding a real one, the AG argued, adding that the court also needed to protect society at large.\nWhilst taking note of these submissions, the court observed that in terms of the current provisions on bail as laid down under the Criminal Code, the court “must” rather than “may” grant bail once the maximum term of preventive arrest had expired.\nWhere the crime was liable to a term of imprisonment exceeding 15 years, bail was to be granted “upon the lapse of 30 months” from the date of the presentation of the charges, namely the day of arraignment which in this case dated back to Christmas Day 2016.\nThe court should be allowed discretion for the purpose of striking a balance between the rights of the accused and those of society- Judge\nFaced with such a scenario, the court called upon parliament to effect the necessary amendments in respect of requests for bail by persons charged with acts of terrorism.\n“In such cases, if anything, the court should be allowed discretion for the purpose of striking a balance between the rights of the accused and those of society,” Madam Justice Consuelo Scerri Herrera declared.\nAlthough the reasons listed by the AG were normally valid arguments militating against the granting of bail, such reasons faltered under the circumstances envisaged by article 575(7) of the Criminal Code which declared that “Bail shall also always be granted to a person accused of an offence unless…..there has been a final judgment acquitting, convicting or sentencing the person so accused.”\nSuch instances presented the “ideal” scenario wherein electronic monitoring could effectively come into play, “greatly relieving the police of their burden in conducting physical monitoring, such as shadowing, so as to ascertain that the person is abiding by court orders as listed in the bail decree,” stated Madam Justice Scerri Herrera, making reference to previous pronouncements wherein she had made such a recommendation.\nThe  court granted Mr Soko Moussa bail on condition that he supplied a fixed address in Malta, signed the bail book and paid a deposit of €20,000, besides providing a personal guarantee of €50,000.\nThe court further barred the accused from leaving Malta.\nLawyer George Anton Buttigieg was defence counsel to Mr Soko Moussa.\nLawyers Elaine Mercieca Rizzo and Charles Mercieca from the AG’s Office prosecuted.", "comment_count": 12, "id": 3837}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "It was once hailed as a ‘revolutionary’ environmental law, but less than three years on, the Public Domain Act appears to have ground to a halt, with legal deadlines ignored and no sites having benefitted from its protection.\nIntroduced in 2016, the law allows sites to be nominated for public domain status, imposing a positive obligation on the government to preserve them for future generations.\nIt sets a deadline of September 15 every year for the Lands Minister to present Parliament with a list of nominated sites, to be compiled by the Planning Authority after a public consultation process.\nThe 2017 report included 24 nominated sites. But the process has been bogged down by a Lands Authority investigation into ownership rights, and none of the sites have yet been granted protection.\nThe 2018 process, meanwhile, never took place and no report was submitted by the September 15 deadline. Stakeholders have since expressed concern over whether the 2019 process will begin in time for the next deadline.\nOpposition MP Jason Azzopardi, who piloted the law through Parliament as a private member’s bill, told The Sunday Times of Malta that despite unanimous cross-party support for the law’s introduction, there now appeared to be no political will to see the process through.\nIt is useless drafting laws if there is no political will\n“We have been given all sorts of excuses in the parliamentary Environment Committee. I cannot fathom what could be keeping the authority from the simple task of suggesting sites that can be designated as public domain,” he said. “It is useless drafting laws if there is no political will.”\nFlimkien Għal Ambjent Aħjar environment officer Tara Cassar, whose organisation nominated nearly half the sites in the first report, said the NGO’s requests for updates on the process were being stonewalled by the authorities.\n“The whole process is stalled, but there was never any change in legislation to justify it,” she said. “The law is still there, so we are bound to act on it and take a decision on the proposals that have been made so far. Instead the entire process appears to have stopped.”\nA spokeswoman for Infrastructure Minister Ian Borg, who is responsible for both the Planning Authority and the Lands Authority, did not answer specific questions on when the process would be concluded or why last year’s deadline had been missed.\nThe spokeswoman said only that the first report had been submitted to Parliament in 2017 and that discussions had been held within the parliamentary environment committee.\nAn addendum to the 2017 report, the spokeswoman added, was tabled late last year. This addendum clarifies the ownership of the nominated sites and includes the Planning Authority’s executive council’s recommendations on the nominations.\nThe Environment Ministry did not respond to any questions.\nIn a statement yesterday on development plans for one of the nominated public domain sites at Manoel Island, the Democratic Party (PD) said the law had been “intentionally side-lined and thrown in the abyss”.\nWhat is the Public Domain Act?\nThe law aims to safeguard environmentally or culturally significant sites against unsustainable development, excessive commercialisation and environmental destruction.\nThe State cannot freely negotiate public domain sites with third parties, as it can with public land, but must ensure the preservation of public rights for future generations. Private property rights are not affected.\nUnder the law, the foreshore is automatically categorised as public domain while sites such as valleys, squares, woods, forts, nature reserves and cultural artefacts, can be proposed for listing.\nIn 2017, sites nominated for public domain status included Comino, the Valletta coastline, Ħondoq ir-Rummien, parts of Ta’ Ċenċ, the coast between Ġnejna and Mtaħleb, the Floriana pinetum, Manoel Island, Wied Garnaw, the Wied iż-Żurrieq to Għar Lapsi shore and others.  ", "comment_count": 18, "id": 3838}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Nationalist Party would be “pushing” the government to declare Gozo a region as part of amendments to the Constitution, leader Adrian Delia said on Sunday.\nSpeaking at an event in Gozo marking the start of week-long meetings during the party’s general council, Dr Delia said that while the government was not considering such a move, the PN would continue pushing for the island to be declared a region.\n\n“This will remain the party’s position on the matter and we will push the government to make it happen,” Dr Delia insisted.\nFormer PN leader Simon Busuttil had made a similar pledge ahead of the last general election as this would enable Gozo to apply for up to €250 million in EU funds.\nDr Delia also lambasted the government for “forgetting about Gozo”, insisting that while for the PN the island always remained a priority, the Labour government did not even mention Gozo in its Budget speech for 2019.\n“There was some chapter that mentioned Gozo but this seemed like some afterthought. We started the general council here to underline this fact,” the PN leader said.\nHe argued that the government had also repeatedly failed to keep promises it had made to the people in Gozo, insisting that while Dr Muscat spoke of a number of improvements to various sectors, including, health, education and tourism, these had yet to see the light of day.\nOn the Gozo hospital, which is now run by Steward Healthcare after it took over from Vitals in 2017, Dr Delia said that instead of focusing on the well-being of patients, Prime Minister Joseph Muscat was more interested in multi-million euro deals.\n“The Prime Minister is in Gozo because after hearing about us being here, he decided to follow us to the island. Dr Muscat should have come here, or anywhere really, for a debate with me and I would have asked him why he is forgetting the people in Gozo.\n“I would have asked him why he was forgetting about the education system here. Did the Prime Minister never come to the island as a child? Does he not have friends who live in Gozo? If, during the so-called “best time for Malta”, Dr Muscat did not even find a single euro for the Gozitans, when will he?” the PN leader asked.\nHe went on to add that during visits in various localities recently, he would often meet farmers who complained that the government did not care about the Maltese products and that they feared the sector would soon be destroyed for good.\nThe government wants numbers, he said, while the PN wants to focus the common good.\n“We believe in the Maltese product. We believe in farmers. We do not have a lot of time but we will do our best to save the sector,” Dr Delia went on.\nOn the use of pre-fabricated classrooms, the government itself declared a failure here because its reaction to criticism over the use of such mobile classrooms was that these were better than actual classrooms, he added.\n“Dr Muscat has also failed the elderly when he said that people’s pensions depended on the foreigners. A society that does not respect its elders is a truly rotten society. These things are decisions of someone who is leaving and that is dangerous.”", "comment_count": 21, "id": 3839}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Malta-Gozo tunnel will allow the government to introduce free buses linking the sister isle to the airport, Mater Dei Hospital and other strategic locations across the mainland, Prime Minister Joseph Muscat said on Sunday.\n“We were going to announce this in a few days but we can announce it here this morning – imagine getting on a bus here in Rabat (Victoria) and having one direct link to key locations in Malta… and we are saying this is going to be free for the public,” he said.\n\nDr Muscat was addressing a political gathering at the Labour Party club in Victoria, Gozo, and said the permanent link would be a game changer for Gozitans.\nHe also said it was “no secret” that the government was looking at the possibility of introducing a metro system for the entire archipelago.\nThe government however could not expect the public to tolerate the poor quality road infrastructure for years to come while the lengthy studies on such an underground system were conducted.\nRead:Immersed Gozo tunnel ‘would cater for a monorail’\n“Imagine, we have been working on studies related to the permanent link to Gozo for five years. A metro system would take a quarter century and we cannot drag our feet on upgrading the country’s infrastructure till then,” he said.\nTimes of Malta this month published a proposal for a metro system put forward by London-based engineer Konrad Xuereb. The system would cover the entire island and extend to Gozo.\n\nDr Muscat said that for such a metro system to be viable in Gozo, the island’s population would have to grow significantly.\nSeven bids for experts to help in Gozo tunnel preparations\n“So we need to ask ourselves – Do we want more building on Gozo to facilitate this population growth?” Dr Muscat said, adding that studies on the Malta-Gozo vehicular traffic link on the other hand, had shown this was economically viable.\nDr Muscat was quick to shoot down criticism that the Malta-Gozo link would spoil the sister island’s unique charm.\n“There are those who come to enjoy Gozo for two weeks in the year, but we want to breathe new life into Gozo, to revitalise it. We want it to remain an environmental oasis and a cultural gem, but we want it to take a leap forward,” he said.\n\nQuiet hamlet of l-Imbordin earmarked for Gozo tunnel entrance\nA large part of Dr Muscat’s speech focused on him insisting the government had Gozo in the forefront of its plans.\nGozo would, for instance, be the island’s next European Capital of Culture bid. Previous Nationalist administrations had given Gozo its own ministry, and promoted Gozo through a number of projects, however, there was always a mentality that Malta had to be treated with certain priority over Gozo, he said. \nThe government was pushing investment towards Gozo and would soon be investing a further €10 million to attract businesses to Xewkija.\nThis year, there had been an increase of 3,300 new jobs in Gozo, the bulk of which had come through the private sector.\nAnd for the first time ever, economic growth in Gozo was stronger than that in Malta.", "comment_count": 96, "id": 3840}, {"keywords": "", "author": "Ramona Depares", "article_body": "As people move away from traditional entertainment hubs like Paceville, village bars are experiencing a revival. But the trend does not spell good news for residents.\nIt’s gone midnight in the sleepy town of Lija and the streets leading to the village core are devoid of life. So far, so typical of a Friday night in your average Maltese village.\nBut first appearances can be deceptive and, upon turning a specific corner, the scene changes drastically.\nThe change can be heard before it is seen – a loud ‘murmuring’ that, as it turns out, emanates from a sizeable group of people who are enjoying a drink and a smoke outside the doors of a particular village bar. Their chatter is punctuated by the grating noise of distorted bass that can be heard through the open entrance doors.\nThe effect is devastating to anyone whose home lies adjacent to the bar, as window panes and the old stonework react to the sudden blasts.\nThe bar is located bang in the middle of what is supposed to be one of the quietest residential areas of Malta. A description that ceases to apply every Friday and Saturday night from 8pm up till the early hours of the morning.\nAnd it is a scene that repeats itself across an increasing number of residential localities and village cores, as scores of revellers descend on what were once quiet bars to let their hair down. Mosta, Gżira, Naxxar, Lija, Floriana, Dingli, Rabat and Qormi are only a few of the localities that boast a busy ‘nightlife’.\nFrom band clubs to political clubs, they seem to have eagerly jumped on the latest entertainment cash cow, with some even going so far as to ‘rebrand’ with catchier names and flashy signage.\nUnder current legislation, any tourist establishment wishing to play amplified music requires a specific permit from the Malta Tourism Authority. Even then, if the music can be heard from outdoors, it must be stopped by 11pm.\nHowever, band clubs and politi­cal party clubs are not caught under this regulation, as they are registered as ‘social clubs’ under subsidiary legislation that makes no reference to excessive noise or amplified music.\nThe same legislation does lay down that the club cannot cause annoyance to neighbours, under pain of possible closure. But, judging by the reports that keep coming in from various localities, it is clear there is no strict enforcement of this particular law.\nThe resurgence of village bars – and with it, the problem of noise pollution in residential areas –  is a relatively recent phenomenon. Michael, a 38-year-old who somewhat sheepishly admits to being a regular at evenings that are known as a ‘każinata’, puts this popularity down to that holy tri­nity of a great night out – cheap drinks, free appetizers and relatively easy parking.\n“Up till a couple of years ago, the trend was to go to a wine-bar for our regular outings. But that can be expensive and, let’s face it, it’s not the ideal scenario if you’re single,” he says.\nYou only go to Paceville if you’re a tourist or a teenager. Or if you’re into sex clubs\nBugibba, St Julian’s and Pace­ville hold few attractions for those who are after regular weekends out. “You only go to Paceville if you’re a tourist or a teenager. Or if you’re into sex clubs. And if you remove the special events and parties that take place at proper clubs, then there really is nowhere to go,” Michael continues.\nEnter the popularity of każinati, which Michael and his friends – together with hosts of other Maltese – have been enjoying almost every weekend for about a year.\nThe surge in popularity is also reflected on social media; Facebook pages choc-a-bloc with events and activities, usually centreing around open bars and appetisers.\n“The cheap drinks are the main attraction, I suppose. A round for six sets you back less than a tenner. Try doing that at a fancy bar in Buġibba.\nHowever, it’s not just about cheap drinks.\n“I think we stuck to these places because they offer a lively night out while being chill at the same time. The vibe is totally different to other lounge bars. Everyone seems to be friendlier, strangers will pick up a conversation and will do so without being creepy. And it’s only at każini that I have seen a 70-year-old grandpa dancing to Despacito,” he tells me with a grin.\nBut not everyone is as enthused with this new trend on the entertainment front. Residents hailing from various localities complain that every weekend it feels like they are “transported to Paceville”.\nAnnemarie (name has been changed), 57, is one such resident, her house lying a few metres away from a band club premises.\n“Years ago, when I moved here with my family, it was your typical quiet village. As of recently, it’s become a bit of a nightmare. Every weekend I can feel the music vibrating through my house. And it goes on until very late, at least until past 1am, more often even later,” she says.\nAnd it’s not just about the noise. Drunken people conversing “animatedly” in the street has become a common sight.\nAnnemarie says she has made “several” reports to the police but that these led nowhere.\nOne bar operator in her locality claimed he had never received any complaints from the police or the council. And, while admitting to playing music on the premises, he insisted that this could not be heard from outside.\nAnother problem is that the practice of leasing out the bar operation to a third party means the club’s committee is not always aware of what exactly is happening.\n“I have never received any complaints but I’m not sure exactly what events the bar operator is holding,” the president of another club admitted when contacted. “I will certainly be following up on this matter, and carrying out spot checks over the weekend.”\nJohn Fenech, from the Noise Abatement Society of Malta, shares residents’ concerns, adding that the society has received several complaints from various localities about the issue.\n“Unfortunately, although there are regulations regarding music being played at particular outlets, it is difficult to make sure they are enforced,” he says.\nThe law lays down fines for those who are found to be in breach of their permits. However, a bar owner would easily make that amount back in an hour, “so there is no incentive to stay within the regulations”.\n“These places are awarded a licence to operate provided they don’t violate the licensing conditions. But when they do, there is no suspension or withdrawal of the permit.”\nAnd in case of repeated infringements, the only advice the police offer residents is to take the operator to court. “This involves hassle and expense, not to mention a highly uncertain outcome, so everyone gets away with it,” Mr Fenech points out.\nMeantime, residents in various villages are trying to recover from their unwilling participation in what would be termed by Michael and his friends as “a heavy weekend”.", "comment_count": 19, "id": 3841}, {"keywords": "", "author": "Herman Grech", "article_body": "The police insist they need to gather more “rock solid evidence” before interrogating and proceeding against other suspects believed to be closely connected with Daphne Caruana Galizia’s assassination.\n“The police’s target is not just to arrest and interrogate, but to get a sound prosecution and conviction,” a police source said, amid mounting criticism over the length of time it is taking to bring more suspects to justice.\nOfficials from the EU’s law enforcement agency Europol were recently in Malta to hold discussions with local investigators and are expected back for “updates” in the coming days.\nThe police are trying to net more suspects connected with the murder, including the people who are suspected to be linked with the commissioning of the devastating car bomb that killed Ms Caruana Galizia 16 months ago. Three men have since been charged with planting and detonating the bomb which killed the 53-year-old journalist.\nForeign investigators have questioned the reluctance of the Maltese police to proceed against more suspects, believed to be between three and five men.\nLetters shaped into a scrabble-like formation and pointedly asking ‘Who Killed Daphne?’ were laid out in Castille Square yesterday morning by Occupy Justice to mark the anniversary of Daphne Caruana Galizia’s murder. Photo: Mark Zammit Cordina\n“We believe there is the basis to move ahead with the arrest and interrogation of certain individuals and we are working with the Maltese police to understand what is holding them back,” said an overseas source close to the investigation.\nThe source said that the people “who were involved at the commissioning stage” of the murder have been identified but there are different opinions among Maltese investigators as to whether there is enough evidence to prosecute.\nThe comments echo a report carried in The Sunday Times last November, which reported high-ranking officers leading the murder probe saying the investigation into those behind the car bomb was at a “very advanced stage”, with the main suspects having been identified.\nThe sources would not give any indication of the identity of these suspects or whether they came from the criminal, business or political world.\nBut officials close to the Maltese police have painted a complex picture of the investigation, with more evidence required lest the suspects walk away free.\nThe interrogations need to come at the right time, the sources said, reminding critics that investigators had a 48-hour deadline to press charges before the suspects are let go. At this stage, there are no imminent arrests planned.\nWhile pointing out that the police had the right leads to land more convictions, they advised against undue haste, even if the delay to arraign others is perceived as procrastination in the eyes of the public.This is a very dangerous business. People’s lives could be at risk\n“In this line of business, we could be inadvertently alerting other potential suspects that the police are after them. This is a very dangerous business. People’s lives could be at risk.”\nThe police are often well informed of the people behind major crimes yet cannot proceed if they lack sufficient proof which could stand up in court.\n“We think the arrests will come, but they will come at the right time,” one source said.\nLast week, a Council of Europe report on threats to media freedom said that despite three suspects having been detained, there were no “credible indications” that those who commissioned the killing were being investigated.\nMost of the investigative work into the murder has been carried out by the Maltese police and the Malta Security Service.\nWhen contacted, a spokesperson for Europol said the EU’s law enforcement agency has supported the Maltese police investigation from the outset.\n“We can confirm that Europol staff were deployed in Malta in December 2018 in support of the ongoing investigation. Europol is not in a position to comment further on operational matters which remain the prerogative of the Malta police.”", "comment_count": 172, "id": 3842}, {"keywords": "", "author": "Jacob Borg", "article_body": "‘Friends of friends’ networks are an inevitable way of life in a small society like Malta’s, MEP Alfred Sant told The Sunday Times of Malta in an interview.\nDuring his time as Opposition leader, Dr Sant would frequently criticise PN governments for cronyism and political patronage in what he termed the ‘friends of friends’ networks.\nQuestioned if the ‘friends of friends’ style of government had been eliminated by Labour, Dr Sant said an island like Malta functions on the basis of such networks.\n“It is not a good idea, but that is how it works. I do not like it. But that is how it works”, Dr Sant said.\nThe MEP, who served as Opposition leader from 1992 to 1996 and from 1998 to 2008, and Prime Minister from 1996 to 1998, countered that these networks had not come about overnight and he had spent many years deploring such practices.\nSometimes, these ‘friends of friends’ did deliver good investment opportunities, he added.\n“For instance, back in the 1960s ‘friends of friends’ of George Borg Olivier and Dom Mintoff came back to Malta, set up tourism systems and factories that are still delivering now.”\nThe MEP said it was worth bearing in mind that ‘friends of friends’ networks existed all over the world.\nHe said they were evident in the European Parliament, where certain individuals were intent on pushing forward their own agenda on the basis of such networks.\nDr Sant accused the PN of using the European Parliament to resurrect and keep certain issues going.\nHe dismissed the hearings last week by the Libe (Civil Liberties, Justice and Home Affairs) and Tax3 (Financial Crimes, Tax Evasion and Tax Avoidance) committees of the European Parliament as “more of the same”.\nDr Sant said that during his time in Opposition he had never sought to project local corruption scandals, of which there were many, onto the international stage.\nIt is not a good idea, but that is how it works. I do not like it\nHe had campaigned against corruption and when in office had proposed the setting up of a judge equipped to investigate such acts. Such proposals were resisted by both the then Opposition and the judiciary, he said.\nHe noted that these proposals were now being put forward by PN exponents like Jason Azzopardi.\nThe former prime minister said the recent Lux Leaks and Panama Papers leaks had been used by certain big countries to build a narrative in favour of harmonising financial and taxation policies.\nAsked why the government did not nip the Panama Papers narrative in the bud by getting rid of Keith Schembri and Konrad Mizzi, Dr Sant said that was a polemical question that had nothing to do with economic policy.\n“This was used to attack Malta in terms of reputation risk. I look at facts. The fact is that the economy did not suffer due to these reputational attacks”.\nQuestioned what he would have done as prime minister, Dr Sant said he had already expressed himself on the matter in the past.\nWhen the Panama Papers scandal broke in 2016, Dr Sant had joined Education Minister Evarist Bartolo in calling for Dr Mizzi’s resignation.\nOn the tax harmonisation front, Dr Sant warned that the drive towards harmonisation by the OECD was actually moving faster than the EU’s, which was something Malta had to be aware of.\nCountries like Malta had to show they were in favour of tax transparency while standing firm against tax harmonisation, he said.\nOn the economy, Dr Sant dismissed concerns that Malta’s record economic growth was being driven by passport sales, a construction boom and cheap labour.\nWhile acknowledging the role of construction, Dr Sant said the boom was being sustained by tourism, financial services and the gaming sector.\nDr Sant said that prior to 2013, the government’s main concern was implementing eurozone rules without thinking outside of the box. The Labour government had managed to unleash creative forces by still accepting eurozone rules while expanding in other areas.\nFailure to do so would have meant sticking to the previous PN policy of stability and containment, he said.  ", "comment_count": 109, "id": 3843}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta reports that the police need to gather more “rock solid evidence” before interrogating and proceeding against other suspects believed to be closely connected with Daphne Caruana Galizia’s assassination.\nThe newspaper also reports that feedback on whether the public agrees with extending Malta’s controversial cash-for-passports scheme is still being “analysed”, according to the government website dedicated to public consultations. Citizenship Parliamentary Secretary Julia Farrugia, who is responsible for the scheme, told the Times of Malta in September the evaluation of the public consultation was in its “final stages”.\nThe Malta Independent on Sunday quotes tuna farm operators claiming that  suspended Director of Fisheries Andreina Fenech Farrugia favoured Spanish tuna tycoon Jose Fuentes. The director in a reaction said she was being singled out from tens if not hundreds of people. It also reports that an emergency contraceptive pill is to be made available to rape victims in hospital.   \nMaltaToday also follows up the allegations against Dr Fenech Farrugia, saying that Jose Fuentes enjoined an unfair advantage, according to an inquiry. The newspaper also reports that Transport Minister Ian Borg is the most popular minister among voters.\nIt-Torċa says a national strategy on adoptions will be issued in the coming months. It also reports that the authorities are investigating an NGO which claimed in various road placards that depression could be healed in three minutes without medical treatment. \nIl-Mument says Labour MP Robert Abela, son of a former president, could not make himself to say whether he agrees that the President should come from a different political camp than the government's. It also reports on a wave of complaints by Labour supporters on Facebook. \nIllum says there is concern about an upsurge of sharing on intimate pictures among young people on social media.  \nKullĦadd says Nationalist MEP Roberta Metsola is helping Poland attack Malta.", "comment_count": 0, "id": 3844}, {"keywords": "Environment", "author": "", "article_body": "The Malta College of Arts, Science and Technology (Mcast) is coordinating a €1 million Horizon 2020 funded project aimed at deve­loping a research strategy in nature-based solutions, training and networking events, including international PhD summer schools, to promote research excellence in the field.\nNature-based solutions, such as urban green spaces, walls and roofs, contribute to improve human well-being and help tackle environmental challenges such as by reducing air pollution and flood risk, limiting the environmental impact of urbanisation and increasing biodiversity in cities.\nThe project partners include Trinity College Dublin, Ireland, the University of Trento, Italy, the University of East Anglia, UK, and Pensoft Publishers, Bulgaria. The multidisciplinary team of professionals from the project partners incorporates expertise in agricultural and fisheries sciences, environmental sciences and management, health sciences and engineering and information technology.\nThe multidisciplinary team of professionals from the project partners incorporates expertise in agricultural and fisheries sciences, environmental sciences and management, health sciences and engineering and information technology\nThrough the project Mcast will build on the research initiatives it has carried out in the sector over the past years and will strive to promote Malta as a research leader on a regional and international level.\nReNature has been funded by grants received from the EU Horizon 2020 programme by the Malta Council for Science and Technology through the ARIMNet2 Joint Initiative.\nThe project is also supported by the European Commission in the framework of the EU Biodiversity Strategy and the Green Infrastructure Strategy. Key policy stakeholders are also involved.\nThe project was recently launched at the Institute for Applied Sciences at Mcast’s main campus in Paola by the Education Minister Evarist Bartolo. Project coordinator Mario Balzan gave an overview of ReNature’s objectives and timeline of events. The launch was also addressed by Mcast principal James Calleja and deputy principal Alex Rizzo in the presence of parliamentary secretary Clifton Grima.\nFor more information on the project visit the website below.\nhttp://renature-project.eu", "comment_count": 0, "id": 3845}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Visual and Performing Arts School, within the Mikiel Anton Vassalli College, took part in ‘#inhobbok Valentine’s in Gozo’ programme.\n\nCelebrating art in its various forms, students showcased their works, including drawings, paintings, sculptures, pyrography and papier-mâché objects under the guidance of their respective teachers in Victoria streets. Head of school Vince Caruana said: “Such events present the perfect out-of-school opportunity to meet students and educators while taking a closer look, appreciating the process and end product of various artworks.”", "comment_count": 5, "id": 3846}, {"keywords": "Environment", "author": "", "article_body": "Thirty Eco-Schools students from six schools recently conducted an environmental audit at the Ministry for Education building in Floriana.\nAfter a debriefing by Eco-Schools national coordinator Paul Pace, groups of the students chose specific areas of the building to audit. Accompanied by their teachers and the Eco-Schools coordination team, the students toured and examined the building and audited various areas, including the customer care offices, reception area, the minister’s, the permanent secretary’s and the secretariat’s offices, boardrooms, kitchenettes, bathrooms, restrooms, corridors, fire exits, waiting rooms, terraces, the yard and various other facilities.\nThe students also spoke with the staff to understand better in which way the existing building design, operations and in-house policies are contributing to a more sustainable lifestyle. The students’ recommendations will now be collated and tabled into an action plan that will be presented to Education Minister Evarist Bartolo and permanent secretary Francis Fabri later this year.\nIn a year’s time the Eco-Schools students will once again visit the ministry to see if the recommendations they put forward were adopted.The audit was conducted by students from the following Green Flag Schools: St Thomas More College secondary school, Santa Lucia, St Augustine College secondary school, St Thomas More College middle school, Tarxien, The Archbishop’s Minor Seminary, Rabat, St Nicholas College primary school, Rabat, and San Ġorġ Preca College Primary A, Paola.\nThe Eco-Schools programme has been running in Malta by Nature Trust – FEE Malta since 2002. It has today reached over 83 per cent of the entire student population in independent, State and Church schools. The Eco-Schools programme is an international programme run by FEE International and has been acknowledged by the UN as the largest global network promoting Education for Sustainable Development in schools and communities.", "comment_count": 0, "id": 3847}, {"keywords": "Gozo", "author": "", "article_body": "Sir M.A. Refalo Sixth Form council and alumni society organised its annual public lecture at the Gozo Ministry in Victoria. ‘Art Music in Gozo in the 19th-Century Practice and Influences’ was conducted by Joseph Grech. Mro Grech (pictured) presented a general overview of his doctoral research submitted to the University of Nottingham highlighting music practice in Gozo during the 19th century and any possible influences from Malta and mainland Europe. \n\nThe lecture was introduced by council president Joe Camilleri. The lecture was attended by Gozo Minister Justyne Caruana.", "comment_count": 0, "id": 3848}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Philatelic Society, in collaboration with the Victoria Capuchin community, launched a stamp cover on the 150th anniversary of the birth of Fra Baskal Farrugia. Fra Baskal, his baptismal name Salvu, was born in Żebbuġ, Gozo, on February 10, 1869. He joined the Capuchin Friars on Christmas Eve of 1890. The Servant of God spent almost all his life serving the sick friars, looking after the sanctuary of Our Lady of Graces and begging for alms for the sanctuary, which is situated on the road to Marsalforn. The cover was produced by Anthony Grech.", "comment_count": 0, "id": 3849}, {"keywords": "Education", "author": "John Mark Portelli", "article_body": "The International Baccalaureate (IB) is a not-for-profit educational foundation established in Geneva, Switzerland, in 1968. The founders of IB were looking for a programme of studies that, educational excellence apart, promoted peace in what was then a turbulent Cold War world. The programme was subsequently refined by Oxford University to promote critical thinking skills. Today IB aims at encouraging students across the world to become active, compassionate and lifelong learners who understand that other people, with their differences, can also be right.\nFifty years down the line, IB has consultative status as a non-governmental organisation at the United Nations Educational, Scientific and Cultural Organisation (Unesco), with the IB Diploma (IBDP) recognised by universities around the world as an outstanding, leading university admissions qualification.\nAccording to Howard Gardner, a professor of educational psychology at Harvard University, IBDP helps students “think criti­cally, synthesise knowledge, reflect on their own thought processes and get their feet wet in interdisciplinary thinking”.\nStudies by a number of universities have shown clearly that IBDP graduates are not only more likely to join university, indeed a top university, but importantly, are more likely to complete the course of their choice with success and a higher grade.\nThey are also more likely than peers following other university entrance curricula to be granted scholarships. This is probably largely due to the well-established fact that IBDP students join university better trained in academic research, writing skills and with a capacity to prioritise and organise their studies. A major component of the IBDP is the Extended Essay, a mandatory research paper of up to 4,000 words.\nInterestingly, accordingly to a 2013 study, in China, which is heavily dependent on higher education for its economic development, 72 per cent of students taking IBPD attended one of the world’s top universities. Research commissioned by the UK’s Higher Statistics Agency (HESA) established that IBDP students have a 57 per cent greater likelihood of being accepted by one of the top 20 UK universities. IBDP is now held in such high regard that a good number of top universities have substantially lowered admission levels for IBDP students.\nEducation is not only about obtaining good grades, ultimately on a global level, it is there to create a better and more peaceful world, which takes us back to the founding fathers of IB. On an individual basis, education is about preparing for life. The HESA survey has shown that post-university, IBDP students on average earn more than their peers.\nMark Seldon, director of studies at Gresham School, UK, an advocate of IB, commented: “The IB encourages the soft skills that business value – things like teamwork, communication and empathy.” Increasingly, in today’s globalised world, employers want young people to think more globally.\nIB teachers are an integral part of this success story. In order to teach IB, teachers must attend, on a regular basis, high-quality professional development workshops, more often than not at IB regional centres, as well as keeping up with advances via specifically designed online workshops. There is certainly no room for complacency for IB teachers, what they teach today, and how they teach it, is not what they will be doing tomorrow.\nAn essential element of IBDP is the structured Creativity, Activity and Service (CAS) programme. This ensures that students involve themselves in creative thinking, a healthy lifestyle complementing academic work, and finally at the root of it all, unpaid, voluntary community work.\nFundamental to all this is that no points are awarded for CAS in the final IBDP grade, a true lesion in altruism. However, in the end, students get out of it far more than they put into it. In research studies, business leaders have commented on the project management skills of IBDP students, their work ethic, their open mindedness and level of self-confidence.\nIn this village we still call the world, there is a growing demand for an international curriculum-based education. St Edward’s College is one of the ever-increasing number of IB World Schools, currently 4,871 in 153 countries across all five continents. IB accreditation is not only a rigorous process, it is also an ongoing process subject to periodic review.\nYear in, year out, since obtaining IB accreditation in 2009, St Edward’s IB pass rate has been above the world average. St Edward’s IBDP graduates continue to be admitted to the University of Malta as well as leading universities worldwide, including the London School of Economics, Imperial College, London, UCLA in the US, McGill in Canada, Bocconi in Milan, the Medical University of Gdansk, Poland, LUISS Business School in Rome, and Groningen in The Netherlands and Berlin.\nEqually important is the feedback the college has received as a result of its CAS programme. For example, students learn and carry for their lifetime the satisfaction of mornings spent with the less fortunate at the Appoġġ summer school in Cospicua, a lesion from the big wide world that no amount of academic input can substitute.\nSt Edward’s College offers home from home boarding facili­ties. Give your teenage son or daughter the best insurance poli­cy – a global mindset with an international curriculum and an appreciation of the ‘dignity of difference’ – an IBDP.\nJohn Mark Portelli is chairman of the Board of Governors of St Edward’s College, Cottonera.", "comment_count": 0, "id": 3850}, {"keywords": "Gozo", "author": "", "article_body": "Students attending the Barts Medical School (Queen Mary University of London) in Gozo took part in a Health Day in Victoria on February 9.\nThe students were divided into groups and assigned specific tasks, including taking a brief medical history of each patient, measuring their blood pressure and blood glucose level, as well as conducting a two-lead ECG cardiac assessment.\nThe exercise was an extremely valuable experience for the students, who obtained further exposure in dealing  with patients and providing basic medical care. It was a great way to gain confidence in building a patient-doctor rapport. Supervising the first and second year students were University senior lecturer Elizabeth Prabhakar and cardiologist Albert Fenech (fifth from right).", "comment_count": 0, "id": 3851}, {"keywords": "Education", "author": "", "article_body": "The Malta College of Arts, Science and Technology (Mcast) recently issued for public consultation its strategic plan – an ambitious, seven-pillar policy document intended to guide its investments, academic focus, networking approach and quality structures for the next cycle of the college’s development in the years 2019 to 2021.\nThe college said that its evolution has been characterised by a constant drive to provide students with opportunities to obtain professional and vocational education and training, and acquire skills relevant for industry. During the consultation the college administration revi­sited the positive developments and challenging aspects as a result of the reforms implemented at the college.\nThe four-week public consultation phase, which ends on March 8, forms part of an extensive eight-month consultation process launched last August to take stock, review and chart Mcast’s strategic direction for the years ahead.\nThe first phase of the consultation process included a seminar with Mcast’s senior management team, internal workshops with lecturing staff members in each Mcast institute, an internal consultation workshop with administrative and support staff at the college, and a first round-table consultation session with employers, social partners and other stakeholders of the college.\nTo supplement the feedback received during these workshops and meetings, Mcast is now soliciting feedback from the public on how it can improve its strategic direction.\nThe process will culminate in the second quarter of this year with the launch of a three-year strategic direction for the college.\nFor further information visit www.konsultazzjoni.gov.mt.\nFeedback can be e-mailed to strategyconsultation@mcast.edu.mt.\nA five-minute survey questionnaire is also available at https://www.surveymonkey.com/r/TTRYTQD .\nA soft copy of the strategic plan is found on the website below.\nhttps://www.mcast.edu.mt/257", "comment_count": 0, "id": 3852}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Bishop Mario Grech opened a special exhibition at Il-Ħaġar museum in Victoria. Sub Tuum Praesidium is being held on the occasion of the diocesan Marian Year. The exhibition showcases paintings, statuettes and other artefacts showing different aspects of Our Lady’s life and cult. The exhibits belong to various churches and institutions, as well as private collectors. Picture shows Fr George Frendo (second from left) giving details about one of the paintings to visitors, including Gozo diocese vicar general Mgr Tarcisio Camilleri (first from left).", "comment_count": 0, "id": 3853}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Nationalist MEP David Casa called on the government to carry the financial burden of an EU directive that would be increasing paternity leave to 10 days.\nThe proposed Work-Life Balance directive, led and negotiated by Mr Casa himself, was given the green light by the Council of Ministers earlier this month, taking it one step closer to becoming EU law.\nThe directive would introduce 10 days of paternity leave remunerated at not less than the national sick pay level and introduce two months of paid leave for each parent that can be used until the child is eight years old.\nUnder Maltese law, mothers can benefit from up to 18 weeks leave, however, fathers only enjoy a single day of birth leave.\nThe proposed directive would also see a five-day annual carer’s leave for workers to care for sick relatives and the right for employees to request flexible working arrangements.\nSpeaking at a public debate at Europe House, in Valletta, Mr Casa noted that the requirements laid down by the directive were minimum benchmarks for all member states. It was also up to every country to decide who would financially cover these rights. “I believe this is a social benefit and I urge the government to carry its financial burden,” he said.\nAnna Borg, from the Centre for Labour Studies, insisted that now was the time to walk the talk if we believed in equality. “Now is the right time, considering that the economy is doing well. We need to be bold and brave and provide a packet that is not cosmetic but one that makes sense for the employers and society in general,” she said.\nThe Chamber for Small and Medium Enterprises – GRTU last month shot down the directive proposal and the Malta Employers’ Association said it resisted any further financial burdens on employers. However, the Association for Equality welcomed the move and said 10 days were “the least fathers should be granted”.\nA vote in the European Parliament, first in the Employment and Social Affairs Committee and then in the plenary, possibly in March, is required for the directive to become law.", "comment_count": 42, "id": 3854}, {"keywords": "", "author": "Herman Grech", "article_body": "A Maltese man and his wife were killed in a plane crash in Texas, the US, on Friday. \nThe pilot, Carmel Azzopardi, 75, and the passenger, Paula Azzopardi, 49, both of Amarillo, were killed in the crash in Roberts County, just west of the Hemphill County Line, according to the Texas Department of Public Safety.\nInvestigators said the Cessna C421 crashed for reasons still under investigation, according to media reports.\nNo further details were provided.\nMr Azzopardi migrated to the US when he was young and his three children live in Malta, Times of Malta is informed. \nAn animal lover, Mr Azzopardi was a regular visitor to Malta, having visited the island just last November.\nHe held both a light aircraft and helicopter license.\nThe Foreign Ministry said they were in contact with the US authorities about the incident.\nCarmel Azzopardi was a keen pilot.", "comment_count": 8, "id": 3855}, {"keywords": "", "author": "Jacob Borg", "article_body": "Norway has banned transactions with six Malta-based gaming firms, which it accuses of operating “illegally” within its territory, the Times of Malta has learnt. \nA spokesman for the Norwegian Gaming Authority said the regulator had ordered banks in its jurisdiction to block payments to and from accounts identified as being used for processing gambling transactions.\nThus, Norwegian banks cannot transfer money to accounts held by the six companies, which, according to the gaming watchdog, were found to be marketing themselves in Norway and offering online casino and betting services to players there without its permission.\nThe Betsson Group, Co-Gaming Ltd, L&L Europe Players Ltd and the Gaming Innovation Group were sent warning letters last November about their “illegal” operations in Norway. Another two warnings were received by the Kindred Group and Lucky Dino Gaming Ltd this month.\nOnly two gaming companies are licensed to operate gambling services in Norway.\nThe spokesman said letters highlighting Norwegian regulations had been sent to both the companies and the Malta Gaming Authority.\nL&L Europe Players hit the headlines in Sweden after journalists from the daily newspaper Dagens Nyheter uncovered a minority shareholding held by Tumas Group CEO Yorgen Fenech, whose interests in the gaming company were hidden behind nominee shareholders.\nNo wrongdoing on the part of either L&L Europe Players or Mr Fenech was alleged. \nMr Fenech’s shares in the gaming company are held through TL Limited. His ownership is obscured through Trusforte trusts, which holds half of the shares in TL Limited on his behalf. \nAccording to TL Limited’s 2017 accounts, the company made a profit of €660,000 that year.\nRead: 17 Black owner identified as local power station businessman\nIt emerged last October that Mr Fenech owns 17 Black, a secret company described in a leaked e-mail as a primary source of income for Panama companies owned by the Prime Minister’s top aide, Keith Schembri, and Tourism Minister Konrad Mizzi. The e-mail, sent by their financial advisers Nexia BT, said 17 Black would pay up to $2 million to the Panama companies. All those involved deny any wrongdoing.\nAn investigation into 17 Black began but sources said not much had been achieved by the police so far notwithstanding information handed over to them by the Financial Intelligence Analysis Unit identifying Mr Fenech as being 17 Black’s owner.", "comment_count": 20, "id": 3856}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Maltese Federation of Aquaculture Producers’s CEO, Charlon Gouder, no longer acts as policy adviser to the minister responsible for fisheries.\nA spokesman for Environment Minister José Herrera said Dr Gouder, a former Labour Party journalist, stopped serving as the minister’s policy consultant soon after he was chosen by the local tuna ranchers to act as their chief lobbyist with the local authorities.\n“Dr Gouder’s role as a policy consultant to the minister was terminated on September 9, 2018,” the spokesman said.\nIt could not be established whether Dr Herrera had asked his former private secretary to leave the post or whether it was Dr Gouder himself who decided to step down after becoming a lobbyist for the lucrative industry regulated by the Environment Ministry.\nJust a few days before his formal resignation, Dr Gouder gave interviews in his new public role as CEO of the Aquaculture producers.\nA former journalist on One TV who later graduated as lawyer from the University of Malta, Dr Gouder immediately joined Dr Herrera’s private secretariat upon Labour’s return to power in 2013. First acting as private secretary to the then parliamentary secretary, Dr Gouder resigned his post upon becoming a lawyer and started serving as Dr Herrera’s policy consultant in 2015, when he was put on a €40,000 remuneration package.\nRole as a policy consultant to the minister was terminated\nAlthough unknown in the fishing industry, Dr Gouder was chosen to act as their main lobbyist by the tuna industry soon after Dr Herrera was given the fisheries portfolio.\n“We are very happy with Dr Gouder because he seems to be very keen on the subject and the promotion of our interests,” a tuna industry insider said.\nAsked whether tuna farm operators had chosen the former Labour MEP candidate due to his familiarity with their minister, another insider said: “You know such things never cross the tuna industry’s minds,” he said sarcastically.\nEarlier this week, Dr Gouder was very vociferous on the need to keep the tuna industry “clean” following media reports originating from Spain about alleged corruption involving the director general of fisheries, Andreina Fenech Farrugia, and Spanish tuna magnate José Fuentes. She was suspended by Dr Herrera as soon as the allegations were made public.\nRead: Fisheries corruption claims ‘just tip of iceberg’\nOn behalf of the lobby, Dr Gouder applauded Dr Herrera’s quick action and insisted on the need to defend Malta’s industry.\nMare Blu Tuna Farm Ltd, owned by Fuentes and John and Massimo Cappitta, is the only tuna ranch on the island that is not a member of the Malta Federation of Aquaculture Producers. ", "comment_count": 15, "id": 3857}, {"keywords": "", "author": "Denise Grech ", "article_body": "The decision to drop a number of libel cases, including against the Times of Malta, was not influenced by the fact that Nexia BT partner Karl Cini was set to testify, Tourism Minister Konrad Mizzi has insisted.\nDr Mizzi had sued former Opposition leader Simon Busuttil and other Nationalist MPs for libel over comments in connection with secret company 17 Black and his own Panama company.\nThe minister instructed his lawyers to stop the libel suits just weeks before Mr Cini was due to testify about e-mails relating to 17 Black. However, he insisted such testimony had “no bearing whatsoever” on his decision.\nRead: 'I was damn right. Konrad Mizzi is corrupt': Busuttil says as minister drops libel cases\n“We had the Egrant inquiry, which clearly stated that I did not have any connections with Pilatus Bank or Azerbaijan, as claimed. There were clear decisions by the court twice that there was no evidence of any wrongdoing on my part,” he said.\nRead: 'I know nothing,' Konrad Mizzi denies links with secret company during court grilling\nWhen it was pointed out that magisterial inquiries into allegations of alleged kickbacks and corruption, also in his regard, were still ongoing, Dr Mizzi insisted he had already clarified his position and also testified under oath on the matter. “I subjected myself to full scrutiny, day in, day out,” he said. “I respect the media to subject me to scrutiny. That is your job.”\nClear decisions by the court twice that there was no evidence of any wrongdoing on my part\nAsked why he refused to invite the independent media to events he attended given the media’s job was to scrutinise MPs, the minister replied that was not the case. “I was inviting the media and there were occasions where I was misrepresented or even not quoted,” he said.\nOn the Corinthia Group land deal, Dr Mizzi said the company guaranteed it would not pursue land reclamation initiatives and that there would not be residential development beyond 25,000 square metres. Furthermore, a clause would be included in the deal barring the hotel chain from selling part of the project unless it was approved by the government.\nThe original draft deal, which Dr Mizzi had already presented to parliament, went back to the drawing board following vociferous opposition by different quarters.", "comment_count": 72, "id": 3858}, {"keywords": "", "author": "Denise Grech ", "article_body": "The White Paper on renting fell short of expectations in providing concrete, long-lasting solutions, the Chamber of Commerce, Enterprise and Industry said.\nThe document, published in October, proposed mandatory minimum leases as one possible means of tackling the instability and uncertainty of six-month leases. It also recommended financial incentives for contracts longer than a year.\nThe Chamber of Commerce said the White Paper did not give solutions that would overcome the issues causing the prevailing rental problems. It called for a “clear and directional role” for the Planning Authority in ensuring supply of affordable housing.\nThe planning watchdog had to ensure housing prevented overdevelopment for speculative purposes, the Chamber said, recommending a thorough audit of all private and public vacant property followed by efforts to put vacant property to good use.\nThe Chamber also called for a reassessment of the Individual Investors Programme’s property investment eligibility criteria.\nIt called for feasible, effective and reversible housing solutions that created an immediate supply of “affordable, comfortable, yet, reversible” accommodation.\nThe status quo in the private rental sector was not sustainable, it warned. “The country, its society and economy cannot afford the current rate of increase in accommodation costs to persist,” it said. “Strong and timely action is required to tackle the different factors that are contributing to the situation in order to safeguard the quality of life and sustainable growth in Malta,” the Chamber said.\nThe organisation representing the private sector noted that the country’s economic growth brought excess demand for labour, which could not be satisfied with Maltese workers. The labour market, consequently, became reliant on the consistent attraction of additional foreign workers, it noted.\n“This has benefitted the country significantly from an output perspective but it is also cause for substantial stress on the country’s infrastructure and, most notably, on the housing market,” the Chamber said.\nIt noted that, due to the irreversible nature of construction, it would be detrimental for the country to flood the market with new residential property that could remain vacant when the economic cycle eventually turned.", "comment_count": 1, "id": 3859}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The directors of a construction company and a foreman were fined almost €35,000 between them after they were found responsible for the death of a man who fell a height of nine storeys a day after turning 27.\nJames Aquilina died just two weeks after he started working for Devlands Limited.\nThe incident happened at about 11am on November 26, 2007, when Mr Aquilina, from Siġġiewi, was working with a colleague on the top floor of a block of apartments in Triq it-Tamar, Qawra.\nRead: Five accused of causing worker's death in fall\nDevlands directors Charles Deguara, 71, from Iklin, Martin Deguara, 63, from Naxxar, Brian Micallef, 40, from Mosta and Emmanuel Micallef, 70, also from Mosta, together with foreman Antoine Mallia, 46, from Birkirkara, were found guilty of involuntarily causing Mr Aquilina’s death.\nThey were also found guilty of failing to take appropriate measures to ensure no one working on the project would injure himself, failing to make a proper risk assessment on dangers to their workers’ health and safety and of ensuring that safety barriers, handrails and safety nets were in place to ensure proper health and safety standards.\nFailing to take appropriate safety measures\nMr Aquilina was working with his colleague, Joseph Taliana, when the incident happened. Mr Taliana told Magistrate Josette Demicoli that Mr Aquilina was squatting, placing spacers on the wooden shuttering prior to applying cement when he fell into the lift shaft, a drop of 27 metres, while moving backwards.\nThe directors and the foreman argued they were not responsible for the fatality, saying the incident occurred because Mr Aquilina was careless. They claimed that, his birthday having fallen the previous day, he probably went out that night.\nBut the court still held them were solely responsible for the man’s death. A pathologist reported that Mr Aquilina had negligible alcohol in his blood.\nThe magistrate also found that, despite his insistence to the contrary, Mr Mallia was responsible for the daily running of the construction site and workers had testified they used to receive orders from him. \nShe fined each of the four directors €7,000 and Mr Mallia €6,750.\nPolice Superintendent Maurice Curmi and Police Inspector Therese Sciberras prosecuted.\nHow the Times of Malta reported the incident in November 2007.", "comment_count": 0, "id": 3860}, {"keywords": "", "author": "", "article_body": "Updated at 12.50pm\nActivists paid tribute to slain journalist Daphne Caruana Galizia on Saturday by placing cardboard cutouts of huge letters in front of Castille calling for action to find out who commissioned her murder.\nMs Caruana Galizia was killed in a car bomb on October 16, 2017. Although three men have been charged with her murder, the mastermind remains unknown.\nThe letters, shaped into a scrabble-like formation and pointedly asking ‘Who Killed Daphne?’ were laid by members of Occupy Justice, a group of activists led by women.\nIn a statement, they said the Prime Minister could look out of his office window and enjoy the view of the question people have been asking for the last 16 months.\n\"Maybe that will remind him that the assassination happened under his watch,” Occupy Justice said.\nWords like ‘impunity’, ‘corruption’ and ‘desperate’ formed part of the activists’ life-size scrabble, as they insisted that they did not want a country of anarchy, but they wanted ‘answers’, ‘liberty’, ‘action’ and ‘truth’.\n“We cringe when we see the Prime Minister protect the two crooks by his side – his chief of staff Keith Schembri and his top minister Konrad Mizzi – both of whom have set up a money laundering structure in order to receive illicit kickbacks from Yorgen Fenech’s 17 Black.”\n“We cringe some more when they pathetically try to shut up anyone who asks questions,” they said, in reference to the constant removal of the makeshift memorial set up spontaneously at the foot of the Great Siege monument in front of the law courts as a daily reminder that there is no rule of law in Malta.\n“Sixteen months on we still do not know who commissioned the killing of Daphne Caruana Galizia and there is not even a semblance of a search for an answer. Prime Minister, Keith Schembri, Konrad Mizzi and Yorgen Fenech, we shall not rest until you carry the responsibility of your actions.”\n \n ", "comment_count": 137, "id": 3861}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority on Thursday postponed a hearing on plans to double the number of tuna cages at a farm off Sikka l-Bajda, amid bribery allegations against suspended fisheries director Andreina Fenech Farrugia.\nAzzopardi Fisheries, which has not been linked to the scandal, had applied to increase its cages at the offshore site from 12 to 24, the company saying they will not hold any additional tuna but will ensure the fish have enough space to reach optimal size before harvesting.\nA decision was expected by the PA  but the hearing was pulled from the agenda at the request of the executive chairman, according to a notice sent to interested parties, with no further explanation given.\nA parallel application by the Fisheries Department to set up a formal north aquaculture zone, filed by Dr Fenech Farrugia, is still being processed, with a public meeting on its environmental assessment held as scheduled on Tuesday.\nDr Fenech Farrugia is facing allegations, which she denies, of demanding money off a Spanish tuna kingpin. The claims emerged on Monday from investigations forming part of an EU-wide probe into the illegal tuna trade.\nThe party had repeatedly spoken out against the shady goings-on in the sector\nThe decision to postpone the hearing was welcomed by the Democratic Party, after leader Godfrey Farrugia had called for the application to be suspended as news of the scandal broke. He said the party had repeatedly spoken out against the “shady goings-on” in the sector, noting that the Auditor General had also highlighted inadequacies and inefficiencies in marine protection last year. \nAccording to Azzopardi Fisheries, the application to double the number of cages was necessitated by its forced relocation to the offshore site, about five kilometres off Sikka l-Bajda, following a mass revocation of tuna farms’ operating permits after repeated breaches of conditions.\nThe relocation was intended as a temporary, two-year measure pending approval of a designated aquaculture zone in the same area. The operators said that as a result of the relocation, stocking density in the permitted cages was double that of previous years, such that the tuna did not grow to full size due to excessive competition in a relatively small area.\nThe total biomass in the farm will remain within the legal limit of 3,300 tonnes.\nThe application is recommended for approval and the Environment and Resources Authority concluded that significant environmental impacts were unlikely if appropriate mitigation measures were applied.", "comment_count": 5, "id": 3862}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The St Julian’s local council is proposing the embellishment of the chaotic Spinola Square, described by many, including the mayor, as “an eyesore”.\nThe project, discussed and approved by the council before being opened for public consultation, plans to create more open space and pedestrianise a substantial part of the square where double parking is the order of the day.\n“We need to do something about that pjazza. It’s an eyesore and doing something about it is a must. So far, our ideas have been well-received by the public. We will be hearing people’s comments before preparing final plans with which to embark on the official permitting process with Transport Malta and the Planning Authority,” mayor Guido Dalli told Times of Malta when contacted on Friday.\nHe said the council had already filed the necessary applications to benefit from the PA’s Development Planning Fund, which promotes improvement and embellishment works in urban areas.\nCovering an area of about 7,500 square metres, the project will pedestrianise large swathes of the square and will include the removal of the existing Sacred Heart roundabout. The statue will be moved a few metres and incorporated in the new pjazza.\nThe project will pedestrianise large swathes of the square\nThe statue of St Julian in front of the Saddles Pub will remain there.\nIn an attempt to address the flooding problem in the square, the pedestrianised area will be raised so rainwater culverts can pass underneath to channel rainwater into the sea. There will be a water feature in the new pedestrianised area.\nAn antique horse trough, lying derelict behind the bus stop, will be restored and incorporated in the water feature as well as a number of arches now used for rainwater runoff.\nThe council’s architect, Toni Bezzina, said the proposed project in one of the few remaining open areas in the locality would provide residents and visitors with a much-needed open space. \n“Apart from the creation of an open space, the project will alleviate traffic congestion, upgrade public transport and cycling facilities while prioritising pedestrian accessibility,” he said.\n“The use of proprietary materials like żonqor (hard stone), lava and porfido paving materials coupled with landscaping and water features aim to revive the character of the locality of St Julian’s,” he added.\nA consultation meeting was held on Wednesday during which suggestions were put forward by residents and other stakeholders. The council said it planned to take these ideas and suggestions on board as much as possible.", "comment_count": 55, "id": 3863}, {"keywords": "", "author": "", "article_body": "Updated 5.55pm with MIDI's reaction\nMIDI has rejected claims it wants to build a series of 10-storey apartment blocks at Manoel Island, contradicting statements made by the Democratic Party earlier on Saturday.\nThe development of Manoel Island contemplates a series of residential clusters which do not exceed four floors, the consortium said in a statement.\nThe residential clusters will be built on a sub structure, built to house service roads, car parks and infrastructure, which extends up to eight metres above sea level. The overall building heights on Manoel Island will range from 20.8 metres to 27.5 metres when measured from mean sea level, with the highest points being at the centre of the island in view of its topography, MIDI said.\nEarlier, PD declared itself against new proposals submitted by MIDI to reclaim land from the side of Manoel Island that faces the Gżira promenade.\nMEP candidate Anthony Buttigieg said in a statement on Saturday the new blocks meant that more than a quarter of the area of the inlet sea between the Gżira promenade and Manoel Island, stretching from the far end of the yacht yard to the bridge, would be landfilled to accommodate MIDI. He said more reclaimed land on the Gżira side was to be given to two adjoining hotels so that they share a lido.\n“This is sheer nonsense. It has strong negative impacts,” Dr Buttigieg said.\nMEP candidate Camilla Appelgren added that land reclamation always comes at the cost of damage to an ecosystem and should be the very last resort when all other options have been exhausted.\nPD said it was not in favour of such a proposal as detailed by MIDI and supported Gżira residents in their concerns.\nIt noted that the Public Domain Act had been intentionally side-lined and thrown in the abyss, and Malta’s environmental legislation was too weak to safeguard encroachment of development on reclaimed coastal land.\nNot a new proposal - MIDI\nBut in reaction, MIDI said the reclamation of the sea area in front of Gżira is not a new proposal.\nThe reclamation of the area between the existing bridge and the yacht yard is a contractual obligation in terms of the deed of emphyteusis between MIDI and the government.\nThe reclamation is contemplated in the existing outline development permit and the same area is included for reclamation in the new outline development application.\nThe reclaimed area in front of the yacht yard is to be allocated to the government for use by the yacht yard and the area reclaimed at the entrance to Manoel Island will be developed by MIDI.\nIn order to reduce the impact on the Gżira waterfront, the new outline development application contemplates that the building to be developed at the entrance to Manoel Island will be retreated by more than 20 metres when compared to the existing outline development permit.", "comment_count": 7, "id": 3864}, {"keywords": "", "author": "", "article_body": "Those thinking of becoming organ donors are being urged to take the plunge and join a list of personalities who have already signed up.\nThe latest step in the Life After Drew campaign is inviting individuals to register to become donors, take a selfie featuring a heart and post it on Facebook or Instagram together with a message encouraging others to follow suit.\nThe personalities who have already heeded the appeal, launched on Valentine’s Day, include the presenters of the Ilsien in-Nisa TV show − Clare Agius, Pauline Agius and Claire Agius Ordway, entertainer Rodney Gauci, actor Edward Mercieca, actress Laura Vella, weightlifter Yasmin Zammit Stevens, Anna Vella, Michelle Muscat, Pauline Vassallo and Patricia Galea from the Health Promotion Unit, actress and singer Tezara, entrepreneur Winston Zahra and his family and Vibe FM’s breakfast crew, Martina Zammit, Jonathan Abel and JD Patrick.\nThe Life After Drew campaign was created in collaboration with the Transplant Support Group Malta about two years ago, when Kenneth and Sharon Abela lost their son, Drew. The 20-year-old died suddenly after suffering a brain haemorrhage in the summer of 2016 and the parents decided to donate his organs. This noble gesture proved to be a lifesaver for seven recipients.\nRead: ‘Living proof one kidney is enough’ - two men share their experiences\nPresident Marie-Louise Coleiro Preca was one of the first to sign up as an organ donor after the campaign was launched.\nSharon Abela, Drew’s mother, recently told Times of Malta some relatives of people who passed away found it difficult to give their consent if the deceased had not registered as a donor. She, therefore, encouraged people to register and help put their relatives’ minds at rest. One can become a donor by either registering online or filling an application form and then sending it via e-mail or by post.\nLook up the Facebook page Transplant Support Group − Malta or log on to www.transplantsupport.org.mt for more information.", "comment_count": 4, "id": 3865}, {"keywords": "", "author": "", "article_body": "Ratings agency DBRS Ratings GmbH (DBRS) has confirmed Malta’s long-term foreign and local currency rating at A (high).\nIn a statement, the government said this was the best rating this agency had ever given Malta.\nIt also confirmed its short-term foreign and local currency R-1 (middle). The trend on all ratings is stable.\nDBRS said it based its considerations on the fact that economic momentum remained strong, with gross domestic product (GDP) growth accelerating to 7.5% year over year in last year’s third quarter.\nThe Central Bank of Malta’s latest estimates pointed to full year growth at 5.9% in 2018.\nDBRS expected GDP growth to decelerate gradually but to remain high in years to come, especially when compared with its European peers.\nBenefiting from tax-rich economic growth, fuelled by domestic demand, strong job creation, and the impulse from its International Investment Programme (IIP), the CBM estimated Malta’s fiscal surplus stood at 2.1% of GDP in 2018.\nAgainst this backdrop, the Maltese government’s debt-to-GDP ratio could drop to 45% in 2018, according to the CBM. DBRS expected the debt ratio to continue to decline related to the primary surplus and the favourable debt snowball effect.\nThe rating confirmation reflected DBRS’s view that despite the upward pressure from improving economic and public finance metrics, Malta’s structural challenges continued to constrain the ratings.\nGiven the size and openness of the economy, external developments, including international corporate taxation or regulatory changes, could negatively affect economic and fiscal variables.\nMalta’s A (high) rating was supported by its euro zone membership, strong external position, low reliance on external financing, favourable public debt structure, and households’ strong financial position.\nHowever, Malta’s contingent liabilities, stemming from its large state-owned enterprises and concentrated financial sector, and rising age-related costs are potential sources of vulnerability for public finances. Malta’s small and open economy exposed the country to external developments.\nDBRS said the Stable trend reflected its opinion that further upgrades were unlikely in the absence of:\n(1) a sustained material reduction in the public debt ratio to low levels driven by sound fiscal management and economic performance; or\n(2) further evidence of increased economic and fiscal resiliency to external shocks, including changes to the international tax or regulatory environment.\nWhile DBRS’s baseline factored in a relatively positive economic and fiscal outlook, a deterioration in the trajectory for public debt in the medium term could exert downward pressure on Malta’s ratings.\nThis could derive from:(1) a deterioration in growth prospects,(2) sustained worsening of fiscal and debt indicators, or(3) the materialisation of contingent liabilities.\nRating rationale\nMalta continued to outperform EU average growth rates with broad-based expansion\nRecent economic performance, DBRS said, had been remarkable, with 7.2% annual average\nGDP growth from 2013 to 2017, was well above the 2.1% average rate between 2004 and 2012.\nIn this context, Malta’s GDP per capita (€24,984) continued to converge to EU average levels (€30,946) in 2018, as per EC estimates.\nGrowth was broad-based with outward-facing sectors such as tourism, gaming, financial and business services being key contributors to Malta’s outperformance.\nA highly elastic foreign labour supply, increased labour participation rates, and a rising share of less capital-intensive service sectors prevented overheating pressures. According to EC estimates, potential GDP growth jumped from 2.5% from 2004 to 2012 to 6% from 2013 to 2018.\nThe International Monetary Fund’s projected an annual average GDP growth rate of 3.8% between 2019 and 2022.\nStrong domestic demand, as well as supply factors, would continue to support growth in Malta. Higher investment, increased labour supply, and enduring benefits from the energy reform would continue to buttress potential output.\nAddressing emerging infrastructure bottlenecks and labour shortages in certain sectors, which could weigh increasingly on growth, would remain a challenge.Malta’s open economy was the smallest in the euro area and was vulnerable to weak external demand and lower foreign direct investment.\nOn the other hand, the private and public-sector reliance on domestic funding reduced the risks from financial markets contagion. In the short term, major risks stemmed from an escalation of protectionist trade measures hurting global trade and growth as well as the impact on tourism from Brexit.\nIn the medium term, changes in international corporate taxation could to some degree diminish the attractiveness of Malta for multinational companies. Also, the gaming industry in Malta could also be affected by regulatory changes at the EU level.", "comment_count": 86, "id": 3866}, {"keywords": "", "author": "", "article_body": "These are the top stories in Saturday’s newspapers.\nTimes of Malta says no disciplinary action has been taken against a soldier facing criminal charges over a violent assault on a 15-year-old student earlier this month. In another story, the newspaper says the directors of a construction company and a foreman were fined almost €35,000 between them after they were found responsible for the death of a man who fell a height of nine storeys a day after turning 27.\nThe Malta Independent quotes Tourism Minister Konrad Mizzi saying there was no deadline for the Corinthia deal but negotiation developments are to be announced.\nIn-Nazzjon says the Nationalist Party has come up with more proposals for cancer patients, professionals and organisations.\nL-Orizzont speaks to a Cyber Crime Unit inspector who warns the public not to answer or return scam calls.", "comment_count": 0, "id": 3867}, {"keywords": "", "author": "Claire Caruana", "article_body": "No disciplinary action has been taken against a soldier facing criminal charges over a violent assault on a 15-year-old student earlier this month, Times of Malta has learnt.\nA spokeswoman said the Armed Forces of Malta was awaiting the court’s “final judgment” before taking action.\nAlexander Camilleri and his brother, Feliciano, were accused of having injured two school officials and a student at Pembroke earlier this month. The soldier spent a few days in preventive custody before he was granted bail against a deposit of €2,500 and personal guarantee of €2,500.\nThe school assistant head testified in court she saw the soldier holding a 15-year-old student “in headlock under his right arm” and “rained punches”.\nThe student could himself face charges over an alleged attack on another student, Mr Camilleri’s nephew.\nThe army spokeswoman said decisions on the soldier’s future would be made once judgment was handed down.\n“Mr Camilleri’s retention in the AFM in relation to the alleged offences, which are of a criminal and not military or internal nature, will be considered upon final judgment by the courts of law, in respect also of the presumption of innocence governing criminal proceedings,” she remarked.\nIn line with army procedures, “the adoption of internal measures intended for precautionary and preventive purposes, are currently ongoing”, the spokeswoman continued.\nNo information on the nature of these measures was supplied.\nRead: Boy in hospital with head injuries after attack at Pembroke secondary school\nQuestions on the issue sent to the Home Affairs Ministry remained unanswered, with a spokeswoman telling the newspaper the government “had nothing more to add to what the Armed Forces of Malta said”.\nThe army’s decision to first wait for the court to decide before taking action has raised eyebrows in military circles, with some quarters drawing parallels between this case and that of former Bombardier Godwin Schembri. The bombardier was discharged from the force at the end of last year after a video of him mocking the army over a gate it installed in Pembroke went viral on social media.\nThe bombardier asked for his job back last month, when he filed a judicial protest in which he argued that the decision to sack him was unreasonable and discriminatory.", "comment_count": 128, "id": 3868}, {"keywords": "", "author": "Sarah Carabott", "article_body": "PN MEP David Casa called on the government to carry the financial burden of an EU directive that would be increasing paternity leave to 10 days.\nThe proposed Work-Life Balance directive, led and negotiated by Mr Casa himself, was given the green light by the Council of Ministers earlier this month, taking it one step closer to becoming EU law.\nThe directive would introduce 10 days of paternity leave remunerated at not less than the national sick pay level, and introduce two months of paid leave for each parent that can be used until the child is eight years old. By Maltese law, mothers can benefit from up to 18 weeks leave, however fathers only enjoy a single day of birth leave.\nIt would also see a five day annual carer’s leave for workers to care for sick relatives and the right for employees to request flexible working arrangements. Speaking at a public debate at Europe House in Valletta, Dr Casa noted that the requirements laid down by the directive were minimum benchmarks for all member states.\nIt was also up to member states to decide who was going to financially cover these rights. “I believe this is a social benefit and I urge the government to carry its financial burden,” he said. \nAddressing the same debate, Anna Borg, from the Centre for Labour Studies insisted that now was the time to walk the talk if we believed in equality. “Now is the right time, considering that the economy is doing well. We need to be bold and brave and provide a packet that is not cosmetic, but one that makes sense for the employers and society in general.”\nIn comments to the Times of Malta in January, the Chamber for Small and Medium Enterprises shot down the directive proposal and the Malta Employers’ Association said it resisted any further financial burdens on employers. However, the Association for Equality welcomed the move and said 10 days was “the least fathers should be granted”. The remaining phases for the directive to become law are votes in the European Parliament, first in the Committee on Employment and Social Affairs followed by a vote in the plenary, possibly in March.", "comment_count": 12, "id": 3869}, {"keywords": "", "author": "Jacob Borg", "article_body": "A Swedish MEP deplored what he termed as a “Russian-style” presentation made by Justice Minister Owen Bonnici to the European Parliament’s committee on financial crimes on Monday.\nMEP Gunnar Hökmark told the Times of Malta Dr Bonnici’s attempts to deny that there were corruption problems in Malta had damaged the country’s image.\n“I was surprised, and a little bit upset, by the fact that he denied everything. That is what they do in Russia. In Russia, they say there are no problems, that they have good systems,” Mr Hökmark said.\nThe minister spent the one-hour hearing on Monday fending off reports about rampant corruption and institutional failures in Malta. He told MEPs he had total trust in the country’s institutions.\nFor Mr Hökmark, having a justice minister denying there were problems in the country meant this same minister was part of the problem.\nThe Swedish MEP, who hails from the EPP political grouping, said that, in a normal situation, a justice minister would express concerns about the issues being raised and vow to address them.\nMr Hökmark said Dr Bonnici’s “damaging presentation” had damaged Malta and lowered the country’s standing in the committee’s perspective.\nSocialist MEP Ana Gomes, a vocal critic of the Maltese government, said she was stunned by Dr Bonnici’s ability to hide the reality in Malta and the “cold, smiling way in which he lied through his teeth about investigations in Malta into corruption, Daphne Caruana Galizia’s murder and 17 Black”.\nIn Russia, they say there are no problems\nMs Gomes said that, prior to the hearing, there might have been the impression that the Justice Minister was trying his best to defend Malta while not being fully in control.\nMr Hökmark was left unimpressed by the presentation. Photo: European Parliament\nHis presentation on Monday gave the impression that, on the contrary, he was fully in control, very knowledgeable about what was going on and using every means to thwart any serious investigation and exposure of what was happening in Malta, Ms Gomes said.\nGerman MEP Sven Giegold, from the European Greens, said Dr Bonnici was weak on all the substance and hid behind secretive magisterial inquiries.\nHe said shadows still loomed over Malta and, given the evidence in the 17 Black case, the country was not credible as long as the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi remained part of the government.\nNationalist MEP David Casa commented that “watching Minister Owen Bonnici attempting to defend the indefensible was painful”. He said the key issue remained that Mr Schembri and Dr Mizzi continue to hold public office, “despite the overwhelming evidence of corruption and money laundering against them”.\nMr Casa vowed to continue monitoring the case closely, saying that Malta’s biggest concern at this juncture was that the authorities were “dragging their feet to request and secure evidence from jurisdictions such as the UAE and this with the intention of subsequently claiming that evidence is insufficient for criminal prosecution”.\nLabour MEP Miriam Dalli defended Dr Bonnici and accused the European Parliament’s Committee on Civil Liberties, Justice and Home Affairs, of “blatantly” using two weights and two measures in its proceedings.\nShe insisted that on Monday the Justice Minister had “offered answers to all the questions that were posed to him”.", "comment_count": 305, "id": 3870}, {"keywords": "", "author": "", "article_body": "Two days after discovering a massive cyber attack, Bank of Valletta has resumed its SEPA payment services, although other payment systems remain down.\nAll other services are operating normally, however.\nBank of Valletta shut down all its operations on Wednesday morning after hackers broke into its systems and moved €13 million into foreign accounts.\nAll of the bank’s functions - branches, ATMs, mobile banking and even e-mail services - were suspended and its website taken offline.\nFor any queries customers are kindly asked to contact the BOV Customer Service Centre on customercare@bov.com or +356 21312020.", "comment_count": 3, "id": 3871}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An unemployed man, who admitted to having carried out an armed hold up at a confectionery store at Żabbar, was placed under a probation order by way of a lifeline intended to help him overcome his personal problems.\nThe 34-year old Żabbar resident, whose name was banned under court order, pleaded guilty upon his arraignment on Friday over charges of aggravated theft, having held a store attendant against her will, whilst also having been armed with a knife.\nHe was further charged of being a recidivist.\n“Having heard from both your lawyer and the prosecution about your personal problems – not problems of a certain nature - I believe that you can get out of this situation and overcome your problems,” magistrate Monica Vella said.\nIn the light of such circumstances, the court placed the accused under a probation order for three years. The man was also handed a €115 fine payable over 6 months.\nInspectors Fabian Fleri, Lydon Zammit and Eman Hayman prosecuted.Lawyer Francina Abela was legal aid counsel.", "comment_count": 0, "id": 3872}, {"keywords": "", "author": "", "article_body": "Some €22,000 were discovered by Customs officials stationed at the Airport on Friday. \nIn a statement, Customs said the discovery had occurred during a coordinated search in the departure lounge by the Department’s Anti-Money Laundering Team and the Canine Unit.\nThe officials were screening passengers when Sophie, the Customs sniffer dog, indicated that a particular passenger might be carrying large amounts of cash. Following a personal search of the passenger, the amount of €16,100 was detected.\nA thorough search on his hand luggage was then conducted with another €1,365 being discovered. Then, his two already checked-in personal pieces of luggage were off-loaded from the aircraft and a further €4,950 were discovered.\nThe total amount of undeclared cash amounted to €22,415.\nThe passenger was handed over to Police Anti-Money Laundering Unit for further investigations.\nHe is expected to be arraigned in court on Saturday.\nSophie's find comes just three weeks after her canine companion at Customs, Peter the sniffer dog, found €26,000 concealed on a passenger.\nLast year, the Customs department had a record-breaking year in undeclared cash cases as they strengthened their efforts in this area.\nCash over the sum of €10,000 needs to be declared to Customs when arriving or departing the country.\nCustoms put a cork in dodgy wine imports\nMeanwhile, during a routine market surveillance exercise, Customs Officials from the Enforcement Unit also seized 520 bottles of wine, without an excise duty stamp on them, from a restaurant in Paceville.\nAn investigation by the Department’s Excise Directorate into past imports by the same restaurant uncovered thousands of other wine bottles that were placed on the market without the appropriate taxes having been paid.", "comment_count": 4, "id": 3873}, {"keywords": "", "author": "", "article_body": "Kaċċaturi San Ubertu has objected to the hunting federation FKNK's lack of consultation over hunting turtle dove in spring, saying that the federation does not represent all hunting organisations in Malta and fails to recognise them.\n“If the cooperation of the remaining three organisations is being requested, the least that is expected is for these to be consulted before any decision that would affect their members is taken,” it said, referring proposals presented to the Prime Minister and the Parliamentary Secretary for Agriculture and Fisheries which were not shared.\nKSU has proposed an open spring hunting season for quail between April 5 and April 26 – but not for turtle dove.\n“Under these current circumstances, based on legal advice, KSU refer to the recent finch trapping derogation being found illegal by the European Court of Justice and is not prepared to take any risks with regards to turtle dove spring hunting - where any uncalculated decisions could lead to further Court action resulting in catastrophic consequences for future derogation on any form of spring hunting.\nKSU said that it was working on lifting the moratorium but said that as had happened with the derogation for trapping golden plover and song thrush, Parliamentary Secretary Clint Camilleri should put any proposal to the Commission for its prior approval.\n“Only after such assurances will KSU alter its decision on hunting turtle dove in spring without fear of facing other European Court action,”it said, stressing that there was only a limited time frame during which to apply for a derogation in spring.", "comment_count": 5, "id": 3874}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, his estranged wife and their daughter ended up in court when simmering tensions and constant disputes between them ended up in a full-scale fight in the apartment block where all three allegedly lived.\nEmanuel Galea, a 47-year old construction worker, stood at one end of the accused’s bench, while his ex-wife, Carmen Calleja, 51, and 25-year-old daughter Stephanie Galea stood at the other end, while a policewoman stood in the middle, to keep the two warring factions apart.\nAlthough initially the man was to be arraigned separately, upon a suggestion by defence lawyers, the court agreed to hear both arraignments jointly “as long as you don’t fight,” remarked Magistrate Monica Vella.\nWhile keeping facts to a minimum so as not to risk re-igniting tensions inside the courtroom, it emerged that the man lived with a new-found partner in a flat within the same block as his ex-wife, from whom he was separated.\nArguments allegedly broke out frequently, with the police being called in some five times within two days.\nHowever, tensions escalated and apparently came to a head last Wednesday afternoon when a fight broke out at the San Ġwann premises, during which stones were reportedly hurled and a ladder was used to inflict injuries.\nThe row landed father, mother and daughter in the dock facing a variety of charges.\nThe father pleaded not guilty to slightly injuring his ex, harassing her and his daughter, while breaching the peace. The wife and daughter likewise pleaded not guilty to harassment, threats and breach of peace. The daughter was separately charged with having involuntarily caused slight injuries to her father’s current partner.\n“The least said today, the better,” said David Gatt, defence counsel to Mr Galea, in an attempt to calm the potentially explosive situation, his suggestion seconded by Lennox Vella, assisting the mother and daughter.\nProsecuting Inspector Matthew Spagnol intervened, insisting that if the three were to be granted bail, they would preferably be made to sign the bail book on different dates “to avoid similar incidents in the future”.\nWhile the magistrate was writing out the bail decrees, her attention was caught by murmurs from the accused’s bench, where issues about “a water tap” seemed to be once again re-surfacing.\n“Don’t let me hear any squabbling among you,” warned the magistrate.All three were granted bail against a deposit of €500 each, a personal guarantee of €4,000 each and an order to sign the bail book twice a week, on different days to limit the possibility of their encounters.\nAll three were further placed under a Protection Order and strongly warned to steer clear of each other, father from mother and daughter and vice versa.\n“In such family disputes you must learn how to live together. If you breach one condition you’ll end up back here and then there will be no bail,” was the final warning.\nLawyer David Gatt was counsel to Mr Galea.Lawyer Lennox Vella was counsel to mother and daughter.", "comment_count": 0, "id": 3875}, {"keywords": "", "author": "", "article_body": "Updated Saturday at 11.20pm with AD's statement\n\nPolitical parties' refusal to discuss abortion and reproductive rights is \"frightening and unacceptable\", an MEP candidate has said.\nIn a Facebook live video, Alternattiva Demokratika's Mina Tolu noted that local politicians seemed determined to ignore the issue.\n“It seems all the political parties agree [to not discuss abortion]. But an estimated 300-400 people get an abortion overseas every year. An NGO has proposed a policy paper proposing decriminalisation of abortion in certain circumstances. The national youth parliament had also asked politicians to debate this,” she said.\nMs Tolu posted her Facebook live video one day after the UK-based Abortion Support Network announced that it would be extending its support services to Malta.\nThe organisation helps women contact abortion clinics and provides advice on how they can travel to obtain a safe and affordable abortion.\nIts announcement prompted significant and vocal outrage.\nThe MEP hopeful expressed shock at some of the threats and hateful comments which followed that announcement.\n“Why can’t we discuss this in a respectful and non-judgement manner? Why is our sexual education lagging so far behind?” Ms Tolu asked. “Enough of these taboos and stigmas”.\nMs Tolu, who spent years campaigning for LGBTI issues before her foray into national politics, said she had first-hand experience of the harm such taboos had on people.\n“I grew up queer in Malta, before all these legal advances,” she said. “It’s time to stop silencing others”.\nAD statement\nIn a statement on Saturday, AD said it was and remained against abortion.\nHowever, it believed in the need for a respectable debate in a democratic society, as had been stated by its candidate Ms Tola.\n ", "comment_count": 132, "id": 3876}, {"keywords": "", "author": "", "article_body": "Caritas will be getting €3,793,410 over the coming three years, €2,713,410 of which will be dedicated to residential services, and €1,260,000 to community services and therapy.\nThe agreement was concluded on Friday between the NGO and Social Solidarity Minister Michael Falzon, who said the government was determined to help drug users kick their habit.\nThe minister said that half of this year’s €12 million government allocation would be used to help entities directly or indirectly related to the Church. The government has also embarked on the construction of a adolescent centre at Ta’ Kandja, and has already arranged for its management.Caritas director Anthony Ellul said his organisation helped 700 clients in 2018 who had drug problems, as well as 500 of their relatives.", "comment_count": 2, "id": 3877}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Magisterial inquiries into alleged kickbacks and corruption, involving, among others, Konrad Mizzi and Keith Schembri, had not been concluded yet, Justice Minister Owen Bonnici specified on Thursday.\nAddressing the European Parliament’s Financial Crimes Committee in Strasbourg on Monday, he declared that “two major inquiries had concluded there were no grounds to proceed against these people”, referring to Mr Schembri, the Prime Minister’s top aide, and Dr Mizzi, the Tourism Minister. However, when approached on Thursday, Dr Bonnici said he used such terminology “so people would understand”.\nAsked which two inquiries he was referring to, the minister said he was not actually referring to inquiries but to “legal procedures”.\n“I was referring to the legal process, an appeals court sentence by Mr Justice Giovanni Grixti and to the conclusions of the Egrant inquiry involving the Prime Minister and his family”, Dr Bonnici clarified.\nWhen it was pointed out to him that processes he referred to did not investigate Mr Schembri and Dr Mizzi, as he had told MEPs, and that Mr Justice Grixti’s decision was on whether a probe into the Panama Papers allegations should take place, the minister said he used the term “inquiries” to simplify things.\nDr Bonnici confirmed there were other inquiries under way and appealed to the members of the judiciary handling them to conclude their work as expeditiously as possible.\n“To my knowledge, there are a number of inquiries ongoing, some of them opened at the request of the police, and I appeal that these are concluded as justice delayed is justice denied,” he remarked.\nRead: Fact-checking Owen Bonnici's claims to MEPs\nOf the inquiries in progress and involving senior members of the government, which started over the past two years most of them following requests by the Opposition, only the Egrant inquiry is known to have been concluded.\nWhich inquiries?\nIn its conclusions – the whole report was never published despite the Prime Minister’s public pledge to do so – the inquiring magistrate declared he found no evidence indicating that Egrant belonged to Dr Muscat or members of his family.\nMagistrate Natasha Galea Sciberras is looking into a report by the Financial Intelligence Analysis Unit, which raised suspicion that Mr Schembri could have received kickbacks from Nexia BT’s Brian Tonna in connection with the sale of passports.\nMagistrate Josette Demicoli is investigating another report by the government anti-money laundering agency indicating possible corrupt practices and kickbacks involving $650,000 in transactions between Mr Schembri and Adrian Hillman, former managing director of Allied Newspapers.\nThe inquiries will seek to establish whether there exists prima facie evidence on corruption, money laundering and other criminal activities on which the police could press criminal charges.\nOther inquiries reported in the media are about the Dubai-based 17 Black company and alleged kickbacks to both Mr Schembri and Dr Mizzi in relation to the power station project.\nLeaked copies of documents send by Nexia BT’s Karl Cini to banks on behalf of both men indicated they stood to receive $2 million from 17 Black and another company of still unknown ownership called Macbridge. ", "comment_count": 60, "id": 3878}, {"keywords": "", "author": "", "article_body": "The Malta police have denied claims that they failed to help their Spanish counterparts with investigations into claims that a tuna farm operator may have used bribes to increase its quota.\nIn a statement on Friday, the police said its Economic Crimes Squad cooperated fully with the Spanish authorities and handed over all required information, via the Europol channels.\nIt also clarified that the Economic Crimes Squad started to carry out investigations in October as soon as the Malta police became aware of these allegations. It also initiated a magisterial inquiry soon afterwards to collect all the evidence.\n“Contact with the Spanish authorities was made immediately, even with the assistance of Europol, both by the Malta police and by the inquiring magistrate. And the investigation team also travelled to Madrid to meet with the Spanish,” it said.\nRead: Malta police go to Europol to discuss tuna racket probe\nPhone intercepts between the head of the fisheries department and a Spanish tuna rancher linked to a multimillion-euro racket led to the Fisheries Department director, Andreina Fenech Farrugia, being suspended suspended on full pay on Tuesday.\nShe denies claims that she had demanded money off a Spanish tuna kingpin.\nThe police added that no further details could be given about the investigations since a magisterial inquiry was underway.", "comment_count": 17, "id": 3879}, {"keywords": "", "author": "", "article_body": "Nationalist MP Edwin Vassallo has apologised for having shared a Facebook post warning about bananas being injected with HIV-infected blood.\n“This is a lesson in how widespread fake news has become, and how careful we have to be when sharing things with others,” he wrote in an apologetic post.\nThe claims made in the post – which is not backed by facts or medical science – prompted widespread ridicule of the Mosta MP on social media.\n“A groups of people is injecting fruits with blood containing HIV and AIDS,” the post warned. “This is Satanism. PLEASE SHARE this post and save others”.\n\nHIV cannot be transmitted through food and dies almost instantly upon coming into contact with air.\nFake internet warnings about discoloured bananas being infected with HIV have circulated for years and even merit their own entry on myth-busting website Snopes.\nIn his apology, Mr Vassallo suggested his misplaced warning had been “blown out of proportion” due to his conservative leanings.\n“It’s better to have ended up in the news for something like this, than for being involved in a corruption scandal,” he noted. “I won’t give up fighting for what’s right because of a minor, genuine error. I will continue to respect those who disagree with me,” he added.\nBlog: Beware Satanic bananas - Ramona Depares", "comment_count": 23, "id": 3880}, {"keywords": "", "author": "Denise Grech ", "article_body": "Changing demographics and environmental degradation were set to have a disruptive impact on tourism, President Marie Louise Coleiro Preca warned on Friday.\nChallenges related to an ageing population and climate change would also have long-term consequences on the development of Mediterranean tourism, she added.\nHigh tourism numbers creating infrastructural challenges, PM admits\nDiversifying the tourism sector was essential for resilience, she said, quoting a report which found that Mediterranean destinations which relied solely on sun and beach tourism were finding themselves in increasingly precarious situations.\nMs Coleiro Preca pushed for sustainable tourism and encouraged the promotion of \"peace-building potential\" tourism during the sixth Mediterranean Tourism Forum. \nSustainable tourism could be a game changer, the President said, adding it could help nurture a transformation in mentalities and attitudes.\nAs an island nation in the centre of the Mediterranean Sea, Malta was very well acquainted with the importance of pursuing sustainable approaches, she said.\n\"There is the opportunity to invest in capacity-building programmes to assist local communities, to become empowered protectors of their environmental heritage,\" she added.\nShe encouraged stakeholders to embrace less carbon intensive transport, and make conscious choices to \"think green\" in the coming years.", "comment_count": 11, "id": 3881}, {"keywords": "", "author": "Ivan Martin", "article_body": "Documents connected to the use of the George Cross on the Maltese flag, emblems and on official documents have been restored and will be put on public display.\nThe documents include the George Cross deed, drawn by the then chief notary to the government, Carmelo Farrugia, which details how the cross should be used.\nThe deed was between Governor Sir Frances Campbell Ross Douglas and Chief Justice Sir George Borg, “wherein King George VI, being desirous that for the greater honour and distinction of the island of Malta, grants that a representation of the George Cross proper is placed on a canton azure to be borne for the Island of Malta and its dependencies upon seals, shields, banners or otherwise according to the law of arms”. Culture Minister Owen Bonnici reading the restored volume\nMalta was awarded the George Cross on April 15, 1942 in recongition of its valour and perseverance during World War II.\nHowever, the deed allowing it to be used on the Maltese flag and elsewhere was only published in the Hall of St Michael and St George at the Governor’s Palace, Valletta, in the presence of Archbishop Michael Gonzi in 1947.\nThe volume with the documents contains other notarial deeds dealing with other issues, such as the sale of land, reconstruction of damaged accommodation and the supply of provisions and fuel.\nThe conservation project was the result of collaboration between heritage NGO Din l-Art Ħelwa, members raised about €2,000 for the preservation of the volume, and the Notarial Archives Foundation. \nThe grant of the George Cross to Malta\nThe restortation was done by paper conservator Alejandra Molano Contreras, who conducted various interventions, including surface cleaning, removal of old repairs, spine repair and cover repair, under the supervision of conservation head Theresa Zammit Lupi.\nDin l-Art Ħelwa recalled that the Maltese people’s everyday life had been completely disrupted, suffering food shortages and incessant bombings by the Axis forces.\n“The volume preserves the record of this significant part of Maltese history and that of its people,” it said.\nThe conservation job, which took a month, also included the preservation of notarial documents detailing the rebuilding of Malta after the war.\n ", "comment_count": 23, "id": 3882}, {"keywords": "", "author": "Sarah Carabott", "article_body": "MEP Francis Zammit Dimech has urged EU member states to make the latest generation of cancer-preventing medication available.\nHis comments follow doubts raised earlier this week over the government’s choice of cervical cancer vaccine. According to pharmaceutical industry sources, the government is seeking to purchase a vaccine that could offer less protection than the one placed recently on the market. \nDr Zammit Dimech, a member of the MEPs Against Cancer working group, was speaking at the European Parliament during a debate with European Health Commissioner Vytenis Andriukatis on policy challenges and strategies on cancer among women.\nHe noted that screening services should not only be made available but also had to ensure that their acceptance rates were high. This required more awareness.\nThanks to professionals, Malta had a survival rate of 87% when it came to breast cancer, he noted, calling for more investment to support such results and to help the Breast Cancer Unit develop.\nHe commended cancer NGOs for their work. Assistance from professionals and volunteers enabled such NGOs to gain a lot of experience and expertise along the years. It was, therefore, crucial for such organisations to be involved in the development of EU health and cancer policies.\nThe fight against cancer should not be waged by one particular member state or another for an EU approach was necessary if Europe wanted to reach the ambitious target of eradicating cancer in 20 years’ time, he said. \nThanks to professionals, Malta had a survival rate of 87 per cent when it came to breast cancer\nDr Zammit Dimech also spoke about the need for the programme Horizon to include cancer research in its mission, particularly paediatric cancer research, and for more exchange of knowledge between European scientists.\nRead: Eradicating cancer in 20 years - Francis Zammit Dimech\nEarlier in February, on World Cancer Day, he launched the first set of proposals to step up the fight against cancer. These included the need to promote healthy lifestyles and diets and to offer physiological support to patients during and after treatment.\n\n\n\nMr Andriukatis appealed for the subject of cancer to be kept high on the political debate in the upcoming European Parliament elections.\nCancer is Europe’s second leading cause to death. In 2015, cancer cut short the lives of more than 508,000 women and it is increasing in prevalence. Almost four million new cases are expected this year alone.\nRead: Maltese-led cancer drug trial reaches final phase", "comment_count": 6, "id": 3883}, {"keywords": "", "author": "Denise Grech ", "article_body": "The high tourism numbers were creating infrastructural challenges, Prime Minister Joseph Muscat told tourism industry stakeholders on Friday.\n“Let me be very clear: this is a positive challenge to be faced with, but we need to roll up our sleeves and find creative solutions to address the issue in a sustainable manner,” he said.\nRead: Hoteliers sounds warning of ‘over-tourism’\nDuring the sixth Mediterranean Tourism Forum, Dr Muscat said efforts were being made to update infrastructure, for instance, through ongoing road works.\nThe Prime Minister said high growth numbers had to be addressed in the context of a country with half a million inhabitants.\nTourism results also attested to how Malta had become one of the least seasonal islands in the Mediterranean, Dr Muscat said.\nIn light of the high growth rate, the country would also be working to attract tourists “of a greater quality”, he added.\nRead: Revamping tourism strategy\nThe government was looking to diversify the sector even more, he said.\nBrexit would affect consumer confidence in travelling, Dr Muscat added, possibly leading to an abnormal rate of fluctuation in exchange rates, impacting the number of tourists coming to Malta.\nOn this, the Malta Tourism Authority was drawing up action plans on dealing with the mitigating affects of Brexit, Dr Muscat said.\nRead: Muscat confident of post-Brexit agreement between Malta and the UK", "comment_count": 30, "id": 3884}, {"keywords": "", "author": "", "article_body": "A total of 184,004 Maltese residents travelled abroad in the fourth quarter, 14.7% more than the same period in 2017.\nOutbound tourists towards EU and non-EU countries increased by 13.3% and 25.1% respectively when compared to the same quarter in 2017, the National Statistics Office said.\n\nItaly and the UK remained the most popular destinations, with a joint share of 48.7% of total tourist trips.\nThe number of nights spent abroad increased by 15%, amounting over 1.2 million nights.\nIn absolute terms, the majority of guest nights (50.3%) were spent in non-rented accommodation establishments.\nTotal estimated outlay increased by 7.8% over the same quarter of 2017, and stood at €148.4 million, equivalent to an average €807 per trip.January-December 2018.\nThe total number of trips between January and December numbered 667,048, an increase of 16.5% over 2017.\nThe total nights spent abroad went up by 14.2%, reaching almost 4.5 million nights. The total estimated outlay by resident tourists stood at €563.2 million, 9% higher than recorded for the same period in 2017.", "comment_count": 6, "id": 3885}, {"keywords": "", "author": "Denise Grech ", "article_body": "Despite continued calls by EU bodies for Malta to stop passport sales, government concessionaire Henley & Partners insists the scheme is endorsed by the European Commission.\nAn EU law expert warned there was not much Brussels and the European Parliament could do other than exert political pressure.\nRead: Reding welcomes agreement on citizenship with Malta\nIvan Sammut, head of the European and Comparative Law Department at the University of Malta, said European institutions did not have a legal say on issues related to a country’s citizenship, which remained within the competence of a member state. This, he feared, could lead to arguments that EU bodies could be seen as toothless watchdogs.\nIn a video promotion still appearing on their website, Henley & Partners boasts the scheme is “the only programme of its kind endorsed by the EU”.\nHowever, European Justice Commissioner Vera Jourova told MEPs in January Brussels did not endorse the scheme.\nWatch: Malta's IIP endorsed 'in writing' - Muscat\nThe Commission was looking at “cash-for-passports” programmes with concern, she added.\nAsked whether, in the circumstances, they still believed Malta’s programme was endorsed by the Commission, a spokesman said Henley & Partners did “not believe that the status quo has changed since the inception of the IIP [Individual Investors Programme] in 2014”.\nHenley & Partners were also critical of a report in which the Commission said the schemes could give rise to corruption and money laundering. Brussels also urged member states to crack down on countries with schemes granting “golden visas and passports”.\nThe report lacked “an objective and detailed understanding of the investment migration industry, its practices and the benefits it creates for sovereign states”, the spokesman commented.\nHe remarked that the fact that the report was produced without meaningfully engaging with key stakeholders undermined its credibility, adding there was no engagement with the investment migration industry on a “positive and good-faith basis”.\nMalta’s citizenship-by-investment programme showed a robust “risk management capability so that the threats mentioned in the report become largely redundant”, the spokesman said.\nHe argued that the threats outlined in the report existed on a much wider scale in other areas of immigration and citizenship practices across Europe, which also needed to be addressed.\nThe spokesman would not say whether they had been in touch with the government following Ms Jourova’s comments, citing client confidentiality.", "comment_count": 27, "id": 3886}, {"keywords": "", "author": "", "article_body": "A motorcyclist was grievously injured on Thursday night in an accident in Msida.\nThe police said the accident happened in Triq Testaferrata at 11.40pm.\nThe biker, a 50-year-old Croat who lives in Naxxar, was riding an SWM RS300R that was involved in a collision with a Chevrolet Kalos that was being driven by a 46-year-old man from Ta’ Xbiex.\nThe victim was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3887}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg  ", "article_body": "Three men accused of killing Daphne Caruana Galizia were back in court on Friday morning, as the compilation of evidence against them resumed. The almost three-hour session featured some ill-tempered exchanges between lawyers and the bench, with defence lawyer William Cuschieri in particular getting into some heated conversations at times. \n\nDefence lawyers are not happy that IT expert Martin Bajada has been summoned to testify. Dr Bajada's involvement was given the all-clear by a constitutional court last month, but lawyer William Cuschieri has argued that that judgment is subject to appeal. Magistrate Stafrace Zammit will rule on that objection and deliver a decree in chambers. \nAn IT expert told the court that an SD card extracted from an underwater camera had been corrupted and would need to be sent overseas to try and salvage its data. He suggested labs in the UK, Germany or the USA. \nFour other boats registered locally resemble George Degiorgio's Maya. Owners of all four testified and confirmed that their boats were not out at sea on the day of the murder. \n\nMinute-by-minute\n12.50pm That's it for this live blog. Thank you for joining us, we'll be back with more live updates on March 1. \n12.48pm That's it for today's session. The next court sitting has been scheduled for March 1. \nBetween now and then, magistrate Stafrace Zammit will decide whether IT expert Martin Bajada can testify in proceedings. \n12.38pm The next witness is an officer who handled exhibits. He confirms his signature on various documents related to them and explains how each exhibit has a unique number. \n12.35pm Those objects included two pairs of binoculars, a brown envelope and a plastic bag. They did not feature any matching fingerprints. \n12.30pm Proceedings resume after a brief recess. \nA police officer hurries to the witness stand and explains that he was asked by the court to check fingerprints he had lifted from a number of objects.  \n12pm A brief recap of this Friday's court session so far.\n\nDefence lawyers are not happy that IT expert Martin Bajada has been summoned to testify. Dr Bajada's involvement was given the all-clear by a constitutional court last month, but lawyer William Cuschieri has argued that that judgment is subject to appeal. \nAn IT expert told the court that an SD card extracted from an underwater camera had become corrupted and would need to be sent overseas to try and recover its data. \nFour other boats registered locally resemble George Degiorgio's Maya. Owners of all four testified and confirmed that their boats were not out at sea on the day of the murder. \n\n11.58am The court takes a 15-minute break. It's been more than two hours and everyone needs to stretch their legs. \n11.55am The missing file has been found. A scene of the crime officer who has been waiting patiently to testify is shown the document. \n11.53am Proceedings have been momentarily held up while the court finds a file containing a transcript of a witness summoned during an earlier sitting. \n11.46am Ok, maybe not 1,000. The witness corrects his earlier estimation and says that there are \"hundreds\" of photos in the reports. \n11.40am Those reports are also gargantuan, the court hears. They contain over 1,000 photos. \n11.37am Another police sergeant takes the stand. He presents three reports of police searches that took place in Żebbuġ, Mosta and St Paul's Bay. \nOther officers and foreign experts were also present during the searches, the court hears. \n11.32am The hearing moves on from boating and onto other matters. \nThe next witness - a police officer - tells the court they visited Tarġa Gap to photograph the Caruana Galizia family home, and the home to photograph the Tarġa Gap vantage point. \nHe presents 13 photos and goes through each one, one-by-one. \n11.22am The fourth boat owner tells the court he had his vessel brought over from Libya two years ago. It's still being repaired and has not been lowered to sea yet. \nOn the day of the murder, it was on land at a yard, he says. \n11.20am And after another series of detailed questions from Dr Fenech - \"please circle the boat's spotlight on this photo\" - it's boat owner number four who testifies. \n11.16am \"She's never left port in these past 10 years,\" the boat owner tells the court. \"I only move it from the pontoon to land and vice-versa. I've never sailed out in 10 years\". \n11.15am A third boat owner whose vessel resembles the Maya testifies. \nHe's had his Wellcraft vessel since 1995 and it is berthed at Msida marina.  \n11.08am Mr Cauchi gives a few more details about his boat - bought in the UK, changed its canopy once - and steps off. Next up - the owner of another of the Maya-like boats. \nHe tells the court that he's owned his vessel since 2010 and it usually berthed at Mġarr marina. On October 16, 2017 it was at his garage, without an engine. It was only returned to the water in September last year. \nHe's also asked a series of questions by Dr Fenech - about its lights, antenna, canopy and so on - and is then free to take his leave. \n11.02am A Mellieħa boat owner is the next to testify. \nHe is the owner of the boats resembling the Maya. He tells the court that his boat was in the water between June and September 2017, and on land in October of that year. \n10.52am The officer spoke with the vessel owners, got each of their histories and took photos.\nBoat 1 - damaged and was being repaired on land. Boat 2 - Its owner did not live in Malta, and the boat rarely left its pontoon. Boat 3 - Seen at a Mellieħa yard and was only used by its owner in summer. Boat 4 - Berthed in Gozo. \nThe witness adds that in November 2017, before the suspects were arraigned, he had filmed the Maya entering the Grand Harbour. \n10.50am The third witness is up - a police officer who got in touch with the owners of the four vessels resembling the Maya.\n10.46am Inspector Arnaud explains why investigators were so focused on the Maya. The suspected mobile phones were traced all leaving George Degiorgio's home together, and headed to Marsa. \nAt the time the bomb went off, the Maya stopped beneath the Great Siege bell. Then it sailed back to port. \nMs Caruana Galizia's murder shocked the nation. Photo: Mark Zammit Cordina\n10.42am Inspector Arnaud is losing his patience with Dr Cuschieri's constant interruptions.\n\"Why don't you answer the question yourself, to be happy?\" he snaps. \nThe magistrate calls for calm. Dr Cuschieri asks for the record to state that he was interrupted by a witness during questioning. \n10.40am Dr Cuschieri wants to know if police spoke with the vessel owners before arraigning the three suspects. \nInspector Arnaud replies: we already had enough evidence to focus on the Maya at that stage. Afterwards, to eliminate all doubt, we checked the other four boats which were similar.\n10.37am Inspector Arnaud tells the court the police spoke to the owners of all four vessels similar to the Maya. None were at sea on October 16, 2017 - the day Ms Caruana Galizia was assassinated.  \n10.35am With that done, Keith Arnaud takes the stand. \n10.30am As the various lawyers make their points, the magistrate decides she will rule on this point in camera - essentially, in private, without distractions. \n10.27am The lawyers are still battling this out. Dr Cuschieri speaks with a hint of incredulity. \"This is ABC,\" he says.\nMagistrate Stafrace Zammit does not take too kindly to that. \"What I'm saying is ABC, not what you're saying, with all due respect,\" she tells him.\n\"Let him [Dr Bajada] testify, and then it will eventually all be annulled,\" Dr Cuschieri sulks back. \n10.22am Court expert Martin Bajadais back on the agenda (his testimony had prompted a protest from the defence at the start of the sitting). \nThe magistrate says that she has not been formally notified of the constitutional proceedings, and therefore cannot take formal note of them.\n10.21am The court agrees with the inspector. \n10.20am Defence lawyers are not happy that the vessel registry search only stretched to December 2017. They say they want 2018 included.\nThat would be after the date of the crime, inspector Arnaud notes. \n10.16am Lawyer Martin Fenech asks about the length of these vessels. The Maya is 8.05m long. He also asks about the colour of the vessels. The witness says colour is not included in the registry. \n10.14am The TM registry included some other boats similar to the Maya,  Dr Cutajar says. The registry does not include photos of the boats, though. \n10.11am Another Cutajar takes the witness stand - Gordon Cutajar, a lawyer who serves as assistant registrar at the Merchant Shipping Directorate. He tells the court that until December 2017 there was only one Martinique 288 yacht registered with Transport Malta.\nThe Maya, Mr Degiorgio's pleasure yacht, is a Martinique 288. \n10.09am Mr Cutajar is done testifying. No decision on which company to choose, yet.\nLawyer Yanika Bugeja is now presenting Maltese translations of Matthew Caruana Galizia’s testimony. Mr Caruana Galizia had testified in English.\n10.07am Mr Cutajar says the UK companies' forensic processes are the ones which most closely mirror Malta's. \nThe three suspects.\n10.02am The question is, which of the labs should ? The various parties have to agree on one. \nThe witness emphasises how delicate this operation is. It could lead to evidence being tampered with, and you only have one shot at retrieving the data. \nInspector Arnaud tells the court the data on the corrupted SD card was not backed up.\n10am Prosecuting inspector Keith Arnaud wants to know how long it would take for the card to be assessed by one of these labs. \nAt least three days, the witness says. \n9.57am The witness is explaining that an SD card retrieved from an underwater camera used in the case had been corrupted. He could not retrieve its data and it should be handed to a more specialised lab, he says.\nMr Cutajar says he know of four such labs - two in the UK, one in Germany and another in the USA - which could do such work. There is also a local company which takes apart such cards, he says. \n9.55am In the meantime, a court messenger has reentered the courtroom, file in hand - possibly the file the magistrate asked Dr Cuschieri to present a few minutes ago.\n9.53am Mr Cutajar's report is around 1,000 pages long, he tells the court. \n9.50am Proceedings begin. Keith Cutajar is the first witness. He's a telecoms expert, and he presents extracts of reports detailing calls and telephone numbers related to the case. \n9.48am Magistrate Stafrace Zammit says she has not received any court order to suspend Dr Bajada's testimony. She moves the case along. \n9.45am The court has asked William Cuschieri, the lawyer who is arguing Dr Bajada should not testify, to present acts referring to appeals proceedings in constitutional cases. \n\"I could go looking for the file in the court registry, but I'm not a court messenger,\" he replies.\nMeanwhile, Dr Bajada and six other witnesses wait patiently for the legal dust to settle. \n9.42am Just a reminder that the compilation of evidence in this case - essentially its pre-trial stage - is now in its 14th month. \n9.40am We're expecting court experts to testify today - among them IT expert Martin Bajada, who the three suspects had objected to. That request was rejected by a separate court last month.\nDespite that ruling, the prospect of him testifying has prompted some discussion in the courtroom ahead of the official start of proceedings. \nAlfred Degiorgio's lawyer is saying that last month's judgement in Dr Bajada's favour is still subject to appeal, so he should not be testifying today.\nBackground\nDegiorgio brothers Alfred and George and Vince Muscat face charges of having planted and detonated the bomb which killed the journalist in October 2017.The court’s last session, held last month, saw court experts testify about a boat spotted entering and exiting the Grand Harbour on the day of the murder, which investigators say is Alfred Degiorgio’s Maya. \nPolice witnesses also testified about items they had confiscated from a Żebbuġ site on the day police had arrested the three suspects.\nThe three suspects have filed separate proceedings against authorities, saying their arrest and searches of their homes had breached their fundamental rights.\nWe will be updating events as they unfold in the courtroom. Our live blog will begin at 9.40am.\nThe key players:\nMagistrate Claire Stafrace Zammit is presiding. \nLawyer Martin Fenech is appearing for Vince Muscat, known as il-Koħħu, 55.\nLawyers William Cuschieri and Martha Muscat are representing Alfred Degiorgio, known as il-Fulu, 53.\nLawyer Josette Sultana is appearing for Alfred's brother George Degiorgio, known as iċ-Ċiniz, 55.Philip Galea Farrugia from the Attorney General's office and inspectors Keith Arnaud and Kurt Zahra are prosecuting.\nLawyers Jason Azzopardi and Eve Borg Costanzi are appearing parte civile.", "comment_count": 0, "id": 3888}, {"keywords": "", "author": "Keith Micallef", "article_body": "A pro-life activist has accused a UK lobby group offering to fund the expenses incurred by Maltese women seeking abortion abroad of treating such a delicate issue as if it were a “business transaction”.\nMiriam Sciberras, chairman of the Life Network Malta, made the remark when Times of Malta sought her reaction to an announcement made by the Abortion Support Network on Valentine’s Day.\nThe network describes itself as a UK-based “charity” providing financial assistance, practical information and accommodation to those living in countries with restrictive abortion laws.\nIn a statement, it announced the launch of its service in Malta and Gibraltar, offering “the least expensive way” to contact clinics in several EU countries and, if necessary, give financial help to cover travel costs “to access a safe, legal abortion”.\nIn its announcement, it laid emphasis on the fact that Malta was the only European country where abortion was illegal and noting that, in Gibraltar, is only allowed if the woman’s life was in danger.\nThe ‘scheme’ is being backed by the Maltese-based Women’s Rights Foundation, which is campaigning for the introduction of abortion.\nThe ASN is also offering funding for telephone consultation or counselling sessions provided by “leading UK abortion provider” British Pregnancy Advisory Service.\nThe service on offer was more like a form of abuse on vulnerable women\nLara Dimitrijevic, from the Women’s Rights Foundation, applauded the move while accusing the Maltese State of “abrogating itself from its duties and responsibilities” for not providing access to abortion on the island.\nHowever, Dr Sciberras admitted she was extremely disappointed though not surprised with the ASN’s announcement.\n“Maltese women should be offered much better solutions than abortion. Women going through the trauma of an unwanted pregnancy do not need somebody who finances their abortion,” she said. \nRead: Women should have access to abortion in at least four circumstances - paper says\nShe criticised the service being offered by the UK organisation, rather than extending support or counselling. “Apart from being harmful to the baby, abortion is also damaging for the mother in the long-term. Abortion is not just a procedure or a business transaction, as it is being depicted by the ASN,” she said.\nDr Sciberras insisted that women in such a situation needed moral, psychological and material support to empower them to face the challenges ahead. Instead, the abortion service on offer was more like a form of abuse on vulnerable women, she said.\n“This UK organisation is proposing a short-term solution whose long-term victims will be the woman and the baby,” she remarked.\nShe expressed her doubts on the legality of such a service in view of the fact that abortion in Malta was illegal. However, she said they would be seeking legal advice on the matter before pronouncing themselves.", "comment_count": 79, "id": 3889}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 1.45pm, adds PN statement\nAn investigation by the Ombudsman into controversial promotions made by the Armed Forces of Malta found that the process was “vitiated”, lacked integrity and was intended to “produce a desired outcome”.\nOmbudsman Anthony Mifsud said one of the main issues that led to the process being simply “a screen for the choice made” was that two of the members on the selection board had been persons of trust without any specialisation in military affairs.\nThe controversial promotions in September 2013 included that of the present commander, Jeffrey Curmi, who had leapfrogged from major to brigadier – four promotions – in a matter of months.\nThe investigation itself had ended up as a legal wrangle in court when former home affairs minister Manuel Mallia filed a case against former Ombudsman Joseph Said Pullicino.\nDr Mallia, who eventually resigned when his official driver was involved in a shooting incident during a traffic accident, argued that the Ombudsman lacked jurisdiction to hear complaints by army officers who did not resort first to the ordinary remedy granted by law.\nTwo years later, Mr Justice Lawrence Mintoff ruled that the Ombudsman had authority to investigate complaints by army officers. He ordered the ministry to provide the Ombudsman with all the documentation he required to continue his investigation.\nMr Mifsud found that two people who occupied positions of trust in the Home Affairs Ministry at the time and who had been appointed to the selection advisory board – then deputy chief of staff, Ramona Attard, and head of customer care Clint Cutajar – “were not cognisant of public service protocol, let alone specific regulation of the armed forces”.\nIntended to produce a desired outcome\n“In other words, these two individuals were political appointees and not public officers, inured to the civil service tradition and aware of the rules and regulations pertinent to the selection processes, especially military ones,” he said.\nIn addition, four of the five members of the committee did not have any military knowledge.\nThe Ombudsman tabled his report in Parliament on Wednesday after concluding that “the selection process was conducted in an unprofessional manner and did not achieve the necessary rigour”.\nThe investigation “did not give this office the comfort the selection was done properly”, he said, adding there seemed to have been more promotions than the vacancies warranted.\nThe Ombudsman pointed out that, as a rule, no person of trust should be appointed on panels intended to select people for the service of the government in public or military offices. In his recommendations, Mr Mifsud urged the authorities to redress the injustice and radically review and revise the existing selection and promotion procedures “to ensure a high level of transparency”.\nIn a letter to the Ombudsman, Home Affairs Minister Michael Farrugia said he was “in disagreement” with the majority of the conclusions reached. However, Dr Farrugia said he would discuss the conclusions “at length internally and take them into consideration for future processes”.\nPN statement\nIn a statement, the Nationalist Party said it expected the Prime Minister to shoulder political responsibility for allowing such abuses and for justice to be made with those in the army who had suffered.\nThe PN, it said, had spoken out and protested about such abuses and the government had tried to ridicule the Opposition. But now, five years later, it had been proved right.\nIt said it would continue to be the voice and shield of people suffering injustices and would remain committed to remedy the injustices once it returned to government.", "comment_count": 41, "id": 3890}, {"keywords": "", "author": "", "article_body": "These are the main stories in Friday’s newspapers.\nTimes of Malta says Bank of Valletta may never be able to retrieve the entire €13 million stolen during Wednesday’s cyberattack because reversing such transactions was no easy feat. In another story, the newspaper says an investigation by the Ombudsman into controversial promotions made by the Armed Forces of Malta found that the process was “vitiated”, lacked integrity and was intended to “produce a desired outcome”.\nThe Malta Independent says that although only a small part of the BOV system was attacked, a total shutdown was necessary as a precaution.\nL-Orizzont says that according to the GRTU, losses to businesses due to the BOV cyberattack were minimal.\nIn-Nazzjon says that thanks to the Nationalist Party the government has stopped dumping waste at Qortin.", "comment_count": 0, "id": 3891}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government would not say when the Lands Authority website would be going back online after having been offline for more than two months following a data breach exposed by Times of Malta.\nA spokeswoman for the Transport and Infrastructure Ministry, under whose remit the Lands Authority falls, said the regulator was “coordinating with the Malta Information Technology Agency on the matter”.\nShe said experts had also been engaged “to test the website and relevant applications” and, though noting that the tests were ongoing, she would not say when the website would be going back online.\nThe massive data breach was reported last November. The newspaper said the breach was a result of a security flaw that dumped large amounts of private data, including scans of ID cards and e-mail correspondence, online and also making it easily searchable on search engines such as Google.\nExperts engaged to test the website and relevant applications\nAs the website remained inaccessible since, first going offline just after Times of Malta sent questions on the matter in November, clients have been complaining they had no option but to visit the regulator’s offices when they needed to settle even the smallest of issues.\nA spokesman for the Data Protection Commissioner said last month an investigation into the data breach was in “its final stages” but gave no other details.\nWhile the ministry’s spokeswoman noted that the government was informed that the regulator was “in communication” with the Data Protection Commissioner, she did not reply to questions on whether those impacted by the breach had been formally informed. \nNeither did she say who was being held responsible for the breach and whether any action had been taken in this regard.\n ", "comment_count": 2, "id": 3892}, {"keywords": "", "author": "Claire Caruana", "article_body": "Bank of Valletta may never be able to retrieve the entire €13 million stolen during Wednesday’s cyberattack because reversing such transactions was no easy feat, Times of Malta has been told.\nSpeaking a day after the bank was forced to temporarily shut down all its operations after it identified a breach, chief business development officer Kenneth Farrugia said that although the 11 transactions made by the hackers had been immediately traced it was not as straightforward to actually reverse the transactions to get the money back.\n“We know where the money went and into which banks but what happened at that touchpoint we do not have the visibility to know.\n“It’s not simply a matter of asking the banks for the money to be reversed. It does not work like that and there are banking procedures that have to be implemented,” Mr Farrugia said.\nHe would not even give an indication of how much, if any, of the stolen money had already been retrieved, insisting it was “still too early”. Neither would he go into whether the bank had any information on how much it could eventually get back.\nAll of the bank’s operations – branches, ATMs, mobile banking and even e-mail services –were suspended at about 1pm on Wednesday after problems in international transfers were detected during the daily reconciliation process in the morning.\nThe bank has still to establish who was behind the attack, with Mr Farrugia again saying it was still early days for such information to be available.\nIt’s not the leg from the client to us but from ours to the outside\n“At this stage, we don’t know. There isn’t a yes or no answer because the entry points can be through various channels. You can have someone using a USB, someone who received an e-mail with malware in it, through internet banking, etc.\n“We have started eliminating by looking at audit logs to try and find out where this came from and what the entry point was. But we have yet to determine the source,” Mr Farrugia continued.\nMr Farrugia noted it was too early to reach any conclusions as  to where the cyberattack originated from or whether there was the possibility of potential insider involvement.\nHe did point out, however, that the breach only involved money and no personal data was leaked.\nWednesday’s cyber attack did not affect client accounts (A) since it had targeted a BOV general fund (B) into which the transaction had been transferred prior to their transfer to international banks (C-G). Graphic: Design Studio\n“We did not have any breach of personal data. Whoever carried out the hack did so for the value. They did not go beyond the payment process that involved our bank,” he specified.\nThe bank could immediately establish that clients’ accounts remained untouched despite hackers making away with €13 million because a very particular system was breached, Mr Farrugia added.\n“They breached our payment processing system from our own account. It’s not the leg from the client to us but from ours to the outside. \n“We immediately identified that one leg was working properly but then there were problems with the other leg, where 11 more transactions were found,” he noted.\nMr Farrugia said that while the bank had a business continuity plan, with branch managers being informed of the procedures that would be implemented had the bank remained offline, there was no need for such a plan to kick in because everything was up and running by early yesterday morning.\nThe only service not yet operating on Thursday was that of payments to third parties and Mr Farrugia said work was under way to restore it, though he could not say when.\nThe Social Security Department said in a statement social security payments would be deposited as normal tomorrow. Beneficiaries would find the relevant payments in their accounts as usual, it noted.\nclaire.caruana@timesofmalta.com", "comment_count": 142, "id": 3893}, {"keywords": "", "author": "Keith Micallef", "article_body": "A consortium lobbying for an “immersed tunnel” on the seabed between Malta and Gozo claims its proposal is the best solution as it would leave open the option to introduce a monorail system later.\nIt also believes that the government’s proposal to excavate a tunnel under the seabed would probably be costlier and would not offer such flexibility.\nThese arguments were made by a spokesman for the Malta Gozo Fixed Link Consortium in an interview with the Times of Malta.\nBased on the principle of laying prefabricated concrete tunnel parts, which would be joined underwater, the project came to the fore last month when the consortium uploaded a short video presentation on the internet. Though it stoked debate, it also raised many questions on its viability.\nSpearheaded by Luke Chetcuti, the son of the late Paceville magnate Hugo Chetcuti, who originally came up with the proposal about two years ago, the consortium is still “in formation”. The spokesman declined to name the other investors saying it would be “premature at this stage” but he did say that a letter of intent had been signed with an undisclosed foreign financier – “a huge financial company involved in the insurance industry”.\n“Having consulted Danish experts and carried out various studies, we are now ready to present our proposal,” the spokesman said.\nThere were more than 150 tunnels of the kind being proposed around the globe, including one stretching over 18 kilometres between Germany and Denmark, he noted.\nFrom an environmental perspective, the consortium acknowledges that the biggest issue is the impact the structure would have on the posidonia beds, a protected type of plant populating the channel. \nSuch concern stems from the fact that the seabed will be excavated. However, rather than bore through the rock along an estimated 14-kilometre route, from l-Imbordin to Nadur, as the government is proposing, the immersed tunnel technology would only require the excavation of an 80-metre wide passage along the underwater route to make way for the prefabricated tunnel units. \nOnce the entire structure is formed, it is covered with the same material unearthed during excavation, thus doing away with the need of having to dispose large volumes of rock elsewhere.\nThe spokesman said studies on how to rehabilitate the seabed were done and they would also make use of technology to mitigate pollution. Feedback from the Environment Resources Authority would be sought, he pledged. Seven possible routes were identified and, in all cases, the exits would be very close to the shore as the tunnel would not be as deep as if it had to be excavated under the seabed, he added.\nExcavation and labour expenses would be lower than if boring through rock, however, the spokesman would not say how much the project would cost. \n“Our proposal will probably cost less than the government’s proposal but at this stage we cannot give any figures,” he said.\n“Unlike the government’s proposal, our project will have four and not two lanes. Consequently, at any stage we could dedicate two of them for a metro system leaving vehicular access open.”", "comment_count": 102, "id": 3894}, {"keywords": "", "author": "", "article_body": "Illegal dumping of animal waste into the sewerage system has clogged the Gozo sewage treatment plant, forcing its shut-down, the Water Services Corporation said on Thursday.\nIt said expensive equipment had been severely damaged at the plant, which supplies treated water to farmers. \nOperations are expected to resume on Friday.\nThe corporation said it was collecting the necessary information to be handed to the police. \n\n\"The sewage infrastructure is very complex and delicate and it is damaged by  improper use of the urban sewer system.\n\"It is therefore very important that only human toilet waste and degradable toilet paper are discharged in the system,\" it said in a statement. \nAny suspected foul play or problems with the sewer can be reported to the corporation on 8007 6400, customercare@wsc.com.mt, through live chat at  www.wsc.com.mt or on social media.\nMEP Roberta Metsola had flagged the problem to the European Commission last month. ", "comment_count": 16, "id": 3895}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Magistrates’ Court is to decide whether the host of TV show Exodus, Ivan Grech Mintoff, is to be admitted as a defence witness in ongoing criminal proceedings against the whistleblower behind the alleged medical visas racket.\nSyrian-born Khaled Ben Nasan is facing fraud and extortion charges following his allegations that Neville Gafa', former Projects Director within the Health Ministry, had pocketed some €38,000 for the granting of medical visas to Libyan nationals.\nMr Grech Mintoff, nephew of former Prime Minister Mintoff and an MEP candidate, was summoned to testify in defence.\nHe was asked to explain his capacity as witness, thus stating that as the host of a political TV show, he sought to bring together different personalities across the political divide to discuss a variety of topics.\nThat was how he met Mr Ben Nasan, who had proceeded to supply him with details about the alleged visa racket, Mr Grech Mintoff explained.\nHowever, further questioning was brought to a halt by Magistrate Doreen Clarke, who asked the witness to momentarily leave the courtroom while the parties discussed the fact that Mr Grech Mintoff was apparently to testify in his role as an investigative journalist, which meant that his testimony was ‘detto del detto’, namely hearsay evidence.\n“He does not have the same standing as a prosecuting officer,” the court observed.\nDefence lawyer Leslie Cuschieri insisted that the witness’s evidence was crucial to the case, even if parts of it were hearsay.\nProsecuting Inspector Rennie Stivala argued that Mr Grech Mintoff had never handed over his material to the police “although he had chosen to go public on TV,  further questioning whether the persons mentioned by Grech Mintoff would “come here to give us their evidence.”\n“It is useless to make allegations without bringing these people to testify,” the inspector continued.\nThe court said that since it appeared that Mr Grech Mintoff was to testify in his capacity as an investigative journalist, the accused’s lawyer was to file a note whereby he was to indicate specifically the purpose of this particular testimony in his defence.\nThe court would then decide upon the admissibility or otherwise of the witness.\nThe case continues in March.", "comment_count": 0, "id": 3896}, {"keywords": "", "author": "", "article_body": "The director-general of the Fisheries Department who was suspended after reports of a cosy relationship with a Spanish tuna kingpin accused of running a massive illegal fishing racket, insisted on Thursday she never acted incorrectly, and payments were only made to her in her official capacity of director.\nAndreina Fenech Farrugia was suspended on Tuesday after a media report in Spain revealed extracts of phone calls between her and the Spanish tuna rancher. \n“I always acted in a professional, ethical and fair manner in terms of the law, and I was always impartial and fair with all operators and individuals involved in the sector,” she said in a lengthy statement.\nShe said the allegations being made against her were based on summaries of alleged telephone conversations she could not confirm as having been made. Even worse, these were not word-for-word transcripts of the alleged calls, but summaries which may have been misinterpreted or taken out of context.\nPoor use was made of the Spanish language, a factor which may have further contributed to such misinterpretation.\n'Normal to communicate with all operators every day'\nDr Fenech Farrugia said she was appointed director general in 2013 after a public call for which she had qualified first. The same process was repeated in 2016.  She previously held the position in 2011 and also held other senior positions since 1996 including scientific officer and principal scientific officer in the Fisheries Department.\nAs part of her duties it was normal for her to communicate every day, sometimes several times per day, with all operators in the sector. She had been equally available to anyone, contrary to the impression given in some reports that she communicated only with one operator.Strongly denied having ever solicited or received money for her personal use\nThe director strongly denied having ever solicited or received money for her personal use.\nIt was obvious, she said, that those who were to benefit from a legitimate increase in their tuna quota would have been required to made payments to the department, of which she was the lawful representative.\n“Official payments, in terms of the law, were made to me as director, and it is therefore obvious that if an operator was to have an increase in his quota, he would have had to made a payment to me as director, according to his quota increase in terms of the law,” she said.\nThe director said it was strange how she had been singled out in an extensive investigation that included many operators, individuals, companies and entities. She hoped this was not a move aimed at stopping her from working in the best interests of the sector and the observance of the law.\nShe insisted that over the years, she had, several times, ordered action to be taken against the operator mentioned in the reports, in the same way as she ordered action to be taken against others as required.\nShe insisted that any requests for increases in fisheries quotas were handled transparently by the competent authorities and against payment of hundreds of thousands of euros to her as director as established by law.\nDr Fenech Farrugia said she was continuing to cooperate with the authorities and would have no problem in continuing to do so.", "comment_count": 135, "id": 3897}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The developers of the former Jerma Hotel, in Marsascala, have justified their proposed 15-storey apartment and hotel development by arguing that a lower profile would have taken up too much space.\nA project description statement published on behalf of developers Porto Notos Ltd states that alternative designs for the project had focused on medium-rise buildings taking up a significant portion of the peninsula. \n“The original proposals respected the medium-rise policy that is applicable to Marsascala but the scale of the project was too large and created no public open space,” the developers said.\nMarsascala is not one of the locations designated for high-rise buildings under the floor area ratio policy.\nThe developers are attempting to circumvent this restriction by basing their application on a different policy, which allows existing hotels to extend two floors over and above the local plan height limitation.\nThey acknowledge that the building’s height could negatively impact long-important long-distance views, particularly given the presence of the historic St Thomas Tower and nearby residences but they argue that the existing derelict hotel poses a similar hindrance.\nThe proposed development, which has yet to be subjected to an environmental impact assessment, would see the demolition of the current abandoned structure, which has remained standing in a state of decay despite efforts by the authorities to force its removal.\nIn its place, developers are planning 166 luxury apartments and 250 hotel rooms in a single 15-storey block, with the residences spread over 13 floors and the hotel continuing up to the top.\nThe project will also include underground parking, a business centre on part of the first floor, a public chapel with “extensive and uninterrupted” seaviews and a 3,000 square metre beach lido.\nThe developers stressed that the beach would not be privatised and that all existing foreshore access would be retained. \n“Access to the coastline will be facilitated through the new public open spaces,” they said.\nUnlike previous proposals for the site, the project does not include land reclamation work or breakwaters.\nThis is the latest in a series of attempts to redevelop the Jerma, once one of the island’s largest and most prestigious hotels. \nAn earlier plan for three towers and extensive land-reclamation was shot down by the Planning Authority as a non-starter and the current proposal was endorsed in principle by the Marsascala local council in 2017.", "comment_count": 33, "id": 3898}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The education directorate has stepped in after the teachers’ union ordered its member not to provide and assess Maltese and Mathematics exam papers in senior schools.\nThe Malta Union of Teachers issued directives for secondary school teachers and heads of departments of Maltese and Maths in 2018, asking them to refrain from providing or correcting exam papers.\nThey had also been ordered not to carry out any oral and listening examinations, or provide an assessment mark or report.\nMUT President Marco Bonnici told Times of Malta that the directives had been issued after the union flagged the issue of teacher shortages for some subjects.\nTeachers were being loaded with too many lessons, meaning they were not able to implement reforms introduced by the education authorities, he added. Maltese and Maths teachers were the most affected.\nThe MUT directives did not apply to regularly marked homework and tests given to students throughout the academic year. The union warned it would escalate the industrial action if no solution was found to address the issue.\nWhen contacted, an Education Ministry spokeswoman confirmed that instead of allowing students to miss half-yearly exams, the directorate had compiled papers made up of past exam questions and new material.\nForm three, four and five students are sitting for these Maltese and Math assessments under exam conditions, the spokeswoman added.\nIt was especially important that fifth formers did not miss these half-yearly sessions because they acted as mock O’level exams, the spokeswoman added.", "comment_count": 13, "id": 3899}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who admitted to a string of pickpocketing offences and to using a bank card to withdraw a 'considerable sum' from an ATM has been handed a 28-month jail term.\nRazvan Aurel Stefan, 38 of Romania, was accused of stealing a woman’s wallet on New Year’s Eve, making off with cash and credit cards which were later used to withdraw a ‘considerable sum of money.’\nHe was further charged with the misuse of passcodes as well as with committing a string of similar offences in different localities.\nMagistrate Astrid May Grima declared the accused guilty upon his own admission and condemned him to a 28-month jail term.\nAnother self-confessed pickpocket, Andrei Dinica, 47, was handed a six-month jail term suspended for one year and was ordered to reimburse his victims.\nThe man had admitted to having stolen a woman’s wallet containing €175 and bank cards from a bus passenger on December 29 last year. That same day, he had then proceeded to withdraw €200 from the victim’s bank account.\nInspector Jeffrey Scicluna prosecuted.\nLawyer Lennox Vella was defence counsel.", "comment_count": 0, "id": 3900}, {"keywords": "", "author": "Claire Caruana", "article_body": "Infuriated shop owners have “given up” hoping for a solution to the problem of temporary stalls they face every time annual events, such as Valentine’s Day, approach.\nStalls in the shape of small tents and tables popped up at every corner of the island this week, ahead of Valentine’s Day today. \nIn some cases, the vendors propped their wares, mainly flowers and soft toys, against chairs in empty parking bays to ensure prospective customers would have a place where to leave their cars when stopping to make a purchase.\nThe issue has persisted for many years, with shop owners complaining they were forced to compete with street vendors who did not have to adhere to the same strict regulations on operations.\nThe CEO of the Chamber for Small and Medium Enterprises (GRTU), Abigail Mamo, said the issue was “a nightmare” and there was little hope it would be resolved.  The street vendors seemed to become greedier every year, going from blocking one corner to taking up an entire pavement\nThe GRTU, she added, had discussed the matter with the authorities for years but to no avail.\n“There are too many loopholes and it’s an administrative nightmare. We’ve given up trying to sort the problem out even though the issues get worse every year,” she said. \nMs Mamo noted that the street vendors were often in possession of a permit obtained from the local council although these only applied to those setting up stalls during village feasts.\nShe reported that, apart from a decline in sales, businesses were also furious that the street vendors were openly disregarding health and safety regulations and, in most cases, also caused traffic problems.\n“While shop owners must ensure they abide by all health and safety and traffic management regulations, these vendors simply set up their stalls wherever they please,” she remarked. \nWorse, she continued, the street vendors seemed to become greedier every year, going from blocking one corner to taking up an entire pavement.\nThough both the GRTU and its members lost hope that the issue could be resolved given the regulations in force, Ms Mamo said her organisation was working on addressing the matter by ensuring that the practice was properly regulated when the new rules governing open markets were introduced. Talks on this, she said, were under way with the authorities involved.\nShe was quick to point out, however, that the GRTU would not accept a situation where the regulator and the enforcer were not the same body as was the case at present and which was ultimately the root of the problem.\n“You cannot have one body making the rules and another enforcing them, even if the enforcers are the police. Though we appreciate their work, the police simply do not have the resources to handle this,” Ms Mamo said. ", "comment_count": 19, "id": 3901}, {"keywords": "", "author": "Claire Caruana", "article_body": "Bank of Valletta has yet to establish who was behind a cyberattack that saw hackers transfer €13 million to overseas banks on Wednesday, forcing the bank to temporarily shut down all operations. \nIn comments to Times of Malta on Thursday afternoon, BOV's chief business development officer, Kenneth Farrugia, said it was still too early to say who was behind the attack. \nAll of the bank’s functions - branches, ATMs, mobile banking and even email services - were suspended at around 1pm yesterday after discrepancies emerged during the reconciliation of international transactions. The bank resumed operations on Thursday morning.\n\"At this stage, we don't know who was behind it. There isn't a yes or no answer because the entry points can be through various channels. You can have someone using a USB, someone who received an e-mail with malware in it, through internet banking, and so on. \n\"We have started eliminating by looking at audit logs to try to find out where this came from and what the entry point was. But we have yet to determine the source,\" Mr Farrugia told Times of Malta. They breached our payment processing system from our own account\nPressed to say whether the bank had any indication of whether the attack came from overseas or whether, for instance, there was even the possibility of potential insider involvement, the officer would not say, insisting it was simply too early to reach any conclusions. \nOn the nature of the breach, Mr Farrugia insisted that this was purely of a monetary nature and that no personal data was leaked. \n\"We did not have any breach of personal data. Whoever carried out the hack did so for the value. They did not go beyond the payment process that involved our bank,\" he said.\nRead: BOV hackers' €13m in transactions 'being reversed' - Muscat\nThe bank could immediately say that clients' accounts remained untouched -despite hackers making away with €13 million - because a very particular system was breached.\n\"They breached our payment processing system from our own account. It's not the leg from the client to us but from ours to the outside. We immediately identified that one leg was working properly but then there were problems with the other leg, where 11 more transactions were found,\" he said.\nWith regard to operations resuming on Thursday morning just before branches reopened at 8.30am, Mr Farrugia said that while the bank had a business continuity plan, with branch managers being informed of the procedures that would be implemented had the bank remained offline, there was no need for such a plan as everything was up and running by early morning. \nThe only service not yet operating is that of payments to third parties.\nWork is underway to restore this soon but Mr Farrugia could give no timeline.\n ", "comment_count": 11, "id": 3902}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The host of former radio show Tagħna Lkoll has been ordered to pay €3,000 in libel damages to a now-retired member of the police force in a judgment deploring the “poor and unethical” quality of the show, possibly reflecting “the unhappy state of public media in general”.\nPatrick Cassar, a former police sergeant stationed at the RIU with 23 years of experience and a shooting instructor specially trained in VIP protection, had filed libel proceedings after David Thake read an email in June 2016 in the course of his daily programme which used to be aired on Radio 101.\nThe contents of that email, allegedly sent by a follower of the programme, had lamented certain irregularities within the police force and claimed that the applicant, identified by his rank and number, was a \"taghna lkoll\" member who lacked knowledge but considered himself as good as some Navy Seal or a Special Forces Operator.\nThe contents of the email were read out in full by the programme presenter, Mr Thake, whose line of defence, when summoned to defend himself against the allegations of libel, was that “when a person called the station, I could not censor anyone,” adding that he always used to read out “every letter that was received”.\nWhen questioned about the contents of that particular programme, the presenter could not confirm the transcript of the show, claiming that since he used to host the daily show for some two-and-a-half years, he had difficulty recalling the “the contents of each show”.\nWhen delivering judgment, the court, presided over by magistrate Francesco Depasquale, observed that Mr Thake had made no effort to verify the allegations made in the email, nor did he produce the sender of that letter to testify in the case, choosing instead to read it out in full.\nMoreover, this had not been a case of a live on-air call, but one in which the presenter had read out an email which he had received earlier on and which he could have sought to verify beforehand, the court observed.\nOn the basis of evidence put forward, it resulted that the allegations made in the email regarding Mr Cassar’s lack of qualifications, had been unfounded, since the former police officer had obtained training both locally as well as abroad, even in the US, over a long number of years.\nHe had even received special mention by foreign officials over his involvement in security handling during the 2015 CHOGM events in Malta.\nWhile upholding the libel claims, the court regretfully observed that “we are living in a society where as a rule a public person is indiscriminately attacked… under the pretext of freedom of expression,” in a scenario where the media are being used as “divisive instruments to instill envy rather than to provide information and enhance education”.\nThe court also highlighted the “poor and unethical” handling of the show, a possible reflection of the “unhappy state of public media in general,” where the right to freedom of expression was being abused.\nWhile declaring Karl Gouder as non-suited, given that it had not been proved that he had been registered editor of Radio 101 at the time, the court ordered Mr Thake to pay €3,000 in damages.\nDr Alfred Abela was counsel to Mr Cassar.", "comment_count": 0, "id": 3903}, {"keywords": "", "author": "", "article_body": "Early on Thursday morning, a group of immigrants, part of whom were on the Sea Watch III and Albrecht Penck and the others who disembarked in Malta following their rescue by the Armed Forces of Malta at the end of December, departed from Malta to be relocated in France.\nThe immigrants were assisted by the local authorities, the International Organisation for Migration (IOM) authorities, and officials from the Embassy of France in Malta.\nThese relocation processes are the result of an ad hoc agreement struck between the European Commission, Malta, and other EU member states, following the Sea Watch III and Albrecht Penck saga in early January of this year.\nA week ago, another group of migrants had been accepted by France and Luxembourg.\n ", "comment_count": 8, "id": 3904}, {"keywords": "", "author": "", "article_body": "The heirs of a dockyard worker who died of cancer after being exposed to asbestos at his place of work have been awarded €18,000 as moral damages by a court for breach of his right to life.\nThe case was instituted in the Civil Court in its constitutional jurisdiction by James and Dorothy Fenech against the Chief Government Medical Officer and the Attorney General.\nThe Fenech siblings successfully argued that their father's fundamental right to life was breached when he had to retire early and died aged 55 in 1997 after having suffered malignant mesothelioma because of exposure to asbestos at his place of work. They pleaded that the authorities had failed to protect their father and warn him of the dangers of asbestos.\nThe AG and the CGMO denied the charges against them. They argued that as soon as the Maltese government became aware of the consequences of exposure to asbestos it took the appropriate measures, including legislative changes to protect dockyard workers and also householders who used asbestos as an insulation material in their properties. \nThe court heard how Joseph Fenech's widow and her two children had sued the dockyard for compensation. The court had found the dockyard responsible for Mr Fenech's untimely death and ordered it to pay the family compensation of  €103,114.37, a decision subsequently confirmed on appeal in 2010.\nThe Fenechs then filed the current case in 2017. \nIn its findings, the court referred to current evidence and to other cases and said it was clear that despite knowing about the dangerous consequences of asbestos, the authorities were slow to react.\nThe rights of the applicants had been breached because as soon as the symptoms of their father's disease became known their life was changed significantly, both financially and emotionally.\nThe court, presided by Mr Justice Joseph R Micallef, therefore found that their rights and those of their father as safeguarded by article 33 of the Constitution and article 2 of the European Convention on Human Rights were breached.\nThe court therefore awarded the family non-pecuniary damages of €18,000. \nLawyer Juliette Galea represented the family.", "comment_count": 0, "id": 3905}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A court is to continue hearing constitutional proceedings filed by the three alleged suspects behind the assassination of Daphne Caruana Galizia who are claiming that their arrest and searches had breached their rights.\nThis was the outcome of a partial judgment delivered on Thursday morning in a case instituted by brothers Alfred and George Degiorgio together with Vincent Muscat, against the Attorney General, whereby they are seeking redress for an alleged breach of fundamental rights.\nTheir claim stemmed from the time when they were arrested and their properties searched after being targeted as suspects in the murder of the journalist who was killed in a car bomb outside her Bidnija home on October 16, 2017.\nWhile the compilation of evidence continues in their regard before the Magistrates’ Court, the three men have filed this joint application claiming that they were only shown a copy of their arrest warrant some 36 hours after their arrest.\nMoreover, they claimed that they had not been told the reasons for their arrest, had not been shown the search warrant, had not been present when the searches took place and that persons who were not police officers had assisted in the searches and seizure of the evidence.\nThe three murder suspects.\nThough contesting the validity of their arrest upon their arraignment in December 2017, the Magistrates’ Court had declared the arrest valid upon hearing prosecuting Inspector Keith Arnaud explain that the suspects had been informed that they were under arrest and that they were arraigned within the 48 hour legal time-frame.\nThe inspector had testified that there had been a single warrant that authorised the arrest and search of the accused, with a copy being presented to them at a late stage of the arrest. All three had been given their rights and had been informed of the reasons for their arrest.\nThe Attorney General had raised a preliminary plea arguing that the applicants had failed to exhaust ordinary remedies before filing the constitutional case, a plea which was rejected by the First Hall, Civil Court, presided over by Madam Justice Lorraine Schembri Orland, when delivering a decision on this point on Thursday.\nThe applicants’ lawyer, William Cuschieri, had argued that their ordinary remedy had been employed at the first hearing before the Magistrates’ Court when their challenge of the validity of the arrest had been dismissed.\nAlthough that the objection did not have a favourable outcome, it did not detract from the efficacy and effectiveness of that same ordinary remedy, said the court.\nThe Caruana Galizia family, as parties joint in the suit, had argued that if the Court were to exercise its jurisdiction in this case, it would be usurping the jurisdiction of the ordinary courts.\nHowever, the Court citing a 1995 judgment in Philip Spiteri vs Sammy Meilaq in which it was declared that when the subject of a case was complex in nature, giving rise to both ordinary and constitutional remedies, the constitutional remedy was to prevail.\nAt this preliminary stage, Madam Justice Schembri Orland declared that since the courts of ordinary jurisdiction could not offer an effective remedy, the respondents’ plea was to be rejected, thereby meaning that the court would proceed with the hearing of the case.\nLawyer Victoria Buttigieg appeared on behalf of the AG. Lawyer William Cuschieri is appearing for the applicants.  Lawyer Jason Azzopardi and Eve Borg Costanzi are appearing for the Caruana Galizia family, represented by Dr Peter Caruana Galizia.", "comment_count": 0, "id": 3906}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A measure to encourage students to try again after failing their exams has kept over 5,000 students in post-secondary and tertiary education since it was introduced in 2013.\nThe aim of the measure was to help students following an academic setback. Conditions were imposed, and those not attending class or not sitting for examinations were not eligible for a stipend in their repeating year.\nThe measure was first introduced in 2013 for students at sixth form level in the Budget but was soon extended to university students.\nEducation Minister Evarist Bartolo, replying to a parliamentary question by MP Byron Camilleri, said that between the 2013/2014 academic year and 2017/2018, a total of 4,832 had already availed themselves of the opportunity to continue studying, with a further 651 receiving the stipend this year.\nThe stipends cost the government just over €3.1 million, just over €560 per student.", "comment_count": 4, "id": 3907}, {"keywords": "", "author": "Ivan Martin", "article_body": "Police officers on Wednesday travelled to the Europol headquarters in the Hague to discuss developments in the tuna laundering racket, Times of Malta has learnt.\nPolice sources said the main aim of the visit was to request assistance in the hope of collaborating with the Spanish authorities and get their hands on evidence to facilitate their own investigations.\n“A magistrate has been looking into the matter for several months. However, there is not much that can be done without the necessary evidence,” sources close to the Maltese investigation team said.\nA total of 79 people were arrested last October in an EU-wide operation Europol dubbed Tarantelo. The international operation was conducted by the Spanish Guardia Civil with the support of the French, Italian, Maltese and Portuguese authorities.\nThe authorities also seized more than 80,000 kilos of bluefin tuna as part of the crackdown on the illegal trade of the fish. Although the fish was mostly sold in the Spanish market, it was caught in and around Maltese waters and fattened in Malta-based pens.\nRead: Promotion of suspended fisheries director ordered by OPM\nThe sources said the Malta police had received no cooperation from their Spanish counterparts and that could explain why none of those arrested were Maltese.\nSources close to the Spanish investigation were quick to point the finger at the Maltese authorities, saying they had not received any requests for information or assistance from Malta.\n“There were no Maltese arrested because the Maltese government has not cooperated with the Spanish Guardia Civil on this,” they said.\nHowever, on Tuesday fisheries director general Adreina Fenech Farrugia was suspended after transcripts of phone interceptions published by a Spanish news portal quoted her demanding money from Spanish tuna kingpin Josè Fuentes Garcia. \nShe denies any wrongdoing.\nInvestigators in Malta and Spain suspect this latest development is “just the tip of the iceberg”. The sources said the authorities feared the tuna ranching industry was rife with abuse and that the Maltese regulator had long been infiltrated by rogue operators.\nMap: How Malta's fishy business played out\nDr Fenech Farrugia with EU Commissioner Karmenu Vella.\nFenech Farrugia was known as 'the boss'\nThe transcripts, which form part of a Spanish court case due to start in the coming days, indicate that Dr Fenech Farrugia and Mr Garcia were in close contact using “secure” mobile phone numbers. In one exchange they discussed meeting at Malta hotels.\nThe suspects arrested by the Spanish authorities referred to Dr Fenech Farrugia as “the boss”, according to the sources.\nA Spanish telecoms provider confirmed to the Spanish investigators that the mobile phone numbers intercepted were registered by giant fishing company Ricardo Fuentes and Sons.\nThe Spanish investigators gained access to the exchanges by chance when they found a company mobile phone which was not Mr Garcia’s and appeared to belong to a “Andreina”.\nThe Spanish investigators believe the exchanges suggested the two had a relationship of “absolute trust”, discussing meetings involving “senior government officials” possibly aimed at facilitating a tuna laundering racket.\nEuropean Environment Commissioner Karmenu Vella on Wednesday “strongly condemned” the malpractices reported in the Spanish media and said the European Commission was in contact with Europol to follow up on them.\nBrussels said an audit of fish farms in Malta last October had highlighted “a number of shortcomings”, which it was now discussing with the Maltese authorities.\nIt insisted that fishing for bluefin tuna in the Atlantic and the Mediterranean “is often considered as the most controlled fishery in the world”.", "comment_count": 39, "id": 3908}, {"keywords": "", "author": "", "article_body": "More than 450 attacks took place against policemen in Malta in six years, according to Home Affairs Minister Michael Farrugia.\nAsked by MP Byron Camilleri how many people had been charged with the crimes, he said that between 2013 and 2019, 450 people had been charged, and that so far, 324 had been found guilty. A number of cases are still pending in the courts.\nHe also advised that the judgments, where applicable, ranged from prison time, to fines, suspended sentences and warnings.\n ", "comment_count": 18, "id": 3909}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The true story of two siblings whose mother drowned on their way to Malta has inspired a publisher’s first novel featuring a black Maltese protagonist.\nAuthor Antoinette Borg\nAntoinette Borg’s Amina is an eye-opener for many, with the Maltese girl’s struggles – from being called ugly to having her nationality questioned – intertwining with the book’s narrative.\nThe protagonist started coming alive after the author read an article in The Sunday Times of Malta in which Sr Stefania, from the Ursuline creche, in Sliema, recalled two siblings whose mother had drowned. The children had spent a few days in hospital and had no one.\nMs Borg told Times of Malta she often observed unbelievably cruel attitudes towards black people and migrants, typically starting with the phrase “I’m not a racist, but…”\nShe has always found it difficult to understand why someone’s physical characteristics, whether skin colour, weight or hair, should have any effect on other people’s attitude and why someone’s ability to be compassionate with a fellow human being should depend on whether or not they were Maltese.\n“Whenever we highlight a difference, we get a dimmer view of our sameness and, by a certain point, we seem to be able to ignore that underneath our packaging we are all human with identical feelings and needs,” she said.\n“That is where cruel words and actions and, eventually, bullying start creeping in.”\nJust like the siblings in the newspaper article, there are many black Maltese children growing up in Malta.\n“How does it feel if you are singled out, shunned or bullied because of your skin colour? How does it feel to be Maltese when ‘you don’t look Maltese’, your surname is not Maltese or you have no Maltese ancestors? How does it feel to study your Maltese O-level text - Il-Ħarsa ta’ Rużann by Francis Ebejer - which has the Maltese identity, handed down from past generations, as one of its key themes?\n“These are some of the questions I tried to explore by walking in Amina’s shoes, in the belief that if we understand each other more, we can strive towards a kinder society.”\nUnderneath our packaging we are all human with identical feelings and needs\nA former accountant, Ms Borg wrote three books in three years and received three literary awards, including the 2018 Best Emerging Author award.\nAmina is Merlin Publishers’ first full-length children’s novel that features a black girl. Asked what came to mind when pitched with a book about the daughter of a migrant, director Chris Gruppetta said it was a non-issue for him.\n“The narrative of Amina and her backstory made for brilliant reading and the fact that Amina is the daughter of a migrant reflected the reality of Maltese society.\n“We want to introduce open-mindedness among our youngest learners when they’re starting to shape their notions about how not all people are our exact photocopy and it’s fine to celebrate diversity. That’s how future generations can improve on us,” he said.\nIs he wary of the criticism Merlin Publishers could get?\nSo far, Dr Gruppetta said, Merlin Publishers had not received any negative comments on Amina, although it would not be a first if they did. When they published Mamà, allura din imħabba? – the first children’s book in Maltese about same-sex parents – the publishers endured a torrent of criticism.\nHowever, Dr Gruppetta strongly believes that credible publishers need to give a voice to all sorts of different stories, whether about migrants or racists. \n“We’re already insular enough as a country without our literature also remaining stuck in 1960s zuntier-u-bar-tar-raħal life,” he said.", "comment_count": 12, "id": 3910}, {"keywords": "", "author": "", "article_body": "The European Parliament, the European Council and the European Commission on Thursday reached political agreement on a new regulation ensuring fair and transparent online environment for businesses using online platforms to reach their customers.\nMEP Francis Zammit Dimech was rapporteur and led the negotiations on behalf of the Committee on Legal Affairs. Together with the Committee on Internal Market and Consumer Protection, this was responsible to represent the European Parliament during negotiations.\nDr Zammit Dimech had, over the past weeks, consulted with stakeholders in Malta to ensure that the regulation reflected the challenges and aspiration of SMEs, the hospitality sector and customers.\nReacting after concluding the fourth trialogue Dr Zammit Dimech said: “This is an important milestone for Maltese SMEs, it provides protection from big giants and ensures fair competition online including when accessing cross-border consumer markets.\n\"It is also an important goal for customers such as those who book a hotel or a flight online. This regulation ensures that customers truly get the best value deals when searching for products and services online.”\nDr Zammit Dimech said that similar to trends across the EU, online platforms in Malta were on the rise and that highlighted the importance of this regulation.\nHe said that contracts in the sector between platforms and businesses had to be guided by the principles of fairness and good faith.\nDr Zammit Dimech recalled how up till this week shop owners selling online had spoken to him about unfair practices. He said that the regulation will provide legal certainty for a sustainable business environment online. This was critical to ensure no harm was caused to businesses and to promote trust in the online platform environment in the EU.\nDuring negotiations, Dr Zammit Dimech pushed to protect small businesses users from unfair practices by listing unfair trading practices which will no longer be allowed and and cannot be made use of by platforms when dealing with business users.\nHe also ensured transparency in terms of ranking used by platforms and the prominence given to products/services in search results ensuring there was no abuse of power by platforms or unfair competition.\nData collected through platforms as a result of commercial activity of a business user was to be made available to the respective business. This is crucial for the hospitality sector and would ensure better service and facilitate targeted marketing.\nThe legislation also provided various safeguards to SMEs including the right to be informed in case changes were made in the terms and conditions of platforms, and the possibility to terminate any agreement without any charge in case modifications done by the platform are detrimental to businesses.\nThe deal also improved the internal complaint-handling system calling for equal treatment of businesses without any harmful effects on businesses using the system.", "comment_count": 1, "id": 3911}, {"keywords": "", "author": "", "article_body": "Updated at noon, with Social Security Department statement\nBank of Valletta said on Thursday it had resumed a number of its services during the night after a major cyber attack.\nThe bank shut down all its operations on Wednesday morning after hackers broke into its systems and moved €13 million into foreign accounts.\nThe resumption of services follows rigorous overnight testing of the bank’s IT systems which were successful, the bank said.\nCustomers may now once again make use of BOV services through the bank’s branch network, ATMs, internet banking, mobile banking and by making use of their BOV cards when effecting purchases.\nPayments to third parties is currently the only service not yet activated.\nThe bank again reassured clients that customer deposits and customer accounts were in no way affected by the attack.\n“This unfortunate incident proved that the contingency plans in place and the preventive measures taken by Bank of Valletta were appropriate and that these measures safeguarded the bank, its customers and stakeholders.”\nPrime Minister Joseph Muscat said on Wednesday that four fraudulent international transactions had been made by hackers at Bank of Valletta, transferring €13m to banks in four countries. The funds had been traced and the process has started for the transactions to be reversed. \nBank of Valletta thanked customers, the public and the media for their patience and support and apologised for the inconvenience the incident may have caused.\nIt also thanked its staff and external security consultants who worked relentlessly during the night to identify and resolve the situation, to the authorities and all those who in any way supported the bank during this incident.\nIt reminded customers to be wary of requests for their personal or account details saying it would never ask for customer details through any channel such as social media, emails or telephone.\nShould there be any such requests, customers should contact the bank’s customer service centre on 2131 2020.\nAPS also resumes services\nAPS Bank said on Thursday all its banking services were back to normal.\nThe bank on Wednesday suspended some of its banking services as a precautionary measure following the attack on BOV.\nThe bank, it said, would be refunding any cash advance fees incurred by customers who used their APS Visa Debit card to withdraw cash from third-party ATMs during the APS ATM downtime.\nAny queries, the bank said, may be directed to its customer support centre on 2122 6644.\nSocial Security payments to be deposited as normal\nIn a statement, the Social Security Department said that social security payments which had to be deposited on Saturday would be deposited as normal.\nBeneficiaries would find the relevant payments in their accounts as usual.", "comment_count": 89, "id": 3912}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Thursday’s newspapers.\nTimes of Malta leads with the cyber attack which has crippled Bank of Valletta and says there is no indication of when operations will return to normal. In another story, the newspaper says the Malta police have discussed the tuna racket probe with Europol.\nL-Orizzont says no money was lost in the BOV cyber attack.\nThe Malta Independent says neither the minister, nor the parliamentary secretary, had been contacted, directly or indirectly, by the Spanish tuna kingpin.\nIn-Nazzjon quotes PN leader Adrian Delia saying that to have a roof over one’s head should be a right and not a gift that the government chose to give.", "comment_count": 1, "id": 3913}, {"keywords": "", "author": "", "article_body": "A UK-based charity providing financial assistance, practical information and accommodation to those living in countries with restrictive abortion laws, said on Thursday it has launched its service to residents in Malta and Gibraltar.\nThose needing its services may call Abortion Support Network helpline, visit the website or send an email and receive confidential, non-judgmental information, the organisation said in a statement.\nIt said it would offer advice on the least expensive way to arrange abortion and travel, clinics that ASN worked with in several EU countries, and, where necessary, financial help towards the cost of travelling from their home country and paying privately to access a safe, legal abortion.\nMalta has the strictest abortion laws in the world, banning the practice under any circumstances, whereas the law in Gibraltar allows abortion to save a woman’s life.\nASN said that in addition to practical and financial support for those travelling, it would also provide funding for people in Malta and Gibraltar who wanted a telephone consultation or counselling session provided by leading UK abortion provider, British Pregnancy Advisory Service.\nASN’s founder Mara Clarke said “this Valentine’s Day, ASN is thrilled to spread the abortion-fund love to those living in Malta and Gibraltar.\n“We have been providing our services to Ireland, Northern Ireland and the Isle of Man for almost 10 years and have an excellent network of donors, volunteers and supporters who believe that ‘I can’t afford an abortion’ should never be the only reason someone becomes a parent.\"\nMs Clarke said outlawing abortion never stopped abortion but made it inconvenient for those with financial and other supports, and catastrophic for the marginalised, at risk, or poor.\n“It means that when faced with an unplanned or unwanted pregnancy, women with money have options and women without money have babies – or do desperate or dangerous things to try and self-abort.”\nRead: Women should have access to abortion in at least four circumstances - paper says\nWhile ASN hoped that both Malta and Gibraltar would change their laws to enable women and pregnant people to have safe, legal abortions closer to home, it was more than happy to provide practical information, financial assistance, and, where possible, accommodation in volunteer homes to anyone who needs help in the meantime.\nWomen’s Rights Foundation director Lara Dimitrijevic said: “These services will alleviate to a great extent the discriminatory and cruel situation women in Malta are forced to live in. By abrogating itself from its duties and responsibilities, the state forces women to find their own way to acquire health and support they need.”\nThe Women’s Rights Foundation would do everything in its power to help and assist women in Malta in accessing the service and support provided by ASN.”\nASN said it may be contacted on 00356 2668 0990 or email: malta@asn.org.uk.", "comment_count": 174, "id": 3914}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Andreina Fenech Farrugia, suspended on Tuesday amid bribery allegations, was promoted to fisheries director general on orders issued by the Office of the Prime Minister soon after Labour’s return to power in 2013, Times of Malta has learnt.\nAndreina Fenech Farrugia.\nThe promotion was made despite having been transferred to another government entity from her post of fisheries director two years earlier. At the time she was promoted, the European Commission had indicated to the new Labour administration that the sector “was in a very bad place” when Dr Fenech Farrugia was director, civil service sources said.\nRead: Maltese magistrates investigating tuna industry\n“Until 2011, the local fisheries sector was looked upon very badly by Brussels and the then Nationalist administration had to act by removing her and appoint a new director to put things in place,” the sources added. Her promotion “was inexplicable from an administrative point of view”, they remarked.\nMinutes of a meeting held in Brussels between Malta’s Permanent Representative, Marlene Bonnici, and Fisheries Director General Lowri Evans just 10 days after Labour’s success at the polls depicted a complete change in the industry after Dr Fenech Farrugia’s departure.\nRead: Fisheries corruption claims ‘just tip of iceberg’\n“Lowri Evans, Director General Mare, opened the discussion by noting that when compared to two years ago the situation of the Maltese fishery is ‘completely transformed’,” the minutes state.\n“She explained that DG Mare is delighted with the progress attained by the Maltese control authorities and recalled that two years ago ‘the Maltese fishery was in a very bad place’.”\nUntil 2011, the local fisheries sector was looked upon very badly by Brussels\nThe same minutes quote Ms Bonnici noting that “it was pleasant to learn that DG Mare is delighted with the progress, especially when, in February 2011, Ms Evans had noted the lack of improvement would imply the end of the Maltese sector.”\nRead: Malta's fishy business mapped out\nDr Fenech Farrugia had been transferred to a managerial post in the competition authority in 2011. Joseph Caruana, a former canvasser of Education Minister Evarist Bartolo, later promoted to permanent secretary, had succeeded her.\nRead: Revealed - Tuna tycoon and Malta fisheries 'boss' phone calls\nThe Times of Malta is informed that her transfer was related to her “underperformance” in her job at the Fisheries Department.\n“Brussels was sending report after report of how, despite agreements to implement certain measures in the fishing industry, things never really changed and no tangible results were being achieved. \n“This was why the government had felt that Dr Fenech Farrugia was to be given another role and removed from fisheries,” the sources recalled.\nMr Caruana still holds the role of permanent secretary but was moved to the Finance Ministry after the last election. \nRead: Illegally caught tuna flooding the tapas bars of Spain\nThis followed his brother’s (Edward) arraignment on charges of corruption related to the government’s school building agency, which falls under the watch of the Education Minister.\n ", "comment_count": 151, "id": 3915}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Having a roof over your head should be a right, and not a gift that the government chooses to give you, Adrian Delia told supporters in San Ġwann on Wednesday.\nThe PN leader was referring to comments by Prime Minister Joseph Muscat that the government will not be dishing out housing units like Father Christmas.\nDr Delia reiterated that the government had no plan when it came to social housing.\n“This is an acute problem that will continue to grow because of this government’s policies of increasing the population through the importation of foreigners. This will have long-term effects that we are already feeling the brunt of,” he said.\nOn the other hand, the PN was guaranteeing a roof over the head of every Maltese person when elected to government, Dr Delia added.\nThe Opposition leader criticised “lack of long-term planning in every sector” -  while people could not afford to buy a house and youths did not afford to rent an apartment, students were being taught in containers.\nDr Delia was referring to news that children in some state schools have to attend lessons in mobile classrooms because no more space is available since a planned building programme is behind schedule.\nHe insisted that while the government claimed that the housing problem would grow, the PN spoke of people, rather than statistics, and provided a guarantee that everyone had a right to a roof above their head.\nThe Nationalist Party had already started working on economic models that had worked in the past. When it was in government it had created jobs, changed the country’s infrastructure and dodged damage during a world recession, he noted.\n“The PN is a clear alternative – it will use its time in Opposition wisely. Over the past months we have strengthened the party, so that we can then focus on the solutions that we can provide,” Dr Delia added.", "comment_count": 19, "id": 3916}, {"keywords": "", "author": "", "article_body": "New reports of children assaulting adults were just “the tip of the iceberg,” the parliamentary Family Affairs Committee was told on Wednesday by the Commissioner for Domestic Violence, Simone Azzopardi.\nMs Azzopardi spoke of the psychological difficulty which parents faced in reporting abuse by their own children.\nShe attributed the current situation, in part, to some parents’ having abdicated the responsibility of child-rearing. Parents were increasingly putting this responsibility on the education system and on other care-givers, she said.\nSome children were being babysat by the Internet and left alone for hours on end.\nThe Commissioner for Children, Pauline Miceli, said that adolescents increasingly found it easy to take out their frustrations on their parents - more often than not, their mothers - as they were loaded with academic burdens and underwent drastic hormonal changes.\nShe said such children often were unable to express emotions about what they had suffered. These children and adolescents had often borne witness to or experienced domestic violence - physical or psychological - themselves, by parents who believed that they were instilling a sense of discipline in their children but who were in actual fact undermining their young charges’ personalities.\nMalta Union of Teachers President Marco Bonnici spoke on the violence experienced by educators.\nHe said a survey carried out among MUT members last December had yielded “shocking” results as educators had taken advantage of the anonymity offered them to reveal details of abusive situations which they experienced on a daily basis.\nThe mental health of children and adolescents was not being given sufficient attention, he added. Those presenting with unacceptable behaviour were worrying and traumatizing their fellow students even more so than educators, because the former did not have the option of exiting the situation that the latter did.\nHe said a review of the security of Maltese schools by an external company was an important step forward by the government. However, the widespread attitude that verbal abuse was “part of the job” was unacceptable, and had to be countered.\nDr Bonnici also drew attention to the growing student population in various school districts, as a result of an influx of foreign families. This rapid growth was compromising the government’s policy to aim for smaller schools, with some schools having over 1000 students, he said.", "comment_count": 12, "id": 3917}, {"keywords": "", "author": "", "article_body": "APS Bank has suspended some of its banking services as a precautionary measure following the cyber attack on Bank of Valletta.\nThe bank said on Wednesday evening that the integrity of its customers' accounts was protected and their deposits were safe.\n\"We have nevertheless decided, as precautionary measures, to suspend some of our services - ATMs, cards-related transactions and payments from and to Bank of Valletta.\"\nIt said it was extending its cooperation and support to Bank of Valletta.\nAny queries may be directed to its call centre on 21226644. \nPrime Minister Joseph Muscat said earlier on Wednesday that four fraudulent international transactions had been made by hackers at Bank of Valletta, transferring €13m to banks in four countries. The funds have been traced and the process has started for the transactions to be reversed. ", "comment_count": 14, "id": 3918}]