[{"keywords": "", "author": "Ivan Camilleri", "article_body": "Embattled Nationalist Party leader Adrian Delia on Monday failed to call a meeting of his parliamentary group amid speculation that he is fearing a showdown with rebel Opposition MPs calling for his resignation.\nAs the House of Representatives on Monday reconvened following a long Christmas recess, PN MPs were left completely in the dark, receiving instructions only through mobile messages on who was to take part in debates during the plenary session.\nFaced with the crucial question on why he was shying away from calling his MPs to a group meeting, Dr Delia told journalist Sylvana Debono on RTK that he was not informed on when a meeting of his parliamentary group was to take place.\nThis despite that it is up to Dr Delia, as party and Opposition leader, to call a meeting of his group to discuss any pending issues connected to his party’s representation in Parliament. Dr Delia avoided giving a direct answer and instead said he did not know when the next meeting will be held.\nRead: Young PN activists unwilling to toe party line\n“I don’t have a date for the meeting. I don’t know if it will be this week as I am not informed,” he insisted.\n“There is absolutely no problem for the parliamentary group to meet and I will not hesitate calling a meeting.\"\nUnder normal circumstances, the PN’s parliamentary group is reconvened to discuss various ongoing issues before the resumption of Parliament after long recesses.\nAmid increasing speculation that the majority of MPs have privately expressed their concern over the ongoing state of the PN, related to Dr Delia and his leadership, and are ready to force his resignation as Opposition leader, the group was not called for a meeting.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down\nFor the President of Malta to ask the Opposition to nominate a new leader, the majority of PN MPs have to sign a declaration of no confidence in Dr Delia.\nSo far, only the two Opposition MPs from the Democratic Party, Godfrey and Marlene Farrugia, have publicly said that Dr Delia must go.\nDr Delia has insisted that none of the so-called rebel MPs have told him that he should resign.\nDr Delia also avoided explaining why he was heard on a recording doing the rounds on social media, describing PN secretary general Clyde Puli in “colourful” language. He insisted that he would not comment before hearing the full recording of what he allegedly said.\nInstead, he showered praise on Mr Puli, describing him as one of the officials working hardest for the party.\nRead: Attacks against me are against the PN - Delia\nHe did not reply when asked whether he was denying referring to Mr Puli in a disrespectful manner.\nDr Delia also categorically denied that he had ever touched drugs in his life.\n ", "comment_count": 20, "id": 3419}, {"keywords": "", "author": "", "article_body": "A number of families have been struck off the children’s allowance list after being told that the department did not have their full details.\nA screenshot of an SMS sent to parents by the Social Services Department.\nIrate parents told Times of Malta that they were not even informed about this and only realised that the December instalment of the children’s allowance had not been deposited when they overheard other parents speaking about it.\n“I did not even realise until I overheard parents speaking about it outside my daughter’s school and wondered what had happened to my allowance. I usually receive an SMS a couple of days before informing me that the amount will be deposited in my bank account. I last got it in September but I received none in December. But with the rush of the festive season, I did not give it any thought,” one father told this newspaper.\nHe explained that he called the Social Services Department several times, never managing to get through. On the fifth attempt and after almost 10 minutes listening to music, an agent on the other side of the line said that a letter had been sent to the old address and that because he had not replied to the letter by the given date, he had automatically been struck off the benefit.\nParents told they needed to apply from scratch\nAsked how he could benefit once again, the agent said that he needed to apply from scratch, and that he and his wife had to fill in a form in person at the Labour Office, attaching also their FS3s.  \nThe same happened to several other parents, who were told they needed to apply from scratch for the children’s allowance they are due.\nQuestions sent to the Ministry for Social Solidarity about the matter remained unanswered by the time of writing.", "comment_count": 50, "id": 3420}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says it has seen documents which show that Nationalist Party leader Adrian Delia is facing loan, spousal maintenance payments and other monthly commitments, including the lease of a Jaguar, of over €9,000. In another story, the newspaper says that according to a new tender agreement, a new €14 million waste sorting facility will help the island process larger volumes of recycling in a bid to improve Malta’s poor track record on waste management.\nThe Malta Independent quotes a spokesman saying that Dr Delia is not refusing to convene the party’s Parliamentary group and administrative committee.\nIn-Nazzjon quotes Dr Delia saying that his work is strengthening because he is working in favour of the people.\nL-Orizzont speaks to a German entrepreneur who says that more countries are following Malta’s steps in the Blockchain sector.", "comment_count": 0, "id": 3421}, {"keywords": "", "author": "Jacob Borg", "article_body": "Nationalist Party leader Adrian Delia is facing loan, spousal maintenance payments and other monthly commitments, including the lease of a Jaguar, of over €9,000, documents seen by Times of Malta show.\nWhile his salary as Opposition leader leaves him with around €2,700 in hand per month, Dr Delia insisted during a meeting with Times of Malta that he was keeping up with his monthly commitments.\nQuestions about how he funds his monthly expenses intensified in December after a court ordered him to pay his estranged wife €2,750 monthly in spousal maintenance.\nDocuments seen by the newspaper show that Dr Delia faces loan repayments of €3,933 monthly with HSBC, €1,413 with BNF and €835 with BOV.\nHe also makes use of credit card and overdraft facilities with all three banks.\nRead: Income tax saga comes back to haunt Adrian Delia\nDr Delia told Times of Malta that it was no secret he had loans with HSBC, BNF and BOV, as this was declared in his financial submissions to Parliament. This declaration shows the loan amounts total for 2017 amounted to €700,000.\nThe Opposition leader declined to comment on the amount of the monthly loan payments without having sight of the documents Times of Malta was referring to.\nDr Delia said he had sold his shares in his law firm and the amount of the sale was being repaid to him in monthly instalments.\n“The funding of what you are asking about is coming, at this stage, from the repayment of the shares that I sold,” he said when asked how he was keeping up with these monthly expenses.\nThe amount I am receiving is enough to cover my loan repayments\nHe declined to state the precise amount of the monthly payments for his shares, insisting it was an agreement involving private individuals.\n“I abided by my legal obligations by declaring my shares and my liabilities and I also can confirm that the amount I am receiving is enough to cover my loan repayments,” Dr Delia said.\nThe Opposition leader said the eventual sale of his shares in Mġarr Developments Ltd would also be a future source of income, though he acknowledged that the timing did not depend on him as units were still being sold and loans for the property development paid off.\nRead: Delia has ‘no savings in local or foreign banks’\nSlain journalist Daphne Caruana Galizia had published documentation in 2017 showing that Dr Delia together with his wife are jointly and severally responsible together with other shareholders in the property company to pay a €7 million debt with HSBC.\nApart from the loan repayments, Dr Delia committed himself in March 2017 to pay €629 monthly to lease a Jaguar which he admits he barely uses now since Parliament provides the Opposition leader with a car.\nQuestioned why he chose to lease a Jaguar given his debts, Dr Delia rebutted that the car was leased before he entered politics, and at that point in time he could afford it.\n“At the moment in time when I cannot afford it anymore, I will have to see how to come to an arrangement. When I got it the issue was whether it was more worthwhile to lease it or buy it,” he said.\nHe also expressed his distress that this “stolen” information was in Times of Malta’s possession.\nDr Delia also pays €21,000 in school fees, amounting to €7,300 per term.\nBanking correspondence seen by Times of Malta shows that BNF bank asked Dr Delia to provide more information about a €308,000 payment made by one company into his account, along with multiple inward payments totalling €106,000 from another company during 2015.\nThe queries about the past payments were made due to Dr Delia’s status as a politically exposed person, who are vetted more vigorously by banks in line with anti-money laundering regulations.\nDr Delia also expressed his “serious concern” that information about BNF’s queries was in Times of Malta’s possession.\nFor source protection reasons, Times of Malta declined all requests by Dr Delia to see the documents in question.\nHe said that since he became a PEP, all banks did their standard checks and the requested information was supplied without any issues being raised.\nDelia’s monthly payments:HSBC: €3,933BNF: €1,413BOV: €835Spousal maintenance: €2,700 Jaguar lease: €629 School fees: €7,200 (per term)\nDelia’s monthly income: Opposition leader salary: circa €2,700 (net)Income from sale share: undisclosed", "comment_count": 239, "id": 3422}, {"keywords": "", "author": "", "article_body": "Updated Monday 8.53pm with Corinthia explanation below - The Corinthia Group defended its plans for the St George Bay development on Monday and denied some claims being made about it.\nThe group issued a statement in the wake of media reports and statements by environment NGOs.\nEarlier, Moviment Graffitti hit out at a proposed deal between the government and the group, which it said would mean giving away public land “for a pittance”.Describing the proposed deal as “intrinsically wrong on every level”, the group said in a statement on Monday that the land would be used “for a monstrous project that will have a disastrous impact on people and the environment”.According to a still unpublished draft deed, the Corinthia Group has been awarded the whole of the St George’s Bay peninsula for at least 99 years at a fraction of current market prices, as well as the seabed for land reclamation.Corinthia will pay a premium of €17 million for the land, a figure which has drawn criticism from industry figures, and plan to build 100,000 square metres of commercial and residential real estate and offices.Moviment Graffitti said the deal meant Corinthia would be making hundreds of millions by selling apartments on land they had got “practically for free”, which they described as a “blatant case of land theft by big business from the people”.This will destroy large parts of the seabed and close public access to a significant portion of the foreshoreThe NGO also referred to reports that the project would include 12 towers with more than 500 apartments, three times the amount of the recently-approved City Centre project on the nearby Institute of Tourism Studies site.“This will clearly have a deleterious impact on the coast and Natura 2000 sites, and it will bury alive residents in the surrounding localities under traffic, pollution, noise and intensive commercial activity,” Moviment Graffitti said. “It would also destroy large parts of the seabed through land reclamation and close public access to a significant portion of the foreshore.” Moviment Graffitti noted that the local plan would have to be amended to allow the development to be approved, and that a master plan for the broader area was still nowhere to be seen despite repeated promises.It accused the authorities of implementing a “secret masterplan”, circumventing normal channels, in light of the several massive projects in the area.“This is a masterplan that fully transforms that area in a gold-mine for the very wealthy, and completely ignores quality of life considerations and environmental protection,” the NGO said.\nIn a separate statement, NGO Flimkien għal Ambjent Aħjar maintained that the transfer of yet another vast area of prime real estate in the area, to a private enterprise raised many social, environmental and economic concerns.\n\"In the first place the area was conceded to the group specifically for tourism purpose, supposedly to improve the tourism product, create long-term employment, and benefit the public good,\" the group said. \nCorinthia explains: deal is about change of use of land\nIn its reaction, the Corinthia said it already holds long-term exclusive rights to the land.\n\"The draft agreement with Government covers solely contractual terms for the restatement of our existing ownership rights to the land in St George’s Bay, nothing more. The draft limits us to potentially developing a maximum of 100,000m2 of commercial and residential areas, besides an obligation to develop two new luxury hotels. This limitation should be also be read in relation to the floor areas we are currently allowed to develop under current planning rules.\" the group said.\n\"The contract therefore, is about terms and conditions stipulating maximum limitations and not about architectural plans, of which there are none in our proposed agreement with government, as these will be developed over the years to come in a series of phases and subject always to planning rules and consent.\"\nThe group insisted that certain visuals presenting several high-rise buildings crammed next to one another on the St George’s peninsula were misleading.\n\"They certainly do not represent our plans, or our track record in developing landmark, balanced projects in Malta and overseas. They cannot therefore serve as a reference for an informed debate.\nWith regard to claims on the number of serviced residences which will be developed on this site, the company said that subject to the draft agreement, actual architectural plans have been prepared for the proposed phase one (picture), and these will be discussed with the relevant regulatory and planning authorities in due course.\n\"Our aim here, in this first phase, is to entirely redevelop the Corinthia Hotel into Malta’s foremost luxury property together with extensive landscaped gardens and amenities. In parallel, we are aiming to develop two luxury serviced residential blocks, the highest proposed to be 15 floors, on land located between the current Corinthia and Radisson hotels. In total, these blocks will accommodate 90 apartments that have been designed to a standard that would make them competitive internationally and therefore make Corinthia the forerunner in this sector in Malta.\n\"What will happen beyond will depend on many factors, including economic viability, planning considerations, and so much more, but above all, a commitment of ensuring a beautiful development of six-star standard supporting our new Corinthia hotel. \n12 towers proposal 'outdated volume study'\nWith regard to claims that the company intends to develop 12 towers, the highest of which will be 21 floors, the company said the master plan being presented on some local newspapers was an outdated volume study, one of many which was prepared in the past years, in order to analyze the different possibilities.\n\"Currently the company only has plans to redevelop the Corinthia Hotel into Malta’s foremost luxury property and develop two luxury serviced residential blocks. Our intentions remain for the vast majority of our land will remain open and landscaped, indeed the majority of the land will remain unbuilt as this is cardinal to achieve our six-star standard. In itself, this clearly demonstrates our intentions to maintain a balanced, holistic environment to our proposed luxury hotels and serviced residences.\nNo land reclamation\nThe group also insisted it has no intention of pursuing land reclamation. \"We understand the proposed clause in our draft agreement is standard to similar agreements across Malta. However, we repeat, that we do not intend to pursue any land reclamation as part of our project and consequently this concern is a non-starter,\" it said.", "comment_count": 24, "id": 3423}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Organ donors leave behind relatives who need all the support they can get, especially when they keep thinking about the physical remains of their loved ones, the parents of a 20-year-old donor say.\nDrew Abela passed away suddenly after suffering a brain haemorrhage in summer 2016. For his family and friends, he will be remembered for his gentle nature but for seven people who received his organs, he is a lifesaver.\nDrew Abela\nIn dealing with the tragic loss of their son, his parents, Sharon and Kenneth, funnelled their energy into the Life After Drew campaign.\nIn collaboration with the Transplant Support Group Malta, the campaign is raising awareness about the need of organ donation, encouraging others to register as donors and calling for a support structure that guides surviving relatives through the process.\n“There are some misconceptions that keep cropping up in relatives’ minds about organ harvesting or being unsure that the deceased person has actually passed away. Relatives need continuous reassurance. In our case, the medical team was very caring and treated Drew with dignity,” Mr Abela told Times of Malta. \nAs the Be A Hero, Become A Donor campaign picks up steam, Ms Abela noted that some relatives found it difficult to give their consent if the deceased family member had not registered as a donor. She, therefore, encouraged people to register and help put their relatives’ minds at rest.\nShe acknowledged there were several other families like hers and, commending their life-saving decisions, Ms Abela urged them to help out with the campaign.\nRelatives are still dealing with the tragic loss\nThe effect of the loss on the surviving relatives struck a chord with Johann Caruana, a former Mcast student. The college joined forces with the campaign, raising awareness through an exhibition by fine arts students, a show by performing arts pupils, documentaries by the journalism department, a new brand identity for the support group by graphic design students and TV adverts by those following the creative media degree.\n“I recall the day that Sharon shared with us photos and footage of Drew. The reality of a ‘normal’ youth who helped out so many people after his death hit us hard,” the 21-year-old, then a second-year student doing Mcast’s creative media productions degree, told the Times of Malta.\n“But Drew also left behind relatives who are still dealing with the tragic loss and it dawned on me that it is not only important to encourage people to sign up to become donors but also to support the surviving family,” he remarked.\nMr Caruana’s short clip required the help of three fellow students and the purchase of new equipment. However, he feels the impact it could have even on one person was all worth it.\nHis clip revolves around a surviving relative sitting down in front of an empty vase that is slowly filled up by red and white flowers handed out by supporting people. The flowers’ colours symbolise blood and deceased donors while both colours are also a reminder of the Maltese flag.\nOne can become a donor in minutes by either registering online using one’s e-ID details, sending the application form by e-mail, or by post.\nLook up the Facebook page called Transplant Support Group – Malta or log onto www.transplantsupport.org.mt for more information on how to become a donor.\nKenneth and Sharon Abela, and Johann Caruana (left to right). Photo: Matthew Mirabelli", "comment_count": 1, "id": 3424}, {"keywords": "", "author": "", "article_body": "Parliament on Monday held its last scheduled evening sitting and will be holding all its sittings in the afternoon from now on.\nThe 'family-friendly' measure was first introduced when Wednesday sittings started being held between 4pm and 7.30pm two years ago. Tuesday sittings were similarly scheduled last year.\nThe new schedule is aimed at enabling MPs, especially women to enjoy more family time.\nBut one MP, Maria Deguara (PN), in a speech last year said the so-called ‘family-friendly’ parliamentary hours were anything but, and would actually discourage people, men and women, from seeking office.\n“The new hours are bad for MPs who have professional offices that open between 3pm and 7pm and they are equally bad for MPs in employment because hardly any job ends at 4pm,” she said.\nThe prime minister has also announced that the government intends to introduce measures to ensure that more women are elected to the House.   \n \n \n ", "comment_count": 6, "id": 3425}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Tigné residents’ fears over the impact of the Townsquare high-rise project have increased despite new downscaled plans, a social impact assessment has found.\nThe Townsquare plans have been reduced from 38 storeys to 27, among other changes intended to minimise its impact, after a controversial permit issued two years ago was revoked following an appeal by objectors.\nHowever, a sociological study published as part of the environment impact assessment on the new plans shows public perception to the project remains “generally negative” since it is viewed as being a sizable development within an already developed area.\nResidents said there was no need for another high-rise development in the area and expressed fears that the project would pave the way for similarly high developments in the immediate surroundings.\nAccording to the report, the fears became more pronounced since the last similar study in 2007 as residents are more mindful of the impacts such a project could have on their surroundings.\n“It is evident that previous concerns over physical and social overshadowing and reduced light penetration have become serious concerns that they will be dwarfed by surrounding high rises in the future,” the report notes.\nResidents also expressed fears that the project would further commercialise the immediate surroundings, still considered primarily residential, and that it would exponentially increase the population, reducing any remaining sense of community and locality left in Tigné.\nYounger respondents – those aged 16 to 25 – were more positive about the project, though the report adds that this varied depending on whether they had elderly family members living at Tigné.\nResidents were also positive about the increase in open spaces included in the project as well as the impact of commercial outlets on the local economy and the possibility of the project leading to an upgrading of the area’s overall infrastructure, which they said should take place during the planning stage.\nRecently-arrived foreign residents in particular felt that if the project offered the right services for everybody, it could improve the quality of life and sense of community in the area.\nThe EIA also considered the visual impact of the project from several viewpoints, concluding that the largest impacts would be on close viewpoints in Sliema, Gżira and Valletta as well as Villa Bighi, in Kalkara.\nMinor or moderate impacts are predicted from Mdina, SmartCity and Vittoriosa, while the tower will not be visible from viewpoints at Marsa, the University campus or Fort St Angelo.\nAccording to the report, traffic is expected to increase by about 21 per cent over current levels, with an average of 2,569 additional car trips along Qui-si-Sana on weekdays, down from 3,500 in the earlier plans.\nHowever, an air quality study concluded that traffic emissions will potentially be negligible.\nAir quality is expected to be a more significant factor during excavation, though the report notes that most has already been completed, with the remaining works only expected to last four months.\nThe new plans are also expected to reduce overshadowing on nearby properties, with most shadows falling on the site itself, as well as increasing the provision of open space.", "comment_count": 3, "id": 3426}, {"keywords": "", "author": "", "article_body": "It was unacceptable that some NGO rescue vessels issued their coordinates on social media such that traffickers’ boats immediately homed in to them, Prime Minister Joseph Muscat told Parliament on Monday.\nIt was also unacceptable that NGO boats raced to pick up migrants who were not in distress within Libyan waters when the Libya coastguard was preparing to pick them up itself.\nDr Muscat was replying to questions after giving a statement on the recent controversy involving 49 migrants picked up by NGOs and eventually disembarked in Malta.\nThe prime minister said the Libyan coastguard, financed and trained mostly by the European Union, was doing good work. According to the UNHCR, it picked up 14,000 people in the past 14 months. \nThe coast guard, he stressed, should be allowed to work. He had no problem with NGOs helping to rescue persons in distress, supplementing the work of the armed forces. But what he was insisting upon was that everyone should follow the rules.\nThere had been instances of interceptions by NGO rescue vessels of persons not necessarily in distress which the Libyan coastguard was itself preparing to pick up.\nSituations then developed where the migrants did not want to return to Libya, and Italy closed its own ports because the rules were not observed, with the ships then coming to Malta.\n“There are rules for everyone and we cannot have a race in Libyan waters. Rules have to be observed,” Dr Muscat said. \nIn his statement, Dr Muscat underlined how in the recent crisis Malta had done its duty even though it was not involved in the rescue, and the closest harbours were in Libya and Italy.\nDr Muscat said it was obvious that when people were in distress, those closest to them should rescue them, but one could not have a situation were an NGO vessel which was not involved in any rescue operation gave its coordinates on social media and then one saw the people traffickers homing in on it.\nSome conspiracy theorists would argue that this was all done in agreement. He did not agree, but it was a fact that everyone used social media and as soon as the traffickers in Libya learnt of a rescue boat’s location, they targeted it. This was unacceptable.\n“This is an uncomfortable truth. We need proper governance for countries as well as NGOs,” Dr Muscat said.\nHe also insisted that Malta wanted to make the point that it would not allow itself to become ‘the new Lampedusa’ which migrants aimed for.\nThe prime minister also referred to his talks with the Libyan prime minister in Valletta last week, saying they had been very constructive. \nHe said he had stressed the point that ‘drastic improvement’ was needed in the migration centres in Libya.\nLibya needs to step up human rights and conditions in the detention centres“Libya needs to step up human rights and conditions in the detention centres,” Dr Muscat said.\nWith regard to bilateral relations, he said Malta’s embassy in Tripoli would be opened in a new building as soon as it was safe to do so.\nHe said it was not feasible to continue to house the embassy in the current government-owned building, because of security concerns.\nHowever, an alternative building had been identified to serve, at least, as a temporary embassy.\nHe observed that in the past the government had already set a date for the embassy’s reopening, but it was thwarted on the very day the decision was taken because of a major blast in the Libyan capital \nHe said that Air Malta and the Tourism Ministry were also considering a reopening of Air Malta’s service between Tripoli and Malta, but again, this depended on security arrangements and other considerations, such as insurance.", "comment_count": 0, "id": 3427}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Drivers involved in a collision should be regarded as potential suspects rather than mere eyewitnesses and any on-site declaration made by them should be handled as a statement which could be brought as evidence in court proceedings, a magistrate said on Monday.\nIn a judgment with potentially far-reaching implications, Marlon Camilleri, 33, was fined €1,000 and banned from driving for three months after being found guilty of causing grievous injuries to a motorcyclist in a traffic accident brought about through his negligence.\nThe accused’s version supplied to a police officer at the scene of the crash was discarded as evidence by the court which declared that a statement released by a suspect was to be interpreted as incorporating also any informal version released to investigators.\nMagistrate Donatella Frendo Dimech observed that it was common practice in traffic accidents for police to jot down the parties’ versions on-site, rather than at a formal interrogation at the police station or at the inspector’s office.\nYet, this version was tantamount to an official statement, meaning that the party who could potentially be charged later in court should be immediately cautioned before being asked to supply his version, irrespective of all the difficulties this could entail.\nIn this particular case, the car driver had not been read his rights and had not been assisted by a lawyer when talking to the police sergeant on site, minutes after the collision.\nDelving into EU legislation and case-law, Magistrate Frendo Dimech that such a version amounted to a statement which was to be discarded once the driver had not been cautioned.\nThe court also deplored the handling of the case by the prosecution, observing that only four witnesses had been heard over 43 months before the case was assigned to the present court in February 2018.\nMoreover, contrary to instructions by the attorney general's office, the prosecution had summoned no further witnesses, not even the doctors who had certified the injuries suffered by the victim.\nThe collision had taken place in February 2013 in Vjal il-Ħelsien, Zebbuġ when the accused’s Skoda had exited a side road, crashing into a motorcyclist who ended up suffering fractures to his hands and ribs.\nTestifying nine months after the accident, the victim had explained how he still needed therapy and could not stand up for long.\nThis testimony was regarded as “honest, sincere and credible” by the court, having been corroborated by the Full Road Traffic Accident Report and was in no way rebutted by the accused.\nOn the other hand, the accused’s testimony had been riddled with contradictions, leading the court to conclude the car driver had failed to abide by the Highway Code and had not kept a proper lookout, thereby causing the accident through his negligence.\nFor this reason, the accused was declared guilty and was fined €1,000 besides having his driving licence suspended for three months.", "comment_count": 25, "id": 3428}, {"keywords": "", "author": "", "article_body": "Talks are continuing between the government and contractors Skanska within the arbitration process in the wake of defects found in the structure of Mater Dei Hospital, Health Minister Chris Fearne told parliament on Monday.\nReplying to questions by Nationalist MP Jason Azzopardi, the minister said the hospital was defective as its concrete would not last as much as it should should; it was defective because the structure could not support the building of additional storeys, and it was defective because although it was supposedly earthquake proof, part of it would be unusable if there was a strong earthquake, something which was particularly serious since this was Malta’s only major hospital.\nAll this was unacceptable, and the government had launched talks with Skanska as the lead designer and contractor. The government had rejected the waiver clause introduced by the former government and a case was instituted before the Arbitration Centre.\nREAD: Government to sue Skanska over Mater Dei concrete\nTalks between the two sides were continuing within the context of the arbitration proceedings and he did not wish to give any information which could prejudice the case, Mr Fearne said.\nReports of hospitals transfer for one euro\nAsked by Nationalist MP Beppe Fenech Adami about reports that Vitals had sold the three public hospitals it administered for just one euro to Steward Healthcare, and other reports about secret money transfers to a Dubai company and elsewhere, Mr Fearne asked for a copy of the reports. \nHe said that since February, Steward Healthcare had invested €20 million in Malta's hospitals.\nThe opening of the anatomy centre in Gozo had been a milestone and he, as well as the experts from Barts had never seen such an advanced facility.\nMajor progress was also being made on the building of a new medical school in Gozo.\nThis would be following by the building of a modern hospital for Gozo, replacing the one which the former government left in a shameful state, the minister said.  ", "comment_count": 7, "id": 3429}, {"keywords": "", "author": "", "article_body": "There are still 275 students without free school transport, over three months after the start of the academic year.\nEducation Minister Evarist Bartolo said the students in question attended non-State schools.\nSpeaking at the launch of an extension of free public transport to younger people and students, he said that the number “has gone down drastically since the beginning of the scholastic year”. He promised to continue working to find transport “to take every student on the waiting list to Church and independent schools”.\nThere are six transport operators with a contract for State school transport in Malta, and two in Gozo, while 169 operators having a contract for non-State school transport in Malta and another nine in Gozo. In all, 1,183 vehicles are used every day time for this service.\nThe extension of free transport to students in independent and church schools had been launched with very positive messages, saying that the system would take 3,000 cars off the road \"in some key areas and during certain times\".\nIt was also announced that parents could save around €700 per child every year.\nBy mid-October, the number of students using transport stood at 25,081. However, there were not enough resources to provide the service, and that month there were around 900 still without a service provider.", "comment_count": 0, "id": 3430}, {"keywords": "", "author": "", "article_body": "The third extension of the free public transport initiative has been launched, making youths aged from 14 to 20 and full-time students 21 or older eligible.\nThe Budget 2019 measure is an extension to the 2017 initiative which gave free public transport to 18-year-olds. The €250,000 investment benefitted more than 4,000 youths who made nearly 600,000 trips. In 2018, €2.2 million was spent as the measure was extended to all youths aged from 16 to 20, reaching 24,000 who made more than 5.2 million trips by the end of last year.\nThis year, the government has set aside €3.3 million, hoping that it will reduce transport relating to schools.\nTransport Malta is also giving grants to six schools that came up with positive initiatives towards alternative means of transport.\nThere are also two agreements in place for free school transport: one for State school students and another for students attending Church and independent schools, which is being used by 28,000 students.", "comment_count": 5, "id": 3431}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An Occupy Justice activist, who had only once personally met Daphne Caruana Galizia, told a court on Monday that she devotedly visits the Great Siege monument at least twice daily to replenish flowers and candles at the makeshift memorial to the blogger.\nAnn Demarco, a former banker, took the witness stand in the constitutional case filed by blogger Manuel Delia against the government over an alleged breach of his fundamental right to free expression, after flowers, candles and banners, symbols of protest over the assassination, were repeatedly cleared away from the foot of the memorial.\nBefore September 8, when the monument was hoarded off for restoration purposes, items left by members of the public used to remain there for a month or so, before being removed, Ms Demarco explained.\nHowever, since that date, the items are removed shortly after being placed there, thus making it necessary for the Occupy Justice activist to visit twice daily on weekdays and once at the weekend, the witness explained.\nBefore restoration works on the monument had started in September, photos, candles and flowers were always placed on the pedestal under the monument. Some plants, including a bay tree, had been planted in the soil and were regularly planted throughout the dry summer months, said Ms Demarco.\nAsked by Mr Justice Joseph Zammit McKeon about the reason for such public manifestations, Ms Demarco answered “This is an important protest. The assassination of a journalist is horrifying. When I heard the news, I was shocked. My whole life changed.”I want to live in a country where the police do their job\n“The brutal manner of her assassination, the fact that no one would take political responsibility for her killing… Persons were arrested and the case is still ongoing, but no steps were taken,” the witness went on, adding “I want to live in a country where the police do their job. Daphne was left alone. Now we owe it to her. We cannot abandon her work until justice is served.”\nRead: Watch: Authorities 'determined' to eradicate Daphne's memory - world-renowned author\nUnder cross-examination by Dr Chris Cilia, on behalf of the Public Cleansing Department, the civil rights activist said that the choice of the site, though strategically located opposite the law courts, had been spontaneous, a follow-up to flowers first being placed there by San Anton School pupils.\nAsked about ownership of the items, Ms Demarco said that these belonged to her and that no-one had asked her to place them at the memorial.\nAs for Occupy Justice, the woman explained that this was a pressure group made up of women who got together after Ms Caruana Galizia's murder.\nPhoto: Mark Zammit Cordina\nAlso testifying in today’s sitting was Christoph Schwaiger, the journalist who, on September 15, last year, had been physically stopped from filming public cleansing workers clearing away the memorial.\nThe witness recalled how a senior technical officer, Maurice Spiteri, had gripped his hand and mobile phone, telling him to stop filming since he was “creating a risk for his colleagues.”\nFortunately, the situation had not escalated, but the journalist had been advised by his newsroom to file a report at the Valletta police station, which he duly did.\nDr Karol Aquilina, in his personal capacity and as legal counsel to Manuel Delia, testified as to how he attended all vigils and protests since the journalist’s assassination.\nHe recalled one incident, back in March last year, when candles he had personally purchased and placed at the memorial, had disappeared the following day. When reporting the matter to the police, he had been told that officers had indeed spotted the alleged ‘thieves’ and had given chase.\nThe two men had been Nigel Vella, Director of Raymond Vella and Co Ltd and Chris Galea,  Head of Government Events at the Office of the Prime Minister, Dr Aquilina said, adding that no steps were taken.\nAnother episode recounted by Dr Aquilina dated back to September 15 when he had gone to the Valletta police station with Mr Delia to report that the memorial had once again been cleared.\nIn a brief phone conversation, Ramon Deguara, Director General of Public Cleansing, had seemed “very sorry” but had declared that he had been following personal instructions from Minister Bonnici.\nMr Deguara had also informed Dr Aquilina that he had issued orders for the items to be returned to Mr Delia.\nDr Aquilina also referred to a chance encounter with the minister in Valletta wherein he had told Dr Bonnici that what had happened was unacceptable and amounted to a breach of freedom of expression.\nAt the start of the sitting, the court delivered a decree whereby it upheld an application by former PL Minister Dr Joseph Brincat for his intervention in the suit but only limitedly to assert his right to freedom of expression in stating that Valletta’s Great Siege Monument ought to be untouched.\nThe case continues in February.\nLawyers Therese Comodini Cachia, Jason Azzopardi, Eve Borg Costanzi and Karol Aquilina assisted the applicant.\nLawyer Victoria Buttigieg and Joel Calleja assisted the minister.", "comment_count": 0, "id": 3432}, {"keywords": "", "author": "", "article_body": "Weeks of observation culminated in a drugs raid in Marsa on Sunday, in which three men were arrested.Police said in a statement that the drugs squad had been monitoring premises in Triq it-Tigrija suspected to be used to traffic various illegal drugs throughout the day.A raid by drugs squad officers, assisted by the special intervention unit and traffic police, revealed sachets containing substances believed to be cocaine, heroin and cannabis, all ready for distribution. The amount recovered was not disclosed.Police also found electronic scales and other equipment used for drug consumption or trafficking was also found.The raid led to the arrest of three men: a 34-year old living in Ħamrun, a 46-year old living in Msida and a 29-year old Libyan living in Marsascala. The three are being held for further questioning.Duty magistrate Neville Camilleri was informed of the case and has ordered an inquiry. Police investigations are still ongoing.", "comment_count": 0, "id": 3433}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "A call for the selection of a contractor to design, build and operate the Malta-Gozo tunnel will be issued 'soon', Infrastructure Minister Ian Borg said on Monday.\nSeven bidders have responded to a call for offers for technical experts to support Infrastructure Malta in the planning and implementation of the tunnel project, the minister said in a Facebook post.\nThe average value of the bids is €10.5million. \nRead: Malta-Gozo tunnel plans should be ready within six months\nThe current proposal would lead to the creation of a 13km-long tunnel with a 7 metre radius and one traffic lane heading in either direction, with an additional safety lane.\nAn undersea Malta-Gozo tunnel would run between Manikata and Nadur, according to studies currently being considered by the government.\nMeanwhile, Gozo Minister Justyne Caruana said on Sunday that Gozo Channel is to acquire a fourth ferry - a response to huge queues at the ferry terminals during the holidays and long weekends.\nSpeaking at a Labour political conference, the minister said that talks are in hand for the company to acquire a fourth ferry. She gave no further details.\nTimes of Malta had reported in June that plans for the charter of a fourth ferry had foundered because of disagreement between the Gozo and finance ministries. \nMaritime industry sources had said that Gozo Channel had made arrangements to lease a Ro/Ro vessel from an international company, at least for the summer months. The ship, with a capacity of up to 1,000 passengers and 150 vehicles, was to be leased with the crew at a cost of about €3,000 a day. The finance ministry had baulked at the cost.\nThree vessels were built at Malta ShipbuildingThe company currently operates three ferries, the first to be built specifically for Gozo crossings. All three ships, built at the now defunct Malta Shipbuilding, are owned by the government and chartered to Gozo Channel.\nThe first, Ta’ Pinu, was commissioned in March 2000, followed by the Gaudos in February 2001 and the Malita in March 2002. The Malita differed from her sister ships in that it had two hoistable decks, enabling it to carry 138 cars along with 900 passengers. That feature was later added to Ta’ Pinu. Gaudos carries 72 cars and has a specially strengthened main deck for extra-heavy cargo.\nChartering a vessel is complicated for Gozo Channel because harbour infrastructure at both Ċirkewwa and Mġarr was built specifically for the current vessels, and a new ferry would need to match those specifications.\nGozo continues becoming an increasingly popular destination, particularly over the holidays and long weekends, but commuters have complained frequently about queues lasting hours. During the Christmas season, the vehicle queue at Ċirkewwa sometimes stretched all the way to Marfa Road.\nDr Caruana first raised the possibility of the introduction of a fourth ferry when speaking during the Budget debate in parliament in November 2017. She confirmed that despite the plans for the fourth ferry – and a possible tunnel – the government also intends to introduce a fast ferry service between the two islands while legal wrangling ends. \nPlans are also in hand to reintroduce a helicopter service.", "comment_count": 84, "id": 3434}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Former Labour parliamentary secretary Deborah Schembri and her advisor at her ministry, Robert Musumeci, have formed a new partnership to provide legal services to their clients which include government authorities.\nRD Legal, acronym for Robert and Deborah, was officially registered as a partnership, last year, according to the Companies Act.\nTheir partnership, registered at Mr Musumeci’s architectural office in Siġġiewi, aims, among others, to act as advisors on administrative and technical matters in the field of property administration, procurement and contractual obligations.\nThe two partners are also to act as representatives and to appear on behalf of customers as required.\nTimes of Malta is informed that one of their partnership’s most important clients so far is the government. Both Dr Schembri and Dr Musumeci were appointed consultants to the Lands Authority and represent the public institution in court.\nA Lands Authority source told this newspaper that both former politicians are currently defending the authority in front of the Lands Arbitration Board and in other litigations in court.\n“They both have a good legal background on the workings of the new Lands Authority Act as basically this was their main focus when Dr Schembri was parliamentary secretary until she failed to be elected in the last general elections,” the source said.\n“The two individuals who were responsible for formulating the current authority’s laws are now serving as its legal advisors, raking in the legal fees.”\nDr Schembri was appointed a parliamentary secretary responsible for the reform at the then Lands Department in 2016 following the sacking of then parliamentary secretary (now minister) Michael Falzon due to the Gaffarena debacle involving public property in Valletta.\nThe two individuals who were responsible for formulating the current authority’s laws are now serving as its legal advisors\nSoon after her appointment, Dr Schembri appointed Dr Musumeci, who is both an architect and a lawyer, as her main advisor to steer the reform.\nDespite the fact that Dr Musumeci, a former PN politician who switched to Labour after the 2013 elections, had defended Dr Falzon during the Gaffarena scandal, declaring that he had done nothing wrong, Dr Schembri defended her choice to appoint him as her advisor.\nAt the time, Dr Musumuci was already acting as an advisor to the Office of the Prime Minster, particularly with regard to the Planning Authority.\nDuring her short stint in office, Dr Schembri faced criticism after it emerged that Dr Musumeci, her consultant on lands reform, was also acting as her personal architect on a planning permit to build a new house next door to the residence of the Prime Minister in Burmarrad.\nAt the time, Dr Schembri had denied any conflict of interest, saying that she was paying Dr Musumeci for his private services out of her own pocket.\nBoth Dr Schembri and Dr Musumeci have been appointed to various government positions over the past few years.\nSince June 2017, when she was not returned to Parliament, Dr Schembri has landed four government jobs, raking in close to €200,000 a year from government consultancies and appointments, which include services to the Lands Authority and Planning Authority, the Office of the Prime Minister and Identity Malta.\nDr Musumeci, one of the architects most successful at acquiring Outside Development Zone permits for his clients from the Planning Authority, was also recently in the news in connection with illegal works carried out by Transport Malta on an access road leading to his secluded farmhouse in Wied Qirda, limits of Siġġiewi.\nMr Musumeci denied any connection to the illegal works, saying he had nothing to do with them.\nDespite an enforcement order to remove the illegalities nothing has been done so far.", "comment_count": 41, "id": 3435}, {"keywords": "", "author": "Ivan Martin", "article_body": "Valletta’s iconic parliament building is leaking during bad weather, raising concerns of structural and equipment damage, Speaker Anġlu Farrugia warned on Monday.\n“This is a problem that started three years ago, and has been getting worse year-on-year, something really needs to be done as this has become an extraordinary situation,” he said.\nDr Farrugia was venting his frustrations during a press conference on the upcoming 5+5 dialogue meeting being held in Malta this week.\nHolding photos of mould-covered walls and rusting steel work caused by “constant leakages”, Dr Farrugia told reporters that water seepage was affecting several parts of the building from the administrative block, to the emergency exit, and even the building that houses the main chamber and some bathrooms.\nMould forms on the walls of the Parliament building as rain water leaks continue\n“I am not a contractor, and I did not build this building but there are a lot of issues. On our end, as the lessee and not as the lessor, we have carried out maintenance and upkeep, even going beyond what we should do, but there are problems that need solving, particularly when it comes to flooding,” he said.\nAn irate Dr Farrugia said it was clear that the building, designed by world-famous architect Renzo Piano, had not been finished properly, saying even glass panes and doors had not been fitted properly.\nHe was in touch with the Grand Harbour Regeneration Committee on the matter, but urged the competent authorities to intervene to save the country’s highest institution from major structural damage.\nThe building at City Gate in Valletta was constructed between 2011 and 2015 as part of a project to transform the entrance to the capital.\nDr Farrugia warned that it was only a matter of time until the electrical and IT systems were damaged, which could have serious repercussion on the functioning of the institution.\nLast month, Times of Malta reported on the problem of leaks in the building. Water trickled down from the ceiling in one room within the iconic Valletta building during a press conference held last month by the Democratic Party in a room used by the Opposition.\nPlastic containers were placed in strategic locations around the room to avoid damaging the parquet flooring. A stone veneer covering part of the ceiling has taken on a mouldy green hue as a result of the water seepage. Wiring could be seen in a panel adjacent to the veneer.", "comment_count": 49, "id": 3436}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man has been remanded in custody on Monday after pleading not guilty to allegedly raping and harassing a work colleague.\nMarcel Andreas Ekvall Parada, a 24-year old Swedish national, residing in Sliema and locally employed in the financial sector, was arraigned under arrest, pleading not guilty to rape and harassment of the alleged victim, a co-worker and co-national.\nThe man was further charged with the unauthorized possession of cocaine.\nAs the arraignment kicked off, defence counsel Alfred Abela requested the court to appoint a court expert so as to preserve messages exchanged between the alleged victim and the accused via Messenger on a particular date in December.\nDr Abela further requested that the same expert be authorized by the Court to recover footage from CCTV cameras in the vicinity of the place where the alleged facts of the case took place.\nThe prosecution informed the Court that, in fact, a technical expert had already been nominated in the ongoing inquiry and that the mobile phones of both the alleged victim and the accused had been confiscated and handed over to the expert.\nIn the light of these submissions, duty magistrate Doreen Clarke upheld the defence lawyer’s requests, ordering the expert involved to ensure that the relative Messenger chat and footage be duly preserved in the acts of the case.\nA request for the accused’s release from arrest was strongly objected to by the prosecution, pointing out that the allegations were of a very serious and intimate nature.\nMoreover, since the alleged victim and the accused shared the same workplace and also common friends, the link between them was very strong and the possibility of tampering with evidence was a real risk.\nBesides, the victim was still to testify, the prosecution argued.\nOn the other hand, Dr Abela countered that the gravity of the charges was not enough to go against the natural course of bail being granted.\nBesides, the testimony of the alleged victim and a third party had already been preserved under oath, thereby there being no real danger of interference in the course of justice, Dr Abela continued.\n“Here we have a 24-year old foreign national, being charged with a very serious crime but who collaborated fully and indicated in his statement to the police every step of the way,” argued Dr Abela, adding that his client would abide by all conditions imposed by court and would even seek another job, if necessary.\nHowever, after having heard all submissions, the court turned down the request for bail in view of the nature of the offences and the possible interference with the evidence, ordering that the alleged victim and other vulnerable witnesses be brought to testify at the first hearing.\nInspectors Paula Ciantar and Joseph Xerri prosecuted.", "comment_count": 0, "id": 3437}, {"keywords": "", "author": "", "article_body": "A 32-year old man from Dingli was grievously injured in an argument in Attard on Monday morning.Police said they were called to Triq L-Imdina at around 7.45am, where they found the man in his car with injuries to his face.The man appeared to have been involved in an argument with a 51-year old man from Birkirkara, who had left the scene but was later tracked down by police. The victim was taken to Mater Dei Hospital for treatment.  Police investigations are ongoing.", "comment_count": 0, "id": 3438}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The perpetrator of a string of armed hold-ups has been condemned to a three-year jail term and treatment order in the hope that this would not only serve as retribution but would also guide him towards \"a stable life\".\nDavid Scicluna, a 34-year old Marsascala resident, had been arrested last July following a series of armed holdups which had taken place over a span of some six weeks.\nThe suspect had been arraigned and charged with having committed the armed robberies, held his victims against their will, been in possession of a knife without the necessary police licence as well as with being a recidivist.\nThe first hold-up had taken place on June 16 at a mini market chain store at Santa Luċija, followed two days later by another armed robbery at a self-service store at Tarxien. The final coup had taken place on July 27 when another mini market at Tarxien was targeted by the accused, who was arrested and arraigned shortly after.\nThe man had pleaded guilty upon his arraignment and presiding magistrate Gabriella Vella had ordered a pre-sentencing report which was to serve as guidance not only in determining the appropriate punishment, but also to address the many problems faced by the accused.\nMeanwhile, the court had placed the man under a temporary supervision order.\nA psychiatrist and a probation officer, tasked with assessing the accused, reported that the man had an acute drug problem, as well as other personal difficulties.\nWhen handing down judgment, the court observed that the accused had to battle not only a drug problem, which he could not “overcome single-handedly”, but also problems which resulted in an “unruly character” evidenced by the fact that he had committed these crimes “six months after stepping out of prison after serving time for similar wrongdoing”.\nWhen meting out punishment, the court took into account the accused’s early guilty plea, the fact that much of the stolen cash - save for €350 worth of top-up cards - had been retrieved as well as the man’s personal problems.\nThe court observed that since the crimes had involved an element of violence, the law did not permit a mitigation of punishment. Nor could the court order the forfeiture of the weapon used in these robberies, since the said weapon had not been exhibited by the prosecution.\nThe three-year effective jail term, coupled with a treatment order, was intended to serve, not only as retribution, but also to enable the accused to address his many problems in the hope of finally guiding him towards \"a stable life\", the court declared, urging the Director of Prisons to offer all assistance so that the accused might embark upon a rehabilitation programme.\nInspectors Joseph Mercieca and Shawn Pawney prosecuted. Lawyer Arthur Azzopardi was defence counsel.", "comment_count": 0, "id": 3439}, {"keywords": "", "author": "", "article_body": "The Malta Financial Services Authority has developed an online platform for the Trusts Ultimate Beneficial Ownership Register, to facilitate the electronic submission of information on trusts as well as provide online access to entitled parties.\nMalta has implemented a number of regulations on beneficial ownership information as part of a series of efforts aimed at enhancing the financial jurisdiction and strengthen the fight against money laundering and terrorist financing.\nThe regulations set out the parties who have access to beneficial ownership information, the extent of such access, as well as the provision for a register of beneficial owners for trusts and trustees.\nAll licensed trustees who are appointed as such for any trust which generates tax consequences in Malta are required to submit to the MFSA a declaration of beneficial ownership for every such trust. Through this declaration trustees provide details about the trustee, settlor, protector, and all beneficiaries or persons exercising control over a trust.\nAs per the above-mentioned regulations, various national competent authorities such as the FIAU and national tax authorities, the Police, the Asset Recovery Bureau, the Comptroller of Customs and the Sanctions Monitoring Board are entitled to unrestricted access to this register.\nThe MFSA this week organised a number of information sessions to  brief the relevant stakeholders. Over 200 representatives from national competent authorities and trustees, as well as subject persons attended the sessions.\nThese were held as a follow-up to the publishing of FAQs on the MFSA’s website last June, which were intended to assist trustees in completing and submitting the relevant declarations of beneficial ownership.\nIn the coming weeks, the MFSA will also be uploading explanatory videos on its website www.mfsa.com.mt, to further assist relevant parties with the use of the online platform.", "comment_count": 4, "id": 3440}, {"keywords": "", "author": "", "article_body": "An estimated 177,000 tourists visited Malta in November, an increase of 5.9 per cent compared to the same month in 2017.According to National Statistics Office (NSO) figures, around 145,600 trips were holiday visits while around 20,000 came on business.Tourists from EU member states constituted the majority of visitors - around 149,500 trips - and increased by 6.2 per cent compared to the previous year.Most inbound tourists, some 40 per cent, were aged between 25 and 44, followed by those within the 45 to 64 age bracket.Total nights spent went up by 8 per cent when compared to November 2017, surpassing 1.1 million nights, with around 60 per cent spent in collective accommodation establishments.Total tourist expenditure was estimated at €123.5 million, an increase of 2.6 per cent over November 2017.Between January and November 2018, tourist trips rose to nearly 2.5 million - up 14.5 per cent on the previous year - with 17.7 million nights spent in Malta in total.\nTourists spent an estimated €2 billion in Malta in that period, but average expenditure per person dipped slightly to €817.", "comment_count": 2, "id": 3441}, {"keywords": "", "author": "", "article_body": "Malta Freeport Terminals handled a record 3.31 million containers in 2018, the company said in a statement on Monday. \nMore than 2,200 vessels called at the Freeport over the past 12 months, the company said in a statement. This week alone, the Freeport shifted over 8,000 containers on a single ship, with five tall cranes deployed on the 398-metre-long APL Changi, which was built in 2013 by Hyundai Samho Heavy Industries and carries more than 17,000 containers, to enable workers to perform the feat.Malta Freeport Terminals CEO Alex Montebello said: “2018 was another exciting year for Malta Freeport, breaking records once again in terms of throughput despite the fact we are operating at elevated capacity in a difficult and highly competitive environment.\n“This is thanks to the investment we have made and dedication from our committed personnel – without whom the progress we’ve registered would not have been possible – but we are all determined to take the Freeport to the next level and enhance its reputation as one of the region’s go-to transshipment hubs.”", "comment_count": 5, "id": 3442}, {"keywords": "", "author": "Keith Micallef", "article_body": "Members of the Nationalist Party’s youth section are adamantly opposing attempts to endorse a unanimous resolution expressing confidence in embattled leader Adrian Delia, Times of Malta has learnt.\nParty sources who spoke on condition of anonymity, said the issue would be on the agenda of a Moviment Żgħażagħ Partit Nazzjonalista executive committee meeting set for Monday evening.\n“Should a vote be taken on the matter, the outcome would in all probability be similar to what happened last Friday in Sliema, when a motion of confidence in Dr Delia was defeated by the sectional committee,” the sources said.\nDr Delia is facing internal calls to step down in view of allegations of domestic violence and money laundering as well as issues related to his personal finances. However, he remains defiant, saying the claims are false and an attempt to oust him by those who did not accept the democratic will of party members who elected him.\nRead: Delia 'must step down' or be fired after domestic violence claims\nThe sources said relations between the MŻPN and the party administration had lately turned sour.\nThey noted that, a few months ago, they had clashed over the Future Leaders programme. This initiative was meant to attract youths, aged between 14 and 24, to venture into politics.\nTensions with MŻPN\nHowever, some perceived this programme as an attempt to replace or marginalise the youth section as they felt they were being left out of planning events, the sources noted.\nThey added some MŻPN members had become so disenchanted by the fact that every idea they were floating was being shot down by the central party administration that in November they threatened to step down.\nRead: PN MPs left in the dark as Delia fails to reconvene group\nTimes of Malta is informed that tension continued to escalate when party branches were being pressured to follow the footsteps of the majority of sectional committees who expressed unanimous trust in Dr Delia.\nBy the time of writing, only the Moviment Nisa Partit Nazzjonalista, the party’s female section, and Solidarjetà Ħaddiema PN, the workers’ branch, were known to have made such a declaration.\nIn the case of the youth section, however, this could prove a bridge too far, with officials close to Dr Delia warned not to push their luck too much as they could face the risk of embarrassment as happened in Sliema when a confidence motion was defeated by 10 votes to three.\nDr Delia on Sunday downplayed the matter saying over 90 per cent of committees had given them his backing.\nIn the case of Gozo, such declaration was only issued at regional committee level. Furthermore, the sources said the resolution was not unanimously backed.", "comment_count": 47, "id": 3443}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Embattled Nationalist leader Adrian Delia has still not called a meeting of his parliamentary group despite the fact parliament will reconvene on Monday evening after the Christmas recess.\nIn a message to MPs, party whip Robert Cutajar provided details of the evening's agenda and the PN deputies who are expected to intervene during the session.\nHowever, no details have been given as to whether a meeting of the group will be called later on the day, as is usually the case before parliament starts meeting after a long recess.\nRead: Young PN activists unwilling to toe party line\nTimes of Malta last week reported that Dr Delia is avoiding calling on the group amid speculation that following the latest claims about his private and public affairs, most of his deputies have lost trust in his leadership and want him to step down.\nSo far, only a few PN MPs have publicly declared their confidence in Dr Delia’s leadership with the majority of deputies either staying silent or else were conspicuous by their absence during party activities.\nTimes of Malta is informed that the majority of PN MPs have declared privately that they will be ready to sign a declaration expressing their distrust in Dr Delia’s leadership and asking him to make way for a new leader.\nSuch a declaration, if it materialises, will mean that the President of Malta will have to nominate a new leader of the Opposition after consulting the opposition’s parliamentary group. This includes Democratic Party MPs Godfrey and Marlene Farrugia, who so far are the only Opposition MPs so far calling for his immediate resignation.\nRead: Attacks against me are against the PN - Delia\nDr Delia publicly declared that he has no problem with confronting his MPs and claims that he still enjoys confidence of the majority.\nHowever, against normal practice, he has still not set a meeting of his group and is being advised by his closes advisors not to call a secret vote of confidence among the PN’s parliamentary group.\nThe last time the group was reconvened was at the end of last year for the sole purpose of meeting Corinthia Group officials for a presentation about the controversial St George’s Bay peninsula project.\nIn an rare move, Prime Minister Joseph Muscat defended Dr Delia on Sunday, stating his election as PN leader should be respected.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down", "comment_count": 87, "id": 3444}, {"keywords": "", "author": "", "article_body": "Chadwick Lakes is to restored and rehabilitated, with dams fixed, debris removed and an intrusive playground built in the 1990s removed.\nThe rehabilitation project, which was approved by the Planning Authority’s Planning Commission, will see the upper region of the popular recreational spot turned into an education zone and a trekking trail created along the valley bed.\nExisting dams will have their storage capacity reinstated and debris and silt deposits which have accumulated over the years will be removed. Banks and retaining walls will also be rebuilt, the PA said in a statement announcing the project.\nRead: Chadwick Lakes is crying out for a clean up\nThe project will also include the restoration of the existing Fiddien Box, with existing rooms conserved and turned into a visitors' centre, pump room and storage space.\nA decision to restore the ecological zone was made after environmental studies revealed just how poorly the whole region was maintained.\n“A lack of maintenance and proper management over the years has led to a number of problems including a reduced surface water retention capacity due to the accumulation of sediment and debris, a rapid growth of invasive and non-native plant species, the dilapidation of the retention walls and illegal dumping. Moreover, most of the original infrastructure designed by Lord Chadwick in 1884, has been left in a derelict state,” the PA said by way of explanation.\nThis project will be managed by the Energy and Water Agency.", "comment_count": 67, "id": 3445}, {"keywords": "", "author": "", "article_body": "Architect Simone Vella Lenicker has been elected president of the Kamra tal-Periti at the chamber's recent AGM, replacing Alex Torpiano. \nAnnouncing the appointment, the chamber said Ms Vella Lenicker had served in various roles within for the past 15 years, including as vice president, honorary secretary, and editor of the journal The Architect.\nShe has also been a representative on the Building Industry Consultative Council (BICC) Advisory Board, the Planning Authority’s Users’ Committee and the Building Regulation Board.\nShe is the daughter of Planning Board chairman Vince Cassar. \nAndre’ Pizzuto was voted in as vice president for the coming two years, after serving for four years as a council member.\nThe chamber said he had been instrumental in the organisation of the highly successful Emanuele Luigi Galizia Awards, and spearheaded work on a proposal for a revamped Building Regulation system.\nThe full council includes Amber Wismayer (honorary secretary), Alex Torpiano (past president), and Jeanette Muñoz Abela, Anthony Bezzina, Lara Brincat, Gaston Camilleri, Sandro Cini, Ivynne Grixti, Alberto Miceli Farrugia, and Damian Vella Lenicker as council members", "comment_count": 9, "id": 3446}, {"keywords": "", "author": "Sarah Carabott", "article_body": "People found guilty of threatening or injuring educators could face a fine of up to €5,000, according to a revised Education Bill to be presented in Parliament.\nThe Education Ministry is pledging to introduce harsher penalties through a provision in the law that had been withdrawn following the threatened strike action by the teachers’ union last October but which has now been included again in a revised Bill.\nContacted following calls by the Malta Union of Teachers for higher security at schools, a ministry spokeswoman said those convicted of threatening or causing bodily harm to school employees or people involved in the organisation of educational, cultural, social or sports activities would be liable to harsher punishments.\nAn additional fine ranging between €800 and €5,000 could also be handed down apart from other penalties provided by law.\n“The ministry’s interest is to continue improving the educational experience of students and educators and consultation is ongoing with stakeholders. The proposed article [in the law] will also contain specific reference to learning support educators and kindergarten educators, as per MUT feedback,” she noted.The ministry’s interest is to continue improving the educational experience of students and educators\nThe teachers’ union called off a strike last October after a last-ditch conciliation meeting with the Education Ministry.\nThis followed disagreement over a proposal to tie teachers’ warrants to continuous assessment in proposed changes to the Education Act. The meeting between the two sides had also led to agreement on clauses regarding school licences, board structures and security.\nThen, last week, the union reiterated its appeal for security guards to be stationed at all schools after presenting survey results about aggression incidents. Nine out of 10 of the 183 teachers who spoke to the union said they had experienced aggression at their school over the past two years.\nEducation Minister Evarist Bartolo told the Times of Malta that even one case a day was worrying and the authorities would never protect anybody who verbally or physically attacked educators or school staff.\nHowever, he did not believe there should be a security guard at every school, arguing that security needs varied. These included CCTV systems or people who specifically helped out with security issues.\nYet, the Education Ministry spokeswoman told this newspaper security guards would be engaged and security systems would be stepped up in all State schools.\nA sum of €280,000 allocated in the last Budget to cover security at schools demonstrated the government’s commitment and ensured it would never tolerate violence against any educator or school employee, she said.", "comment_count": 13, "id": 3447}, {"keywords": "", "author": "", "article_body": "These are the leading stories featured in Monday's newspapers:The Times of Malta reports that legislators are set to introduce harsher fines for injuring educators, after a union survey among teachers suggested that the majority had been victims of aggression. The Malta Independent reports that if George Vella were to be appointed President of Malta, he would be the first in 25 years to not come from within the ranks of the legal profession. In-Nazzjon leads with PN leader Adrian Delia’s Sunday speech, in which he said that the party’s response to attacks against him would rest with voters. L-Orizzont also leads with politics, quoting Prime Minister Joseph Muscat saying Simon Busuttil’s reaction to an appeals judgement which did not go his way was “surreal”.", "comment_count": 0, "id": 3448}, {"keywords": "", "author": "Ivan Martin", "article_body": "It is not the end of the road for the Panama Papers scandal, with former Opposition leader Simon Busuttil saying that “a number of avenues for justice” remain.  \nThe Criminal Court last week turned down a request for an inquiry into the local implications of the data leak.\nNow a backbencher, Dr Busuttil said that over the past few days, a number of lawyers had contacted him and his legal counsel MP Jason Azzopardi with advice on how to take the case forward.\n“Having examined all the legal avenues available, we have established that there are indeed a number of options,” he said. \nA judgment by Mr Justice Giovanni Grixti last Tuesday found that Dr Busuttil had failed to indicate that any crime had been committed in his request for a probe into the Maltese protagonists of the leak, who include Cabinet Minister Konrad Mizzi and OPM chief of staff Keith Schembri. \nThat case dates back to July 2017, when Dr Busuttil had asked for a magisterial inquiry to be opened into the allegation of money laundering and graft.\nAt the time, Magistrate Ian Farrugia had found that there was enough reason to justify an inquiry, but appeals had been immediately filed against that decision by Prime Minister Joseph Muscat, Dr Mizzi, Mr Schembri, Nexia BT’s Brian Tonna and Karl Cini, and businessmen Malcolm Scerri and Adrian Hillman.\nMr Justice Grixti last week found that Dr Busuttil had given a number of facts which in themselves did not indicate any wrongdoing and overruled Dr Farrugia’s decision.\nDr Busuttil told The Sunday Times of Malta that a number of people, including a civil society organisation, had approached him offering to file a new request for the opening of an inquiry afresh into the Panama Papers. It was not clear whether this new request would be filed in court by him or a group of people including the civil society organisation.\n“We owe it to all those people who trusted us to represent them. We hope that our action will send out the message that someone is actually prepared to give people a voice and to fight for what is right,” he said.\nDr Azzopardi said the possibility of filing a new request from scratch was a valid option because Judge Grixti’s decision did not amount to an acquittal of the suspected persons.\n“It merely amounts to a refusal on his part to start an investigation. This does not prevent any other member of the judiciary concluding that there are indeed grounds to open an inquiry,” he said.\nAnd Dr Busuttil said that if that road proved to be a dead end, there was another route being considered.\nThe case could be taken to the Court of Justice of the European Union and he would not rule out the possibility of asking the European Commission to investigate the state of rule of law in Malta. The European Commission has already taken action against Poland and Hungary.\nHowever, before looking beyond Malta’s shores, Dr Busuttil said he would this week be filing a request to reopen the 17 Black inquiry which he and MEP David Casa had requested last year after the Daphne Project had first reported on the matter.\nBack then, Magistrate Francesco Depasquale had closed the case on the understanding that the 17 Black revelations would be incorporated in a Panama Papers inquiry.\nNow that the Panama Papers case had been rejected without an inquiry, Dr Busuttil said Magistrate Depasquale would be called on to declare whether the basis for closing his file now needed to be reviewed.", "comment_count": 214, "id": 3449}, {"keywords": "", "author": "", "article_body": "A woman riding pillion on the back of a motorcycle was taken to hospital after being injured in a fall in San Ġwann on Sunday.\nThe woman, who is 51 and lives in Msida, was on the back of a Honda bike on Triq Birkirkara when the man driving it, who is also 51 and lives in Mosta, lost control of it and fell at around 12.30pm.\nWhile he escaped unhurt, the woman passenger was less fortunate and had to be taken to Mater Dei Hospital by ambulance.\nAn investigation into the incident is ongoing.\nIt was the second such incident in a day. Earlier on Sunday morning, a motorcyclist was hospitalised after injuring himself when he fell off his motorbike in Marsa.", "comment_count": 0, "id": 3450}, {"keywords": "", "author": "Ramona Depares", "article_body": "A successful facade can hide a history of childhood violence that reaches far into adulthood. A young musician who was on the brink of killing himself shares his story with Ramona Depares in the hope that it may help give others a voice.\nAdults who were subjected to violence and trauma during their childhood need to have their voices heard and a support structure put in place for them.\nThat’s the heartfelt appeal of a young musician, well-known in local music circles, who decided to share his experience anonymously after failing to find easily accessible professional support for situations like his.\n“I had to research my symptoms online and then narrow my condition down to a few options, and only then did I start looking for a therapist who was qualified enough to try and help me,” he says.\nThe musician adds that, regardless of how successful someone’s life may appear to the outside world, this does not mean that the childhood trauma is over and done with.\n“I reached my lowest point last March, when I decided to kill myself. I thought for ages how to do it but finally settled on hanging myself, because in my mind that is what rock stars do, nowadays, or so it seems,” he says self-deprecatingly.\nChillingly, he had it all planned down to the last detail.\nI drank a bottle of vodka for courage and tied a hangman’s noose\n“I made a will and wrote a letter to my mother begging her to forgive me, as this was not her fault. I didn’t tell anyone what I was about to do. There was no final song, and no last goodbye on Facebook. I drank a bottle of vodka for courage and tied a hangman’s noose,” he says candidly.\nBut at the end of the day, he found that he couldn’t do it.\n“Maybe I’m a coward. No divine light appeared, no mysterious voices told me not to do it. I worried about who would take care of my cats. I worried about my mother; she wouldn’t understand. Nobody would. I’m atheist, but I asked God to help me. Surprise, surprise, there was no answer. I realised that I will always be alone in my struggle, but I decided to go on.”\nAnd yet, to anyone looking on from the outside, it would appear as if the young man was living the perfect life. He describes having a job that pays well and getting along well with his colleagues. He owns his own apartment, where he lives with his two cats, whom he “adores”.\nAs musician, he has also met with success on the local front, having been active on the scene for over 20 years.\n“I have written songs that did very well, and I play gigs regularly. I also enjoy reading, cooking and I love movies,” he tells me.\nWhich makes his next statement – “Last March I nearly committed suicide” – even more unlikely.\nAnd yet, this was but the culmination of long-term childhood trauma that was left untreated. The abuse started when he was young as four; he describes his father as an army veteran who was “forced to leave the corps for a better pay” upon his son’s birth.\n“He never forgave me for this. He physically and psychologically abused me for 14 years, until my mother finally left him for cheating on her.”\nBy the age of five, he knew all the most obscene insults possible, because he would get them regularly screamed at him – something that he says affected him in the long term even more than the beatings.\n“After a while, you get used to the beatings. But your own father telling you that he hates you remains etched in your skin forever. I never hated him back, I just didn’t understand why he was like this. I wish I could blame alcohol, but he rarely drank. Some people are just born evil…I get it now.”\n It was only years later that the young man decided to speak to a girlfriend about his experiences.\n“She asked me something I had never thought about before. Where was my mother while I was being abused? The truth is I don’t know, and I’ll never ask her. I’m not very close to her, but she’s been through a lot herself and I don’t want to upset her and fill her with guilt. I love her, but in my heart, I feel resentment towards her for leaving me alone,” he confides.\nAnd, though to a certain extent he managed to move on and build a life and career for himself once his father moved out, what he describes as “the emptiness” never left him.\n“It was only a matter of time until I broke, till I succumbed to the pressure that had been building up since my childhood. I started smoking at 32. I practically became an alcoholic, drinking two bottles of wine every night just so that I could sleep through the nightmares. By my mid-30s I was taking a cocktail of anti-depressants, anti-anxiety pills and cocaine,” he says bluntly.\nI want people who are going through the same thing to know they are not alone in the world\nThe consequences affected his relationships and his work. He describes how after being let down and abandoned by most people, he finds it almost impossible to trust someone.\nWatch: 'I am not a mental illness'\n“I’ve become quite reclusive, and sometimes bitter. I’ve been single for a long time now and don’t see that changing anytime soon. I can’t believe anyone would really want to be with me, if they knew how broken I really am. Somehow, I managed to hide my feelings from everyone, but my work suffered. I was fired from three jobs and I was always depressed.”\nThe turning point came last March, when the young musician managed to pull himself from the brink of suicide. He describes the fear he felt at hitting rock bottom, wondering what would come after death and whether he would be remembered as a failure by the people he leaves behind.\n“I wish I had a happy ending to share with you, apart from the fact that I’m still breathing I suppose. I can’t explain it, but I’m not ready to go, not yet. I quit the cocaine and alcohol nine months ago and started going for therapy. I am not cured of my depression. I can control the anxiety with pills, but depression and PTSD have no cure, they’re part of me now. The trick is learning to live with it.”\nPart of the healing process has involved opening up to a few people close to him, although reactions have not always been what he hoped for.\n“People don’t understand. I wanted to share my story with readers because I want people who are going through the same thing to know they are not alone in the world. If I can quit an addiction and try to rebuild my life, then so can others. If I can do it, so can you. Please seek help. It sounds like a cliché, but talking to a professional or to a good friend does help,” he insists.\nThe young musician closes our interview with a plea: every day, he tells me, he teaches himself to be compassionate and to recognise people who are going through a hard time.\n“If you do meet someone like that, just listen to them. Don’t talk, listen. That’s what we need, to be heard.”\n‘Seek therapy to work through the pain’\nWhen children experience violence from the people who are supposed to take care of them and love them the most, the impact on the child is huge – mentally, physically and emotionally.\nTherapist Danjela Falzon explains that childhood abuse coming back to haunt adults on an emotional level is a reality.\n“A child’s first experience of the world usually comes from their family environment. Moreover, in homes where violence is used, there tend to be other forms of abuse also taking place, such as emotional abuse or neglect.\n“Children who are not given the love, safety and care needed come to believe that they’re not loveable, that they are unworthy and that their needs will not be met. If not addressed, this extends into adulthood,” she says.\nThe repercussions of such a situation can be quite wide-ranging.\n“When children experience and witness violence, some learn that this is the only way to deal with conflict, causing them to use violence in their own relationships as adults. Some adult survivors, on the other hand, move towards relationships where once again they’re re-traumatised, seeking out people who are violent or abusive towards them.”\nShe explains that a great deal of research has been carried out on the long-term effects of violence, and it has been shown that adults with a history of child abuse are more likely than the general population to experience physical health problems. \n“Mental health problems associated with past histories of child abuse include personality disorders, post-traumatic stress disorder, dissociative disorders, depression, anxiety disorders and addiction,” she continues.\nHer advice to those who have experienced violence and abuse in childhood is to seek psychotherapy or counselling, in order to have a space to discuss what’s happening in their lives in the present day, in terms of issues they may be having in relationships, at work and so forth.\n“Although it may be a painful process, counselling allows them to express their sadness, pain and anger at what happened to them as children in the supportive, accepting environment of the therapy room.  In therapy, people can express emotions they’ve never felt able to express, and work through the emotions related to their traumatic experiences.\n“Slowly, they can learn to move through their pain and hurt and begin to develop more healthy coping mechanisms, have healthier relationships, and build the self-esteem and self-love that was damaged by their earlier experiences.”", "comment_count": 20, "id": 3451}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government has granted unlimited rights to the Corinthia Group to reclaim the seabed around the peninsula it occupies at St George’s Bay and build on it.\nAccording to a still unpublished draft deed, negotiated by Tourism Minister Konrad Mizzi, the Corinthia Group has been awarded the whole of the St George’s Bay peninsula for at least 99 years at a fraction of current market prices, to use not just for hotels but also for speculation.\nNow, The Sunday Times of Malta can also reveal that the government has conceded to let the group reclaim the seabed surrounding the whole peninsula.\nAccording to the draft deed, which has still to be approved by Parliament and signed, the Corinthia Group can then use the newly claimed land to build apartments, offices and retail space for purely commercial purposes.\nThe draft contract does not impose any sort of limitation to how much of the seabed the hotel group will be allowed to reclaim. This is solely up to the Corinthia, subject to planning permits and relevant laws.\nThe government is obliged by law to seek Parliament’s approval for every transfer of public land to third parties. In the case of the St George’s Bay seabed, however, it is renouncing to this obligation – the deed specifies that Corinthia “shall require no further consent from the government as the direct owner” of the seabed.\nThe only condition imposed by the government is a clause normal to every land transfer contract: that nothing can be done without a permit issued by the Planning Authority.\nThe Corinthia has so far not indicated publicly that it plans to reclaim the seabed surrounding ‘its’ peninsula. It has only said it plans to develop the area in phases. The first phase will take more than five years, including the redevelopment of the Corinthia St George’s Bay hotel and the building of 18,000 square metres of sea-view apartments for sale.\nEnvironmental studies would have to be conducted before any land is reclaimed.\nA technical expert familiar with such negotiations, who spoke on condition of anonymity, questioned the open-ended concession granted, with such few limits being imposed and the right to further consent being waived by the government.\nThe agreement had been proposed for Parliament’s approval just a day before the Christmas recess but the government was forced by the Opposition to delay the discussion.\nThe Corinthia Group can use the newly claimed land to build apartments, offices and retail space for commercial purposes\nThe terms granted to the Corinthia Group have prompted harsh criticism from developers and real estate agents, who view them as too advantageous.\nThe Corinthia Group had acquired the 70,000 square metres of Malta’s golden mile back in the 1990s, paying low ground rent on condition that the area is used exclusively for tourism purposes.\nRead: Undervalued deal could trigger industry collapse, agents say\nThe new deal means it has convinced the government to let it build a total of 100,000 square metres of residential apartments and offices for sale.\nIt will also be refurbishing the Corinthia St George’s Bay into a ‘luxury’ hotel and turning the Marina Hotel into a five-star property.\nHowever, in what has been described by real estate agents as “ridiculous terms and conditions”, the government agreed that the group pay a premium of only €17 million for the new rights it is acquiring. Furthermore, this amount will be paid over many years, possibly decades.\nAccording to real estate agents, the concession would currently fetch a market price of at least €700 million without any land reclamation rights.\nOther organisations representing the business community, such the Chamber of Commerce, Malta Hotels and Restaurants Associations and the GRTU, have not publicly made their position clear although The Sunday Times of Malta is informed that some members have expressed their concerns internally. \nDr Mizzi told Parliament that the government had conducted negotiations with the Corinthia along the same parameters that applied to another controversial deal, that with the Seabank db Group for what is known as the ITS site, situated adjacent to the Corinthia’s properties.\nThe ITS deal is now under the scrutiny of the National Audit Office.\nThe Opposition parties in Parliament, the PN and the PD, have declared their opposition to the Corinthia agreement.\nIt is not yet known when the government intends to seek Parliament’s approval as no date has been set by the Leader of the House, Deputy Prime Minister Chris Fearne.\nThe Corinthia hotels at St George’s Bay, St Julian’s. Photo: Chris Sant Fournier\nProposed rights on seabed in deed:\n“FSHL shall be entitled, by virtue of this deed, to effect such land reclamation and, subject to applicable law and the issuance of any other permits that may be required at law for such purpose, shall require no further consent from the government as the direct owner under the Fourth part of this deed.”\n“Any land so reclaimed shall be deemed to form part of the Development Site and shall be subject to the provisions of this deed to their fullest extent.”\n“For the purpose of this article, land reclamation shall consist of any act or process that creates land from the sea areas forming part of, adjacent to or bordering the Development Site such that those areas become land areas.”\n“Such entitlement hereby granted by the government shall only be exercisable by FSHL to the extent that may be approved by the Planning Authority and in accordance with applicable law and any permit that may be issued by the Planning Authority.”\n(FSHL – Five Star Hotel Limited – A Corinthia Group company)\nXgħajra residents signing petition against land reclamation\nMore than a thousand residents from Xgħajra and nearby towns and villages in the south have signed an online petition against any plans to declare the area suitable for land reclamation.\nA spokesman for a new pressure group called ‘Xghajra Sea Front Interest Group’ told this newspaper that since the start of the online petition, many people had started taking an interest in the issue.\nThey were asking questions about the government’s plans suggesting that the Xgħajra coast could be the only area in the Malta where large scale reclamation projects can take place. Last month, this newspaper quoted sources at the Environment and Resources Authority (ERA) stating that it had singled out the coast of Xgħajra as the only viable location for a ‘major’ land reclamation project.\nThe petition calls on the authorities to leave the area alone as residents don’t want the destruction of the pristine coast which beautifies the area.\nThe petition can be found online at: www.facebook.com/groups/513888228658732/\nivan.camilleri@timesofmalta.com", "comment_count": 87, "id": 3452}, {"keywords": "", "author": "", "article_body": "A five-year-old boy was seriously hurt when he bumped into a moving car while crossing the road in Mosta, the police said on Sunday evening.\nThe child was crossing the road in Triq Nicolo’ Isourd when he hit into the side of a Honda Civic being driven by a 60-year-old Mosta woman.\nPolice received word of the incident at 1.45pm, they said. The child was first taken to Mosta Health Centre and subsequently transferred to Mater Dei Hospital.\nThe police said their investigations into the case are ongoing.", "comment_count": 0, "id": 3453}, {"keywords": "", "author": "", "article_body": "The law sets the bar too high for an inquiry into suspected money laundering to take place, raising serious rule-of-law issues, the Dean of the Faculty of Laws believes, calling for a re-assessment of the relevant legal provision.\n“The judgment makes good law; it is the law itself which makes bad law,” Kevin Aquilina said, referring to Mr Justice Giovanni Grixti’s judgment on Tuesday rejecting a request by former Opposition leader Simon Busuttil for a magisterial inquiry into the Panama Papers revelations.\n“Essentially the implication of this is that it serves as a disincentive for public spirited persons and honest whistleblowers to lodge complaints of such a nature in the future,” Prof. Aquilina said in answer to questions from this newspaper.\nUnder the law as amended in 2006, anyone, and not just the police or Attorney General, can request a magisterial investigation, known as an ‘in genere’ inquiry.\nIn his decision, Mr Justice Grixti said that the former Opposition leader had supplied a number of facts which in themselves did not indicate any wrongdoing. Prof. Aquilina said the argument could be made that the judge “expected a more onerous level of proof from Dr Busuttil than that expected from the Commissioner of Police or the Attorney General”.\n“Of course, the police and the AG have resources at their disposal which an MP surely does not enjoy. However, the judge is bound by law and if the law places a more onerous burden on the public than it does on the police or the AG, it is not up to the judge to change the law but to implement it, more so when the law is clear.”\nAsked whether the judge was right to doubt the legality of the Panama Papers leak, he said that according to the Criminal Code, the offence needed to be identified by the complainant and unless this information is provided the inquiring magistrate cannot carry out “a fishing expedition” to see whether someone has committed the offence.\nIt is better to have no remedy at law than a travesty of justice!\n“While reference to the Panama Papers is material to such an inquiry, the evidence which has to be produced is the best evidence rather than documents which are unauthenticated as they derived from leaks from Mossack Fonseca servers.\n“I do understand that the consequences of this – willed by the law – is that it places the complainant in a Catch-22 situation, more so if the complainant is not a whistleblower privy to the necessary documentation to make his/her case,” Prof. Aquilina said.\nIn an article on his blog last week called ‘Judge Grixti’s Catch-22’, lawyer Jacques Rene Zammit wrote: “You need an in genere inquiry to investigate, find and confirm the existence of proof that may be used for a future prosecution of a crime. In order to get an in genere inquiry going you need to provide the type of proof that would normally be found and obtained by the in genere inquiry itself. See? Grixti’s very own Catch-22.”\nProf. Aquilina said he had “no difficulty” with the judgment from a legal perspective, saying however that the “politics of the decree” worried him. \n“No person has the requite tools at their disposal to identify the applicable provisions of criminal law and to find the evidence to support such a charge. Essentially, the provision works out to be impracticable to implement. However, I place the blame for this on the legislator not on the judiciary.”\nThe decree as such complies with the rule of law, he said. “It is the legal provision which raises serious rule of law issues.\n“This is because while the provision was notionally intended to place checks and balances upon the police and AG should these two public officers be perceived not to be carrying out their lawful duties or to abuse them, such checks and balances work out to be ineffective. It is better to have no remedy at law than a travesty of justice!\n“The course of justice is therefore perverted when the law allows a remedy to the citizen which, as a matter of fact, is no remedy at all.\n“Hence the provision needs to be re-assessed in the light of the Criminal Court’s decree.”", "comment_count": 57, "id": 3454}, {"keywords": "", "author": "Claire Caruana", "article_body": "The son of slain journalist Daphne Caruana Galizia, Matthew, has taken to social media to appeal for information on the account held by the once-secret Dubai company 17 Black.\nIn posts on his profiles on various social media platforms, including Facebook, Twitter and LinkedIn, Mr Caruana Galizia said that he was now in possession of the account numbers and required the assistance of anyone with information to trace payments. \nHe appealed for assistance tracking payments to and from what he alleged was “a slush fund for corruption operated by Electrogas owners. Now we have the account numbers. You can help us starting by sharing this.\n“These are the details of the account in Dubai used for multi-million dollar bribe payments,” Mr Caruana Galizia claimed in a Facebook post. “Show us what you can do.” He shared a similar post on his LinkedIn profile, in which he addressed “financial professionals, lawyers, compliance staff, prosecutors and law enforcement officers”. In this post, he goes on to refer to the slush fund as that which “[his] mother Daphne was investigating when she was assassinated with a car bomb”.\n\nAccording to him, the account holder is either Wings Development Ltd or 17 Black Ltd and is registered in the Ajman Free Zone, a free trade zone in Ajman, the United Arab Emirates, at the Noor Bank. Mr Caruana Galizia also included the name of the beneficial owner, power station investor Yorgen Fenech, as well as a number of the account’s IBANs for various currencies.\nLast year, in a joint investigation with Reuters, the Times of Malta identified Mr Fenech, Electrogas power station investor and businessman, as the owner of the mystery Dubai company. 17 Black was named in leaked e-mails as one of two companies that would pay $2 million to the Prime Minister’s chief of staff Keith Schembri’s and Tourism Minister Konrad Mizzi’s Panama companies. While Mr Schembri has said he was unaware of who owns the Dubai company, the Tourism Minister has insisted he has no connection to 17 Black.\nMr Fenech denies any wrongdoing and links to Panama companies. ", "comment_count": 119, "id": 3455}, {"keywords": "", "author": "", "article_body": "A 29-year-old Rabat man was seriously hurt on Sunday morning when he skidded and fell off his Kawasaki motorbike in Marsa. The incident on Triq Giuseppe Garibaldi was reported to the police at around 11.10am.Police officers and paramedics were called to the scene. He was taken to Mater Dei Hospital by ambulance. The police said they are investigating further.", "comment_count": 0, "id": 3456}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Former Enemalta chairman Alex Tranter has been cleared of misappropriating corporation funds during his tenure of office between 2005 and 2010.\nMr Tranter, 55, of Swieqi, had been targeted by criminal investigations back in May 2014 when the corporation’s Internal Audit Department had flagged alleged misuse of public funds and excessive spending when he acting as chairman.\nAfter being twice interrogated, Mr Tranter was ultimately charged in October 2014, pleading “definitely not guilty” to misappropriation and misuse of the energy corporation’s credit card for personal expenses.\nThe prosecution based its allegations upon five particular episodes, the first relating to a £200 cash withdrawal from an ATM at Gatwick Airport in August 2008.\nThe court, presided over by magistrate Audrey Demicoli, observed that the allegation had stemmed from the fact that Mr Tranter had not been named on the corporation’s official travel list at the time, thus leading to the inference that the withdrawal had been effected for personal use.\nYet, as rightly pointed out by defence counsel Joe Giglio, no copy of such official list had been produced in court.\nNo evidence as to who had actually committed the contraventions\nThe second episode had concerned the €3,644 refund of two flight tickets to Miami for the Fuel Summit Conference, cancelled on behalf of the chief financial officer and allegedly directed to Mr Tranter’s personal account.\nHowever, “after an accurate and meticulous examination” of the documentation brought in evidence, the court concluded that the refund could not have related to the Miami flights but possibly to some other business trip personally cancelled by Mr Tranter himself.\nAs for the third episode regarding the payment for two nights’ accommodation at the London Hilton for the chairman’s personal assistant, the court concluded that this expense had been legitimate since the assistant had been asked to perform corporation work relative to the London International Petroleum Week.\nAnother instance of alleged misappropriation concerned a Sony Vario Laptop, purchased from the US by Mr Tranter for Lm1035 and retained after his termination of tenure.\nHowever, the court once again observed that not only had the device not been listed on the corporation’s Fixed Assets Register but Enemalta’s CFO had testified about a corporation policy allowing both the chairman and CEO to retain their laptops beyond their tenure of office.\nAs for the allegation that Mr Tranter had paid traffic fines out of public funds, the court observed that the prosecution had put forward no evidence as to who had actually committed the contraventions while at the wheel of corporation-registered vehicles, which were regularly driven not only by Mr Tranter but also by senior managers and as well as a chauffeur.\nUpon the basis of all evidence put forward, the court declared that the prosecution had not proved any of the accusations, thereby clearing Mr Tranter of all alleged wrongdoing.", "comment_count": 0, "id": 3457}, {"keywords": "", "author": "Ivan Martin", "article_body": "Cut-throat competition from imported meat may force Malta’s pork industry into collapse, farmers have warned as they also grapple with a new threat: food fraud.\nOliver Frendo, a veterinarian, has long been campaigning on behalf of Maltese pig farmers and on Saturday told The Sunday Times of Malta how the once strong industry was today on its last legs. \n“Consumers might not realise it, but whereas up until a few years ago almost all the pork sold on the island was locally grown, today that share has dropped to around 30 per cent. It’s getting to the point where many farmers are just giving up,” he said. \nThe problem they face is pretty straightforward: foreign pork is far cheaper to produce than it is on Malta because farmers here have to shell out a bomb to import the cereal feeds that fattens pigs before slaughter.\nMaltese farm operations are also tiny compared to the mammoth factory-scale farms on the mainland, meaning the cost per pig here is much higher than it is for Dutch farmers to rear a sow.  \nMeanwhile, many local sellers are opting for the cheaper foreign produce as profit margins on these products are higher.\nLocal supermarket fridges and butcher displays are being stuffed with foreign roasts, chops and sausages, but sold to consumers at the same price as Maltese pork.\n“So you see the cheaper imports aren’t translating into savings for the consumer, if anything consumers are opting for more expensive products such as pre-packaged, marinated or pre-cooked products,” Dr Frendo said. To make matters worse for local farmers, a minority of unscrupulous sellers have started flogging foreign meat as local to cash in on buyers’ preference for Maltese products.\nLifelong farmer Mario Abela yesterday walked around his Żebbug farm, distraught.\n“It’s basically over for the sector. I don’t know how we are going to keep going on like this,” he said. \nThe president of the pig farmer’s cooperative, Mr Abela said the situation was so bad that other farmers were turning to the cooperative for bridge loans just to be able to cover operating costs. \n“I don’t know what’s left for us. It is too hard to keep fighting on when the situation keeps getting worse and worse and no one seems to care about Maltese pig farmers,” he said.\nLosing the market\nPrior to joining the EU, practically all the pork sold on the island was local – in fact, you would have been hard pressed, Dr Frendo says, to find foreign pork in Malta at all.\nWhile pig farmers in Malta used to sell around 2,300 pigs every week in 2004 – making up more than 90 per cent of the market share – last year they sold fewer than 1,000 carcasses weekly, despite increased consumption on the island. The result? A dwindling market share of less than 30 per cent for Maltese producers, with a number of pig farms closing down in recent years.\nIt’s basically over for the sector. I don’t know how we are going to keep going on like this\nBack in 2016 farmers issued a statement pleading with consumers to buy local.\nEuropean pork prices dropped suddenly that year and have remained low ever since, leading to a flooding of imported foreign pork on the island.\n“At this point, any further reduction in sales for farmers may cause the entire sector to become non-viable, risking the livelihoods of hundreds of local families,” the farmers had said.\nFood fraud\nThe local cooperative of farmers had tried to protect and promote their locally grown produce when they came out with a labelling system to help consumers make informed choices.\nPork with the ‘Majjal ta’ Malta’ label was meant to be local, ethical and sustainable produce, or so consumers thought.\nDr Frendo said the cooperative had released thousands of labels and stickers to distributors and sellers, however they had serious concerns that their inability to audit the system left it open to abuse and fraud. \nFarmers also complained of a situation where foreign-imported, mass-produced pork was being falsely labelled and sold as Maltese local produce. However it was unclear how widespread this practice was.\nDr Frendo said the matter had been raised with the authorities but little or no action had been taken.\nMeanwhile, a new problem facing the sector was that of some sellers importing live pigs, only to slaughter them the next day and claim they were Maltese produce.\nWhy eat local?\nThe argument for locally grown pork is the same you’d hear any ‘eat local’ lobby say: food grown in smaller batches is more ethically produced and helps support local communities.\nDr Frendo said that Maltese family-run pork farms had relatively small numbers of swine compared to the factory-farms on mainland Europe.\nBut supporting the Maltese pork industry would also indirectly support other farmers too.\nDr Frendo said the cereal feeds imported to grow Maltese pigs were the same used to feed dairy cows and poultry.\nIf pig farmers decided to call it quits, other farms would have to bear the cost of importing feed, raising production costs. Pig farmers, he said, would just be the first domino to fall.\nLocal producers, Dr Frendo said, depended on consumers for their survival. \nA last ditch solution\nThere is still hope for the sector. Dr Frendo said the pig farmers’ cooperative planned to try what dairy farmers had done to protect their trade. \n“Just as the Maltese dairy farmers market their product under the Benna brand to maintain reasonable control of their supply chain, we want to market more of the Maltese pig farmers’ products in a way that we can guarantee that the product really is local,” he said. \nWhile there were also other things like EU funds and government intervention that could help save the industry, farmers were hoping a recognisable local brand would help keep them afloat.", "comment_count": 40, "id": 3458}, {"keywords": "", "author": "Anthony Manduca", "article_body": "A “rule-of-law control system” must be introduced in the Constitution, the Democratic Party has proposed.\n“Such a system would constrain abuses of power, ensure equal treatment of citizens and ensure public interest,” the party says in one of its 12 key proposals for constitutional reform.\nPresenting the PD’s proposals to President Marie-Louise Coleiro Preca last week, party leader Godfrey Farrugia said that the drafting of the new Constitution should be left to experts in the field, both local and foreign.\nThe PD’s other proposals are:\nParliament’s ability to override the Constitution must end. The power of the Constitutional Court to annul unconstitutional laws must be installed;\nThe independence of the judiciary needs to be strengthened. International best practices must be in place to eliminate structural weaknesses and conflict of interests;\nThe media (fourth estate) must be pluralistic and completely free of political parties. The true independence of the Broadcasting Authority and the Freedom of Information need redress. A media Ombudsman needs to be set up;\nAn independent anti-corruption body must be set up. This would also be able to investigate criminality within the police force or the AG’s office itself;\nAn independent anti-corruption body must be set up\nAll Constitutional bodies (such as the Broadcasting Authority, Commission Against Corruption, Employment Commission, Public Service Commission) must be above politics and truly independent. They lack safeguards with regard to their personal, functional, institutional, financial and legal independence. These bodies are also subject to highly insufficient public accountability provisions (which are necessary for bodies that are independent, and hence removed from direct democratic control). Moreover, they should not be led by boards whose majority is appointed by the Prime Minister as this eliminates the necessary checks and balances;\nThere is a need for an independent non-politically appointed civil service and police force. There should be political direction but not complete takeover;\nThe Attorney General’s roles as a prosecutor and legal adviser to the government must end with the creation of a Prosecutor’s Office;\nParliament’s role must be strengthened both in the House as a multi-party system and also by extending proportional representation in a general election. Members should also have a full-time status;\nA healthy environment is a basic right for each citizen. The executive will be held responsible to safeguard, improve and sustain the environment for present and future generations. The natural environment is to be granted the status of a citizen;\nThe President of Malta should be appointed by a two-thirds parliamentary majority. The role of the President should be to check on (not exercise) executive power. This should be limited to one estate: the executive. The President should have an Advisory Council to State. The Office of the President must prepare an annual public report on the quality of democracy in the country and make recommendations;\nIn the interest of uniting the country one needs to bear in mind that there are a lot of systemic issues which need addressing such as the Whistleblower Act, the Financing of Political Parties Act, the Ombudsman Act and the Auditor General Act.\nRead: Better checks and balances needed to ensure rule of law - Venice Commission\nThe PD said that the Steering Committee for Constitutional Reform must not be one that is seen as a ‘backroom deal’ behind everybody’s back and it was important not to leave out the media, judges, lawyers, the Chamber of Advocates, NGOs, pressure groups, trade unions and citizens from this whole process of reform.\nIt said it did not agree with the government’s decision to ask the Steering Committee – “a committee of political representatives with no clear terms of reference and with no basis at law” – to debate the report in secret.\nThe Steering Committee, it said, was simply “a gathering of representatives of the Labour Party and the Nationalist Party”, adding that it was “not a committee with broad enough representation to ensure comprehensive debate”.  ", "comment_count": 7, "id": 3459}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 2.15pm with PN statement\nPrime Minister Joseph Muscat hit out at “extremes” on both sides of the migration issue, insisting again that Malta could not be expected to come up with a solution alone.Speaking at a political activity in Żabbar, Dr Muscat said Malta could neither listen to those calling for migrants to be left to drown at sea, nor to those who said anyone arriving by boat should be accepted into the country.“We have to be humanitarian and give help when it’s needed, but this is also a question of security; we cannot allow a free-for-all,” he said.“Writing from behind a keyboard in the comfort of your home is easy, but I believe many of these people have no idea what they are saying. If the same people walked outside and saw an injured cat, they would try to help.”The Prime Minister was speaking at the end of a week in which 49 migrants were brought into Malta, at the end of a 22-day ordeal which saw them stranded at sea on board rescue vessels as EU countries debated who should take them in.Dr Muscat, however, insisted that the migrants could have been taken back to Libya or onwards to Tunisia or Italy, the latter of which had refused entry, and that the problem “had nothing to do with Malta”.“We were clear with our European colleagues that we didn’t create the problem and the solution could not be solely ours,” he said, noting that the AFM had just days earlier rescued 250 other migrants in imminent danger.“My argument was that when Italy closed its ports, Europe stepped in to help, so we could not have a situation where Malta is shown no solidarity because we are following the rules.”Dr Muscat said Europe had to show moral leadership and could not close its eyes to a humanitarian situation, but could not allow any and all to enter without consequence.He insisted the current situation was untenable and that a “sensible” EU-wide position was urgently needed.\n‘PN only respects democracy when convenient’\nTurning his focus to the turmoil within the PN, Dr Muscat said: “The people elected a leader and it is clear that the powers that be in the party do not respect that decision. This betrays a mind-set where democracy is only relevant if you like what the people have decided.”He said the situation was evidence that the Labour Party was the only one capable of leading the country.“If the PN were in power right now, the economy and the entire country would have come to a standstill. If they are not capable of running an Opposition, how can they be expected to run a country?”\nGive institutions the space they need - PN\nIn a statement reacting to Dr Muscat's speech, the Nationalist Party dismissed his talk of aspiring to make Malta one of the world's top 10 democracies. \n\"If he really wants that, he should ensure institutions are no longer controlled by his government. He should see to it that the Attorney General and police commissioner are not there to obey orders they receive,\" the PN said. \nThe party also reiterated its calls to receive a copy of the Egrant inquiry.", "comment_count": 62, "id": 3460}, {"keywords": "", "author": "", "article_body": "A 24-year-old man was on Sunday sentenced to an 18-month jail term, suspended for three years, for stealing a laptop from a St Paul’s Bay hotel.\nMacedonian Hristijan Slavev admitted to the charges.\nInspector Spiridione Zammit said the man had not cooperated with the police and was in Malta illegally.\nMagistrate Neville Camilleri presided. ‘", "comment_count": 0, "id": 3461}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nationalist Party leader Adrian Delia on Sunday insisted that the “attacks” being levelled against him were in reaction to the party “getting stronger” and an attempt to deflect attention from the Corinthia deal.\n“You can attack the PN, besiege it, but you will never destroy it, neither from the outside nor from the inside, as the party is not myself but you [the people],” he said.\nDr Delia was addressing a political activity at the PN’s club in Senglea in which he referred to calls for him to resign, amid allegations of domestic violence, money laundering and issues on his personal finances. Dr Delia is denying any wrongdoing.\nRead: PN 'cannot turn a blind eye' to Delia allegations - Briguglio\nThe PN leader downplayed Friday’s no confidence vote by the PN sectional committee of Sliema, saying he still enjoyed the trust of more than 90% of committees and the backing of over 700 committee members. Dr Delia refuted claims that these committees were being pressured to pledge their loyalty, saying it was their own “spontaneous initiative”.\n“It seem that the only topic of the festive season was Adrian Delia,” he remarked. According to the PN leader, this was part of a plan to deflect attention from the Corinthia deal, which will result in 30,000 square metres of public land being sold to a private investor for real estate purposes.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down\nTaking a dig at his critics who accuse him of not wanting to confront the parliamentary group for fear of being voted out, Dr Delia said that on December 27, he did summon MPs for a presentation by the investors on this agreement.“Our parliamentary group was being convened and doing its work contrary to that is being reported,” the PN leader said.\nHe accused the government of keeping under wraps the intention to convert the temporary emphyteusis of this land into a permanent sale for a “pittance”. Dr Delia said that the land in question is estimated to have a value of €800 million.\n“Yet Konrad [Mizzi] only got €51 million. Either he is not a good negotiator or he is robbing the people, justice and the environment,” he said.\n“It could also be that the deal had been agreed already. Who is above Konrad Mizzi if not Prime Minister Joseph Muscat who years ago had already bound himself that this project would materialise?” Dr Delia asked.\nPhoto: PN\nConsequently, it was Dr Muscat who was solely responsible, the PN leader said.\nHe also pointed out that the two towers shown in last month’s presentation to the parliamentary group, had become 12 according to Sunday newspapers.\nIn his address, Dr Delia reiterated his promise that a PN government would guarantee housing for every single Maltese citizen who at the moment could not afford it. He also expressed his deep concern on government’s policy to import 50,000 foreign workers in the last five years, saying a further 60,000 were in the pipeline in the coming five.\nHe criticised the government for only looking at numbers, by increasing the population to fuel consumption. While this could translate to economic success, there were 72,000 people on the brink of poverty he said.\nThe PN leader once again accused the government of “working behind the scenes” to introduce abortion.\nWhile saying that there must be more support for women having unplanned pregnancies, he denounced those referring to life at conception as “eight cells”.\nDr Delia reiterated that his party was pro-life and would never budge on the matter.\nIn his concluding remarks, he referred once again to the situation within the party saying that, under his leadership, the PN was reaching out to the people and going back to the grassroots.\n“They cannot stand such a thing, do not want it, do not accept it, as they know that when the party is attacked it always does one thing – it does not attack back but seeks refuge in the people,” he said. He did not qualify who was behind these “attacks”.\nWhile urging supporters not to give up he vowed that the party would be strengthened and returned to its glorious days when it was the party of the people and persuasion.", "comment_count": 49, "id": 3462}, {"keywords": "", "author": "Jacob Borg", "article_body": "Dutch national Noordzee Ryan Roberto on Sunday admitted to importing cocaine into Malta which was intended for trafficking.\nMr Roberto was arrested on Friday along with two other people at a Sliema hotel.\nMagistrate Neville Camilleri told the man that in entering a guilty plea he stood to go to jail for a very long time.\nThe man told the court that he was aware of this and would be sticking to his guilty plea.\nIn a separate arraignment linked to the same case, Josef Mahouachi, 25, a delivery man from Fgura, denied being in possession of cocaine he intended to traffic.\nHe also denied being a repeat offender.\nA request for bail was denied.\nFreezes on both men’s assets were ordered.\nInspectors Anthony Scerri and Frank Tabone prosecuted in both cases. Francina Abela was legal aid for Mr Roberto. Lawyer Mario Mifsud appeared for Mr Mahouachi.", "comment_count": 0, "id": 3463}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A massive residential block of 114 apartments, spread over six floors with underlying shops and garages, has been proposed for a spot adjacent to Fatima church at Pietà, replacing two villas and a farmhouse.\nThe project application was submitted to the Planning Authority last May. It is currently undergoing the internal screening process and receiving representations from entities and people.\nThe applicant, Stephen Falzon, is proposing to demolish Villa Gauci and The Orange Grove as well as a dilapidated farmhouse in Triq Santa Monika and Triq id-Duluri in Pietà to construct an office, three retail outlets, 114 one-two- and three-bedroomed apartments including penthouses, a botanic garden, a communal pool and 44 garages over three levels, 25 car spaces, a substation and a refuse area.\nThe only representation received so far by the Planning Authority was from the Environment and Resources Authority which asked for more information from the applicant and architect in order to assess the project from an environmental point of view and to determine whether the proposal requires any further studies.\nThe proposed Pietà development.\n114 apartments proposed\nIt asked for the total gross floor area of the proposed development according to EIA Regulations as well as the projected increase in traffic flows in annual average daily traffic, taking into consideration all the development interventions on site.  Just a stone’s throw away, in March 2017 the Planning Authority gave its blessing to the rehabilitation of the historic Blackley Bakery, which has remained in disrepair for years and which will be turned into offices and apartments.\nFirst opened in 1907, Blackley Bakery was equipped with the most advanced machinery available at the time. It included a two-storey home, Kington House, and housing for employees. A yard between the buildings includes a number of storerooms, workshops and stables used to deliver goods across the island.\nThe proposal, approved by the PA with eight votes in favour and two against, will restore the Grade 2 scheduled bakery to be used as offices, adding an additional recessed floor.\nThe interiors of the scheduled Kington House and workers’ dwellings will be demolished and converted into apartments, although the facades will be retained and restored, and the Kington House entrance hallway reconstructed. Two additional floors, one of which will be recessed, will be added on the two buildings to accommodate more residences.\nThe Superintendence for Cultural Heritage and other heritage bodies had raised no objections to the development.", "comment_count": 81, "id": 3464}, {"keywords": "", "author": "", "article_body": "Police officer of the year Simon Schembri is being promoted to sergeant on January 21.\nThe 48-year-old traffic policeman lost an arm last year when he was dragged several metres under a car in a hit-and-run after he tried to stop 17-year-old Liam Debono, who was over-speeding in a Mercedes. The youth stands charged with attempted murder and is out on bail after pleading not guilty to the charges.\nThe officer was nominated policeman of the year by his peers.\n\nThe Simon Schembri Blue Light Foundation said on its Facebook back PC Schembri distinguished himself impeccably throughout his policing years and was “a living example of a person having a glorious career without climbing up to the highest ranks of a Department”.\nThe foundation was set up after the incident to give psychological and financial support to members of disciplined forces and raise awareness on the perils these officers faced on a regular basis while on duty.", "comment_count": 20, "id": 3465}, {"keywords": "", "author": "", "article_body": "Warm greeting for Libyan PM\nPrime Minister Joseph Muscat welcomed his Libyan counterpart Fayez al-Serraj to talks on migration and bilateral relations at Castille on Wednesday. Dr Muscat said the level of commitment from the Libyans to tackle migration had grown over the past year.\nWhat made the headlines\nMigrants in Malta after 19 days at sea: A group of 49 migrants, most of whom were left out at sea for 19 days, were brought to Malta from where they will be redistributed among eight European countries, namely Germany, France, Portugal, Ireland, Romania, Luxembourg, the Netherlands and Italy. Prime Minister Joseph Muscat said a majority of a separate group of 249 migrants brought to Malta in December will also be taken to other EU countries. A group of 44 Bangladeshi migrants who were among these 249 will be repatriated. Dr Muscat said that out of the total 298 migrants, Malta will be hosting 74.\nCorinthia Group chairman Alfred Pisani\nPN to ‘block’ Corinthia deal in Parliament: The Nationalist Party said it would vote against a deal allowing the Corinthia Group to develop public land in St George’s Bay, originally meant for tourism purposes only, into residential and commercial real estate. Corinthia Group chairman, Alfred Pisani, gave a presentation about the project to the PN parliamentary group but, according to party sources, he failed to convince the Nationalist MPs.\nDelia under pressure: Nationalist Party leader Adrian Delia held talks with the heads of two high-ranking party organs over his future, amid growing pressure to resign over serious allegations against him, the Times of Malta reported. Dr Delia met Mark Anthony Sammut, president of the executive committee and MP David Stellini, who heads the administrative council, which deals with issues of a disciplinary nature. Mr Sammut remarked that he and Mr Stellini had shared their views “on what we believe should be done”. Meanwhile the Times of Malta also reported that local PN committees and members of the PN’s general council are being pressured by senior party officials close to the leadership to publicly declare, in writing, their loyalty to Dr Delia. However, it was reported online that the PN Sliema sectional committee on Friday rejected a confidence motion in favour of Dr Delia by 10 votes to three. Meanwhile Dr Delia has not yet called a meeting of his parliamentary group to discuss the PN’s situation. Dr Delia had other problems: Earlier in the week the Times of Malta reported that a leaked e-mail showed that, apart from an €81,000 tax bill he reportedly settled last year, Dr Delia still owed the exchequer €64,000.\nJudge rules against Panama Papers probe: A magistrate’s decision to launch an inquiry into Panama Papers revelations was revoked by an Appeals Court which ruled that Simon Busuttil had not presented enough evidence to substantiate his allegations of wrongdoing. Mr Justice Giovanni Grixti said the former Nationalist Party leader had listed a series of allegations and attributed ulterior motives “without indicating in detail the facts which constitute crimes” and which, in the absence of further evidence, “qualify as speculation”. The case had kicked off in the weeks following the 2017 general election, with Magistrate Ian Farrugia deciding there were sufficient grounds to investigate possible money laundering by government officials and others, stemming from revelations laid bare by the Panama Papers. That decision was appealed by seven key individuals, among them the Prime Minister, Dr Mizzi and Mr Schembri. Dr Busuttil, who had filed the intial request for an inquiry, subsequently objected to the appeal being assigned to Judge Antonio Mizzi, who is married to Labour MEP Marlene Mizzi. That recusal request was turned down by the courts just weeks before Judge Mizzi was due to retire. The case was subsequently assigned to Mr Justice Grixti.\nAlmost all teachers experience aggression at school: Nearly nine out of every 10 teachers who took part in a Malta Union of Teachers’ survey said they experienced aggression at their school over the past two years. Twenty three per cent claimed they experienced aggressive behaviour daily, while another 23 per cent said they did so every week. Three-quarters of those who experienced such behaviour said the perpetrators were students.\nFuel stations ‘will stop operating’: Fuel stations will stop operating unless an agreement is reached over an increase in their margin of profitability, the Chamber for Small Businesses (GRTU) warned. Discussions between the GRTU and the government have been dragging on since 2014, and operators are expected to refurbish fuel stations by next year – an expense that could reach half a million euros.\nDecade in jail for man who raped his cousin: A young man began sexually abusing his cousin when she was just seven years old and raped her when she was 10, a court ruled. The man, who is now 25, sat stunned and expressionless as Madam Justice Consuelo Scerri Herrera expressed disgust at his “barbaric and animal-like” behaviour and sentenced him to a 10 years behind bars. \nWhat trended\n‘Always a mess left behind’\nBy the time you read this, Marsaxlokk residents will have decided whether or not they want the town’s seaside market to close by 3pm.\nThe impromptu referendum prompted anger among hawkers, who told the Times of Malta that early closures would put their livelihoods at risk.\nReaders did not seem overly impressed by that line of argument, though.\n“The only reason tourists start arriving at around mid-day is because tour operators know that the market is open till sunset,” argued Ray. “Residents and the public have the right to enjoy the place without any ‘objects’ hanging in front of their faces”. \nMarius was delighted by the council initiative, noting “there is always a mess left behind and the smell of stinking fish is always unbearable”.  \nHis relief was shared by James, who insisted that it was about time the monti sellers stopped getting a free pass.\n“Why should the local council be saddled with the filth from those making money and leaving a mess behind?” he fumed.\nNot that all readers had a great deal of sympathy for the local council’s position, with many suspecting its sudden zeal for having a cleared-out promenade by the late afternoon was not entirely altruistic.\n“The only reason why the local council wants the hawkers to close at 3pm is to clear the promenade for the restaurant owners to set the tables,” sniffed Charlene.\n“Just like they did in Valletta,” sighed Mario.\nDismay over bank charge\nHSBC came in for a tongue-lashing by readers when we reported that it would be charging corporate clients, including sports clubs and other civil organisations, upwards of €300 a year for the privilege of banking with it.\nThe news was met with dismay by many readers.\n“We are lucky to end the year with a profit margin of a couple of hundred euros at most,” wrote a member of a local scout group.\n“This move has left us with no choice but to move our accounts elsewhere.”\nThat might be a short-term solution though – at least if other readers, who said they now expected other retail banks to follow suit, are to be believed.\nDM, though, reckoned that it made perfect sense to charge a fee for a well-run service.\n“The Satabank experience  shows that solid, well-run banks should be appreciated rather than constantly criticised,” he wrote.\nWhat they said\n“We do not want to stay here in storms anymore, please. It makes us sick, all of us – 32 people – in one room on a boat, like animals. We are not happy, this is not fair. There are women and children and everybody is scared. We just want to be safe.”\nDiamond, a Nigerian asylum seeker aboard the Sea-Watch 3, making a plea to be allowed into Malta.\n“One cannot simply turn a blind eye to such allegations. What is going on? What is the way forward? These are the questions I am being asked right now during house visits.”\nNationalist MEP candidate Michael Briguglio speaking to the Times of Malta about the allegations levelled against PN leader Adrian Delia.\n\n“I am saying that every case is being investigated. In some cases, you cannot go in front of the public, comment, say what you have in hand and prejudice the case. The police work in silence.”\nPolice Commissioner Lawrence Cutajar replying to a question on whether the 17 Black case was being actively investigated.\n“How can we, as European nations of goodwill, have allowed the mental, physical, and emotional distress of innocent individuals, to take place, over such a long period of time?”\nPresident Marie-Louise Coleiro Preca, addressing heads of diplomatic missions to Malta, lamenting that the stand-off relating to migrants on two NGO vessels at sea had dragged on for too long.\n\n“Unbelievable. This cannot be right. Where can we go for justice to be served in Malta?”\nFormer Nationalist Party leader Simon Busuttil reacting to the news that an Appeals Court had revoked a magistrate’s decision to launch an inquiry into the Panama Papers revelations”", "comment_count": 0, "id": 3466}, {"keywords": "", "author": "Claire Caruana", "article_body": "A global index drawn up by Malta’s cash-for-passports scheme concessionaires, Henley and Partners, has downgraded the island’s rank by two places.\nPublished annually, the Henley Passport Index, unveiled last week, ranked Malta’s passport as the ninth strongest in the world, down from seventh place last year.\nHenley and Partners have made headlines in Malta in recent years after they designed the island’s controversial cash-for-passports scheme, introduced when the Labour Party was elected to government in 2013. Photo: Jonathan Borg\nThe country’s passport was awarded 182 points, which according to the concessionaires is based on “exclusive data” from the International Air Transport Association (IATA).\nFor the second-year running, Japan was ranked as having the strongest passport, followed by Singapore and South Korea in second place and France and Germany in third place.\nAt the other end of the scale, Afghanistan’s passport was ranked as the least powerful of all countries, with Somalia and Syria just ahead.\nAccording to the Switzerland-based company, the index and its contents are based on data provided by the International Air Transport Authority (IATA) and “supplemented, enhanced and updated using extensive in-house research and open-source online data”.\nThe scores are determined by the number of countries holders of the different passports can visit without needing a visa.\nRead: 2,500 golden passports sold in four years\nHenley and Partners have made headlines in Malta in recent years after they designed the island’s controversial cash-for-passports scheme, introduced when the Labour Party was elected to government in 2013. The scheme generates hundreds of millions of euros and has helped the island in registering a surplus in its budget.\nMillionaires can opt to buy a Maltese passport by donating about €650,000 to the Maltese exchequer and also by abiding by a number of other obligations such as acquiring a property valued at a minimum €350,000 or rent for a minimum of five years.\nThe new Maltese citizens are obliged to prove they have lived in Malta for 12 months.\nSince its inception, the scheme has come under fire from various European institutions and international anti-corruption groups.\nJust last October, a report by Transparency International and Global Witness slammed the scheme, highlighting the need for the island to better address the programme’s reputational and money-laundering risks. Some members of the European Parliament have also spoken out about the need to better regulate cash-for-passports schemes, including that of Malta, for which very little information is supplied.", "comment_count": 42, "id": 3467}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday's newspapers.\nThe Sunday Times of Malta says the PN’s treasurer warned party leader Adrian Delia last summer that finances would run dry by next month. In another story, the newspaper says another member of the judiciary will be asked to probe the Panama Papers scandal after former Opposition leader Simon Busuttil’s request for an inquiry was turned down last week. The newspaper also says the government has granted unlimited rights to the Corinthia Group to reclaim the seabed around the peninsula it occupies at St George’s Bay and build on it.\nIt-Torċa also leads with a story on the PN’s financial problems.\nMalta Today says Corinthia will replace hotels with 12 tower blocks.\nThe Malta Independent on Sunday says the government is unwilling to use its veto power to force a solution on migration.\nIllum says Beppe Fenech Adami voted against Adrian Delia in a confidence vote called by the party’s College of Councillors.\nIl-Mument quotes party leader Adrian Delia saying he was in politics to change the country and the party and improve the people’s lives.", "comment_count": 0, "id": 3468}, {"keywords": "", "author": "Jacob Borg", "article_body": "The PN’s treasurer warned party leader Adrian Delia last summer that finances would run dry by next month, according to a leaked email.\nA party spokesman has however reassured The Sunday Times of Malta that finances have since improved and the party would “definitely not run dry in the coming months”.\nThe email, sent by treasurer David Camilleri to Dr Delia and other recipients last August, said “money for loans/arrears repayments will dry up on February 19”. Money for the PN’s day-to-day running would also run out in February, it said.\nContacted for a reaction, a PN spokesman said the party had “drastically improved” its daily income through fundraising activities and “other financial solutions”.\n“Adrian Delia has set an ambitious 10-year plan to place the party on a robust financial footing that would also provide for the payment of its debts rather than continue accumulating them with interest,” the spokesman said.\nThe spokesman pointed out that it was no secret that Dr Delia had inherited a difficult financial situation.\nHe said the PN leader had from day one focused on the party’s financial situation and had set up a financial committee which he himself chairs.\nDr Delia alluded to the party’s financial difficulties during a rally on Thursday.\nHe said that while the party may lack financial strength it had determination.\nThe email sent by the PN treasurer said progress must be made on generating more income from six particular properties it owns in various localities.\nIt contemplates the fate of the party’s Vittoriosa club due to the urgent need for cash.\n“Although we discussed that renting out for a boutique hotel possibility would be the best option in the long run, we need cash from Feb onwards.\n“We need to consider selling since we should be able to get 800/900k. If we postpone further, this will certainly not be concluded up to Q1 2019”, the email read.  The correspondence also painted a dire picture of the party’s financial preparedness for the upcoming local council and MEP election campaigns.\nThe correspondence also painted a dire picture of the party’s financial preparedness for the upcoming local council and MEP election campaigns\nAt that stage in summer 2018, the PN treasurer said the only funds gathered for these campaigns were “16/17k from the maduma [tile] initiative”.\nThe PN had taken to selling tiles at €500 apiece to be used in a mosaic displayed at the party’s headquarters.\nAs a cost-cutting measure, the treasurer suggested limiting the use of printed material during the election campaigns due to the “limited funds” available.\n“MEP candidates should pay for their own marketing material if they would like to distribute to households. Apparently the party used to pay for all material,” the email said.\nIn the lengthy missive, the PN’s treasurer said stricter procedures had to be put in place to prevent people from overstating the amount of their donations during the party’s fundraising marathons. \nAll donations had to be verified by officials before being broadcast, the email said, placing the onus on Dr Delia or PN secretary general Clyde Puli to communicate this to all MPs and candidates.\nThe treasurer also set out the need to start a campaign for the PN’s controversial ċedoli scheme.\nThrough the ċedoli scheme, which was harshly criticised by the Labour Party as a way to circumnavigate party financing rules, PN supporters and investors were encouraged to lend the PN small sums of money, up to €10,000, in return for 4% interest per year and the return of their capital after 10 years.\nMr Camilleri said that by mentioning the scheme in one television programme, €50,000 was raised.\nTimes of Malta reported last week that senior PN officials were “shocked” by leaks showing that Dr Delia had explored using the scheme as collateral to raise funds for the party from Global Capital.\nIn a statement, members of the PN’s financial committee assured that it was kept abreast “of all financial initiatives”.\n ", "comment_count": 152, "id": 3469}, {"keywords": "Education", "author": "", "article_body": "The Institute of Education (IfE) will over the next three years offer training to staff and collaborators at Esplora Interactive Science Centre, Kalkara, in various learning approaches, school syllabi and curricula. The aim is to  improve their ability to link their interactions with students visiting the science centre with the school curricula, where necessary. It will also enable Esplora staff to develop pre- and post-visit resources together with teachers so as to enhance students’ learning experiences.\nThese initiatives are expected as a result of the recent signing of a memorandum of understanding between the IfE and the Malta Council for Science and Technology (MCST). The agreement aims to develop Continuing Professional Development to contribute towards the upgrading and upskilling of Esplora staff, teachers and collaborators who co-develop content for the Esplora education programme.\nBesides enabling Esplora staff to attend IfE courses, the memorandum of understanding  speaks about the possiblilty to create new accredited IfE courses to cater for the needs of Esplora staff, teachers, parents and the public. Meanwhile, the IfE will also be able to use the premises at Esplora to complement its training through hands-on learning, especially for science, technology, engineering and mathematics (STEM) courses offered by IfE, whereby part of the course could be held on site.\nAt the signing of the memorandum, MCST chairman Jeffrey Pullicino Orlando said: “We cannot work in isolation; we must work together to prepare future generations to face challenges in the work place. This collaboration between Esplora and IfE  will yield the highest level of staff.”\nIfE CEO Joanne Grima said: “Through this agreement with MCST, educators will have the opportunity to directly link scientific theories to practice, engaging more learners in the process.”\nThe memorandum was signed in the presence of Education Minister Evarist Bartolo, who commented: “Gone is the time whereby education happens just at school. We live in a society where learning happens not only in formal education settings such as schools, but also in non-formal education centres such as Esplora. We need more children and youths to choose the fields of science and technology to work towards a sustainable future for our country and our planet.”", "comment_count": 0, "id": 3470}, {"keywords": "Education", "author": "", "article_body": "A Continuing Professional Education seminar entitled ‘Budgetary Measures’ will be held on January 31 from 3 to 5pm by the University of Malta’s Department of Accountancy in collaboration with Malta University Consulting Ltd. It will take place at the University Residence, Robert Mifsud Bonnici Street, Lija.\nThe seminar will be conducted by Jozef Wallace Galea, a fellow of the Malta Institute of Accountants, a member of the Malta Institute of Taxation and a member of the Society of Trust and Estate Practitioners. It qualifies for two hours (Core Competencies) of CPE.\nFor further infor-mation call Maria Bugeja on 2124 0746, e-mail maria.bugeja@muhc.com.mt or visit the website below.\nwww.muhc.com.mt", "comment_count": 0, "id": 3471}, {"keywords": "Education", "author": "Aidan Bugeja, Matthew Megrahi and Jake Gatt", "article_body": "Science and biology Form 4 students at St Margaret College Senior Secondary School Verdala, Cospicua, were recently given a special lecture about the benefits and practice of Traditional Chinese Medicine (TCM).\nThe lecture, delivered by Dr Duan Jiming (known as Dr Sam), director of the Mediterranean Regional Centre for Traditional Chinese Medicine at Corradino, was the latest in a series of events orga­nised by the students’ senior science teacher, Martin Azzopardi, to see applied science in a practical way.\nDr Sam said TCM is a type of holistic, natural healthcare system that originated around the year 200 BC. “TCM is both holistic and natural because it stimulates the healing mechanisms of the body and takes into account all aspects of a patient’s life,” he said. Dr Sam added that while TCM treatments focus on organs like the kidneys, heart, spleen, liver, lung, gallbladder, small intestine and large intestine, he said TCM views the body as a complex network of interconnected parts and not a system of separate organs.\nTCM can be used to treat a wide range of health problems, including chronic pain and arthritis\nDr Sam said that TCM can be used to treat a wide range of health problems including chronic pain, arthritis, fatigue, infertility, liver disease, headaches, indigestion, hormonal imbalances, high blood pressure, premenstrual syndrome or menopause symptoms. It consists of different therapies, including acupuncture, which aims to help lower pain, improve hormonal balance and combat stress; cupping therapy, which is used for pain management, improving immunity and helping with digestion; herbal medicine, which is used to control inflammation, fight body damage and boost liver function; nutrition, which aims to prevent deficiencies, boosting energy and improving detoxification; exercise, including Qi gong or tai chi to promote flexibility, strength and concentration; massage, which aims to soften the body tissue to improve the blood flow, one of which is called ‘tui na’; and moxibustion, which involves burning a particular herb near the skin.\nDuring the lecture, Dr Sam also gave the students demonstrations in the use of sterile needles, cupping and moxa.\nThe authors are students at St Margaret College’s Senior Secondary School, Verdala, Cospicua.\nDr Duan Jiming giving the students demonstrations in the use of sterile needles, cupping and moxa.", "comment_count": 0, "id": 3472}, {"keywords": "Gozo", "author": "", "article_body": "The restored statue of St Isidore the Farmer was inaugurated at St Francis church in Victoria last Sunday.\nIn February 2017, Fr Guardian Joseph Xerri of the Conventual Franciscans asked then Gozo Minister Anton Refalo to sponsor the restoration of the statue. After the approval of the sponsorship project by the Eco Gozo Directorate in March 2017, work on the statue was taken in hand by PrevArti – art restoration and conservation. The statue was restored to the tune of €7,080.\nThe wooden statue of St Isidore was sculpted in Spain around the 18th century. According to a historic analysis of the statue, it was originally gilded in gold, but it was overpainted in black during the French occupation of Gozo to hide it from the occupiers and stop them from stealing the statue.\nPierre Bugeja of PrevArti Laboratory in his state of restoration report said some splits in the wood needed special attention and there was damage also in the eyes of the saint. Some chipped areas and cracks were visible on the hands and abrasions were also noted throughout the surface of the paint layer.", "comment_count": 0, "id": 3473}, {"keywords": "Education", "author": "", "article_body": "Research recently conducted by Maltese geologist Daniel Sultana for the award of a PhD from the Department of Earth Sciences at the Royal Holloway University, London, was described as outstanding in both depth and quality by his examiners, Prof. Martyn Pedley and Dr Georg Warrlich.\nDaniel Sultana\nDuring the research for his PhD thesis, entitled ‘Exploring the roles of sediment production and transport on carbonate platform evolution: a numerical modelling and outcrop-based investigation (late Miocene, Upper Coralline Limestone Formation, Malta)’, Dr Sultana developed and applied a novel step-by-step quantitative method that integrates numerical forward modelling with outcrop observations. This enabled the strengthening or rejection of conceptual models, the investigation of alternative hypothesis as well as issues of non-uniqueness.\nThe thesis also demonstrated that quantitative approaches may replace qualitative conceptual methods and models. This shift would improve the understanding of platform evolution and may help direct and refine further research on platform evolution and oil exploration.\nDr Sultana said Prof. Daniel Bosence and Prof. Peter Burgess, who mentored his research, were a source of inspiration throughout his PhD. He added that their academic contributions have shaped the fields of geology and numerical modelling.\nDr Sultana is an assistant lecturer at the University of Malta’s Junior College and a senior environment protection officer at the Environment Resource Authority. He has an MSc (Hons) in Petroleum Geology from the University of Aberdeen and a BA (Hons) in Geography from the University of Malta.\nHis PhD was funded by the Malta Government Scholarship Scheme (MGSS).", "comment_count": 1, "id": 3474}, {"keywords": "Gozo", "author": "", "article_body": "An Epiphany concert in aid of the JP2 Foundation was held at St Anthony of Padua church in Għajnsielem. Miriam Christine Borg and Victorio Gauci performed a selection of Christmas and religious hymns, including Panis Angelicus, Ave Maria, O Holy Night, The Prayer, Silent Night and We Three Kings, among others.", "comment_count": 0, "id": 3475}, {"keywords": "Education", "author": "Bernadette Mercieca", "article_body": "Mosta Primary A school recently embarked on a project to design a space within its premises into a ‘detoxifying reading hub’ where pupils would feel safe, welcome and encouraged to read. The aim was to make reading fun by integrating spaces and activities that involve sensory stimulation and encouraging learners to engage, explore, connect and learn.\nAt the same time the project sought to adhere to the principles of education for sustainable development by reusing tons of strong cardboard and other waste, including some hazardous waste, which could have otherwise been thrown away.\nThe author (left) with school head Dr A. Pulis.\nDuring the summer months new interactive whiteboards had been installed, leaving the school with around 35 large strong cardboard boxes – weighing 210 kilograms – to dispose of. But instead of disposing this high-grade packaging material, the thick cardboard was reused to create a sensory wall and book cases.\nThe project served as an outreach to the whole school community, involving parents, educators and young students, and during the European Week for Waste Reduction last November parents and educators were invited to bring over cans of leftover paint to be used to decorate the cardboard furniture and walls. They also brought in bits of leftover cloths, buttons, zips, wool and other textured materials that were recycled to set up the sensory wall and to furnish the room with cushions made from used material.\nThe design of the detoxifying reading hub involved consultations with professionals such as occupational therapists and inclusion coordinators working with children who would especially benefit from such a sensory input. Sensory stimulation not only benefits particular students who may face self-regulation challenges, but enhances the reading and learning experience for all. By integrating sensory stimulation in the design of this reading space, the school sought to meet the needs of all students.\nThe project was the fruit of all stakeholders in the project: educators and students helped with the artistic creation of the murals and decorations, parent volunteers and neighbours from the community worked on the recycled furniture and soft furnishings, and professionals from the Occupational Therapy department worked on the sensory wall. The school handymen also gave a helping hand in the realisation of the project.\nThe school believes that the project will: foster a culture of reading in the school; improve student outcomes and raise achievement; improve the general well-being of the pupils; create independent readers and readers for life and give all learners more opportunities for learning.\nFurthermore, through the project we wanted to foster a ‘second chance’ mentality in school community. The overall feeling of all participants can be summarised in this quote by one of the parent helpers: “I never imagined that with some creativity and great teamwork, things we usually throw away can be turned into resources for little children… I feel proud to have had the chance to participate.”\nBernadette Mercieca is assistant head at Mosta Primary A school.", "comment_count": 0, "id": 3476}, {"keywords": "Gozo", "author": "", "article_body": "The 10th edition of Bethlehem f’Għajnsielem came to a close last Sunday with the arrival of the Three Wise Men. Their voyage to Gozo had started from Tel Aviv, Israel, on January 4. They began their journey to Gozo last Sunday, travelling on horseback from Mellieħa and reaching the Għajnsielem Nativity village at 4.30pm. The Magi were warmly greeted by onlookers and visitors to the village. On their arrival at Ghajnsielem parish square the Magi were blessed by Canon Joe Cardona.", "comment_count": 0, "id": 3477}, {"keywords": "Gozo", "author": "", "article_body": "The triumphal arrival of the Magi, riding on horses, took place in Qala Square before a sizeable crowd. The Three Kings offering their gifts of gold, frankincense and myrrh to Baby Jesus.", "comment_count": 0, "id": 3478}, {"keywords": "Gozo", "author": "", "article_body": "The arrival of the Three Wise Men was also re-enacted at Victory Square, Xagħra. Mario Agius and his daughter Graziella Casha, depicting Mary and Joseph, carrying Baby Jesus, played by one-year-old Matthias Casha, made their way to Xagħra basilica, followed by the shepherds and their flock who paid homage to Baby Jesus. The Three Wise Men, riding on horseback, converged on the square from three side streets. The proceedings were eerily watched by King Herod the Great, a ruthless tyrant who, on hearing from the Wise Men that a new king had been born in Bethlehem, killed all the male children under two years in that town.", "comment_count": 0, "id": 3479}, {"keywords": "", "author": "", "article_body": "Two men and a woman were arrested on Friday night following a drug bust in Sliema, the police said.\nA roadside inspection led to the arrest of a man from Fgura, a woman from Valletta and a Dutch national, aged between 20 and 43.\nOne of those arrested was found in possession of capsules with around 300 grams of drugs, believed to be cocaine. \nA magisterial inquiry has been ordered.\nThe three are expected to be arraigned shortly. \n \n ", "comment_count": 0, "id": 3480}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Midway through a public meeting organised by the British High Commission to inform British citizens in Malta of their rights post-Brexit, a Maltese government official assured those present that applying for their new residency status would be a “smooth and seamless transition”. \nHe was met with an eruption of laughter. \nIt was a moment that summed up the mood among the hundreds of British residents packed into a conference room in Qawra on Wednesday, who, despite the assurances of Maltese and UK government representatives, voiced doubts and uncertainty on issues ranging from their residency rights and work permits, to healthcare and driving licences.\nOpening the meeting, the first of a series to be held over the coming weeks, British High Commissioner Stuart Gill said that under the terms of the UK Withdrawal Agreement, “British nationals in Malta will have a legal guarantee that they will be able to stay here with broadly the same access to healthcare, pensions and other benefits as they have now”.\nBut as the March 29 Brexit date approaches, it remains unclear whether the withdrawal agreement will be approved or whether Britain will crash out of the EU with no deal. \nOn this scenario, Mr Gill stressed that a number of member states, including Malta, had made a political commitment to maintaining all current rights for British citizens. \nFor many of those in the room, however, this did not seem to be enough.\n“Listening to all the questions here, we still have no idea what’s going to happen,” one person said. \n“The UK government seems to have given more consideration to EU citizens in the UK than to us here. All this talk of political discussion is just rhetoric. We don’t know what’s going to happen.”\nMost of us don’t have €650,000 to buy a Maltese passport\nAlthough the Maltese government representative, Glenn Micallef from the Ministry for European Affairs, repeatedly stressed the strong relationship between the two countries and the commitment to protecting citizens’ rights in any eventuality, most of his answers fell into a similar pattern. \n“If there is a deal in place, there will be specific provisions that cover this,” he said in response to one question on converting professional qualifications. \n“In the event of no deal, it remains to be seen.”\nThe woman who posed the query, a UK barrister who has worked in Malta under EU regulations for years, did not seem impressed with the reply.\n“So, if there’s no deal I can close down now and dismiss my Maltese employees,” she said. \nAmong the many others who expressed work-related concerns, one woman said: “We’re in the cryptocurrency sector that Joseph Muscat is so keen to promote. I need to know what to do with my British workforce.”\nResponding to one man who said he did not yet feel reassured about his right to work in Malta in the event of a no-deal, the Maltese government representative conceded that a political discussion would have to take place, but pointed to the economy’s openness to a foreign workforce. \nAs the meeting wound down, some took the opportunity to put their sentiments across more wryly. \n“Most of us don’t have €650,000 to buy a Maltese passport,” one man noted. \n“Will the government consider a discount scheme for those of us who have invested time, money and effort in this country?”", "comment_count": 304, "id": 3481}, {"keywords": "", "author": "", "article_body": "A man charged with setting his car on fire to benefit from an insurance claim, was acquitted since the prosecution’s case had rested entirely upon the  “assumptions and speculations” of a court-appointed expert.\nAldo Bajada, 40, had turned up one morning in September 2012 at the Naxxar police station to report that his Land Rover Freelander had been damaged in a fire.\nA magisterial inquiry had kicked off into the suspected arson, with a number of experts called in to determine the dynamics and cause of the fire.\nAmong these was one expert who came forward with several “assumptions and speculations” borne out of a discussion which he had conducted with the owner of the vehicle during the on-site inspection.\nOn the basis of these conclusions, the police had pressed charges against the owner for reporting a crime that had not taken place, setting his car on fire to claim insurance money and also for being a recidivist.\nIn the course of the proceedings, the dynamics of the alleged arson, as determined by the expert, appeared to indicate that the perpetrator had opened the driver’s door, scattered flammable liquid onto the car seats and then set it alight with a burning paper.\nThe fire spread quickly but the blaze had been extinguished within minutes once the oxygen inside the closed vehicle had burnt out, the expert had reported, concluding that the perpetrator must have been no expert since otherwise he would have left the door open to stoke the fire.\nThe court, presided over by Magistrate Donatella Frendo Dimech, pointed out various shortcomings by the prosecution in proving its case.\nA chemical expert had concluded that there were “no traces of fuel” or other flammable liquid.\nOn the basis of all evidence, the court could find nothing linking the accused to the alleged arson, adding that the cause of the fire had not been proved in any way.\nLawyer Joe Giglio was defence counsel.", "comment_count": 0, "id": 3482}, {"keywords": "", "author": "", "article_body": "A 44-year-old sustained grievous injuries after falling off a ladder in a garage in Paola on Saturday, the police said. \nThe incident happened in Triq Għajn Dwieli at 12.10pm.\nHe was rushed to hospital in an ambulance. \nThe police are investigating. ", "comment_count": 0, "id": 3483}, {"keywords": "", "author": "", "article_body": "One of Malta's foremost environmental activists will be contesting the MEP elections on the Democratic Party ticket.\nCamilla Appelgren, a Swedish national, who relocated to Malta in 2011, is known for coordinating regular clean-ups of Malta.Cami Appelgren\n\"It is a party I've always personally experienced up close as being the voice of the people. They stand strong in their beliefs, while still cheering the good things done by others,\" she said, launching her candidature on Saturday.\nFor several years, Ms Appelgren has organised a national clean-up which mobilises hundreds of people across the whole country and has been at the forefront of informing the public of the dangers of single-use plastics and unsustainable living.\n\"Over the last few years the degradation of the environment has alarmingly increased. Many people seem to have given up fixing a broken system. We deserve to look to the future with hope and optimism, not sadness and despair.\"\nShe has issued a call for all citizens and residents to step up and join her in a force for political renewal, believing that a few determined individuals can make all the difference in the world.\nMs Appelgren promised: \"If elected as an MEP, I plan to prioritise climate change, dealing with the global plastic problem, and ensuring a green economic revolution, and getting the best possible deal as a centre for innovation.\"\n ", "comment_count": 11, "id": 3484}, {"keywords": "", "author": "", "article_body": "The government has the power of incumbency and marketing, two elements the Nationalist Party has no access to, Adrian Delia lamented on Saturday.\nHowever, the PN has the strength of persuasion and conviction, which is ultimately more important than marketing, the Nationalist leader said. \n\"Conviction lasts longer, because it can't be bought,\" he told a conference organised by the PN college of candidates at the party headquarters.\nHis address comes amid strife inside his party, whipped up by claims about his private and public life. \nDr Delia said he became involved in politics to improve his country and the lives of people and to change the Nationalist Party. \nThe role of a politician is to listen to the people and to get a real picture of the country, transcending surveys.\nWhen the government persists in building a soulless state, it was important to stress the importance of the common good and to protect the vulnerable, he concluded. ", "comment_count": 8, "id": 3485}, {"keywords": "", "author": "", "article_body": "Two men were arrested on Thursday on suspicion of drug trafficking in one of Gozo's main squares.\nThe police said a 29-year-old Italian national who lives in Marsalforn and a 45-year-old Gozitan from Fontana were caught allegedly trafficking drugs in St Francis Square in Victoria.\nThe Gozitan was found in possession of heroin packets intended for trafficking and a search at his house later yielded more drugs-related material. \nThe 29-year-old was caught in possession of cannabis but another police raid at his home also found other material related to drug cultivation, the police said. \nThe police are expected to arraign the two men in the coming days.", "comment_count": 0, "id": 3486}, {"keywords": "", "author": "", "article_body": "The Maltese authorities have rejected \"without any explanation\" a request by a migrant rescue vessel to exchange 10 crew members for four new volunteers.\nThe crew is looking for a port for the other NGO vessel Professor Albrecht Penck, which was also involved in the rescue, but which was barred from entering Malta. \nThe use of state power to take aggravating measures to prevent aid agencies from saving human lives reveals Malta's political course, a harsh statement by NGO Sea-Eye said on Saturday.\nIt comes at the end of a 22-day ordeal in which several migrants were stranded at sea as EU countries grappled over who should take them in. Malta eventually accepted to take them on condition that they were redistributed to eight other EU states.\nRead: Migrants finally touch land, as Muscat offers a blunt explanation for stand-off\nBut the saga appears to have dragged on after Malta refused to give permission for the Sea Eye vessel to dock, despite the \"intensive efforts\" of the German ambassador.\nMen like Joseph Muscat and Matteo Salvini do not determine alone what the future of Europe looks like\n“The dignity of our crew and the rescued people was not only touched, it was drowned in the Mediterranean,\" Sea Eye spokesman Gorden Isler said.\n“Apparently, one is very afraid that we will right away head back towards Libya being ready to rescue,” Mr Isler said.\nThe NGO accused Joseph Muscat of imposing his political will on the EU, regardless of the dignity of the rescued or the seafarers, by also forcing the relocation of 249 migrants rescued by the Armed Forces of Malta. \nDr Muscat received representatives of the Libyan unity government and demanded that the \"so-called\" Libyan Coast Guard be allowed to do their job.\n\"This cruel policy arises from domestic constraints. There is still no solution to the fair distribution of people rescued in the Mediterranean. The main burden is on Spain, Malta, Italy and Greece. The fact that Malta is putting its own interests above international law, due to domestic constraints, is a result of a non-solidarity of non-Mediterranean EU states.\"\n\"Men like Joseph Muscat and Matteo Salvini do not determine alone what the future of Europe looks like. After all, also the rescue organisations Sea-Eye e.V. and Sea-Watch e.V. belong to Europe, whose donors express the European desire to help.\"\nThe 10 crew members of Professor Albrecht Penck. Photo: Alexander Draheim/sea-eye.org)", "comment_count": 0, "id": 3487}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government has again insisted on refusing a request to publish a multi-million public contract on a controversial extension of St Vincent De Paul, turning down a judicial protest filed by the Democratic Party.\nIn a reply to a judicial protest requesting full transparency on behalf of the government, Family Affairs Minister Michael Falzon and his Parliamentary Secretary, Tony Agius Decelis, argued that they won’t publish the contract as it is currently under investigation by the Data Protection Commissioner following a request for publication filed by the Times of Malta.Parliamentary Secretary Tony Agius Decelis.\nDenying claims by PD leader Godfrey Farrugia that there was a clear abuse of public procurement rules in the way the tender was adjudicated and pushed forward, the government said that the former Labour minister should have waited for the final decision of the Data Protection Commissioner.\nThis latest development follows a decision made by the same ministry last year, refusing a Freedom of Information request by this newspaper for a full copy of the controversial contract which will see the disbursement of €274 million of taxpayers’ funds to James Caterers and a subsidiary of the Seabank db Group over 10 years.\nAt the time, the ministry argued that it could not publish the contract as it included “personal data” and would create prejudice to the competitiveness of the private consortium.\nRead: €274m direct order contract for SVDP to be investigated by audit office\nThe Times of Malta had requested an investigation into the ministry’s refusal to publish the contract, arguing that it goes against the Freedom of Information Act as its publication was in the public interest.\nThe controversy goes back to a 2015 public tender asking for the provision of meals at the old people’s home facility for the duration of 10 years and the building of a new kitchen.\nThe original value of the tender was €60 million. Two bids were received with the one submitted by the CCE joint venture – owned by the Vassallo Group being the cheapest when it came to the contents of the services required.\nHowever, the contract was awarded to the competing bidders, a consortium made up of James Caterers and the Seabank DB Group subsidiary, on the basis of an innovative tender clause asking for an “additional investment” in the form of a “gift” to the government for winning the tender.\nFormer Labour Minister should wait for the final decision of the Data Protection Commissioner\nThe winning bidders ended up offering a €30 million “gift” over a €60 million contract.\nAfter winning the bid, James Caterers and the Seabank db Group subsidiary, entered into new negotiations with the government, offering a better “gift” in the form of an extension of a 500-bed extension to the facility to be built on public land.\nIn return, the government agreed to pay the consortium €274 million for the contract, including the leasing of various services at the new facility, which the winning consortium offered as a “gift” to the government.\nIn this way, the value of the €60 million tender surged by more than four times to the benefit of James Caterers and the Seabank db Group.\nFollowing request by the Democratic Party and the PN, the tender had been referred for an investigation by the National Audit Office.\nThe government’s reply to the judicial protest was signed by Dr Nadine Lia – also engaged as a person of trust of Economy Minister Chris Cardona. \nivan.camilleri@timesofmalta.com", "comment_count": 54, "id": 3488}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Fuel stations will stop operating unless an agreement is reached over an increase in their margin of profitability, the chamber for small businesses (GRTU) warned on Fruday.\nDiscussions between the chamber that represents the petrol station owners and the government have been dragging on since 2014, and operators are expected to refurbish fuel stations by next year – an expense that could reach half a million euros.\nCEO Abigail Mamo told the Times of Malta that in 2014, the GRTU had presented the government with a study carried out by independent auditors about the increase, in cents, in the margin of profit for fuel stations.\nThe last increase, which was a marginal one, was made nine years ago, she noted.\nRead: GRTU threatens possible fuel station action\nThe survey demonstrated that some of the pressures being faced by operators because of infrastructural requirements are due to new regulations.\nThe CEO said fuel stations were bound to implement substantial refurbishment by 2020.\nTime is passing by and the government appears to be in no rush to settle things\n“The cost is to the tune of half a million euros per station,” Ms Mamo said.\n“Time is passing by and the government appears to be in no rush to settle things, while requirements by the Environment and Resources Authority and the Regulator for Energy and Water Services continue to increase, with 2020 knocking on our door.”\nBacked by the study, the GRTU had entered into negotiations with the government in 2014, and discussions have been ongoing.\nHowever, the government had actually reneged on some of the things that had already been agreed upon, according to the GRTU.\nProgress registered over the past years fell through, with discussions with Energy Minister Joe Mizzi appearing to start afresh, Ms Mamo added.\nThe GRTU accused the minister of dragging his feet in spite of numerous meetings,and warned that it was now willing to escalate the situation.\nMs Mamo said that a meeting between the ministry and the GRTU was planned for the coming days and added that the chamber had given the government an ultimatum that if no agreement was reached, its members were ready to stop providing the service until negotiations were closed off.", "comment_count": 35, "id": 3489}, {"keywords": "", "author": "", "article_body": "An armed man wearing a hoodie stormed into an Attard shop, and threatened an employee before running away with the cash on Friday night, the police said. \nThe incident happened in Triq il-Linja around 8pm when the man charged into the shop and threatened the 36-year-old assistant. \nNobody was injured in the incident. \nThe police are investigating. ", "comment_count": 0, "id": 3490}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Embattled Nationalist Party leader Adrian Delia has not yet called a meeting of his parliamentary group despite the fact that the House of Representatives will return to business on Monday with a heavy legislative agenda after the Christmas recess.\nAmid increasing pressure on Dr Delia to step down, following a raft of serious allegations about his private and public life and clear indications that he does not have the support of the majority of MPs, Dr Delia is delaying calling a meeting of the group, fearing a “showdown” with MPs. \n“Until now [Friday evening], despite the fact that we start discussing important legislation and need to have a position by Monday, the parliamentary group has not yet been called,” one PN MP said.\nAnother MP added: “It is now clear that Dr Delia does not want to discuss his personal issues, which have spilled onto his public life and are damaging the party. He is clearly fearing that such a meeting will result in a vote of confidence in his leadership, which he seriously risks losing.\"\nThis is no longer about Dr Delia’s future as a party leader but about the existence of the PN\nTimes of Malta is informed that more than half of the PN’s parliamentary group have agreed that they will be in favour of adding their signature to calling on Dr Delia to step down as leader of the Opposition if he asks for a confidence vote.\nIt is also informed that other MPs are also likely to vote against him in a secret vote.\nAlso, two MPs from the Democratic Party and who also form the Opposition in Parliament, Godfrey and Marlene Farrugia, have already declared publicly that they have no confidence in Dr Delia.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down\nDoes Adrian Delia have the support of his parliamentary group?\nAsked on Friday to state when Dr Delia is calling a meeting of the parliamentary group, a PN spokesman did not reply.\nOn Thursday evening, during a reception at the PN headquarters, termed as a show of force in Dr Delia, the majority of PN MPs were conspicuous by their absence. And on Friday night, the Nationalist Party’s Sliema sectional committee  rejected a confidence motion in favour of leader Adrian Delia by 10 votes against three.\nRead: PN councillors 'pressured' to pledge loyalty to Delia\nAn attempt to test the waters prior to calling a parliamentary group meeting, which he needs to do for the PN to function in Parliament, Dr Delia on Friday started calling MPs individually in order to assess their opinion.\n“I am informed that a number of MPs he met already told him straight and plain that he needs to make way if the PN aspires to be a credible Opposition,” a veteran MP said.\nPN sources said that despite Dr Delia and his advisors, mainly general secretary Clyde Puli and his media head Pierre Portelli, are all conscious that he does not enjoy the confidence of many of his MPs, he is resisting resigning and turning the issue into some kind of plot against him by “the old guard”, referring to former PN leader Simon Busuttil and his former deputies.\nHowever, various MPs said this is no longer about Dr Delia’s future as a party leader but about the existence of the PN.\n“Unfortunately, it is clear for all those who want to see that with Delia at the helm and all the allegations he is facing, the PN can never be in a position to garner enough confidence among the electorate to win an election,” an MP said.\n“The PN is there to offer an alternative. If with Delia it can’t be in a position to do this, its game over for us [PN] and for Malta’s democracy,” he said.\nResignation by Adrian Delia? Then what?", "comment_count": 179, "id": 3491}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta quotes the GRTU warning that fuel stations will stop operating unless an agreement is reached over an increase in their margin of profitability. It also reports that a young man who began sexually abusing his cousin when she was just seven years old and raped her when she was 10, had been jailed for 10 years.\nL-orizzont quotes a Learning Support Assistant saying he had to quit his job because he could no longer tolerate the abuse from students. It also focus on the internal strife taking place at the helm of the Nationalist Party. \nThe Malta Independent reports that Marsaxlokk will be holding a poll to decide over the market closure times. It also reports that an EU agreement over car emissions by 2030 will only apply to new vehicles. \nIn-Nazzjon reports about the sale of land worth €800 million in Pembroke for the price of €55 million to the Corinthia Group.", "comment_count": 1, "id": 3492}, {"keywords": "", "author": "", "article_body": "The Nationalist Party’s Sliema sectional committee on Friday rejected a confidence motion in favour of leader Adrian Delia by 10 votes against three.\nThe PN leader is facing increasing internal calls to step down in view of continuous allegations concerning his personal life which have now spread into his political role.\nPN local committees, known as sectional committees, have been asked by the party headquarters to hold urgent meetings in which a motion of confidence in Dr Delia is approved and signed by all committee members.\nRead: PN councillors 'pressured' to pledge loyalty to Delia\nTimes of Malta has received evidence of local committee meetings rushing a motion of confidence in favour of Dr Delia during the past few days.\nOn Friday evening, it also received WhatsApp messages showing party members being deleted by group administrators from group conversations amid distrust over leaks. \nSources sad that an increasing number of PN MPs were considering backing a motion of no confidence in Dr Delia.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down ", "comment_count": 64, "id": 3493}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nationalist MEP candidate Michael Briguglio has endorsed the call made by executive committee president Mark Anthony Sammut for the PN to tackle the serious allegations levelled against its leader Adrian Delia.\n\nHowever, in what can be interpreted as veiled criticism against the approach being taken by party officials close to Dr Delia, he warned that such debate should not take the form of a show of force in the leadership. \n“One cannot simply turn a blind eye to such allegations. What is going on? What is the way forward? These are the questions I am being asked right now during house visits,” Dr Briguglio told the Times of Malta. \nApart from Mr Sammut, the MEP candidate is the only one within the party structures to have publicly called for action on the matter.  \nFor the last few weeks Dr Delia has been facing calls to resign in the wake of domestic violence allegations, issues related to his personal finances and money-laundering claims related to a Soho-based prostitution racket dating back to 2004. \nRead: PN may lack financial strength, but it has determination - Delia\nWhile denying any wrongdoing, the PN leader is insisting that such claims are being levelled by those who did not accept the democratic will of the party members that elected him in September 2017.\nParty sources who spoke to the Times of Malta on condition of anonymity on Thursday said that Dr Delia was expected to appear before the executive committee (the second-highest organ after the general council) and the administrative council which tackles issues of a disciplinary nature, early next week, possibly Monday. However, by the time of writing no date had been set yet.  \nDr Briguglio, a PN candidate for next May’s European Parliament election was asked for his reaction in the wake of an earlier tweet in which he had said that “politics close to the people was done through dialogue and not forcefully”.   \nHis appeal was made as sectional committees, general council members, and various branches are being pressured by officials close to the leadership to publicly declare their absolute loyalty in Dr Delia. \nThis “mobilisation” was also felt in the manner in which an annual festive reception held yesterday evening at the Pietà headquarters was being billed as a show of force in the leadership.   \nOne cannot simply turn a blind eye to such allegations\nWhile not pronouncing himself when asked if he still had trust in the PN leader, Dr Briguglio on Thursday insisted that regardless of his position, the “very serious” allegations against Dr Delia had to be discussed. \n“Such issues are not resolved through a show of force or show of hands, but through a proper debate,” he remarked. \nThe former Alternattiva Demokratika chairman noted that after the 2017 election he had joined the PN as he had felt that the party was open to debate, but at the same time noted that in the current situation certain questions needed to be addressed. \n“I am four-square behind Mr Sammut’s position on the matter. I cannot be a candidate and ignore what the people are saying. Such concerns are being aired across the board even from those who are staunch supporters of Dr Delia,” he said.\nDr Briguglio added that a proper democratic process, warranted proper deliberation. \nMeanwhile, despite his weak support among the parliamentary group, PN sources said that Dr Delia could still manage to forge ahead, at least until May’s elections. \n“While there are at least 14 out of the 28 PN MPs who are ready to make a formal request in writing for the leader to reconsider his decision not to resign, the lack of a succession plan on who would step in to take over, is believed to be the reason behind their decision to stay on the fence,” they said.\nHowever, failure to make any inroads in next May’s elections, might be a bridge too far for Dr Delia, the sources added.", "comment_count": 69, "id": 3494}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The untoward entry of the Archbishop’s name on the crew list of the MV Lifeline prior to his visit to the humanitarian vessel has ended up as the subject of a magisterial decree.\nThe ship’s captain, Claus Peter Reisch is currently facing criminal proceedings for allegedly steering the ship within Maltese territorial waters without the necessary registration and licence, after rescuing 234 migrants who were later allowed to disembark in Malta.\nFollowing that rescue operation in June, the Captain ended up at the centre of court proceedings, while the vessel has since been impounded by Maltese authorities, with only a specified list of persons being allowed on board.\nAny loading or unloading operations, as well as any third parties not mentioned in the crew list, were not allowed on board unless duly authorised by the presiding magistrate.\nFor this reason, on January 5, a revised crew list was deposited in court, indicating Archbishop Charles Scicluna as well as a number of other persons, in what appeared to be an attempt to circumvent the court order.\nThe Archbishop had, in fact, visited the ship in a gesture of solidarity with the NGO’s mission to save lives at sea.\nHowever, that gesture was described by certain quarters of the media as “an act of defiance,” a comment which earned the rebuke of Magistrate Joseph Mifsud who declared that investigations had shown that the Archbishop certainly had no intention of defying court orders.\nHad the Court’s authorisation been sought for the Archbishop to board the vessel, it would certainly have been granted, Magistrate Mifsud stated, deploring the fact that someone “for reasons known only to him”, had interpreted this humanitarian act as one of defiance.\nFor this reason, the court ordered the captain to revise the crew list, whilst calling upon immigration authorities and Transport Malta to verify such a list, as they ought to have done when the Archbishop ended up as a member of the crew though “good sense and logic” dictated otherwise.\nMeanwhile, a sitting scheduled for Friday was adjourned to March after the captain requested leave to visit his ailing mother back home.", "comment_count": 0, "id": 3495}, {"keywords": "", "author": "", "article_body": "The upcoming 5+5 meeting was an opportunity for a frank discussion on pressing matters in the Mediterranean region, Foreign Affairs Minister Carmelo Abela said on Friday.\nMalta will be hosting the 15th Meeting of the Ministers of Foreign Affairs of the 5+5 Western Mediterranean Dialogue on Thursday and Friday.\nThe 5+5 dialogue sees five European-Mediterranean countries; Malta, Italy, France, Spain and Portugal and the North African countries of Libya, Tunisia, Algeria, Morocco, and Mauritania, hold high-level talks.“Mediterranean remains at the essence of our external relations dossier, with the overall objective of bringing peace, stability, and sustainable growth in the region,” Mr Abela said. The aim of the 5+5 dialogue, he said, was to secure closer cooperation between southern European and Maghreb countries\n“The meeting will provide an opportunity for a frank exchange of views on important regional matters that are of mutual and common interest such as the situation in Libya, the Middle East Peace Process, and the Sahel, as well as issues such as migration and climate change,” a government statement read. Delegates will be joined by the High Representative of the Union for Foreign Affairs and Security Policy/Vice-President of the Commission, the Secretary General of the Arab Maghreb Union, the President of the Anna Lindh Foundation, the Secretary-General of the Union for the Mediterranean, and the President of the Parliamentary Assembly for the Mediterranean as observers.", "comment_count": 3, "id": 3496}, {"keywords": "", "author": "", "article_body": "Two bus routes ferrying passengers between Valletta and St Julian's proved to be Malta's busiest in what proved to be a record-setting year for Malta Public Transport. \nLocal buses carried 53.4 million passengers throughout last year, setting a new record, with an increase of 11.3 per cent over 2017, when the company carried 48 million passengers in a year.\nMore than 3 million of those 53.4 million - well over 8,000 every day - hopped aboard route 13/13A buses, which take passengers between Valletta and St Julian's or Baħar iċ-Ċagħaq, passing through Gżira and Sliema as they make their way to their destinations. \nRoutes serving Buġibba and Ċirkewwa also proved popular among bus commuters, with routes to Mater Dei and University of Malta bus stops carrying 13 per cent more passengers than the previous year. \nThe busiest day was August 8, with over 186,000 passengers using buses. This was another record given that the highest amount of passengers that used the bus service in any day in 2017 was 164,000.\n“We are very proud to be carrying 14 million people more than we carried in our first year of operation,” Konrad Pulé, MPT general manager said. “This constant growth in numbers is a clear sign that the confidence in public transport is increasing. Our thanks goes to all our passengers, who are choosing to travel by bus instead of using a car.”", "comment_count": 11, "id": 3497}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A mother and her teenage son were on Friday jointly accused of a series of aggravated thefts from an Mġarr restaurant and a St Paul’s Bay residence late last year.\nMaria Pia Zammit, 34, and her 19-year old son Leon Lee Zammit, from Lija, were charged with three separate instances of aggravated theft at the Mġarr restaurant on November 17 and 29.\nThey were also jointly charged with another theft on New Year’s Eve from a St Paul’s Bay residence, the home of a person reportedly employed at the restaurant.\nThe son was separately charged over another coup at the Mġarr restaurant on the evening of December 13 which, however, resulted in an attempt.\nThe prosecution explained that “several thousands” were reported stolen in both thefts.\nInvestigations by the CID had ultimately zoomed in upon the duo.\nDuring their arraignment on Friday, the mother sobbed miserably as she sat in dock beside her son.\nThe young man pleaded guilty and was granted bail, pending the drawing up of a pre-sentencing report, against a deposit of €4,000, a personal guarantee of €15,000, an order to sign the bail book every day and a curfew between 9.30pm and 7am.\nHis mother, who pleaded not guilty, was remanded in custody, after the prosecution objected on the grounds that civilian witnesses were still to testify and that the woman had an untrustworthy character.\nIn fact, the woman had, earlier in the week, been given a suspended sentence following her arraignment over a number of thefts from hotel rooms.\nThe court recommended that the director of prison provide her with all necessary medical help.\nIn a separate arraignment, 18-year old Samuel Gauci, from St Paul’s Bay, pleaded guilty to having acted as accomplice in the three coups targeting the Mġarr restaurant.\nThe court, presided over by magistrate Simone Grech, heard the prosecution explain how the young man had allegedly chauffeured the mother and son on those three occasions, earning some €300 to €700 for his role.\nThe young man was declared guilty upon his own admission and was given a two-year jail term suspended for four years, being warned to steer clear of further trouble.\nInspectors Shawn Pawney and Mario Xiberras from the CID together with district Inspector Godwin Scerri prosecuted. Lawyer Rachel Tua was counsel to the mother and son. Lawyer Fransina Abela was legal aid counsel to the third accused.", "comment_count": 0, "id": 3498}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Puttinu Cares has earmarked a plot in central London to accommodate most of the Maltese treated in the UK as the numbers continue to increase.\nAt the moment, Puttinu owns 19 apartments and rents another six in Sutton, which mainly host those receiving treatment at the Royal Marsden Hospital.\nRent and maintenance, which includes insurance, local taxes, utility bills, internet services and a Maltese telephone line in each apartment, costs €250,000 a year. This excludes unplanned costs for maintenance, with the most recent expense of €30,000 to repair the roof of a block of apartments.\nRead: Puttinu benefits most from passport buyers' donations\nThe number of patients treated in the UK continues to increase – from 30 to 40 patients a month to between 60 and 90.\n85% of the patients – children and adults – who are flown to the UK for treatment, receive care in central London, away from Sutton. This sees Puttinu spending a further €600,000 to accommodate or partly-sponsor the families of these patients. Number of patients treated in the UK continues to increase\nTreatment could take days, weeks or years, with one particular child having been told he would be spending around eight years there. For this reason, Puttinu has been looking for property in London that would accommodate more than 30 patients and their families, co-founder Rennie Zerafa said.\nThe NGO is adding colour to the Rainbow Ward. Photos: Jonathan Borg\nA plot has been identified in the Euston Road area, just 15 minutes away from Great Ormond Street Hospital on foot. \nThe NGO is waiting on the London planning authorities for the go-ahead.\nIn the meantime, a group of Maltese volunteers have already pledged to help finish the property, which Puttinu plans on being a self-sustainable, Mr Zerafa noted.\nMr Zerafa said the block of apartments could include, among others, office space that could be rented out so that the income covers the maintenance expenses of the apartments. The total cost of the project is expected to reach €25 million, and the donations received so far cover half the cost. \n“We never dreamed there would be so many people seeking treatment in the UK, and we are being very careful with this investment. As they say, measure twice, cut once,” Mr Zerafa said.\nWhile the new investment picks up steam, Puttinu is focusing on adding colour to the Rainbow Ward at Mater Dei Hospital, with each room getting bespoke drawings of cartoon characters.\nDonations of €6.99 can be made on 5061 8939, and donors can also call on 5160 2007 to give €10, 5170 2006 to give €15 and 5180 2008 to give €25. Log on to www.puttinucares.org for more information.", "comment_count": 4, "id": 3499}, {"keywords": "", "author": "", "article_body": "The last month of 2018 was one of sunny skies and relatively warm temperatures, the Malta International Airport meteorological office has noted.\nWeather records show that the sun shone over Malta for 211.7 hours during the last month of 2018, 40 hours more than the norm.\nDecember also saw air temperatures drop from a maximum of 19.4°C, on the 4th and 5th of the month, to a minimum of 5.7°C on the 28th; this being the lowest temperature recorded in 2018. Despite the sharp drop in temperatures, the weather conditions throughout the month remained mild, with an average wind speed of 10.1 knots and only 30.2mm of rainfall, 79% of which was measured on December 1.\nWhile the year ended on an exceptionally bright note, 2018 had fewer hours of sunshine than 2017, but still enjoyed an average of 236.2 hours of sunny skies per month between January and December, amounting to around 65% of all daytime hours during the year.\nJuly was the brightest and the driest month of the year, with 362.6 hours of sunshine and only 0.4mm of dew recorded, whereas the dullest month was February, recording just over 136 hours of sunshine and an average cloud cover of 4.8 oktas.\nThroughout 2018, the Maltese islands received 599mm of rainfall, making the year significantly wetter than the previous two, when 432mm and 324mm of rainfall were measured respectively.\nFollowing a relatively dry start to the year, 181.4mm of rain came pouring down in February, 117mm of which were measured on the 9th, making it the second wettest day in February since 1923.\nOctober not only saw 189mm of rainfall, but also recorded 16 days of thunder, making it the wettest month of the year and the stormiest month ever to be recorded.\nWith an average of 77% humidity, October was also the most humid month last year.\nThe least humid day of the year followed the hottest one for 2018, July 13, when temperatures reached a sizzling 35.7°C.\n \n2018 HILIGHTS\n\n\n\n\nPARAMETER\n\n\nMONTH\n\n\nMEASUREMENT\n\n\n\n\n \n\n\n \n\n\n \n\n\n\n\nBRIGHTEST\n\n\nJULY\n\n\n362.6 sunshine hours\n\n\n\n\nDULLEST\n\n\nFEBRUARY\n\n\n136.7 sunshine hours\n\n\n\n\nWINDIEST\n\n\nMARCH\n\n\nMean wind speed: 11.2 knots\n\n\n\n\nCALMEST\n\n\nSEPTEMBER\n\n\nMean wind speed: 6.4 knots\n\n\n\n\nWETTEST\n\n\nOCTOBER\n\n\n189mm\n\n\n\n\nDRIEST\n\n\nJULY\n\n\n0.4mm\n\n\n\n\nMOST HUMID\n\n\nOCTOBER\n\n\n77%\n\n\n\n\nLEAST HUMID\n\n\nJULY\n\n\n64%\n\n\n\n\nCLOUDIEST\n\n\nFEBRUARY\n\n\nAverage cloud cover: 4.8 oktas\n\n\n\n\nLEAST CLOUDY\n\n\nJULY\n\n\nAverage cloud cover: 0.8 oktas\n\n\n\n\n ", "comment_count": 0, "id": 3500}, {"keywords": "", "author": "", "article_body": "Members of the European Parliament from across political groups have called on the European Commission to condemn Turkey’s actions against journalist Pelin Ünker.\nMs Ünker was given a 13-month jail sentence after she was found guilty of defaming and insulting former Turkish Prime Minister Binali Yildrim and his two sons.\nShe had revealed that Mr Yildrim’s two sons owned two companies in Malta.\nTheir ownership of these companies was revealed in the 2017 Paradise Papers leaks.\nThe MEPs urged the Commission to ask the Turkish authorities to reconsider the actions taken and drop the charges against the journalist.\nMEPs David Casa (EPP Group), Ana Gomes (S&D Group), Monica Macovei (ECR Group), Maite Pagazaurtundúa Ruiz (ALDE Group), Benedek Jávor (Greens/EFA Group) and Stelios Kouloglou (GUE/NGL Group) sent a letter to the European Union vice-president Federica Mogherini, insisting that the actions taken against Ms Ünker were not compatible with a country striving for EU accession.\nMr Casa said “We have been working to protect journalists across Europe for the past months, through several initiatives, including that of pressuring the Commission to introduce anti-SLAPP legislation.\n\"We cannot allow a situation where a country which aspires to become a member of the European Union treats journalists in this manner. We will not stop here. We want journalists to do their jobs, and we will do everything we can to ensure that investigative journalists are protected.”", "comment_count": 17, "id": 3501}, {"keywords": "", "author": "Ivan Martin", "article_body": "MEP Miriam Dalli’s mission to curb transport emissions across the EU enjoys wide-ranging support from environmentalists and every-day citizens, but the matter does not appear to have gone down well with Malta’s car sales lobby.\nThe MEP’s ambitious plan to cut carbon dioxide emissions from cars and vans by nearly 40 per cent by 2030 was given the thumbs up by the European Union last month.  Miriam Dalli has spearheaded efforts to cut vehicle emissions across the EU.\nHowever, while many have described the achievement as a feather in Dr Dalli’s cap, the move seems to have irked Malta’s new car importers.\nA debate organised in Valletta on Friday saw car importers describe the emissions drive as “unfair”.\nA representative of the Mizzi Organisation, one of Malta’s main importers of new vehicles, told audience members that 60 per cent of cars sold on the island were second-hand.\nAs the Dalli-led emissions policy focuses on new vehicles, it risked pushing more drivers towards buying used cars, he argued.\n“New cars also produce less emissions than second-hand options, so isn’t this all a bit of a contradiction?” the debate heard.\nResponding, Dr Dalli said that new cars would eventually become second-hand cars tomorrow. The argument failed to convince the car dealers.\n\nResistance to EU plans\nThe EU last month agreed a compromise over how sharply to curb carbon dioxide emissions from cars and vans, finally settling differences between car-producing countries and more environmentally conscious lawmakers.\n“We reached a compromise to cut emissions from cars by 37.5 percent and vans by 31 percent by 2030,” European energy chief Miguel Arias Canete has said.\nThe EU has been divided for months over how strict to be on CO2 emissions from cars and vans. Germany, with the bloc's biggest auto sector, has warned that tough targets could harm industry and cost jobs.\nMember States will take a vote on 16 January, followed by the European Parliament, however this would be little more than a formality, Dr Dalli said.\nThe Labour MEP, who spearheaded the proposal as rapporteur in the Parliament’s environment committee, is no stranger to resistance from the auto lobby.\nShe told this morning’s debate how she had eventually opted for a compromise on the emissions targets, for fear that Member States would buckle to immense pressure from car manufacturing giants if the matter was dragged out any further.\nThe debate also heard citizen’s concerns about a lack of infrastructure to support electric vehicles.\nIt was all well and good to encourage the use of cleaner transport options, but unless you owned a garage, charging your electric vehicle was near impossible on the island today.\nThe capital city, which attracts thousands of cars every day, for instance, only had one charging point with just one outlet, a member of the audience pointed out.\nOne suggestion to come from the floor was the possibility of introducing parking meters and exempting green vehicles to encourage use.\nAnd why not direct funds from the scrappage scheme to help finance power assisted bicycles?\nThe General Workers’ Union boss Josef Bugeja, also speaking form the audience, said Malta’s workforce needed training to fill the green jobs this new policy direction would likely create over the years.\n600 vehicle charging points in the pipeline\nA representative of the Transport Ministry offered a glimpse of the future, saying Malta would have some 600 electric vehicle charging points across the country by next year.\nEarlier during the event, Claire Bonello, who chairs the Scientific Advisory Council for the Environment and ENGO Council said the scientific community had long been investigating the effects and impacts of climate change in the EU.\nRecent studies showed that even a 1.5 degree increase in the average Maltese temperature would result in heat deaths.\nClimate change would have an impact on Malta in other ways as well, including coastal flooding, water scarcity, extreme weather events, invasive species, problems for fisheries and aquaculture, and have negative impacts on marine biodiversity.", "comment_count": 74, "id": 3502}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg  ", "article_body": "A young man began sexually abusing his cousin when she was just seven years old and raped her when she was 10, a court ruled on Friday. The man, who is now 25, sat stunned and expressionless as Madam Justice Consuelo Scerri Herrera expressed disgust at his “barbaric and animal-like” behaviour and sentenced him to a decade behind bars. Photo: Shutterstock\nMadam Justice Scerri Herrera said she found the victim – who had testified earlier this week via video-conferencing – credible and consistent, and said that the way the abuse had come to light was symptomatic of a genuine case. Years had passed yet she still recalled instances of abuse in detail, and her fears of breaking up the family if she spoke up had proven to be well-founded, the judge noted. In a harrowing court sitting, the victim, who is now 16, had told the court that she had kept quiet about the abuse because she had lacked the courage to report it and feared breaking up her family. “It did happen, I swear,” she told the court. “I faked a smile for seven years. I have a great sense of guilt. My self-esteem has suffered.”When prodded by the judge, she had admitted to having once made a sexual advance towards her cousin, telling the court “I don’t know what came over me that time. I dropped a hint and he touched my private parts. Then I regretted it.”\nThe abuse happened at the house of the victim’s grandmother in Marsa, where her older cousin lived and where she would spend time while her mother was at work. He began abusing her as a teen and continued to do so for seven years, with the sexual violence culminating one day when he had pushed her onto a washing machine and raped her. She was 10 years old at the time and he was 19. Police told the court it appeared the girl had not realised for a long time that she was being sexually abused. She had told investigators she had only realised that what he did to her was wrong after lessons at school, police testified. The victim’s maternal family had turned on her after she reported the abuse, the court noted. In a series of testimonies earlier this week, relatives painted her in an extremely negative light.“She is a bit of a duttura,” an uncle of hers told the court, with other relatives calling her “supperva”, “bossy” and “the jealous type”. In her judgement, Madam Justice Scerri Herrera noted that relatives seem to have been summoned to “add colour” – a defence tactic which the court appreciated was permissible. Nevertheless, there was no reason for the court not to believe the victim’s version of events, Madam Justice Scerri Herrera said.\nShe said that the accusations of rape, sexual acts with a minor and defilement had been proven and found the accused guilty of the charges.\nThe lewd acts had happened over a seven-year span and were aggravated by their frequency and the victim’s young age, she said.\nShe sentenced the accused to a 10-year effective jail term and placed a protection order in the victm’s favour.\nThe court ordered a ban on the name of both the victim and the accused.\nThe accused is expected to appeal the judgement. \nLawyers Nadia Attard, Matthew Xuereb and Charles Mercieca from the AG’s Office prosecuted.", "comment_count": 0, "id": 3503}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Friends of Terry Farrugia, including a number of media personalities, have come together to help raise €500,000 for the radio veteran’s leukaemia treatment.\nMr Farrugia, a father of two boys aged eight and 10, was diagnosed with Acute Myeloid Leukaemia in 2016, when he was hospitalised and given his first line treatment of four rounds of chemotherapy.\nThe aim was to wipe out the faulty bone marrow and hopefully allow healthy tissue to grow back. Meanwhile, doctors started looking for a bone marrow donor to provide more security in ensuring that the cancer does not return.\nUnfortunately, there was no suitable donor on the international database.\nBy then, Mr Farrugia had gone into remission and was sent home in September 2016.\nAfter just over a year, Terry and his family received the dreadful news that the disease had returned.\nThe next line of treatment was more aggressive chemotherapy and this time a bone marrow transplant was not an option, but a must.\nStill not having located a suitable adult donor, his only option was to have a transplant in the UK from cord blood, which provides a finite amount of stem cells.\nHe underwent a transplant in March of 2018 and this involved more chemotherapy and some radiotherapy.\nSeveral radio personalities have come together to help Terry.\nRecovery seemed slow, but Mr Farrugia persisted and started to regain strength after a couple of months. The first test results indicated that the transplant had been a success with no disease detected.\nHowever, soon after, it was confirmed that Mr Farrugia had relapsed. As the transplant donor was cord blood, there was no possibility to return to the donor to harvest more stem cells.\nThe doctors decided to source another drug, a type of chemotherapy that specifically targets mutated cells. This drug, donated by the pharmaceutical company producing it on compassionate terms, was successful in targeting the leukaemia and putting him back into remission.\nFour months after being given the more targeted chemotherapy drug, Mr Farrugia relapsed again.\nGiven that his disease is acute and therefore time is of the essence, several centres were contacted about the possibility of him receiving further treatment.\nOne such centre, based in Houston, Texas, is interested in offering Mr Farrugia treatment. He flew to the US earlier this week, but the financial burden is huge.\nUp until now Mr Farrugia’s treatment was supported by the Malta Community Chest Fund, Puttinu Cares, the Treatment Abroad section of the health department, the Haematology Team at SAMOC, the Maltese High Commission, the Ladybird Foundation and close friends of the family, such as fellow parents from San Anton School and Melita Football Club.\nThe only way for this treatment to go ahead is for Mr Farrugia’s family to cover the expenses.\nTerry with his wife Krista.\nWith the assistance of CSB Trustees and Fiduciaries Limited, a trustee company licensed by the MFSA, a trust account has been formally set up in order to help raise funds the family needs to pay for the treatment in the US.\nA police licence has been obtained and a board has been appointed in order to ensure the proper management of the funds collected.\nDonations can be made through paypal by using donations@terrytime.org or via Bank Transfer: Terry Time Trust Bank Account, c/o CSB trustees & fiduciaries Ltd; Bank of Valletta PLC; account number 40025136757; Iban number mt77vall22013000000040025136757 and swift: vallmtmtMore information on https://terrytime.org/\nTerry’s radio careerMr Farrugia started his radio career on Island Sound Radio in the early 1990s with his popular programme Terry Time. He then moved his radio show to Bay Radio, where he eventually ventured into management, later moving on to 88.7 Vibe FM. He has been running Vibe FM since 2009.\nApart from managing radio stations, Terry has also trained many local presenters, supported local bands, and been repeatedly invited to speak and deliver presentations at international broadcasting conferences in various cities throughout Europe including Rome, London and Athens.\nIn 2004 he was instrumental in launching radio awards that recognised local talent, the BMAs, with all proceeds raised being shared among a number of children’s charities.", "comment_count": 54, "id": 3504}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Education Minister Evarist Bartolo cautioned against outlandish statements over security at schools, but also warned that the problem of aggression should not be brushed off.\nSpeaking to Times of Malta after the teachers’ union published the results of a survey among 183 members, Mr Bartolo called for a realistic approach.\nOn Thursday, MUT said that nearly nine out of every 10 teachers who spoke to the union said they had experienced aggression at their school over the past two years.\n“Even one case a day is worrying, however, I will not base my comments on MUT’s survey,\" the minister said on Friday.\n“If I did that, I would say that the survey was not sound because if you want to understand what 9,000 educators go through on a scientific level, the methodology would be different.”\nHe noted he was not going to get lost over the methodology of the survey because even one case of aggression was unacceptable.We are not in some warzone where people are dying every day\nMr Bartolo insisted that the authorities would not protect anyone who verbally or physically attacked educators or school staff.\n“We are against all aggression on anyone, however, aggression is even more shocking in an educational environment.”\nThe Education Ministry announced on Friday that educators can report aggression directly on the portal www.edu.gov.mt/support\nMoreover, €280,000 were allocated in the last budget for security systems at schools. \nThe minister does not believe there should be a security guard at every school, as security needs varied across different schools. These included CCTV systems or people who specifically helped out with security issues.\n“Wherever there is a need, we should ensure that there is a security guard. However, we should not go from one extreme to another – neither allow a free-for-all nor turn schools into high-security prisons.”\nThe government was willing to take all necessary steps to strengthen security at schools, discuss such issues with MUT and shoulder responsibility.\n“I think the most important thing is that we are realistic and see things as are - neither say that there is no problem at all, nor that we are in some war zone where people are dying every day.”", "comment_count": 24, "id": 3505}, {"keywords": "", "author": "", "article_body": "Sustainable development should form part of the prime minister’s portfolio, as various ministries are too focused on their own remit to respond to sustainability issues, the Church's environment commission said.\nIt stressed that having the issue within the Ministry for the Environment, Sustainable Development and Climate Change reinforced that this was only to do with ‘environment stuff’ whereas issues such as the excessive number of private cars populating our roads and the negative impacts on sustainability of the construction industry are “the root cause of problems”.\nThe Church’s Interdiocesan Environment Commission (KA) on Friday issued its submission in the consultation exercise related to Malta’s Sustainable Development Vision for 2050 which was carried out last November.KA suggested the setting up of a parliamentary committee made up of both sides of the House to decide on a national sustainable development strategy with its accompanying policy actions, stressing that it might require positive discrimination of policies to safeguard the environment and promote social wellbeing over short-term economic gains.\nIt said that the consultation paper had also not sufficiently explored concepts of ‘carrying capacity’ and ‘limits to growth’.\n“One needs to examine whether what goes into increasing our Gross Domestic Product is in fact contributing to the sustained wellbeing of current and particularly future generations,” it stressed.", "comment_count": 17, "id": 3506}, {"keywords": "", "author": "", "article_body": "The Criminal Investigation Department has managed to solve two robberies, and plan to charge the perpetrators later on Friday.\nThree people were involved in the crimes, which took place from a restaurant in Mġarr and from a residence in St Paul's Bay.\nMore later.", "comment_count": 0, "id": 3507}, {"keywords": "", "author": "Edwina Brincat, Herman Grech", "article_body": "Daphne Caruana Galizia's murder suspects were back in court on Friday as the compilation of evidence against them resumed.\n1.30pm: The case has been adjourned until February 15.\n1pm: Officers are now testifying on the evidence they collected on site.\n11.30am: The sitting has been adjourned for a while. \n11.20am: Three experts from the police forensics team take the stand together saying they had checked firearms and ammunition elevated from Żebbuġ.\n11.15am: Other items were elevated from a Mosta farmhouse, close to the scene of the crime. These included packaging tape, binoculars and a monoscope also found in Ford Transit. Mr Hughes says items must first be photographed, examined visually and then tested for fingerprints.\n11.08am: Items, including car plastic parts bearing fingerprints, are handed over to the court.\n10.57am: Former police sergeant Jeffrey Hughes who was appointed court expert into the murder, takes to the stand. He says he examined plastic parts from the scene of the crime in Bidnija as well as around 11 CDs of material.\n10.53am: Two police fingerprint and photo experts present a report, CDs and four volumes of photos to the court.\nThe scene of the crime just minutes after the blast. Photo: Mark Zammit Cordina\n10.50am: Expert is going through dossier of photos of the vessel. Defence lawyer keeps insisting that he cannot see the name 'Wellcraft' even on the enlarged photo. Expert says it was clearly visible in the footage studied.\n10.40am: For more than an hour experts have been testifying about the identity of a boat which was spotted going in and out of the Grand Harbour on the day of the murder. Investigators believe a text was sent from the Maya, which allegedly detonated a bomb placed under the driver’s seat of Caruana Galizia's car.\n10.30am: The defence keeps trying to shed doubt on whether the boat in the footage was actually the Maya. \n10.10am: Another expert testifies and says the boat is currently kept in a hangar under police custody. He says that besides basic model, the vessel had other distinctive features on the exterior. Besides, the Martinique 2800 is the only model in Malta.The Maya, from which the bomb is believed to have been detonated.\nHe confirms that the boat in the footage was the same held by the police.\n10am: Asked if he could spot any individuals on board, the IT expert again replies in the affirmative. \"In stills the person’s face was visible. There were others with him,\" he replies.\n9.55am: Defence lawyer asks whether the boat could be identified by its name. The IT expert says the name was on the front of the boat and zooming into the images made it clear.\n9.50am: First witness is IT expert Keith Cutajar who was to determine time when the Maya vessel entered Grand Harbour. He says the boat’s name was clearly visible in the footage he inspected, and recordings showed its movements in and out of the harbour.\nWhat we know so far:\n\nMs Caruana Galizia was killed in a car bomb blast in October 2017, close to her home in Bidnija.\nTwo months later, police arrested 10 men in connection with her murder. Three of those - Degiorgio brother Alfred and George, and Vincent Muscat - were charged with her murder. The others were released on police bail without charge.\nThe bomb - between 300gr and 400gr of TNT - was an improvised explosive device clearly intended to kill the journalist.\nNational security information system unit officer explained how information was collated from the various calls, determining the time and location they were made.\nThe FBI helped to home in on suspicious phone numbers. One was linked to a remote-controlled device and went active at 2am in Bidnija on the day of Ms Caruana Galzia's murder. It received an SMS at the time the bomb went off and immediately went off-radar.\nTriangulated cell tower data to work out that the killer SMS was sent from out at sea. George Degiorgio was seen going fishing on that day, and shortly after the bomb went off texted his partner \"buy me wine, my love.\"\nExperts received reports of a suspicious car regularly parked by tat-Tarġa Battery - an ideal vantage point for the killers - in the days leading to the murder. The car was subsequently never seen there again. Police found a \"fresh-looking\" cigarette butt with Alfred Degiorgio's DNA on it under a tree at the tat-Tarġa vantage point.\n\nRead: How phone data helped police home in on suspects\nThe key courtroom players:\nMartin Fenech is appearing for Vince Muscat, known as il-Koħħu, 55.\nWilliam Cuschieri and Martha Muscat are appearing for Alfred Degiorgio, known as il-Fulu, 53.\nJosette Sultana is appearing for Alfred's brother George Degiorgio, known as iċ-Ċiniz, 55.\nPhilip Galea Farrugia from the attorney general's office and inspectors Keith Arnaud and Kurt Zahra are appearing for the prosecution.\nJason Azzopardi and Therese Comodini Cachia are appearing parte civile.\nRead: Who was Daphne Caruana Galizia?\n ", "comment_count": 0, "id": 3508}, {"keywords": "", "author": "", "article_body": "Minister Owen Bonnici has been ordered to pay €66,667 in damages to a man he hit with his car back in 2014.\nIn a civil court judgement handed down on Friday, Mr Justice Lawurence Mintoff ruled that the incident victim, Alies Abdulhadi, should receive €65,894 in compensation and a further €772 for expenses incurred as a result of the incident.\nThe minister will, however, not end up out of pocket directly, with his insurer having previously told the victim that it would pay any amounts due to him.\nIn a statement, Dr Bonnici said that he was fully insured and that he had not opposed the civil case.\nMr Abdulhadi, a 26-year-old engineering student at the time of the incident, was hit by Dr Bonnici while he was standing in front of his car, which had stopped after developing a fault, just past the Sta Venera tunnels. The incident happened in April 2014. \nDoctors found that his tibia was broken, his knee badly twisted and ligaments torn, and a medical expert testified that he was more likely to develop arthritis due to the damage. A medical expert testified that he had suffered a 12 per cent permanent disability.\nA criminal court had exonerated the minister of any criminal responsibility in the incident, but Mr Abdulhadi had subsequently filed a civil suit for damages after failing to reach a settlement with Dr Bonnici’s insurers.\nAs a result of the crash, Mr Abdulhadi told the court, he could no longer jog, play football, walk for any significant distance, lift heavy items or stand among crowds of people.\nIn his judgment, Mr Justice Mintoff found that Mr Abdulhadi would have been likely to earn a minimum of €20,000 a year if he were to work as a warranted engineer within the public sector, and set a 30-year multiplier when calculating damages due to him.\n ", "comment_count": 0, "id": 3509}, {"keywords": "", "author": "", "article_body": "Partit Demokratiku has challenged the seven officials involved in Simon Busuttil’s allegations of money-laundering to ask for an independent inquiry to clear their names. \nJudge Giovanni Grixti recently threw out the allegations – which stemmed from the Panama Papers - as not being sufficient to justify an inquiry.\nRead: Busuttil assessing options after request for inquiry turned down\nBut PD deputy leader Timothy Alden said that the officials were “ pretending that their names have been cleared”, because they had succeeded in blocking an independent investigation from taking place.\n“There can be no exoneration without investigations which make the full truth being public knowledge. Furthermore, it is crucial to be on guard against investigations with incomplete or narrow remits, as the decisions which result from them are made using incomplete information,” he said.\nRead: Reactions as court rejects Simon Busuttil’s request for a Panama Papers inquiry\n“The Labour Party is contradicting the Prime Minister, who insisted that Malta will await the results of an ongoing magisterial inquiry into 17 Black before coming to any conclusions. Is the Labour Party contradicting the Prime Minister? What of the FIAU investigations? Furthermore, it is crucial to know the remit of any investigations before trusting their conclusions. It is for this reason that I ask Konrad Mizzi, Keith Schembri and all others who appealed against an investigation, to voluntarily call for and accede to a fully independent investigation. Otherwise, we shall have no closure.\"\nMEP candidate Anthony Buttigieg added: \"Partit Demokratiku is of the opinion that politicians who claim they are innocent should not shy away from undergoing a genuine judicial due process, which would exonerate them, unlike was seen with the Crowe Howarth inquiry in which the accused got to set the remit himself. Someone who is innocent would welcome such probing to clear his or her name.\"", "comment_count": 119, "id": 3510}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority has approved plans to convert the scheduled Villino Zammit on Sliema’s High Street into a boutique hotel, including additional floors on part of the building.\nThe proposal was originally recommended for refusal, amid objections from heritage groups and the Sliema local council, due to its height, use and aesthetics. \nConcerns were also raised by objectors over the demolition of an old wall along St Nicholas Street, at the back of the site. \nHowever, at a hearing last year, the majority of the PA board indicated they would approve the application after revised plans were submitted eliminating one of the proposed floors, as well as retaining the villa gardens. \nThe board gave the final go-ahead to the proposal at a hearing on Thursday despite objectors’ sustained opposition. Finalised feedback from the Superintendence of Cultural Heritage (SCH), requested by the board at a prior hearing, was not presented before the decision was made. \nThe heritage watchdog had previously warned that the development would affect the character of the Grade II scheduled building, which dates back to the late 19th century and was de-signed by acclaimed architect Francesco Zammit. \nObjectors, including the Sliema Heritage Society and Din L-Art Ħelwa, highlighted concerns during the hearing over the project’s visual impact and the demo-lition of an old ‘rubble wall’ along St Nicholas Street. \nHeritage groups say the old wall was part of the original villa design and unique to the Sliema streetscape.  It will be replaced by a new screen wall designed to mimic a traditional Maltese streetscape.\nThe groups welcomed, however, the decision to retain the villa’s gardens, having previously called on the PA to grant them scheduling status to ensure their protection. Plans to extend a driveway into the front garden were dropped and interventions in the back garden significantly scaled down.\nThe approved permit follows another issued in 2014 for the building to be restored as a residence, and for a swimming pool to be built in the garden. An earlier 2003 application to convert the villa into a casino and restaurant was withdrawn by the applicant. \nVillino Zammit was built in the late 19th century by philanthropist Alfonso Maria Galea and his brother-in-law Agostino Borg Cardona, together with the neighbouring Betharram (now Fatima House), on the gardens of the now-long-demolished Hunter’s Palace which belonged to both men.", "comment_count": 28, "id": 3511}, {"keywords": "", "author": "", "article_body": "Teachers are being encouraged to report any aggression or inappropriate behaviour on a new portal, which all report to be followed up by the Directorate for Educational Services.\nThe government said on Friday that the some of the reports made on the portal, www.edu.gov.mt/support, could be published at the end of each scholastic year.\nThe Education Ministry was reacting to a report by the Malta Union of Teachers on Thursday which said that nearly nine out of every 10 teachers told their union they have experienced aggression at their school over the past two years.\nAt least a fifth, or 23 per cent, claimed they experienced aggressive behaviour daily, while another 23 per cent said they did so every week.\nThree quarters of those who experienced such behaviour said the perpetrators were students,\nThe ministry said that €280,000 had been allocated in the last budget for security systems, with training programmes in places for staff, complemented by the Employee Support Programme already available for all civil servants.\nIt reiterated is zero tolerance approach to aggression, and said that current penalties would be harshened.", "comment_count": 42, "id": 3512}, {"keywords": "", "author": "", "article_body": "The GRTU has warned that fuel stations might be taking industrial action in the coming days, as protest over discussions which have been dragging on since 2014.\nThe chamber that represents small businesses said that the government had actually reneged on some of the things that had already been agreed.\nThe GRTU had conducted a survey in 2014 which had demonstrated some of the pressures being faced by operators because of infrastructural requirements due to new regulations, which had to be in place by 2020.\nIt accused the minister, Joe Mizzi, of dragging his feet in spite of numerous meetings, and warned that it was willing to escalate the situation.", "comment_count": 27, "id": 3513}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe Times of Malta reports on a survey done by the Malta Union of Teachers, which finds that most teachers are the victims of aggression at school, with three-quarters of the perpetrators being the students themselves.\nThe Malta Independent features the court testimony given by minister Konrad Mizzi about the 17 Black ownership, as well as the challenge by PN secretary general Clyde Puli for those who are against the current party leader to come forward.\nL-Orizzont reports on the possibility that Chris Said would be made an interim leader of the Nationalist Party until May, and also features a round-up of the influenza situation, saying it was not as bad as in previous years.\nIn-Nazzjon, in the meanwhile, reassures its readers of the great support for leader Adrian Delia as witnessed by the great turnout at the party headquarters on Thursday.", "comment_count": 0, "id": 3514}, {"keywords": "", "author": "", "article_body": "People who wanted a genuine voice to speak on their behalf would find this in the Nationalist Party, Opposition leader Adrian Delia said during an activity for activists and volunteers.\nHe said that at Christmastime it was clear that malicious attacks against him and against the PN had been embarked upon. Instead of escaping, he went to meet and speak to the people, the homeless, those who lacked food and those who suffered in solitude. In doing so, he learnt what the real Christmas message was.\nHe thanked all those who were supporting him and his family.\nThe PN, Dr Delia said, was a party of good, tolerance and one that did not believe in corruption. It lacked financial strength but it had conviction and determination.\nHe invited all those of good will to join the PN for there to be a strong Opposition against the corrupt government.\nDr Delia said that the PN would continue to defend the value of life and the unborn. It would continue to fight corruption and to return the hospitals to the people.\nIt would not stop speaking out about the way Minister Konrad Mizzi wanted to give public land to the private sector free of charge for speculation and development. A new Nationalist government, he said, would ensure there would not remain one homeless person in Malta.\nIt would also help those who were doing well and those who were not, those who were in financial difficulties, the pensioners and the weak.", "comment_count": 19, "id": 3515}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "One of Prime Minister Joseph Muscat’s spokesmen has been appointed to the board of a new authority for which he also serves as mouthpiece, Times of Malta is informed.\nNigel Vella\nNigel Vella, who until the last general election was the Labour Party’s official spokesman, was appointed by Digital Economy Parliamentary Secretary Silvio Schembri to serve as a governor of the board of the newly-established Malta Digital Innovation Authority, tasked to act as the regulator of the blockchain industry on the island.\nMr Schembri’s portfolio, including the authority, is overseen by the Office of the Prime Minster, for which Mr Vella works.\nThe latest appointment will boost Mr Vella’s public remuneration by an extra €3,500 a year, in addition to his already generous taxpayer-funded salary as part of the OPM’s spokesmen team.\nIt is not yet known what expertise Mr Vella holds in the blockchain industry.\nAsked to state whether members of the board of governors, who are already on a government salary either through normal employment or as persons of trust, still receive the governor’s honoraria (€3,500 a year) over and above their salary, a spokeswoman for Mr Schembri confirmed that this was the case.\n“Persons who are nominated on the board in their personal capacity and not in representation of the entity they work for, are entitled to a remuneration as per standard procedures,” she said.\n“This procedure is the same one adopted under previous administrations,” she claimed.\nTimes of Malta is informed that under previous National governments, board members of public entities who were already on the government’s payroll either as civil servants or members of ministry private secretariats were not entitled to receive any extra remuneration as board members.\nAccording to this practice, membership of public boards by civil servants or other employees on the public payroll was considered to be part and parcel of their official duties.\nIn most cases, board meetings are held during normal working hours.\nMr Vella joined the OPM’s spokespersons team immediately following the 2017 election as a person of trust of Dr Muscat.\nAll five members of the team, led by former Labour spokesman Kurt Farrugia, are employed on a person of trust basis and receive tens of thousands of euros in remuneration and allowances.\nAll members, except one, used to be directly employed by the Labour Party prior to the 2013 general election.\n ", "comment_count": 26, "id": 3516}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Opposition MP Claudio Grech has been awarded €4,000 in two libel suits against the PL media over a story alleging that on the eve of the 2013 general elections, he had attempted to silence a whistleblower in relation to the oil scandal.\nThe facts stemmed from a front page article in the June 12, 2016 issue of Kullħadd based on an affidavit wherein Christopher Farrugia, the nephew of George Farrugia, who was at the centre of the oil scandal story, had stated that Mr Grech had asked him to disassociate himself from the story which was “greatly damaging Austin Gatt”.\nAt that time, Mr Grech worked in the private secretariat of Minister Gatt, while Chris Farrugia, as CEO of John’s Group of Companies, hailed from a well-known Nationalist family.\nThe affidavit had been seized upon by the PL newspaper Kullħadd which published an article titled “Tried to silence a Whistleblower,” later also reported on One News.\nIn the course of the libel proceedings, a different reality emerged, based upon evidence put forward by the applicant during his testimony in court as well as in the form of transcribed extracts taken from a secretly recorded conversation between a third party and Chris Farrugia, which document was allowed as evidence in the suit.\nThe respondent, Aleander Balzan, then-editor of the PL media, had never showed up and never put forward any evidence, in spite of being given one final chance by the court to do so in November, before the cases were put off for judgment.\nIt resulted that it had been the CEO of John’s Garage who had actually requested a damage-limitation meeting with Mr Grech to ask him for a helping hand in avoiding further negative publicity for the company, given his uncle’s involvement in the alleged corruption linked to the scandal.\nFaced with this request, Mr Grech had urged Chris Farrugia to take all data, retrieved from his uncle’s office computer, to the police “so that the truth might emerge and whoever was involved in acts of bribery would be held responsible”.\nThe court, presided over by magistrate Francesco Depasquale, observed that the investigative journalism, claimed by the respondent, had stopped abruptly once the story was made public.\nAn affidavit published by Mr Grech the following day was not given importance by the PL media, leading the court to observe that the story had only been intended to cast a negative light upon the applicant rather than to present “truthfully and honestly” facts, allowing the public to draw its own conclusions.\nThe court stressed the need for journalism to be not merely “investigative but also independent”, which, given current polarisation and manipulation existent both locally and beyond Malta’s shores was “a rarity and an exception”.\nGiven various considerations, including the serious nature of the allegations levelled against the applicant, which could have brought upon him legal consequences if proved true, the court upheld the libel claims, ordering the newspaper and One TV to pay €2,000 each by way of damages.", "comment_count": 0, "id": 3517}, {"keywords": "", "author": "Ivan Martin", "article_body": "Former Opposition leader Simon Busuttil is assessing his options after his request for a magisterial inquiry into the Panama Papers was turned down. \nThe Criminal Court on Tuesday said that Dr Busuttil had failed to indicate sufficiently that any crime had been committed, in his request for the protagonists of the data leak to be investigated. \nIn July 2017, Dr Busuttil had asked for a magisterial inquiry to be opened into the allegations. At the time, Magistrate Ian Farrugia had found that there was enough reason to justify an inquiry, but appeals had been immediately filed against that decision by Prime Minister Joseph Muscat, Tourism Minister Konrad Mizzi, OPM chief of staff Keith Schembri, Nexia BT’s Brian Tonna and Karl Cini, and businessmen Malcolm Scerri and Adrian Hillman.\nMr Justice Giovanni Grixti said in this week’s judgment that Dr Busuttil had given a number of facts which in themselves did not indicate any wrongdoing. He, therefore, overruled Dr Farrugia’s decision and said an investigation was not justified.\nHow on earth can we get justice served in Malta?\nContacted for a reaction on Wednesday, Dr Busuttil said he found the decision “unbelievable”.\n“You would never expect a court to turn down a request to start an inquiry when a top minister and the Prime Minister’s very own chief of staff were caught red-handed with a secret company in Panama to channel €5,000 a day from the owner of the power station,” he said.\nThis week’s decision, he said, begged the question: “How on earth can we get justice served in Malta, if all our institutions are refusing to investigate the corrupt even in the face of damning evidence in the public domain?”\nThe sentiment was also reflected in a tweet Dr Busuttil uploaded shortly after the judgment was published.\nDr Busuttil said he was still looking at what avenues for justice were available. \nOne possible way could be the Constitutional Court, however, this would see the case drag on for quite some time. \nMeanwhile, Dr Mizzi has formally dropped the constitutional case he had filed last month aimed at blocking an inquiry.\nDr Mizzi had claimed that his fundamental rights had been breached in the judicial process, but withdrew his request after this week’s judgment.\n ", "comment_count": 213, "id": 3518}]