[{"keywords": "Government, Justice, Parliament", "author": "", "article_body": "The State Advocate Bill was “anti-European” and failed to address what the former dean of the Faculty of Laws, Kevin Aquilina, called a “constitutional mess”, Nationalist MP Simon Busuttil said on Tuesday.\nRELATED STORIESOpposition to vote against plans to split attorney general's functions\nThe Bill was heavily criticised in the House by Dr Busuttil and fellow MP Jason Azzopardi, who both reiterated the Opposition’s fundamental disagreement with the government’s failure to ensure the Attorney General and State Advocate were appointed by parliamentary consensus.\nAccording to Dr Busuttil, the law was a “smokescreen”, which the government had only brought before the House because of pressure from European authorities.\nResponding to Economy Minister Chris Cardona, who said the dual role of the Attorney General had been exercised since 1936, Dr Busuttil said this government had found an Attorney General who had been happy to bow his head and comply with the government’s wishes, contrary to his constitutional role.\nThe failure by Attorney General Peter Grech to do his duty or else resign was why the Opposition insisted that the role of director of public prosecutions and of legal counsel to the government be split up.\n“It had been clear since Labour’s accession to power in 2013 that all institutions were at the beck and call of the Prime Minister,” Dr Busuttil said.\nIn particular, the Bill was inadequate because it gave the Prime Minister control over the two offices, which it would create or modify, he added. \nThe role of public prosecutor merited extra assurances of autonomy or independence, for which the litmus test would ultimately be the willingness of the chosen candidate to take steps against a minister suspected of corruption. \n“Without independence, the law would weaken the rule of law instead of strengthening it,” Dr Busuttil insisted.\nDr Azzopardi called the law “a chimera”, which did nothing for the rule of law. It was “shabby”, confused concepts and contradicted established European constitutional doctrine. He attacked what he termed a “Henry 8 clause” which, he said, would allow the minister to amend the law by means of a simple legal notice.\nAll institutions are at the beck and call of the Prime Minister\nThe nomenclature “Attorney General”, he added, was normally reserved in Commonwealth countries to refer to the chief legal adviser to the Government and not to the director of public prosecutions, which the new Attorney General would be. \nHe said the AG would retain the power to chair various important judicial and investigative committees and boards.\nDr Azzopardi said the government failed to establish an independent magisterial office with the power to unilaterally initiate magisterial inquiries. The existence of six different and inconsistent appointment committees, whose tasks could easily be carried out by a single committee, would also cause confusion.\nHe referred to a controversy surrounding apparent ministerial access to confidential portions of the Egrant inquiry.\nGovernment MP Edward Zammit Lewis said the Opposition was factually incorrect to call for the separation of the Office of the Attorney General from the government.\nFor some time, the British Attorney General had attended Cabinet, he said, and the Venice Commission referred to the government’s “reasonable” wish to retain control over the appointment of the Maltese Attorney General.\nThe only European country where the Attorney General was appointed in the fashion being suggested by the Opposition was Hungary, Dr Zammit Lewis added.\nHe said magistrates and judges were appointed by a simple majority of the House and asked whether they too were seen to be partial by the Opposition.", "comment_count": 32, "id": 100}, {"keywords": "Accident", "author": "", "article_body": "Updated at 6.30pm\nA large grass fire in Marsalforn sparked a gas cyclinder explosion in the town on Wednesday afternoon.\nThe fire and subsequent explosion in the area known as Qolla Safra caused structural damage to a room and sent massive plumes of smoke rising above the seaside town. Nobody was injured, however, and firefighers were soon on the scene to put out the flames.\nFirefighters reach the scene. Video: Daniel Xuereb Dingli\nA police spokesperson subsequently said that a woman close to the fire had been treated for smoke inhalation but was discharged soon afterwards. The gas explosion had also blown out the windows of a nearby apartment, they added. \nA Civil Protection Department spokesman said Wednesday’s heat was keeping firefighters rushed off their feet, with other grass fires also reported in Selmun and Miżieb.\n ", "comment_count": 0, "id": 101}, {"keywords": "Beach, Tourism", "author": "", "article_body": "No beach concessions will be granted in newly-replenished St George's Bay in Birzebbuġa, Tourism Minister Konrad Mizzi said on Wednesday.\nThe beach was one of three that has been replenished with tonnes of sand.\nThe works are in the final stages, with beach furniture being installed.\nDr Mizzi said no permits will be issued for beach concessions on deck-chair rentals. \nThe other beaches that are being replenished are Balluta and Għar l-Aħmar bay in Marsaxlokk.", "comment_count": 27, "id": 102}, {"keywords": "Crime", "author": "Edwina Brincat", "article_body": "A woman who admitted stealing €60,000 from her parents’ bank account to fund drug-taking has been placed on probation after her parents dropped their complaint.\nJoelle Galea, 33 of Sliema, who was first arraigned last year, had admitted to having stolen cash cards from her parents’ home and using their password to siphon funds from their bank account.\nShe also pleaded guilty to possession of cannabis resin and ecstasy which were found by police at her home.\nAfter that early guilty plea, her defence lawyer, Dr Stephen Tonna Lowell, had requested a pre-sentencing report, a request that was upheld by the court. Magistrate Charmaine Galea advised the accused that it was in her own interest to cooperate with the probation officer assigned to her.\nThe officer had since reported that the woman had “manifested the will to move on.”\nThe court also heard that the parents had withdrawn their complaint.\nIn the light of this outcome, as well as the withdrawal of the complaint,  the court concluded that the woman was to be given a chance to proceed along this path.\nThe court placed the accused under a 3-year Probation Order and fined her €1000, stressing that this “could be the only chance” and warning her to abide by the conditions in the judgment.\nInspectors Mark Anthony Mercieca and Lara Butters prosecuted", "comment_count": 1, "id": 103}, {"keywords": "Health, Human rights", "author": "Claire Caruana", "article_body": "Mount Carmel Hospital should be closed down \"for all psychiatric conditions\", mental health organisation Richmond Foundation has demanded. \nIn a statement, the foundation said it believed Mount Carmel Hospital is \"unfit to treat patients\" and has been in such a state for several years.\n\"Having consulted numerous clients of the Foundation we have the certainty to say that even though the care in the hospital may be good, the building is not conducive to recovery.\n\"No one with a mental health condition should be made to remain in Mount Carmel Hospital. No one, for whatever illness, should be isolated from the main stream hospital,\" the NGO argued.\nIt added that the edifice should be \"completely re-purposed\" so as to unlatch the stigma associated with the place.\nThe NGO's statement comes in the wake of a former senior official's comments to a parliamentary committee that patients at the state mental health hospital had been made to endure freezing cold showers in the height of winter because there was no hot water for months on end.\nIt went on to suggest that better community care was also needed so as to avoid admitting patients to hospital unless absolutely necessary. \n\"Unless they are in need of acute psychiatric care, a person would not need to be treated in a hospital but would be supported in the community. Hospitalisation should happen only when the person is unwell and it should be at Mater Dei,\" the foundation added. \nOn the draft Mental Health Strategy published at the end of 2018, the NGO said that while aspects highlighted in the past by the foundation had been included in this, focus should now shift to the publication of the final strategy document.\nThe consultation period had come to an end some three months ago and yet the final document still had to see light of day, the organisation pointed out.\n\"Albeit a number of initiatives are already being undertaken, we maintain it is imperative to avoid a piecemeal approach. The sector needs a holistic plan to ensure that developments are congruent, coordinated and consistent and that they finally ensure smooth pathways for all service users.\"\nSeries of demands\nThe Richmond Foundation said that in the wake of recent reports and in consultation with those using its services, it was making a series of demands on their behalf. \nThis included calling for the the publication of the final strategy, the introduction of a crisis intervention or psychiatric emergency services, the development of youth early intervention services as well as a clear plan for the strengthening and development of other community services, the building of a new acute psychiatric facility at Mater Dei Hospital and the closing down of Mount Carmel Hospital for all psychiatric conditions.\n\nNever-ending saga\nThe state of the state mental health hospital has repeatedly made headlines in recent years. In April, the Times of Malta revealed that around three quarters of the hospital's ceilings were condemned. Photos seen by Times of Malta show beds lined up so close to each other that patients had no option but to store their belongings on the floor.\nThis was also proving a challenge for nurses who could not care for patients properly as a result of the beds being crammed together. The photos also show scaffolding being used to support parts of the ceiling at risk of collapse. In some areas, architects also instructed workers to install metal support jacks to hold old beams in place.\nReacting to the report just days later, Health Minister Chris Fearne insisted the hospital was safe while also confirming some patients had been evacuated due to infrastructural problems. The minister has also repeatedly stated that the government had come up with a five-year plan to address the situation, yet staff insist they have yet to see any improvements.\n \n ", "comment_count": 6, "id": 104}, {"keywords": "Traffic", "author": "", "article_body": "A 22-year-old motorcyclist from Nadur was seriously injured early on Wednesday in a traffic accident in Manikata Road, near Mellieħa.\nHe was driving a Kawasaki motorcycle which was involved in collision with an Opel Corsa driven by a 24-year-old woman from Manikata.\nThe accident happened at 6.45pm. The man was hospitalised. ", "comment_count": 1, "id": 105}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A male nurse accused of having repeatedly raped a fellow female member of the local Pakistani community, allegedly subjecting her to an eight-month ordeal, has been granted bail.\nPrince Aftab, 36, from Pakistan, who has been living in Malta for the past 10 years, was arraigned in May, pleading not guilty, being remanded in custody even in view of the fact that the alleged victim was still to testify.\nAs proceedings continued, the court had heard how the man had allegedly handled arrangements for the woman to travel to Malta where she was to take up a job as cleaner, meeting up with her over the following months and allegedly subjecting her to the sexual abuse.\nThe court heard that the victim reported the case only after confiding in a psychologist, fearing to speak about her harrowing experience which touched upon a taboo subject in terms of Pakistani culture.\nFollowing the woman’s testimony via video conference earlier in the week, the court upheld a fresh request for bail against a deposit of €2,000, a personal guarantee of €40,000 and an order to sign the bail book three times a week.\nLawyers Franco Debono and Amadeus Cachia were counsel to the accused.", "comment_count": 0, "id": 106}, {"keywords": "Court, Gozo", "author": "Edwina Brincat", "article_body": "A Gozitan resident who kicked up a racket at the Victoria police station after insulting another man in Xlendi was on Wednesday fined and given a suspended sentence after he admitted to his wrongdoing.\nStephen Edwin Tully, a 38-year-old Briton living at Munxar, pleaded guilty to the two incidents, which kicked off shortly before midnight on Friday when the man, under the influence of drink, caused a public disturbance.\nShortly afterwards, upon being taken to the Victoria police lockup, the accused had violently resisted arrest, threatened three police officers, disobeyed their lawful orders and tore the shirt of an officer.\nThe court in Gozo, presided over by magistrate Brigitte Sultana, observed that although the accused had entered an early guilty plea and collaborated with the police, the offence was a serious one.\nFor this reason, the court condemned the accused to a two-year jail term suspended for three years and a €6,000 fine payable within one month.\nInspector Bernard Charles Spiteri prosecuted.", "comment_count": 0, "id": 107}, {"keywords": "PN, Politics, Adrian Delia", "author": "Denise Grech ", "article_body": "Tensions within the Nationalist Party's parliamentary group reached boiling point overnight when a group of MPs asked the leadership to assume responsibility for the recent electoral losses and step down.\nA meeting of the group started at around 6pm dragged on until 2.15am on Wednesday. At times, raised voices could be heard from outside the Nationalist party headquarters.\nThe absolute majority of MPs were in favour of the leadership resigning, sources said. Only three MPs - Edwin Vassallo, Carm Mifsud Bonnici and general secretary Clyde Puli spoke in favour of party leader Adrian Delia staying on.\nRELATED STORIES'You question everything after a loss' - Delia\nThe MPs gave the leadership some days to find the best way how - not if- to resign, one source said.\nMany MPs made it clear to Dr Delia that the party is unelectable at this stage.\n\"We made it clear that under his leadership, the party cannot win an election,\" a source said.\nSome insisted that it should be Mr Puli and party media head Pierre Portelli who should go.\nThe group also discussed allegations that fake Facebook profiles were being created to attack MPs who did not support Dr Delia's leadership.\nSome claimed that those who supported Dr Delia had created fake accounts to \"troll\" those who openly spoke against him. \nDr Delia remained silent throughout most of the meeting, only interjecting to \"make points of clarification\".\nHe then told the group that the leadership would be meeting to discuss the way forward and that a meeting would be called in days to discuss the matter further.\nAn MP admitted it was the least \"problematic\" of meetings - because everyone was finally honest about the way they felt.\nThe call was clear: \"face the reality of the situation and get us out of the fiasco we are in\", they said.\nDr Delia has to date insisted he will not step down, seeing the general election in three years' time as his proper test.\nOne source said matters would not be solved just by Dr Delia's resignation.\n\"Even if [Dr Delia] resigns, whoever takes over the party leadership will need to win over the grassroots who currently support him,\" he said, adding that there were \"two extremes\" of PN voters at the moment.\nThe group is expected to reconvene in a few days.", "comment_count": 183, "id": 108}, {"keywords": "Construction, Disaster, Accident", "author": "", "article_body": "The dean of the Faculty for Social Wellbeing has appealed for a more regulated approach to prevent accidents in the construction industry.\nIn a statement on Wednesday, Andrew Azzopardi expressed concern at the number of workers in the industry who were injured and at the collapse of occupied buildings next to construction sites.\nA building collapsed in Mellieħa on Saturday, an apartment block collapsed in Guardamangia in April and the back wall of an 18th century house at It-Tokk also collapsed during development in April 2018. A few months later, a warehouse in Mrieħel caved in in the middle of the day. \nProf. Azzopardi said the need for one to have a roof on one’s head and a safe environment was basic to one’s wellbeing. Conversely, holding warranted persons responsible was an important, but insufficient first step.\n“The feeling that there is a cavalier, safety-last attitude permeating the construction industry seems to be growing and the evidence is there for all to see. I appeal to the authorities to take this matter seriously.”\nHe appealed for a more regulated approach to ensure that such accidents did not happen. Such regulation, Prof. Azzopardi said, required the prioritisation of the needs and safety of residents.\nRegulation, he said, would require all persons involved in the industry to have the required training and expertise. This should be represented by warrants and permits that could be revoked instantaneously should those involved not follow protocol.\nRegulations had to be consistently enforced with effective sanctioning mechanisms including hefty fines and the removal of warrants and permits.\nCommittees and tribunals also had to listen to complaints and provide effective solutions. Monitoring should be ongoing and civil society more active and effective. Inquiry outcomes following major accidents should be made public within a stipulated and reasonable time frame.\nProf. Azzopardi said that respect for human life and quality of life should be at the cornerstone of all development and social and emotional wellbeing should be the order of the day.", "comment_count": 8, "id": 109}, {"keywords": "Politics, PN", "author": "", "article_body": "Updated Wednesday 7.05am\nA Facebook video showing Democratic Party MP Marlene Farrugia being carried shoulder high in a Zebbuġ band club amid anti-PN chants was manipulated, Godfrey Farrugia, outgoing PD leader, said on Wednesday. \nThe video infuriated Nationalist Party general secretary Clyde Puli, who uploaded it on his Facebook wall on Tuesday and hit out at Marlene Farrugia. \n“We gave them a platform, media and two parliamentary seats,” fumed Mr Puli in a Facebook post in which he shared the video.  “And now they dance and celebrate to the beat of hatred towards us”.\nGodfrey Farrugia in an initial reaction on Tuesday said they had not heard the anti-PN chanting.\n\"The music was loud and we never head these words,\" he said.\n\"The only thing I had heard was 'viva l-Labour', and I stopped clapping and singing then\", he added, saying both he and his partner attended the feast every year as they were honorary members of the band club.\n\nOn Wednesday Godfrey Farrugia uploaded two videos of the scene in the band club. He said Marlene Farrugia could not be seen in the video where the anti-PN chanting was made, but the 'fake video' uploaded by Clyde Puli had been manipulated showing her there against the background of the chanting. This, he said, was Puli's 'dirt and deception' aimed at putting Marlene Farrugia in a bad light.\nMarlene Farrugia in a Facebook later said she forgives Mr Puli.\nEarlier, she said that she had a great deal of respect for those Nationalists and Labourites who truly love Malta and Gozo. \nShe suggested the video had been planned by Mr Puli all along. \n\"The people by the microphone were engaged by Puli,\" she alleged, saying people like him were the PN's downfall. \n\"We even spent an hour at the PN's club [in Żebbuġ]. Of course we would never have offended the party!\"\nBand committee investigating\nThe committee of St Philip Band Club condemned the incident, which, it said, was provoked by a small number of persons who were not club members and who only frequented the club for the occasion of the feast.\n\"St Philip Band Club stays aloof of politics. Indeed two young committee members who were present took immediate action and stopped the music that was being abused by a few irresponsible persons inside a bar open to the public.\"\nThe committee said it had decided that in future it would better control what music was played inside the club during the feast period and it has to be approved beforehand.\nThe carrying of persons shoulder high will no longer be allowed.\nThese measures are intended to avoid a repeat of such incidents in future.\nIn \"a preliminary statement\" in the evening, the band's committee said it had launched an investigation into the matter.\nIt said that, so far, it was limiting itself to completely condemning the behaviour and all committee members were angry at those who used the occasion for personal aims.\nThe committee promised to take the necessary steps to conclude the investigation.\nIt noted that the music was stopped as soon as committee members realised what was happening and said this was the first time the music was used in this way so they could not anticipate the risk.\nForza Nazzjonali turned sour\nBoth Marlene and Godfrey Farrugia was elected to parliament as part of the Forza Nazzjonali PN-PD coalition formed ahead of the 2017 general election, and Dr Farrugia had publicly declared that she had been a paid-up PN member since 1998.\nThe coalition had soon turned sour, however, with the PD critical of the PN’s choice of new leader, Adrian Delia, following the election.\nIn December 2017, the PN’s executive unanimously agreed to dissolve the Forza Nazzjonali agreement.\n \nIn his Facebook post, Mr Puli reminded his followers that Ms Farrugia had said she was interested in becoming PN leader and accused her of trying to hijack the process to co-opt Dr Delia into parliament.\n\n“When we wanted to give up one of our (parliamentary) seats for our leader, she wanted one of her candidates to take it,” he wrote.\n“We’ve had to contend with this chain at our feet and other damage as we’ve worked to improve the PN over the past months,” Mr Puli added.\nDr Farrugia was having none of it, saying Mr Puli had \"scraped rock bottom and is continuing to dig\". \n\"He is in a panic,\" she said. \"For him, the PN is a teat to suck on, not a glorious party which deserves better\". \nInternal critics\nDr Delia and his close aides, including Mr Puli, have come in for strong internal criticism over the past weeks following the party’s disastrous showing at European Parliament and local council elections.\nDespite a chorus of criticism, the party leadership has insisted that the result was not as bad as originally predicted and that its remit was to lead the party to the 2022 general election.", "comment_count": 92, "id": 110}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers.\nTimes of Malta focuses on a report about the huge amount of air pollution caused by cruise ships.\nThe Malta Independent says Adrian Delia on Tuesday would not describe himself as a key member of the PN strategy team.\nMaltaToday says PN General Secretary Clyde Puli called Marlene Farrugia as a 'viper' following an anti-PN chant in a band club, for which she was present. \nl-orizzont leads with the setting up on Tuesday of a Malta-based Ryanair subsidiary airline. It also reports how President George Vella called for work with dignity for all in Malta. Dr Vella addressed the annual meeting of the International Labour Organisation.\nIn-Nazzjon quotes the CEO of the Occupational Health and Safety Authority saying everyone is obliged to report irregularities. It also reports how another large group of migrants was rescued and brought to Malta on Tuesday.", "comment_count": 0, "id": 111}, {"keywords": "Employment, Migration, Unions", "author": "Keith Micallef", "article_body": "The government has announced the setting up of a specialised unit to crack down on the illegal employment of non-EU nationals amid growing concerns that exploitation of foreign workers is on the rise. \nThe move came about through a legal notice published last week under which a “reporting unit” will be set up within Identity Malta, the State agency which handles matters relating to passports, travel and identity documents, and residence permits. \nThe unit will be entrusted with the inspection of illegally staying and illegally employed third-country (non-EU) employees and students.\nThe unit shall be empowered to enter without previous notice, at any reasonable time, any premises where third-country nationals are employed, residing or studying, including school premises and places for the provision of private tuition or distance learning. \nThese random inspections must be carried out with the assistance of the police. Attempts to obstruct the unit from carrying its duties, or giving false information, could result in a fine of up to €5,000, imprisonment not exceeding six months, or both. \nA few weeks ago, UĦM Voice of the Workers CEO Josef Vella warned that the issue of precarious employment in Malta was at an all-time high, saying that foreign workers were being paid as little as €1 an hour. Moreover, he said, in certain cases, the little money workers were being paid was not going in their pockets but to an agency in India.  \nPrecarious employment in Malta at an all-time high\nThe union warned that this trend was negatively impacting wages in general, while advocating the implementation of the principle of ‘equal pay for jobs of equal value’.\nApart from the UĦM, even the Nationalist Party has been expressing concern on the increasing reliance on cheap labour, especially in sectors like the construction industry and tourism. \nAsked by this newspaper on the reasons why the government felt the need to enact such a legal notice, a spokeswoman at the Prime Minister’s Office said this was part of an effort “to be more equipped to face the developing challenges of a vibrant economy like ours”.\nShe added that this specialised unit had been announced in the 2019 Budget.\n“Identity Malta Agency will be setting up a Reporting Unit as according to LN 112 of 2019 in order to ensure that the relevant laws that fall within the remit of the agency, in particular the legal migration process, are adhered to,” she said.\nAs for the resources which will be made available, the spokeswoman said that Identity Malta would examine all operational needs for the efficient setting up of this section.\nApart from doing inspections, the new unit may ask any person to produce documents and report the findings of its investigations to the police, who could in turn take criminal action.", "comment_count": 35, "id": 112}, {"keywords": "Maritime, Environment, Tourism", "author": "Philip Leone Ganado", "article_body": "Just 83 cruise ships which visited Malta in 2017 belched out 148 times as much sulphur as the country's entire car fleet, new analysis shows.\nThe campaign group Transport & Environment (T&E) used satellite data to track 203 cruise ships as they sailed around Europe in 2017, comparing the air pollution caused to passenger car emissions.\nIn Malta, the estimated 283,000 road vehicles together generated 3.4 tonnes of toxic sulphur oxides (SOx) compared to a staggering 502.8 tonnes from the 83 cruise ships that visited the island.\nThe cruise ships also emitted nitrogen oxides (NOx) equivalent to 70 per cent of the car fleet and as much fine particulate matter (PM2.5) as 30 per cent of cars.\nAccording to T&E, the reason for the extremely high emissions are due to overly lax marine fuel quality and engine emissions standards, made worse by the large size of marine engines and the time spent in port.\n“Luxury cruise ships are floating cities powered by some of the dirtiest fuel possible,” T&E’s shipping policy manager, Faig Abbasov, said. \n“Cities are rightly banning dirty diesel cars but they’re giving a free pass to cruise companies that spew out toxic fumes that do immeasurable harm both to those on board and on nearby shores. This is unacceptable.”\nAir pollution in Malta, of which vehicle emissions have long been the primary cause, is a major public health concern.\nResearch published in the European Heart Journal this year estimated that air quality is responsible for 576 early deaths in Malta every year, more than twice as many as previously thought.\nThis is not the first time the danger of cruise ships in Malta has been highlighted. \nOne researcher last year identified pollution levels from cruise ships in the Grand Harbour 10 times higher than the island’s most congested roads.\nThere were an average of 316 cruise liner calls per year between 2014 and 2018, according to NSO figures.\nAcross the major ports of Europe, the T&E report found Barcelona, Palma de Mallorca and Venice to be the most polluted. \nMalta did not feature among the 50 ports found to be most polluted in absolute terms. \nIn an analysis of different operators, the Carnival cruise company was found to be the worst offender: its ships alone emitted 10 times more SOx than all of Europe’s 260 million cars.\nCarnival said in a statement the comparison and subsequent findings were “inaccurate, misleading and irrelevant”. The T&E report recommends a zero-emission berth standard for all European ports as well as extra stringent air pollution standards for cruise ships. \nIt notes that such vessels usually operate close to the coast with long port calls at major tourist destinations, disproportionately affecting air quality.", "comment_count": 25, "id": 113}, {"keywords": "Adrian Delia, Parliament, Politics, PN", "author": "Denise Grech ", "article_body": "Nationalist Party leader Adrian Delia on Tuesday refused to say whether he had asked members of the parliamentary group if they would contest the next general election under the PN ticket, saying he “was not under cross-examination” by journalists.\nThe parliamentary group meeting was “ not a public meeting”, he told the press prior to the group meeting.\nThe PN's parliamentary group met once again on Tuesday to continue discussing the party's electoral losses and ongoing parliamentary affairs.\nVideo: Jonathan Borg\nThe meeting was a continuation of Monday’s meeting, which was the first in months. It came during a time of political turmoil for the PN, as with Dr Delia and his team facing calls to \"shoulder responsibility\" for the electoral defeats.\n'You question everything after a defeat'\nDr Delia said Tuesday’s discussions were intended to bring the party together.\n“You question everything after an electoral loss. It’s in everyone’s interest to get consensus,” he said.\nHe also refused to confirm who the key minds behind the political strategy of the last campaign were, saying the party had several strategists.\n“I don’t describe myself as a strategist, my role is as party leader,” he said.\nHe also did not confirm reports, put out by the party's own youth wing, that PN general secretary Clyde Puli and chief political coordinator Jean Pierre Debono had cordoned themselves off from the rest of the party by closing off their offices behind a gypsum wall.\n“When you’re talking about an organisation where there are accessibility codes, it’s normal there are offices which are like that,” Dr Delia said.\nIn its report, the party’s youth-branch MŻPN said the party’s secretariat had locked themselves up in a room with finger-print access.\n“What I can tell you is our front door is open, and my office is always open,” he said.\nNo big membership losses\nHe said there had been no substantial number of paid-up members who left the party following the electoral losses.\nDr Delia also said he would be meeting paid-up members of the party in the coming weeks to discuss the way forward.\nThe more paid-up members agree with us, the more they become our ambassadors, he said.\n\"My intention is to meet paid-up members each week to see if they are on the same wavelength and make them part of the process,\" he said.", "comment_count": 24, "id": 114}, {"keywords": "Justice, Pensions, Court, Parliament", "author": "", "article_body": "Former Judge Philip Sciberras told a court that he got ‘privileged’ pension as an MP even though he had never submitted a formal application.\nTestifying in a libel suit he filed against Times of Malta over an article titled ‘Ex-MP gets top pension despite Treasury objections’, Dr Sciberras insisted that it was not true that he had applied for the MP pension and that he made pressure so the pension was issued.\nDr Sciberras insisted that he got his MP pension because he was entitled to it and said that he never filed an application to obtain this pension as this was arranged for him by the Association of Former MPs, Parliament and the Treasury after the intervention of the Attorney General’s office.\nReplying to questions by defence lawyer Stefan Frendo, the former judge said that he had forgotten about his entitlement for an MP pension as he was too busy with his work as a judge. \nConfirming that the Treasury Department, through one of its senior officials, had objected to the granting of his special pension after the Association of Former MPs asked on his behalf, Dr Sciberras said that the official’s interpretation, as reported by the newspaper, was wrong and was later contradicted through the Attorney General’s office. \nDr Sciberras insisted that, according to the law allowing for an extra pension for MPs, apart from the ‘normal’ National Insurance pension, he was entitled to get it and he had made no pressure to obtain what he was entitled to. \nHe confirmed that he had asked the secretary general of the Association of Former MPs, Lino DeBono, to make his case and he had spoken to no one else.\nHe had forgotten about his entitlement as he was too busy with his work as a judge\nDr Sciberras, who turned 61 in 2006, said that following the intervention of the association on his behalf and the decision of the Attorney General, he started receiving his MP's pension in 2014 and was given arrears since he had turned 61 eight years earlier when he was still serving as a judge.\nTimes of Malta had reported that Dr Sciberras was receiving a total of three pensions funded by the State coffers, two of them granted only to former members of Parliament and former members of the judiciary.\nUpon turning 65, Dr Sciberras, apart from his ‘normal’ contributory pension, was also receiving a €23,000-a-year pension as a former member of the judiciary and another €572 a month as a former MP, through a decision taken in 2014.\nDuring the proceedings it resulted that following the AG’s advice, the Treasury also paid Dr Sciberras €55,000 in arrears, for the pension he was not given between reaching 61 and the time the MP’s pension entitlement was decided.\nJudge Emeritus Sciberras served as a Labour MP for less than two legislatures in the late 1970s and early 1980s. \nHe was appointed judge in the Superior Courts in 2002 under a Nationalist administration.", "comment_count": 27, "id": 115}, {"keywords": "Court, Crime, Justice", "author": "Edwina Brincat", "article_body": "A long strand of golden hair in the shower of a flat rented by the accused in the murder of Shannon Mak appeared to indicate the victim’s presence inside her former boyfriend’s home.\nThis came to light on Tuesday in the ongoing compilation of evidence against Jelle Rijpma, the 23-year-old Dutch gaming employee who allegedly knifed his fellow colleague and former girlfriend outside his rented Santa Venera home in the early hours of August 3, 2018.\nAs the several relatives of the murdered woman rallied around her wheelchair-bound mother inside the courtroom, two officers from the Forensic Science Laboratory recalled their investigations at the scene of crime.\nPS Eman Dalli and PC Kurt Attard presented the court with their joint report compiled after photographing the scene of crime and the alleged murderer’s converted garage on Triq l-Istampaturi.\nIt was there that the officers had found a single, long strand of golden hair on the handle of the shower bar. Traces of blood had also been found inside the premises, together with 17 cigarette butts.\nThese materials, as well as fingerprints lifted by the officers, had been handed over for forensic tests after being duly photographed on site.\nAn RIU officer, Luke Stivala, one of a party of four uniformed policemen who had arrested the suspected murderer, recalled how they had come across Mr Rijpma seated inside his flat, calmly watching television.\n“He appeared relaxed,” the witness said.\n“Did he ask any questions?” parte civile lawyer Stefano Filletti asked.\n“No. He behaved normally as though he had been expecting us,” the officer replied, adding that the suspect had cooperated during the arrest.\n“Did he ask ‘why’?” Dr Filletti persisted.\n“No, nothing,” came the reply.\nThe case continues next month. Inspector Robert Vella prosecuted. Lawyer Leontine Calleja was defence counsel.", "comment_count": 0, "id": 116}, {"keywords": "Media, Statistics", "author": "", "article_body": "Around two-thirds of the population watch TV regularly, with news programmes being the most popular, the latest Broadcasting Authority survey found.According to the March 2019 survey, the amount of regular TV viewers has remained roughly unchanged over the last year at 274,500 people, or 63.4% of the population, who watched around one hour and 45 minutes a day on average. TVM was by far the most popular channel with just over a third of all viewers, followed by the two political party channels One (18.4% of viewers) and Net (7.9%).Only around a third of the population watched foreign channels, though younger viewers were significantly more likely to do so. Local and foreign news dominated viewers’ favourite genres - 20% indicated news as their preferred programming - followed by Maltese drama series, discussion and current affairs, documentary and cultural shows. Analysed by gender, men watched significantly more sport and documentary programmes than women, who showed a greater preference for drama series, teleshopping and light entertainment programmes. More than 90% of respondents had a paid subscription, while around half had an IT-based service such as IPTV, Android box or Netflix streaming.\n\nRadio listeners increase slightly\nMore than half the population (56%) listen to the radio regularly, an increase of nearly 5% compared to February 2018. 89.7 Bay was the most popular station with around a quarter of all listeners, followed by One Radio, Vibe FM and Radju Marija. Among younger listeners, 89.7 Bay claimed an even larger share, more than two-thirds of teenagers and nearly half of those in their twenties. One Radio was the most popular among older listeners with a quarter of those after 50 and a third of those over 70.Gender differences revealed themselves in listeners’ preferred segments, with men more likely to tune in for morning and afternoon drive programmes, while women were more likely to opt for daytime and overnight programming.", "comment_count": 5, "id": 117}, {"keywords": "Court, Justice, Daphne Caruana Galizia", "author": "Edwina Brincat", "article_body": "The court has turned down an unusual request by two men charged with the murder of Daphne Caruana Galizia to meet MEPs Ana Gomes and David Casa.\nThe brothers requested the meeting during Thursday's compilation hearing on the murder of the journalist.\nAlfred and George Degiorgio, alongside Vincent Muscat, are currently facing proceedings over their alleged involvement in the car bomb that assassinated Ms Caruana Galizia outside her Bidnija home in October 2017.\nOn Thursday, the Degiorgio brothers sought court authorisation to hold a meeting with the two MEPs in the presence of the foreign press, prompting immediate objections by both the prosecution and parte civile lawyers who voiced diffidence over such an “extraordinary” request which fell beyond the ambit of the judicial process.\nLater that same afternoon, the two MEPs reacted to request, issuing a joint statement wherein they said that “politicians have no place negotiating with suspected murderers”.\nOn Tuesday, the court, presiding over the murder compilation, put paid to the request in its decree on the matter, with magistrate Claire Stafrace Zammit turning it down after taking note of the objections by the Attorney General and of the “exceptional” nature of such request, which the defence counsel “failed to support”.", "comment_count": 0, "id": 118}, {"keywords": "Court, Justice, Ħamrun", "author": "Edwina Brincat", "article_body": "A baptism party appears to have been the spark that caused a violent fight in Ħamrun on Sunday, landing a man in preventive custody after he pleaded not guilty to his alleged involvement in the incident.\nThe 28-year old unemployed man from Ħamrun, whose name is not being published to safeguard the identity of his partner, one of his alleged victims, had slightly injured the woman during a heated domestic row that broke out at the couple’s home on Sunday morning.\nThe matter did not stop there, prosecuting Inspector Wayne Camilleri explained.\nThe man returned to the apartment at around 6.15pm, when a fight broke out, during which a neighbour was slightly injured.\nDuring the arraignment on Tuesday, the man pleaded not guilty to slightly injuring his partner, voluntary damaging third-party property, slightly injuring a man who lived nearby, being in possession of a sharp and pointed weapon, as well as breaching public peace.\nDefence lawyer Yanika Bugeja requested bail, pointing out that her client had also suffered injuries and had acted in self-defence, adding that the alleged victims were familiar faces and were “in and out of court”.\nMoreover, the incident had been sparked off when the man was ordered out of his home.\nOne could not simply force a person to sleep on the streets, the lawyer argued, adding that, unfortunately, the current handling of cases of domestic violence was going “beyond reason”.\nThe prosecution countered that the accused had turned up at his Ħamrun home after being barred from going there. Not only had he breached that order, but had also been armed with a sharp instrument. He had been to and fro all day, the spark to the row apparently having been a baptism party involving his partner.\nBesides, many civilian witnesses were still to testify, the prosecution said.\nIn light of such submissions, the court, presided over by magistrate Yana Micallef Stafrace, denied the man bail and remanded him in custody.", "comment_count": 0, "id": 119}, {"keywords": "Aviation, Tourism, Travel, Joseph Muscat", "author": "Ivan Martin", "article_body": "Updated 3.15pm\nMalta Air and Air Malta could both “live happily ever after”, the Prime Minister said on Tuesday, as the Ryanair subsidiary airline was launched with a set target of five million passengers within five years.\nJoseph Muscat said he did not believe Malta Air would negatively impact Air Malta during the deal  signed between Ryanair and the Maltese government.\nRyanair CEO Michael O'Leary announced during the ceremony that the new airline hopes to carry five million passengers within five years and is already seeking new routes to add to the 62 it will take over from Ryanair. \nThe new airline will initially operate six formerly Ryanair aircraft and increase them to at least 10 within three years.\nAside from doubling its current Ryan Air fleet of six planes on the island, the company is also planning to relocate around 50 other aircraft from the Italian and German register to the Maltese one.\nDetails about Malta Air, were first revealed last Sunday and confirmed by Tourism Minister Konrad Mizzi, who said the development is the fruit of nine months of talks.\n \nThe airline will also be setting up hangar facilities for repair and maintenance operations in Malta.\nRELATED STORIESRyanair to set up a new airline based in Malta  \nDr Mizzi this was a deal which would initially create some 350 jobs, but this was really about securing the future of tourism in Malta for the long term by putting Malta at the centre of a global hub.\nRyanair would also be transferring its 200 Malta-based crew to local contracts, paying taxes on the island.\nRyanair CEO Michael O’Leary said this was a proud day for the Ryanair group.\n“By investing in Malta Air and putting these aircraft on the Malta register we commit ourselves to a very substantial investment in Malta,” he said.\nThe new subsidiary joins another two Ryanair subsidiary airlines, Buzz and Lauda.\nTop government officials including Prime Minister Joseph Muscat look on as Ryanair and the Maltese government seal the deal to create Malta Air. Photo: Ivan Martin\nRyanair has been operating in Malta for 12 years and currently flies three million passengers a year.\nAsked about the fact that the government wanted to transform Malta into a regional hub in the Mediterranean, Mr O’Leary said he too saw the potential for the island to diversify its model from a purely destination airport to a connecting transitory one.\nMalta Air, he said, was already exploring the possibility of connecting with North African destinations.\nHe said that in displaying the Maltese cross on Ryanair planes, which were also getting the Maltese colours, the company was exporting the Malta brand.\nMr O’Leary said this had been one of the company’s toughest negotiations in its 30 years of operations.\nMeanwhile, the Civil Aviation authorities confirmed that the first Ryan Air plane had moved onto the local register on Monday night.\nBoth Dr Mizzi and later Prime Minister Joseph Muscat insisted that the new company will not impact Air Malta since the two airlines will offer different but complementary services.\nThe government will have a golden share in the new airline, enabling it to veto decisions on the sale of the airline or the transfer of the name.\nNo financial details have been disclosed.\nFielding questions from reporters, Mr O’Leary said Ryan Air had been flying out of Malta for more than a decade and had not been in competition with Air Malta.\n“In fact Air Malta has grown since Ryan Air has been operating here, and the two enjoy a complementary relationship,” he said.\nMalta Air will fly its new livery out of and into Malta by summer 2020.\n ", "comment_count": 96, "id": 120}, {"keywords": "Crime, Mosta", "author": "Edwina Brincat", "article_body": "Three men forced their way into an elderly man's residence in Mosta by pretending to be workers from a communications company, a court was told on Tuesday.\nThey bound and slightly injured the 67-year-old but did not steal anything, apparently not having found anything they needed.\nThe case took place in the early morning of May 22. \nBrady Grixti, 26, an unemployed Valletta resident, Roderick Zahra, a 32-year old security worker from Gżira and Tano Farrugia, a 41-year old Pieta’ resident, pleaded not guilty to forced entry and attempted theft aggravated by violence.\nThey also denied having unlawfully held their alleged victim against his will, slightly injuring him.\nMr Grixti was separately charged with being a recidivist.\nThe prosecution objected to bail, pointing out that eyewitnesses, including the alleged victim himself, still have to testify.  \nMagistrate Yana Micallef Stafrace turned down the request for bail.\nInspectors Fabian Fleri and Lydon Zammit prosecuted. Lawyers Franco Debono and Joseph Gatt were counsel to Mr Grixti. Lawyer Manuel Mallia was counsel to Mr Zahra. Lawyer Mario Mifsud was counsel to Tano Farrugia.", "comment_count": 0, "id": 121}, {"keywords": "Crime, Court", "author": "Edwina Brincat", "article_body": "A man who came to blows with a neighbour because of a noisy party ended up in court on Tuesday.\nKhalidKhalifaM. Alashtar, a 52-year old Libyan security guard who has lived in Malta for years, returned home from work late on Saturday to find a rowdy party next door.\nHe allegedly asked the neighbours to turn down the volume. An argument ensued, to the point that the neighbour, a Swedish national, suffered a knife wound.\nMr Alashtar pleaded not guilty to injuring the alleged victim and with having carried a sharp instrument without licence.\nA request for bail by the man’s defence counsel, Dr Roberto Montalto, was not objected to by the prosecution.\nThe court was told that Mr Alashtar had fully co-operated with the police and that the victim’s injury consisted of a ‘cut on the hand.’\nMagistrate Yana Micallef Stafrace granted bail against a personal guarantee of €5000 and an order to sign the bail book once a week.\nInspector Colin Sheldon prosecuted.", "comment_count": 3, "id": 122}, {"keywords": "Family, Politics, Joseph Muscat", "author": "Sarah Carabott", "article_body": "The Prime Minister’s proposal of doing away with maternity and paternity leave and introducing parental leave, leaving it up to parents to split it between themselves, is misguided and inconsistent with EU legislation, according to Nationalist Party MEP David Casa.\nJoseph Muscat made the comments during a Labour Party event in Naxxar prior to the European and local council elections.\nHowever, his proposal of transferable leave seems to contradict the directive’s allocation of leave for each parent.\nAccording to a Work-Life Balance directive that was given the green light by the European Parliament in April, member states need to introduce a minimum of 10-day paternity leave and two months (non-transferable) paid parental leave for each parent until their child turns eight.\nAsked to clarify his comments, and whether the proposed transferable leave would be an additional allocation that goes over and above the minimum stipulated by the European Union directive, a spokeswoman said: “Please note that the Prime Minister was giving his personal opinion on the matter.”\nWhen contacted, Mr Casa, who led and negotiated the Work-Life Balance Directive, said the Prime Minister’s remarks were “misguided and the measures proposed counterproductive”.\nAbandoning maternity leave would be ill-advised, he said, adding that this leave was provided to mothers at the time of the birth and its regulation was also dependent on health and safety considerations. \nInconsistent with current EU legislation\nThis leave was more protected in view of the health and physical issues that arose from giving birth, he added.\nThe new Work-Life Balance directive will increase the current one day of paternity leave for Maltese fathers to 10 days of leave at around the time of the birth of a child.\nThese two sets of leave are distinct from the parental leave that parents may use during a certain period of their child’s life, Mr Casa said.\nThe Prime Minister’s comments about transferability of parental leave between parents are also problematic. \n“The issue of non-transferability was given great importance during negotiations on the directive because it is proven that when leave is transferrable, women take on the greatest share of caring responsibilities,” Mr Casa said.  \n“This results in a widening of the gender employment, pay and pension gaps. In fact, the Prime Minister’s suggestion of complete transferability is inconsistent with current European Union legislation.” \nIt also went against the current trend of increasing the non-transferable period of parental leave as was done through the new directive.\nIn Malta this was of crucial importance in view of the fact that our gender employment, pay and pension gaps continued to be significantly wide. Mr Casa added that due to our particular circumstances it would be advisable for the government to implement the new directive without delay.", "comment_count": 2, "id": 123}, {"keywords": "Government, Politics", "author": "Ivan Camilleri", "article_body": "Former Tourism Minister Edward Zammit Lewis, who in 2017 lost his place in Cabinet after failing to make it to Parliament on his own steam, is being paid another €600 a month from government coffers, this time through direct orders awarded to him by his successor at the Tourism Ministry, Konrad Mizzi.\nFollowing a Freedom of Information request submitted by this newspaper to get a copy of the two new separate contracts, given to Dr Zammit Lewis just two months after the last general elections, the Tourism Ministry turned down the request.\nThe government justified its actions by quoting provisions in the law which precludes the publication of information already in the public domain, in this case submitted to Parliament.\nDespite Dr Mizzi’s assertion, Times of Malta is informed that no such contracts, as requested, have been submitted to Parliament.\nNo such contracts submitted to Parliament\nThe only information given to the House of Representatives, upon questions by former PN leader Simon Busuttil on the subject, relate to a reply by Dr Mizzi, that Dr Zammit Lewis was earning €200 and €400 a month from the Malta Film Commission and the Malta Film Fund through legal consultancy contracts signed for the duration of two years.\nAccording to Dr Mizzi, the contracts were given to the Labour MP in August 2017 by the two entities which, ironically, fell under the direct political responsibility of Dr Zammit Lewis when he was Minister just two months earlier.\nThe Times of Malta has now filed a second request for a copy of the contracts under the FOI act.\nThe two government contracts to Dr Zammit Lewis are the latest in a series of direct orders awarded to the Labour MP by government entities.\nLast week, The Malta Government Gazette published a new direct order given to Dr Zammit Lewis, with a value of €13,600 a year to provide “legal assistance on Identity Malta’s reform”.\nThe government backbencher, one of the most vociferous supporters of Dr Muscat, was already awarded a similar contract in 2017, which established a rate of €100 an hour for his services at the agency falling under OPM remit.\nAlso, through another contract, taxpayers are forking out €4,300 a month to Dr Zammit Lewis to act as a legal adviser to the Ministry for Water and Energy, headed by his former Cabinet colleague Joe Mizzi. Last March, Dr Zammit Lewis was also put on the payroll of the National Development and Social Fund, responsible for administering the proceeds from the sale of passports by the government.\nThe Fund agreed to pay a fee of €90 an hour or a minimum of €45,000 a year to Dr Zammit Lewis and his partner in this contract, lawyer Veronique Dalli.\nDr Zammit Lewis has also been put on the list of lawyers serving the Lands Authority, managed by former Labour CEO James Piscopo.\nivan.camilleri@timesofmalta.com", "comment_count": 5, "id": 124}, {"keywords": "European Union, Joseph Muscat, Politics", "author": "", "article_body": "Leaders from Cyprus, France, Greece, Italy, Portugal, and Spain will be in Malta this Friday for the Southern EU Countries Summit to be hosted by Prime Minister Joseph Muscat.\nKnown as the ‘EUMed7’, the seven EU countries formed the alliance in Brussels in 2013 to address issues of common interest in the Mediterranean region.\nThe initial summit took place in 2016 in Athens, where talks focused on coordinating action on relevant issues from economic growth to regional security.\nSummits followed in Lisbon, Madrid and Rome, with the last held in Nicosia earlier this year, where discussions focused on major EU challenges, from climate change to migration and the Multi-annual Financial Framework. Prime Minister Muscat has attended all the summits.\nFriday's summit will be the first to be held in Malta.\nTalks will continue on ongoing key issues, from migration to regional security, and also Brexit, the Eurozone, energy security, and social rights. A press conference will follow the discussions, before a leaders’ dinner. ", "comment_count": 6, "id": 125}, {"keywords": "History, Floriana", "author": "", "article_body": "A proposed 'observation wheel' near the Floriana granaries will totally mar the area and the view to Valletta, heritage NGO Din l-Art Ħelwa has insisted.\nPlanned to stand 45 metres high, the proposed wheel will be located off St Publius Street near the Granaries.\nDLĦ said the structure, whether permanent or temporary, will mar the historic approaches to Valletta and Floriana, and create a serious visual intrusion on the skylines of Valletta from both the Three Cities and from Sliema.  \nThe sizeable structure will also dwarf St Publius Parish Church, a Grade 1 scheduled landmark building, the unique Grade 1 scheduled Granaries, and the Grade 1 Mall Gardens, which all lie close to the proposed observation wheel.\nQuoting from the Grand Harbour Local Plan policies which relate to Building Heights in Floriana, the NGO said it is objecting on the grounds that “no development will be permitted which detracts from views of and from UCAs”.\n\nThe objection also points out that according to SPED (the new structure plan) “no development within historic sites should be permitted unless it ensures that the historic site’s skyline is not adversely affected”.\nRELATED STORIES'The ugliness around us is our own doing'Could traditional streetscapes end up only being seen in coffee table books?\n\"The proposed application for a private business proposition intends to capitalise on the views of Valletta’s World Heritage walls and its harbours; it departs heavily from permitted policies, lacks sensitivity to the historic character of Valletta and Floriana, and should be dismissed, says Din l-Art Helwa.\n\"Furthermore, this kind of entertainment structure, passing off as an observation point, will inevitably bring further clutter in the way of refreshment and catering areas, ticketing booths and visitor facilities. St Publius Square, its unique collection of historic silos, its adjacent parking zones and shaded spaces are public areas which should not be taken up to facilitate an individual business proposition, but should be left free and unencumbered\" Din l-Art Ħelwa said.\nIt urged the Planning Authority to dismiss this proposal outright. ", "comment_count": 41, "id": 126}, {"keywords": "Planning Authority, Environment", "author": "Philip Leone Ganado", "article_body": "Moviment Graffitti has filed an appeal against the approval of a large fuel station outside the development zone in Burmarrad, the environmental group said on Tuesday.The Planning Authority last April approved the ‘relocation’ of a small kerbside pump to around 3,700 square metres of agricultural land off Triq Burmarrrad, in a development including a car park and retail outlet. Only around 1,700 square metres of the site will be built up, with the rest landscaped. In a statement, Moviment Graffitti said it had chosen to appeal the “outrageous” decision as the PA had “chosen to blatantly ignore even the minimum and insufficient environmental safeguards” provided by current planning policy. The Fuel Stations Policy specifically prohibits the development of such facilities on “good quality” agricultural land, and the Burmarrad site had been certified as “good quality” by the PA’s own agricultural advisory committee, which said it could potentially support an agricultural yield valued at about €27,000 a year.\nRELATED STORIESFuel stations could be cut down to size by new policyNew fuel station should await policy review - ERA\nHowever, the PA case officer had recommended approval as the land was not designated as an area of agricultural value and as the policy allowed such developments if “the community would benefit from the relocation” and there were no “unacceptable adverse environmental concerns”.Moviment Graffitti said it was also appealing as the overall size of the development was above the 3,000 square metre maximum footprint allowed by law, and over issues such as a lack of complete documentation available to the public, as well as other policy concerns. “This decision by the PA board is the perfect example of how the planning process in Malta is systematically leading to the destruction of our country in order to satisfy the greed of the few,” Moviment Graffitti said.“To make sure that developers are totally accommodated, the PA board shamelessly ignores even the feeble safeguards provided by the PA’s own defective policies.”\nA revised version of the controversial Fuel Stations Policy, promised back in January 2018, was finally published in April, just days after the Burmarrad station was approved. \nThe revised version - which is still at least months away from being implemented - reduces the maximum footprint to 1,000 square metres and tightens the restriction to exclude all agricultural land. \nMoviment Graffitti has since called for a moratorium until the new policy is implemented, arguing that there would be no point in proposing changes if the currently pending applications continued to be decided under the old policy even as it was being ushered out. ", "comment_count": 20, "id": 127}, {"keywords": "Accident, Traffic", "author": "Claire Caruana", "article_body": "Half of the deaths that occurred on Malta's roads between 2015 and 2017 involved pedestrians, a report by the European Transport Safety Council has revealed. \nResearchers analysed data on urban road safety across the European Union, including Malta.\nThe report also shows that, apart from pedestrians, there were also deaths involving persons who were in cars or taxis. These accounted for 32 per cent of road deaths while a further 18 per cent of the fatalities involved those riding two-wheeled vehicles. \nOverall, a total of 9,500 people were killed on urban roads in the EU in 2017, accounting for 38 per cent of all road deaths. 70 per cent of those killed on urban roads were vulnerable road users: 39 per cent were pedestrians, 12 per cent cyclists and 19 per cent powered-two-wheeler (PTW) riders. Car occupants accounted for 25 per cent of all roads deaths on urban roads, the report shows. \nOn the total number of road deaths over the three-year period reviewed, Malta registered the highest number in 2017, when 19 lives were lost. In the previous year, the figure stood at 14 while in 2015, 10 people had been killed.\nAccording to data issued by the National Statistics Office earlier this year, there was a slight decrease in the number of accidents over the previous year. While not included in the European Transport Safety Council report, the NSO data showed there were 18 fatalities in 2018.\nOn serious injuries as a result of traffic accidents, the report showed that 30 per cent of the cases involved pedestrians while a further 30 per cent involved those in cars. The figure was slightly lower, just under 30 per cent, for those injured while on two-wheeled vehicles. \n ", "comment_count": 1, "id": 128}, {"keywords": "Properties, History, Pieta’", "author": "Claudia Calleja", "article_body": "The Guardamangia villa, which served as the residence of Princess (later Queen) Elizabeth between 1949 and 1951, is up for sale for €5.9 million.\nQueen Elizabeth II and the Duke of Edinburgh spent the first years of their marriage living at this villa when the Duke was in the Royal Navy and stationed in Malta. According to the Queen the time she spent living there was the happiest in her life. It was the only place outside the UK which she called home. \nThe property enjoyed open views of Marsamxett and Valletta at the time. While being spacious, it also has a huge garden.\nThe privately owned Villa Guardamangia is scheduled as a Grade 2 monument and is in a dilapidated state.\n\nThe Queen was driven past the villa during a visit to Malta in 1992 and presented with a painting of the building when she was in Malta again in 2015.\nOver the years heritage organisations, including Heritage Malta and Din L-Art Ħelwa, have spoken about the need to restore the historical building.\nIn March, the Head of Operations at Heritage Malta, Kenneth Gambin, was reported saying that the government wanted to acquire the property in order for it to be restored.\nThe royal couple photographed at Villa Guardamangia by Frank Attard. British media had wondered at the time whether Prince Philip was indicating a second baby on the way.\nHe added, “apart from this, talks are being held with the Royal Family to see what tangible interest there may be for them to support this project. A preliminary estimate has been made, and a survey carried out to determine how much the restoration of a building which is such a bad state would amount to. The talks are still ongoing.”\nThe property is now up for sale on a number of estate agent websites, where it is described as “an amazing grand Palazzo style property located just outside the outskirts and suburbs of Valletta, set just at the crest in the residential area of Guardamangia. Property is a grade 2 building with documented great historical value and measuring 1,560sqm… The property is just crying out for a great conversion and will make a superb residence or possibly a commercial venue.”\nEnvironment NGO Flimien Għal Ambjent Ahjar said it was delighted that Villa Guardamangia was on the market and urged the owners and Heritage Malta to come to an agreement before further deterioration takes place.\n\"It is of the utmost importance that this fine historic building that has a place in the national collective memory is restored and made accessible to the public. At this time of economic boom this should be a priority, also as Malta is losing so much heritage to development, and because such a museum would be a great tourism asset,” the NGO said. ", "comment_count": 35, "id": 129}, {"keywords": "Migration, Military", "author": "Ivan Martin", "article_body": "A group of 97 migrants has been brought to Malta after being rescued by an Armed Forces patrol boat on Monday night. \nTheir arrival was the second big group in less than a week - 370 migrants were rescued and brought to Malta on Wednesday. \nWhile some of the migrants were believed to be Nigerian, an AFM spokeswoman said nationalities were still to be ascertained. The group included two women and two children.\nRELATED STORIESLawyers accuse EU of 'crimes against humanity'\nUpon landing in Malta the migrants were handed over to the police and transported to the Marsa Open Centre to be documented.  \nThe UN has risked of unprecedented tragedies in the Mediterranean amid a clampdown on NGO rescue ships and the conflict in Libya hastening departures at an alarming rate.\nAccording to data from UNHCR and the International Organization for Migration, almost 350 have died en route – putting the death rate for those crossing at more than 15%.", "comment_count": 0, "id": 130}, {"keywords": "Health, Research", "author": "Sarah Carabott", "article_body": "Successful research depends not on the size of the country, but the professional expertise of the people located there, according to the founder of an organisation that has just invested €2.5 million in cancer research equipment in Malta.\nThe equipment includes a number of cutting-edge devices that allow for highly accurate, in-depth examinations that range from analysis of DNA fragments, to the capture of tumour cells circulating in the blood and the identification of cancer bio-markers.\nThe Emanuele Cancer Research Foundation Malta, co-founded by Barone Professor Emmanuele Emanuele, has invested €2.5 million in cancer research equipment in Malta.\nThe investment was presented by the Emanuele Cancer Research Foundation Malta, which is a tripartite collaboration between the Malta Trust Foundation, the University of Malta and Fondazione Terzo Pilastro Internazionale.\nPresident of Terzo Pilastro, and co-founder of the cancer foundation, Barone Professor Emmanuele Emanuele, was asked about the effectiveness of research in such a small nation state.\nSuccessful research did not depend on the size or dimensions of the location in which it was carried out, but rather on the qualifications and professional expertise of the researchers who devoted their efforts to its success, Prof. Emanuele said.\nHe added that the foundation was located at the University, which had all the latest equipment and has been working on the cancer issue for a decade. The University was “a top-flight structure at the forefront of research into this daunting pathology,” he said.\nThe foundation was created with the purpose of reducing the burden of cancer on the people of Malta, the Mediterranean and globally. But why Malta?\n“Because of Malta’s location in the very heart of the Mediterranean,” he said. \n“Throughout its history, the island has had a relationship with nearly all Mediterranean countries, and also – through its culture and traditions – with France and England, plus, naturally, Italy.”\nMeanwhile, Malta Trust Foundation chair Marie-Louise Coleiro Preca believes that through its research endeavours, the foundation would be able to tackle the social, cultural and environmental factors contributing to the risk of cancer.\nIn so doing, it would support and promote “world-class cancer research, by taking the lead and redirecting important funding opportunities into cancer-related collaboration among national stakeholders”.\nThrough another collaboration with the Malta Trust Foundation, Fondazione Terzo Pilastro also sponsors scholarships for Maltese students at LUISS University in Rome.\nThe Mediterranean-wide project kicked off in 2017 to provide advanced education to students with limited financial means. Petra University in Jordan and the University of Malta are project partners.\nBeneficiary Anthea Aquilina has been reading for her bachelor’s degree in economics and business at the LUISS since 2017, while the selection process is under way for two more Maltese students. \n“This one-of-its-kind initiative in Italy and the rest of Europe is designed to facilitate access to education for young people who otherwise would be unable to freely invest in their future. \n“Poverty can keep students from following their professional dreams,” Prof. Emanuele said.", "comment_count": 0, "id": 131}, {"keywords": "Construction, Environment, Planning Authority", "author": "Ivan Camilleri", "article_body": "The Planning Authority was forced to issue an enforcement order against a number of contraveners, including construction magnate Joseph Portelli, as works on the assembly of an illegal concrete batching plant in Gozo continued unabated despite an order to stop.\nIndustry sources told the Times of Malta that last week, after the illegalities were revealed by Times of Malta, PA officials turned up at the quarry in Kerċem, and ordered all works on the assembly of the massive batching plant to stop.\nHowever, the sources said that as soon as the PA officials left the area, trucks could be seen once again in the area and workers continued with their work despite the regulatory authorities’ strict orders.\nAsked about the developing situation, a spokesman for the Planning Authority confirmed that its orders had been ignored and that the authority had no other option but to proceed with a formal contravention order.\n“The Enforcement Directorate has initiated formal enforcement procedures against the contraveners in view that instructions to cease works last week have not been complied with,” the PA spokesman said.\nThe Times of Malta is informed that prior to an official enforcement notice, the owners of the illegal batching plant were instructed both verbally and in writing to halt immediately their illegal actions.\nAsked to state who the owners of the illegal batching plant were, the PA did not give details.\nHowever, the enforcement order has been issued primarily against Mr Portelli, of J. Portelli Projects, and Mark Agius, known as Ta’ Dirjanu, a partner of Mr Portelli in various construction projects across the island.\nThe PA’s warning was also issued against Carmel and Michael Cauchi, the operators of the quarry known as Ta’ Qasam San Pawl and against the Lands Authority which owns the public land.\nIndustry sources said that while the second-hand batching plant was imported from Sicily by Mr Portelli and Mr Agius, it was being assembled inside the quarry, which officially is leased by the government to the Cauchis.\nSecond-hand plant imported from Sicily\nThe sources observed that according to current laws, the Cauchis are precluded from leasing government property to third parties. \nIt is not yet known what, if any, is the connection between the quarry’s operators (the Cauchis) and the importers of the batching plant (Portelli and Agius).\nLast week the Times of Malta revealed that for the previous two months, a massive concrete batching plant was being built inside a Kerċem soft stone quarry without any permit. Despite that works were known to many Gozitans in the in-dustry and everything was happening in broad daylight, the PA said that it only got to know of the illegal operation through this newspaper.\nIndustry sources questioned why, despite their defiance of orders given to halt the works, the PA has still not sealed-off the batching plant and ordered its dismantling.\nThe Kerċem quarry is also the subject of various enforcement orders pending for years.\nTwenty-one years ago, in 1998, the operators of the quarry were ordered to stop extending the perimeter of the quarry illegally and not to continue to extract soft stone from public land that did not form part of the permitted quarry.\nDespite pending direct action by the PA to stop the illegalities, the quarry kept expanding over the years, with stone quarried illegally put on the commercial market and used in various construction projects. In 2008, the quarry operators applied to sanction the illegalities through architect Carmel Borg, a former Labour MP.\nThe application is still pending and no decision has been taken yet by the PA.\nPart of the second-hand batching plant being transported to the quarry.", "comment_count": 55, "id": 132}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers.\nTimes of Malta reports that assembly of an illegal concrete batching plant in Gozo has continued unabated despite a PA order to stop.\nIt also reports that an MZPN report has criticised the party leadership for the current state of the party. \nThe Malta Independent focuses on Monday's meeting of the PN parliamentary group. Party leader Adrian Delia was quoted as saying that the group will meet every day until necessary. It also reports that the finance minister is considering the setting up of a unit to detect organised economic crimes.\nl-orizzont gives front-page prominence to the launch by the Ministry of Health of robots which will deliver medicines in hospitals. It also says parents are anxious to know who will prepare Maths and Maltese exam papers for secondary schools in view of a government dispute with the teachers' union.\nIn-Nazzjon leads with the swearing-in of new MP Kevin Cutajar and his promise to live up to the confidence shown in him. It also reports that a woman who was rescued from a collapsing building in Mellieħa on Saturday has not been helped since.", "comment_count": 0, "id": 133}, {"keywords": "Beach, St Julian’s, Tourism, Environment", "author": "Ivan Martin", "article_body": "St Julian’s mayor Albert Buttigieg wants assurances that the hotel forking out the cost of replenishing Balluta Bay with sand will not want anything in return.\n“While the Local Council was ignored and not informed of the dealings with a private commercial vested entity to replenish the beach, we need to be assured that the bay will not be privatised, in part or in full,” he said.\nMr Buttigieg was reacting to the announcement that Balluta Bay was one of three sandy beaches across the island that would be replenished with sand over the coming weeks.\nSt George’s Bay in Birżebbuġa (outside the Al Fresco restaurant), and Għar l-Aħmar Bay in Marsaxlokk, will also be ex-tended by some 25 metres using sand dredged up from the seabed.\nWhile these two bays would be replenished by the government, Balluta Bay, which had already been included in a pilot project last year, will be funded by the nearby Marriott Hotel (formerly Le Méridien).\nTourism Minister Konrad Mizzi last week announced that the hotel owner had pledged to rejuvenate the bay for the next five years.\nWe need to be assured\nThe sand at Balluta Bay had largely disappeared beneath the surface just a few months after the €110,000-replenishment pilot project had been finished last year, with many questioning the point of having brought up the sand for just a few months in the first place. \nThe Tourism Authority has however defended the project, saying that although the sea levels had at times risen above the sand, much of it remained in place after storms had passed.\nOn announcing the deal, Dr Mizzi last week promised the bay would not be subject to any concessions and would remain fully open to the public.\n“There will be no sunbeds cordoning off the bay, it will remain open to the public,” he said.\nMr Buttigieg, however, expressed his doubts over the arrangement.\n“Are we to be considered naive enough to think the hotel is doing this out of the goodness of its heart and expect nothing in return?” he asked.\nMr Buttigieg also asked what would happen after the five-year period had elapsed, and whether there were any contractual agreements that could be reviewed by the council.", "comment_count": 74, "id": 134}, {"keywords": "Parliament, Justice", "author": "Luke Scicluna", "article_body": "The Opposition will be voting against amendments to split the dual role of the Attorney General as public prosecutor and lawyer to the government, MP Carmelo Mifsud Bonnici said on Monday.\nDr Mifsud Bonnici said during the first reading of the State Advocate Bill the Opposition had no choice but to vote against it due to the fact that the government had failed to allow for the selection of the Attorney General by a two-thirds majority of the House.\nThe proposed amendments would create the new role of State Advocate, taking over the current Attorney General’s role as primary consultant to the government on legal issues, while the Attorney General office would retain its penal law functions.\nPresenting the bill, justice minister Owen Bonnici said that although the consolidation of the two functions had been preserved by various governments at various stages in Malta’s history, it was now time for it to change.\nHe stressed, however, that the system currently in place was not improper or in violation of human rights, and had been vetted and approved prior to EU accession.\nAttorney General to get new prosecution powers\nWhile the office of State Advocate would be created from scratch, he said, the Attorney General would in turn gain new powers to prosecute. The incumbent Peter Grech, Dr Bonnici said, had met with “unjust” criticism as a result of the fact that the power to initiate prosecution did not lie with the office of the Attorney General but with the Commissioner for Police.\nRELATED STORIES'A parody': legal scholar slams proposed changes to AG roleWhat the Venice Commission said about Malta\nCurrently, the police both investigate and prosecute, but the latter power will gradually pass to the Attorney General's office under the new law.\nDr Bonnici said this change would begin with more serious offences, with the list of offences to which this applied being added to in time in order to avoid a shock to the system and to allow the new Attorney General's Office to build a complement of lawyers experienced in the exercise of the new functions of that Office.\nIn the meantime, the police would gain a new Prosecution Unit, which would continue to fall under the structures of the Police Corps whilst taking direction from the Attorney General.\nThe State Advocate will enjoy the same security of tenure as the current Attorney General, and both offices will be appointed by the Prime Minister’s recommendation to the President, following a public call and after an Appointment Commission had expressed its views.\nProposals do not address key issues - Opposition\nDr Mifsud Bonnici, however, said the government’s attitude sought to bank on the Opposition’s calls for reform in the sector by assuming that the Opposition’s credibility would be damaged if it failed to vote in favour of the bill despite the omission of its key proposal, that of consensus in the appointment of the Attorney General.\nThe Opposition MP also pointed out that the Government had not brought the Bill before the House with the consent of the Opposition, which was long-established practice for laws involving constitutional amendments.\nBy presenting it in Parliament without having first obtained feedback from the Opposition, the Government was showing that its rhetoric about consultation and consensus was simply keeping up appearances.\nDr Mifsud Bonnici cautioned the Government with respect to overlap between the two functions of State Advocate and Attorney General. He insisted that if the two offices were to remain functionally separate, they should have physically separate premises and separate personnel.\nApproving of the introduction of an annual report which each office would have to submit to the Minister, and which would detail the work accomplished by each office during the year, he suggested that this report be discussed before a Committee of the House if not in plenary.\nEarlier, civil society NGO Repubblika called on MPs not to back the amendments, which it said did not address address \"the grave concerns of the Venice Commission on the set-up and the independence of the Attorney General\".\nThe group said the changes forces one of the new roles to report to the other, meaning the functions were not really separated, and did nothing to alter the Prime Minister's exclusive power of appointment.", "comment_count": 14, "id": 135}, {"keywords": "Transport, Traffic", "author": "Keith Micallef", "article_body": "Revised plans to widen main roads in Attard and build a new bypass in the town have been submitted, with farmers in affected areas being told works on the project, dubbed Central Link, will soon begin. \nAround 400 trees and a vast tract of agricultural land will be removed if the latest version of the plans get the go-ahead. However, the government is pledging to mitigate these losses by planting hundreds of trees.\nThis move had been announced in reaction to the first version of the plans which were published by the Times of Malta last year.\nFarmers told to prepare for works\nA farmer who spoke to the Times of Malta on condition of anonymity revealed that he was recently told by Infrastructure Malta employees that works were due to start at the end of this month, even though the permit has not been issued yet.\nHe said that a few days ago Infrastructure Malta employees turned up at his farm in Attard “to take measurements”.\n“I was told to start preparing to vacate the land as works were due to commence at the end of June,” he said.\nDenouncing this project as it would result in the complete destruction of his farm, he questioned why the government did not consider other options which would have had a much less negative environmental impact.\n“Why are we being treated differently from the Paceville and Pembroke area where the government has just announced plans to excavate four tunnels to alleviate traffic?” he questioned.\nControversy from the start\nUnveiled in May last year, the project aims to mitigate traffic in Attard by widening existing roads and the construction of a new bypass on the outskirts of the village. The project immediately fuelled controversy due to the environmental impact, forcing Infrastructure Malta to revise the plans multiple times.\nA few days ago fresh plans were submitted to the Planning Authority. It transpires that the project will result in the uprooting of about 200 trees while a further 200 will be transplanted.\n\nWhen compared to the first version of the plans it is a marked improvement as fewer trees will be disturbed, particularly in the stretch between Mount Carmel Hospital and the bottom of Saqqajja Hill. Plans were also submitted for the planting of hundreds of trees along the entire stretch of the 4.3-kilometre road.\nPlans were also submitted of the structures which will have to make way – these range from agricultural underground water reservoirs to greenhouses, rubble walls and in some case large buildings.\nThe most notable demolition will be that of an old building close to St Paul’s chapel, to make way for the new bypass which will be adjacent to Triq Ferdinandu Inglott, Triq Tumas Chetcuti and Triq Oliver Agius – all of which are residential roads.\nPermit pending\nThough the project is still at planning stage, events in recent days indicate that the granting of a permit seems to be a foregone conclusion.\nLast year, Infrastructure Malta had flouted planning procedures by encroaching on private land as part of a widening project of Triq Tal-Balal between San Ġwann and Naxxar. It was only at a later stage that it sought to regularise its position.\nTimes of Malta sought an explanation from Infrastructure Malta why it had already planned to start works this month, even though no permit had been issued.\nIn a lengthy reply, a spokesman confirmed the permit was still pending but pointed out it was planning in advance to start straight away if the Planning Authority gave the green light.\nHe also said the agency was liaising with the Lands Authority to complete the lease termination and expropriation processes for the land required, subject to permits.\n“The indicated site visit forms part of the ongoing preparatory process, so if the permits are issued, this long-overdue infrastructural improvement can be completed as soon as possible,” he said.\nAs for the environmental cost of this project, the agency said it was much less than the original plans drafted in 2006. ", "comment_count": 4, "id": 136}, {"keywords": "Traffic, Transport", "author": "Matthew Xuereb", "article_body": "Residents of Triq il-Wied ta’ Ħal Balzan are fuming over the mess in their road which was meant to have been completed way back in September last year.\nInstead, they are having to endure months of mud, dust, dangerous pathways and even the stench of raw sewage.\nThe road project had been officially announced by Infrastructure Minister Ian Borg in June 2018, with a promise that it will be concluded by September. But the Balzan road, dubbed one of the worst in Malta, is still in a state “as if it’s a road in a third world country”.\n“We’re really fed up. It is true that if you want to upgrade, you have to make sacrifices but I think we’ve made too many of these now,” one angry resident told the Times of Malta.\n“We were promised it would be ready in three months and although it’s a stretch, we were ready to put up with it. But it’s almost a year now and there’s no end in sight,” another resident lamented.\nLast week, residents also had to deal with raw sewage which filled one of the many trenches dug up by the contractors working on the project.\nWhen contacted, a spokesman for Infrastructure Malta said the project has now reached its second phase and was expected to be completed by October.\nHe said that after the agency’s contractors completed the first phase, which saw the reconstruction of the southern part of the road, work was under way on an overhaul of kilometres of underground networks and the rebuilding of the entire road structure. The final asphalt layer of this stretch of road will be laid along with the rest of the road when all other works were ready.\nThe second phase, currently in progress, includes the reconstruction of the northern end of the road, from Triq it-Tabib J. Zammit to the Iklin roundabout. \nThe project along this 500-metre road includes 1.2 kilometres of new pavements, reinforced foundations, more than 3.4 kilometres of new underground water, sewage, internet and other telecommunication networks and the upgrading of the existing storm water catchments and pipelines.\nThe spokesman said that to place new sewers, trenches deeper than 2.3 metres – in some areas reaching over five metres below ground level – were being dug up.\nHe explained that contractors were unearthing cables that were not marked – a decision was therefore taken to dig trenches in small stretches to minimise more inconvenience.\n“The agency is closely following all works by its contractors to make sure that any unnecessary delays are avoided and that other inconveniences are minimised,” he said.\n“At the same time, it needs to make sure that the ongoing trenching works are carried out very cautiously, also without putting the workers’ safety at risk or damaging existing infrastructure,” the spokesman added.", "comment_count": 4, "id": 137}, {"keywords": "Animal welfare, Tradition, Marsaxlokk", "author": "", "article_body": "Dog rescue NGO Island Sanctuary is bracing itself for another summer of trying to keep rescued dogs from running away at the sound of fireworks.\nDogs are “traumatised” by fireworks, Island Sanctuary head Claire Gafa said, adding how rescued dogs often panic and try to run away as soon as they hear the ‘traditional’ sounds that mark every town and village feast.\nIsland Sanctuary volunteers had spent days looking for Pippa, a 10-year-old dog who had run away after someone let off fireworks close to the dogs’ shelter in Marsaxlokk.\n“Last Tuesday, 12 strong petards were let off near our sanctuary, literally shaking the ground,” Ms Gafa said. \n“Most of our dogs were running, as usual, inside the sanctuary and as soon as the first petard was let off, they went berserk,” she added.\nMost of our dogs were running, as usual, inside the sanctuary and as soon as the first petard was let off, they went berserk\n“We managed to gather all the dogs except for one, which ran away in shock.”\nPippa was found later that week, scared and alone close to Fort San Luċjan in the same town.\nAnimal welfare officers were called on site to identify the dog, who was then taken back to the shelter, Ms Gafa said.\nVolunteers at the shelter had already started fearing the worst, Ms Gafa added. The dog, who had been living at the shelter for five years after her owners abandoned her, was naturally timid, Ms Gafa added.\nRELATED STORIES'Fireworks cause animals stress, injuries, phobias' - expertsHow to keep your pet happy in firework season\n“When Pippa was startled by the fireworks, she ran off with no idea where it was going,” she said.\nMs Gafa insisted sanctuaries should be informed in advance of when fireworks were going to be let off. “We are worried every summer, but usually we can plan ahead. They would still be very afraid if we were informed, but at least they would not get lost,” she said.\nFireworks are a staple of Maltese feasts, but animal lovers have long warned petards could affect animals’ well-being.\n\nMalta Veterinary Association secretary Maurice O’Scanaill had told the Times of Malta that the production of eggs or milk could decrease because of the stress caused by firework blasts.\nStartled animals could also suffer physical injuries from jumping over high walls or breaking through wired fences.\nVeterinarian Sammy Bezzina echoed Dr O’Scanaill’s concerns and said dog owners, especially those who live in central Malta, sought vets’ assistance for their terrified dogs every summer.", "comment_count": 5, "id": 138}, {"keywords": "Planning Authority, Architecture", "author": "", "article_body": "A government scheme to help finance the restoration of building facades was gobbled up within an hour of applications going live on Monday. \nIn a statement, Infrastructure Minister Ian Borg said it was the \"greatest satisfaction\" to witness the public participate in the initiative.\n\"We can announce with pleasure that this year, the ‘Irrestawra Darek’ scheme was taken up by the public within an hour – this means that across three years, we will have invested €23 million towards the conservation of our country’s architectural heritage,\" he said. \nRead: the return of the scheme was announced last year \nThe quick take-up, Dr Borg added, was a clear sign that the public was keen to invest in their property and rehabilitate cultural heritage. \nToday was the official opening of this scheme and within seconds applications came flying in. Within 60 minutes the Planning Authority had received more than 750 online submissions with requests amounting to more than €8 million.\nThe scheme is now officially closed for this year when it comes to private residences in Urban Conservation Areas and Grade 1 or Grade 2 scheduled residential buildings.\nMeanwhile, the PA is still accepting submissions for the restoration and conservation of streetscapes, a new category with €1 million reserved for the conservation of residences forming part of a single unique road.\nSo far, the authority has already received 12 submissions of this type, it said.\nPlanning Parliamentary Secretary Chris Agius said the scheme had helped more than 1,700 residents over the last two years.\n\"We are satisfied to see more Maltese and Gozitan families benefiting from these initiatives,\" he said.\nPlanning Authority Executive Chairman Johann Buttigieg said the PA had never seen so many online submissions.\nFor the third consecutive year, the ‘Irrestawra Darek’ scheme had been a success story, he said.", "comment_count": 15, "id": 139}, {"keywords": "PN, Adrian Delia, Politics", "author": "Keith Micallef", "article_body": "Nationalist Party leader Adrian Delia insisted that his future at the helm was neither on the agenda nor raised during a parliamentary group meeting held this afternoon at the party headquarters in Pieta.\nHowever, he said that the group would be meeting again for as many times as needed, starting on Tuesday, in order to decide on how the PN should move ahead following last month’s electoral setback.\nThe meeting which lasted two-and-half hours was the first one in almost two months.\n“We will meet again until we come out united in our will, so that every one of us will know who, how and what needs to be done, and I must be convinced that everyone has this will,” he said in comments to the media which gathered outside the party headquarters.\nDr Delia speaks to the press following the meeting. Video: Matthew Mirabelli\nSources said that towards the end of the meeting Dr Delia asked those present if they intended to contest the next general election under the party ticket. This move raised eyebrows in the wake of the PN leader’s recent comments on #TimesTalk that he was not entirely happy with the group of MPs at his disposal.\nHowever, due to the fact that the first hour was dedicated to a Bill for the setting up of the Office for the State Advocate, which was due to be debated a few hours later in Parliament, there was not enough time to go into further detail and the meeting was inconclusive, sources said.\nMŻPN report\nAsked for his reaction to the MŻPN report on the current state of the party, at the end of the meeting Dr Delia said he would be holding talks with the youth wing's president Joe Grech on Tuesday to discuss its contents.\nHe added that he looked forward for a “serene” meeting to analyse areas for improvement while noting that youths had a crucial role to play in the changes which the party needed to make.\nComments are currently disabled as we undergo some technical maintenance. We apologise for the inconvenience.", "comment_count": 2, "id": 140}, {"keywords": "Court, Crime, St Julian’s", "author": "", "article_body": "Two drunk tourists who broke into a clothes store in the early hours of Sunday morning have ended up with suspended sentences and a €2,000 fine.\nMathieu John Fullen, 20, and Doris Robert Damour, 21, admitted to damaging and stealing from a Baystreet outlet at 4.45am on June 8 and of having been drunk and unable to take care of themselves in public.\nMagistrate Neville Camilleri took note of the two French tourists’ guilty plea and noted that they had clean criminal records.\nThe court condemned them to 18 months in prison, suspended for three years, and ordered them to fork out €1,838 to the shop owner.\nInspector Matthew Spagnol prosecuted.", "comment_count": 0, "id": 141}, {"keywords": "PN, Parliament", "author": "Luke Scicluna", "article_body": "New Opposition MP Kevin Cutajar was on Tuesday sworn in to Parliament to replace former Nationalist MP David Stellini, who recently resigned his seat to return to his former job in Brussels.\nThe motion to co-opt Dr Cutajar, a lawyer and Xagħra councillor, was moved by Leader of the House Chris Fearne, and was seconded by Opposition Leader Adrian Delia. It was unopposed.\nVisibly emotional, Dr Cutajar expressed the \"privilege\" he felt at forming part of the House of Representatives and at having the opportunity to represent the Gozitan electorate which had voted for him.\nGovernment Whip Byron Camilleri and Opposition Leader Adrian Delia both wished Dr Cutajar a fruitful tenure as MP.\nRELATED STORIESKevin Cutajar: how a blind lawyer found his wayPN youth wing slams 'untenable' situation\nDr Cutajar, who lost his sight as a teenager, was chosen to fill Mr Stellini's seat by the PN executive council on Saturday, running unopposed after a battle which threatened to split the party. \nAn initial vote on the co-option was taken and won by Jean Pierre Debono, by just two votes, but Mr Debono later said he would not be taking up the seat after it emerged that two of the executive members who cast their vote were not eligible to do so.\nThe PN leadership was then threatened with legal action by the party’s regional committee in Gozo if it persisted with Mr Debono’s co-option. During the week, party general secretary Clyde Puli called other Gozitan candidates urging them to join the race for the vacant parliamentary seat. They declined the offer.", "comment_count": 1, "id": 142}, {"keywords": "Health, Technology", "author": "", "article_body": "An army of robots will soon help distribute medicines to patients at Mater Dei Hospital, Health Minister Chris Fearne said on Monday.\nThe first of 17 distribution assisting robots, called ‘Mario’, arrived at the State hospital this week and will be used to train doctors and nurses before the eventual roll out of the new system across the entire facility by 2021.\nThe project was first announced last year. \nThe accompanying software program, known as ‘Sofia’, will form part of the distribution system which MDH’s senior management said would weed out human error and wastage of medication.\n'Mario' is not the only new way medicines will be distributed throughout Mater Dei: a second parallel system will run medicines through a maze of tubes that run through the hospital's wards to different wards, Mr Fearne explained. \nHow will it all work?\nMedical practitioners will first input individual patients’ medicinal requirements into an IT system.\nA specialised delivery trolley will then be attached to the distribution robots – much like a futuristic medicine vending machine - that can process the daily requirements of an entire ward in around three minutes.\nDoctors and nurses will then scan barcoded wrist bands issued to in-patients and the trolley will dish out their daily dosage of medicines.\nNo job losses, CEO says\nIvan Falzon, the hospital’s CEO, said the system would free up pharmacists to work more in the clinical setting, rather than sorting out medicine doses.\nA nurse stands next to the computerised trolley which will be plugged into 'Mario'. Photo: Ivan Martin\nThe introduction of automated robots, he assured, would not cost any jobs but would only assist professionals, increasing efficiency.\nRead: Robots to assist during surgery\nHow will the project be financed?\nMr Fearne told Times of Malta that although the equipment cost millions of Euros, taxpayers will not be forking out for its initial installation.\n“For the first two years we will not be paying the providers anything at all, then – based on an economic formula – they will be paid in the savings that the new system generates,” he said.\nThis savings formula was agreed upon by the consortium providing the technology and academics from the University of Malta’s Faculty of Economics.\nMr Falzon said the agreement meant that the taxpayer would still be paying the same amount to distribute medicines at Mater Dei, but the same budget would now deliver a much better performing system.\nThe consortium, made up of software firm Deenova and robotics manufacturer Swisslog, would also have an interest in maximising efficiency, he said, as this would increase their own profits.\n“This is a win-win,” he said.", "comment_count": 4, "id": 143}, {"keywords": "Crime, Court", "author": "", "article_body": "A man appeared before a magistrate twice in the same morning on Monday, after being charged with two separate crimes. \nDamian Cesare, 21, stands accused of having set a house in Żabbar on fire on June 1. He was charged with arson of the Triq Villabate property by inspector Oriana Spiteri, who also charged Mr Cesare with criminal damage and breaching a suspended sentence from May 2018, whilst under a probation order dating back to 2016.\nMr Cesare, who told the court he had no fixed address, also appeared magistrate Ian Farrugia in a separate sitting related to having breached bail conditions set in February 2018. \nInspector Joanna Piscopo asked the court to seize a €20,000 personal guarantee Mr Cesare had provided as security. \nMr Cesare, who was represented by lawyer Joe Brincat, entered not guilty pleas during both arraignments. He did not request bail. ", "comment_count": 0, "id": 144}, {"keywords": "LGBTIQ", "author": "", "article_body": "Malta’s international leadership in the promotion of equality has been recognised with the awarding of the Premio Diverso Internacional by the Spanish Diversa Global Association. \nMalta’s Ambassador to Spain Vanni Xuereb accepted the award on behalf of the country during a charity dinner on June 8 at the Palacio de Cibeles, seat of the Madrid city council.​\nEvery year, Diversa Global presents awards to institutions, companies, and individuals who have worked for, exercised, and promoted diversity in all its aspects.\nThis year, the Spanish Association of Lawyers Against Hate Crimes (AACDO), nominated Malta for the International Award in recognition of its leadership in the promotion of equal rights for LGBTI persons.\n\"The award recognises that Malta is one of only few countries in the world to have entrenched LGBTI rights in its Constitution,\" foreign affairs minister Carmelo Abela said. \n\"Malta has been a pioneer in the adoption of measures, such as the express prohibition of reparative therapies relating to sexual orientation and gender identity – the first country in Europe and in the world to have adopted this measure – among many other rights that are detailed in the annual reports of the International Lesbian, Gay, Bisexual, Trans and Intersex Association. Malta is, therefore, a clear example for the international community of a society having an inclusive and respectful legal framework for LGBTI diversity.”\nAmbassador Dr Xuereb said the government's leadership on the issue had not only led to Malta having among the most progressive legislation in the world, but also to a change in the mentality of the majority of Maltese.\nHe said Malta was also taking the lead within the EU to promote the idea that all member states should have a basic degree of respect towards minorities, treat their citizens equally, and disallow discrimination.", "comment_count": 1, "id": 145}, {"keywords": "Court, Housing", "author": "Edwina Brincat", "article_body": "Malta’s rent laws, permitting a “forced landlord-tenant relationship” for an indefinite time and at a rent far below current market value, were once again declared unconstitutional by a Maltese court.\nThe pronouncement was delivered by the First Hall, Civil Court in its constitutional jurisdiction in a case instituted by the owners of an old, spacious tenement in the historic Żejtun village core, leased to a couple in March 1995 and since transformed into their family home.\nThe tenants had carried out many repair works and improvements to the place and claimed to have no alternative accommodation.\nOn the other hand, the landlords, who had stepped into the lease entered into by their predecessors, claimed that the annual rent of €286 fell far below the current rental value of the property as estimated by an architect at €522.50 per month.\nThe landlords sought recourse before the Courts, suing the Attorney General and the lessee couple for an alleged breach of their right to the full enjoyment of their property as safeguarded under the Constitution and the EU Convention, whilst requesting adequate compensation.\nRELATED STORIESLandmark judgement opens pre-1995 leases to scrutinyCourt increases compensation to home owners over old rent laws\nIn terms of Chapter 69, The Reletting of Urban Property (Regulation) Ordinance, leases signed prior to June 1, 1995 were protected by law, thereby denying landlords the right to revise the rent in line with market prices.\nThe Court, presided over by Justice Mark Chetcuti, rejected the respondents’ argument that the applicants had freely entered into the lease agreement well aware of the existing legal regime.\nAlthough the owners had signed the agreement after the entry into force of Chapter 69, that could not be interpreted as a ‘free choice,’ the Court observed, citing European jurisprudence which declared that the landlords could not “reasonably have foreseen the extent of inflation in property prices in the decades that followed.”\nNor could the landlords’ acceptance of the rent, for a one-year term between March 2018 and March 2019, be interpreted as a waiver of their litigation rights, which waiver could only be inferred through “clear and unequivocal evidence,” the Court went on.\nAmendments to local rent laws in 2009 and 2010 offered little comfort to landlords who were forced to accept a rent that could only be revised according to “draconian” restrictions, the Court said.\nWhilst declaring that the landlords’ rights had been breached, the Court observed that the applicants had “no real hope” of regaining effective possession of their house since the current lessees had children who shared the same residence.\nAfter taking into consideration various factors, including improvements effected to the property by the lessees, the key money forked out, the difference in estimates reached by two architects as well as the ongoing lease, the Court ordered the Attorney General to pay €10,000 by way of compensation to the landlords, whilst declaring that the tenants could no longer claim protection under the current legal regime as regulated by Chapter 69.\nLawyers David Camilleri and Joseph Gatt assisted the applicants.", "comment_count": 0, "id": 146}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "A siege mentality, a divide-and-rule approach, attacks against independent media and a sense of denial within the PN following two historic defeats are to blame for the current state of the Nationalist Party, according to an analysis by the party’s youth section, the Moviment Żgħażagħ Partit Nazzjonalista.\nThe document was presented to PN secretary general Clyde Puli last Saturday\nIn its introduction it acknowledges that lack of unity existed even before Adrian Delia was elected leader, but the handling of the situation in recent months  “left much to be desired”. \nTo this day people are being marginalised or attacked simply for refusing to fall in line, the report states. Moreover, it warns that such approach has managed to turn not only the people against the current leadership, but the traditional and non-traditional party voters against each other.\nIn its analysis the MŻPN blames the leadership for failing to take into consideration any ideas contrary to the ones it clings to. “Any criticism is repelled with internal or even very public attacks that leave it red-faced at the end of it all” the report remarks. \nThe MŻPN said Delia's leadership did not take criticism on board.\nAnother, concern raised in the report deals with the so-called “us vs them” mentality which it is being claimed was installed from day one of the Delia leadership. One such example was the U-turn on the decision to suspend former leader Simon Busuttil from the parliamentary group following the publication of a summary of the Egrant inquiry findings.\n“This case was intended to be dealt with in one way, but persons close to PN leader Adrian Delia sought to take advantage of the situation and suggested other methods, which ended up taking place. The results are well known and advertised now, and the handling of this case was nothing short of a disaster,” the report states.\nFingers were are also being pointed to those, who “labelled” certain factions within the party such as the “Daphne Crowd” - those who sought to remember and respect the legacy of slain journalist Daphne Caruana Galizia. Rather than building bridges with this group, the party dismissed such idea, the report noted.\nIn its analysis, the MŻPN also takes issue with the manner in which the party media is being run.\nDecisions to attack Times of Malta, The Malta Independent, The Shift News and civil society groups such as Occupy Justice were cited as examples of a wrong approach.\nThe report also delves into the crisis triggered by last month’s landslide defeats, saying that a strong sense of denial characterised the manner in which the leadership reacted. Remarks that only “fine tuning” was required and that “it could have been worse” were described as being atrocious and testament to the complete disaster in the handling of the outcome.\nMoreover, the leadership made the situation “infinitely worse” through what it describes as “the staged and irregular vote” on the co-option of the candidate to replace David Stellini who resigned from parliament. \nThe report also questions the siege mentality and the strategy, if any, being adopted by the party, saying decisions were taken by a few in complete isolation. This brought about an unprecedented level of distrust which was perfectly exemplified when “a gypsum wall was set up on the second floor to close off the office of the secretary general and the office of the Political Coordinator [Jean Pierre Debono] from the rest of the floor, with fingerprint access to ensure a very explicit and vivid concern of ‘no-entry’,” the MŻPN pointed out.\nSuch approach was the complete opposite of the open-door policy which the leadership had pledged.\nIn its conclusion, the document calls on those who failed, to shoulder responsibility and for the party to identify key people who unite and inspire, not shackle it to the ground. The MŻPN said it was important for the party to regain credibility and move away from the politics of yesteryear.\n ", "comment_count": 0, "id": 147}, {"keywords": "Justice, Politics, Civil society", "author": "", "article_body": "Civil Society NGO Repubblika is calling on MPs not to back constitutional amendments to separate the roles of the Prosecutor-General from the Attorney General.\nThe amendments will be debated in Parliament on Monday afternoon. \n\"It is not true that the Constitutional amendments proposed by the government address the grave concerns of the Venice Commission on the set-up and the independence of the Attorney General,\" the NGO said.\n\"All the government’s amendment does is allocate to two persons the roles of counsel to government and chief prosecutor. But the changes forces one of those roles to report to the other, meaning the functions are not really separated.\"\nThe amendments being proposed to Parliament also change nothing of the exclusive power of the prime minister of choosing the prosecutor and the attorney general.\nFurthermore, the amendments still mean that the decisions of the Attorney General are not subject to any form of judicial scrutiny, the NGO said.\n\"If the Attorney General decides to drop a case against someone who has committed a crime, the matter stops there and no one can challenge that decision.\n\"The government is ignoring the Venice Commission’s advice and is instead using them as an excuse to continue to consolidate its control on the institutions that are supposed to keep it in check.\"\nIt said that despite appeals for the government to hold broad consultations before changing the Constitution, this was not happening.\nREAD: 'A parody': legal scholar slams draft law to split Attorney General's roles\nLast March Repubblika made detailed submissions to the Steering Committee on Constitutional Reform. The Government ignored these submissions and made no reply.\n\"Parliament should not collaborate in the Government’s takeover of powers that in a democracy that deserves that name should not belong to it. Representatives have a moral duty to resist the government’s encroachment and to insist the Constitution is only changed after public consultation with experts, civil society and the public,\" the NGO said.\nRepresentatives should also insist that before piloting amendments, the Government demonstrates that it has sought the advice of the Venice Commission on any changes that claim to be made on the back of that Commission’s report. The European Commission has already demanded this.\n \n ", "comment_count": 1, "id": 148}, {"keywords": "Gozo, Transport", "author": "", "article_body": "The MV Nicolaos, the fourth ferry for the Gozo Channel fleet, arrived in Maltese waters on Monday morning and berthed at Ċirkewwa, having sailed from Greece\nThe ro-ro ferry, already in Gozo Channel colours, has been leased by the Maltese company amid an increase in passenger and car crossings and repeated complaints about long queues to board.  \nThe ship has been chartered together with its crew on a short lease while Gozo Channel seeks a more suitable vessel for longer lease.  \nThe Nicollaos was built in 1987, several years before the other ferries used by Gozo Channel. It can carry 650 passengers and 160 cars. ", "comment_count": 3, "id": 149}, {"keywords": "Court, Justice", "author": "", "article_body": "A hotel guest has been found not guilty of having sexually assaulted a waiter after a court ruled that he had only given him an awkward kiss.\nMichael James Ebzery, 67, from Australia was accused of having committed a non-consensual act of a sexual nature on a waiter at the hotel he was staying at.\nThe waiter had told his superiors about an incident where the accused allegedly kissed his neck without invitation and then made other unwanted advances. \nThe waiter testified that he was serving drinks on July 31, 2018 when Mr Ebzery, whom he recognised as a guest at the hotel, followed him into the toilet and asked him to have sex with him. Although the young man refused, Mr Ebzery had tried to initiate a sexual encounter by touching him. The alleged assault ended when another guest entered the toilets, allowing the young man to escape.\nThe waiter testified that he was a gay man and had given Mr Ebzery an address of a gay club he could go to whilst in Malta. During the encounter, Mr Ebzery had leaned in to kiss him but the waiter said he had moved away. The accused did not restrict his movement in any way.\nMr Ebzery told the court that he had come to Malta with his partner of 35 years. On the day in question, the waiter had come over to see whether they wanted a drink. He said he noticed that the waiter had an anklet and a bracelet in rainbow colours and asked him if he was gay. The waiter said he was. The two had a long conversation about their coming out as gay, he said.\nSome time later, he had gone to the beach alone as his partner was unwell and at a point had gone to the toilet and had bumped into the victim there.\nThe two got talking and he leaned in to kiss the victim, who said “no” and moved away but it was too late and the man ended up kissing his neck. Ebzery said the kiss was more to congratulate the alleged victim on coming out than anything else and he denied ever touching the other man’s private parts, saying he would never jeopardise his relationship with his partner.\nMagistrate Simone Grech observed that she was faced with two different versions of events.\nShe noted that the victim’s account to the court was “not a consistent one” and that he seemed to have inflated the incident with every version he gave to his superiors and the police.\nFurthermore the place where the incident took place was busy and it was highly unlikely that such an act would have been carried out at the time alleged. The person who allegedly interrupted the encounter was never identified or brought to testify.\nThe alleged victim had the opportunity to scream or inform this third party who entered upon the alleged incident about what was happening, but when asked, the victim simply stated that he just exited quickly.\nThe accused’s version of events, on the other hand was always the same and identical to that given at the time of the incident.\nThe court said it was of the opinion that the kiss on the neck did not constitute a sexual act and pointed out that the waiter was never restricted in his movement. Moreover, the accused had immediately stopped when he understood that the alleged victim was not giving his consent to being kissed.\nMagistrate Grech said she was not convinced that the defendant had the necessary intent for the offence with which he was charged and subsequently acquitted Ebzery.\nInspector Alfredo Mangion prosecuted. Lawyers Giannella De Marco and Gianluca Caruana Curran were defence counsel.", "comment_count": 0, "id": 150}, {"keywords": "Joseph Muscat, Politics", "author": "Ivan Martin", "article_body": "People should be more concerned about the direction Europe would head in over the next five years rather who will be leading it, Prime Minister Joseph Muscat said on Monday.\nAddressing a meeting of the Malta EU Steering and Action Committee, Dr Muscat said a lot of attention was being paid to the names of potential candidates to fill the EU’s top posts. But of far greater importance, he said, was the type of policy direction the EU will be taking.\nDr Muscat has been rumoured to be keen on taking up a top EU post and has not ruled it out, saying coyly that it would be a \"long shot\".\nOn Monday, he said the current European Commission had delivered on a number of fronts and would be a “tough act to follow”.\nThe upcoming European Council Summit, to be held at the end of this month, would be mostly “operational”.\nAmong the topics of discussion on the summit's agenda are the EU's financial framework - not just the amounts of EU funding but also funding mechanisms - and new funding challenges and priorities.\nEU leaders will also be discussing how to revise regulations on industrial incentives to encourage businesses to relocate to Europe, as well as EU freedom of movement provisions.", "comment_count": 0, "id": 151}, {"keywords": "", "author": "", "article_body": "The family of murdered journalist Daphne Caruana Galizia have filed a 31-page Suspicious Transaction Report with Latvia’s Office for the Prevention of Laundering of Proceeds Derived from Criminal Activity.\nThe STR names members of the money laundering network whom Daphne Caruana Galizia investigated and whom the family believe are connected to her subsequent murder.\nCaruana Galizia was killed by a car bomb on October 16, 2017.\n\"We hope that this report brings new evidence to light, helps authorities across Europe bring criminals to justice and helps authorities prevent more murders by taking action to end impunity for the crimes and criminal networks that Daphne Caruana Galizia investigated and exposed,\" the family said in a statement on Monday.\n\"We also hope that others will recognise that they too are able to force  accountability and will be inspired to take the necessary action to end impunity and restore the rule of law. \"\nThe family said Daphne Caruana Galizia was the only journalist who investigated Pilatus Bank before her murder on 16 October 2017.\n\"The Iranian-owned bank in Malta was possibly part of a larger money laundering network for Azerbaijani and Maltese government officials and their associates and family members.\"\nEuropean regulators ignored Pilatus Bank even when it became clear that Malta’s government was attempting to cover up oversight of the bank as it stashed away hundreds of millions of dollars from Maltese and Azerbaijani politically exposed persons, the family said.\n\"We now know, as a result of the Daphne Project’s investigations, that Latvia’s ABLV Bank, like Pilatus Bank in Malta, was a service provider to a money laundering network implicating PEPs in Malta and in Azerbaijan. Daphne Caruana Galizia was left alone to document the crimes facilitated by Pilatus Bank and the subsequent cover-up of those crimes by Malta’s government. She refused to give up or to give in and people in the network she investigated resorted to assassination.\n\"Martins Bunkus, a Latvian lawyer who fought for ABLV Bank to be liquidated involuntarily, was also murdered in a well-planned attack, just seven months later. His murder, like Daphne Caruana Galizia’s, remains unsolved.\n\"That Maltese and Latvian regulators allowed Pilatus Bank and ABLV Bank to continue operating even as evidence of serious crimes committed by those institutions was brought to light shows that the EU’s weakest states are facilitating crime throughout Europe’s internal market.\n\"The fact that two people attempting to force effective oversight were murdered in well-planned attacks, within less than a year of each other, and that in both cases the people who ordered the murders are still unknown, shows that Europe is experiencing a crime and corruption emergency and it is only a matter of time before someone else is killed,\" the family said.\nThey said they are committed to achieving full justice for her and for her investigations.\nThe only way out of the crime and corruption emergency was to continue forcing accountability and to activate judicial authorities. ", "comment_count": 40, "id": 152}, {"keywords": "", "author": "", "article_body": "The European Commission has told Malta to amend its car licensing rules to bring them in line with the rest of the bloc.\nIn a formal notice to Malta, it observed that under current Maltese legislation, cars registered in Malta after January 1, 2009 and imported from other Member States are taxed more heavily than similar cars registered in Malta before that date, even when the imported car has already been registered in another Member State.\nREAD: New vehicle registration tax announced\n“The Commission considers that the Maltese legislation is not compatible with EU law. According to the case-law of the Court of Justice of the EU, EU law is infringed where road taxes are calculated according to different criteria which lead to higher taxes being imposed on cars imported from other Member States compared to non-imported vehicles,” the commission said.\nThe Maltese authorities have now two months to reply; otherwise, the Commission may send a reasoned opinion, setting a course for legal action.", "comment_count": 119, "id": 153}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports that around 400 trees and a vast tract of agricultural land will be destroyed if the latest version of the Central Link Project plans submitted this week get the go-ahead. It also reports that the majority of minimum wage earners are women. \nThe Malta Independent says Malta has received a written warning over the post-2009 car circulation tax.\nl-orizzont says a geologist has warned of more building collapses such as that in Mellieha on Saturday. It also quotes the Commissioner for Persons with Disability welcoming Kevin Cutajar's nomination to parliament. \nIn-Nazzjon quotes PN leader Adrian Delia saying the party will move forward with its organs filled by people willing to work.  ", "comment_count": 0, "id": 154}, {"keywords": "", "author": "Ivan Martin", "article_body": "Incidents such as Saturday’s building collapse in Mellieħa would be less likely to happen if a proposed architects’ reform was enforced, according to the chamber of architects. \nA magisterial inquiry and a police investigation have been launched to determine the cause of the collapse of a three-storey Mellieħa building. Photo: Jonathan Borg\nAndre Pizzuto, who drafted the reform published by Kamra tal-Periti last month, said the likelihood of such events happening once the proposed framework is in place would be minimal. \nHe was reacting to the news that a building next door to a construction site had collapsed early on Saturday.\nBriton Maggie Smith, 77, was lucky to survive with slight injuries when the three-storey Mellieħa building came down in the early morning.\nShe had been asleep in the top floor apartment when the side of the building came crashing down, her bed just a couple of metres away from a three-storey drop. \nMs Smith was treated for shock but was released from hospital later in the day. \nNext door to the collapsed building, other houses had been demolished, the ground excavated for basement level garages, and shops and overlying apartments are now under construction.\nA magisterial inquiry and a police investigation have been launched to determine the cause of the collapse.\nAlthough the facts of the case were still emerging, KTP said it was evident this incident and similar ones in the past months were a symptom of the ‘chaos’ that prevailed in the construction industry.\nREAD: Developer: I don’t know what could have caused the Mellieħa building collapse\nThe Kamra tal-Periti has been calling for a complete overhaul of building regulatory systems since 2007, and even though the government has announced that it will reform the sector, progress remains slow. \nAt the end of 2018, the government had proposed the setting up of a Building and Construction Authority, a proposal which the chamber had supported – however this is still in the early stages of formulation and is not envisaged to be established before the end of the year.\nJust last month, the chamber issued detailed proposals for a modern building and construction regulation framework. \nThe only proposal that had so far been announced by the authorities since the collapse of another building in Gwardamanġia last April, KTP said, was a possible scheme that appeared to be merely intended to tie contractors to a code of ethics on a purely voluntary basis rather than strengthening the regulatory system.\n“Delay is not an option. The industry is in crisis. We have a complete lack of regulation of contractors, a complete lack of adequate competencies among the workforce, confusion about the various roles and responsibilities on construction sites, building regulations which date back to the 19th century, as well as a serious lack of enforcement. Unless we take immediate action, matters will only get worse,” the chamber said.\nIn view of this, KTP said it had requested an urgent meeting with Prime Minister Joseph Muscat to discuss a way forward.\nThe meeting is expected to take place this week.", "comment_count": 17, "id": 155}, {"keywords": "", "author": "Ramona Depares", "article_body": "Although society is slowly recognising the potential of people with different abilities, segregation in everyday life remains a reality for a lot of people with disabilities. Disabilities Commissioner Oliver Scicluna tells Ramona Depares that education, accessibility and employment remain the top priorities.\nWhat does the current landscape look like for people with disabilities?\nThe dynamics of society when relating to people with disabilities has changed. Today, expectations are higher. People with disabilities want more – they want more inclusion, more education and employment opportunities, more leisure options, more potential for relationships and intimacy, more autonomy… more of everything, and rightly so. This is the reality. We want control over our own lives, we do not want our lives to be decided by anyone but us.\nDuring these past five years we have seen a spike in reports of discrimination against people with disabilities. This does not necessarily mean that there is more discrimination, but simply that more people with disabilities have become more aware of their rights. In today’s society there are more scenarios where discrimination may be encountered; our lives are fuller, more complicated. I would worry more where I to witness a decrease in complaints, because it wouldn’t necessarily indicate an improvement in society.\nWhat are the areas that require most work?\nIt is no secret that accessibility on the roads is as bad as it was 10 years ago. And inclusive education is not working, we are seeing problems with the system as it currently is. Employment, on the other hand, is a positive area.\nHow so?\nWe have a stronger structure to encourage employability, and for this I can’t not praise the authorities. And it is working well because the system is enforced. Of course, there are still people with disabilities who are unemployed, or who are looking for work. There need to be created more opportunities for people with mental disabilities, for example. The government needs to work on increasing niches for employability, such as for those with Down’s Syndrome or autism.\nEmployers also need more support in this respect, in the form of guidance regarding recruitment, on-the-job support and so forth. The Lino Spiteri Foundation needs to be strengthened.\nWhy is the inclusive education system not working?\nThe more time passes, the more genuine inclusive education is in danger. I am not sure why this is happening – the fact that there are two teachers’ unions, meaning that efforts are split and there is an element of ‘competition’ – is not helping. Some directives impact vulnerable people negatively; even worse, the curriculum is outdated and doesn’t promote inclusion.\nHas not the LSA system helped in this respect?\nBeing in the classroom with an LSA is not inclusion. Inclusion happens when each person in the classroom benefits from what is happening within that same classroom. The LSA system needs better management.\nIs there still a shortage of LSAs?\nIt is not so much an issue of shortage, as it is of distribution. The way the system works means that a child is given an LSA as soon as the slightest thing is spotted – for example, in cases of a speech delay. An LSA is not needed in every case.\nDuring the first semester of 2018, between 100 and 120 pupils at kindergarten level were given an LSA, and this alarms me. Is it a case of teachers not wanting to assume responsibility?\nWhen a child who doesn’t need an LSA is given one, it can be a burden. Consider that when you join the workforce, you will not have an LSA to facilitate matters.\nOf course, once a child is assigned an LSA it is very difficult to take away the option later. Parents would be up in arms, by then the child is used to having an LSA and so forth. This is why I don’t believe in this system; I worry that we are encouraging a culture of dependence, not autonomy. LSAs should only be assigned to those who really need them. I have seen children with the same condition that I have – spina bifida – who can’t function without the crutch of an LSA. As a child, I was never assigned one and today I am autonomous. This is a difficult concept to explain to parents, of course. But today’s children have more potential and opportunities than I had when I was young, and these should not be nipped at the bud.\nHow can we achieve more inclusion within the education system?\nFor starters, the LSA system needs to be finetuned, as described above. Then there is the other issue of special schools. The idea behind inclusive education is to remove segregation, which means that special schools need to be used in moderation. I do not believe in cutting someone away from the rest of society. Children with disabilities should be attending normal schools, the same as everyone else does, and if special schooling is required that can be done within limited hours.\nCreating peripheral centres does not foster inclusion. I will not accept that more people continue being sent to these schools. Instead, we need support measures so that children can receive their education within the normal classroom. It is the duty of the education department to make sure that this happens, to fulfil its obligation of making education accessible to everyone.\nWill this help employability?\nWell, as things stand there is a lacuna between education and employment, with some people finding it difficult to transition, or to adept to fulltime employment.\nIs there a viable solution to this?\nWe need to invest in social enterprises and co-operatives. This endeavour needs to be taken seriously and to be implemented with a solid structure, following a tried-and-tested model. In this way, those who attend day centres can work alongside the rest of society.\nAnother step in the right direction was the introduction of the minimum wage for those who cannot be employed. But there are other measures that I disagreed with, such as the two-year employment programmes that come to an end when the funding finishes. Which means that you have a person who suddenly ends up with no employment, when they could be playing a productive part in society. In these cases, government has always helped identify other employment opportunities, but the system needs to be adapted so as to work seamlessly.\nThe dynamics of society when relating to people with disabilities has changed. Today, expectations are higher\nHas society come to accept that people with disabilities have a right to the same opportunities and lifestyle as everyone else?\nMostly, people have started to realise that everyone has something to offer. A look at social media is enough to show us that improvements have been made. But still, there are those who still think of us as a charity case.\nThen there is the other issue, this perception that people with disabilities are ‘superhuman’, or an ‘inspiration’. We are normal people. I am not an inspiration, I simply did everything I could to live my life the way I wanted to.\nYou mentioned that accessibility on the street is as bad as it was 10 years ago. Can you elaborate?\nIt’s a disaster. The kerbs are not accessible to people with disabilities. The positive aspect is that we are working closely with Infrastructure Malta to create guidelines that will improve the situation. We tend to complain a lot about festa street decorations because they are an obstruction, but reality is that this happens once a year. On a daily basis there is a plethora of other obstructions, and these include things that you would never look at and think twice. Garbage bags and plants, for instance. These will both stop a person on a wheelchair in their tracks. The pavements need to be obstacle-free and kept only for pedestrians, otherwise we cannot talk of accessibility.\nWhat are the other priorities?\nEnforcement, which remains a joke and needs strengthening across multiple contexts. It is useless to legislate for the accessibility of buildings, pavements and parking spots if we fail to enforce the law properly. Take the Blue Badge system; it took a lot of work to implement, but unfortunately the enforcers are not familiar with the way it is meant to work.\nOn multiple occasions, I have been informed that, when a Blue Badge parking spot is taken by someone who has no right to do so, law enforcers will call that person to remove the car. This is not what the law lays down – the law requires the car to be fined and towed. We need the enforcers to be trained to become familiar with the legal system.\nOn a positive note, the local councils do work with us very closely on these matters and our Compliance Unit is in constant liaison with them.\nIn 2017 you had suggested that Malta needs to also look into the employment of sex workers for people with a disability. Have there been any developments in this regard?\nI am being cautious about this topic. I have sounded the different opinions of people, because it is my duty to do so, but changes happen gradually in society, of course.  A group of people had communicated their wishes to me, and it is my job to deliver their message out there. I do not necessarily agree that sex workers are the best way to ensure sexual rights, but as Commissioner I cannot ignore what the people wish to discuss. I am not here to discuss my  personal agenda, after all.\nOne aspect that worries me with respect to sexual rights are recent reports about some parents being anti-sex education in schools. Such news affects people with disabilities too, as there is a need for more sex education, not less.\nWhen it comes to sexual relationships for people with disabilities, we tend to segregate. There is this perception that it is fine for some people with specific disabilities to have sex, while for others it isn’t. The latter is true particularly with respect to those with mental disabilities, such as Down’s Syndrome. I have witnessed parents ruin the relationships of their children.\nIf we take a look at the situation abroad, we will see that yes, there are couples of mixed abilities and their relationship functions well. We have caught up with this way of thinking in terms of disabilities of a physical or a sensorial nature, but we still tend to over-protect those with intellectual disabilities (inpoġġuhom f’bozza). This attitude does not augur well for any proposals regarding sex workers.\nDo you believe that this attitude will change anytime soon?\nIt will take time. And we also need to address the basics, first, such as accessibility. For now, it is more a matter of pushing for a homogenous sexual health policy, one that includes people with disabilities and doesn’t segregate them. We cannot ignore reproductive rights, for instance, and we cannot ignore what these people want. As an example, I am not in favour of abortion, but I cannot ignore that there will be women who are pro-choice. We need to discuss these issues.\nThe only thing that frustrates me about the topic of abortion is when some movements promote it in case of a birth defect. This is completely against what the Commission stands for. If we continue treating people with disabilities in this way, then we may as well close shop and go home.\nHow can we ensure that all these issues that affect people with disabilities take priority on the national agenda?\nWe need political representation by people who are familiar with the needs and the laws related to disabilities. I do not believe in quotas, but people with disabilities need to be given a real chance to get to Parliament using their own skills. What is needed to make this happen is more support, including from the political parties themselves and from the system in general. Some of the challenges can be resolved through funding; others through training and a support structure, including a strong team to assist.\nWe have seen people with disabilities succeed in politics in other countries. There is a town in Spain where the vice-mayor has Down’s Syndrome. Society believes in these people; it’s a matter of perception and prejudices.", "comment_count": 10, "id": 156}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Sovereign Military Order of Malta is planning to set up a centre where migrants can be taught a variety of trades so they can find jobs, get on with their lives and regain their dignity.\nThe Order’s Ambassador to Malta, Prince Augusto Ruffo Di Calabria, said the initiative was just one of many short-term projects being planned in line with the Order’s Christian principles of assisting those most in need.\n“We are keen to set up a place where migrants could learn. A sort of centre to teach them how to work so they can be free to find a job and make their own living or else go back to their country with something more in their hands. It is our moral responsibility,” he said.\n“They need to work and be able to make a living. We are here to help give them a future, give them hope and help them find a job, even for their own dignity.”\nThe Knights of Malta are devoted to their humanitarian mission to help those in need, as inspired by their core values of humility, respect and generosity.\n“What we do today is nothing when compared to what the Knights of Malta did in the past. \n“We are here to give a voice to those who have none and assistance to those who have no one else to turn to,” he said. \n“The Knights of Malta we see in history books did not disappear. We are not fighting battles as they did in the past but we are fighting the modern battles of poverty and solitude,” the ambassador added.\nThe care provided by the Order ranges from assisting the poor to running hospitals, helping refugees and migrants to helping children in their daily needs.\nFounded in Jerusalem in the 11th century, the Order of Malta had a long history of service to the vulnerable and the sick. \nA lay religious order of the Catholic Church, the Sovereign Order of Malta enjoyed diplomatic relations with over 100 states and was active in 126 countries caring for people in need through its medical, social and humanitarian work. It had a broad spectrum of social projects providing support for forgotten or excluded members of society.\nThe Order, which has 20,000 knights spread across the world, is recognised by the Vatican and has its main seat in Rome and Malta, where there are 110 knights.\nPrince Ruffo Di Calabria said the Order spent about €300 million a year in projects around the world. The money came from donations received from members who paid annual fees that went entirely towards humanitarian projects.\nIn Kenya, for example, the Order paid for the drilling of a borehole to provide potable water for villagers who previously had to walk almost 26 kilometres to bring water to their families. \nWe are here to give a voice to those who have none\nIn Italy, the Order manages a 240-bed San Giovanni Battista Hospital, in Rome which has a specialist neuro-rehabilitation unit for cerebral trauma patients and a specialised ‘reawakening unit’ for patients recovering from coma.\nIt employs more than 550 professionals and runs 13 health centres across Italy.\nThe various branches of the Order of Malta around the world focus mainly on care for the sick and the elderly, on homelessness and support for the lonely. \nThe ambassador said the Order was particularly concerned about the confusion created by the various “fake orders” set up around the world, including in Malta. \n“Malta recognises only one Order and that is the Sovereign Order of Malta,” he said. \n“There are several other orders that use our exact name and most of the time even our eight-pointed cross with very little variation and this creates lots of confusion. \n“The other orders collect money too but they are not as transparent as us on how they spend the funds and which projects they undertake. People must be careful which orders they choose to join.”\nThe various branches of the Order of Malta around the world focus mainly on care for the sick and the elderly.\nNational Day concert\nThe Order’s Ambassador to Malta, Prince Augusto Ruffo Di Calabria, and his spouse, Princess Tana Ruffo di Calabria, will be hosting a concert to celebrate the feast of St John the Baptist, the patron saint of the Order of Malta.\nThe concert will be held on Sunday at 6.30pm at the Republic Hall of the Medi-terranean Conference Centre, in Valletta. \nA string quartet – Francesco Manara, Massimo Polidori, Daniele Pascoletti and Simonide Braconi – will be performing together with pianist Gile Bae, from the orchestra of Teatro Alla Scala di Milano.\nThe one-hour programme will include Chopin concerto No.1 per pianoforte e quartetto d’archi and the Antonio Melchiori fantasia su Rigoletto di Giuseppe Verdi per quartetto d’archi.", "comment_count": 0, "id": 157}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A multi-million roads contract which was cancelled last year has been awarded to a company that submitted a non-compliant bid.\nThe company, RM Construction Ltd, will also be paid nearly €2 million more for the job than the €13.5 million it had quoted a year ago. The contract is for an underpass at the Tarxien-Santa Lucija roundabout.\nInfrastructure Malta and the Department of Contracts failed to explain why the tender had not been re-issued after being cancelled by the Public Contracts Review Board.\nThey said the Department of Contracts, on Finance Ministry approval, had decided to use the “negotiated procedure” clause in the Public Procurement Regulations. This allows a cancelled tender to be re-negotiated with those who had submitted bids.\nA senior government source said this was the largest tender to be awarded through the negotiated procedure in recent years following cancellation. He expressed doubts over whether this was the right application of the rules.\nThe tender was issued by Infrastructure Malta in March last year.\nSix bids were received and the evaluation committee, chaired by Infrastructure Malta employee engineer Robert Schembri, awarded the tender to the lowest bidder at €13.5 million, RM Construction Ltd. This is a joint venture between Asfaltar Ltd, Bonnici Brothers Ltd and Schembri Infrastructure Ltd.\nA week later the director of contracts was informed that RM had proposed a lower grade of concrete than that stipulated in the tender as well as omitting a central wall, an important part of the structure. In view of these shortcomings, the director cancelled the award.\nRM appealed to the contracts review board. It emerged that the evaluation committee had relied on declarations about specifications made by the bidder and failed to carry out its own assessment as required.\nThe board said the committee “appeared” to have overlooked the fact that the successful bid was not up to the requested standards and it upheld the decision to disqualify the bidder and cancel the tender.\nOnce a tender of such high value, which also includes EU funds, is cancelled, a fresh call open to all is normally made.\nHowever, the government decided to use a legal procedure to start restricted negotiations with the original six bidders.\nThen, last month, the Department of Contracts announced it would be awarding the tender to RM for €15.3 million\nAvoiding the question of why the multi-million tender was not issued afresh, both Infrastructure Malta and the department insisted the procedure was legal.\n“The PCRB’s decision was to uphold Infrastructure Malta’s decision to cancel the tender but did not enter into the merits of the process to be followed,” contracts department director general Anthony Cachia said, adding that Public Procurement regulations allow for the negotiated procedure.\nA spokesman for Infrastructure Malta said the negotiated procedure was “a competitive process open to the six original bidders” and that the latest decision was still open to appeal.", "comment_count": 108, "id": 158}, {"keywords": "", "author": "", "article_body": "Two motorcyclists were grievously injured in separate accidents on Sunday.\nIn the first, a 25-year-old man from Lija lost control of his Triumph and crashed in Marfa Road, limits of Mellieħa at about 10am. \nAn ambulance took him to Mater Dei Hospital where he was found to be suffering grievous injuries.\nThe second accident happened in Triq Royal Malta Artillery in Qormi at 1.10pm when the motorcyclist , a 49-year-old from Xghajra, lost control of his motorcycle and crashed into a trench. He too is in hospital.", "comment_count": 1, "id": 159}, {"keywords": "", "author": "Denise Grech ", "article_body": "The turmoil within the Nationalist party highlighted the need for internal re-structuring of the party’s organs, Opposition leader Adrian Delia said.\nSpeaking during an interview on NET FM, the PN leader said disputes within the PN showed that when the party discussed matters properly internally, it could move forward.\nThe party has spent the last week facing calls for the leadership’s resignation, amidst disputes regarding who should take up former MP David Stellini’s seat in parliament. The turmoil and the recent electoral defeat at the polls led the party’s youth branch to call the situation “untenable”.\n“We need to change the structures,” Dr Delia said. “We need to fill them with people who are willing to win, not only ready to criticise, but ready to roll up their sleeves and get to work,” Dr Delia said.\nHe also took aim at his internal critics, saying people were tired of hearing about division. \"Let’s talk about unity,\" he said. Let us talk about methods to attract young people, he added.\nFrom the first hour following announcement of large electoral defeats, Dr Delia said he had met people who had no experience in politics who said they were ready to help.\nDr Delia conceded, that the party administration needed to be focused and that the party’s management needed to be more precise.\nTurning to his appearance on Xarabank, Dr Delia said everyone had warned him not to attend the programme. \nThe argument was that the leader of the Opposition should debate the Prime Minister, since they were both leaders of their respective parties.\nHowever, Dr Delia said, he wanted to show he was willing to meet and debate with everyone. He also wanted to offer his fiercest critics a seat at the table, he said.\nHe also said the parliamentary group should not just meet but start working together as well.\nThere was a clear imbalance in Parliament – ministers had people in positions of trust and entire teams to help them with their work. Shadow ministers, on the other hand, did not have these teams, he said.\nMount Carmel is a ‘human tragedy happening before our eyes’\nTurning to other issues, he said Mount Carmel Hospital was a “human tragedy happening before our eyes\". He was reacting to comments by the former Chief Operations Officer at the hospital that patients had suffered freezing showers and poor conditions.\nThe government was not treating patients as people, he said. The hospital’s conditions were medieval.\nOn the collapse of an apartment block in Mellieħa, Dr Delia said the party had long sounded alarm that haphazard development would continue to result in these incidents.\nThe party was not against contractors or developers, but there were methodologies that allow for checks and balances. “I will not point fingers as to whose fault it was, but responsibility needs to be carried,” he said.\nMeetings with paid-up members to start next week\nDr Delia said he will be visiting each locality to have meetings with paid-up members each week.\n“We have to continuously follow what our paid-up members want us to do,” he said.\nHe ended his interview with an appeal for more people to join the party. “We are open to criticism, but we need more help,” he said. “For us to get stronger, we need people to help us,” he added.", "comment_count": 33, "id": 160}, {"keywords": "", "author": "", "article_body": "Yorgen Fenech, the man at the heart of the 17 Black controversy, has described as 'a blatant lie' suggestions by David Thake on Friday that he had offered the PN €50,000 if MEP David Casa was not re-elected.Yurgen Fenech\n\"Mr Thake had the audacity to falsely accuse me, without presenting an iota of evidence, of an attempt to unduly influence a democratic electoral process. I would like to make it very clear that this allegation is a blatant lie from start to finish and perhaps a result of his imagination. More importantly it exposes a cowardly and dishonest attempt to tarnish my reputation and good standing,\" Mr Fenech said in a statement.\nThe comments were made when Mr Thake was among guests who interviewed PN leader Adrian Delia on Friday night show Xarabank. Dr Delia had denied any knowledge of the claim and invited Mr Thake to go to the police with any evidence he had.\nMr Fenech said he had consistently steered away from getting involved in political bickering or public debate and always respected everyone’s right to freely express themselves even when these had included false allegations about him or his family. However there came a time when one needed to draw a line.\n\"For decency’s sake I publicly invite Mr Thake to either substantiate his claims (which he cannot do, as they are false) or do the right thing and withdraw his irresponsible statement. Failure to do so will expose his blatant dishonesty and cowardice,\" Mr Fenech said.  ", "comment_count": 120, "id": 161}, {"keywords": "", "author": "", "article_body": "Fire-fighters on Sunday morning quickly put out a grass fire near Swieqi believed to have been started by a fault in overhead power cables.\nThe fire started at about 10.35am and spread quickly.\nPeople on the scene spoke of sparks and the sound of explosions from the cables and discounted Facebook reports of an 'explosion' in an electricity sub-station.\nSome households reported a brief power outage. ", "comment_count": 3, "id": 162}, {"keywords": "", "author": "Ivan Martin", "article_body": "Incoherence within the Opposition could delay important reforms meant to pass through the House in the coming months, Prime Minister Joseph Muscat warned on Sunday.\nIn a recorded interview aired on the Labour Party's ONE Radio, Dr Muscat said that while the apparent split within the Nationalist Party could benefit Labour in the short term, it could also pose problems going forward.\n\nThe government, he said, had committed to pass a number of constitutional reforms through Parliament that required a majority of two thirds of the members to be approved.\nIf the Opposition remained fragmented then it would be more difficult to know whether these reforms would be backed by MPs or not.\nOne such reform, he said, was the PL’s proposal for an electoral mechanism to increase the number of women elected to the House.\nThe government had sought the Opposition’s position on its proposal, and even given it more time to come up with a stance, but it was so far unclear whether the PN MPs would support the change or not.\n“I don’t think the Opposition would listen to my advice if I had to give it, but I believe the country needs a uniform Opposition that agrees on the direction it wants to take the country,” he said.\nMuscat disagree with Brussels on tax concerns\nDr Muscat also weighed in on a recent European Commission report on Malta which called for reforms to the island’s tax regime.\nMalta had been accused in the Country Specific Report published by the European Commission last Wednesday of having a fiscal system which encouraged “aggressive tax planning”.\nReacting to this Dr Muscat said that Malta was one of a number of countries that had been handed recommendations about their tax system.\nHe said it was also important to have “context” when reading these reports. Malta was facing less recommendations today than in previous years having addressed issues previous flagged.\nWhen it came to taxation however, Malta had told the Commission the same thing that other countries had also said: \"We don't agree with your position\".\nMalta’s taxation system, just like those of other member states, had been approved when joining the EU, he said.\nThe Labour leader also dismissed the notion that Brussels was zeroing in on Malta, insisting that the country was no different to other member states when it came to the country specific reports.\n“The tendency might be to find the section on Malta and just read that – I do that too, but then I also read what the Commission has had to say about other countries to get the full picture of what is going on,” he said.\n ", "comment_count": 19, "id": 163}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "When Game of Thrones wrapped up its eighth and final season last month, it felt, for fans who had followed the show’s rise to one of the biggest of all times, a bit like letting go. Imagine, then, what it was like for the actors who had brought its intrigue, heartbreak and drama to life.\n“I pretty much experienced every emotion it was possible to feel,” John Bradley, who played fan-favourite Samwell Tarly across all eight seasons, told The Sunday Times of Malta.\n“I wasn’t quite sure how I was going to react at the end, because I tried to protect myself from feeling the emotion of it, but I was really genuinely very sad. It’s been my entire career: I’m 30 suddenly and the thing I’ve associated my entire life with it for nine years isn’t there anymore.”\nMr Bradley and his co-star Pilou Asbæk, who played the charismatic villain Euron Greyjoy, were in Malta last week to attend the opening of a new Planet Hollywood restaurant at Bay Street.\nIt was a first visit to the island for the pair, neither of whom had been involved when Game of Thrones had filmed much of its season in Malta, but the fans who thronged to a meet-and-greet and shared their passion for the show were a reminder for both of the sheer global scale of its impact.\nFilming most of the show in Belfast with a largely local crew, Mr Asbæk said, it was often easy to forget the millions of fans around the world hanging on the show’s every moment. “But when we did the premiere in New York this year, they shut down a whole avenue for the fans: there were like 15 or 25,000 people, and you’re thinking, ‘holy shit, this is big’,” he said.\nPeople say it didn’t end right, but I think, do you mean it didn’t end the way you wanted it to?\nWith the show’s last season, the intensity of the fan-base showed itself in a harsher light. Even as it broke all previous viewing records, the season came in for heavy criticism from fans unhappy with beloved characters’ ultimate fates or what they felt was rushed storytelling, and more than a million signing a petition for the season to be remade. The two actors, however, are sanguine about the backlash.\n“You’d rather have the fans hate something then not giving a shit,” Mr Asbæk said. “That means they’re invested in it. People have actually signed things because they’re so angry – that’s passion! The worst thing is if they don’t care. And in two years, this will stand up. Because it’s brilliant.”\nFor Mr Bradley, the criticism is a compliment to the quality of the storytelling and the psychological depth of the characters. “People don’t have that much intensity about many things,” he said. “For many people it’s like their sport: they have their favourites and the people they’re rooting for and if the people they’re rooting for lose, they’re furious. We’re very grateful for that level of investment.”\nSimilarly, he said, frustration over characters not getting the death or ending ‘they deserved’ missed the point of what Game of Thrones had always been, where poignancy and heartbreak often came precisely from people not getting what they deserved.\n“You don’t make something for people not to like it, but this show has never given people what they want; it’s always challenged them,” Mr Bradley said. “You don’t want people to be ambivalent. It’s all about the debate and the conversation and the analysis.\n\"I think all the conversation around this season had to happen. People say it didn’t end right, but I think, do you mean it didn’t end the way you wanted it to? And if it did end the way you wanted it to, where’s the joy in that? Where’s the challenge?”", "comment_count": 14, "id": 164}, {"keywords": "Health", "author": "Sarah Carabott", "article_body": "More elderly people in Maltese long-term care facilities suffer from mild depression and contemplate suicide than people in similar institutions abroad, according to new data.\nMore than half of the residents in one large facility thought of attempting suicide, while nearly 60 per cent suffered from depression, research by medical doctor Gerd Xuereb shows.\nSome 11 per cent of the latter suffered from moderately severe to severe depression.\nDepression was more common in women: 69 per cent of the interviewed female residents were depressed compared to 42 per cent of men.\n“Depression is a treatable mental health disorder and is common among the elderly living in long-term care institutions,” said Dr Xuereb, a foundation doctor who works in geriatrics and previously in psychiatry.\n“When dealing with depression and suicidality, prevention is key, so improved effort and education are needed to recognise depression and to detect increased suicidal risk.”\nDepression, he told The Sunday Times of Malta, was one of the main risk factors for suicide, so there should be efforts to raise public awareness that it was common among the elderly and could be treated.\nProfessionals working with the elderly should be trained to detect, intervene and manage depression and suicide risk, he added.\nDepression is one of the most common and treatable mental health disorders among the elderly, especially in those residing in long-term care institutions\nDr Xuereb will be one of the speakers at this month’s Malta Association of Psychiatry’s annual conference, this year focusing on preventing suicide and self-harm behaviours.\nMild depression is the most common type of depression at these care homes. The research shows that 29 per cent of men and 33 per cent of women suffer from mild depression while six per cent of men and seven per cent of women suffer from moderate to severe depression.\nAsked whether these figures were considered high, Dr Xuereb said from the findings it was evident that depression and suicidal ideation were common among the elderly living in long-term care institutions in Malta.\n“The prevalence of mild depression in Maltese institutions is higher than that in similar institutions abroad,” he said, while in the case of moderately severe to severe depression the rates are similar.”\nDr Xuereb’s research focused on deliberate self-harm and suicidal ideation among the elderly in a local long-term care facility. Suicidal ideation is when a person is thinking about or contemplating suicide.\nA total of 52 per cent of respondents (39 per cent of men and 58 per cent of women) reported suicidal ideation. Studies abroad have demonstrated frequency rates ranging from 11 per cent to 43 per cent in similar institutions.\nThe most common protective factors include religion and relatives, Dr Xuereb pointed out.\nContrary to popular belief, he said, depression was not a normal part of aging but “one of the most common and treatable mental health disorders among the elderly, especially in those residing in long-term care institutions”.\nThe elderly in long-term care institutions were normally older than those living in the community. They had greater physical and cognitive difficulties and might find it hard to adapt to their loss of independence and their new routine.\nThese circumstances all increased the risk of depression and suicidality.\nThe MAP conference will be held on June 13 and 14. Its ultimate aim is to empower professionals from all walks of life to “promote a life worth living”. Log on to www.map.org.mt for more information.\nWhat can be done?\n■ Routine and standard screening programmes to identify depression and suicidal risk;\n■ Good treatment of other medical problems such as pain that may lead to an improved quality of life;\n■ Implementation of practice guidelines for the detection and management of depression and suicidality in long-term care homes.", "comment_count": 3, "id": 165}, {"keywords": "", "author": "", "article_body": "The developer responsible for a building site adjacent to the apartment block in Mellieħa which collapsed on Saturday has insisted that all necessary precautions were taken during the works.\nGodwin Mifsud told The Sunday Times of Malta that construction works were being done according to the established standards and excavation works were carried out in January.\n“I don’t know what could have caused the collapse,” a shocked Mr Mifsud insisted.\nA woman, Briton Maggie Smith, 77, was lucky to survive with slight injuries when the three-storey building came down in the early morning. She had been asleep in the top floor apartment.\nNext door to the collapsed building, other houses had been demolished, the ground excavated for basement level garages, and shops and overlying apartments are now under construction.\nA magisterial inquiry and a police investigation have been launched to determine the cause of the collapse.\nPeople on the scene could see that the ground floor of the building which came down had been roofed with concrete slabs. Investigators will want to establish whether the excavation next door caused the wall supporting these slabs to shift, possibly leading to the collapse.\nA google maps image of the building as it was before.\nThis was the second building collapse in less than two months, following a similar case in Pieta’, reigniting debate about safety standards in construction.\nThe government expressed concern over the matter while noting that professionals involved in the industry had to shoulder their responsibilities at law. It added that assistance was being offered to the victims.\nIt reiterated its plan to set up the Malta Construction and Building Authority to consolidate and update existing legislation. At present such responsibilities are fragmented under several entities. The new law would streamline responsibilities under a single code and clearly define third-party rights.", "comment_count": 152, "id": 166}, {"keywords": "", "author": "Keith Micallef", "article_body": "More than 600 doctors have joined forces to declare their stand against abortion, saying life starts from conception and should be given the opportunity to develop.\nDoctors for Life, as the group is called, incorporates 670 doctors, the majority of whom disclosed their identity in a bid to express their strong views. The full list of the doctors who agreed to disclose their identity, including President George Vella, has been sent to Times of Malta.\nThe move came in the wake of the setting up of a pro-abortion group last month, called Doctors for Choice, which represents anonymous independent medical professionals in favour of introducing safe abortion in Malta.\nA spokesman for Doctors for Life told The Sunday Times of Malta that their principal aim was to inform public opinion on the scientific facts related to preborn children to ensure that their dignity and rights were respected.\nThere is sound scientific knowledge that fertilisation marks the beginning of a new human life with a unique and complete genetic identity and consequently this should be allowed to develop, the spokesman said.\nHowever, Doctors for Life acknowledged that certain uncommon situations could require medical interventions to save the mother’s life, which may result in the undesired loss of the child.\nAsked if this meant supporting abortion in cases when the mother’s life would be in danger, the group said that “abortion is never necessary”.\n“Specialists in the field of gynaecology in Malta for the last 35 years are not aware of any case where it would have been necessary to abort the child in order to save the mother and are not cognisant of any case of maternal death as a result of the unavailability of abortion in Malta,” Doctors for Life said.\nThe spokesman pointed out that one had to make a distinction between abortion (termination) and the induced delivery of a baby who is very young for the purposes of saving the mother’s life.\n“In the former, the purpose is to produce a dead baby, whereas with the latter the intention is to save the mother’s life, while giving the baby full care and a chance for life even if this chance is very small,” the group said.\nDoctors for Life said they rejected the arbitrary notion that some humans were more valuable than others, thus rejecting all forms of discrimination against the preborn, whether on the basis of gender, gestational age or disability.\nThe group is also advocating for the optimal care of both mother and child, saying that doctors strove, with all their energy, dedication and knowledge, to save and protect life.\n“Doctors know all too well the frustration and sadness of losing patients despite their best efforts and for this reason, in their conviction that every human life is precious, they are declaring themselves against abortion,” the spokesman said.", "comment_count": 61, "id": 167}, {"keywords": "", "author": "", "article_body": "A Swedish man suffered knife injuries when an argument got out of hand late on Saturday night.\nThe police said they were alerted to the incident in an apartment in Triq is-Snajja, Msida, just before midnight.\nThey found that a 30-year-old Swedish man who lives in Sliema was injured with a sharp and pointed object by a man whose identity is not yet known. .An ambulance took the victim to Mater Dei Hospital where he was later certified as suffering from grievous injuries.\nPolice investigations are still underway.\n ", "comment_count": 3, "id": 168}, {"keywords": "", "author": "Ivan Martin", "article_body": "Low-cost travel giant Ryanair is setting up a new airline to be based in Malta.\nIndustry sources said the Irish carrier’s holding company is in the process of setting up a new airline that will incorporate the 61 Ryanair routes to and from the island, effectively replacing it. \nRyanair has also committed, during negotiations with the government, to the generation of several other new routes and will be doubling its fleet in Malta to 10 planes, with plans to grow even further in the near future.\nThese planes, and a number of others in the Ryanair fleet, will be registered on the Maltese aviation register.\nThe low-cost market leader will also be setting up hangar facilities for repair and maintenance operations in Malta. \nThe contract signing is described as “imminent”. Talks between Ryanair’s David O’Brien and Tourism Minister Konrad Mizzi have been ongoing for several months. \nRyanair's David O’Brien and Tourism Minister Konrad Mizzi have held a series of talks.\nThe new headquarters of Malta Air, as the company will be called, will employ about 350 people within the next three years, one senior government official said.  \nThe Sunday Times of Malta reports that the government will hold golden shares in the new airline and will have a veto when it comes to issues related to sale of the airline to third parties.\n“We primarily wanted to lock in Ryanair to the island as it is the main carrier here and we have therefore got a certain level of dependency on it as a country,” a government source familiar with the workings of the deal said. \nFrom a consumer point of view, the source said, Malta Air would be priced as competitively as Ryan Air has been so far.  \nOther sources within the industry said Ryanair is also moving to grow its operations across Europe, having recently acquired Austria’s Lauda Air. Its operations to and from Malta had been among Ryanair’s best performing, which probably informed the company’s decision to choose the island as a base for a new venture. \nIndustry insiders told The Sunday Times that the Irish giant’s “show of trust” in Malta’s potential would send out the signal that the island meant business.  It has long been an open secret in the aviation sector that the government hopes to reposition Malta from a ‘holiday’ to a ‘transit’ destination.\nRyanair significantly increasing its Malta operations could help in the island’s bid to transform itself into a major hub for the sector. \n“If you follow the way the industry is changing – with the fast approaching introduction of new planes with medium to long haul capabilities – a location like Malta could start to make sense as a connecting airport,” an industry veteran said. \n\n\n\n \nThis, in part, could also explain the drive to push Air Malta into medium haul flights, cargo and legacy, as well as pipeline plans to significantly grow  Luqa airport. \nSources in the Civil Aviation Department said work had started a few months ago to recruit more personnel to handle the arrival of Malta Air. \nMeanwhile, political observers pointed out that the move could be viewed as an attempt to gradually scale back Air Malta, a perennial government albatross.\nHowever, both government and industry sources were quick to dispel concerns saying that this was “unlikely” and “illogical”.\n“It is not in Ryanair’s interest to fly Air Malta out of the sky. They hardly compete as it is anyway,” an industry expert said. ", "comment_count": 130, "id": 169}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nTimes of Malta reports how a woman was lucky to survive without serious injury after the collapse of the apartment block where she was living.\nThe newspaper also reports that low-cost airline Ryanair is to set up a new airline based in Malta. \nThe Malta Independent on Sunday says the Financial Intelligence and Analysis Unit (FIAU) wants better mechanism to monitor large cash transactions. The newspaper also says the issue over Adrian Delia's leadership of the PN was not bought up in Saturday's meeting of the party's executive committee. \nMalta Today leads with Saturday's collapse of an apartment block adjoining a building site in Melieħa. It also reports that Joe Saliba, the former PN general secretary, spoke at the PN Executive on Saturday and said the PN will not win in 2022 after losing some of its core vote. \nIt-Torċa reports that some €12m in taxes are being lost to contraband every year.\nIl-Mument says the PN Executive unanimously agreed to nominate Kevin Cutajar to be co-opted to parliament. He will take the seat vacated by David Stellini, who is returning to his old job in Brussels.\nKullĦadd says the PN's Gozitan MP Chris Said had been ready to split the party's parliamentary group.\n ", "comment_count": 1, "id": 170}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Some expats are now paying through their nose for electricity because of pre-paid meters, according to the EU Nationals Advisory Group.\nPatricia Graham, who heads the group, has been informed by the Regulator for Energy and Water Services that, according to current legislation, electricity sub-metering, including pre-payment meters, is not permissible.\nPrepaid meters in Malta charging units at €0.75\n“We have been told that each unit should be metered and billed by Enemalta. We all know that ARMS clients are charged 10.47c for the first units, then 12.98c and 16.07c for each unit.\n“We have been contacted by people who pay even 40.27c for each unit,” she told the Times of Malta following an awareness-raising meeting with human resources managers from gaming and financial services companies and real estate agents. She hopes these people, who are the first to come in touch with those settling down in Malta, can pass on information that will save them money.\nWhat started as a small EU residents action group, the EU Nationals Advisory Group has become a non-profit, free service to landlords and tenants, Maltese and non-Maltese nationals alike, who find themselves requiring help and non-legal advice during their stay on the island.\nAmong others, the founders had fought for equal treatment when it came to bus tariffs for Maltese and non-Maltese and, in 2012, Ms Graham kicked off a court case demanding equal treatment because EU nationals were being charged more than their Maltese neighbours for utility bills through ARMS’s two-tier pricing system.\nSince then, those without a Maltese ID card are being allowed to apply for residential rates through an existing form (H), previously available for Maltese only. \nThis would allow them to shift from the higher utility rates, known as ‘domestic rates’, to the cheaper ones, ‘residential rates’ paid by clients for their primary residence. \nHowever, for tenants to do so, they need their landlord to sign the form, something that some are still refusing to do. The group would be circulating a pack with all the information required by a person settling down in Malta that included how they avoid falling in some trap, Ms Graham noted.\nThe pack will includes simple tips, such as applying for the cheaper rates via e-mail, rather than in person, to have an acknowledgment receipt in hand. New settlers are also warned to document every single item in the property they are renting to ensure they are not charged for things they did not damage.\nIt has taken Ms Graham almost nine years to build the handy information pack and while some landlords’ indifference to Form H remains the group’s biggest headache, they are now dealing with pre-paid meters that see tenants being overcharged for electricity.\n“People are just giving up and leaving. We have been helping people settle in Malta for a decade,” she said.\n“I wouldn’t live anywhere else, even though I sometimes get the wrong end of the stick as a non-Maltese. I just want a fair system for all.”", "comment_count": 28, "id": 171}, {"keywords": "Environment", "author": "", "article_body": "Youths from Malta won seven international awards in the International Young Reporters for the Environment (YRE) Competition 2019 – five of them for coming first in their respective categories. Malta and Slovakia were the two countries that received the highest number of awards.\nThe submissions from Malta that won awards were:\n• An article entitled ‘Behind the world’s largest cork producer’ written by Angela Gatt and peers from Portugal, Turkey and Greece, in the International Collaboration 15 to 18 age group category;\n• A video entitled ‘Sustainable tourism – Is it possible?’ produced by Carlo Musco, Miguel Rojo Torres and Ruben del Rio Valtueña from Malta and Spain, in the Reportage Video, 19 to 25 age group category;\n• An article entitled ‘Refocus and reduce… no to junk mail!’ written by the Eco-schools Committee of St Nicholas College Middle School, Rabat, in the Litter Less Campaign 11 to 14 age group category;\n• A captioned photo entitled ‘Home Sweet Home’ submitted by Shaun Grech from Maria Regina College’s Dun Manwel Attard Young Adult Education Resource Centre, in the Reportage Photo 15 to 18 age group category;\n• A video entitled ‘Bring Your Own’, produced by Hayden Bonello, Gilmour Borg, Brandon Debono, Salvatore Mazza, Johan Bongailas, Nicholai Battistino, Brandon Spiteri and Samira Buhagiar, in the Campaign Video, 15 to 18 age group category;\n• A captioned photo entitled ‘People are blind to see’, submitted by Thea Frendo from Maria Regina College Middle School, Naxxar, which was awarded second place in the Campaign Photo 11 to 14 age group category; and\n• An article entitled ‘The folly of developing new vehicle fuel stations’ by Elise Muscat, from Gian Frangisk Abela Junior College, Msida, which was awarded third place 15 to 18 age group category of the International Young Reporters for the Environment Competition 2019. The latter article was published in the March 27 edition of the Times of Malta.\nThe 200 finalists who took part in the International YRE Competition 2019 were selected from thousands of entries submitted to national YRE competitions in 36 countries this year. This is the largest number of entries YRE International had ever received.\nThe international YRE jury was composed of professionals in the fields of environmental journalism, corporate social responsibility and education for sustainable development, including representatives from Unesco and UNEP, among others. The jury said it was very impressed with the students’ choice of interesting local topics, including their reflection on the links to the Sustainable Development Goals as well as their skills on investigative journalism and critical thinking.\nJulie Saito from Unesco said: “This is my seventh year as a jury member and every year I am more and more impressed by the number of countries participating and also by the quality of the reporting within the articles, videos and photos. What really struck me this year was that the themes on the SDGs were much more focused and help showcase the goals.”\nAnother jury member, Anna Pérez Catalá, co-director of Climate Tracker, added: “Youth are leading the climate and environmental fight, and the YRE submissions prove it. They are showing great passion on denouncing the environmental damages through writing, photo and video, and taking action to change. The future of environmental journalism and activism is quite safe.”\nFor further information and to view the entries, visit the Medium and the Climate Tracker websites, or the link below.\nhttps://mailchi.mp/fee/press-release-winners-of-yre-international-competition-1344609?e=52ae1c4d1c", "comment_count": 0, "id": 172}, {"keywords": "Environment", "author": "", "article_body": "The Malta Catholic Action (AKM) recently installed 98 solar panels on the roof of its oratory in Mġarr. This is AKM’s second such project. Five years ago, it installed 38 PV panels at its premises in Birkirkara, which is used by its youth section Żgħażagħ Azzjoni Kattolika (ŻAK).\nThe organisation said it felt the need to be proactive in making the world a better place and was taking action to ensure that while providing its services it impacted the environment as little as possible. It added that this was in line with what Pope Francis called ‘our Common Home’ in the encyclical Laudato Si’ about man’s impact on the earth and the need to safeguard the environment and ensure sustainability in every way possible. AKM said the project was another small step to ensure that the work carried out by the Church and its members reflects the spirit of Pope Francis’s words.\nAKM said it hoped that through this project and other similar investments, it would in the near future be able to contribute financially to continue providing its services to children, young people and adults.\nAccording to Eurostat, 7.2 per cent of the energy consumed in Malta was originating from renewable sources in 2017, one of the lowest three EU countries when the average within the bloc was 17.5 per cent.\nAKM said it hoped the project would contribute to help Malta reach its target of obtaining 10 per cent of its energy from renewable sources by 2020.", "comment_count": 0, "id": 173}, {"keywords": "Education", "author": "", "article_body": "The seventh edition of EU Code Week will take place from October 5 to 20. In preparation for this, teachers, trainers and activity organisers throughout the EU and western Balkans are being offered new training opportunities and learning resources to reach more schoolchildren.\nThis year, EU Code Week will significantly extend its support for organisers of activities. Ahead of the peak of the campaign, trainers, teachers and coding enthusiasts will receive new learning materials, lesson plans and online training to make their coding classes more engaging and more fun.\nFirstly, the first EU Code Week Icebreaker Massive Open Online Course (MOOC) is currently taking place between June 3 and 28. The MOOC is a short five-hour course open to teachers of any subjects who would like to learn more about integrating computational thinking and coding into their classrooms. It will provide teachers with innovative ideas, free training material and other resources to help them organise activities during Code Week, increasing students’ en­gagement and motivation to learn. No previous experience of coding is needed to participate in this course.\nSecondly, the EU Code Week Summer School will take place on July 9 to 12. This will bring to­gether selected ‘leading teachers’ at primary schools, namely educators who act as multipliers on local and regional levels. This unique pilot training project will empower primary school leading teachers by providing them with tools, hands-on workshops and training resources so they can implement coding effectively in their classrooms.\nNo previous experience of coding is needed to participate in this course\nThey will also learn how to develop and apply innovative teaching approaches to increase young students’ knowledge and motivation. The course curriculum is based on the exclusive Computer Science Fundamentals from the Code.org curriculum and the EU Code Week methodology.\nThirdly, a Deep Dive MOOC for teachers of any subjects will start on September 16 and will run for five weeks. This MOOC will enhance teachers’ pedagogical competences and practices by improving their understanding of coding and computational thinking. The course will offer a selection of classroom acti­vities and resources dealing with Scratch, app development, tinkering, making and robotics.\nThese free training materials will empower teachers to acquire the skills and confidence needed to effectively implement coding activities in the classroom and to take part in EU Code Week.\nThis course will build on the EU Code Week Icebreaker MOOC, so teachers who have already completed this course will be able to directly access the Deep Dive MOOC.\nTo accommodate even larger audiences in 2019, important updates have also been made to the EU Code Week website, providing more comprehensive tools, information, and learning and teaching resources in the current 29 languages available on the website.\nOngoing call for coordinators, leading teachers\nEU Code Week is coorganised with a growing network of around 80 volunteer national ambassadors, 42 national education ministry coordinators and 280 leading teachers appointed in all EU and western Balkan countries. They have been key contributors to the success of Code Week 2018, which saw the participation of more than 10 per cent of schools across the EU and western Balkans and reached over 2.7 million participants in nearly 44,000 events.\nA call for leading teachers is still ongoing in various countries where additional numbers are needed, namely Austria, Belgium, Bulgaria, the Czech Re­pub­lic, Denmark, Finland, France, Germany, Hungary, Ireland, Latvia, Lithuania, Luxembourg, Montenegro, the Netherlands, Poland, Slovakia, Spain, Sweden and Kosovo.\nFor more information on EU Code Week and planned activities in 2019 and beyond, contact the local EU Code Week ambassadors or the European Commission via info@CodeWeek.eu.", "comment_count": 0, "id": 174}, {"keywords": "Gozo", "author": "", "article_body": "The Psychology Department of the Gozo General Hospital organised a symposium on dementia care. The symposium, held at the hospital, follows a series of psycho-educational events which the departmental team organises throughout the year for the public as well as for caring professionals.\nThe symposium was introduced and facilitated by the head of the department Laner Cassar. The guest speakers were Charles Scerri, founder and chairman of the Malta Dementia Society and lecturer at the University of Malta, and Daniel Grima, Dar Padova acitivity coordinator.\nProf. Scerri’s presentation focused on the signs, symptoms, diagnostic process, epidemiology, demographics and risk factors of dementia. He emphasised that dementia was not a specific disease but a syndrome characterised by a group of symptoms which result in changes in memory, thinking and social abilities that can reduce a person’s ability to perform everyday activities. The most common types of dementia are Alzheimer’s disease and vascular dementia. Other diseases such as HIV and Parkinson’s disease can also lead in certain advanced stages to the development of dementia.\nAge is the highest risk factor. Women have more risk to develop dementia due to the fact that they tend to live longer. Other risk factors include cardiovascular factors, head injury, lack of exercise, alcohol consumption and smoking, cholesterol and high blood pressure, among others.\nMr Grima gave an overview of the services provided at Dar Padova in Għajnsielem. He explained the intake assessment process for any person in the early phases of dementia who would like to make use of this service. Service users can attend the programme three times a week. The service is free and transport is provided.\nServices offered at the day centre include craft activities, storytelling, gardening, sensory-stimulation exercises as well as befriending several animals kept at the centre.", "comment_count": 0, "id": 175}, {"keywords": "Gozo", "author": "", "article_body": "To celebrate the 132nd anniversary of the birthday of St Padre Pio of Pietrelcina, members of prayer groups in Gozo and devotees of the saint gathered for a prayer meeting, including Mass, at the Capuchins’ Sanctuary of Our Lady of Graces in Victoria. The concelebrated Mass was led by Fr Guardian Joe Buttigieg, assisted by missions secretary Fr Philip Cutajar, Fr Remigio Galea, Fr Spiridione Galea, Fr Philip Attard and Mgr Saviour Grima. Following Mass, Vincent Vella (pictured), on behalf of all the groups, presented Fr Cutajar with a donation to fund bursaries for 12 Capuchin seminarians in Kenya. Singer Marita Zammit Cassar animated the celebration.", "comment_count": 1, "id": 176}, {"keywords": "Gozo", "author": "", "article_body": "Festa Abbatini, a fun day organised by Gozitan seminarians for altar boys and their families, was held on the parvis of Ta’ Pinu sanctuary. After a short play about Don Bosco, Gozo Bishop Mario Grech, together with the participants, entered the sanctuary to pray together. The activity was animated by Joseph Vassallo and the Madonna tas-Sokkors children’s choir. During the day, the altar boys took part in various games. They also had the opportunity to try their hand at clay modelling with Carlos and Anthony, as well as mosaics with Mary Portelli.", "comment_count": 0, "id": 177}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Minister Justyne Caruana inaugurated the first edition of the Gozo Business Expo held at the Grand Hotel, Mġarr. Dr Caruana said the expo was part of the government’s drive to make Gozo a major promoter of economic activity in the country by offering a unique opportunity for small and medium businesses to come under one roof and share their experiences.\nThe expo, patronised by several businesses and enterprises, was organised by the Gozo Ministry, in collaboration with the Gozo Business Chamber, which also set up a stand where a presentation on ‘Doing Business in Gozo’ was held. \nPictured here is Technological Innovations Ltd managing director Margie Saliba showing Dr Caruana a German PVC profile for doors and windows.", "comment_count": 0, "id": 178}, {"keywords": "Gozo", "author": "", "article_body": "■ Today, Għasri marks the feast of Christ the Saviour in the Eucharist. A Pontifical concelebrated Mass, led by Gozo Bishop Mario Grech, will take place at 8.30am. The Lauda Sion choir will animate the liturgical singing. A solemn Mass will be celebrated at 6.30pm by Mgr Lawrence Sciberras, with the participation of the Orchestra Stella Maris, followed by a procession at 8.15pm, accompanied by the Visitation Band. An evening of music will take place at Għasri parish centre at 10.15pm.\n■ Today, the Gozo National and Regional Celebrations Committee will be commemorating the tragic events of June 7, 1919, known as the Sette Giugno. A concelebrated Mass led by archpriest Carmelo Refalo will take place at the Nativity of Our Lady Basilica, Xagħra, at 8.30am, followed  by a musical programme by the Armed Forces of Malta Brass Quintet under the direction of Mro Jonathan Borg and a re-enactment by the Xagħra Historical Re-enactment Organisation in Victory Square. At 11.15am, there will be a commemorative ceremony, including the inauguration of the commemorative monument marking the 100th anniversary of the Sette Giugno events in the lower part of Bullara Street, Xagħra.\n■ Il-Festa Għawdxija, showcasing art, culture and traditions that make up Gozo’s local feasts, is being held at the main square in Qala today from 9am to 1pm.\n■ An exclusive video about artistic life in Gozo, produced by contemporary artist Intan Galistri from Indonesia, is being presented by Arthall in Victoria today at 7.30pm. The video features five artists living in Gozo and Malta with different backgrounds.\n■ A blood donation session will be held at the District Health Centre in Triq tal-Ħamrija, near the Xewkija Primary School, today from 8am to 1pm.\n■ The Victoria International Arts Festival will be held between Wednesday and July 15. For a detailed programme visit www.viaf.org.mt.\n• A half-day training seminar on project development and writing is being organised by Meusac. It is aimed at schools and non-profit organisations who have never applied for EU funding opportunities or who have yet to see their proposal awarded. The seminar will take place at the Hotel Calypso, Marsalforn, on Saturday between 9am and 2pm. A networking lunch will follow. Participants can register their attendance by sending an e-mail to funding.meusac@gov.mt.\n■ Fr Marcello Ghirlando will celebrate Mass and lead a healing service at Ta’ Pinu Sanctuary on June 17 at 6.30pm.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 179}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "About 500 employees are expected to be relocated to Malta from Gibraltar in the coming months after gambling giant Bet365 decided to move its hub here because of Brexit, Times of Malta is informed.\nBet365, one of the world’s leading online gambling groups, announced last month it would be moving to Malta, citing “the mitigation of the impact of Brexit” as the main reason. The Sunday Times of Malta had reported on the planned move a year ago.\nThe company also announced a “rationalisation” of its staff at its Gibraltar office “as the sports betting giant continues to move its operations to Malta”.\nSources said staff members were informed about a consultation process, with various jobs thought to be at risk in several areas of the company, including trading, VIP and customer support.\nA Bet365 spokesman said the company had been building its presence in Malta following Brexit and it had become “increasingly challenging to efficiently run such multisite operations”.\n“Therefore, to assist with business planning and in order to maintain operational effectiveness, we intend to enhance our Maltese operational hub and relocate certain functionality there,” the company said.\nIt has not yet said how many of its 500 employees in Gibraltar would be moving to Malta. However, Times of Malta is informed it intends to move all the staff complement to the island over the next six months.\n“Obviously, not all employees, especially those who have families, will chose to come to Malta because some would not like to make that move. They will either have to leave their job or try to find an alternative in Gibraltar,” sources close to the company said.\nWe intend to enhance our Maltese hub\nAlthough originally it was expected that Bet365 would start operating from a new office block being built by Fortel Ltd, the owners of the Fortina Hotel, it is not known yet whether the betting giant would stick to these plans. \nSo far, the Fortina site, part of which is on former public land sold on condition of purely touristic purposes, is still far from being transformed into a new office block.\nA spokesman for Bet365 did not reply whether the company still planned to move to the Tigné site or whether it was looking at other properties on the island. \n“We have no further comments to make at this stage,” he said.\nThe presence of Bet365 is expected to boost Malta’s profile as an international gambling hub.\nThe Bet365 group, owned by a British family, registers a revenue of about €1.5 billion annually and has about 23 million customers worldwide.\n ", "comment_count": 75, "id": 180}, {"keywords": "", "author": "", "article_body": "The collapse of yet another building was symptomatic of a situation that was totally unacceptable in a civilised country and which had to be addressed forthwith, the Malta Chamber said.\nExpressing shock at the collapse of the Mellieħa building on Saturday, it noted that in May, it applauded the authorities for launching the Considerate Construction Scheme aimed at raising professional standards in the building industry.\nThe collapsed building in Mellieħa, Photo: Keith Micallef\nThe scheme had been promoted with the authorities by the chamber, as it fell squarely in line with the its economic vision.\nThe chamber said on Saturday its view on the matter remained unchanged, as it advocated a high-quality economy where mediocrity and sub-standards were replaced with a culture of excellence, and where the current “good enough” attitude was replaced by “nothing but the best”.\n“The situation is now dire, and no more time can be wasted. The ethical standards and quality of our construction industry need to be raised immediately and brought in line with those in other developed countries. Our islands and our citizens certainly deserve no less,” it said.\nThe chamber said it was considered neither ethical, nor professional to proceed on the basis of what had been witnessed in the very active building economy in Malta over the last years.\nResponsibilities had to be shouldered by all, while the rights of innocent third parties needed to be protected at all times.\nHence the urgency for a unified building authority that looked at the industry comprehensively and qualitatively was now most evident.\nGiven recent events, the chamber called on the authorities to act fast, and even consider going beyond the voluntary nature of the scheme to ensure proper high quality practices in the industry.\n“Otherwise, the launch of the Scheme would have been nothing more than a farce,” it said.", "comment_count": 18, "id": 181}, {"keywords": "", "author": "Claire Caruana", "article_body": "The maths and Maltese state school final exams would not be “past papers”, the government said. Instead, sets of “standard exam papers” would be put together by “education professionals and practitioners”, a spokesman for the Education Ministry told Times of Malta on Friday.\nA clarification was sought from the ministry after it announced on Thursday that, despite directives by the Malta Union of Teachers instructing educators not to prepare or correct any papers, students in state secondary schools would still be sitting for their exams in the coming weeks.\n“The MUT directive is clear in what can and cannot be done. The ultimate responsibility for these papers is solely of the Education Ministry and directorates. They will be standard exam papers and not past papers. The exam papers for the subjects in question will be prepared and corrected by education professionals and practitioners,” the spokesman said.\nThe union and the ministry have been at odds for months over claims that teachers were given more lessons than agreed, leading the MUT to insist earlier this week it would not be withdrawing its directives and accusing the government of trying to “bribe and divide” educators with its offer.\nIt said the ministry had offered a once-only payment of €3,000 to those who had a caseload of 25 lessons in a bid to have the directive withdrawn, an offer meant to divide the teachers without solving anything.\nThe ministry spokesman said that “addressing the source of the issue, which is the load of 25 lessons for teachers, remains paramount within this context”.\n“As early as September 2018, the ministry took a number of actions related to the recruitment process that led to positive outcomes. As a result, all eligible applicants who successfully sat for the Maltese and mathematics interviews are engaged for the next scholastic year.\n“If and whenever eligible and successful candidates apply through the rolling call, they will be engaged immediately. The MUT is very well informed and appreciative of these measures,” the spokesman added.\nDespite the fact that the directive would remain active, he went on, the government believed that a solution should be found in the “immediate future and in time for the next scholastic year”.", "comment_count": 3, "id": 182}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A British man arrested in Malta in connection with a brutal 2003 murder will face extradition proceedings, a court ruled on Saturday, despite his insistence that he was not the man wanted by police.\nChristopher Guest More, 41, had been on Europe’s ‘most wanted’ list and was arrested on Thursday, after a covert operation involved Maltese and British police.\nBut, arraigned in court on Saturday, the arrested man identified himself as Andrew Christopher Lamb, a trader living in Swieqi, and presented a British passport and birth certificate attesting to this identity.\nMr More is wanted by British police over the Cheshire murder of Brian Waters, who was tortured and beaten to death in front of his two adult children, forced to watch the murder at gunpoint. Three other men are already serving life sentences after being convicted of the murder.\nThe prosecution insisted on Saturday that Andrew Christopher Lamb was merely the latest in a series of false identities that Mr More had used to evade justice for 16 years, and that British authorities had confirmed that the only real person bearing that name resided in a medical institution in the UK.\nGeorge Camilleri from the Attorney General’s office, leading the prosecution, said British police had identified the arrested man as Mr More on the basis of photographs, and that a fingerprint comparison proved a match. The passport under another name, he said, had been obtained by means of false declarations to British authorities.\nDespite objections by the defence over the admissibility of this evidence, the court concluded that the arrested man was indeed Mr More, and said proceedings could begin for him to be extradited to the UK.\nDefence lawyer Arthur Azzopardi had argued that the fingerprint evidence was not admissible as police had sought court authorisation only to take the fingerprints, and not to carry out the comparison.\nHe argued that the witness statements from British police identifying the man on the basis of photographs amounted to “nothing more than opinion” and that the only concrete evidence the court had to rely on was the passport and birth certificate attesting to the identity the man claimed.\nMr More is alleged to have been one of four men who carried out the murder in 2003, storming a derelict property where Mr Waters was running a cannabis farm, in a row over drug debts.\nThe men tied Mr Waters to a chair before battering him in front of his son Gavin, who was also attacked, and daughter Natalie, who had just turned 21 and was held at gunpoint and forced to watch.", "comment_count": 0, "id": 183}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Personal data of residents at St Vincent de Paul Residence, in Luqa, was for some time available online and also “mistakenly” e-mailed to all staff members, Times of Malta has learned.\nThe Office of the Data Protection Commissioner has now launched an investigation into the mishap, which occurred this week.\nSources told the newspaper a file containing the personal data of hundreds of inmates was “mistakenly” e-mailed to all employees at the elderly people’s home. For some time, the information was also available on the St Vincent De Paul Residence website.\nThe published data included names, ID card numbers, dates of birth, addresses and information on when and how they were admitted and the ward they were in.\nA spokeswoman for St Vincent De Paul Residence confirmed the data breach. Describing it as “an incident”, she said “personal data was circulated as a mail shot to St Vincent de Paul employees and has been reported to the Commissioner for Data Protection”.\nShe pointed out that “an inquiry board would be looking into the matter and then decide whether any action should be taken, if necessary.”\nIt was Times of Malta that informed the Office of the Data Protection Commissioner about the data breach on Wednesday. The following day, the elderly people’s home management filed a report with the Commissioner.\n“We confirm that, on Thursday, St Vincent De Paul notified the Commissioner for Data Protection of a personal data breach,” a spokesman said.\nHe said that preliminary information indicated that an electronic file containing the patients’ personal data was “mistakenly” e-mailed by a member of staff to all employees. The disseminated information did not include medical details, he noted.\nPersonal data breaches are classified in different categories depending on their nature and gravity, according to data protection laws. \nThey noted that “although this incident falls within the category of ‘internal non-malicious’, the Commissioner takes all data breaches notified with his Office very seriously and has launched an investigation to establish the facts”.\nThe spokesman said the commissioner had no evidence that the data was available online adding that such an eventuality would make the matter more serious.\nSenior officials at St Vincent De Paul Residence told the newspaper they were not surprised at what happened given the situation there.\n“Management inside this institution is at an all-time low with many departments at the residence in complete disarray,” a senior employee said.\n“Mismanagement, particularly in finances, is the order of the day and no one seems to be responsible,” he added. The government has, so far, not made any official announcement on the data breach. According to the law, all those affected by the breach have to be informed.\n ", "comment_count": 12, "id": 184}, {"keywords": "", "author": "", "article_body": "Plans to introduce measures to increase the number of women in parliament are nearing completion, with a public consultation soliciting views on the issue having ended on Saturday.\nA technical committee led by academic Carmen Sammut will now analyse the public’s proposals before reporting back to the government.\nThe public consultation process was a successful one, said parliamentary secretary Julia Farrugia Portelli, with many people having sent in their opinions. The Opposition had also taken part in the process and submitted its own proposals.\nLast March, the government unveiled its plans to increase women in politics. Rather than direct gender quotas, the government is proposing to increase the number of MPs in Malta’s parliament by up to 12 more seats to ensure gender parity.\nRead: Dalli and Metsola on Malta's problem with women in politics\nAlthough the proposed measure is gender-neutral and applicable to any gender with less than 40% representation, in practice it is women who stand to gain.\nJust 10 out of Malta’s 67 MPs are women, making the country an EU laggard when it comes to gender parity in political participation.\nThe government has set itself a 2030 target date to achieve gender equality in parliament and said that legislative measures to inflate the number of women MPs are a temporary measure which will be removed once numbers have reached a critical mass.\n ", "comment_count": 24, "id": 185}, {"keywords": "", "author": "", "article_body": "Entities and organisations involved in the construction industry will be summoned for talks during the coming week to identify how the sector could be made safer, Prime Minister Joseph Muscat said on Saturday.\nSpeaking after the collapse of a building in Mellieħa next to a construction site earlier in the day, the Prime Minister said clear responsibilities had to be carried in such cases.\nThe Mellieħa incident, he said, had to be taken in the context of another seemingly similar incident, a boom in the construction industry, and the fact that people were asking how were human lives and safety to be protected in such cases.\nWithout going into the merits of the case, Dr Muscat said that responsibilities in similar cases were clear.\nThere were warranted professionals who had to sign off on projects and contractors who had to follow instructions given by architects. The responsibilities were clear and could not be avoid it through any argument, he said, adding the government was not waiting for tragedies to happen to take action.\nIt had already announced it was uniting the regulatory authorities into one that would supervise closer similar works being undertaken.\nDr Muscat acknowledged that the sector was currently fragmented. \nDevelopment applications were assessed and approved by the Planning Authority, but the PA was not responsible for a variety of other aspects involved in construction. \nThere were a number of entities such as the Building Regulations Office and a number of other boards that were being consolidated into one unit, the Prime Minister said. \nDr Muscat said he would be pushing to speed up the process to consolidate these responsibilities under a single entity, to ensure there was a clear point of call when it came to enforcement and regulatory matters.\nThe government did not enter into how individual projects were developed, he said: there were professionals with a warrant for that. The government's job was to ensure enforcement, but a lot still needed to be done, Dr Muscat admitted. ", "comment_count": 132, "id": 186}, {"keywords": "", "author": "", "article_body": "The Maltese cannot adopt the defenceless attitudes that had been used against them when frequent attacks from outside meant slavery and destruction, Archbishop Charles Scicluna and auxiliary bishop Joseph Galea-Curmi said in a pastoral letter.\nIn the letter, which is being read during Sunday Masses, the bishops say that as a faith community, the Maltese were living in a society that, while appreciating its ancient roots, embraced a diversity of cultures, languages, races and religions.\n“This is a golden opportunity for us all to witness love, which is the universal language that everybody can understand. If prejudices and hatred lead to exclusion, destruction and murder, love leads to the building anew of the family of man. Man was created to enter into a relationship of love with God and men, whoever they are, of whatever race or colour.”\nThis love, they said, was the foundation of an inclusive society where the fundamental rights of every human being were respected and protected.\n“Instead of pointing fingers at others, we Catholics should take the initiative and continue building bridges which go forth from our hearts and extend beyond and above the abyss of racism, of all kinds of prejudice and fear of all that is foreign, that is, all forms of xenophobia.\n“In our history as a nation, we have been through bad times when frequent attacks from outside meant slavery and destruction. Today, after so many centuries, we cannot adopt the same defensive attitudes,” they said.\nPeople coming to live in Malta, in search of a better life, were not enemies but partners in prosperity who enriched the country’s cultural heritage. They were human beings who had the same human dignity and the same fundamental rights.\nThe letter in full may be read below.\n‹›-+Page:  /", "comment_count": 38, "id": 187}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 3pm, adds Steward's reply\nSteward Health Care has again asked for more time to come up with upgrade plans at the physiotherapy department despite union directives barring new patients from being treated.\nThe directives were issued by the Malta Union of Midwives and Nurses last month after Steward failed to provide time frames, as had been agreed, on upgrade works at the department.\nPhysiotherapists at St Luke’s Hospital are struggling to treat their patients as a result of the sub-standard facilities there.\nUnion president Paul Pace said the MUMN was asked by Steward to provide certain documents to assist it with understanding the situation at the run-down clinic. \nAlthough the requested material was submitted, the operators insisted they would get back to the union in three weeks’ time, he said.\n“It’s surreal how weeks after the coming into force of directives that are among the harshest we have ever had to resort to, Steward are still saying they need more time,” Mr Pace said. \n“This when they have been promising the so-called master plan since they came to Malta a year and a half ago.”\nHe admitted that, notwithstanding the pressure through the directives, nothing had changed yet. \nThe union, he added, had considered stepping up action but had decided to hold back not to further impact patients. Mr Pace remarked that physiotherapists had little hope the plans would be presented any time soon given the fact they had been “taken for a ride for months on end”.\n“The physiotherapists have often asked when the upgrade would take place and every single time they were told it would be soon, yet, they are still working in a department that is falling apart,” Mr Pace said.\nTimes of Malta reported in April that physiotherapists at the department situated in St Luke’s Hospital were struggling to treat their patients as a result of the sub-standard facilities there. \nAccording to the physiotherapists, the state of the department was also making it difficult for them to provide patients with the latest treatment available in other countries.\nMr Pace said the decision by Steward to ask for more time had further demotivated the physiotherapists who, he noted, felt their work was not valued.\nA spokeswoman for Steward Health Care told this newspaper the operator wanted to “dedicate enough time to planning in order to get it right”.\nWhen pressed to provide an indication of when the plans for the upgrades will be provided, she said this would be “within a few weeks or months” but gave no fixed date.\nSteward's reply\nSteward Health Care Malta said on Saturday it had been in constant contact with the union and government to define the most appropriate interim solution which safeguarded patients interests, and gave staff suitable infrastructure to work in.\nIt responded to the union’s submission of required documentation within 48 hours and gave a firm timeline for infrastructure improvement with a commitment to completion in October.\nSteward said it strongly believed that the measures taken so far provided the union with sufficient commitment and comfort that the situation would improve imminently. \nIt also believed that maintaining directives in spite of a good plan forward only exposed patients to negative outcomes, making them an innocent and unnecessary hostage of this situation.\nSteward Malta would continue to work in good faith to ensure the improvement plan communicated materialised and that patient care was improved.", "comment_count": 26, "id": 188}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Antonio Flores’ club foot did not stop him from competing in the Beijing Paralympics right next to Oscar Pistorius and his amputated leg has not kept him from dreaming of classifying for the Tokyo 2020 games.\nMalta’s only blade runner, Mr Flores started training aged 14. It was a mandatory school race that changed the game for him.\nPhoto: Medical Centre Orthotics and Prosthetics\n“When I placed fourth I realised that my disability had not set me apart from the other 27 classmates. By looking at the final result list, no one could tell I had a disability,” he says.\nAt the time Mr Flores was not an amputee. He had been born with a club foot, meaning he had an ankle disability that hindered his walking, jogging and running.\nThe 29-year-old, who is a podiatrist by profession, believes that overcoming that challenge is what inspired him to take up the sprinting challenge again and again for 15 years.\nHe discovered the Paralympic Games in 2007 and the following year Mr Flores was in China competing for a medal next to world-renowned athletes.\nHowever, his career risked coming to a halt when pain in his right leg started becoming unbearable and he had to start using a running brace made of carbon fibre. \nStill, the pain persisted until he had only two options – either undergo surgery that would have taken away his mobility and could eventually lead to an amputation or end up in a wheelchair.\nHe knew that the only way to remain active was to have his leg amputated from the shin down. It was a difficult decision to make but one that he does not regret. Antonio Flores’ club foot did not stop him from competing in the Beijing Paralympics right next to Oscar Pistorius\nWhen Mr Flores became an amputee two years ago he had to relearn how to walk, jog, run and sprint and he still suffers phantom pain. \nHe has now set his eyes on the Tokyo 2020 Paralympics but needs €2,000 to classify into the 100m and 200m categories, which take place abroad in August.\nFormer Italian athlete and Global Capital plc chairman Paolo Catalfamo will be covering the expenses following a public call for help.\nI have seen people who have all the possibilities and opportunities but not the will\nThe amount would cover a variety of expenses including classification fees, training camps and equipment and has seen Mr Flores turn to crowdfunding. \nHis expenses include therapy and treatment for the injuries he sustains. It is more likely for a Paralympian trainee to get in-jured because of what is known as altered movement, which in his case is adapted to the blade. \nMr Flores also notes that amputee athletes require various prostheses to train for different categories and also to have a backup in case of breakage.\nHe is grateful that the state provides him with a very good prosthesis to use on a daily basis while his running blade was sponsored by a manufacturing company but hopes that, one day, he would be able to afford a back-up. \nWhen Prof. Catalfamo heard of his crowdfunding efforts, he decided to pitch in.\n“I have seen people who have all the possibilities and opportunities but not the will. And, yet, this young man, who would be justified to stay put because of his physical restriction, is going the extra mile, not only by training harder but even seeking the public’s help to raise funds. He is exceptional,” he remarks.\nAs a former athlete, Mr Flores’ story resonated well with Prof. Catalfamo, who took part in European Championships and was meant to participate in the Olympics, plans of which collapsed because of an injury.", "comment_count": 3, "id": 189}, {"keywords": "", "author": "", "article_body": "From the creation of a “living experience” in an apartment to local, custom-made tiles landing on a luxury Dubai property; the green way forward when it comes to office space and a peaceful hub in the heart of a busy work environment, the June issue of Places: Design & Living has it covered. \nOut with The Sunday Times of Malta tomorrow, the interior design and architecture magazine also continues with its focus on conservation and heritage, encountering an antique map collector and looking into the restoration of St Augustine Church and Priory in Valletta.Meanwhile, form continues to meet fashion, with a look at how an artist has left her painting mark on designer bags, taking her art into another realm; and a how a fashion photographer fuses the female body, warts and all, with the landscape in an exhibition that also comes under the magazine’s lens.A spotlight is also shone on the design and décor in entertainment outlets, where themes can be taken to the limit, while at the other end of the spectrum and back in the home, the cosy hygge concept is explored.Places: Design & Living is a bi-monthly magazine, produced and published by Allied Newspapers Ltd.", "comment_count": 0, "id": 190}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated 2.50pm\nXagħra councillor Kevin Cutajar will be co-opted to Parliament following the approval of the Nationalist Party's executive committee on Saturday.\nApplause could be heard inside the the PN headquarters as soon as he was approved.\nDr Cutajar will be taking up the seat vacated by David Stellini. He was the only candidate running to fill the seat. \nSpeaking to the press following his approval, Dr Cutajar said it would be a privilege to serve and said it was positive that the Nationalist Party, which he had always believed in, had done the right thing.\nThe vacated Parliamentary seat, he said, belonged to Gozo and should stay there according to Gozitans’ will.\nAs a Gozitan, he was extremely satisfied to see Gozitans unite behind his cause. Gozitans should learn from this and unite on more causes, he said. \nDr Cutajar, who lost his vision as a teenager, said that the PN's decision to co-opt him into parliament was proof that one's abilities could overcome any disabilities.\nHe said it was his privilege and responsibility to serve the Maltese and this was not a point of arrival but one of departure.\nThe page now had to be turned and he would do his utmost to carry his new responsibility and translate it into something of benefit to the people.\nSecond co-option vote\nThe meeting followed another one a week ago, when an initial vote to fill Mr Stellini's seat was taken and won by Jean Pierre Debono, by just two votes.\nMr Debono later said he would not be taking his oath of office as an MP after it emerged that two of the executive members who cast their vote were not eligible to do so.\nThe PN leadership was then threatened with legal action by the party’s regional committee in Gozo if it persisted with Mr Debono’s co-option.\nDuring the week, party general secretary Clyde Puli called other Gozitan candidates urging them to join the race for the vacant parliamentary seat. They declined the offer.\nVideo: Jonathan Borg\nAll Gozo candidates were contacted - Delia\nOpposition leader Adrian Delia on Saturday confirmed he knew secretary general Clyde Puli was calling other candidates to join the race.\nFielding questions from the media outside the Nationalist Party headquarters ahead of the executive committee meeting, Dr Delia told Times of Malta Mr Puli had his blessing to make the calls.\nHe explained that as it had been decided that the seat would be taken up by Gozitan candidates, it had to be ensured that everyone was aware that they could join the race.\nAsked why this was not done last week, Dr Delia said that there was no need at the time because it had not yet been decided that only those from Gozo would be considered.\nSpeaking after the meeting, Dr Delia said it was obvious that there would be concern, problems and turmoil after a number of consecutive mammoth defeats.\nAlthough the party had not found a solution to everything with Saturday’s decision, it was acknowledging the clear message of the people and would try to see what its strengths were and build on them.", "comment_count": 83, "id": 191}, {"keywords": "", "author": "", "article_body": "Volotea has launched direct flights to Verona and Genoa from Malta International Airport.\nThe inaugural flights from the two Italian cities landed within a day of each other.\nThe cake launching the Verona flights.\nCakes made in celebration captured the essence of the two cities, with one cake being dominated by shades of blue and colourful houses reminiscent of the Boccadasse fishing village and the other recreating Romeo and Juliet’s famous balcony scene.\nWhile Verona is renowned for its artistic heritage and stunning architecture, which has earned it recognition as a World Heritage Site by Unesco, Genoa is a port city boasting rich maritime heritage that is more likely to attract sea-loving people.\nVolotea will be operating a weekly service to each one of the two cities during the summer months, with the flight to Verona being offered on Tuesdays and the flight to Genoa mid-week.", "comment_count": 0, "id": 192}, {"keywords": "", "author": "", "article_body": "Updated at 11.05am\nFormer radio host David Thake has suggested that businessman Yorgen Fenech offered the Nationalist Party €50,000 to ensure David Casa was not reelected to the European Parliament.\nMr Thake made the claim during an episode of TV talk show Xarabank, saying the PN had worked to hinder Mr Casa’s reelection campaign. He provided no evidence to back up his allegation.\n“Are you prepared to ensure that the PN is not controlled by Yorgen Fenech, to ensure it does not continue to fight against corruption like 17 Black?” Mr Thake asked PN leader Adrian Delia.\nHe said his source had confirmed that Mr Fenech had made the €50,000 offer.\n\"Offering money to someone who controls an electoral campaign is extremely serious,\" Mr Thake said. \nHe pointed the finger at Mr Delia’s “close advisors” Pierre Portelli and Kristy Debono, saying they were close to Mr Fenech.\nLast year, a joint investigation by Times of Malta and Reuters revealed that Mr Fenech – who sits on the board of power station company Electrogas - is the ultimate beneficial owner of Dubai company 17 Black.\nFrom left: David Casa, David Thake and Yorgen Fenech.\nLeaked emails suggest 17 Black was set up as a target company for offshore companies owned by minister Konrad Mizzi and OPM chief of staff Keith Schembri.\n'Zero tolerance to corruption' - Delia\nReplying, Dr Delia urged Mr Thake to take any evidence he had to substantiate his claims to the police and assured him the PN would back him “with all my might” if there was truth to them.\n\"Zero tolerance to corruption,\" Dr Delia said. \"There is absolutely no link to Mr Fenech\". \nLast April, Times of Malta revealed that PN MPs Kristy Debono and Hermann Schiavone had met Mr Fenech to discuss a potential conference sponsorship.\nMr Schiavone subsequently suspended himself from the PN parliamentary group as a result of the fallout from that revelation, saying that Ms Debono had been unaware that they were to meet Mr Fenech. \nPortelli, Debono deny\nMr Portelli denied the claims Mr Thake made on Xarabank and also told him to present any proof to the police.\n“David Thake already lost various libel cases when he was a presenter on Radio 101 and it seems he hasn’t yet learned anything,” Mr Portelli wrote, in a post which was shared by Kristy Debono.\nMr Thake later replied to say he had only lost one libel suit, not several as Mr Portelli had claimed.\n\nXarabank host Peppi Azzopardi told his audience that Mr Portelli had also called the show during an advertising break to deny the allegations. \nMs Debono called Times of Malta to strenuously deny the claims.\nCasa reelection bid\nMr Casa, who is Malta's longest-serving MEP, was successfully reelected during last month's European Parliament elections. \nSpeaking on Xarabank, Mr Thake argued that the PN had done its utmost to ensure Mr Casa's reelection bid failed. \nDr Delia insisted there was no truth to that claim, either.\n“Ask David Casa,” the PN leader told the former radio host.\n“I asked him to focus on a particular part of the electorate, and he did that to the letter. And I thank him for that.”", "comment_count": 114, "id": 193}, {"keywords": "", "author": "", "article_body": "Speaker Anġlu Farrugia will be acting President between Monday and Friday.\nPresident George Vella, as well as Dolores Cristina, who usually assumes the duties of acting President when the President is away, will both be abroad.", "comment_count": 6, "id": 194}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Saturday’s newspapers.\nTimes of Malta says personal data of residents at St Vincent de Paul Residence, in Luqa, was for some time available online and also “mistakenly” e-mailed to all staff members. In another story, it says a ship repair company has initiated legal action against the UK government over an unsettled bill to cover berthing, repair and inspection costs on one of its vessels.\nThe Malta Independent says that Gozitan Nationalist candidates will not be contesting Saturday’s co-option as Kevin Cutajar deserved David Stellini’s parliamentary seat.\nIn-Nazzjon quotes PN leader Adrian Delia saying on Xarabank that he will continue working with the people.\nL-Orizzont reports about a meeting the General Workers Union had with the German ambassador.", "comment_count": 0, "id": 195}, {"keywords": "", "author": "Keith Micallef", "article_body": "Updated at 7.30pm with victim's details \nAn apartment block in Mellieħa collapsed on Saturday morning, prompting a rapid rescue operation as firefighters scrambled to make sure nobody was caught beneath the rubble. The scene moments after the collapse.\nRescuers pulled an elderly woman out of the four-storey building and rushed her  to hospital, but nobody else was hurt and the rescue effort was halted late in the morning. \nThe building on Main Street, close to the former Shoppers Supermarket, started collapsing at around 6am. It was still falling half an hour later. A neighbouring property is under construction.\nThere were just two flats in the block, which locals said was built some 20 years ago. One of the flats was a duplex.\nCivil Protection Department personnel began searching debris at the site after receiving reports from at least one witness who said they had heard screams soon after the building caved in. \nResident lifted out\nA woman, who sources later named as 77-year-old Maggie Smith, was inside one of the apartments at the time.\nMs Smith was fortunate to be in her bedroom when the block began to collapse at around 6am.\nThe room was at the back of the apartment and remained standing as walls around her crumbled. When CPD personnel arrived on the scene, they lifted her out of the block and handed her to paramedics, who took her to Mater Dei Hospital. \nThe police later confirmed that she had only been slightly injured in the collapse.\nA daughter and grandson missing   \nSearches intensified soon after Ms Smith was rescued, however, when rescuers received word that the woman's daughter and grandson had been visiting her in Malta. Maggie Smith with her late husband.\nThe two were due to catch a flight back home early on Saturday morning, but authorities were not sure they had left the Mellieħa apartment before it collapsed.\nA drone scanned the area from above while rescue dogs were deployed to sniff out any traces of life beneath the collapsed bricks.CPD officers brought a bulldozer from a nearby construction site to the scene of the collapse, to help clear debris and speed up the search.\n\nA while later, police officers tracked Ms Smith's daughter and grandson down at Malta International Airport, where they were about to board a flight. \nSources told Times of Malta that the two were escorted to Mater Dei Hospital to visit their injured relative. \nSearch called off\nIn Mellieħa, CPD officers continued digging through the debris to ensure nobody who could have been walking by at the time was trapped.\nThe search was called off as soon as it was established that no other people were trapped.\nA google maps image of the building as it was before.\nVideo: Jonathan Borg\nA series of collapses \nSaturday morning's incident immediately prompted comparisons to a similar disaster in April, when an apartment block collapsed in Guardamangia, and is bound to raise further questions about building and construction safety standards.  \nFortunately, nobody was injured in the Guardamangia incident. The room in which the woman was trapped. Photo: Keith Micallef\nFollowing that collapse, the Chamber of Architects had pointed to \"fragmented\" building regulations as part of the problem, while NGOs like Flimkien Għal Ambjent Aħjar had lashed out at \"cowboy\" developers.\nPrime Minister Joseph Muscat had urged people not to use that incident to blame the construction sector as a whole and said he would be waiting for an investigation to be concluded before passing judgment.\nThe back wall of an 18th century house at It-Tokk also collapsed during development in April 2018.\nA few months later, a warehouse store in Mrieħel caved in in the middle of the day. Thankfully, nobody was hurt in the incident. \nMagisterial investigation underway\nIn a statement, the government expressed \"concern\" at the incident.\nProfessionals involved in the sector would have to bear responsibility at law, it said, adding that a magisterial inquiry and police investigations were ongoing. \nVictims had been offered assistance and would continue to be aided as needed, the government added. \nIn its statement, the government recalled that a new Malta Construction and Building authority was in the process of being set up. The authority would consolidate and update existing building and construction legislation.\nResponsibilities would be clarified and streamlined through legal changes, the government said, bringing the various responsibilities of stakeholders involved in the construction process under one legislative roof. \nThe updated legislation would also seek to review and define with clarity third-party rights, including those of neighbours.\nPrime Minister Joseph Muscat later said that he would be summoning construction sector representatives and stakeholders for talks next week, to see how safety could be improved.Photo: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Keith Micallef\nPhoto: Keith Micallef\nPhoto: Keith Micallef\nPhoto: Keith Micallef\nPhoto: Keith Micallef\nPhoto: Keith Micallef\nPhoto: Carlos Gomez\nVideo: Keith Micallef\n\nPhoto: Keith Micallef\nPhoto: Keith Micallef\n ", "comment_count": 220, "id": 196}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A meeting of the Nationalist Party’s executive committee on Saturday could become a rowdy sitting after an initiative by secretary general Clyde Puli to urge Gozitan candidates to join the race for a vacant parliamentary seat ruffled feathers.\nAlthough many thought the meeting would lead to lawyer Kevin Cutajar being formally co-opted to fill the seat vacated by David Stellini, PN Gozitan candidates who contested the 2017 general election told Times of Malta they were personally contacted by Mr Puli asking them whether they were interested in being co-opted.\n“I did not even think of contesting this seat because it was clear, at least to me, that after what happened, Kevin Cutajar would be the only remaining option,” one of the candidates said, prefering to remain unnamed.\n“The fact that Mr Puli, took the initiative to even ask me about this possibility and to open a new contest speaks volumes on the present state of those in the party administration,” he said.\nAnother candidate said that when contacted by Mr Puli it became evident that the PN leadership was actively trying to find a candidate to challenge Dr Cutajar.\n“Apart from showing that they don’t want him, the leadership seems unable to realise it is now damaging the party’s interests,” yet another candidate said.\nCandidates Joseph Ellis and Maria Portelli both posted comments on social media thanking Mr Puli for his interest but rejecting his offer.\n“It is my sincere wish that the executive committee will decide to give the vacated seat to Dr Cutajar,” Dr Ellis wrote.\nThe leadership seems unable to realise it is now damaging the party’s interests\nAnother PN Gozitan candidate approached by Mr Puli, Ryan Mercieca, also expressed his full support to Dr Cutajar.\nTimes of Malta was told that the same did not happen a week ago prior to the first meeting of the executive committee which had voted by 42 to 40 to co-opt Jean Pierre Debono rather than Dr Cutajar.\nMr Debono later said he would not be taking his oath of office as an MP after it emerged that two of the executive members who cast their vote were not eligible to do so. The PN leadership were then threatened with legal action by the party’s regional committee in Gozo if it persisted with Mr Debono’s co-option.\nMr Puli failed to reply when asked on Friday why he had decided to approach the Gozitan candidates and why he did not do the same prior to the first election process.\nNeither did he reply to questions on whether this was his personal initiative or if he was instructed to do so by party leader Adrian Delia.\nSoon after the dismal PN results at the May 25 polls, the worst since 1951, Mr Puli irked many party voters and insiders through comments he made on TV to justify the results.\nReferring to a survey published by It-Torċa in 2017, showing a gap of 75,000 votes between the PN and Labour, Mr Puli concluded that the fact that his party lost by “only” 42,000 votes showed that the PN had made some progress.\nCalls from various quarters for both Dr Delia and his aides to resign or seek a vote of confidence have so far been ignored.\n ", "comment_count": 27, "id": 197}, {"keywords": "", "author": "", "article_body": "A Briton wanted in connection with a homicide has been arrested in Malta after a covert operation involved Maltese and British police.\nThe man - who was on Europe's 'most wanted' list - was kept under surveillance for a number of days before the arrest, and was found to have been using a false identity. A European arrest warrant had been issued for the man, who will be arraigned in court in the coming days.\nSources said that the man was Christopher Guest More, who is wanted for the murder of man in Cheshire in 2003.\nBrian Waters was tortured and beaten to death in front of his two adult children, forced to watch the murder at gunpoint.\nMore, 41, described himself as an undercover journalist, and was known to have links to Spain, Malta and South America.\n\nMore managed to leave the UK, but three other men are serving life sentences after being convicted of Mr Waters’ murder.\nThe men tied Mr Waters to a chair before battering him in front of his son Gavin, who was also attacked, and daughter Natalie, who had just turned 21 and was held at gunpoint and forced to watch.\nRead more: https://metro.co.uk/2019/04/30/christopher-guest-more-jr-added-to-europes-most-wanted-list-9352367/?ito=cbshare", "comment_count": 0, "id": 198}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Residents are objecting to plans to build hundreds of apartments on a massive tract of agricultural land in the limits of Mosta.\nThe nearly 40,000 square metre site – more than the size of five football pitches – in the area known as Tad-Dib, near Torri Cumbo, was included in the  development zone in the 2006 rationalisation exercise, having previously been an outside  development zone.\nA zoning application has now been submitted that would allow three-storey high buildings to be built across most of the site. If approved by the Planning Authority, a full application would still have to be submitted before any development could take place.\nA similar zone application on the same site was rejected two years ago by the planning watchdog, which said the plans did not constitute an example of good urban design due to the street layout, density and lack of green public open space.\nResidents who are objecting to the new application argue that such an intensive development will eat up some of the last active agricultural fields in the area as well as an important green area for the community.\n“The insatiable greed on the part of developers and a serious lack of foresight and planning on the part of the public authorities concerned will cause such detriment to the natural environment that the residents of the area  and those surrounding it will  be impacted negatively,” one objector said.\nConcerns have also been raised over the impact on the infrastructure, congestion and the fabric of the community due to the sudden addition of so many new residents.\nA serious lack of foresight and planning\nCultural heritage issues have also been raised over the nearby Torri Cumbo, a medieval watchtower, and the Mosta cemetery, directly adjacent to the proposed development.\nAlternattiva Demokratika, which has objected to the application, argued it is identical to the proposal already turned down and that the development proposed was too intensive and had too few open spaces.\nIt said the proposal should be accompanied by details of the social and environmental impacts while the cumulative impact of it and other developments in the area should be assessed.\nMoreover, it pointed out that the proposal ignored the fact that the cemetery needed to grow and did not consider the minimum distance from residential areas required by law.\nThe application is still pending assessment, with public consultation open until July 10.", "comment_count": 149, "id": 199}]