[{"keywords": "", "author": "", "article_body": "The Malta Financial Services Authority has directed the competent person it appointed to administer Satabank's assets to contact corporate customers to initiate the return of funds.\nIn a statement on Wednesday evening, the MFSA said customers were being contacted on a staggered basis. All Satabank corporate and personal customers with a balance above €50 had been contacted.\nAccounts at Satabank, a small international bank, were effectively frozen by the MFSA in November, with EY (formerly Ernst and Young) appointed to administer the bank’s assets in “the best interests of depositors”.\nThe move came after a joint inspection and audit by the MFSA and Financial Intelligence Analysis Unit found shortcomings in the bank’s anti-money laundering procedures.\nDepositors reportedly slipped into “a state of desperation” after they became unable to access their own funds.\nIn its statement on Wednesday, the MFSA said customers were provided with the details of all the information required and were encouraged to provide this as soon as possible.\nSatabank, the authority said, had been working closely with the MFSA and other authorities to achieve the best possible outcome for customers.\nThe bank continued to fulfil all its capital and liquidity requirements.\nSafeguarding depositors continued to be the MFSA's priority, the authority said.", "comment_count": 6, "id": 1019}, {"keywords": "", "author": "", "article_body": "The Civil Protection Department urged people to drive with caution until about 9am on Thursday, as thunderstorms are expected.\n\nIn a post on Facebook, the CPD said thunderstorms are expected to affect Malta and Gozo within the next 13 hours.\n\"People are urged to drive with caution.\"", "comment_count": 19, "id": 1020}, {"keywords": "", "author": "Claire Caruana", "article_body": "The teachers’ council is investigating the Gozo College head for “unethical behaviour” on social media, Times of Malta has learnt.\nSources said Denise Mifsud, the principal of the college, which is made up of eight primary schools, a middle school and a secondary school, is being probed by the Council for the Teaching Profession in connection with a post she shared on social media.\n\nIn the post (see screenshot on the right), which was shared with friends on Facebook earlier in January, Ms Mifsud uploaded a photo with text that contained an expletive and which, according to comments accompanying the post, was directed at “some specific individuals”.\nThe investigation was requested by the Malta Union of Teachers, which said the “high-level official” was in breach of five clauses of the teachers’ code of ethics.\n“Among other things, educators are encouraged to act with a professional attitude and behaviour at all times and refrain from making public statements which bring the profession into disrepute,” the MUT said, adding it was ready to submit any further information as requested.\nWhen contacted by Times of Malta, Ms Mifsud asked that questions be sent to the Education Ministry, who, in turn, told the newspaper it would not be commenting because “the process is currently ongoing”.\nTeachers who spoke to Times of Malta on the condition of anonymity said they were infuriated that Ms Mifsud was not suspended, at least pending the outcome of the investigation. They argued that such behaviour was not acceptable and teachers were often told off by their superiors for bad practice on social media.\n“Had it been anyone else, there would have been very serious repercussions but this does not seem to be the case with this principal,” one teacher remarked.\nConfirming that an investigation by the teachers’ council was under way, Education Ministry sources said steps had already been taken against Ms Mifsud.\nThe issue that prompted her to share the post was not related to her work at the college but to personal matters, they said.", "comment_count": 54, "id": 1021}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Planning Authority is set to approve plans to build an 11-storey structure at SmartCity in spite of a warning by the cultural heritage watchdog that this could compromise Valletta’s Unesco World Heritage Site status, Times of Malta has learnt.\nA 2008 SmartCity master plan had set a seven-storey limit for buildings there and correspondence seen by Times of Malta shows that the Superintendence for Cultural Heritage strongly insisted the limit must be respected by the structure in question, known as The Shoreline.\n“The advisory committee and the Superintendence recommend that the proposed building height should be reduced and certainly not exceed the height outlined in the master plan on the basis of the effect on the views and vistas of Valletta World Heritage Site and the scheduled fortifications,” the Superintendence told the planning watchdog.\n“The advisory committee further noted that the extent of proposed massing should be further studied by the authority,” it pointed out.\nSmartCity owners gave their green light\nDespite the cultural heritage watchdog’s clear stand, the PA is still recommending the approval of an application for the building of 400 residential units and a large commercial and retail area rising to 11 storeys.\nAlthough the 2008 master plan is still legally valid, the PA is justifying its stand on the basis that the SmartCity owners gave their green light to this option.\n“The proposal does not follow the exact parameters set out in the provisional plot development guidelines assessed in the outline permit with respect to the maximum height of the building and to the gross floor area,” the PA’s case officer, Ivan Fava, wrote in his report.\n“However,” he added, “the application is accompanied by statements from SmartCity Malta agreeing to the transfer of both the additional gross floor area and additional height from other plots within the approved master plan.”\nThe Times of Malta reported on Tuesday that an application was filed in 2017 to alter the original master plan. SmartCity had now suspended the process though it is not clear why.\nIn its proposals, SmartCity indicated it wanted to change the internal structures permitted for development in the 300,000 square metres of land, given to them by the government at low ground rent on the premise that it was to be developed into an ICT city.\nThe master plan changes, now suspended, included proposals for new height limitations.", "comment_count": 44, "id": 1022}, {"keywords": "", "author": "", "article_body": "Updated at 8.40pm with Salvini's tweet\nA rescue vessel carrying 47 people saved off the Libyan coast is headed towards Malta after being denied permission to disembark in Lampedusa, with the stage set for a repeat of the humanitarian crisis which played out earlier this month.\nSea-Watch 3 has sought permission to head towards Malta for shelter, but is still waiting for permission from the authorities to enter Maltese waters. A spokesman said the boat will not enter Maltese waters without permission. \nHe added that the boat did not have adequate coverage from bad weather at Lampedusa.\nScreen grab from Marine Traffic.\nA spokesman for the Germany-registered NGO told Times of Malta on Wednesday afternoon: “We have no clearance to enter Lampedusa and worsening weather has forced us to leave the area to look for shelter.” \nExplainer: Malta and Italy's migration tensions - your questions answered\nA Maltese government spokesman declined to comment.\n\nIn a tweet on Wednesday evening, Italy's right-wing deputy prime minister Matteo Salvini reiterated that Italy's ports were closed and said Malta had to welcome Sea Watch. The Netherlands, he said, was willing to collaborate with Valletta to manage the landing and reception of migrants under the direction of Brussels.\nRepeat scenario\nJust two weeks ago, the Sea-Watch 3 crew found themselves in the exact same predicament, after Italy unabashedly ignored the vessel.\nMalta first agreed to allow the ship into its territorial waters to shelter from rough weather, before eventually giving it permission to dock after striking a deal with seven other EU member states to share relocation duties. \nThe Sea-Watch 3 was one of several NGO rescue vessels detained by Maltese authorities last year, after local port authorities said that they had concerns about the ships' registration documents. \nIt finally left Malta in October, to resume migrant rescue missions across the central Mediterranean. \nOn Tuesday, Times of Malta reported that the ship had tried to contact Italian and Maltese authorities after its latest sea rescue, only to be told to head towards Libya.\nThe NGO claims Libya’s coast guard did not answer its calls and that in any case, it does not consider the North African state to be a safe port of call.\nAt the time, a Maltese government spokesman had said that Malta was “neither the appropriate nor the competent authority” in this case. \nA dangerous journey\nAlthough the number of people attempting to cross the Mediterranean by sea has declined over previous years, the route remains a death trap, with many never making it alive.\nLast week, more than 100 people are believed to have died or gone missing after their vessel issued a distress call while out at sea. Their distress call was picked up by NGO reconnaissance aircraft Moonbird – which was kept grounded in Malta by authorities for more than five months last year - and relayed to Italian authorities.\nBy the time an Italian navy vessel reached the area, just three survivors remained, according to Sea-Watch.", "comment_count": 0, "id": 1023}, {"keywords": "", "author": "", "article_body": "A health warning about lemon juice concentrate containing undeclared sulphites has been extended to further batches of the product.\nIn a statement, the Environmental Health Directorate said that it now had reason to believe that various batches of 200ml Piacelli Citrilemon are affected. Batches with expiry dates marked as September 14, September 26 and October 23 of 2020 are all suspected of containing undeclared sulphites. Other batches with expiry dates from July 14, 2020 onwards could also be affected. Sulphites, which occur naturally in some foods, are often used as food colouring and preserving additives. Although they are generally safe to ingest, they may induce migraines and other adverse effects in people who suffer from sulphite sensitivity. For more information, contact the Health Inspectorate Services between 8am and 2.30pm on 2133 7333, by visiting their offices at Continental Business Centre, Old Railway Track, Santa Venera or by emailing mhi@gov.mt.", "comment_count": 4, "id": 1024}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man suspected of coordinating a drug-trafficking racket whose cover was blown by the police on Tuesday was remanded in custody after denying the charges in court on Wednesday.\nTomislav Hegedus, 27, from Mosta, currently unemployed, was taken to court and charged with conspiring to traffic cocaine, trafficking the drug and breaching two bail decrees issued in respect of separate proceedings.\nHis arraignment took place minutes after another suspect, whose name was banned under court order and who had allegedly been involved in the same racket, was remanded in custody after pleading not guilty to drug-related charges.\nProsecuting Inspector Kevin Pulis informed the court that no drugs had been found in possession of Mr Hegedus whose role had allegedly been to issue directions for deliveries and payments to be effected.\nThe absence of drugs in the man’s possession was pounced upon by his defence lawyers who further noted that the evidence supplied by third parties had already been preserved in the acts of the inquiry. Moreover, the breach of bail had yet to be proven.\nThe prosecution, however, countered that the accused had chosen not to answer any questions during his interrogation at which one of his lawyers had been present.\nMoreover, the charges were most serious and the tampering with evidence was a real risk, the prosecution went on.\nIn light of such submissions, the court, presided over by magistrate Josette Demicoli, turned down the request for bail. Lawyers Franco Debono and Mario Mifsud were defence counsel.", "comment_count": 0, "id": 1025}, {"keywords": "", "author": "", "article_body": "A man was grievously injured on Wednesday when he fell while cleaning a machine in Żebbuġ.\nThe police said the accident happened at Wied is-Sewda at 12.30pm.\nThe 26-year-old victim was treated by a medical team on site and then transferred to Mater Dei Hospital.\nThe police are investigating.", "comment_count": 0, "id": 1026}, {"keywords": "", "author": "", "article_body": "A Marsa arrested on Tuesday in connection with large hauls of cocaine and cannabis and suspected of being part of a drug trafficking ring was remanded in custody on Wednesday after pleading not guilty to drug-related charges.\nThe 33-year old driver, whose name was banned from publication under court order, was arrested in Fgura by police acting on a tip-off about an alleged drug deal.\nOfficers found 142 capsules of cocaine inside a bag on the passenger seat of a car. The man co-operated with the police and led them to a Ħamrun garage, where they found 11.5kg of cannabis grass.\nHe was arrested and arraigned on Wednesday and pleaded not guilty to having conspired to traffic drugs, possession of cannabis grass and cocaine under circumstances indicating that the drugs were not for his own personal use and the procurement of cocaine.\nProsecuting Inspector Kevin Pulis told the court that investigations were still at a premature stage and strongly objected to the suspect being granted bail.\nThere was a risk he would tamper with evidence still being gathered by investigators, the inspector said.\nWere he to be granted bail, further evidence would possibly not be brought to court, the prosecution argued.\nLawyer Martha Mifsud, acting as defence counsel, countered that her client was still presumed innocent and had co-operated with the police, supplying them with information.\nAfter hearing submissions by both parties, magistrate Josette Demicoli rejected the bail request.\nThe court also issued a freezing order upon the man’s assets and ordered that his name be withheld, to safeguard the interests of a minor and to ensure ongoing investigations were not hindered.", "comment_count": 0, "id": 1027}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Former parliamentary secretary Jason Azzopardi has defended the controversial Fekruna Bay expropriation deal, insisting he was proud of the outcome and that he had nothing to be ashamed of.Dr Azzopardi was meant to deliver a sworn declaration to the Public Accounts Committee on Wednesday as it continued its discussions on a National Audit Office report into the 2013 land deal by the previous Nationalist administration.But the meeting descended into farce as Nationalist and Labour MPs sparred for a full hour over whether Dr Azzopardi should deliver the statement verbally or in writing. Committee chairman Beppe Fenech Adami argued that previous witnesses before the PAC had all been allowed to read out their statement, while Labour MP Robert Abela insisted this was at the discretion of the committee and demanded a vote.As a shouting match ensued, Dr Fenech Adami eventually requested a ruling from the Speaker and suspended the meeting.\n'No suggestion of illegality'\nIn his lengthy statement, a copy of which was provided to Times of Malta by Dr Azzopardi, the Nationalist MP repeatedly stressed that no illegality had ever been suggested, that all valuations had been drawn up by independent experts, and that he had not in any way influenced the negotiations.According to the NAO report, on March 5, 2013, just days before a general election, the Lands Department had signed a contract transferring two properties in Swieqi and San Ġwann, worth €4.3 million jointly, as payment for land expropriated at Fekruna Bay, Xemxija.The Fekruna land was valued at €5 million and the difference in favour of Fekruna Ltd, €700,000, was offset against amounts due to the government by the company in lieu of capital gains tax and duty on documents.The report found that taxpayers had lost more than €1 million through the deal. However, it also acknowledged that the goal of acquiring the land to return it to its original state had served the public interest.Dr Azzopardi said on Wednesday that as a result of the deal, the public had a guarantee that that environmentally sensitive site would remain accessible and would never be built up. He said three different architects commissioned by the Government Property Department (GPD) in 2010 had all reached the same valuation of €5 million. Architects commissioned by Fekruna Ltd had valued the land at between €6.75 and €7.5 million.Would it have been just for the expropriation not to take place simply because there was an election around the corner?Dr Azzopardi said the valuation was realistic and reasonable when compared to the expropriation in 1996 of a similar-sized plot - which, in contrast, was not developable - for around €932,000. He also said the sites in Swieqi and San Ġwann were not chosen by Fekruna Ltd but by the Lands Department, and valued by three jointly-chosen experts. “If the only criticism is that the expropriation took place a few days before the general election, my answer is clear: after more than three and a half years of negotiation, would it have been just for the expropriation not to take place simply because there was an election around the corner?”Dr Azzopardi said that if there had been any illegality in the process, the Labour government had every legal right and opportunity to revoke the deal, but that it had opted instead for “cowardly mud-slingling”. He said a report by the government’s Internal Audit Investigations Department (IAID) had concluded that the case was merely one of an “administrative shortcoming”. Dr Azzopardi reiterated the strong public interest that the deal had served and said his only regret was that the government at the time had not concluded the expropriation of other sensitive sites, including Festiva in Mellieħa, Rivieria Martinique in Għajn Tuffieħa, and the Ulysess Lodge and Tigulio sites in St Julian's.", "comment_count": 11, "id": 1028}, {"keywords": "", "author": "", "article_body": "All traces of Comino’s makeshift camping ground have been swept clear by Environment and Resources Authority officers, the ERA said in a statement on Wednesday.\nThe camping grounds in the island’s Santa Marija Bay area were damaging Comino’s natural heritage and were “not covered by the required ERA permits,” the regulator said.\n“All camping related equipment and litter present on the site was dismantled and taken away. Fire-pits were also dismantled,” the ERA said.\nOfficers hauled away tents, poles, crockery, bedding, tanks and sinks, with more than one tonne of material confiscated in total.\nAll items were taken to Gozo by licensed waste carriers and disposed of.\nThe ERA had given advanced warning that it would be shutting down the makeshift camping area at the turn of the year, and works started on a licensed 10,000 square metre camping area further inland, in an area of Comino known as Tal-Ful.\nItems hauled away by the ERA.\nThe site will be managed by new environmental agency Ambjent Malta and is expected to be welcoming campers in May.\nLast year, Times of Malta reported that the Santa Marija Bay area was gradually morphing into a shanty town, with tents remaining in the area year-round.\nOn Wednesday, the ERA said that officers clearing the site could not identify any particular person responsible for the illegal site.\n“The halting of camping activities in the Santa Marija Bay area and its eventual reinstatement is in line with the approved management plan for Comino and its surrounding islets,” the ERA added.", "comment_count": 24, "id": 1029}, {"keywords": "", "author": "", "article_body": "Updated at 7.10pm\nA crew member aboard a vessel being tugged was grievously injured on Wednesday when a towing line pulling them along ripped.The tug  boat's towing line ripped\nThe APL Oregon was being tugged to or from the Freeport by Tug Malta's Wenzina at around 1.30pm when the incident happened, sources said.\nThe Freeport said it duly assisted by dispatching a nurse to the scene, adding that the issue was being addressed by Tug Malta and the relevant authorities.\nThe police said when contacted that there were three crew members on board the vessel. One, a 61-year-old man from Marsascala, was hospitalised and the other two, another 61-year-old man from Marsascala and a 36-year-old man from Xgħajra were sent to a health centre.\n \n ", "comment_count": 0, "id": 1030}, {"keywords": "", "author": "", "article_body": "An orthopaedic consultant has been awarded damages of €117,173 after he was held and beaten up by three men in an incident during the Isle of MTV concert in 2013.\nThe case was instituted by Jason Zammit against Chris Joseph Griffiths and  Anu Ogunbiyi.\nHe told the court that during the concert the two men and others, who remained unidentified, had been waving their hands and jumping, hitting and harassing his children in the process.\nHe politely asked them to stop but was ignored. Policemen who happened to be close by also told them to stop harassing them. \nAs the men moved on, Mr Zammit said Mr Griffiths accused him of having made a racist remark against Mr Ogunbiyi, who is of Nigerian descent.\nMr Zammit strongly denied the claim.\nThe group of men moved on, but they returned 45 minutes later, grabbed Mr Zammit and held him while he was punched kicked and headbutted. His daughters were also assaulted.\nThe accused pleaded not guilty and denied responsibility.\nTestifying, Mr Griffiths said he did not know if it was Jason Zammit who had passed the racist remark, but that it came from his direction. \nMagistrate Lawrence Mintoff, after hearing various witnesses, including the police, said it believed the version of events given by Mr Zammit.\nThe Civil Court dismissed the claim of a racist comment having been made, and added that in any case that did not justify the assault, made some 45 minutes later.  \nIt also established that Mr Zammit had suffered a disability of 11% and ordered the accused to pay damages of €117,173 between them.", "comment_count": 0, "id": 1031}, {"keywords": "", "author": "Ivan Martin", "article_body": "Motorists could find it even harder to get fuel this week if an urgent meeting between the government and pump station owners was not set, the GRTU – Malta Chamber of SMEs has warned.\nStation owners announced on Monday night that fuel would not be available from pumping stations after they close at 6pm. The action started on Tuesday.\nIndustrial action was announced on Monday as a long standing dispute over higher profit margins with the government persists. In line with directives issued so far, the pumps are switched off once fuel stations close at 6pm and licence payments to the Regulator for Energy and Water Services have been suspended.\nThe GRTU’s CEO, Abigail Mamo, said on Tuesday the action would be stepped up over the next few days unless the government agreed to hold an “urgent meeting”. However, she would not say what type of action was being contemplated.\nTimes of Malta is informed that Resources Minister Joe Mizzi would be unable to hold a meeting before the weekend because he was abroad on official business.\n“When the government wants to take urgent action, it finds a way to do it. Waiting until the weekend is just not acceptable for us,” Ms Mamo insisted.\nWaiting until the weekend is just not acceptable for us\nThe GRTU said on Tuesday night many fuel station owners that had joined the Enemed franchising reported being contacted by officials of the fuel  distributor/supplier to enquire whether the owners would be taking any actions and whether this could have any repercussions on Enemed. Enemed denied the claims.\nThe GRTU, which represents petrol station owners, deplored such behaviour.\nThe government said last week it had made an alternative proposal to fuel station owners. Though no details of the proposals were released by either side, it was flatly rejected by the fuel station owners.\nThey have been tussling with the government over a plan under which they would have to upgrade their facilities by next year to be in line with new requirements set by the Environment and Resources Authority and the Regulator for Energy and Water Services.\nTalks between the GRTU and the government have been dragging on for about four years and operators are expected to refurbish fuel stations by next year at an expense that could be as high as €500,000 per station.\nThe owners are arguing the government could still meet their demands without having to increase the price of petrol and diesel.\nHowever, the government insists their claims would mean consumers would have to pay more for fuel and notes that, in 2011, the Malta Resources Authority had granted fuel station owners an increase in profit meant to extend to next year.\nThe owners say the 2011 increase was eaten up by other costs.\nThe Nationalist Party on Tuesday said the government was obliged to meet with station owners to find a solution.", "comment_count": 33, "id": 1032}, {"keywords": "", "author": "", "article_body": "The final witness due to testify in the prosecution's case concerning the murder of Paceville kingpin Hugo Chetcuti no longer lives in Malta, the Chetcuti family’s lawyer told the court on Wednesday.\nLawyer Joe Giglio began the court session by noting that the prosecution’s sole scheduled witness that day - a doctor involved in Mr Chetcuti's medical care - was furthering his medical studies in the UK and would remain there for an entire year.\nThe doctor was due to testify in the compilation of evidence against Bojan Cmelik, who stands accused of having murdered Mr Chetcuti last July.\nMr Chetcuti was arguably Malta’s most famous nightclub entrepreneur, having taken over much of Paceville over the previous decade. He was stabbed outside one of his venues on a busy Friday night, with the police arresting Mr Cmelik a short while later.\nTwo armed officers stood guard outside the courtroom, with four more inside, keeping an eye on Mr Cmelik.\nRead: Doctors recall 'huge amounts of blood' as they operated on Hugo Chetcuti\nOn Wednesday, Dr Giglio asked the Attorney General to drop its request for the doctor living overseas to testify, noting that he had served as an assistant to doctor Alex Attard, who had already testified at great lengths. \nA prosecuting inspector confirmed with the court that the missing doctor was the sole remaining witness left to summon.\nMagistrate Marse-Ann Farrugia took note of Dr Giglio’s request and ordered that it be passed on to the Attorney General. Should they insist on presenting the remaining witness, they would have to appear via video conferencing, she added.\nThe case was adjourned to February 25.", "comment_count": 0, "id": 1033}, {"keywords": "", "author": "AFP", "article_body": "The European Union urged member countries on Wednesday to crack down on schemes granting \"golden visas and passports\" to foreign investors, warning they can bring corruption and money laundering in their wake.\nThe European Commission, the EU executive, published a report urging members to curb the practice of giving foreigners -- often Chinese, Russians and Americans -- residency or citizenship in return for investment.\n\"We speak about opening (a) golden gate to Europe for some privileged people who have the money to pay for citizenship or residence,\" EU justice commissioner Vera Jourova said at the report's publication. \n\"We are looking at it with concern,\" Jourova told a news conference in Brussels.\nThe commissioner said investor residence and citizens schemes, known as \"golden visas and golden passports,\" should not be a weak link in EU efforts to curb corruption and money laundering.\n\nThe report said wealthy candidates for residency or citizenship do face insufficient security and background checks to prevent them from posing a security risk, laundering money or evading taxes.\nEU countries set conditions for granting and withdrawing nationality but must do so with respect for EU law, enforced by the European Court of Justice, officials said.\nThe bloc's laws are important as a citizen of one EU country has the right to travel to others, exercise economic activities within the 28-nation internal market, and vote in local and European elections.\n\"Crime has no borders,\" said Jourova, a Czech politician.\nThe Commission complained that Bulgaria, Cyprus and Malta run schemes granting foreign investors citizenship without requiring them to live in those EU countries or show \"genuine connections\" to them.\nThe investor citizenship schemes, known as \"golden passports,\" offer less strict requirements than those for foreigners seeking to become naturalised citizens.\n- 'Transparency and oversight' -The Commission also said residence permits pose serious security risks to member states.\nAn EU residence permit gives a third-country national the right to live in the member country and to travel freely in Europe's passport-free Schengen area.\nBritain, Bulgaria, the Czech Republic, Estonia, Ireland, Greece, Spain, France, Croatia, Italy, Cyprus, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania and Slovakia run these schemes.\nThe Commission said there was a lack of \"transparency and oversight\" of the residence schemes, including too few statistics on how many people obtain a residence permit in this way.\nThe Commission warned \"it will take necessary action as appropriate\" if member countries fail to comply with EU law and rules on border checks, money laundering and tax avoidance.\nIt said it will set up a group of experts from member countries to improve the transparency, governance and security of the investor schemes.\nThe aim is to develop a common set of security checks for investor citizenship schemes by the end of 2019.\nThe problem of \"golden visas and golden passports\" has been flagged by non-government organisations.\nIn October last year, Berlin-based Transparency International and London-based Global Witness called EU citizenship and residency as \"just like a luxury good\" which \"can be bought\".\n\"By their very nature, golden visa schemes are an attractive prospect for the criminal and the corrupt,\" they wrote.\nSeveral EU members have used such schemes to give passports to around 6,000 people and residency rights to around 100,000 people in the past decade, securing about 25 billion euros ($29 billion) of foreign direct investment in return, the NGOs said.\nThey said Spain, Cyprus, Portugal and Britain are the countries that have received the most investment in return for visas. Spain received 976 million euros annually compared to 498 million euros in Britain.\n ", "comment_count": 44, "id": 1034}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 6.45pm with Opposition leader's comments\n\nMalta wants to be the best UK-friendly country after Brexit, Prime Minister Joseph Muscat said on Wednesday as he outlined Malta's preparations in the event of the UK leaving the EU without a deal.\nHe told a press conference that Malta regretted the UK's departure from the EU and hoped its withdrawal would not be without a deal.\nMalta agreed with the other EU member states that the exit deal agreed between the UK and the EU (and rejected by the House of Commons last week) should not be reopened. Malta agreed, however that the EU should be ready to offer clarifications to avoid a no-deal scenario. \nRead: Anxious laughter as British nationals ask about no-deal scenario\nThe agreed Brexit deal Dr Muscat, he said, was a balanced one providing peace of mind for businesses while respecting the principles laid by both sides, protecting the single market and ensuring that the Irish border backstop only came into force if there was no alternative. It also allowed a transitory period.\nThe Malta government Cabinet on Tuesday discussed preparations in case there was a no deal Brexit, he noted. \nAround 13,000 Britons live in Malta, of whom 5,000 work here. A large number of Maltese also live in the UK and the Malta government had noted the UK’s safeguards for EU citizens living there.\nWhat will happen to British citizens in Malta?\nAs far as possible, Malta wanted to see no change in the status and living conditions of Britons already living in Malta, the Prime Minister said.\nAs agreed with the UK government, they would be required to apply for a residence permit.\nThat permit would give them special status as citizens of a former EU country and their rights would continue to be retained.\nThis residence permit will be valid for 10 years - longer than any other residence permits. It could then be renewed, and no charges would be imposed for the permit application.\nAs a result, students will be able to continue to study in Malta, workers could continue to work here, and residents could continue to stay here.\n“You have nothing to worry about, even if there is a no-deal,” Dr Muscat said addressing British residents in Malta.\nBritons who come to live in Malta after Brexit would also have a 10-year residence permit, but in their case their rights would be equal to third-country nationals coming to Malta.\n“They will be charged residence fees currently applicable to non-EU nationals and, if they want to work, they need an employment licence,\" he said. \nIn case of no-deal Brexit, Britons living here will continue to vote in local council elections, Dr Muscat added. This proviso already existed before Malta joined the EU.\nWhat Brexit arrangements will be made in the health sector?\nDr Muscat said Malta also wanted to keep good relations with the UK in the health sector. While fewer Maltese now needed hospital treatment abroad, some needs remained, he said.\nThe Malta-UK health agreement signed in 1975 would remain in place and the Medical Council would introduce a fast-track system to register professionals from the UK.\nMaltese doctors trained in the UK would be recognised according to existing arrangements. Malta and the UK also intended to mutually recognise each others’ doctors, he added.\nWhat about imported medicines?\nDr Muscat said some stockpiling of UK-imported medicines had already been made, where appropriate according to shelf life. Alternative suppliers had also been identified.\nThe Medicines Authority has held talks with importers to ensure there were no shortages or price increases. Some importers had taken proper action, while other woke up a bit too late, he noted. \nWill air travel provisions change?\nA drop in the value of the Sterling would make a holiday in Malta more expensive for Britons, Dr Muscat acknowledged, saying that the Tourism Minister was working to ensure that tourist arrival numbers were maintained.\nThe government is considering introducing a preferential track for arrivals from Briton, along with EEA and EFTA countries.\nHow will customs procedures change?\nIn the event of a no-deal Brexit, customs would have to be imposed immediately on imports from the UK, Dr Muscat said.\nHe was pleased with the preparations being made by the Customs Department.\nDr Muscat speaks to the press. Photo: DOI/Omar Camilleri\nIn case of a no-deal, Customs would have an additional 6,000 to 7,000 customs declarations to handle, ranging from packets with a value of over €22 right up to containers. Simulations showed Customs was ready for the challenge.\nHe said the government was prepared to help exporters mitigate the additional costs of exporting to the UK.\nDr Muscat said a Brexit helpline would be introduced in Malta and the UK as from next week and details will be issued in due course.\nUK businesses attracted to Malta\nAsked about Malta’s efforts to attract businesses from the UK to Malta, Dr Muscat said a number of companies had already opted for co-location.\nDr Muscat said Malta had not targeted the large multinationals but instead relatively smaller companies of a few thousand employees. In particular Malta had targeted UK companies with mother companies in the US, India, and Japan. There would be a “steady flow” of businesses registering in Malta he said.\nReacting to media reports that major gaming companies were eyeing a move to Malta, Dr Muscat would not get into specific names of companies but said the reports were true.\nMost market leaders in the sector were already in Malta, he said, and the feedback the government was receiving was “where will we base our offices” and “where will we send our children”. On this latter point, Dr Muscat said a call for a new international school in Mtarfa had already been issued.\nLoss of ally in taxation talks\nAsked for his position now that Malta would lose a major ally when it comes to its EU battle on tax harmonisation, Dr Muscat told Times of Malta that this would be an uphill struggle for the country.\nLike-minded member states needed to “man up” and speak out, he said. \n“I think the issue is that for too long many countries have relied on the UK to lead the fight on this issue and this cannot continue,” he said.\nIs Malta prepared for any scenario, Delia asks\nMeanwhile, speaking in Parliament on Wednesday evening, Opposition leader Adrian Delia asked whether Malta was prepared for any scenario, including the possibility of the UK opting for another Brexit referendum.\nHe also said that while the Opposition agreed with the Prime Minister on the living conditions of Britons in Malta, he wanted assurances that none of the proposed measures fell short of other EU laws. \nThe government, he went on, should also ensure that those Maltese citizens living in the UK are given the same conditions offered to the Britons living in Malta. \n“The government should put pressure on the UK government to ensure that it provides Maltese living there the same 10-year window,” Dr Delia insisted. He also asked the government to ensure businesses have continuity.", "comment_count": 66, "id": 1035}, {"keywords": "", "author": "", "article_body": "Malta saw the third biggest increase in tourist bed nights last year, figures issued by the EU on Wednesday show.\nThe number of nights spent in tourist accommodation in 2018 grew in nearly all EU member states, with the largest increases being observed in Latvia (+8.3%), Lithuania (+7.7%) and Malta (+6.5%), followed by Poland (+5.8%), Romania (+5.5%) and Belgium (+5.4%).\nIn contrast, decreases were registered in Luxembourg (-4.3%), Ireland (-1.5%) and Spain (-0.9%).\nIn 2018, the number of nights spent in tourist accommodation establishments in the European Union reached more than 3.1 billion, up by 2.2% compared with 2017. Since 2009, there has been a steady increase in the number of nights spent in tourist accommodation establishments in the EU, notably driven by the rise in the nights spent by non-residents of the country visited.\nIn actual figures, Spain (467 million nights, -0.9% compared with 2017) retained its lead, ahead of France (444 mn, +2.4%), Italy (429 mn, +1.9%) and Germany (419 mn, +4.3%).  \n  ", "comment_count": 11, "id": 1036}, {"keywords": "", "author": "", "article_body": "The legacy of Valletta 2018 would be the rebirth of the capital city, Justice and Culture Minister Owen Bonnici has told parliament. \nHe responded to claims by Opposition MP Karl Gouder and others that the initiative had fallen flat by leaving no legacy.\nMr Gouder had asserted that years had been spent agonizing over how to use Valletta 2018 to instil a greater appreciation of culture among the Maltese. \nBut  this aim had not been reached, and the events of the past year would be forgotten as they had not left anything tangible behind=.\nIn his reply, Dr  Bonnici pointed to MUŻA (the new arts museum), the new University Campus Theatre (formerly known as MITP), and the refurbished Tritons fountain as evidence of the real impact that the programme had on Valletta. \nThe exchanges were made during the last part of the debate on amendments to the Cultural Heritage Act.\nReferring to the use of direct orders by various cultural agencies, the minister argued that it was impossible to do otherwise when a specific performer needed to be engaged.\nAddressing the content of the amendments under discussion, the minister referred to criticisms made by Nationalist MP Therese Comodini Cachia last week and insisted that the Opposition MP seemed to have understood nothing of what was being proposed.\nThe amendments would not reduce the power available to the Superintendence of Cultural Heritage, but would reduce its duties in order to allow it to focus its resources in a better way. \nDr Bonnici argued that the Superintendence for Cultural Heritage had never been more involved. Whereas the Planning Authority had formerly decided which cases to refer to the Superintendent for an opinion, a decision taken by the government years prior had started the referral of all planning applications to his office.\nIt was furthermore untrue that the Planning Authority could override the decisions taken by the Superintendence, which had extensive powers to protect Maltese heritage. Thirteen graduates had been engaged by the Superintendence over a one-year period, he said, whereas there had not been 13 persons working there in total prior to 2013.\nThe minister pledged to take on board a suggestion to reduce the required hours of professional development stipulated by the new amendments in order for the conservation warrant to be retained, should Parliament give its assent.\nMr Gouder praised the fact that those who deserved warrants would finally receive the professional status that their qualifications and experience merited.\nMeanwhile, during parliamentary questions, Transport Minister Ian Borg yesterday asked the Opposition to state its position on the Central Link Project. \nThe proposed works had been on the blackboard since the 1980s, but successive PN governments had refused to carry them out to the detriment of those living in congested central areas.\nThe project would address the infrastructural bottleneck in the centre of Malta, which could no longer be swept under the rug. \nThe original plans had been amended multiple times following feedback, Dr Borg said.\nThe minister also commented about the Marsa flyover, for which works were well underway, and the Gozo tunnel, which various research had shown would lead to benefits for both Malta and Gozo. There had been complete silence from the Opposition on the latter issue, he said.", "comment_count": 2, "id": 1037}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some 30 housing estates across the island will be renovated through a funding programme announced on Wednesday.\nHousing Parliamentary Secretary Roderick Galdes said the works, costing some €150,000, would be based on requests made by tenants consulted last year.\n“These buildings are decades old and some of them have never had any major maintenance works. Some will have new membrane laid on roofs, others will have apertures and walls fixed, or new tiling,” Mr Galdes said.\nThe investment follows €320,000 invested between 2017 and last year to overhaul some 63 housing blocks.\nThis year’s works will be carried out at six blocks in Ta’ Xbiex, five blocks in Msida, four blocks in Floriana, three blocks in Ħamrun, three in Sta Luċija, two blocks in Valletta, Marsa, Żejtun, Sta Venera, and one block in St Julian’s.Housing Authority head Leonid Mckay said he had yesterday visited a number of blocks where works under last year’s funding allotment were under way.\nWatch: Muscat uses May 1 rally to pledge 500 new social housing units\n“I was approached by a resident who told me that the clearing up of their building’s facade and hallways had improved relations between residents - that is an unseen consequence of this maintenance effort, there is a social benefit to this,” he said.\nSome of the buildings, Mr Mckay said, were partially inaccessible prior to the removal of bulky waste or renovation works.\nThe authority administers some 7,600 housing apartments, and last year spent around €2 million to maintain and improve existing buildings. This, Mr Galdes said, was a significant increase over the average €300,000 that was spent annually some five years ago.\nFielding questions from reporters after the press conference, Mr Galdes defended the government’s efforts when it came to building of new housing blocks. Works were ongoing and brand new blocks would be open to the public soon, he said.", "comment_count": 8, "id": 1038}, {"keywords": "", "author": "", "article_body": "A 33-year old man was arrested in Fgura on Wednesday after 1.5 kilos of cocaine were found in his car ready for trafficking.\nPolice said further searches of the man's garage in a complex in Ħamrun yielded around 11.5 kilos of cannabis. \nA 27-year old man from Mosta was also arrested in relation to the ongoing investigation, police said. \nThe pair are expected to be arraigned on Wednesday. Magistrate Aaron Bugeja is leading an inquiry.", "comment_count": 1, "id": 1039}, {"keywords": "", "author": "", "article_body": "Just four couples opted for a civil union as a means of pledging themselves to one another last year, with marriage equality laws having made the 2014 legislation almost redundant.\nOf the four civil unions, one was between a man and a woman and the other three between same-sex couples, Prime Minister Joseph Muscat told parliament on Tuesday evening. He was answering a parliamentary question by Labour MP and whip Byron Camilleri.\nThe miserly number represents a significant drop from previous years. In April 2017, Equality Minister Helena Dalli had said that 163 couples had opted for civil unions since they were introduced into Maltese law in April 2014 – an average of 54 every year. \nBy June of that year, that number had shot up to 200. \nA few months after Dr Dalli shared those numbers, parliamentarians went one step further and introduced marriage equality legislation, effectively allowing same-sex couples to tie the knot more conventionally. A legal notice commencing that law was issued on September 1 of that year.\nCivil union laws give couples a legally recognisable acknowledgement of their partnership, setting them at a par with married couples and ensuring any children they have are protected by law.\nIt appears local legislators were themselves aware that marriage equality laws would eventually eclipse civil unions: a 2017 amendment to the Civil Unions Act allows couples who tied the civil union knot before marriage equality laws came into force to convert their union to a fully-fledged marriage, provided they do so by 2022.", "comment_count": 0, "id": 1040}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Seven years after a patient at Karin Grech Hospital choked to death over a piece of chicken, criminal proceedings against three members of the nursing staff are drawing to an end.\nChief nurse Maria Bondin, 61, from Paola, nursing aide Carol Bonnici, 59, from Siggiewi and nurse David Sant, 34, from Gharghur, were arraigned and accused of involuntary homicide following the incident on Following that fateful day back in March 7, 2012.\nThey protesting their innocence in respect of the death of the then-64 year old patient.\nThe man, who suffered from dementia and was to be supervised while eating, had been recovering at the rehabilitation hospital when he choked on a piece of chicken and was found face down on the bathroom floor after going missing from his ward.\n“It was like something out of a Charles Dickens novel,” lawyer Stefano Filletti said in court when making final arguments on behalf of the man’s widow, who has been seeking closure for the past seven years.\n“He took a piece of food, walked to the toilet and took his last breath face down on the bathroom floor, close to the toilet bowl,” continued Dr Filletti. “This was a terrible, tragic death. It could have been avoided. We’re not after the pound of flesh but someone has to answer for this.”\nThis was a terrible, tragic death. It could have been avoided. We’re not after the pound of flesh but someone has to answer for this- Widow's lawyer\nThe victim, who had limited chewing capacity and had been placed on a soft food diet, had been served a chicken meal shortly before he had met his fate, at a time when hospital regulations had labelled chicken as ‘soft food.’\nYet, the meat could not have been served to that particular patient without having been properly cut up and thickened to the consistency indicated by a speech-language pathologist.\n“The food was heated and served. No one checked what had ended up on his plate…The thickening process was a medical process not a catering task. Someone was to do it and keep an eye on him,” Dr Filletti argued, stressing that the fault lay not on the hospital system but on the staff who had been negligent in their duties.\n“The system, even if rudimentary, was functioning. It was the fault of those handling it”, Dr Filletti concluded, his arguments backed up by Superintendent Dr Jeffrey Azzopardi, pointing out that the staff had been on full complement on the day of the incident.\nBesides, the feeding instructions had been clearly fixed to the patient’s bed, the prosecuting officer argued. “Those were orders, so the negligence was absolute.”\nDefence: It was the system that failed, not the staff\nThose arguments were promptly rebutted by the defence lawyers who stressed that it had been the system that had failed rather than the co-accused, so much so that after the tragic death, hospital rules had been changed.\n“We don’t know who made the rules or who changed them,” argued Dr Stephen Tonna Lowell assisting the nursing aide, the lowest ranked among the three co-accused who sat silently at the dock all throughout the two-hour long hearing.\n“The six-month magisterial inquiry was inconclusive. No fingers were pointed at anyone. The police had been asked to continue to investigate,” Dr Tonna Lowell continued, pointing out that the inquiry had been instituted only after the widow had voiced her concerns regarding the death of her husband with a private lawyer.\nCharges had been instituted against the three members of the nursing staff on the grounds that no-one had checked the food nor supervised the patient, the lawyer went on.\nREAD: Chicken that choked a man to death was classified as a 'soft food', court hears\nAn internal inquiry, concluded in 2012, had also proved inconclusive, Dr Tonna Lowell said, adding that several questions had been left unanswered, such as why chicken had been classified as ‘soft food’ at the time. After the incident, it was re-classified as part of the ‘regular’ diet, the court was told.\nThe patient had not been placed ‘under constant watch’ nor was he to be fed by carers but was only to be supervised while eating, the lawyer went on, further questioning how the chicken could have been mashed when there had been no liquidizer in the ward, the only cutlery being the plastic ones provided by the caterer.\n“This was the system!” Dr Tonna Lowell remarked, stressing that it was only after the tragedy that rules had been changed.\nAs for his client, the lawyer said that at the time the nursing aide had been allocated patients in two room.\n“She was either expected to have x-ray eyes or powers attributed to Padre Pio,” concluded Dr Tonna Lowell with a hint of sarcasm, while questioning how the aide could have been watching over the sleeping patient, when a tray of food had allegedly been placed before him, while she had been in another room.\nDr Michael Sciriha, assisting the chief nurse, whilst supporting the arguments raised by Dr Tonna Lowell, also questioned how charges could be levelled against his client when, according to her job description, she had not been responsible for supervising or feeding patients.\nAs for the third co-accused, the staff nurse who had given ‘a hand over’ before the incident occurred, he had informed the other nurse that the patients were ‘ok’, before taking his break, defence lawyer Joseph Grech said.\nMoreover, the food could not have been checked earlier on since it had been delivered in a sealed warmer that unlocked automatically by means of a timer and the food served immediately while still warm, Dr Grech argued.\n“Something went wrong with the hospital management at the time. Things have now changed after that tragic incident,” the defence concluded.\nMagistrate Donatella Frendo Dimech, adjourned the case to March for judgment.", "comment_count": 0, "id": 1041}, {"keywords": "", "author": "Keith Micallef", "article_body": "Including a mass transport system such as a monorail in the proposed Malta-Gozo tunnel has been ruled out by the head of the committee overseeing the implementation of the massive project.\nFormer parliamentary secretary Franco Mercieca excluded the option when asked by the Times of Malta for his reaction to appeals made by the Gozo Tourism Association and the Association for Gozitan Employees in Malta.\n“The Labour manifesto was clear in this regard as the pledge was to build a permanent link only, with no reference to the monorail system,” Dr Mercieca said.\n“Plans on this project have been in the pipeline for five years and changing the entire concept at this stage to cater for a monorail system would mean having to start from scratch,” he added.\nHe also pointed out that, to cater for this means of transport, the overall cost would soar by five to 10 times and result in significant delays to complete the project.\nA proposal for a permanent underground monorail link between the two islands, as part of a wider metro network, had been floated two years ago by the Nationalist Party during the election campaign. The idea was recently revived by the GTA through a resolution calling on the government to look to the issue of the connectivity between Malta and Gozo through a wider perspective by means of an underground network.\nThe association’s CEO, Joe Muscat, was yesterday quoted by The Malta Independent as saying that having a tunnel exclusively for cars would solve the 20-minute crossing but cause bottlenecks at both exits.\nThe Association for Gozitan Employees in Malta yesterday expressed disappointment at the fact that it had not been actively consulted. It also raised concern that the project excluded a mass rapid transit system, which, it noted, “would better suit the needs of the whole country”.\nA metro system linking strategic points like Valletta, the University and Mater Dei Hospital would better address the daily commuting needs of Gozitan workers, it said. Such form of transport, it continued, would be more environmentally friendly because it would ease traffic emissions.\nDr Mercieca disputed this, saying that even a monorail could pose certain environmental problems such as the impact on areas where it would be above ground.\nHe declined to say how much the tunnel project was expected to cost, adding this would be announced “soon”, when the final conceptual design would be in hand.\nDr Mercieca said the project would be financed by the private sector, in return for recouping the investment through a concession to operate the tunnel for a number of years.\nAs for the cost for commuters, he noted the government would be doing its utmost to ensure tolls would be affordable, partly through incentives like discounts for frequent travellers.", "comment_count": 94, "id": 1042}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 2.20pm with government denial\nThe government has reopened talks with the Corinthia Group to modify deals on projects on the St George’s Bay peninsula after receiving legal advice that it could be in breach of EU State aid rules.\nThe advice came from a reputable Brussels-based legal firm, which noted that if the present draft deal was cleared, the government could face a legal challenge by interested parties over breach of EU State aid rules, sources said.\nOne main bone of contention was the price tag, the sources pointed out. The concession in question would fetch about €700 million at current market prices but it has been reported the hotel chain would only be paying about €17 million.\nThis, the sources warned, was likely to be deemed discriminatory towards other developers who might want to compete with Corinthia in the sale of real estate.\nThe government was warned that the deal, in its present form, did not make for an equal level playing field for real estate developers.\nThe government was also advised that the new temporary emphyteusis agreement it wants to sign with Corinthia would require the issue of a public call for tenders as it involves public land and a complete change in use.\nThe deal does not make for an equal playing field for real estate developers\nHowever, Tourism Minister Konrad Mizzi, who is leading the talks, is reportedly not agreeing with the legal advice, fearing the government might not be in a position to honour the “unwritten commitment” it has with the Corinthia chain.\nThe government last week cancelled at the eleventh hour a meeting of the parliamentary committee discussing the deal. It should now meet next month.\nApart from the potential legal challenges, the government is also facing  opposition from a section of the business community, including the Malta Developers’ Association and real estate agents.\nIn the 1990s, the Corinthia Group had been granted temporary emphyteusis for 99 years to use large parts of public land at St George’s Bay exclusively for touristic purposes, mainly hotels. The group had decided not to bid when a large parcel of public land adjacent to their properties in the area, the site where the former Institute of Tourism Studies stood, was made available for real estate development through a tender.\nThe land was awarded to the db Group, the only bidder, for €15 million payable over seven years. This deal is being scrutinised by the National Audit Office.\nAfter the db Group deal was announced, the Corinthia Group started talks with the government aimed at dropping the arrangements signed in the 1990s and instead negotiating a new deed allowing it to develop about 100,000 square metres of real estate into apartments and retail areas for speculation purposes. The government agreed and Corinthia was given terms similar to those granted to the db Group.\nAccording to a draft deed, which is still unpublished, Corinthia will pay a premium of €17 million for the land occupying most of the peninsula. Payments will be made over a number of years according to how much real estate was built and sold. On the basis of the draft agreement, the hotel chain would pay about €4 million during the first three years from the signing of the deed.\nBoth the Nationalist Party and Democratic Party said they would vote against the deal when it is presented in Parliament.\n'No reason to change opinion' - government denies claims\nIn a statement issued on Wednesday afternoon, the government denied that it had received legal advice to amend the deal, saying this was \"an outright fabrication\". \nIt however acknowledged that it was meeting with stakeholders \"to understand their concerns about the project\" and talking to the Corinthia Group to address the concerns. These talks, it insisted, had nothing to do with state aid considerations. \nPM: We cannot discriminate against the investors\nReplying to questions on Wednesday, Prime Minister Joseph Muscat confirmed that changes were being made to the draft deal with the Corinthia.\nHe said the government listened to everyone and concerns, where justified, would be addressed.\nBut it was important that there was a level playing field, he said. Given the way public land was disposed of so far, one could not discriminate against these investors. This applied both to the value of the land and the term of the concession.\nHe had no doubt, he said, that this would be a good deal for the country.\n“If this country wants to modernise itself and have best quality tourism, we need to take decisions,” he said.\nNGOs request meeting\nLater on Wednesday, a  large number of NGOs, residents’ groups and three local councils said they have written to Labour MP  Alex Muscat, chairman of parliament's Environment and Development Planning Committee, requesting an urgent meeting of the committee to discuss the proposed deal.\nThey said that the deal would have repercussions on the public and the natural environment. In terms of the Aarhuus Convention, early public participation, when all options were still open, was a requisite when decisions of such magnitude were being made.\nMoreover,  the public has a right to know whether the necessary studies for such a massive development had been conducted and concluded.  \nThe request was made by Pembroke, Swieqi and St. Julian’s local councils and the Din l-Art Ħelwa, Flimkien għal Ambjent Aħjar, Friends of the Earth Malta, Moviment Graffitti, BirdLife Malta, Żminijietna – Voice of the Left and the Ramblers Association. They were joined by residents’ groups of Pembroke, St. Julians, Ibraġ, St. Andrews, Sliema, Għargħur and Baħar iċ-Cagħaq.", "comment_count": 31, "id": 1043}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta quotes the GRTU saying that motorists could find it even harder to get fuel this week if an urgent meeting between the government and pump station owners is not set.\nTimes of Malta also reports that the government has reopened talks with the Corinthia Group to modify existing deals on projects on the St George’s Bay peninsula after receiving legal advice EU State aid rules could be breached.\nMaltaToday says the EU has issued a weak admonition of the passports scheme. It also says that the GRTU has accused Enemed of threatening petrol station owners. \nThe Malta Independent reports that waiting time for inpatient hospital care has been reduced, but the opposite is the case for outpatient care, \nl-orizzont gives prominence to a Health Ministry statement that a baby of a few days has been admitted to hospital suffering meningitis in a case unrelated to Sunday's fatal case. It also reports on the start of a government programme to surface a large number of roads in residential areas. \nIn-Nazzjon under the heading 'Manuel Delia asked for money to continue to write for Adrian Delia' quotes testimony in court by the head of the PN media. It also reports that queues have started to build up at petrol stations. ", "comment_count": 1, "id": 1044}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Opposition MP Jason Azzopardi on Tuesday called for the establishment of an office for a special inquiring magistrate exclusively focused on the investigation and prosecution of cases involving allegations of corruption.\nDr Azzopardi, who was speaking during the adjournment in Parliament, made his call in the wake of revelations related to the sale of three Maltese hospitals to Vitals Global Healthcare in 2015.\nThat year, VGH had been awarded a 30-year concession to operate Karin Grech Hospital, Gozo General Hospital, and St Luke’s Hospital, with the sole discretion to extend that concession for a period of 99 years.\nThe deal would have seen VGH receive €70 million a year for the operation of the three hospitals, apart from the wages of each employee at the hospitals, €1.2 million for a medical school in Gozo, and €1 million a year for an air ambulance service.\nDr Azzopardi also made reference to allegations published this week that VGH had also sought to supplement its earnings by making money from the sale of cancer medication after purchasing the company Mtrace plc which provided this medication at a 25% mark-up.\nDr Azzopardi outlined the sequence of memoranda of understanding, share transfers, and company formations in which Vitals Global Healthcare had been involved.\nIn July 2017, Times of Malta reported that VGH had signed an exclusive contract for the provision of medical supplies with the company Technoline Ltd, which had been bought by its own marketing manager Ivan Vassallo months before the contract with Vitals was signed.\nThe Shift News revealed last week that Mr Vassallo had purchased the company with a loan secured from VGH.\nVGH, said Dr Azzopardi, had thus used taxpayer money to purchase companies that guaranteed it exclusivity in the provision of important medical products and a high profit margin to boot.\nThe Shift News had also revealed that, although Steward had bought VGH for only €1, they would be receiving €7 billion over a 99-year period of which millions had ended up in secret companies.\nThese facts, together with evidence that VGH had been provided with privileged information, were enough to implicate Tourism Minister Konrad Mizzi, Mr Vassallo, VGH CEO Armin Ernst, VGH President Ram Tumuluri, and others in complicity in fraud, corruption, breach of professional secrets, trading in influence, and conspiracy. The deal “was set up to fail,” he said.\nThis was more than enough to warrant the setting up of the office of a special inquiring magistrate focused solely on corruption cases.\nOpposition MP Beppe Fenech Adami questioned why revelations related to Technoline were being ignored, even though they included serious allegations against OPM chief-of-staff Keith Schembri and Tourism Minister Konrad Mizzi.\nThe MP called upon members of the police to uphold their oath to the public.", "comment_count": 23, "id": 1045}, {"keywords": "", "author": "Ivan Martin", "article_body": "An NGO vessel that rescued a group of distressed migrants last week is stranded at sea once again as the Maltese and Italian authorities insist it is not their responsibility to help coordinate the disembarkation.\nSea-Watch 3 rescued 47 migrants last Saturday in the waters between Malta and Libya, however days later they remain without a safe port where to disembark their “guests”.  The rescue took place about 50 kilometres off the coast of Tripoli. \nA spokesman for the NGO on Monday told Times of Malta that while they had made contact with the Maltese and Italian authorities, both were adamant that the vessel should instead reach out to their Libyan counterparts as they were the competent rescue coordinating authority.  \nThe spokesman said repeated efforts to contact the Libyan coast guard and other Libyan authorities in recent days had proven unsuccessful as they remained unresponsive. \nAnd, even if the NGO heard back from the Libyan authorities, they would not be prepared to disembark the migrants in Libyan as the country did not meet the international standards of a safe port.  \nThe Sea-Watch 3 is no stranger to being marooned.\n“If the Libyan authorities direct us to a safe port then yes we will follow those instructions,  but, no, we are not prepared to disembark in Libya,” the spokesman said. \nMeanwhile, a spokesman for the Office of the Prime Minister said only that Malta was “neither the appropriate nor the competent authority”.  \nThe Sea-Watch 3 is no stranger to being marooned.\nMigrants on board the vessel and another ship spent 19 days just off the coast of Malta before the government announced two weeks ago that they would be allowed to disembark.\nThe migrants, who will be shared with Germany, France, Portugal, Ireland, Romania, Luxembourg, the Netherlands and Italy, were refused entry first by Italy – which was legally bound to allow them in – and then by Malta. \nAfter some three weeks at sea, and with rough weather forecast, an agreement was finally reached on a distribution deal.\nMeanwhile, the SeaWatch group tweeted on Sunday afternoon that it was heading toward a vessel that was taking on water with 100 migrants aboard.\nThe migrants were rescued by a cargo ship, flying a Sierra Leone flag after it had been asked by Libyan authorities to intervene.\nThe NGO spokesman said the organisation was concerned that the migrants would be taken to Libya as this would constitute a violation of their human rights.", "comment_count": 0, "id": 1046}, {"keywords": "", "author": "", "article_body": "The Planning Authority is being urged to refuse an application for the construction of 30 apartments over a 250 year-old baroque scheduled garden in Għaxaq when the project comes up for discussions on Thursday.\nApart from the case officer, who is recommending its refusal, the application caused an outcry which resulted in hundreds of objections being filed with the Planning Authority. \nFiled by Michael Paris on behalf of the heirs of the late Mary Paris, the proposal seeks to excavate basement level of garages, the construction of 30 residential units over five levels, including the penthouse level, and the restoration of garden area. \nThe site is in Triq Il-Ħatem, Għaxaq. \nThe area forms part of Palazzo Giannin, a 250 year-old palazzo, which is a Grade 2 scheduled property that includes baroque architectural decorations. \nIt is a protected green enclave with a number of trees that are also protected. \nThe original application was filed in 2004 and refused in 2008. A request for reconsideration was filed and again refused in 2010. However, later that year, the matter was overturned at appeals stage when the Planning Appeals Board issued an outline permit for a maximum of 30 units spread over three separate blocks with a building height of three floors.  \nThe garden contains oaks, olive trees and Aleppo pines that are protected and cannot be felled.\nSubsequently, in 2013, the 18th-century baroque building, including its garden, was scheduled Grade 2, which means that some development is allowed but the outer structure must be preserved.\nThe submissions received by the Planning Authority say that Malta had already lost many of its trees and fertile soil, and so many of its remaining beautiful gardens. \nRead: FAA misleading the public\nObjectors, among them Flimkien Għal Ambjent Aħjar, claimed that the garden of Palazzo Giannin along with those of Villa Mekrech and Ġnien tal-Kmand, are historical green enclaves in Għaxaq. \nThe proposal prompted a barrage of complaints including a petition from Flimkien Għal Ambjent Aħjar which has been endorsed by almost 2,000 objectors. The Palazzo Giannin garden serves as a landmark of the village. \nAll three gardens are marked as a green enclave and designated as ‘Private Gardens Meriting Protection’. \nThe policy specifically states that: “PA will not consider any new development or redevelopment proposals that create independent residential/non-residential units, including garages for the parking of vehicles.” \nIt goes on to state that any development considered “must not compromise the openness of the enclave” and “should be minimal and in no case exceed 15% of the total soil and planted area”.\n“Three five-storey stand-alone apartment blocks obliterating the environs to a fraction of its original form can under no circumstances be deemed sensitive and appropriate to the character of a baroque garden.\nThe developer, in fact, declined to mention in the application the existence of an ancient arched well beneath the garden,” the objectors insisted. \nThe project, they said, would exacerbate the existent parking problem as only 30 parking spaces were being created for the 30 apartments. \nThe garden contains oaks, olive trees and Aleppo pines that are protected and cannot be felled. \n“The development will effectively reduce the Grade 2 scheduled garden to less than 20% of its original size, making the PA’s 2013 decision to warrant it protection through scheduling meaningless,” the objectors continued.\nRead: Proposed six-storey blocks ‘could destroy Għaxaq skyline\nThe Superintendence for Cultural Heritage also objected to the proposed development, insisting on more information. \nHowever, the Superintendence never objected formally to the proposed project. \nFlimkien Għal Ambjent Aħjar committee member Astrid Vella said the Superintendence had inspected a little house next to Palazzo Giannin three times, making recommendations to scale down the proposed development, but had not commented on the Palazzo Giannin project.", "comment_count": 23, "id": 1047}, {"keywords": "", "author": "Luke Scicluna", "article_body": "The Opposition on Tuesday voted against the appointment of Karl Izzo to the post of non-resident ambassador to Montenegro following a heated sitting of the Public Appointments Committee.\nMr Izzo's nomination was approved by the Committee on the strength of the votes of government MPs.\nMr Izzo is coach of Malta's waterpolo team, who, together with his wife Diane, owns the fashion retail group Dizz.\nAsked to justify his suitability for the role, Mr Izzo referred to his many trips to Montenegro relating to his work in sports. He identified various avenues for collaboration.\nOpposition MP Carmelo Mifsud Bonnici highlighted the candidate's lack of qualifications and experience in the diplomatic arena, arguing that he was not to blame but that whoever had nominated him to the post should have known better.\nPointing out that Montenegro would soon be joining the European Union, he argued that it merited a more seasoned ambassador.\nGovernment MP Robert Abela stated that qualifications were not the only consideration when it came to the appointment of ambassadors. He was echoed by government MP Glenn Bedingfield, who asserted that Malta had had qualified ambassadors who had only lasted a year in the role.\nObjecting to Dr Mifsud Bonnici's reasoning, Mr Bedingfield added that the decision to reject Mr Izzo's nomination had been made immediately.\nHe implied that the views of certain members of the Opposition were being imposed upon their colleagues, and that the Opposition was looking at faces and not at the merits of the role under consideration. Mr Izzo, he said, was already Malta's ambassador in the field of sports.\nTaking offence to Mr Bedingfield's comments, Opposition MP Hermann Schiavone stated that MPs on the Committee had always taken their responsibility seriously, having only voted against a nomination twice.\nHe regretted that Mr Izzo had appeared before the Committee at all, considering his contribution to Maltese interests in the field of sports.", "comment_count": 21, "id": 1048}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A passenger heading to an outbound flight to Tunisia on Monday got more than he bargained for when he lied to customs officials about the amount of cash he was carrying.\nRefugee Hisham Khalleefah Ali Laweer was arraigned on Tuesday after he was arrested at Malta International Airport at around 4.30am on Monday over an alleged breach of cash control regulations and a false declaration made to customs officers.\nA female officer explained in court how officials had been carrying out random currency checks at the departure lounge for non-Schengen passengers, when a sniffer dog signalled a reaction in respect of the suspect.\nWhen conducted to a private office, the man allegedly told officers that he had €9,000 in cash, before producing the sum of €9,715.\nHowever, a rub-down search on the suspect soon yielded a further €2,000 in cash, the court was told.\nAlthough no money was found in the passenger’s luggage, a strip search yielded another €15,000, bringing the total amount of cash to €26,715, well above the maximum statutory limit of €10,000.\nIn light of the man’s own admission, the court, presided over by magistrate Aaron Bugeja, declared the accused guilty, ordered the confiscation of the excess of €16,715 and imposed the statutory 25% fine over the total amount which worked out to €6,679.\nWith respect to the accusation of making a false declaration, the court condemned the accused to a 13-month jail term suspended for two years, bringing the case to the notice of the minister concerned for the purpose of considering whether the accused’s refugee protection ought to be revoked once the man had, upon his own admission, committed a particularly serious crime and had failed to respect the laws of Malta.\nInspector Rennie Stivala prosecuted. Lawyer Simon Micallef Stafrace was legal aid counsel.", "comment_count": 0, "id": 1049}, {"keywords": "", "author": "", "article_body": "A baby has been admitted to Mater Dei Hospital with meningitis, the health authorities said.\nThey said the case was not acquired in the hospital setting and was not related to the previously reported death of a four-year-old child with bacterial meningitis.\nA four-year-old boy died of bacterial meningitis on Sunday displaying symptoms a few days ago.\nThe health authorities said the two cases were caused by two different types of bacteria.\nMeningitis, they said, could be caused by many different types of bacteria. The bacteria responsible in the case of the baby only affected babies in the first three months of their life. In Malta, an average of four cases are reported in newborn babies every year.\nThis type of infection is treatable with antibiotics, and no vaccine is available against this bacteria.\nThe best way to prevent such infections, the authorities said, was by always ensuring good hand hygiene, especially when in contact with newborn babies who were more vulnerable to infections.", "comment_count": 19, "id": 1050}, {"keywords": "", "author": "", "article_body": "A 75-year-old man from St Julian’s was grievously injured on Tuesday when he was hit by a car in Ħamrun.\nThe police said the accident happened in Triq il-Kbira San Ġużepp at 11.30am.\nThe victim was hit by a Ford Escort that was being driven by a 31-year-old man from Paola.\nHe was taken to hospital by ambulance. The police are investigating.", "comment_count": 0, "id": 1051}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Commissioner for Standards in Public Life George Hyzler has said he will be investigating aspects of the Venice Commission report on the rule of law in Malta.Addressing the inaugural meeting of the parliamentary standing committee to which he will report, Dr Hyzler said he would be looking into concerns raised by the Council of Europe’s rule of law experts on MPs’ ability to scrutinise the government while also holding positions on public bodies, among other issues. However, answering a question by Opposition MP Simon Busuttil, he said other aspects of the report were beyond his remit.Dr Hyzler, who was sworn in to the newly-established role last November, said he had already received four complaints against public individuals, three of which were being investigated while the other had been found to be inadmissible. The bulk of Tuesday’s committee meeting was taken up with questions over how much information about complaints dealt with by the commissioner should be made public.In particular, MPs expressed concerns and disagreements over whether the commissioner - who is bound by law to secrecy - should disclose cases where an individual is cleared of a complaint against them after the complaint itself has been made public.The whole purpose of this exercise is to increase transparency and accountability.“I have no control over the publicity that may be given by third parties, and in cases where there has been some publicity, I think it would be unfair for it not to be clarified that the person has been cleared,” Dr Hyzler said.He added that while it was important to protect parliamentarians’ interests, the committee had also to remember its responsibility to the public.“The whole purpose of this exercise is to increase transparency and accountability and we should keep that at the forefront of our thinking,” he said.\nQuestions were also raised over whether the commissioner should report to the committee on complaints which are ruled inadmissible, or where no investigation is considered necessary, a situation not explicitly considered by the law.Labour MP Edward Zammit Lewis argued that this information was necessary from a legal point of view to allow the committee to carry out its supervisory function.\nDr Hyzler himself, meanwhile, said that while figures on these cases would be part of his annual report, the question of how much detail should be given had still to be developed further.", "comment_count": 2, "id": 1052}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who just after midnight on Monday broke into a parked car and stole items belonging to its owner was granted bail pending a pre-sentencing report after admitting to the charges.\nJonathan Attard, 39, from Iklin, just recently employed with a towing company, pleaded for clemency upon his arraignment on Tuesday afternoon after registering an admission to the aggravated theft, voluntary damage to third party property as well as committing such wrongdoing while under a three-year probation order delivered last year.\nIn the light of such charges, the court, presided over by magistrate Aaron Bugeja, explained to the accused that “his hands were tied”.\n“Can’t you show clemency? I know I was wrong. I made a mistake. I’m willing to pay for all damages. You won’t see me here again, I swear!” the man pleaded, running his hands through his hair and wiping away his tears.\n“You ought to have considered this before breaking into that car,” the magistrate told the man standing before him at the dock, observing that the accused had acknowledged his mistake from the very start when releasing his statement to the police.\nThe man had apparently faced problems in the past, had been ‘clean’ for 13 months after undergoing a drug rehabilitation programme and had erred again after succumbing to temptation, the court observed.\nA request for bail pending judgment was upheld by the court, after hearing the prosecution object on the grounds of the man’s criminal record and untrustworthiness.\nWhile ordering a pre-sentencing report, the court granted bail against a personal guarantee of €10,000, an order to sign the bail book on a daily basis and to abide by a curfew.\n“The proof of the pudding is in the eating,” Magistrate Bugeja remarked. “You have to start from now,” as the accused nodded in understanding.\nThe case continues.\nInspector Stacy Attard prosecuted. Lawyer Simon Micallef Stafrace was legal aid counsel.", "comment_count": 0, "id": 1053}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The owners of SmartCity have “suspended” the process of seeking drastic changes to the originally planned ICT city’s master plan, approved by Parliament in 2008, as developers and the Planning Authority have found an innovative way to circumvent height and building space limitations imposed in the original plan, Times of Malta is informed.\nAs the Planning Authority is this week expected to green-light a massive private development – known as The Shoreline – which is in breach of the limitations imposed in the original master plan, sources told Times of Malta that following discussions “a way was found on how to issue the permit without the need for a new master plan and avoid the approval of Parliament”.\nIn an attempt to bypass the master plan’s limitations and expedite the private multi-million residential and commercial project, SmartCity, which sold two massive plots to the developers of The Shoreline a few years ago, agreed to transfer building space (gross floor area) and height limitations from other still unbuilt blocks onto the ones sold on The Shoreline.\nThis was accepted and justified by the Planning Authority as according to its case officer “the changes from the parameters established by the master plan with regards to the transfer of gross floor area and heights are agreed by SmartCity Malta and would not affect the overall development density within SmartCity.”\nTimes of Malta is informed this is the first time that such ‘bartering’ within the same master plan is being used by the Planning Authority to justify a planning permit. \nThis ‘innovative’ way on how changes are being permitted to the SmartCity master plan will result in The Shoreline rising to 11 storeys on the Xgħajra promontory, although the master plan only permits seven storeys. At the same time the mass of building will now reach 55,000 square metres when the original two plots had to have a maximum of under 20,000 square metres of building.\nThe master plan and the deal signed imposed various conditions\nIn its calculations, the Planning Authority also accepted that a whole basement floor, to be part of a commercial complex, will not count in the overall building space to be deducted from the SmartCity building footprint arguing that the whole floor “does not qualify as ground floor area under the definition of the master plan”.\nOnce completed, the massive development will include some 400 luxury flats, the majority one-bedroomed, almost 14,000 square metres of rentable commercial space, mostly shops, and another 1,500 square metres of bars and restaurants. \nVarious underground floors will also be developed into a car park for about 1,000 cars.\nThe development will be clearly visible from many vantage points on the island including the promenade in Sliema.\nA few months after The Shoreline development was announced, SmartCity presented an application to the Planning Authority to change the master plan to fit in the new development. These changes required time and the final approval of Parliament.\nHowever, this master plan application has now been suspended after the ‘new solution’ was found.\nThe private development will be carried by Shoreline Residence Ltd with a South African businessman, Ryan Otto, being the main shareholder in the development. \nThe Maltese shareholding in this business venture include Roderick Psaila, former CEO of AgriBank plc, and his wife, and lawyers Kevin Deguara and Jean Carl Farrugia, owners of legal firm DF Advocates.\nIn 2008, through a parliamentary resolution, some 350,000 square metres of public land in Kalkara was transferred to SmartCity on a temporary emphyteusis basis for 99 years on a cheap ground rent basis in order to be turned into an ICT city.\nHowever, despite that the master plan and the deal signed with the government imposed various conditions, including how the development had to be developed in phases, by when and the obligation to create thousands of ICT-related jobs, none of the targets have been met.\nThe government has a 10% shareholding in SmartCity and is represented on the board of directors by Keith Schembri, the Prime Minister’s chief of staff.\n ", "comment_count": 42, "id": 1054}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated at 7pm with Henley and Partners statement\nCitizenship schemes like the one operated in Malta pose security, money-laundering and corruption risks, a draft report by the European Commission says.\nThe report, expected to be published on Wednesday, delves into what is termed as “investor citizenship schemes” in Malta, Cyprus and Bulgaria.\nIn the draft report, seen by Times of Malta, the Commission said that Malta’s scheme has no actual mechanisms to ensure that passport buyers actually lived on the island or formed a genuine link in other ways.\nThe Commission also noted how non-public bodies such as approved agents or the schemes concessionaire Henley and Partners played a significant role throughout the application process, acting on behalf of applicants and interacting directly with the competent authorities.\nRead: 2,500 golden passports sold in four years\nIn last year’s report about Malta’s citizenship scheme, the local scheme's regulator latched on to a suggestion by one of the scheme’s agents to stop publishing the names of Maltese passport buyers in the Government Gazette.\nThe regulator expressed its agreement with the suggestion that instead of the names being published in the Government Gazette, the list should be subjected to parliamentary scrutiny whereby MPs are given access to the data but would be bound by an oath of secrecy.\nRead: MEPs urge EU Commission to regulate golden visa programmes\nA source familiar with the drawing up of the report said it had been toned down by the EU’s executive.\nIn the version seen by Times of Malta, a passage saying the Commission did not endorse any of the citizenship or residence schemes operated by member states had been deleted.\nMalta had encountered strong resistence from the Commission when the passport sale scheme was first introduced in 2014.\nThe Commission had backed down after the government agreed to ensure that passport buyers established a genuine link with the country through a 12-month residency period prior to the applicant becoming a Maltese citizen.\nThe draft report says that the lack of coordination between member states left room for “shopping around” for the most lenient conditions.\nAn applicant refused citizenship in one member state could make a fresh request in another, the report says.\nIt said member states did not inform each other of rejected applicants, not even of those rejected for posing a security risk.\nIdentity Malta confirmed to the Commission that due diligence definitions and procedures set out in the anti-money laundering directive were followed in the four-tier process of due diligence it used.\nFIAU deputy chairman Anton Bartolo told MEPs last January that the anti-money laundering unit received very few suspicious transaction reports related to applications for passports under the scheme.\nThe draft Commission report says the risks posed by citizenship schemes were accentuated by shortcomings in the transparency and governance of such schemes.\nThe study said only incomplete information was available about citizenship and residence schemes operated by member states.\nA group of experts from EU countries will be set up to further address issues identified with the various schemes, in an “inclusive process”.\nHenley and Partners say criticism is 'misguided'\nIn a reaction, Henley and Partners dismissed the report writers’ concerns, saying that while many were understandable, most were “fundamentally misguided and reflect an inherent lack of understanding of how the investment migration industry actually operate”.\nIt noted what it felt was a lack of coordination between different EU departments when it came to putting together the report and criticised Brussels’ unwillingness to engage with sectoral players such as itself.\nThe report writers, Henley and Partners said, had seemingly not taken into account the “genuine societal advantage” that such IIP schemes created, from spillover foreign direct investment to the “generation of new opportunities across all levels of society”.\nIt said there was a clear need for greater communication between governments, the EU Commission and leading investment migration firms.\n“It is vital that the European Commission takes up the numerous invitations extended by our firm and other legitimate operators, as well as the IMC, to engage in mutually beneficial information sharing and dialogue, as is standard in other industries. It is obvious that it is not possible to produce credible policy solutions and recommendations without the engagement of the industry,” the company said.", "comment_count": 23, "id": 1055}, {"keywords": "", "author": "", "article_body": "Over 300 crimes on people aged over 60 were reported to the police in 2018, up from 259 a year earlier.\nThe majority of the 311 crimes were domestic violence (143), according to information released in reply to a parliamentary question by MP Etienne Grech to Home Affairs Minister Michael Farrugia.\nThere were also 112 assaults, although the minister said that the number of reports did not reflect the number of persons involved, and that in some cases, the elderly person may not have been the prime target of the crime.\nThere were also three armed robberies, six cases of mugging and 47 pick-pocketing.", "comment_count": 1, "id": 1056}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Malta, where up to 35 people could die every year from a bacterial infection, has one of the highest economic burdens of antimicrobial resistance in Europe, a consultation meeting heard.\nMore than €3 million is spent every year on infections caused by Antimicrobial Resistance (AMR), according to the Organisation for Economic Co-operation and Development (OECD). If this trends continues, the cost could more than double over the next decade.\nHowever, if preventive measures were taken, the expenditure could be slashed, according to Michael Borg, chair of the National Antibiotic Committee. \nRead: Fewer Maltese take antibiotics, but use is still high\nResistant bacterial infections develop rapidly, and what was once considered a superbug, MRSA, nowadays “pales” against an increasingly prevalent super-bug known as CRE. \nAt times, the only treatment that works on CRE is Colistin, a last resort antibiotic for life-threatening infections, whose side effects could include damage to the patient’s kidneys.\nCRE is an increasing challenge across Europe, however Malta has one of the highest levels, alongside Italy, Greece, Turkey and Cyprus, Prof. Borg noted.\nHe was speaking at a meeting with stakeholders, including healthcare and veterinary professionals, as part of the consultation process on a national strategy addressing AMR in Malta. Concern about antibiotic use among farm animals, especially over the counter treatment, was prevalent throughout the meeting.\nRead: Two out of every five who take antibiotics do not need them\nAddressing the same consultation session, Superintendent of Public Health Charmaine Gauci said that resistance to antibiotics was part of the natural process, however, misuse and overuse accelerated the challenge.\nIf preventative measures were taken, the expenditure could be slashed\nAccording to Eurobarometer data, 14% of the Maltese use antibiotics for sore throats and a further 12% to ‘treat’ the flu. In such viral infections, antibiotics are always ineffective, risking increasing resistance to particular bacteria in the patient himself, or those around him, which could subsequently lead to death.\nSadly, 33,000 people die every year in the EU and EEA area because of an infection that cannot be treated, European Centre for Disease and Prevention Control data shows.\nRead: Despite resistance, the future looks good for antibiotics \nMartin Seychell from the European Commission, told stakeholders that the EU had a “one health approach to AMR”, as this was not just a human health issue, but also an animal and environmental one. \nThe EU was investing in research on timely diagnosis, new classes of antibiotics, the use of vaccines as preventive treatment and infection prevention through other means.\nReferring to Malta, he said the island was paying a high price for resistance, with the OECD figures on mortality and the annual cost of AMR placing Malta at the top of the list, following Italy, Greece, Portugal, US, France, Cyprus and Slovakia.\nWhy is there high use of antibiotics in the community and at hospitals?\nMalta has the second highest European consumption of antibiotics in the community, following Italy, with 42% of the population taking at least one course of antibiotics in a year. \nHowever, almost half of those taking antibiotics do so to ‘treat’ the flu, colds and sore throats. \nData shows that 96% of antibiotics are prescribed by medical doctors, but Prof. Borg believes that Malta has some of the best medical doctors in Europe. One of the main drivers of excessive prescription of antibiotics, he said, was a ‘better safe than sorry’ culture, also known as uncertainty avoidance. \nStill, with 92% of the Maltese population being aware that unnecessary use of antibiotics will make them ineffective, culture could be changed, he added.\nDraft proposals of the national strategy action plan that will kick off this year\n■ Enhance knowledge and awareness on AMR among healthcare and veterinary professionals by ensuring availability of continuing professional education activities on AMR and prudent use of antibiotics, not sponsored by the industry.\n■ Strengthen surveillance system of antibiotic resistance especially in primary care and veterinary practice.\n■ Introduce electronic systems that include antimicrobial prescribing and link them to clinical indication and consumption data.\n■ Develop a system for safe disposal of antibiotics in the community.\n■ Fast track the procurement of new antibiotics effective against currently resistant organisms.", "comment_count": 4, "id": 1057}, {"keywords": "", "author": "", "article_body": "Two specialised panels are being appointed to the Administrative Review Tribunal to hear cases involving gaming and digital innovation, Justice Minister Owen Bonnici said on Tuesday. \nThe members on the panels will be specialised personnel, something which would help the tribunal take more informed and precise decisions, the minister said.\nThe appointment of the additional panels would also enable the tribunal to take decisions in a shorter time, benefiting the parties and reducing the caseload. \nDr Bonnici said the government 'remained committed to carry out more reforms to strengthen the rule of law and human rights, including the right to justice within a reasonable time. ", "comment_count": 0, "id": 1058}, {"keywords": "", "author": "", "article_body": "Blogger Manuel Delia was Adrian Delia's ghostwriter during his campaign for the Nationalist Party leadership, the head of the PN's media, Pierre Portelli, told a court on Tuesday.\nMr Portelli was testifying in proceedings instituted by Manuel Delia against Media.Link editor Robert Cremona.\nThe case was instituted after Media.Link refused to publish a statement issued by Mr Delia in reply to a story it had carried. \nMr Portelli said that he had been informed of the Right of Reply sent by Manuel Delia following a Net News story in which they said that he had mistakenly reported that the PN parliamentary group voted in favour of a law allowing cannabis cultivation in Malta.\nIn a subsequent blog post, Delia argued that he had only reported that Adrian Delia cut short debate on the matter in the parliamentary group and failed to declare the interest of his wife’s family and a close aide of his in the sector.\nMr Portelli explained that he had instructed his staff not to publish the Right of Reply.\n“I issued the instruction that this wasn’t to be published as it was a Right of Reply to a Right of Reply. I am also aware of what Manuel Delia was writing about Adrian Delia with regards to the legalisation of cannabis because of a family connection,\" he said.\n“Besides this I’ve known Manuel Delia for a long time. We were at university together. He is a very good writer and I had invited him to write a number of articles. I had offered him a job as an editor but he wanted twice as much money as I was offering.\n“In summer 2017 during the PN leadership race, Adrian Delia had thrown his hat into the ring and I was asked to help,” said Mr Portelli.\n\"It was agreed that Manuel Delia would be a ghost writer for Adrian Delia’s articles from August to September. In September after Adrian won, Manuel wrote to me asking for payment.\"\nMr Portelli said he became alarmed when Mr Delia mentioned that he had “other clients.” He had no idea or control over who these clients were, he said. This led to a potential conflict of interest which he as editor would have no idea about, he said.\n“From then on, I had to take everything he wrote as having been written for a particular client,” Mr Portelli said.\n“In view of his statement that he had other clients, and therefore that it could not be known whether he was writing for them, I felt it would not be right to allow him a right of reply from a right of reply,” Portelli said.\nThe case continues on February 20.", "comment_count": 0, "id": 1059}, {"keywords": "", "author": "", "article_body": "A birthday cake was the order of the day for Tuesday's Cabinet meeting as Prime Minister Joseph Muscat turned 45.\nHe was pictured celebrating with his Cabinet colleagues at Auberge de Castille. \nDeputy Prime Minister Chris Fearne, who uploaded the photo on Twitter, said the Cabinet was united behind Dr Muscat.\nMany wished the prime minister a happy birthday on social media. \nDr Muscat was elected Labour Party leader in 2008, before winning the general elections of 2013 and 2017. ", "comment_count": 35, "id": 1060}, {"keywords": "", "author": "Claire Caruana", "article_body": "Veteran actor John Suda has had his teacher’s warrant revoked, a notice on Tuesday’s Government Gazette has revealed, following his conviction of violent indecent assault.\nIn October, the veteran actor was found guilty of an assault on a 22-year-old aspiring actress and given a suspended sentence after it was proved that he had used his teaching techniques to force the victim to submit to his will.\nIn a notice in the gazette, the Ministry for Education said Mr Suda was “no longer qualified to retain a teacher’s warrant”.\n“Mr Suda’s teacher’s permanent warrant number 2719 is being revoked with immediate effect and he is therefore no longer in possession of the teacher’s warrant,” the notice reads.\nThe case involving the 66-year-old actor goes back July 2015 when the actor was holding auditions at a massage parlour in Fgura, which he used as a studio.\nThe woman had auditioned for a role in a soap opera that was to be screened on local television and had subsequently been contacted by Mr Suda, as scriptwriter, through a Facebook message inviting her to a one-to-one coaching session to improve her diction and stage confidence.\nBlindfolded student, asked her to strip down to her underwear\nWhen she turned up for the audition, the woman was led to a room and Mr Suda then proceeded to lock the door, pocketing the key, before asking her to go over the script.\nSoon after, Mr Suda blindfolded the student and asked her to strip down to her underwear and walk around the room, reciting her lines.\nFile photo. John Suda (left) seen leaving the law courts.\nWhen the woman expressed discomfort and reluctance, Mr Suda insisted that the exercise was intended to help her get over any inhibitions. This, the actor had insisted, was an essential step towards becoming an actress.\nAs the session progressed, Mr Suda began to fondle her, kissing her on her face and neck and pulling her towards him, placing his private parts inside her mouth, in spite of the woman’s continued reluctance.\nInsisting that she was “stiff” and needed to forget her inhibitions, the actor went on until the woman, unable to bear it any longer, burst into tears. It was then that Mr Suda had called it a day, unlocking the door and telling her that the session was over.\nHanding down the judgement in October last year, Magistrate Audrey Demicoli had found Mr Suda guilty of violent indecent assault and had handed him a 12-month jail sentence suspended for two years. He was also placed under two-year protection order.", "comment_count": 0, "id": 1061}, {"keywords": "", "author": "", "article_body": "The cruise industry took a bit of knock last year, with only 310 cruise liner calls compared to 342 the previous year.\nThe number was also lower than the 316 calls in 2016.\nThe National Statistics Office said on Tuesday that the ships carried more passengers but this was still not enough to match the 2017 arrivals, with 632,739 coming in 2018, down 37,396 over the previous year.\nThe EU remains the highest performing market with two-thirds of the arrivals, with the British (105,978), German (96,719) and Italian (88,579) being the largest groups.\nThe age of those going on cruises has shifted downwards over the years but the 60-79 category remains the largest, with 40 per cent of all the arrivals, followed closely by the 40-59 category with 31.6 per cent.\nGozo managed to attract 12,950 passengers last year, while 35,229 stayed overnight on the islands.", "comment_count": 11, "id": 1062}, {"keywords": "", "author": "", "article_body": "The German operators of an NGO rescue ship have lashed out at European governments for closing their harbours and obstructing its rescue missions, as it finally found a port to dock.\n\"Not wanting to help is inhumane. However, making it impossible for others to help reaches a criminal level that I thought was impossible in Europe,” ship captain Klaus Merkle said.\nThe MV Professor Albrecht Penck, operated by the Sea-Eye organisation was allowed to shelter from a storm in Maltese waters after being blocked elsewhere, but it was refused permission for berthing and a crew change.\nSeventeen migrants it had rescued off Libya had been allowed to disembark on a Maltese patrol boat along with other migrants rescued by another vessel, the Sea Watch III. The disembarkation only took place once seven EU countries along with Malta, agreed to take the migrants and other migrants brought to Malta earlier.\nWatch: Migrants finally touch land, as Muscat offers a blunt explanation for stand-off\nThe Professor Albrecht Penck has finally docked at Palma de Mallorca. \nSea Eye said its efforts to find a harbour and the long trip to Palma meant it could not be on station to rescue people, and it had incurred considerable costs.\n\"After a two-week chicanery by the Maltese government and the takeover of 17 rescued people on January 9, the crew may finally return to their families,\" Sea Eye said.  \n“While Malta blocked our ship, and Prime Minister Joseph Muscat kept us as political hostages to blackmail, we had to search for a new port for our ship for 10 days. More than 200 people once again drowned during their flight across the Mediterranean,”  Gorden Isler, spokesman for Sea-Eye.\nThe organisation said it decided to look for an alternative port in the western Mediterranean after the Greek Port Authority of Patras also turned down its requests.The intermittent news of hundreds of drowned people leaves me speechless. Europe not only looks away, it has completely turned away\nNear Tunisia, the ship sought shelter from bad weather for three days and then headed for Spain.\n“Our options were very limited due to our fuel stock and the weather,\" said Captain Klaus Merkle. “While we had to drive circles at sea, waiting for European politicians to take responsibility, we learned of several shipwrecks and many deaths.\"\nThe captain expressed his gratitude to the Spanish authorities but said he still suffers 'unspeakable pain' for the fact that the ship was prevented from doing its work for two weeks.\n\"The intermittent news of hundreds of drowned people leaves me speechless. Europe not only looks away, it has completely turned away. We will not allow that to happen,\" said Jan Ribbeck, head of mission.\nSea Eye said the narrative that relief organisations were luring people to the sea  had become a political mantra in Italy. It ignored the fact that Europe itself was the so-called \"pull factor\" and one tries instead to exclude the political discussion about European 'push factors'.\" In a time of simple answers, this cruel way takes the lives of thousands of people.\"\nThe NGO said the Professor Albrecht Penck will be prepared for its next mission during the coming three weeks. The organisation intends to relocate the home port from Stralsund to Hamburg and give the ship a new name.\nIt said, however, that the blockade had inflicted serious financial damage.\n“The mission costs were almost twice as high because of political obstacles. We want to continue, and we prepare for future difficulties. Over the next two weeks we will have to talk to our closest supporters and we will have to gain new ones. We cannot give up now,” the organisation said.", "comment_count": 0, "id": 1063}, {"keywords": "", "author": "", "article_body": "A man who had his driving licence suspended after accumulating 12 points, has argued before the Administrative Review Tribunal that his licence should be returned because it was indispensable for the performance of his duties as a court expert.  \nRobert Cardona said in his application before the tribunal that his licence was revoked on July 18, 2018, but he needed his licence because he was a court expert and scientist in the food sector and was on call round the clock. The use of a car was therefore indispensable for the needs of the court and the catering sector.\nHe asked the tribunal to revoke Transport Malta's decision to suspend his licence and for his licence to be returned under whatever terms that the tribunal saw fit. \nIn its reply, Transport Malta said the tribunal was not the forum appointed by law to decide such cases. Furthermore, it had not actually taken any decision since, in terms of the law, notice of revocation of licence was issued automatically once 12 points were accumulated. \nTransport Malta also observed that Mr Cardona in his appeal was not actually contesting anything but was insisting that his driving licence was essential for his work.\nIn its considerations, the tribunal confirmed that in terms of the law, a driving licence was automatically suspended whenever 12 points were accumulated within 12 months. Therefore, Transport Malta took no decision and had no discretion in the matter.\nThe tribunal also noted that the traffic contraventions had not been contested before any tribunal or court.\nAlthough decisions by Transport Malta could be appealed, this case was not about any decisions which could be appealed.\nThe tribunal noted that the appeal was also based on clause 30 (2) of the Criminal Code which said that any person who had a warrant, licence, permit or authority suspended may apply to a court to have his licence restored if the court thought it expedient, having regard to his character, conduct subsequent to the conviction, the nature of the offence and to any other circumstances of the case.\nThe tribunal, however, said it was also not the right forum to decide a plea under this clause. ", "comment_count": 0, "id": 1064}, {"keywords": "", "author": "Ivan Martin", "article_body": "Works on the first 31 residential roads being overhauled as part of the government’s €700 million investment began this week, Transport Minister Ian Borg announced on Tuesday.\nDuring a visit to works being carried out on a dirt road in residential Fgura which had never been laid with asphalt, Dr Borg said a total of 120 roads would be revamped this year.\nThis will see an investment of €53.5 million covering 25 kilometers of roads across the island.\nThe total allocation for 2019 is €100 million and Dr Borg said a second call for works would be announced later this year.\nRead: The seven-year path to fix all of Malta's roads\nWork on the 31 roads will involve the installation of 32km of water distribution pipelines, electricity cables and communication ducts.\nThe extensive project will be undertaken by three consortia chosen by Infrastructure Malta following a call for tenders.\nDr Borg said roads such as the topsy-turvy one in Fgura which had never seen a drop of asphalt were being given priority as “for the people who live on roads like these, they are the most important ones in Malta”.\nThe government has committed itself to resurface all of these roads within three years, at a minimum rate of 60 roads per year.\nA specific management agency, Infrastructure Malta, has been set up to oversee the road building and upgrading targets.\nThis, Dr Borg said, would mean that local councils will no longer be directly responsible for asphalting roads.\nWhile no longer being tasked with surfacing roads, the government’s plan will see local councils entering into public-private partnerships with companies in order to ensure the continued maintenance of urban roads.", "comment_count": 26, "id": 1065}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two individuals have defended comments made on Facebook about Labour MP Rosianne Cutajar, insisting that they were fair comment and not defamatory.\nFacebook posts cited by Ms Cutajar in her two libel suits allegedly liken her to a “prostitute” and “call girl.”\nWatch: “You have no right to call me a whore” – Labour MP\nHowever, in their replies filed on Tuesday in the Magistrates’ Courts, Godfrey Leone Ganado and Rachel Antoinette Williams rebutted the allegations, stating that the posts were not defamatory and at most amounted to ‘fair comment’ when taken “in the context of the applicant’s behaviour with particular reference to previous publications about her and/or by her and /or with her consent.”\nOne of the suits revolved around a post which read “However, HAMALLI, prostitutes and call girls, have a right to be represented in Parliament,” a statement in respect of which Mr Leone Ganado pronounced himself “perplexed” as to how this could be considered as defamatory.\nThe emphasis lay upon the term ‘HAMALLI’ which could be considered as negative but certainly not defamatory, the respondent argued.\nIn the second reply, filed jointly by Mr Leone Ganado and Ms Williams, it was argued that Ms Williams, upon whose Facebook wall the allegedly defamatory comments had been posted, was non-suited since she had posted no comments, defamatory or otherwise, and had not signalled her agreement or otherwise.\nMoreover, the term ‘prostitute’, while bearing negative connotations was certainly not defamatory and “did not in any way attribute the status of prostitute to the applicant,” the respondents argued, pointing out that the comment had read “In Maltese we say PROSTITUTE.”(Bil-Malti nghidu QAHBA)\nHad the intention been to liken the applicant to a prostitute, the comment would have read “In Maltese we call her PROSTITUTE.” (Bil-Malti NGHIDULA qahba)\nAs for the applicant’s request to have the posts deleted, the respondents reserved their position in the light of the constitutionality of such claim, besides the “impossibility thereof within the existing technological environment”.\nLawyer Andrew Borg Cardona signed the replies.", "comment_count": 0, "id": 1066}, {"keywords": "", "author": "", "article_body": "Another man has been hospitalised with serious injuries after falling off a building, the latest in a series of tragedies and near-tragedies over the past weeks.\nPolice said that the 25-year-old, from Attard, fell a height of one storey while he was doing some work at Triq l-Imdina, in Żebbuġ.\nThe accident occurred at 6.30am on a company's premises, the police said.\nInvestigations are still underway.", "comment_count": 0, "id": 1067}, {"keywords": "", "author": "", "article_body": "A staggering 4,025 properties in Valletta are owned by the government, being used for a mixture of residential, commercial and retail purposes.\nSome of the properties are leased but an unspecified number are on encroachment.\nThe capital city had a population of 5,730 in 2016, the latest year for which figures were available, down from over 7,000 in 2003.\nResponding to a parliamentary question by MP Karol Aquilina, Infrastructure Minister Ian Borg presented information gathered by the Lands Authority which gave a breakdown by street.\nThe top five streets in terms of government units are:\n• Strait Street – 197• Republic Street – 194• Merchants Street – 173• St Nicholas Street – 164• St Ursula Street – 146", "comment_count": 4, "id": 1068}, {"keywords": "", "author": "", "article_body": "Electrical power was knocked out in part of Birkirkara on Tuesday morning after a fire at a sub-station in the area known as Ta' Paris.\nThe blaze was reported shortly before 9.30am and fire-engines and an ambulance were quickly on the scene.\nNo one was injured.\n ", "comment_count": 0, "id": 1069}, {"keywords": "", "author": "", "article_body": "Out of the 798 people reported missing to the police last year, there are still 39 who were never found, according to information given in response to a parliamentary question.\nHowever, the information given does not indicate whether the same person may have been reported missing more than once.\nThe information requested by MP Karol Aquilina revealed that between 2013 and 2018, 4,219 people were reported missing but that 4,030 were found, leaving 189 unaccounted for.\nThe majority of those who go missing – 2,367 – are minors under the age of 18, but the data provided by Home Affairs Minister Michael Farrugia did not analyse those still missing by age.", "comment_count": 1, "id": 1070}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "There was a point some years ago when social media seemed to be overwhelmed by howls of protest about trees getting cut down. Adrian Gatt read the comments with equal measures of outrage and frustration.\n\nOne particular source of irritation was the Save the Trees Facebook group. \nThe engineer was hardly an expert on trees but he felt it would be so much more effective to do something to replace those that were being cut down, rather than to lament what had already been done.\n“Imagine if each of those 3,000 members planted 10 trees each!” he told himself, before pausing to think: “And why not!”\nThat is how Grow 10 Trees was born: with a passionate vision and not much else. He laughingly admits that his initial attempts were naive, with not enough knowledge about which species to go for and which to avoid at all costs.\nSince May 2017, he and his teenage son Nathan have turned his idea into a reality, which is spreading slowly but surely. The G10T site has ratcheted up thousands of members, with around 100 who are intensely involved.\nHow does it work? Did you know that you need a permit from the Environment and Resources Authority to collect seeds from the wild? Well, as the idea took root – pun intended – Mr Gatt set up a system: he would collect the seeds from dozens of species and offer them online; people would offer to sprout them and once they were well established – after a year or so – he would find somewhere to plant them.\n\nThe first two steps were, believe it or not, the easiest. The website (www.g10t.eu) offers information on the species, instructions about the way to sow and the best time to do so, including videos.\nAnd people like Moira Heath were only too happy to help out.\n“I won’t take any of the credit! Everything was done by my four-year-old daughter, who was fascinated by the whole thing. We planted holm oak seeds in old milk cartons, in a mixture of soil and compost, and although we lost quite a few over summer, we managed to get these lovely ones,” she said, as she handed them over to Mr Gatt. \n“If you have a south-facing space, then you can grow them. Even a balcony will do fine, although it helps to have a tree to provide shade for them in summer – which is why I suggest putting the cartons in a plastic crate that you can easily move from one place to another,” Mr Gatt suggested, admitting that he had lost hundreds himself until he learned through experience what worked best.\n“Best time to plant is from a month after the first rains until April, as it gives the roots a chance to establish themselves before the summer heat. If they can make it till summer, as long as you irrigate them, they should survive.”\nSo there he was, with his network of around 100 active growers and trees sprouting all over the island – including 1,500 in his own garden. \nWhat to do with them? He reached out to various councils and the government but got a tepid response at first. He managed to rope in Għargħur mayor Ġiljan Aquilina and dozens of trees were planted on abandoned land at the ‘Top of the World’, replacing invasive species that had been planted there. \nŻurrieq mayor Ignatius Farrugia also got caught up by the enthusiasm of one of the group, Simon Stafrace, and last week, classes of chattering primary school-children were roped in to plant the saplings in two locations.\nIt is so satisfying to be doing something instead of just moaning\n“There is only one thing I insist on: that once they are planted, the council irrigates them, as otherwise it is all for nothing,” Mr Gatt said.\nSince the first seedlings were planted in November 2017, Mr Gatt has planted 512 trees – 250 of them from the G10T ‘nursery’, with the help of other NGOs, some of which were also able to inject funds into the project.\nWith thousands of trees now reaching up to the sky in people’s homes, he is more enthusiastic than ever.\n“It is so satisfying to be doing some- thing instead of just moaning,” he says, as he hands a sapling to one of his core helpers, Antoine Sciberras, who plods over in his soil-encrusted Wellington boots to take it over to a group of the schoolchildren.\n“And we are making a difference.”\nIt may indeed be just a small difference but, like the trees themselves, this is one initiative that is certain to grow.\nMoira Heath handing a boxful of holm oak saplings to Mr Gatt.\nSchoolchildren planting a sapling.", "comment_count": 41, "id": 1071}, {"keywords": "", "author": "", "article_body": "Investigations are under way after two parked cars in separate locations were destroyed by fire on Monday-Tuesday night.\nThe first blaze, at about 10.30pm, destroyed an Opel Astra parked in Triq Lapsi, Siġġiewi.\nThe second incident occurred in Triq in-Naħal, Qormi, where a Toyota Vitz was extensively damaged.\nNo one was injured, the police said. ", "comment_count": 0, "id": 1072}, {"keywords": "", "author": "", "article_body": "A 12-year old girl who was reported missing on Monday has returned home, the police confirmed on Tuesday morning.\nMia O’Connell was last seen close to St Catherine’s Secondary School in Pembroke at 7.50am. on Monday  \nThe same girl was reported missing in December, mobilising a nationwide search. She was found safe in Gozo a day later after being spotted on the ferry.", "comment_count": 0, "id": 1073}, {"keywords": "", "author": "", "article_body": "A Danish woman had her mobile phone stolen at knifepoint in Gżira late on Monday, the police said.\nThe incident happened at about 11.30pm in Victory Street as the woman, 19, was smoking a cigarette outside her apartment. \nThe man initially demanded money and when the woman said she was not carrying any, the man demanded her mobile phone and ran off with it.\nNo one was hurt. ", "comment_count": 0, "id": 1074}, {"keywords": "", "author": "Keith Micallef", "article_body": "A proposed dual breakwater system to shelter Marsalforn from rough seas has been received with mixed feelings amid concerns that the project would turn the popular bathing spot into a port or perhaps a yacht marina. \nUnveiled by the Gozo Ministry last Saturday in a news conference to which media was not invited, the fresh plans supersede those presented in 2011, which had never materialised. Under the new proposal, the entire mouth of the bay will be enclosed by two breakwaters with a small gap in between, which will become the only access to the outer sea. \nThe design incorporates the reconstruction of the Santa Maria Point breakwater on the Qbajjar side over a span of 200 metres, and the construction of another arm, jutting out 170 metres on the Għar Qawqla side.\nHowever, in a statement the ministry pointed out that prior to submitting a development application, further scientific and environmental studies were being commissioned. The project forms part of a master plan for the embellishment of the seafront.\nWhile the announcement – made just days after the seas had once again caused havoc along the seafront – was welcomed, a series of artist’s impressions of the project published on Facebook dampened the enthusiasm.\nThe debate revolved around the decision to have two breakwaters rather than one, amid fears that this would hinder the circulation of seawater and render the bay unfit for swimming. Moreover, the design fuelled speculation that plans could be in the pipeline to convert part of the bay to a yacht marina.\nThe water already stinks every time the bay is full of boats\n“If it is going to remain a swimming area, pleasure boats have no place in what will become an almost enclosed and protected bay. The water already stinks every time the bay is full of boats, which leave all sorts of residue,” one aggrieved Marsalforn resident remarked. \nOn the other hand, those who were behind the project drew comparisons with the inland sea at Dwejra, saying it was never filthy despite its natural rock surroundings.  \nContacted by the Times of Malta, Gozo Minister Justyne Caruana said that such issues of sea current and water circulation would be addressed by two studies being commissioned through a public call. Asked if she would exclude that part of the bay was being earmarked for a yacht marina, the minister insisted that the project was about a breakwater. \nTimes of Malta also asked about the reason why the media was not invited for the “press event”, even though the ministry itself had made mention of it in a reply given over the same issue, last week. However, the ministry distanced itself from the decision saying it followed “standard procedure” while referring us to the Department of Information which handles such invites.  \nIn his reply, DOI director Paul Azzopardi confirmed that the media had not been invited on the grounds of the “low response” for Gozo press conferences. Moreover, he justified the decision saying that the media had been furnished with a press release, photos and footage of the event.   \nNonetheless, this newspaper pointed out that it failed to understand the use of holding a “press event” only for the media not to be allowed to ask questions. Decisions on the participation or not in such events should be the sole prerogative of the editor, the Times of Malta insisted.", "comment_count": 19, "id": 1075}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday.\nTimes of Malta reports that resistance to antibiotics is costing Malta €3 million a year. It also reports that fuel will not be sold from petrol stations after 6pm as station owners launch industrial action to press for a raise. \nThe Malta Independent quotes the Malta Tourism Association saying the Gozo tunnel should be for a mass underground system, not for cars. The newspaper also follows up the saga sparked when the Imam called for halal slaughter of animals. \nIn-Nazzjon reports how an inmate suffered a drug overdose soon after being taken to the prisons.\nL-orizzont says broad consultation on a new Children's Act has been concluded. It also reports how Malta's financial surplus is the biggest in the EU. ", "comment_count": 0, "id": 1076}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Opposition MP Robert Cutajar said in Parliament on Monday he was voicing the concern of many Maltese that the government would be paving a path for abortion to make Malta more \"modern\".  Asserting his pro-life beliefs, he was joined by fellow Opposition MP Claudio Grech in arguing that the rights of the unborn needed to be defended. Dr Grech also called for more support to be provided to those experiencing unexpected pregnancies and raising children alone, and insisted on the need for a thorough examination of which factors could lead Maltese women to seek abortions.These comments were made in the context of a technical amendment to various social laws which followed the establishment of the Social Care Standards Authority last year in place of the Social Services Directorate.\nSocial solidarity minister Michael Falzon spoke of the need for consensus to govern social matters, and he was thanked by the Opposition for making the Bill available to them in advance.The interests of children needed to reign supreme, Dr Grech said, and the Opposition would work shoulder to shoulder with the Government in order to achieve this goal.There were also calls for a parliamentary debate into an investigation which had been carried out by Judge Michael Mallia into the operations of the Children and Young Persons Advisory Board.", "comment_count": 63, "id": 1077}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated Tuesday at 8.50pm with Enemed's reply to GRTU statement\nFuel will not be available after petrol stations close at 6pm, the GRTU said on Monday night.In a statement following a lengthy meeting with station owners, the chamber said the action would start on Tuesday. Fuel will only be sold while petrol stations are open. \nThe GRTU warned that the measures could escalate over the coming days.\nStation owners will meanwhile be withholding licensing payments due to the resources authority.\nFuel station owners met on Monday evening to discuss the way forward after the government rejected their proposal for a higher profit margin.\nThe government last week said it had made an alternative proposal to fuel station owners. No details of the proposals, however, were released by either side.\nMonday’s meeting came after the ultimatum for an agreement, given to the government by the Chamber of Small and Medium Enterprises (GRTU) expired with no deal reached.CEO Abigail Mamo said the situation had become untenable.\nOn Sunday she had said that all options were being considered when it came to possible directives and to what extent this would disrupt normal service at the pumps.\nOwners of fuel stations have been at loggerheads with the government over a plan that would see all stations have to upgrade their facilities by next year to be in line with new requirements set by the Environment and Resources Authority and the Regulator for Energy and Water Services.\nDiscussions between the chamber that represents the petrol station owners and the government have been dragging on for some four years, and operators are expected to refurbish fuel stations by next year – an expense that could reach €500,000 each.\nThe owners are arguing that the government could still meet their demands without having to increase the price of petrol and diesel.\nThe government said that in 2011, the Malta Resources Authority had granted the fuel station owners an increase in profit.\nHowever, the government insists that the latest demands would result in higher prices at the pumps for consumers.\nThe owners hit back saying the 2011 increase was eaten up by other costs. The GRTU said it had submitted proposals on how to accommodate the request without burdening consumers.\nPN say government could have been in a better position to help\nThe Nationalist Party said in a statement on Tuesday evening that the government could have helped fuel station owners without raising prices for consumers – if only it had not lost €14 million through its agreement to buy oil from Azerbaijan, €40 million on the purchase of LNG gas which went into someone’s pocket, and €200 million every two years on the Electrogas contract.\nOwners threatened by Enemed - GRTU\nMany petrol station owners who joined Enemed’s franchising said they were contacted by Enemed officials who wanted to know if they were taking part in the industrial action and threatened they would have to face repercussions if they said, the GRTU said in a statement on Tuesday.\nThe association condemned the behaviour of this “supposedly independent” company which, it was, was being used for ulterior motives.\nIt confirmed that Enemed’s contract could not stop any petrol pump owners from safeguarding their interests and implement the decisions needed for their business.\nThe GRTU said it would be taking all the necessary action to protect its members.\nEnemed's reply\nIn another statement, Enemed categorically denied the allegations and deplored what it termed as GRTU’s attempt at falsely attempting such and the fact that it was being used for ulterior motives.\nIt said that, as a fact, it invested in a large number of pumps which became its franchises for clients to have the best service including 24 hour daily access to fuel from safe and efficient equipment.\nIt wanted to assure itself that the commercial relationship it had with fuel pumps would not be negatively affected and to ensure that consumers had adequate and guaranteed access to fuel.\nEnemed said it did not see why consumers should be penalised in a case in which it was not involved.", "comment_count": 169, "id": 1078}, {"keywords": "", "author": "Luke Scicluna", "article_body": "The legacy of Valletta 2018 would be the rebirth of Malta’s capital city, culture minister Owen Bonnici said in Parliament on Monday, dismissing claims the project had fallen flat. \nWinding up amendments to the Cultural Heritage Act, Dr Bonnici pointed to MUŻA, the new University Campus Theatre (formerly known as MITP), and the refurbished Tritons fountain as evidence of the real impact that the programme had had on Valletta.\nHe also waved away concerns over the the use of direct orders by various cultural agencies, arguing that it was impossible to do otherwise when a specific performer needed to be engaged.\nThe minister was responding after Opposition MP Karl Gouder claimed that after years spent agonizing over how to use Valletta 2018 to instill a greater appreciation for culture amongst the Maltese, this aim had not been reached, and the events of the past year would be forgotten as they had not left anything tangible behind.Meanwhile, addressing the content of the Cultural Heritage Act amendments, Dr Bonnici insisted the amendments would not, as Opposition MPs had claimed, reduce the power available to the cultural heritage watchdog, but would reduce its duties in order to allow it to focus its resources in a better way.Dr Bonnici argued that the Superintendence for Cultural Heritage had never been more involved. Whereas the Planning Authority had formerly decided which cases to refer to the Superintendent for an opinion, a decision taken by the government years prior had started the referral of all planning applications to his office.\nThe lack of site monitors was a challenge, but allowing the PA to refer cases would truly involve weakening the Superintendence. It was furthermore untrue that the PA could override the decisions taken by the Superintendence, which had extensive powers to protect Maltese heritage.\nHe said 13 graduates had been engaged by the Superintendence over a one-year period, more than had been working there in all prior to 2013. \nThe minister pledged to take on board a suggestion to reduce the required hours of professional development stipulated by the new amendments in order for the conservation warrant to be retained, should Parliament give its assent.", "comment_count": 5, "id": 1079}, {"keywords": "", "author": "", "article_body": "Minors accounted for nearly half of all people who went missing last year, according to official figures.Data tabled in Parliament by family minister Michael Farrugia in answer to a question by PN MP Karol Aquilina shows that 798 people were reported missing in 2018, of whom 382 were minors and just 58 were over 60.The share of minors was even higher the previous year, when 655 out of 932 missing people were under 18.In 2018, women made up around two-thirds of those reported missing, continuing a trend visible in figures from 2017 and 2016, when women outnumbered men twice and three times over respectively.Of all those reported missing last year, the vast majority were found, while 39 remain missing. This is more than twice the number that went unfound in 2017, and the highest since 2013.", "comment_count": 13, "id": 1080}, {"keywords": "", "author": "", "article_body": "The Institute of Maltese Journalists (IĠM) has condemned recent cyber attacks on The Shift News, which the website says followed reports on corruption in the government deal on three of Malta’s public hospitals.\nThe Shift News reported that it had experienced two Distributed Denial of Service (DDoS) attacks in the last week, “both of which were aimed at taking the site down and denying public access to news reports on the site.”\nThe website reported last week that millions had changed hands behind closed doors when Vitals Global Healthcare transferred its concession to Steward Healthcare after less than two years in December 2017. \nRead: Finance minister downplays VGH deal concerns\nThe IĠM's condemnation follows similar statements by the International Federation of Journalists (IFJ) and the European Federation of Journalists (EFJ).\nSuch acts aimed at stifling freedom of speech were unacceptable, the IĠM said, calling on the relevant authorities to investigate the matter and publish a public report once such an investigation is concluded.\nIt said it supported the initiative taken by IFJ and EFJ in reporting the attack to the Council of Europe’s platform to promote the protection of journalism and the safety of journalists.\n ", "comment_count": 29, "id": 1081}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Libyan nationals, eager to testify about how they allegedly paid a government official for medical visas which should have been issued for free, are currently facing great pressure not to do so.\nThis was alleged on Monday morning by Ivan Grech Mintoff who, once again, took the witness stand under cross-examination in libel proceedings instituted by OPM official Neville Gafà against David Lindsay, as editor of the Malta Independent on Sunday.\n“After the last sitting, just four days later, Mr Gafà was back in Libya offering these people money for them not to testify,” Mr Grech Mintoff explained to the court, before stepping off the witness stand. “There’s great pressure on them at present.”\nWhilst taking note of this additional piece of information, Magistrate Francesco Depasquale declared that a Skype call with the prospective witnesses would be scheduled to take place during the next sitting, adding that unless the call was effected on that date, the court would move on.\nEarlier on in his testimony, Mr Grech Mintoff explained how the Libyans, named under the ‘list of persons willing to testify’ presented in the records of the case, had contacted him about the alleged illicit sale of Schengen visas at the Maltese Consulate in Tripoli as well as the issuance of Humanitarian Medical Visas by OPM official Neville Gafà.They want to testify directly. They do not trust the police in Malta. They wish to give their evidence directly to the court.\n“To make it clear, those persons contacted me. It was not the other way round,” Mr Grech Mintoff said, explaining how he had spoken to the Libyan nationals over the phone, even recording the call “with their permission.”\nRead: Brussels asked to probe 'visa racket'\nThe Libyans had released formal statements through their legal system, putting their story in affidavit form, “ID and mobile numbers included,” the witness explained, adding that he had obtained an English translation of those statements.\n“There were 13 in all,” Mr Grech Mintoff explained, going on to state that out of those 13, three had been chosen to speak on behalf of the group.\n“So you are the voice of someone out there. The court would like to hear that voice,” Magistrate Depasquale interrupted, further ordering Mr Grech Mintoff to present in court translations of the full accounts given by the said Libyans in their native tongue and to have them certified as true.\n“They want to testify directly. They do not trust the police in Malta. They wish to give their evidence directly to the court,” Mr Grech Mintoff stressed. “All we need is the fixing of a date for the Skype call and they would be willing to testify,” continued the witness.\nFaced with this scenario, Mr Grech Mintoff’s cross-examination by legal procurator Peter Paul Zammit, as counsel to Mr Gafà, was suspended and the case was adjourned to March for the Skype call to take place.\nHowever, just before leaving the stand, Mr Grech Mintoff delivered one final piece of information in open court, claiming that after the previous sitting, Mr Gafà had allegedly returned to Libya in a fresh attempt to stop the men from testifying by offering them money.\nMr Grech Mintoff explained that he even had photos to support his claim.\nWhilst taking formal note of this final piece of information, Magistrate Depasquale stated that unless the Skype call was effected during the next sitting, the court would move on with the proceedings.\nThe case continues in March.", "comment_count": 0, "id": 1082}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A passenger landing on a flight from Dubai was arrested on Sunday after some two kilos of cocaine were found in his luggage during a spot check at the Malta International Airport.\nBrazilian national Adalberto Alves da Silva, 39, was marched to court early on Monday morning and charged with the importation and possession of the drug under circumstances indicating that it was not for his personal use.\nThe court, presided over by magistrate Ian Farrugia, heard how the man had just landed on a flight from Dubai via Larnaca at around 2pm on Sunday when he was stopped by immigration officers who discovered the suspected drug in his possession during routine checks.\nThe prosecution requested the court to issue a freezing order upon all the man’s assets.\nDuring the arraignment, the man pleaded not guilty and was remanded in custody.\nInspector Jonathan Cassar prosecuted. Lawyer Martin Fenech was legal aid counsel.", "comment_count": 3, "id": 1083}, {"keywords": "", "author": "", "article_body": "Palumbo Shipyards boss Antonio Palumbo and his son Raffaele have been sentenced to six years in prison over illegal waste dumping in Sicily.\nThe two Neapolitan businessmen were among seven men found guilty by a Messina court last week, which ruled that they had facilitated illegal dumping between 2011 and 2013.\nThe Palumbo family run what used to be the Malta Shipyard – a business they took over in 2010 – as well as the superyacht facility in Cospicua.\nTheir lawyers will be appealing the sentence, a company spokesperson told Times of Malta.\n“It’s hard to understand what prompted this sentence,” Palumbo lawyers said following the judgement, which they described as “objectively unacceptable”.\n“While prosecutors failed to prove a single one of their accusations, we presented documents detailing the entire series of events and which proved there was no illegal dumping.”\nAntonio Palumbo has consistently maintained that the case is politically motivated.\nBack in April 2013, when Italian police had first arrested him and his son, Mr Palumbo told the Times of Malta that he was “paying the price for living in a place that is difficult and complicated,” he had said, blaming the entire issue on Italy’s “delicate political climate”.\nItalian officials first began to suspect the international shipyard group of illegal dumping in 2011, when Forestry Department officials matched dumped waste samples to ship blasting materials at Palumbo’s Messina facility.\nMaltese authorities subsequently opened an investigation into the company's Maltese shipyard, following a tip-off that similar material had been dumped there and then covered in concrete. \nAn inspection by planning inspectors confirmed that there was residue of grit-blasting operations in the shipyard concrete.\nMalta Today had reported that the investigation into those claims was wrapped up in 2016, with the PA and environmental regulator in talks \"to determine the most appropriate actions to be taken\".  \nAs well as the father and son duo and five other individuals, the Messina court also found Palumbo Spa, La Futura Sud srl and Stabvia Yachting & Coating srl guilty of charges.\nA company spokesperson stressed that the group’s Maltese business interests were completely unaffected by the legal wrangling. ", "comment_count": 13, "id": 1084}, {"keywords": "", "author": "", "article_body": "A restaurant in Marsalforn sent its staff home and stayed shut on Monday lunchtime as it was being pelted with rubble falling from an adjacent construction site.\n\"We could not put people at risk as there were stones falling down onto the roof and the parapet,\" Il-Kartell restaurant owner Diane Falzon told the Times of Malta. \nShe said that work on the roof of the adjacent site had started last week but this weekend, men were seen removing slabs, with loose debris falling down. Makeshift scaffolding has been erected but the video sent by Ms Falzon shows an area covered by dust and small stones.\nThe police were contacted but even though they came on site, they said that only the court could stop the work, co-owner Martin Mercieca added.\nHe referred the case to the health and safety authorities, who promised him that they would visit the site on Tuesday.\n\"It seems incredible that I lose a day of business because of this,\" he fumed.\n ", "comment_count": 43, "id": 1085}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An Italian investor, hard hit when his deposits at Satabank were frozen, has filed a judicial protest against Satabank, Ernst & Young and the Malta Financial Services Authority.\nDavide Maria Di Maio together with his brothers Sergio and Alessandro, all three shareholders and directors of Dream House Malta Limited, said the freezing of their bank account was causing a negative financial impact upon their business.\nLast October Satabank plc had been directed by the Malta Financial Services Authority to refrain, cease and desist from taking further deposits into the accounts of its current customers, after a joint inspection and audit by the MFSA and FIAU had found shortcomings in the bank’s anti-money laundering procedures.\nIn their protest the Di Maio brothers stated that although in October the MFSA had appointed Ernst & Young as the competent body to monitor Satabank plc and initiate a controlled process for the return of customer deposits, their bank account remained frozen.\nThe freezing of this current account was causing financial problems for the Italian investors, both locally as well as in Italy, resulting in the termination of employment of their employees at Dream House Malta Ltd when payment of wages could no longer be effected regularly.\nMoreover, a planned construction project by the Di Maio family at Birzebbugia, had also been negatively impacted by the freeze and had resulted in the extension of a promise of sale from November to April, a delay which translated into a financial impact upon the company.\nFor this reason, the protesting parties requested the First Hall, Civil Court to order the release of their funds with immediate effect, whilst holding the Bank and the relative local authorities responsible for damages.\nLawyer Malcolm Mifsud signed the judicial protest.", "comment_count": 0, "id": 1086}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A four-year-old boy has died of bacterial meningitis, sparking off a rapid reaction from the health authorities to reassure worried parents whose children might have come into contact.\nThe child first displayed symptoms a few days ago and passed away on Sunday, sources told the Times of Malta.\nThis kind of meningitis is very rare, causing one or two deaths every year. The bacteria tend to lie dormant in the nasal passage and throat but sometimes the disease develops.\n“We can’t explain what sparks it off,” the head of the Infectious Diseases Prevention and Control Unit Tanya Melillo said.\nShe was at the school on Monday morning, handing out information leaflets and talking to parents of the boy’s classmates and teachers, reassuring them that the disease does not spread, and that they have never come across any cases of secondary contagion either in schools, workplaces or within the family itself.\nThere are several types of meningitis, some of which are more dangerous than others. Three different vaccines are available against the various types, with the public health authorities recommending different types for various ages of child and for the elderly.\n\n\n\n\nThe most common causes of meningitis are viral and bacterial infections. Some viral and bacterial meningitis are contagious. They can be transmitted by coughing, sneezing, or close contact.\nThe symptoms of viral and bacterial meningitis can be similar in the beginning. However, bacterial meningitis symptoms are usually more severe. The symptoms also vary depending on age.", "comment_count": 0, "id": 1087}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Business organisations say they do not yet have an opinion on the controversial Corinthia Group deal, details of which have been reported by the media for more than three weeks.\nIn the meantime, the government is expected to forge ahead with the deal, with a parliamentary committee set to discuss the issue early next month.\nAccording to the proposed deal, a site in St George’s Bay, which according to real estate agents carries a market price tag of at least €700 million, will be given to the hotel chain for €17 million.\nWhen approached for their views, representatives of the Malta Hotels and Restaurants Association, the GRTU Malta Chamber of SMEs, the Chamber of Commerce, Enterprise and Industry and the Malta Employers’ Association they were still either deliberating or seeking more information.\nMHRA president Tony Zahra said his organisation did not yet have a position. “The MHRA has not been informed or involved in the negotiations that took place between the government and the Corinthia Group, consequently the information we have in hand is what has been reported in the media”, he said. Thus, he added, the MHRA was not in a position to give an informed view of the arrangements proposed.\nHe did say, however, that “on a high level and strictly on the development on quality hotel accommodation, the MHRA believes this would be positive for Malta as its adds to the stock of ‘Best in Class’ hotel accommodation available in Malta”.\nRead: Corinthia deal includes rights to the peninsula seabed\nMr Zahra was the most forthcoming to comment on the deal negotiated by Tourism Minister Konrad Mizzi.\nStill analysing the matter at hand which is still unfolding\nThe Chamber of Commerce, Enterprise and Industry, which represents many large business organisations, said “it has no position to express at this stage as it is still analysing the matter at hand which is still unfolding”.\nThe GRTU is still “working on a statement which will be released in the coming days”.\n“We do not have a position on the Corinthia deal at this stage,” a spokesman for the Malta Employers’ Association said curtly. A question on whether the Corinthia Group was a member of the MEA remained unanswered.\nIndividuals within the business community said, when informed about the replies given by the organisations approached, such attitude was “clear confirmation” they did not want to rock the boat.\nThe business operators said this “reluctance” to comment on the Corinthia deal contrasted sharply with their stand on a similar deal the government had struck some two years ago with the Seabank db Group on the site where the Institute of Tourism Studies used to stand. They recalled that, then, the same organisations were critical of the fact that prime public land was sold on the cheap.\nThe deal with the db Group, also negotiated by Dr Mizzi, involved the transfer of 25,000 square metres of public land for speculation purposes for €15 million staggered over seven years.\nSo far, it has only been the Malta Developers’ Association from among the business lobby groups to come out against the Corinthia deal. It had also opposed the agreement with the db Group.\nDr Mizzi told MPs the agreement with Corinthia was based on the same parameters of the concession given to the db Group, being investigation by the National Audit Office.\nWhile the former ITS site was given to the db Group after a call for tenders, the same did not happen in the case of the Corinthia project. The group is seeking to modify the concession rights it already had to be able to build residences and offices for sale.\nivan.camilleri@timesofmalta.com", "comment_count": 58, "id": 1088}, {"keywords": "", "author": "", "article_body": "Marsalforn Bay will be enclosed by two breakwater arms, according to a design selected by the Gozo Ministry.\nThe design was unveiled by the minister, Justyne Caruana, who said that her ministry is also planning to upgrade the promenade.\nThe plans also provide for an extension of the small sandy beach. \nThe road from Victoria to Marsalforn will also be rebuilt.\nMarsalforn is exposed to rough seas from the North East. A breakwater at the outer end of the North side of the bay was destroyed by the sea several years ago.\nThe selected design for the breakwaters still has to be submitted to the Planning Authority for its evaluation.\n \n ", "comment_count": 77, "id": 1089}, {"keywords": "", "author": "Claire Caruana", "article_body": "A group of some 150 engineers has banded together and is mulling legal action against the government’s Engineering Profession Board over warrants being handed to Mcast students.\nEngineer Arthur Ciantar, part of the team that recently set up the Warranted Engineers Action Group (WEAG), said that despite requests, a report auditing the Mcast programme has yet to be made public.\nAs a result, engineers were now questioning whether the course offered at the college was equivalent to that of the University of Malta, insisting that the group was against the issuing of warrants to Mcast students until the report was published and “the situation clarified”.\nA request by university students to the Engineering Profession Board, which is the regulating authority, for the report, was turned down in November. Both the programmes of the Faculty of Engineering at the university and at Mcast were subject to evaluation by the Accreditation Agency Specialised in Accrediting Degree Programmes in Engineering, Informatics, the Natural Sciences and Mathematics (ASIIN).\nNow, the group of warranted engineers – around 150 people, according to Mr Ciantar – are seeking legal advice and considering taking action against the board over its refusal to publish the report.\n“We want the report to be published so that everything is transparent and we can know what the course entails. Why hasn’t this been published?\n“Something seems amiss,” Mr Ciantar said.\nAttempts by the Times of Malta to contact the Engineering Profession Board for a comment proved futile. \nUntil September, Mcast students who followed the engineering course could not apply for their warrant as the course was deemed to be  “vocational” by the Engineering Profession Board and not eligible for professional recognition.\nHowever, as of this scholastic year, graduates from both the university and the college could apply for a warrant. \nMcast students had repeatedly argued that the board was discriminating against them by not granting them the warrant, claiming their course was the same as that offered at the university.\nMeanwhile, Mr Ciantar said the group was also seeking advice from its legal advisor, Michael Tanti Dougall, on revisions to the Engineering Profession Act which are scheduled to come into force later this year.\n“We know that a revision is in the pipeline but we don’t know much else. We’re in the dark as to this will be a revision or a fresh Act,” Mr Ciantar said, adding there were concerns that some of the changes could raise issued, as was the case with those made to the Education Act last year.\nclaire.caruana@timesofmalta.com", "comment_count": 136, "id": 1090}, {"keywords": "", "author": "", "article_body": "Customs officers on Monday morning found over €26,000 being carried in breach of regulations by a passenger on a flight to Tunis.\nPassengers were searched in the airport departure lounge by the Anti Money Laundering team and the Canine Unit.\nPeter the Customs sniffer dog indicated that a particular passenger might be carrying large amounts of cash, the Customs Department said.\nThe Libyan national was asked how much cash he was carrying. He said he was carrying €9,000. However given the reaction of the dog, the officers searched his luggage and €26,000 were found, with most of the cash hidden in underwear. \nThe passenger was arrested and is expected to be arraigned in court later on Monday.\nPassengers are allowed to carry as much cash as they want when travelling, but they are obliged to declare any amount over €10,000 in terms of an EU regulation to curb money laundering.", "comment_count": 24, "id": 1091}, {"keywords": "", "author": "", "article_body": "Measures against tax competition being proposed by some EU member states would harm Malta, Labour MEP Alfred Sant has warned.\nSpeaking at an activity at Europe House in Valletta, the former prime minister said there was an increasing trend in Europe to combat tax evasion by eliminating tax competition. \nThis is definitely not in the interests of small EU states like Ireland and Malta, which to date are in control of their sovereignty on taxation, he said.\n\"Tax competition is the best tool that small EU states like Malta can use to compensate for the disadvantages they face vis-a-vis the larger EU continental member states like Germany and France. Malta’s biggest challenge in the coming months and years is to reconcile itself against money-laundering and tax evasion with the need to maintain tax flexibility to ensure we remain competitive in the single market.”\nDr Sant also spoke on Brexit, saying that a ‘No Deal’ situation would likely have negative effects on Ireland, the Netherlands, Malta and Belgium.\nThe Maltese MEP said two political currents prevailed at the moment in Europe. Germany favoured the concept of a federal Europe with the same rules applying to all EU member states. Other member states insisted on the need of a Europe of nations. This concept was now attracting the likes of populist movements, especially in Italy and France, which opposed the concept of a federal Europe.\nDr Sant said the increasing social unrest around Europe was the greatest threat to the eurozone.\n“We need to create a social Europe which cares for workers, self-employed, pensioners and those in need of social protection. This is eurozone’s greatest challenge at the moment. The European Parliament elections in May will give an indication on the future of the eurozone. It is clear that we need to create a social Europe based on the principles of social justice.”", "comment_count": 39, "id": 1092}, {"keywords": "", "author": "", "article_body": "Updated Monday 7.06 am \nA merchant ship has rescued scores of migrants who were on a sinking boat some 60 miles off Libya but NGOs have raised fears that they may now be returned to Libya.\n\nThe alarm about the boat was raised on Sunday morning. NGOs said that about 100 people were on board but no one had assisted them for hours. \nTheir concern came just 24 hours after an estimated 170 people died or went missing in two shipwrecks in the Mediterranean Sea. \nTamino Bohn, a spokesman for NGO Alarm Phone told Times of Malta on Sunday that Rome rescue centre had referred to Malta, while Malta had asked Libya to help, but Tripoli was not responding.  \n\n\n\nOn Monday morning, however, the NGO said it had been told by the Italian coastguard that the migrants had been picked up by a merchant ship.\nIt added, however, that the disembarkation point appeared to be Misurata, Libya. This would violate international law and send the people back to the hell of Libya, the NGO said.\nIn a separate statement, the Italian coastguard explained that the Libyan coastguard rescued 140 from a boat in a separate incident earlier on Sunday.\nWhen it was contacted about the sinking boat, the Libyan coastguard could not immediately dispatch units since they were engaged in the first rescue.\nThe migrants in the sinking boat were then picked up by a cargo ship registered in Sierra Leone. The ship will take the migrants to a harbour as directed by the Libyan authorities. \nEarlier this month, during a visit by the Libyan prime minister to Malta, Prime Minister Joseph Muscat said the Libyan coastguard should be allowed to do its job.\n“Once the EU is helping Libya finance, set up and train its coast guard, and this coast guard is finally functioning, we need to allow the Libyan coast guard to do its job. It’s not a race of who comes first when it comes to territorial waters… They should be allowed to coordinate a rescue. I don’t think it’s on that organisations think that they can decide rules for themselves,\" Dr Muscat said.", "comment_count": 0, "id": 1093}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta says that a group of engineers is mulling legal action against the government’s Engineering Profession Board over warrants being handed to Mcast students. The group questions the equivalence of the Mcast course with that of the university. \nThe Malta Independent says Gharghur council has objected to an application for the building of terraced houses. It also says that a design has been chosen for a new breakwater in Marsalforn, and there are plans for the sandy beach to be extended. \nIn-Nazzjon quotes PN leader Adrian Delia saying on Sunday that the government was squandering millions while many could not make ends meet. \nl-orizzont leads with a commitment, repeated on Sunday by Prime Minister Joseph Muscat, that the government intends to provide a free bus service for everyone. ", "comment_count": 0, "id": 1094}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Fuel station owners are meeting on Monday to discuss the details of action they plan to take after the government rejected their proposal for a higher profit margin needed so they can upgrade their facilities.\nThe government on Thursday said it had made an alternative proposal. No details of the proposals were given by either side. \nMonday's meeting comes after the ultimatum for an agreement, given to the government by the Chamber of Small and Medium Enterprises (GRTU) expired with no deal reached.\nCEO Abigail Mamo said the situation had reached the point where fuel station owners who are members of the GRTU would be meeting to discuss the details of action they want to take.\nAsked if a strike was on the cards, she replied all options were being considered, pointing out it was up to the fuel station owners to decide what measure to take.\n“It might not be a total strike but what is certain is that there will be a disruption in service,” she said.\nIt might not be a total strike\nOwners of fuel stations are at loggerheads with the government over a plan whereby all fuel stations would have to upgrade their facilities by next year, in line with requirements set by the Environment and Resources Authority and the Regulator for Energy and Water Services.\nDiscussions between the chamber that represents the petrol station owners and the government have been dragging on since 2014, and operators are expected to refurbish fuel stations by next year – an expense that could reach €500,000 each.\nThe owners are arguing that the government could still meet their demands without having to increase the price of petrol and diesel.\nThe government said that in 2011, the Malta Resources Authority had granted the fuel station owners an increase in profit.\nThe latest demands would result in higher prices at the pumps, according to the government.\nThe owners hit back saying the 2011 increase was eaten up by other costs. The GRTU said it had submitted proposals on how to accommodate the request without burdening consumers.", "comment_count": 11, "id": 1095}, {"keywords": "", "author": "Ivan Martin", "article_body": "Xgħajra residents gathered in a small church hall on Sunday to plan ways to express their objection to the possibility of a major land reclamation project along the southern village’s coastline. \n“First they built Smart City and we had to put up with all the dust and the mess and chaos; then we had the drainage outflow which poisoned our waters; now they want to take away the coast line. I’m sorry, no! This is just not acceptable, are we second class citizens?” one resident said, prompting cheers from the few dozen residents that packed the hall. \nThe Sunday Times of Malta last month reported that the environmental watchdog had singled out the coast of Xgħajra as the only viable location for a “major” land reclamation project.\nSources in the Environment and Resources Authority had said the stretch of south-eastern coast between Żonqor and Fort Ricasoli had been identified as the only possible site for any large-scale land reclamation projects.\nXgħajra mayor Anthony Valvo.\nFar smaller projects could also be considered in other locations across the island, but with stricter controls and mitigation measures.\nFollowing the report, the authority’s top brass had said other locations under consideration included Baħar iċ-Ċagħaq.\nGovernment sources said developers keen on large-scale land reclamation investments were hoping to realise their dream projects in a number of other spots across the island and would likely not be keen on limiting them to the area around Xgħajra.\nThe seafront of Paceville and nearby areas was deemed preferable for investors seeking a return on the cash injected into such projects.\nA team of technical experts at ERA has for the past few months been conducting a marine survey of the entire coast of Malta to identify sites where land could potentially be reclaimed from the sea.\nSunday’s gathering, organised by the Xgħajra Seafront Interest Group, saw the launch of a petition. Group member George Xuereb told the Times of Malta that they were lobbying the authorities to issue a statement on the matter and make their position clear. They were also hoping that local councils in the area would unite against the possibility of such a project as this would affect the whole area.\n“There are no barriers out at sea: the waters of Xgħajra are no different from those of Marsascala or Kalkara. The damage done to one part affects the others too,” one resident said.\nXgħajra mayor Anthony Valvo told those gathered that he had reached out to the councils of neighbouring localities in the hope they could form a united front against the prospect of a land reclamation project.", "comment_count": 61, "id": 1096}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "An extensive bioengineering programme will form part of the newly-approved rehabilitation of Chadwick Lakes, as environmental authorities look to eradicate alien species and allow native habitats to thrive.\nAmbitious restoration plans for the sensitive valley and watercourse will involve the elimination of several plants, including species of acacia and prickly pear, which have a negative impact on existing habitats.\nAt the same time, the plans will see the development of eight habitat types, some which already exist in the valley in some form, others that require the introduction of absent species to improve their structure, and some which will be established entirely from scratch.\nMany of the plant species planned for introduction are rare, endangered or even extinct in the wild, while in some cases the new habitats will be the only ones of their type in Malta.\nApart from the clearing of vegetation and the introduction of new species, the planned bioengineering works will involve changes to the physical structure of the watercourse, altering depths and creating new banks to ensure the water-flow supports the new habitats and organisms.\nThe ecological restoration forms part of wider plans to upgrade the area, which were approved by the Planning Authority on January 9.\nSome of the measures, although deemed acceptable in principle, are still subject to a Memorandum of Understanding with the Environment and Resources Authority (ERA) and an approved management plan.\nEnvironmental studies commissioned as part of the application by the national Water and Energy Agency found that the area was currently in a “deplorable” state.\nLack of maintenance and proper management over the years had led to a number of problems, the studies noted, including a reduced surface water retention capacity due to the accumulation of sediment and debris, a rapid growth of invasive and non-native plant species and the dilapidation of the retention walls.\nMoreover, most of the original infrastructure designed by Lord Chadwick in 1884, has been left in a derelict state.\nWith Chadwick Lakes serving as a popular recreation area in winter, the studies found that trampling by visitors had placed a heavy strain on the area’s habitats, with evidence also found of barbeques, littering and illegal dumping.\nThe rehabilitation project will create a trekking trail alongside the valley bed, fenced in places to prevent visitors straying into sensitive areas, along with information panels and designated recreational areas.\nAn intrusive playground built in the 1990s in the centre of the valley bed will be removed, to be replaced with a new one which, after consultation with ERA, is intended to be designed and oriented toward a “rural adventure experience”, with minimal intervention and limited lighting.  ", "comment_count": 18, "id": 1097}, {"keywords": "", "author": "Anthony Manduca", "article_body": "Prime Minister Joseph Muscat’s apparent support for embattled Nationalist Party leader Adrian Delia is simply a ploy to create further discord within the PN, according to Godfrey Farrugia, the leader of the Democratic Party, which forms part of the Opposition.\n“Joseph Muscat’s real aim is to fuel further dissent within the Opposition which will obviously remain paralysed as long as Adrian Delia insists on leading it,” Dr Farrugia told The Sunday Times of Malta. \n“In such a scenario, where the people are being constantly distracted by the ongoing soap opera within DeliaPN, our country is being plundering by the incumbent government which goes on with impunity. This spillage is largely below the radar,” he said.\nDr Delia has been linked to a money laundering investigation, questions have been raised about his personal financial situation and he has lately faced domestic violence accusations by his estranged wife. A number of PN MPs are known to have lost confidence in him, although none will say so publicly.\nLast week Dr Muscat entered the debate about Dr Delia’s leadership when he told a Labour Party activity: “The people elected a leader and it is clear the powers-that-be in the [Nationalist] party do not respect that decision. This betrays a mindset where democracy is only relevant if you like what the people have decided.”\nDr Farrugia added: “Dr Muscat’s ‘Labour’ government masquerades as the bulwark of democracy by outwardly supporting the ‘democratic’ process, which saw Dr Delia into the PN leadership. \n“It is becoming increasingly obvious with each passing day that the Prime Minister is practising total disregard for the upholding of the institutions and pillars that support a thriving democratic State. His strategic actions and inactions in practice are continuously and undoubtedly proving him in contempt of the very democracy he is posturing to uphold.”\nNationalist MP Jason Azzopardi has also raised the point that some “supposed opponents” were offering advice to Dr Delia.\nThe Opposition will remain paralysed as long as Adrian Delia insists on leading it\nWriting on Facebook, Dr Azzopardi said: “Have you ever heard in football, say, the Roma coach giving advice or defending his Lazio counterpart? Or the Manchester United coach defending/advising the Liverpool coach? Or the Real Madrid coach advising/defending the Barcellona coach? Or Valletta’s coach advising Floriana’s coach? Of course not. Not unless they have a hidden agreement to safeguard their common interests.”\nDr Azzopardi’s comment came shortly after Robert Musumeci, a government consultant and former PN mayor who is now firmly in Labour’s camp, told  Times Talk that the PN leader had to act quickly and be decisive if he was to curtail ongoing dissent within his own party.\nDr Delia referred directly to Dr Azzopardi’s Facebook post during an interview on Net TV, saying the MP had some soul-searching to do. “If he really thinks that, then he must see whether his position within the PN is tenable,” he said.\nDr Azzopardi later downplayed his comment, insisting with the Times of Malta that his football-themed Facebook post was directed towards “Labour loyalists”.\n“All I said was that the PN should make up its own mind. Advice from opponents is worthless,” he said.  “Adrian didn’t take it badly at all.”\nDesmond Zammit Marmarà, however, a Labour Party Balzan local councillor, defended Dr Muscat’s support for Dr Delia, saying Labour stood for democracy.\n“Adrian Delia was elected as the leader of the Nationalist Party by the paid-up members through a totally transparent and democratic process. Therefore, the anti-Delia faction within the PN, as well as some who have left the party and are militating against Delia from outside, are showing total contempt for democracy and want to impose their opinion on the majority who have voted for Adrian Delia to be the Nationalist Party leader.\n“They try to justify their actions by citing a number of serious allegations (not solid proof) against Adrian Delia, including domestic violence and a connection to money-laundering from the proceeds of prostitution. However, one has to ask whether it would be right to have Malta’s top politicians being removed every time there is a serious allegation brought up against them. Would this be fair?  Would it be practical?”\nHe accused the anti-Delia faction within the PN of “disloyalty and cowardice” since they undermine their leader without having the courage to do so openly.\n“Labour stands for democracy, political loyalty and transparency. Therefore, one has to condemn the shady, Machiavellian back-stabbing of Adrian Delia,” Mr Marmara said. \nCarmel Cacopardo, chairman of Alternattiva Demokratika, gave a brief reply when asked for his interpretation of Dr Muscat’s apparent support for Dr Delia.\n“Adrian Delia has too many skeletons in his cupboard. Consequently, he is the ideal opponent as he will inevitably tend to generally follow the advice issued to those in a glasshouse.”", "comment_count": 37, "id": 1098}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A Siġġiewi couple are collecting old photos of a “priceless” cake stand that must have graced countless weddings in their home town over the decades. Philip Leone-Ganado spoke to them\nIt may be just an old cake stand, but to the Siġġiewi couple trying to track down photos of it through the decades it is, in its own small way, part of the history of the town.\nCarmen and Philip Pisani were clearing out their basement a few months ago when they came across the cake stand, an imposing four-tiered construction with different ornate decorative patterns on each level. As they later discovered, it is around 90 years old, made by a Maltese artisan out of chrome-plated brass. \nThe stand had sat in the basement untouched for some 25 years. The couple had bought it for a confectionary shop they were setting up shortly after returning from living abroad.\nThe 90-year-old cake stand made by a Maltese artisan out of chrome-plated brass. Photo: Jonathan Borg\nBut its history with the family dates back further: long before owning it, they had used it at their wedding in Siġġiewi in 1969, as had Ms Pisani’s sister and other family members at their own weddings.\nAt the time, they explained, most couples in the town held their weddings at the same venue – a hall and garden then owned by Allied Newspapers’ founder Mabel Strickland – with catering by the same company, so the distinctive cake stand was likely to have featured at countless celebrations.\nSometimes you’re thinking of throwing something away, then you realise what you have on your hands\nAt first considering selling, the couple tracked down the cake stand’s origins to a metalworker in Qormi, the late Joseph Aquilina, whose workshop still exists today, run by his son.\n“As soon as he saw it, his eyes lit up: he recognised it instantly as his father’s work,” Mr Pisani said. “We asked him how much it might be worth, but he said that since his father only made one, it was priceless. We’re not interested in selling it anymore.”\nThe couple decided instead to have the cake stand restored at the same workshop and embarked on a mission to track down as many photos as they could of its use in the town over the years.\nMs Pisani has since been going door to door asking neighbours for their photos and stories, which she is collecting in an album. She has also visited meetings organised by the local council for older residents.\nCarmen and Philip Pisani today. Photo: Jonathan Borg\n“Villages at the time were much smaller, so a lot of people know what we’re talking about and are happy to share,” she said. “This is part of the history of the village.”\nAs a piece of family history wrapped up in local history, the newly-restored cake stand is now a feature in the couple’s front room, while the photo album chronicling its past gradually fills up.\n“Sometimes you’re thinking of throwing something away, then you realise what you have on your hands,” Mr Pisani said. ", "comment_count": 1, "id": 1099}, {"keywords": "", "author": "", "article_body": "The government is set to appoint Karl Izzo, Malta’s national waterpolo coach and a personal friend of Prime Minister Joseph Muscat, as the island’s ambassador to Montenegro.\nMr Izzo is not known to have any experience in diplomacy or political affairs and no academic background. He is a former waterpolo player who, together with his wife Diane, owns the fashion retail group Dizz.\nHe is expected to be appointed a non-resident ambassador following approval by Parliament’s Public Appointments Committee, which scrutinises government nominations to important posts and institutions.\nThe committee, on which government MPs have a majority, is chaired by former Minister Edward Zammit Lewis, another close friend of Mr and Mrs Izzo and a lawyer to their businesses. This raises the question of whether Dr Zammit Lewis should withdraw from the committee when the vote on Mr Izzo is taken.\nThe Izzo family have often travelled abroad on vacation with the Muscat and Zammit Lewis families. The last holiday they took together was only a few days ago. \nIt is not known if Mr Izzo has any connection with Montenegro other than through waterpolo. Montenegro is considered one of the strongest national teams and several Maltese clubs have hired Montenegrin coaches and players.\nYoung Maltese players also travel regularly to Montenegro, some of them spending months in training camps with clubs there.\nFollowing Labour’s return to power in 2013, Mr Izzo was appointed to various government boards. He is also a paid advisor to Sports Parliamentary Secretary Clifton Grima.\nThe Times of Malta has reported that the retail outlets that will replace the Sliema Wanderers FC pitches at Tigne Point will be transferred to and operated by the Dizz Group. Mr Izzo is a government appointee on the commission that approves such ventures between sports clubs and commercial entities.\nA preliminary transfer of the Sliema facilities to Dizz has already been signed. The government has said Mr Izzo would not be involved in the project evaluation process.\nThe government had failed to answer questions on whether Mr Izzo’s position on the commission was tenable.", "comment_count": 117, "id": 1100}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "A food historian is out to convince the Maltese that they should rally behind the initiative to register the ftira on Unesco’s list of Malta’s Intangible Cultural Heritage. By Fiona Galea Debono\nThe next time you bite into a crusty ftira on a quick guilt-tripping lunch break, think that this is more than just a chunk of bread – and a whole lot of carbs – but also a slice of intangible cultural heritage, and that “its production and consumption need to be considered before it is too late”.\nThat may be quite a mouthful when you are just minding your own business, piling on the pounds. But for food historian Noel Buttigieg, ftira is his bread and butter in more ways than one – research into its past and its preservation into the future has been ongoing for 11 years.\nAt a time when the consumption per capita of Maltese bread is decreasing, ftira becomes an immediate contender, he laments. “While the Maltese still consume bread, the market today is spoilt for choice. We have developed a taste for other breads [rather than Maltese], and the local market is now also importing it.\n“We are not saying that ftira is at risk, but its production and consumption need to be looked into before it is too late,” warns Dr Buttigieg, a lecturer at the Institute of Tourism, Travel and Culture at the University of Malta.\n“It is time to recognise the importance of this intangible cultural heritage and do something about it before it is gone. It is also time the Maltese recognised other aspects of intangible cultural heritage, such as the making of lace, cheese, boats and għana.”\nOne of the problems of ftira, according to Dr Buttigieg, is that people are not noticing that it has, and still is, changing in its nature, form and taste. This is happening both in the production process and in the way it is being prepared for consumption.\nFood is an integral part of the nation’s identity\n“My children love eating it with Nutella,” Dr Buttigieg hesitates to admit.\nThings have certainly changed from when the schiaccata [flattened bread] was supplied to slaves, according to a 16th century document. Yes, ftira goes back that far, and the linguist Giovanni Francesco Agius de Soldanis also provides evidence related to it, referred to as xawwata, back in the 18th century.\nDr Buttigieg’s main interest lies in the history and anthropology of food. Speaking about the proposal to include ftira in Unesco’s List of Intangible Cultural Heritage, he insists the process is rigorous and needs to emerge through public consultation and not be simply the opinion of the few.\nThose who have come forward to support ftira’s nomination and signed petitions are testimony that the Maltese are not only aware of their culinary past, but also their culinary present. But of course, the younger generations consider Kinnie, Twistees and cheesecakes to be the three main markers of Malta’s culinary identity, Dr Buttigieg admits about today’s reality.  \nOne of the reasons behind the nomination is, indeed, the fact that “it is high time we inform and educate. Food is an integral part of the nation’s identity, and as a result of globalisation and its democratisation, generations are forgetting their past”.\nThe diet trends of the moment, which tend to blacklist white bread, may serve to flatten ftira’s cause, and many would consider a talk on its historical, artisanal and culinary qualities, scheduled for January 24, to be a case of over-glorifying a piece of bread.\nMoreover, with so many Maltese overlooking their built heritage as it is, appreciating that food is also part of their history may be even harder to swallow.\nDr Buttigieg is, however, expecting the public to bite.\nThe aim of the lecture at the Inquisitor’s Palace in Vittoriosa is for the public to be able to chew on the process that led to the selection to register ftira as part of the Intangible Cultural Heritage Inventory of Malta and to have an application that the Maltese community of producers and consumers have bought into. \nFtira anyone?\nwww.heritagemalta.org", "comment_count": 13, "id": 1101}, {"keywords": "", "author": "Jacob Borg", "article_body": "A €100,000 “loan” by Keith Schembri, ostensibly to help his auditor Brian Tonna with separation costs, was dated at a time when the Tonnas were still buying property together as a married couple, documents seen by The Sunday Times of Malta show.\nAccording to a leaked report by the Financial Intelligence Analysis Unit (FIAU), the loan agreement is suspected to be a “bogus” means to justify two €50,000 payments made to Mr Schembri by Mr Tonna in 2015. These are believed to be kickbacks on passport sales.\nThe March 2012 loan agreement is actually dated two years before a separation deed was filed by the Tonnas in August 2014.\nA copy of the August 2014 separation deed seen by The Sunday Times of Malta shows Mr Tonna would have likely been under more financial strain, as a result of the separation, at around the time he repaid the interest-free “loan” to Mr Schembri.\nREAD: Schembri, Tonna refuse to provide loan proof\nIn fact, the deed obliged Mr Tonna to pay €5,883 per month plus €2,500 in maintenance after August 13, 2014, as a result of a €1 million settlement with his former wife which came two full years after the “loan” from Mr Schembri.\nAnti-money laundering investigators at the FIAU were unable to find any traces of the 2012 payment to Mr Tonna that was the subject of the loan agreement.\nThe leaked FIAU report noted that Mr Tonna appeared “sufficiently wealthy to handle the costs of personal separation proceedings without needing third party funding”.\nSix days after the separation deed was filed, Mr Tonna was given a “full time” position at the Justice Ministry on a contract worth €5,000 monthly.\nNexia BT and affiliated companies also received over €800,000 worth of public contracts since Labour returned to power in March 2013, including consultancies with the Prime Minister’s office.\nFIAU unable to find traces of 2012 loan payment\nA leaked copy of the FIAU’s probe into the €100,000 payment found that Pilatus Bank was presented with a loan agreement dated March 12, 2012, to justify the payments that later passed between Mr Tonna and Mr Schembri in 2015.\nThe Tonnas’ separation deed shows the couple jointly bought a Żejtun field 15 days after the date of the agreement for a €100,000 loan from Mr Schembri, which was intended, according to the Prime Minister’s aide, to help his auditor financially with the separation.\nIn a May 2016 money-laundering report given to the police, the FIAU called for immediate examination of Nexia BT’s servers to establish when the loan agreement was actually drawn up. \nInvestigators found that the funds transferred to Mr Schembri originated from sales of Maltese citizenship that his auditor had routed through Willerby Inc, a company incorporated in the British Virgin Islands whose ownership was obscured behind nominees.\n“The transfer of funds originating from applicants under the scheme to the personal account of an official holding a position of trust in that same office is seen to be a suspicious transaction warranting further investigation by the police,” the FIAU said in its report.\nNexia BT is an agent for Malta’s passport sale scheme. The scheme’s concessionaires, Henley & Partners, have described Mr Schembri as the company’s “main contact” in the Prime Minister’s office.\nQuestions sent to Mr Tonna by The Sunday Times of Malta were not acknowledged or replied to by the time of writing. Both men deny any wrongdoing.\nDoorstepped by the Times of Malta in February 2018, Economic Crimes chief Ian Abdilla said the police were planning “further action” on the basis of two FIAU reports about Mr Schembri, but this halted once the reports were leaked and presented to the courts by former Opposition leader Simon Busuttil.\nThe inquiry into the €100,000 payment is being led by Magistrate Natasha Galea Sciberras. The status of the inquiry, which began in May 2017, is unknown.\nMr Schembri is also facing another inquiry about €600,000 worth of payments routed through various companies and accounts given to Allied Newspaper’s former managing director Adrian Hillman.\nKey dates:\nMarch 12, 2012 – Keith Schembri “loans” his auditor Brian Tonna €100,000 to help with his separation costs. The FIAU found no trace of this payment and questioned when the loan agreement was actually drawn up.\nMarch 20, 2012 – The Tonna couple buy a field in Żejtun.\nAugust 13, 2014 – The Tonnas finalise a separation deed, obliging Mr Tonna to pay his wife €5,883 per month plus €2,500 in maintenance.\nAugust 20, 2014 – Mr Tonna is given a “full time” position with the Justice Ministry on a contract worth €5,000 per month.\nJanuary 12, 2015 – Mr Schembri receives a €50,000 payment from his auditor’s company in the British Virgin Islands. The payments pass between accounts held at Pilatus Bank.\nFebruary 2, 2015 – A second €50,000 payment is received by Mr Schembri. According to the FIAU report, the men justified the payments as being settlement for the 2012 “loan”.\nMay 2016 – The FIAU calls for an immediate police investigation to establish whether the payments were meant as kickbacks on passport sales.\nMay 2017 – A magisterial inquiry is launched after the FIAU’s report is leaked. Former Opposition leader Simon Busuttil accuses the police of being complicit in a cover-up after no apparent action was taken on the basis of the report.", "comment_count": 46, "id": 1102}, {"keywords": "", "author": "Ivan Martin", "article_body": "Nationalist Party leader Adrian Delia on Sunday said any party supporters thinking of withholding their vote were playing into the hands of the Labour Party.\nSpeaking during a political gathering at the PN club in Birkirkara, Dr Delia said the elections for the European Parliament and local councils in May were fast approaching.\n“Any of you who are thinking of staying home, who may be thinking that this is a wise thing to do, will be voting for Joseph Muscat, you will be giving consent to [Tourism Minister] Konrad Mizzi,” he said.\n\nAlthough it was clear that the road ahead for the PN was tough, and the party had to make up a lot of lost ground, it had the courage of its convictions, he stressed.\nDr Delia said the PN was facing an electoral opponent in the PL which had no qualms with engaging in character assassination and trying desperately to split the Opposition apart.\nCorruption\nDr Delia said the media had spent weeks talking about him, but it was now time for them to start focusing instead on the corruption scandals rocking the country – among them that involving the privatisation of three state hospitals.\nAccording to media reports Vitals Global Healthcare funded a €5 million takeover of a local medical firm called Technoline, which was then given exclusive rights to handle procurement for the three State-owned hospitals entrusted to VGH.\nVGH then reportedly sold the three public hospitals it managed to Steward Healthcare for just €1 in 2017, but “millions” changed hands behind closed doors.\nThese payments included a €1 million payoff to a Dubai company called Mount Everest General Trading LLC, whose involvement in the ownership structures was previously unknown.\nThe government has repeatedly refused to release documents related to the due diligence carried out on VGH and its owners. It paid the concessionaires around €70 million annually to make use of bed space and medical services provided by the company at the three hospitals.\nA memorandum of understanding between the government and some of the investors behind VGH was signed six months before Projects Malta, which falls under Tourism Minister Konrad Mizzi’s control, issued a request for proposals for the running of the three hospitals in April 2015.\nHealth Minister Chris Fearne last week said he was not involved in the talks between the two companies, and the deal was being investigated by the National Audit Office.\nDr Delia on Sunday challenged Prime Minister Joseph Muscat to decide whose side he was on, Dr Mizzi’s or Mr Fearne’s?\nCorruption, he said, meant the government was robbing ordinary citizens.\n“Those of you at home, who have to work hard, that have to take risks, and sacrifice, these are the ones who suffer. The PN is talking about these people when it talks about corruption,” he said.\nDr Delia said he knew for certain that there were a number of Cabinet ministers who were not comfortable with the corruption allegations facing the government.\n“They know this is not right, the responsibility is on them to take steps, to truly represent the people who elected them,” he said.\nThe same, he said, was true of the corrupt land deal in St George’s Bay.\nThe Corinthia Group will be paying the government just €17 million to build up to 100,000 square metres of residential and office property in St George’s Bay.\nThe €17 million premium – on a piece of land which according to real estate agents carries a current market price tag of at least €700 million – is to be paid in several instalments over a long number of years.\nDr Delia said the PN had been clear with the government on this since day one – “we will not accept this. The government cannot give land away, while also failing to build a single social housing unit for those in need”\nThe PN leader said this was what he and his party were fighting for: social justice.\n“For those struggling. For those left behind just because they do not share the government’s politics. For those who do not have a level playing field – these are the people we are fighting for, and we won’t give up,” he said.\nEarlier, Opposition MP Edwin Vassallo told those gathered to stick together. Those who were not onboard with the party’s agenda, were acting against the party. And those who were not acting in favour of the party should know that they were no friend of the PN.\nAnyone who hit out against a single member of the PN, he said, was hitting out against the entire party.\n“Whoever hurts David [Casa], hurts me. And who hurts Peter [Agius], hurts me. And whoever hurts Ryan [Callus], hurts me,” Mr Vassallo said, pointing to PN members who filled the front rows of the gathering.", "comment_count": 59, "id": 1103}, {"keywords": "", "author": "Claire Caruana", "article_body": "Prime Minister Joseph Muscat and Economy Minister Chris Cardona were met with queues of investors during a trip to India earlier this week.\nAs a result, Dr Cardona had to stay in India for “a couple days more” to meet with all those interested in bringing their business to Malta, Dr Muscat said on Sunday.\n\nAddressing supporters at a Labour Party event at the Zurrieq club, Dr Muscat said that not only has people’s mindset changed but also the way that government handles such investments.\n10 Year Challenge\nReferring to the 10 Year Challenge making the rounds on social media – a challenge that involves people uploading their photos from today and those from ten years ago – Dr Muscat that he would be taking such a challenge and looking at Malta’s achievements today and those from ten years ago.\nA decade ago, people would only speak about trying to find work, often not bothering about the quality of the job, Dr Muscat said, while today, most people were able to pick and choose the jobs they wanted.\n“People would have to beg for some work and now, instead, you need to set up an appointment to even meet up with a painter. We have the lowest unemployment rates in our country’s history. Today, we have people looking for “a good job” and that is the difference,” the Prime Minister said.\nThis, Dr Muscat went on, was the result of change brought about by the Labour government.\nOn the impact of a strong economy, Dr Muscat said that such results could be witnessed first-hand when meeting families.\n“Today, compared to 10 years ago, we have fixed prices for school uniforms. You might tell me, that’s no big deal. But ask families in August and they will tell you what an expense this is,” Dr Muscat said, adding that this was also the case with childcare and transport, which were now both being offered for free to everyone.\nOn poverty, Dr Muscat said that the number of people in poverty had been slashed by half, with pensions always on the rise.\n“We were often told that poverty is a perception but this is not true. Even today there are poor people and we say this knowing that is still more that needs to be done,” he went on.\nOn public transport, Dr Muscat said that while ten years ago, the country was forced to deal with chaos as a result of decisions by the previous administration, now people were enjoying a good service, which, even if not always perfect, was an improvement.\nThe prime minister also said that while a number of people – namely students and the elderly – were benefiting from free transport and reduced rates, the government’s vision was to have free transport for everyone in the coming years.\n“We want to reach a point where everyone using public transport does not pay. This is where we want to get to and we will reach this target in the coming years,” Dr Muscat went on.\nHe also added that while in the past, the word ‘surplus’ was rarely used, now this was something everyone spoke about. Instead, he said, people had become accustomed to the term ‘deficit’.\nWe want to raise a generation that does not even know the meaning of word “deficit'\n“We want to raise a generation that does not even know the meaning of word “deficit”. And we did all this without ever increasing people’s taxes.”\nOn health, the prime minister said that the issue with out of stock medicine has also been addressed, so much so that now we are at a point where even if a single pill is not available, this makes the headlines.\nSimilar progress was also made with civil liberties, Dr Muscat added, saying that in the past, people would not even dare speak about divorce and not only was this introduced but the government made sure that anyone could marry whomever they wanted.\n“This government does not interfere in the private lives of citizens,” he argued.\nOn things that have remained the same, Dr Muscat said that sadly this was the case with the participation of women in parliament, something that the government was actively trying to change.\nHe also said that there were no changes with the Nationalist Party, which had remained split and rife with internal conflicts.", "comment_count": 39, "id": 1104}, {"keywords": "", "author": "Jacob Borg", "article_body": "Turkish journalist Pelin Ünker has been sentenced to jail for a story she wrote revealing details about the former Turkish Prime minister and his sons’ business activities in Malta. Speaking to Jacob Borg, Ms Ünker says that she is now awaiting the outcome of an appeal to see if she will go to prison for her investigative work.\n“Guilty”.\nPelin Ünker faces 13 months in jail if her appeal is rejected.\nThis verdict, delivered by a Turkish court on January 8, came as little surprise to Pelin Ünker as she learnt that she faced 13 months in jail for an investigative story about how the sons of former Turkish Prime Minister Binali Yıldırım used companies based in Malta to minimise their tax bills.\nMr Yıldırım was Turkey’s Prime Minister between 2016 and 2018, before the post was abolished.\nAs a result of the article, Ms Ünker, who is a member of the International Consortium of Investigative Journalists (ICIJ), was found guilty by an Istanbul court of defamation and insulting a public official.\nSpeaking to The Sunday Times of Malta, the Turkish journalist said the charge of insulting a public official was being used more frequently against critical journalists in Turkey over the past few years.\nA December report by the committee to protect journalists found that Turkey is the worst jailer of journalists, with 68 journalists imprisoned last year alone.\nHer discoveries about Mr Yıldırım’s activities came as part of the ICIJ’s global Paradise Papers leak, which included searchable data from the Malta Financial Services Authority’s company registry.\nSuch verdicts are a normal part of life in Turkish journalism\nMs Ünker’s article highlighted the use of tax-advantageous jurisdictions like Malta by the global elite to reduce their tax bills.\nShe also discovered that one of the Maltese companies is linked to a Turkish firm that received a €7 million contract from the Turkish government.\nThe Yıldırıms have admitted to owning the Maltese companies.\nMs Ünker said the Yıldırım family blame her for portraying the use of tax havens as a financial crime.\n“It is true, that this is legal. I always highlighted that in my text,” she said.\nSince the sentence was handed down, the European Parliament has urged the European Commission to pressure the Turkish authorities to drop the charges against her.\nThe European centre for press freedom has also shown its support and the OSCE representative on freedom of the media has urged Turkey not to prosecute a journalist for her investigative work.\nAlthough the sentence has been handed down, Ms Ünker has not yet been jailed pending an appeal.\n“I have applied for an appeal and am awaiting the court’s decision,” she says laconically.\nMs Ünker explains that such verdicts are a normal part of life in Turkish journalism.\n“I don’t [fear going to jail]. I am just trying to move on with my life. All my journalist friends have supported me. They have been facing such cases a lot. In a way, we got used to it”.", "comment_count": 3, "id": 1105}, {"keywords": "", "author": "", "article_body": "A van driver has died, two days after suffering severe head injuries in a traffic accident on the Għaxaq bypass.\nThe man, 63 from Marsaskala, had reportedly stopped his van and crossed the road to buy a snack. He was hit by another van as he was crossing the road back.\n ", "comment_count": 0, "id": 1106}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Zarifa Dag’s trip to Lebanese camps inspired her to return and build a school. Photo: Matthew Mirabelli\nA young Maltese-Syrian is planning to return to Lebanese refugee camps to build a school for war-stricken children for whom education is the silver lining in a bleak future.\nWhen Zarifa Dag travelled to Bekaa Valley with a group of Maltese volunteers, she experienced first-hand what it means to share a classroom with 45 students.\nResources at the seven schools that they visited were stretched beyond their limit, with classes held in the morning for Lebanese students and in the afternoon for Syrian refugees aged seven to 18.\nThe 20-year-old was struck by the willpower of the youngest students, who despite not knowing a world without war and living a life on the run or in camps, turned up to class brimming with energy.\nFor those older than 12, hope is fading fast\nMs Dag knows too well how much of a priority education is for Syrians. Born in Malta to a Maltese mother and Syrian father, she often travelled to her second home before the war broke out.\nOnly two of her relatives have survived the Syrian civil war, which has been devastating lives for nearly eight years. According to the UNHCR, over 5.6 million people have fled Syria since 2011, seeking safety in Lebanon, Turkey and Jordan among others. Another 6.6 million have been displaced within the country.\nZarifa Dag, a young Maltese Syrian, is determined to build a school for war-stricken Syrian children living in refugee camps in the Bekaa Valley, Lebanon.\nFor some of those whom she met in the Bekaa Valley in Lebanon, especially those older than 12, hope is fading fast. Their parents told Ms Dag that they have “given up”.\nBut resilience seems to be thriving at schools, where despite the discrepancies in their pay, Lebanese and Syrian teachers have come together to ensure that the war does not disrupt the children’s education. \nThere they are taught the major subjects, including maths and languages, but as they get closer to 18, they can opt for more specialised subjects in preparation for university.\nStudents can continue post-secondary studies in Lebanon or Damascus, across the border from the Bekaa Valley. However, the trip to Damascus is not always an easy one, as they could be questioned and held over suspicion that they are related to someone who opposes the Syrian regime.\nAs an extra-curricular activity, a children’s choir meets on Sundays to practice for an upcoming concert.\nThroughout her trip, when she was not at one of the seven schools where she taught English through art, Ms Dag was visiting houses at camps. Some were made out of wood and others of brick, with many being overcrowded and housing the kitchen and toilet facilities within the same room.\nRefugees pay rent for the house itself or the plot they live in, but the conditions in some were hazardous, she said, recalling being told of an incident where eight children suffered burns in fire caused by a gas leak.\n“Something that remains imprinted in my mind is the discrepancy between Syrian migrants who have settled down well after living in the area for some years, and others who barely have enough to get by.\n“They have the same Syrian roots, their houses are right next to each other, but their lives are worlds apart,” she noted.\nWhile some refugees are keen to go back to their home country but are yet unsure of the safety of their neighbourhood, others have set their eyes on scholarships outside of the Middle East.\nOne family has seen off to the US two of its eldest daughters but struggled to find support when it comes to medical interventions for the youngest daughter, who is severely ill.\nSome barely have enough to get by\nMs Dag said that the only option in such cases is to bribe someone to take the daughter out of the country to seek medical help.\nBefore heading to Lebanon, Ms Dag, who is completing her Digital Arts degree at the University of Malta, had volunteered with Syrian refugee students in Malta.\nWhen she returned from the camps, the experience inspired her to start planning how she could set up a school for refugees in Lebanon. However, she is going to need all the help she can get from like-minded people.\nThose who would like to help out can get in touch on dig.zarifa@gmail.com.\nDespite not knowing of a world without war, Syrian children turn up to class brimming with energy.", "comment_count": 4, "id": 1107}, {"keywords": "", "author": "", "article_body": "Malta will need another 13,000 foreigners this year if it is to maintain its economic growth, according to the head of JobsPlus Clyde Caruana.\nWith 55,000 already here, he is well aware that there is a simmering backlash against the huge influx in such a short time. But he is also adamant that there is no other option if the Maltese expect wages to increase, more inwork benefits, higher children’s allowance, or the extension of the child care service, to name but a few things.\n“If we want to increase pensions, the money has to come from somewhere and it can only come from higher income from taxes through further economic growth – if we are to avoid increasing the tax rates for some parts of the population, on which there is political consensus,” he warned.\nAnd it is not only the government coffers which are benefiting: “In two years’ time, the third highest source of income for Maltese families will be domestic rental income (after employment and pensions), overtaking income from interest on deposits, he revealed.\n“As we speak, 45 per cent of employers have at least one foreign worker.”\nRead the full interview: ‘The economy cannot do without foreign workers’\nRead also: Migrant workers controversy: Have any studies been carried out?", "comment_count": 174, "id": 1108}, {"keywords": "", "author": "Keith Micallef", "article_body": "A painting bought by the State for €15,000 from the husband of a Cabinet minister, which is meant for public viewing, can only be seen by the few who enter the Prime Minister’s official summer residence in Girgenti.\nThe whereabouts of the oil on canvas was only revealed to The Sunday Times of Malta following a Freedom of Information request filed last November. Neither was it known what the painting depicted until now.\nA photo of Patrick Dalli’s oil painting (133cm x 100cm) bought by the State for €15,000 and which is now hanging on a wall of the Prime Minister’s summer residence in Girgenti, rather than in a public place.\nIt turns out that the work by Patrick Dalli, the husband of Equality Minister Helena Dalli, is a nude portrait of a blonde woman, as seen in the photo supplied under the FOI request. The painting measures 133 centimetres by one metre.\nIt was acquired by the Finance and Administration Directorate within the OPM in the first half of 2017 and the purchase was listed in The Malta Government Gazette of November 3, 2017.\nHowever, despite being endorsed by State agency Heritage Malta in terms of both artistic quality and price, no reference to it was made in the agency’s 2017 annual report and it was not in the list of acquisitions made.\nFor over a year, the matter remained under the radar, until last November when the Times of Malta was alerted to the purchase by an anonymous source.\nEven though the work was purchased by direct order from taxpayers’ money, the government persistently refused to reveal what the painting was or disclose its location, even in the face of a parliamentary question.\nThe only information given was a statement issued by the Department of Information that heaped praise on Mr Dalli’s artistry and insisted it was not ‘standard practice’ of the State to acquire works of art through a public call, but rather by direct order.\nThe acquisition, said the statement, was funded through a specific allocation, adding that paintings and works of art are bought specifically to “embellish public places and enhance the national cultural heritage and national art collection”.\nThe apparent secrecy prompted this newspaper to file an FOI request, which was eventually upheld. \nIt now transpires that rather than being used to embellish a public place, perhaps a government museum or art gallery, the painting is hanging at the Prime Minister’s official summer residence in Girgenti, limits of Siġġiewi.\nAnother source of controversy is its €15,000 price tag, excluding VAT, which had immediately raised eyebrows – it is quite unusual for local paintings to fetch such a high price.\nShown the photo, two art critics both said the OPM paid through the nose. \nOne of them said: “Such a work would normally fetch around €3,000. While by some stretch of imagination this could rise to €5,000, it is inconceivable that the OPM paid €15,000 for it.”\nIn its reply through the DOI, the OPM had also said that the work was part of a collection started under the previous administration. It is not known how this new acquisition compares to others in terms of price.", "comment_count": 94, "id": 1109}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta reports that a €100,000 “loan” by chief of staff Keith Schembri, ostensibly to help his auditor Brian Tonna with separation costs, was dated at a time when the Tonnas were still buying property together as a married couple.\nMaltaToday says minister Konrad Mizzi has shrugged off responsibility for the take-over of a medical supplier by Vitals Global Healthcare. The newspaper says the government was powerless to prevent the deal. The newspaper also says Simon Busuttil was turned down after he applied for the post of executive director of the European Union Asylum Office.\nThe Malta Independent on Sunday quotes the Justice Minister saying that in terms of an upcoming reform, the government will have no say in judicial appointments. The newspaper also says the Corinthia is silent on the number of towers it will build in St George's Bay, other than to say it will be fewer than 12. \nIl-Mument says the government is divided between those who back Health Minister Chris Fearne and those who back Tourism Minister Konrad Mizzi.\nKullĦadd says a PN Zejtun councillor resigned 10 days ago and no one from the party leadership has spoken to him since.  \nIt-Torċa warns of a sharp increase in 'black dust' emissions if the Central link road is not built. \nIllum reports about disquiet and pressure on government MPs about the change of conditions for land in St George's Bay for the Corinthia group, allowing the group to build apartment towers. ", "comment_count": 0, "id": 1110}, {"keywords": "Education", "author": "Bernadette Zerafa", "article_body": "Last year the eSkills Malta Foundation held a range of activities and embarked on various new initiatives to promote the digital skills needed to meet the constant competitive challenges faced by the various sectors of Malta’s economy.\nOne such initiative was the launch of the Digital Opportunity Traineeships. This is an EU-funded training initiative that seeks to help companies fill vacancies for personnel requiring digital skills with prospective competent candidates, while at the same time enabling students to gain practical experience in the workplace.\nThe scheme was launched by the foundation on April 17, in association with European Union Programmes Agency (EUPA) and hosted by All Digital. The scheme uses the Erasmus framework to achieve its aims.\nOne of the foundation’s major initiatives in 2018 was the launch of the ‘Guidelines to Increase and Retain Women in ICT’. The guidelines seek to help in address the issue of the low percentage of women in the ICT sector.\nThe guidelines were launch­ed on April 11 at the MITA Data Centre in the presence of Equality Minister Helena Dalli and Silvio Schembri, Parliamentary Secretary for Financial Services, Digital Economy and Innovation.\nLast year the Foundation continued working on raising awareness and knowledge on ICT careers among career guidance and counselling teachers. In recognition of the importance of reaching out to career guidance and counselling teachers, who are key influencers in students’ study choices and career aspirations, the Foundation has pledged to train 60 such teachers every year.\nIn order to do so the Foundation works closely with the National School Support Services at the Education Ministry’s Department for Educational Services.\nOne of the foundation’s aims is that of developing the IT profession. This objective includes promoting the eCompetence Framework to serve as a common language on the skills and competences required by the industry for the most common roles. Through this framework, practitioners and organisations can assess whether they have the competences required in their ICT positions.\nThe European eCompetence Framework is important for the the development of the local ICT industry and community of ICT practitioners. The framework also strengthens HR processes in the continuous professional development of ICT practitioners.\nLast March the Foundation organised, facilitated and funded a two-day eCompetency (eCF) training course. This was done in collaboration with the Council of European Professional Informatics Societies (CEPIS).\nThe Foundation had been working with CEPIS to pilot this course in Malta as the first country to receive such practical training by CEPIS. Participants in the course came from the public and private sector, as well as the education sector.\nAnother of the foundation’s activities is increasing awareness among students about ICT career opportunities and competences. In collaboration with the Student Services Department the foundation conducted school visits and met over 200 Year 9 students who had already chosen computing as an optional subject.\nThe aim of these visits is to help students understand better the use of ICT, the various roles and the respective knowledge and skills requirements. The visits also serve to encourage the students to pursue ICT studies at post-secondary and tertiary levels. The foundation also took part in various career fairs and cxpos held during 2018.\nEU Code Week 2018, which took place in 72 countries including Malta, set new records and was the most successful to date. Over 41,000 EU Code Week activities were organised this year, involving hundreds of thousands of participants. Of these activities, more than 36,000, or 88 per cent, were carried out in schools. Over 10 per cent of schools in the EU and western Balkans participated in EU Code Week this year, as targeted by the European Commission for 2018.\nMalta is one of the few countries that reached and superseded this target. A total of 192 State, Church and independent schools, or 82 per cent of all schools in Malta, involving about 6,000 teachers and 28,300 students, participated in over 190 coding events in this year’s Code Week. This was an outstanding statistic that placed Malta at the top of the map in terms of the highest number of events per capita.\nThe foundation also organised an event on cyber security in collaboration with MITA, PwC, the University of Malta and SECFORCE. The two half-day event, hosted at MITA Data Centre, Santa Venera, was attended by about 100 people from the private and public sectors.\nThese were a few of the initiatives carried out last year. The Foundation looks ahead to 2019 to face even greater challenges with hard work, determination and enthusiasm.\nBernadette Zerafa is manager at the eSkills Malta Foundation.\nFor more information visit https://eskills.org.mt .", "comment_count": 0, "id": 1111}, {"keywords": "Education", "author": "Dale Spacey, Luca Decelis and Keylon Zammit", "article_body": "In the latest in a series of practical projects led by our science teacher Martin Azzopardi, applied science students at St Margaret College Senior Secondary School, Verdala, Cospicua, recently learnt all about porcelain and bone china. We were also given the opportunity to mould bone china paste into shapes and figures.\nWe learnt that porcelain was invented in China during the Tang dynasty (AD618-907) by mixing kaolin (china clay) and pegmatite, a coarse type of granite. The first Chinese porcelain wares appeared in Europe in the Middle Ages and although Europeans tried for a long time to copy it they did not succeed.\nIt was only in 1707 that two Germans – Ehrenfried Walter von Tschimhaus and Johann Friedrich Bottger – succeeded to imitate bone china by combining clay with ground feldspar. The first European hard-paste porcelain was produced in 1710 in Meissen, near Dresden, and Meissen Porcelain or Meissen China became one of the most famous porcelain manufacturers in the world.\nLater in the 18th century the English improved upon the German recipe for porcelain by adding ash from cattle bones to clay, feldspar and quartz.\nWhereas porcelain is translucent, bone china is opaque, softer and easier to cut, and is also fired at lower temperature. Although bone china is fired at lower temperatures than true porcelain, the bone ash enables it to become translucent.\nBecause bone china is easier to make, harder to chip, and stronger than hard porcelain, it has become the most popular type of porcelain in the US and the UK.\nThe authors are students atSt Margaret College Senior Secondary School, Verdala, Cospicua.", "comment_count": 0, "id": 1112}, {"keywords": "Education", "author": "", "article_body": "Francesca Alotta, who together with singer Aleandro Baldi won the San Remo festival in 1992 with the song Non Amarmi, performed during the annual Christmas concert of Mater Boni Consilii St  Joseph School, Paola, in aid of charity. Alotta was accompanied during the concert by Paolo Rainaldi and Piero Fortezza.\nFrancesca Alotta performing at the concert.\nDuring the concert around 200 students had the opportunity to sing along with Alotta as she performed a repertoire that included some of her newest songs from her CD Anima Mediterranea, O Sarracino, O Sole Mio, O Surdato Nnamorato, Tammurriata Nera Non Amarmi, Ciuri Ciuri, Vitta na Crozza and Nel Blu Dipinto di Blu. She also sang various Christmas carols such as Chestnut Roasting, What Did The Animals Say? White Christmas and Happy Day.\nMaltese singer Amber joined Alotta during the concert to sing Un Anno di Noi as a duet. \nSchool head Kenneth Vella said the initial contacts with Alotta started last summer, with the singer expressing interest to travel to Malta to take part in the school’s annual Christmas concert in aid of charity.\nAlotta had a message of hope to pass on to the students and other people because of her difficult and challenging past\nCommenting on the preparations for the organisation of the concert, Dr Vella said: “It was not an easy task for a small school like ours to organise such a high-level concert by a winner of the San Remo festival that was attended by over 500 people. But I was convinced that Alotta had a message of hope to pass on to the students and other people because of her difficult and challenging past.”\nDue to the school’s limited  space it was decided to hold the concert in the auditorium of St Agatha School, Rabat. This add­ed to the challenge for the school’s music teacher M’Grace Grech, with the assistance of the Parent-Teacher Association and other members of staff, to prepare the pupils and students to perform in the concert. In fact, they had a very limited time to rehearse on the stage with the singer, who arrived just hours before the concert.\nDr Vella said the process of procuring the support of the various sponsors for the organisation of the concert was also a very time consuming exercise, and he expressed his sincere appreciation to the several entities whose assistance and contributions made the event possible.\nAlotta’s CD Anima Mediterranea may be bought from Mater Boni Consilii St Joseph School, Paola, and part of the proceeds will be donated to the Community Chest Fund.\nMaltese singer Amber (right) joined Alotta during the concert to sing Un Anno di Noi as a duet.", "comment_count": 0, "id": 1113}, {"keywords": "Education", "author": "", "article_body": "Maltese banker Daphne Ciantar has been awarded a prestigious international scholar prize by the London Institute of Banking and Finance in recognition of her academic achievement while completing the BSc (Hons) in Banking Practice and Management.\nMs Ciantar received the highest mark in the Advanced Based Work Learning module of the degree course, which had a particular focus on financial crime, risk and compliance.\nRob Thompson, relationship director at the London Institute of Banking and Finance, congratulated Ms Ciantar and commended her for her achievement, while wishing her further success in her career and future studies.\nIFS Malta president Kenneth Micallef, also congratulated Ms Ciantar on receiving the award, saying that “this positively reflects the commitment, diligence and professionalism with which she pursued her studies. He added: “It is also greatly satisfying to mention that IFS Malta assisted Daphne in her rewarding academic journey.”\nThe London Institute of Banking and Finance has a long-standing relationship with the Institute of Financial Services – Malta (IFS Malta), through which its qualifications are offered locally.\nMs Ciantar has been working in the financial services sector since 2007 and is currently a senior credit officer at HSBC Bank Malta’s Lending Services. She also holds a Foundation degree in Banking and Finance from the University of Kent and a Diploma in Management Studies from the University of Malta.", "comment_count": 0, "id": 1114}, {"keywords": "Gozo", "author": "", "article_body": "An exhibition of paintings, drawings and sculpture by Gozitan artist Joseph Sagona (b.1942) was inaugurated at the Banca Giuratale in Independence Square, Victoria. Sagona, a painter, sculptor, decorator and designer, is best known for his stucco decorations in various ecclesiastical establishments, as well as in private residences.\n\nThe exhibition – Sagona’s third personal show – is entitled The Spirit of Decoration and epitomises the artist’s authentic spirit, characterised by simplicity and elegance. The works on display encompass different genres, including landscape painting, religious and secular works, as well as decorative schemes. The pencil drawings and decorative inventions demonstrate Sagona’s mastery in the ornamental language.\nSagona’s extensive oeuvre in design and decoration has been translated into various media, including silver, wood, marble, bronze, stucco and embroidery.\nSagona received his early artistic training under Prof. Giambattista Conti and Giuseppe Galea.  He also studied with Giuseppe Briffa and Marco Montebello.\nThe exhibition runs until January 27.", "comment_count": 0, "id": 1115}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Tourism Awards 2018 ceremony, organised by the Gozo Tourism Association, was held at the Grand Hotel Mġarr. Ta’ Frenc Restaurant executive chef Mario Schembri won the Tourism Worker of the Year Award, while the Young Tourism Worker of the Year went to Warren Vella. The Tourism Entrepreneurship Award was won by Ferdinand Portelli of Ferdie’s Cocktail Bar and Restaurant, while the Cultural/Social Achievement Tourism Award was awarded to the Gozo Half Marathon organisers. The award was collected by the president, Mark Bonnici.\nThe Gozo Tourism Association Council awarded the Lifetime Achievement Award in Tourism to Silvio Rapa of the Grand Hotel Mġarr for his investment and achievements in the tourism sector which contributed towards job creation and economic growth on the island.\nA special recognition award in tourism, introduced this year, was awarded to ITS student Francesco Cauchi.\nThe awards were presented by Gozo Minister Justyne Caruana, Tourism Minister Konrad Mizzi and MTA Gozo senior manager Christine Vella.\nIn a short address Dr Caruana emphasised the importance of the human resources in the tourism sector and, while congratulating the winners, thanked all workers and entrepreneurs working in the tourism industry.\nOther addresses were delivered by Gozo Tourism Association chairman Paul Scicluna and Dr Mizzi.", "comment_count": 0, "id": 1116}, {"keywords": "Gozo", "author": "", "article_body": "A soirée, Leħħiet Imdemmija, was organised by students and teachers attending Sir Michelangelo Refalo Sixth Form, Victoria. The soirée, held at the Gozo Ministry, commemorated the centenary from the end of World War I and the opening of the Paris Peace Conference.\nThe project was funded by Education Plus and endorsed by Valletta 18. The evening included drama, art, reflective writing, poetry and dance. Around 28 students and 15 teachers took part.\nThe evening’s message was one of peace, highlighting Malta’s role as a hub for promoting and consolidating peace among nations.", "comment_count": 0, "id": 1117}, {"keywords": "Gozo", "author": "", "article_body": "Construction work on the extension of the Nadur parish centre is in an advanced stage. The centre caters for the formation of youth and activities are not necessarily religious, but are typically an important part of the local community life. Those who would like to help in the project are to take their donation to the parish office or pass it on to members of the Nadur clergy.", "comment_count": 1, "id": 1118}]