[{"keywords": "", "author": "Denise Grech ", "article_body": "Updated 3.50pm with secretariat's statement\nA dairy farm in Fgura has been blasted for the \"pain, suffering and abuse\" of the animals on site.\nDisturbing images uploaded to social media by the group Animal Liberation Malta show cows and goats living in less than ideal conditions in overcrowded spaces and locked in rooms with no natural light.\nOne photo depicted a cow with its back legs tied after its pelvis had been damaged. It had given birth far too many times and needed her hind legs to be tied or else she would not be able to walk, the animal rights' group claimed.\nAnother photo showed another cow with its placenta hanging out after giving birth.\nCalves which \"had been taken from their mother\" were living in a dark dingy room waiting for a farmer to slaughter them, the group said.\nOne of the cows was seen with its legs tied. Photo: Animal Liberation Malta\nThe group said it reported the farm to the authorities \"countless times\". The farm owners have been taken to court for their abuses but they always won the case, the group said.\nInspection carried out\nTimes of Malta is informed that veterinary regulations directorate inspectors were on site on Thursday morning to verify the claims made through the social media post.\nThe chief vet Roberto Balbo said the farmer passed away around a month ago and the children were taking care of the farm but could not cope with the increased demand.\nFollowing the inspection, he told Times of Malta that the heirs had been requested to clean the farm and to call the vet to medicate few animals in need, but there was no need for legal action.\n\"Furthermore in relation to comments aiming at criticising the milk (quality), the test results carried out last month indicate no public health issue,\" Dr Balbo said.\nThe Parliamentary Secretariat for Animal Rights said inspectors had found the farm to be overcrowded, and less animals should be on the farm to ensure better management of the facilities.\n“Since the owner of the farm died recently, discussions are ongoing on the future of this farm,” the Parliamentary Secretariat said.\nA report on the investigation into the farm will be sent to the Animal Welfare Commissioner, the secretariat said, insisting that no animal cruelty should be tolerated.\nAnimal Liberation Malta ended its post with a call for people to turn away from cows' milk and find plant-based alternatives.\n\"Dairy farms like this are causing havoc to the environment and are highly unsustainable,\" the NGO said.\nThe social media post caused outrage on social media, with many calling for an end to the \"disgusting\" practices.\n ", "comment_count": 123, "id": 719}, {"keywords": "", "author": "Denise Grech ", "article_body": "Malta’s taxation system would be blacklisted by the EU, but for a system giving member states an automatic exemption, according to an anti-poverty organisation.\nOxfam published a report dubbed \"Off the Hook: How the EU is about to whitewash the world’s worst tax havens\" a week before officials in Brussels were set to publish a blacklist of countries based on their tax systems.\nThe EU blacklist did not even take member states into account, since it believed they already \"complied with tax criteria,\" the organisation said.\nThe move badly damaged the credibility of the process, because \"in reality Ireland, Luxembourg, Malta and the Netherlands are among the most significant tax havens in the world,\" Oxfam said.\nCurrent tax rules allow telecommunications operator giant Vodafone Group PLC to allocate nearly 40 per cent of its taxable profits to Malta and Luxembourg, Oxfam noted.\nThe EU review – the first of its kind – was set to give nine of the \"world’s worst tax havens a clean bill of health\", Oxfam said. Among others, the anti-poverty organisation said jurisdictions like the Bahamas, the British Virgin Islands and Panama were likely to be entirely de-listed by the EU.\nOxfam has repeatedly decried Malta as a tax haven. In 2017, it said Malta should be included in the EU tax haven after analysing it based on its \"fair taxation criteria\".\nThe organisation annually expresses its concerns that EU governments will present a weak or even empty blacklist. When Malta held the EU presidency it had publicly advocated for an empty blacklist, Oxfam had said.\nThe EU published its tax haven blacklist in December 2017. It currently blacklists five small island states, while another 63 countries that have promised to reform their tax practices are on a 'grey list'.\nPolitical interference in the screening also risked tax havens like Switzerland and the United States were unlikely to feature on the blacklist, the report’s author Johan Langerock said.\nOxfam is calling on EU governments to strengthen the blacklist criteria, ensure the screening process is free from political interference, and monitor tax reforms being implemented by 'grey list' countries to ensure they are effective.", "comment_count": 38, "id": 720}, {"keywords": "", "author": "", "article_body": "A 37-year-old man from Iklin was injured on Wednesday evening in a collision between two BMWs in Louis Wettinger Street, Mellieħa.\nThe police said the man was driving a BMW 640D which was involved in a crash with a BMW 120D driven by a 26-year-old woman from Swieqi.\nThe collision occurred at the junction of the Mellieħa bypass with the road going into Mellieħa. Both cars ended up in the roundabout with the force of impact. \nThe woman was not injured. ", "comment_count": 0, "id": 721}, {"keywords": "", "author": "Philip Leone-Ganado and Jacob Borg", "article_body": "Controversial road widening in a Rabat valley is “in line with applicable road works permits”, Infrastructure Malta has insisted after ERA, the environment watchdog ordered the job to stop.\nThe Environment Authority said on Tuesday the government road agency’s work had been carried out without the necessary permits, resulting in “environmental destruction”.\nAccording to the authority, construction material placed on land colonised with natural vegetation to widen the existing roads had physically changed the valley profile – reducing it in parts to a “roadside trench” – and harming its natural water flow.\nHowever, an Infrastructure Malta spokesman told the Times of Malta that the work was being carried out within the footprint of the existing road and in line with the necessary road works permits. These permits, he said, were the only authorisations required for the work.\n“However, Infrastructure Malta is taking note of the environmental concerns being raised and is consulting the applicable authorities to discuss any additional measures or interventions that may be necessary,” the spokesman added.\nThe ERA failed to respond to questions on whether it would be ordering Infrastructure Malta to remedy the damage in the Rabat valley and whether other rural road widening work was covered by permits.\nPart of an effort to reconstruct rural roads\nTimes of Malta reported on Tuesday about environmentalists’ concerns that country paths in Wied l-Isqof and Wied is-Sewda were being turned into “highways”, with concrete poured over both sides of the paths to widen them.\nPictures of the work showed concrete spilling off the road and into a water gutter on the side of the country lane.\nInfrastructure Malta said the work was part of an effort to reconstruct over 40 kilometres of rural roads that had been left in a state of disrepair for many years.\nIt said it was committed to continue improving the quality of the Maltese road network, including countryside roads mostly used by farmers to access their agricultural lands.\nMeanwhile, a country lane in Luqa is the latest to have fallen victim to the concrete ‘assault’.\nCountry lanes around Triq il-Karmnu have been ‘upgraded’ over the past months by Infrastructure Malta. The Luqa local council hailed the work in a Facebook post as improving accessibility for farmers as part of a €150,000 investment.\nShadow environment minister Jason Azzopardi said he had been contacted by various eNGOs over the last few days about what experts in the environmental field termed as “irreversible and huge damage” being caused to Malta’s biodiversity to disproportionately widen the valley pathways.\nDr Azzopardi said he had written to the chairman of the parliamentary environment committee to put the subject on the agenda and discuss the matter with eNGOs.\nEnvironmentalist Alfred Baldacchino has argued that the work would have a detrimental effect on farmers due to the increased traffic that could now pass through the lanes.\nNature Trust in a statement \nNature Trust Malta welcomed the action taken by ERA.\n\"NTM hopes that this will serve as an eye-opener to increase awareness that our rural landscapes must be respected, and that all wildlife, including wild plants and their accompanying fauna, forms part of an intricate relationship serving not only to colour our countryside lanes but also to help manage and control water runoff and provide shelter to a multitude of organisms many of which are beneficial to agriculture as they are pollinators or natural predators (such as snakes and hedgehogs),\" the NGO said. ", "comment_count": 20, "id": 722}, {"keywords": "", "author": "", "article_body": "The following are the top stories on Malta's newspaper front pages on Thursday.\nTimes of Malta says that the number of people who are materially deprived has increased for the first time since 2013 with over 40,000 citizens unable to make ends meet, fresh data shows.\nIn its second story, Times of Malta reports that some of the MFSA's most experienced executives are expected to ‘retire’ in the coming weeks after being offered lucrative golden handshakes to make way for ‘new’ recruits.\nThe Malta Independent quotes Equality Minister Helena Dalli saying that gender quotas in parliament are 'a necessary evil'. It also says that the Planning Authority will decide on Thursday whether building will be allowed above a scheduled Sliema townhouse.\nl-orizzont leads with assurances that gas cylinders are safe, and says the government is not ruling out a national gas system. It also reports the resignation of GWU government workers section secretary Jeremy Camilleri. ", "comment_count": 0, "id": 723}, {"keywords": "", "author": "", "article_body": "The Nationalist Party will be voting in favour of George Vella’s nomination for President of the Republic in the \"national interest\", leader Adrian Delia said on Wednesday.\n\nSpeaking at a political activity in Mosta, Dr Delia said the party had invited the government to show that it had the national interest first and foremost and nominate a candidate from the opposition camp.\nDr Delia said the PN made taken such a step many years ago with the appointment of George Abela. It had also voted in favour of Marie Louise Coleiro Preca’s appointment.\nLast month, Dr Delia proposed Lawrence Gonzi, Tonio Borg and Louis Galea for the post.\nDr Delia said the PN had also asked for the President to start being appointed by a two-thirds parliamentary majority.\nHowever, the Prime Minister insisted on Dr Vella’s nomination.\nIn spite of this, the PN’s parliamentary group this evening agreed that, in the national interest, it should vote in favour of the former foreign affairs minister's nomination.\nThe decision was immediately welcomed by Prime Minister Joseph Muscat who said in a tweet he had no doubt Dr Vella was the right person for the job and would continue to unite the country.\nThe Prime Minister made the nomination public through a tweet on Tuesday.\nDr Vella, who will turn 77 next month, will be Malta's 10th president.\nIn 1974, the majority of Opposition MPs had backed Malta’s first president, Sir Anthony Mamo. Nevertheless, a number of them, including the late former prime minister George Borg Olivier, had voted against. Subsequently, between 1976 and 2008, the Opposition voted against or abstained.\nIn 1976, the PN Opposition had voted against but did not call for a division over the appointment of Anton Buttigieg. Then, in February 1982, Opposition MPs were not present in the Chamber as the PN had boycotted Parliament following the perverse result of the 1981 general election.\nIn 1989, Labour, under the leadership of former prime minister Karmenu Mifsud Bonnici, had vehemently opposed the nomination of Ċensu Tabone to the point that it even called for a division and boycotted his presidency.\nIn 1994, Labour voted against the nomination of Ugo Mifsud Bonnici but did not demand a division. In contrast, it had fiercely criticised the appointment and called for a division in the cases of Guido de Marco in 1999 and Eddie Fenech Adami in 2004.", "comment_count": 29, "id": 724}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The police would not comment on a report by the Labour Party media that they were investigating for fraud a Sicilian man who claims he and his son were beaten by officers.\nFabrizio Scirè\nA day after timesofmalta.com posted footage showing members of the police rapid intervention unit appearing to be punching Fabrizio Scirè and manhandling his son in Żebbuġ, One News quoted police sources saying Mr Scirè was being investigated for alleged fraud and that he was expected to be arraigned.\nPolice Inspector Sandro Camilleri, president of the Police Officers Union within the General Workers’ Union, spoke with the Labour TV station and denied the Italians had been manhandled.\nHe branded the footage “a complete invention” and accused Mr Scirè of being aggressive vis-à-vis the police.\nA police spokesman said when contacted the law precluded the force from disseminating information on ongoing investigations. This is the stock reply the police give in such situations though there were exceptions.\nIn March 2016, for example, they had issued a statement saying they were not investigating the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi in connection with money laundering claims.\nMr Scirè’s lawyer said on Tuesday his client had not been informed of any investigation involving him and had not been summoned by the police for questioning.\n“The report by One News came as a complete surprise to my client,” he said.\nWhen the ‘beatings’ video appeared, the police had confirmed that an internal investigation had been launched. The government had also announced that a magisterial inquiry was under way and that it could lead to action depending on its conclusion.\nNone of the officers involved in the alleged Żebbuġ incident are known to have been suspended.\nIn a similar case in 2007, when a police officer was caught on video kneeing a French woman in her chest, he was immediately suspended pending an inquiry.\n ", "comment_count": 16, "id": 725}, {"keywords": "", "author": "", "article_body": "Gozo has won the Best of Communities and Culture award for the third consecutive year at the ITB tourism fair in Berlin.\nMinister Justyne Caruana said the award was confirmation that the strategy her ministry was working upon was bearing fruit with a number of visitors choosing Gozo.\nShe said that such results could only be acquired when everyone worked together in the organisation of high level events which sustained Gozitan communities and made Gozo a showcase of cultural activities throughout the year.", "comment_count": 5, "id": 726}, {"keywords": "", "author": "Denise Grech ", "article_body": "European Environment and Maritime Affairs Commissioner Karmenu Vella has defended attending controversial White Flag events, saying requests to attend the organisation’s initiatives had been “assessed based on their contribution”.\nThe White Flag initiative came under fire following media reports that local companies had paid up to €25,000 each to be associated with the ‘plastic-free’ beaches that were cleaned up by the organisation behind the venture.\nWhite Flag International had defended itself against the claims, saying it had been “misunderstood”.\n“We were surprised with the false accusations because it is obvious that no profound research was done,” a spokesman had told Times of Malta.\nMr Vella attended Malta’s White Flag campaign launch in March, according to the Commission’s website.\nAn important step in the fight against waste at sea\nReplying to a question by MEP Francis Zammit Dimech, Mr Vella said the Commission’s participation in these events should be considered in the context of the promotion of the Strategy for Plastic, “which is an important step in the fight against waste at sea”.\nThe PN MEP asked if due diligence had been carried out on the organisation and if the Commission still supported the White Flag initiative after the controversy emerged.\nRead: European Commission asked to look into White Flag initiative\nIn his answer, the European Commissioner said the Commission recognised the role that private labels played in bringing awareness when they participated in discussions against waste at sea.\nThe Commission also had no evidence that EU funds had been allocated for the White Flag initiative, Mr Vella said.\nIn a reaction, Dr Zammit Dimech said the Maltese government needed to do much more to address waste management.\n“One cannot expect to collect waste from a beach and erect a white flag and solve the issue,” he said.\nOther small islands in the Mediterranean, such as Pantelleria and Lampedusa, had become or were in the process of becoming free from single-use plastics, Dr Zammit Dimech noted.", "comment_count": 2, "id": 727}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A husband and son who stood by listlessly while their female, bedridden relative was reduced from the family’s “tower of strength” to an “emaciated corpse” were declared guilty of causing her death through failure to provide her with the necessary care.\nThe 73-year-old husband, Salvatore Chircop, and his 47-year-old son Stanley were made to face justice when the police were called in to investigate what appeared to be, at first glance, a suspicious case of extreme neglect.\nThe story came to light when, one day in June 2014, a 64-year-old woman, Serafina Chircop, who looked as though she was 90 was rushed to hospital in an ambulance, “in moribund state”, blank eyes and her body covered in sores.\nHospital staff at the emergency department were alarmed by the poor state of the patient, who was admitted in critical condition, “in a bad state of hygiene”, her left side covered in sores so deep that her hip bone showed through.\nThe patient was so dirty that a necklace was stuck to her body, “embedded” in grime.\nAlthough medical staff battled to save her life, the woman passed away four days after her admission, the cause of death being attributed to “cardio respiratory failure caused by malnutrition”.\nThe police were alerted to the critical case and visited the patient’s family home. They were shocked by the appalling conditions which met their eyes.\nThe woman, long-suffering from rheumatoid arthritis which had severely hampered her mobility over a seven-year span, had spent the last months of her existence confined to bed, refusing two opportunities for knee replacement surgery and not letting anyone touch her aching body.\nHer sister, who had called for the ambulance, later recounted how her sibling had harboured a great fear of doctors and hospital, refusing medication, except for painkillers.\nHaving been a chain smoker in her better years, the woman would ask her husband to light up a cigarette and hold it to her lips since her enfeebled state did not even allow her to do that.\nYet, her hardheadedness was no excuse for the appalling state in which she was left “to rot, infested with grime, bugs and insects”, lying on soiled sheets which stuck to her ailing body.\nThe patient’s state was certified by medical and forensic experts who described the patient as an “emaciated corpse”.\nIn the light of all evidence put forward, the court declared that “any further adjective and/or detail is superfluous”.\nWhen the woman’s husband and son had chosen to care for their relative at home, they took upon themselves “a far greater dose of duty of care”, the court, presided over by magistrate Donatella Frendo Dimech observed.\nInstead, the woman ended up in an “inhuman and shocking state, suffering from fractures, burns, wounds and extreme filth”, which in turn accelerated her death through pneumonia.\nAlthough not willed by the defendants, their negligence for months on end had doubtlessly given rise to the fragile state of their relative, who had once been their “tower of strength”, the court continued.\nHad they exercised the diligence and prudence expected of them, the woman could have been spared such a fate which, though not willful, had been foreseeable, the court observed, declaring father and son guilty and condemning them each to a two-year jail term suspended for four years.", "comment_count": 0, "id": 728}, {"keywords": "", "author": "Ivan Martin", "article_body": "Like most radio show hosts, Meron Estefanos’s phone is a busy one, buzzing relentlessly whether she is on or off air.\nBut unlike most, when her chat show line rings, the calls do not come from someone seeking relationship advice, complaining about traffic or hoping to win freebies by guessing who directed Titanic or who was top of the charts that week.\nMeron Estefanos\nInstead, her callers are on board sinking migrant boats or locked inside gruesome Libyan detention camps.\n“The calls can be harrowing, really distressful, and come in all forms. It could be an overcrowded boat somewhere outside Maltese waters or from migrants being held hostage or being tortured,” she told Times of Malta during a recent short trip to Malta.\nMs Estefanos left Eritrea some 30 years ago for Sweden, where she works as a journalist and refugee advocate. Since 2008, she has been fielding calls from Eritreans in peril on her weekly radio show Voices of Eritrean Refugees.\nOn the other end of the line, she says, are the desperate cries for help of fellow Eritreans, many of whom end up in Malta after having fled the repressive northeast African country.\n“I started doing work as a journalist, being critical of the Eritrean government, but eventually moved into migration. It changes your life when you actually speak to these people like I have. It is transformative. You just aren’t the same afterwards,” she adds.\nSome of her callers are kidnapped, tortured, raped or held hostage by traffickers somewhere between the desperate Sinai Peninsula in the east of the African continent and the Libyan coast to the north. And, for many, she is their only hope of survival.\n“My number is handed out to migrants boarding boats from Libya and graffitied on the walls of Libyan detention centres,” she notes.\nMy number is handed out to migrants boarding boats from Libya\nIn a way, her radio show has, for years, filled the gaps in the EU’s migration policy, offering support from those trying desperately to get into Europe in much the same way other NGOs do, except she does it through broadcast media.\nIt has also evolved into a support network for those who made it to the EU but are living on fringe.\n“Calls come from Malta too. They are mostly stories of rejection, discrimination, failed resettlement attempts…” she remarks.\nThe hardest, however, are distress calls from out at sea.\nWhen a call with a 00888 number comes in, that means the caller is using a satellite phone and she knows this means they are bound to be calling from a sinking boat filled with wary and terrified migrants.\nThe first phone call she received from a boat in distress was eight years ago from an overcrowded vessel with about 425 people on board. They had close to no fuel, water or food and had already been stuck out at sea for days.\nMs Estefanos recalls how she remained in close contact with the migrants as the Maltese and Italian authorities quarrelled over who should be responsible for conducting a rescue operation.\nIn Malta, she met with some of the migrants who were eventually brought here, along with others who resettled on the island over the years. But her visit also gave her the opportunity to offer closure to the families of thousands of missing Eritreans.\nShe says a cache of tens of thousands of DNA samples held in Malta could be used by the International Commission for Missing Persons to bring an end to the suffering of so many Eritrean families.\nMs Estefanos hopes to gain access to the Maltese files containing the DNA records of unidentified deceased migrants brought ashore by Maltese rescuers over the years.\n“A big part of the work I do is about offering closure to those who have lost someone dear to them through migration and human trafficking.\n“This would be a big step in that direction,” she said.", "comment_count": 0, "id": 729}, {"keywords": "", "author": "", "article_body": "Updated at 4.45pm with Simon Busuttil remarks\nRamona Frendo has been cleared to serve as a judge at the European Union's general court, the government announced on Wednesday.\nAn expert panel had found that Dr Frendo satisfied the necessary criteria to serve in the role, with the decision confirmed by member state government representatives which met in Brussels on Wednesday.\nDr Frendo's nomination means Malta will be represented by two judges in the general court and another in the EU's Court of Justice.\nIn a statement, the government said it was confident that Dr Frendo had all the necessary competencies to effectively fulfil this key position to the best of her abilities.\nShe replaces judge Peter Xuereb, whose nomination to the European Court of Justice was recently approved, at the EU General Court. \nBusuttil abstention\nLast November, the Times of Malta had reported that the panel assessing Dr Frendo's nomination included former Opposition leader Simon Busuttil.\nDr Busuttil told Times of Malta that he had abstained from Dr Frendo's hearing and was not present for it.\n\"I took my decision unilaterally and without any request from anyone,\" he said. \"I believe that in the circumstances, abstaining from this decision was the right thing to do and consistent with my belief that justice must only be done, but must be seen to be done.\"\nThe Nationalist Party MP also congratulated Dr Frendo on her appointment.\nTwo decades of legal experience\nA Żejtun local, Dr Frendo’s legal experience spans 22 years’ practice in the Maltese legal system, covering litigation and legal expertise in civil, insurance, industrial, family and criminal law, complemented by consultancy and drafting services to commercial entities and public authorities.\nShe served as member on the Justice Reform Commission 2013, responsible for a critical and comprehensive analysis of procedural and substantive law, with a view to improving judicial services, both qualitatively and quantitatively.\nShe also had practical experience of European institutions when she served as chair of the Visa Working Party during the Maltese Presidency of the Council in 2017.\nDr Frendo had openly endorsed the Labour Party in the 2013 general election, also accepting to appear on the PL's billboards.", "comment_count": 39, "id": 730}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man arrested during a police operation targeting a Qormi residence last month was granted bail pending the ongoing compilation of evidence over aggravated drug possession and relapsing.\nClayton McKay, a 25-year old Qormi resident, was one of three men taken into custody when police, reportedly investigating suspicions of bomb-making activity, zoomed in on the residence.\nThe search at the premises, reportedly leased out by the accused to migrants, had yielded no explosives but had led to the discovery of some 163 grams of heroin and 91 grams of cocaine in the suspect’s possession.\nThe man was subsequently arraigned, pleading not guilty to aggravated drug possession and relapsing, and was remanded in custody.\nAlmost two weeks later, as proceedings continued, Inspector Keith Arnaud testified about the circumstances which had led to the accused’s arrest.\nAnother witness, one of the other men who had been inside the property at the time of the police raid, refused to testify after being cautioned against possible self-incrimination.\nAt the end of the session, the court, presided over by magistrate Doreen Clarke, upheld a fresh application for bail against a deposit of €6,000, a personal guarantee of €10,000, an order to sign the bail book daily and to abide by a curfew.\nLawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 731}, {"keywords": "", "author": "", "article_body": "Malta International Airport is one of seven airports acquiring the ‘Best Airport in Europe’ award in its size category in the Airport Council International’s prestigious Airport Service Quality (ASQ).\nAirports Council International announced the winners on Wednesday following the rating of 346 airports worldwide by more than 650,000 departing passengers throughout 2018.\nThe main aim of the ASQ awards is to recognise airports that go the extra mile to provide guests with excellent service and outstanding terminal facilities.\nWhile 2016 and 2017 saw MIA come in third and second place respectively, an all-time high passenger satisfaction score for 2018 pushed the airport to the top rank of a group consisting of 35 peers, each hosting between five and 15 million passengers annually.\n“At a time when the customer experience is becoming an increasingly important aspect of what a business has to offer, it is extremely rewarding to see that our passengers have once again expressed their satisfaction with the service delivered as they travelled through our airport, leading us to win the coveted Best Airport in Europe award,” MIA’s CEO Alan Borg said.\nAt 4.37, MIA’s overall passenger satisfaction score during peak season, stretching from July until September 2018, was significantly higher than the European average of 3.98. The airport achieved particularly high passenger scores on indicators including courtesy of airport staff, terminal cleanliness, and its La Valette lounges.\nThe other Best Airport in Europe awards went to airports in the United Kingdom, Spain, Portugal, Norway, Russia, and Iceland.", "comment_count": 44, "id": 732}, {"keywords": "", "author": "", "article_body": "Malta will ratify a protocol to the Convention on the Elimination of all Forms of Discrimination Against Women (CEDAW) in the coming days, granting additional rights to women who have suffered discrimination. \nThough Malta ratified the UN convention in 1991, it had yet to do so with an optional protocol allowing women who have been discriminated against and who have exhausted all local remedies to take their case before a CEDAW investigative board.\nAnnouncing the ratification on Wednesday, Equality Minister Helena Dalli said the board's conclusions, while not legally binding, had political weight that was difficult for any country to ignore.\nThis, Dr Dalli said, meant the country would be increasing scrutiny on itself on issues of equality and discrimination against women.\nDr Dalli was addressing a conference organised by the Commission for the Promotion of Equality to mark International Women's Day on March 8.\nHighlighting the importance of work and career opportunities to ensure gender equality, the minister said more women had entered the workforce in recent years, but that there remained a need for greater transparency on wages to ensure equal pay for equal work.", "comment_count": 3, "id": 733}, {"keywords": "", "author": "", "article_body": "A 53-year-old man from Mosta was grievously injured on Wednesday when he was hit by a car in his home town.\nThe police said the accident happened in Triq il-Kostituzzjoni at 10am.\nThe victim was hit by a Toyota Passo that was being driven by a 78-year-old man from Mosta. He was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 734}, {"keywords": "", "author": "", "article_body": "A public sector reform the government intends to undertake would open the doors to persons of trust being allowed to represent Malta within highly technical and specialised EU-wide fora, PN representatives have warned.\nSpeaking at a press conference on Wednesday, MEP candidate Peter Agius said the government ought to train public sector employees on European negotiations, with greater emphasis on soft skills related to EU decision-making.\nThose selected to represent Malta in key forums should be referred to the parliamentary committee for European affairs for approval, he added, with minimum criteria for experience in the related policy area established.\nDr Agius, MP Karol Aquilina and local council candidate Pierre Portelli were presenting the PN’s proposals for a more competent public sector.\n“It is essential that the best qualified people represent Malta in all these working groups,” Dr Agius said.\n“To do so we need to promote competency rather than likeability, qualifications and experience rather than political partisanship.”\nAs an EU member state, Malta has a seat in around 210 working groups within EU institutions. These groups shape policies and government positions following negotiations with MEPs in parliament.\nDr Aquilina warned that the government’s proposed public sector reform would cast shadows of impartiality over people chosen to represent the country in such groups.\n“Public sector employees deserve much better,” he said.\nThe PN’s also made proposals for people chosen for key EU-related posts to appear before a parliamentary committee and for a special committee session to focus on Gozo and how it is being represented within EU institutions.", "comment_count": 8, "id": 735}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 5.50pm\nTwo Maltese men allegedly acted as intermediaries in an international car smuggling racket cracked open by Italian and Maltese authorities, police sources confirmed on Wednesday.  Police in Ragusa, Sicily said they had made several arrests in the early hours of Wednesday morning after smashing a criminal ring which involved stealing luxury cars and other vehicles in Italy and then transferring them to Libya through Malta.\nSome 40 people were arrested during the operation, named ‘Coast to Coast’ by investigators.\nThe operation involved some 150 officers, who searched 50 locations in several Italian cities, with investigators also travelling to Malta to work hand-in-hand with Maltese police.\nThe two Maltese accomplices were believed to be involved in liaising between the Italian car thieves and Libyan dealers who would sell the vehicles on order.\nPolice sources told the Times of Malta that phone intercepts used in the investigation revealed how Libyan nationals would place orders for either luxury or commercial vehicles, and the Italian organised crime group would then provide these a few weeks later after having stolen them or purchased them and reporting them stolen as part of a wider insurance fraud racket. \nA multi-year investigation\nThe investigation is believed to have first started back in 2013 following a string of reported car robberies and suspicious car insurance claims.\nTwenty-one trucks, a cement mixer, a compactor and eight cars, all stolen, were seized in Sicily shortly before they were due to be shipped to Malta as part of the racket earlier this week.\nFake documentation and irregular license plates were also found during the police crackdown.\nMeanwhile, Maltese police sources confirmed that a number of vehicles, at least three cars and one truck which had been stolen in Italy had been found in Malta by local authorities following collaboration with their Italian counterparts.\nThe sources said the two Maltese nationals were known to the authorities and believed to be involved in a number of different criminal enterprises. This included dismantling some of the luxury vehicles and selling them for parts on the Maltese black market.  \nIntercepted phone calls\nItalian police released a recording of an intercepted phone call in which a man, who the sources identified as a Maltese national, and an Italian interlocutor discuss collecting a BMW X5 off the catamaran between Malta and Italy.Meanwhile, Italian police said they had also seized a cache of stolen and tampered with license plates and car registration documents, an unlicensed fire arm, and cash. \nThe network is suspected of having moved around 36 vehicles from the ports of Pozzallo, Augusta, Catania, Palermo, Salerno and Naples, passing through Malta with Libya as their final destination. \nThe stolen vehicles requested by the Libyan are believed to have a street value in excess of €1 million. A number of these vehicles are already on their way back to their rightful owners, the Sicilian police said. \nMaltese police said the main Libyan involved had already been arrested in Italy back in 2016, when he was caught with forged ID documents behind the wheel of a luxury yellow sports car that had been reported stolen in Milan.", "comment_count": 90, "id": 736}, {"keywords": "", "author": "", "article_body": "Updated at 5.45pm with Emirates statement\nFire tenders were deployed alongside an Emirates Boeing 777 aircraft on Wednesday afternoon after smoke was seen coming out of its rear doors while it was on the tarmac at Malta International Airport.\nThe incident happened shortly after the plane landed from Dubai/Larnaca. \nNo passengers were on board the aircraft at the time.\nMIA said no one was injured. Airport operations were temporarily suspended but quickly returned to normal, an airport representative said.  \nHorizon, a specialist aviation Facebook page, said incoming aircraft were put in holding pattern until the situation was resolved.\nAn Emirates spokesperson said the plane had developed a technical fault. Engineers were working to clear the flight for its return flight, they said. \n\"Emirates apologises for the inconvenience caused to our passengers. The safety of our passengers and crew is of the utmost importance,\" the spokesperson said. \nA fire truck parked close to the plane that caught fire. Photo: Mark Zammit Cordina", "comment_count": 6, "id": 737}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two brothers who allegedly set fire to a car belonging to another sibling were denied bail upon their arraignment on Wednesday.\nRoderick Grech, 34 and Errol Grech, 39, who share the same home at Zejtun, were arraigned on Wednesday in the wake of the alleged arson attempt early on Tuesday morning.\nThey pleaded not guilty to having set fire to their brother’s car, causing voluntary damage and causing its owner to fear violence. Roderick Grech was separately charged as a recidivist.\nProsecuting Senior Inspector Trevor Micallef pointed out that the alleged victim feared his brothers, especially Roderick. In fact, this had not been the first incident between the siblings.\nEven the two accused had been at loggerheads in the past but appeared to have since resolved issues between them, the prosecution pointed out.\nDefence lawyers Franco Debono and Martin Fenech countered that the allegations revolved upon a family matter and that the facts alleged by the prosecution were being contended.\nIt was further pointed out that the brother of the two accused had moved out of the family home and that the duo were willing to abide by any conditions imposed by the court to steer clear of the alleged victim.\n“Hopefully this family affair will be resolved amicably,” Dr Debono declared.\nAfter hearing submissions by both parties and in view of the circumstances of the case, Magistrate Neville Camilleri turned down a request for bail declaring that the court was not satisfied, at this stage, that if the accused were to be granted bail they would abide by court conditions, besides the fear of tampering with evidence.", "comment_count": 0, "id": 738}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An airline passenger held at Malta International Airport with some €200,000 of undeclared cash in his possession was granted bail after pleading not guilty upon his arraignment on Wednesday.\nOmar Azumi, a 40-year old Maltese national residing in the UK, was singled out by customs officials on Monday just as he was about to board a flight to Istanbul. A customs sniffer dog had reportedly alerted officers to the excessive cash.\nThe sum of €10,000, the maximum amount allowed by law, was returned to the man. The rest of the cash was seized by customs authorities.\nUpon his arraignment, Mr Azumi pleaded not guilty to having breached cash control regulations and made a request for bail.\nProsecuting Inspector Keith Vella did not object to the request as long as strict conditions were imposed so as to ensure that he would attend every court hearing, given the fact that he resided abroad.\nMoreover, the prosecution requested that the bail bond would be proportionate to the 25% fine which the accused could face upon conviction. In this case the sum would stand at around €50,000, the inspector said.\nDefence lawyer Arthur Azzopardi pointed out that in this case there were no civilian witnesses to testify and moreover, the employer of the accused had already justified the legitimate origins of the funds.\nAfter hearing these submissions, the court, Magistrate Neville Camilleri, upheld the request for bail, making it clear however that at this stage he would not grant the accused permission to travel abroad. That would be a matter to be decided by the court which would be assigned the case, the Magistrate explained.\nIn view of the nature of the charges and after hearing submissions in this regard, the court granted bail against a deposit of €5,000, a personal guarantee of €15,000, and an order to sign the bail book twice a week and to abide by a curfew between 8pm and 6am.", "comment_count": 0, "id": 739}, {"keywords": "", "author": "Ivan Martin", "article_body": "President Marie-Louise Coleiro Preca would not comment on whether her successor George Vella would replace her at the helm of the Constitutional reform steering committee.\nThe government announced on Tuesday it was nominating Dr Vella to take over from Ms Coleiro Preca as Malta's tenth head of state when she vacates the position next month. \nThe government statement, as well as a tweet by Prime Minister Joseph Muscat both pointedly did not refer to President Coleiro Preca’s current role at the helm of the steering committee for a Constitutional convention.\nWatch: Constitutional reform committee to handle reform \nPresident Coleiro Preca had signalled her intention to continue chairing the committee, which is tasked with laying out the ground work ahead of a highly anticipated Constitutional reform.\n\n\n\nSources however, have indicated that Dr Vella had intimated his wish to take over the reform when he is sworn in on April 4.\nAsked about this, President Coleiro Preca on Wednesday said: “I think we should let the government communicate its decision on this. I’m sure we will hear about this soon enough.”\nShe would not comment further, saying she preferred not to weigh in on the matter.\nRead: Calls for referendum on Constitutional reform.  \nPresident Coleiro Preca was fielding questions from Times of Malta at the fringes of an award ceremony for schools and companies that collected plastic bottle caps as part of an environmental campaign.  ", "comment_count": 9, "id": 740}, {"keywords": "", "author": "", "article_body": "Jeremy Camilleri has stepped down from his role as secretary of the Government and Parastatal Workers' Section of the GWU.\nThe union said Mr Camilleri in his resignation letter had said he was stepping down with regret because he felt the time had come to pursue other challenges.\nHe would continue to help out until a successor is appointed. \nThe union thanked Mr Camilleri for his many years of service. ", "comment_count": 10, "id": 741}, {"keywords": "", "author": "", "article_body": "A notary has been ordered to pay €90,000 in compensation after a court established that he was negligent in his dealings with a couple which found itself contractually bound to sell a property to two different buyers.\nThe case was instituted by Ruby and Brian Donlevy against notary Anthony Grech Trapani.\nThe case centred on a villa in Madliena, which Ruby Donlevy had decided to sell.\nA promise of sale agreement, subject to bank loans, was signed on March 8, 2013 with Roderick and Fiona Micallef before notary Sam Abela. The contract was for five weeks, which was extended by two weeks. The buyers then requested an extension of a further two weeks to allow them time for the bank to confirm whether or not they had been granted a loan. The seller refused.\nNotary Grech Trapani had assisted the Donlevys in the process leading to the promise of sale agreement. When they refused to extend the agreement, they informed him.\nRuby Donlevy claimed that Notary Grech Trapani told her that the promise of sale agreement was now void and that she could put the property back on the market, without informing notary Abela. He even suggested a new potential buyer – Ro’Anna Borg. A promise of sale agreement was eventually also signed with Ms Borg. The contract was signed before notary Grech Trapani.\nBoth promise of sale agreements had been duly registered.\nThe Donlevys were then informed by notary Abela and their estate agent that the first promise of sale agreement was still valid at law and the Micallefs still wanted to buy the property.\nEventually the parties to both promise of sale agreements filed for warrants of prohibitory injunction to stop the transfer of the property. Neither was prepared to surrender his contract.\nThe Donlevys had talks with both, in search of a solution and eventually compensation of €80,000 was paid to the Micallefs. €10,000 were paid to the Ro’Anna Borg to cover her legal costs. She eventually bought the property.  Notary Grech Trapani published the sale contract.  \nDr Grech Trapani denied ever having been granted any mandate by the Donlevys. He insisted that it was Ruby Donlevy who had informed him that the promise of sale agreement with the Micallefs had fallen through and she therefore wished to put the property back on the market. Therefore, he said, it was she who had misinformed him. He held the Ruby and Brian Donlevy responsible for professional defamation.\nIn his testimony notary Grech Trapani said the first promise of sale was no longer valid owing to procedural issues. Furthermore, the Donlevys had had several courses of action open to them instead of having resorted to the compensation of €80,000. He could not understand how the Donlevys had asked him to eventually publish the contract of sale to Ro’anna Borg when they intended to sue him for alleged negligence.\nMr Justice Lawrence Mintoff said the documents and e-mails produced in court showed that notary Grech Trapani was involved in all stages of the sale of the property, even before the first promise of sale agreement was signed.\nHe was also present when that first promise of sale agreement was signed before Notary Abela and therefore should have been well aware of its terms. He also played a crucial role in the conclusion of talks with the eventual buyer Ro’anna Borg.\nMs Borg’s testimony showed that it was notary Grech Trapani who had told her that the first promise of sale agreement was void. The evidence showed that such advice had been given without the necessary verification and without the notary having even read the promise of sale agreement of March 8, 2013.\nThe court said that even if the Donlevys had claimed that the first promise of sale agreement was no longer valid, notary Grech Trapani had a professional duty to ascertain himself of the facts and not just take their word and signing the second promise of sale. Under the terms of the first agreement, it was only the prospective buyers, not the sellers, who could void the agreement.\nThere had be no document showing the cancellation of the first agreement by the potential buyers. Nor had their notary even been informed.\nMr Justice Mintoff said notary Grech Trapani had therefore been negligent in his duties. He ordered him to pay €90,000 as compensation to the Donlevys covering their costs of €80,000 and €10,000 also paid as legal costs to Ro’anna Borg. ", "comment_count": 0, "id": 742}, {"keywords": "", "author": "", "article_body": "Updated 2.39pm with Liquigas statement -\nThe consumer authority and energy regulator are upping checks on gas cylinders and regulators, after three separate gas-linked fires were reported during the past days.\nA 70-year-old man died as he tried to escape a fire sparked by a gas heater malfunction, and a few days later a man in Paola was hurt when a gas cylinder in his home exploded. On Tuesday, firefighters put out a gas-lit fire in Qawra before anyone was hurt.\nIn a statement, the Regulator for Energy and Water Services said that the three incidents did not seem to be related, but that it was nevertheless working with the MCCAA to ensure cylinders and regulators met safety standards.\nChecks and lab tests on regulators and valves to ensure they meet EU specifications are expected to take 15 days, REWS said. Additional checks on cylinders will see regulators visit filling plants to ensure gas tanks being sold have passed recertification tests.\nAccording to law, cylinders have their valve replaced and must undergo a recertification process every 10 years.\n“The authorities need to emphasise that individuals and companies placing appliances, gas cylinders and regulators on the market, are responsible to ensure that the products conform to all the safety specifications according to legislation,” REWS said.\nLiquigas: Cylinders are regularly checked\nIn a statement, Liquigas said its gas cylinders are regularly tested and certified.\nIt said recent incidents did not involve explosion of gas cylinders. One was the result of a defective appliance and the other was due to a cracked rubber pipe. Another incident is under a magisterial investigation and no further statement can be made until the inquiry is concluded.\n\"All Liquigas green and yellow cylinders are filled in a modern €25 million state of the art facility at Benghajsa, which tests each individual cylinder before being distributed in the market,\" the company said.\n\"Cylinders are also regularly tested and certified by TUV, a technical inspection association that conducts testing to international standards and directives that are endorsed by leading quality and safety marks.\"\nThe Maltese authorities also oversee the filling operations and have always found that Liquigas cylinders comply with all regulations, it said. \nCustomers were urged to ensure that appliances are well maintained and that the regulator and rubber hose are in a good condition.\n\"Some regulators on the market are not of good quality. In any case, regulators should be replaced every 10 years. The old regulator should be disposed of immediately so that it is never used or installed again. Regulators are precisely set by the manufacturer to control the pressure of the supply, and therefore they must not be adjusted privately,\" the company added. \nOnly hoses specifically manufactured to serve as a gas pipe should be installed. These should be regularly checked for possible cracks and, moreover, replaced every five years. ", "comment_count": 36, "id": 743}, {"keywords": "", "author": "", "article_body": "Updated at 11.56am with ministry statement\nAlmost one in every three say their family cannot afford a one-week yearly holiday away from home and one in every seven would be unable to cope with an unexpected expense of €675.\nThe figures, which are nevertheless lower than their 2017 equivalents, emerge from a Europe-wide survey of income and living conditions, which measures statistics on households’ income, health, work and material deprivation.\nIn 2017, 33.9 per cent had said they could not afford a week-long holiday (compared to 30.6 per cent in 2018) and 15.6 per cent said an unexpected expense would financially cripple them (compared to 13.9 per cent in 2018).\nThere were increases in the shares of households who could not make rent (up to 8.1 per cent from 6.5 per cent) or keep their house warm (7.6 per cent from 6.3 per cent).\nWomen were more likely to be unable to afford items or activities on every single quality of life indicator measured by the survey, the National Statistics Office reported.\nThe 2018 European Statistics on Income and Living Conditions Survey found that Malta’s material deprivation rate stood at 8.7 per cent last year – up by 0.7 per cent from the previous year - with severe material deprivation at 3 per cent, down by 0.3 per cent over 2017.\n\nSevere deprivation rates are at a 10-year low, the survey indicates, and have declined from highs reached in 2013 and 2014.\nA household is considered to be materially deprived if it is unable to afford three out of nine items, ranging from affording a holiday to making rent, paying for unexpected expenses, eating meat every other day, keeping a house warm or owning a car, washing machine, colour TV or telephone.\nSeverely deprived households are unable to afford four or more of those nine items.\nLess than five per cent of the 3,823 households which responded to the survey said they could not afford their very basic needs, such as replacing worn-out clothes or having two pairs of shoes.\nJust under seven per cent said they could not afford to meet friends or family for a drink or meal once a month, and roughly double that share – 13.7 per cent – said a leisure activity, such as attending a concert, was too costly for them to afford.\n'Severe deprivation continues to fall' \nThe Family Ministry noted that the country's severe material deprivation rate was now \"just one third\" of where it stood when the Labour government entered office in 2013 and half the EU average of 6.6 per cent. \nMalta's material deprivation rate of 8.7 per cent was also far lower than the EU average of 13.8 per cent, the ministry said, and among Europe's lowest. \nThe ministry acknowledged that more people were struggled to make rental or mortgage payments and said this was \"the result of the country's economic success and influx of foreign workers\". \nIt said the government was introducing social measures to make housing more affordable. ", "comment_count": 53, "id": 744}, {"keywords": "", "author": "", "article_body": "It would be a “retrograde step” if the courts were to be granted discretion to refuse bail in cases of terrorism – even when the time limits set by law would have expired, Chief Justice Emeritus Vincent De Gaetano warns.\nMadam Justice Consuelo Scerri Herrera suggested last month Parliament should consider amending the law so the court would be in a position to strike a balance between “the rights of the accused and those of society”.\nShe made the suggestion in a decree in which she granted bail to one of the two men involved in the alleged hijacking of an Afriqiyah Airlines plane to Malta.\nIn her decree, the judge noted that since the crime was liable to a term of imprisonment exceeding 15 years, bail had to be granted “upon the lapse of 30 months” from the date of the presentation of the charges, that is, when the accused had been arraigned on Christmas Day 2016.\nREAD: Hijacker who forced plane to come to Malta granted bail\nMadam Justice Scerri Herrera also recommended the introduction of electronic tagging of people on bail.\nDr De Gaetano, who sits on the European Court of Human Rights, is very categorical when asked about the judge’s suggestions: “I think it would be a retrograde step, harking back to a Guantanamo mentality. I have only read the decree and, of course, I am not party or privy as to why, 26 months after the arraignment, the bill of indictment has not yet been filed in the Criminal Court against the person in question (nor do I understand the reference to the 30-month term in the decree).\n“If a case is difficult or complex, special resources must be assigned to ensure that the compilation of evidence is conducted efficiently and effectively.\n“There is, however, a positive point in that decree: the reference to electronic monitoring or tagging within the criminal justice system. This could, indeed, help reduce the disproportionate number of people in prison awaiting trial. The Committee of Ministers of the Council of Europe has even adopted, in 2014, a detailed recommendation on this matter,” he replies.\nThe Criminal Code provides for two sets of time limits after which the court must grant the accused bail.\nChief Justice Emeritus Vincent De Gaetano\nArticle 575, which was substantially amended in 1989 following a Constitutional Court judgment in the Lawrence Pullicino case, had struck down the blanket prohibition on bail in the case of very serious offences. It is intended to cater for the peculiarities of the Maltese legal system where a trial by jury usually follows a lengthy judicial inquiry, referred to in Maltese as kumpilazzjoni and which the English-speaking media usually term as ‘compilation of evidence’. (In 1993, Mr Pullicino was sentenced to 15 years in prison after being found guilty of complicity in causing grievous bodily harm followed by death to a person while under police interrogation at the headquarters in 1980. At the time, he was commissioner of police.)\nThe first set of terms – 12 months, 16 months or 20 months, depending on the gravity of the offence a person is charged with – starts running on arraignment.\nIf by the time this term expires the Attorney General has either not filed the bill of indictment in the Criminal Court or has not sent the case to be tried by the Court of Magistrates (as a court of criminal judicature as opposed to a court of criminal in-quiry), then the court must grant bail.\nThe other set of terms – four, eight, 12, 24 or 30 months, again depending on the punishment the crime attracts – applies either when no compilation of evidence has taken place and, therefore, the case is technically a summary one, or there has been a compilation of evidence and although the Attorney General sent the case to the Magistrates’ Court or  filed the bill of indictment in the Criminal Court,  there is as yet no final judgment. Here, too, bail must be granted according to the Criminal Code.\nTrial must be conducted within a reasonable time\nDoes not this amount to merely extending the time one can be held in preventive custody without bail being granted?\n“You cannot look at this simply numerically,” Dr De Gaetano hastens to reply.\nHe points out that the underlying assumption is that a trial, whether a person is on bail or not, must be conducted within a reasonable time. Unless the prosecution can show there are “relevant and sufficient reasons” for not granting bail, then bail must be granted.\nThe law itself mentions some of the circumstances to be taken into consideration when deciding against bail: the seriousness of the offence, the character of the accused, the possibility of absconding or of surreptitiously leaving Malta, the possibility of interfering or tampering with witnesses or with the course of justice.\nMoreover, if bail is denied and a person is kept in custody awaiting trial, Article 5 of the European Convention on Human Rights has been held to require that the authorities display “special diligence” in the conduct of the proceedings, the former chief justice notes.\nThe reasonable time and special diligence requirements are not intended solely for the benefit of the accused but are also in the interest of society in general and of the victims of crime. The Strasbourg Court had declared in a case against France in October 1989 that the reasonable time guarantee in Article 6 of the Convention “underlines the importance of rendering justice without delays, which might jeopardise its effectiveness and credibility”.\nSome could argue that a complex or difficult case may necessitate the terms linked to bail to be suspended.\nHowever, Dr De Gaetano points out that the terms can only be suspended “in the very limited instances” mentioned in the Criminal Code, such as when a matter is referred to a court having constitutional jurisdiction, when letters rogatory are sent abroad or when the accused himself asks for an adjournment.\n“The complexity or difficulty of a case does not dispense the authorities from the ‘special diligence’ requirement when a person is detained without bail,” he remarks.\nDifficult and complex cases, Dr De Gaetano continues, require special resources, structures and proceedings to enable the State to process them within a reasonable time.\n“In other words, they cannot be left to be dealt with on the same conveyor belt as ordinary cases.”\nHe notes that the compilation stage and subsequent proceedings before either the Court of Magistrates as a court of criminal judicature or before the Criminal Court (trial by jury) are, for the purpose of the Strasbourg case law, regarded as one level of jurisdiction, the second level being proceedings before the Court of Criminal Appeal. Malta has no third level, such as supreme court or cassation appeals, as in other jurisdictions.\n“As a rule of thumb, and in line with the Strasbourg case law, criminal proceedings lasting between three and four years at one level of jurisdiction and for more than four years at two levels of jurisdiction are potentially capable of raising reasonable time issues under Article 6 of the European convention,” he cautions.", "comment_count": 1, "id": 745}, {"keywords": "", "author": "", "article_body": "A 37-year-old construction worker was seriously injured in a fall at a construction site early on Wednesday.\nThe police said the worker fell from a height in Tower Street, Msida, at about 7.30am.\nThe man was rescued by personnel from the Civil Protection Department and rushed to hospital. ", "comment_count": 2, "id": 746}, {"keywords": "", "author": "Ramona Depares", "article_body": "Few Norwegians know much about Malta, except that it usually attracts zero points in the Eurovision Song Contest and that its history is connected to the Knights but that is set to change thanks to a concerted drive to export Maltese literature to this Nordic country.\nTranslator Kristina Quintano was the driving force behind a cultural exchange that last week saw author Trevor Zahra attend a number of events at the annual literature festival Translated Days.\nMalta’s participation was made possible thanks to the support of the National Book Council Malta, which was also present for talks with Norwegian publishers about the publication of more Maltese authors in the Nordic country.\n“We are giving high priority to the export of Maltese literature and there is a significant investment being made in this regard by the National Book Council,” chairman Mark Camilleri said, adding he hoped to build upon this initiative in the near future.\n“As a council, we believe it is vital for Malta’s authors to be present in foreign markets. We have met with a lot of foreign publishers. Some meetings yield positive results and others less so due to the highly-competitive nature of the industry,” he said.\nMr Camilleri added that Maltese authors were being very well-received in smaller markets, such as Italy, but that the bigger markets, like the UK, France and Germany remained challenging due to the sheer number of writers.\n“We are making inroads, al-though it is a gradual process. The initiative would not be possible at all without public funding but we intend to continue giving it priority,” he said.\n“It is worth noting that the council continues to support the author even after a deal is struck with a foreign publisher, aiding with the actual marketing, which is just as vital to the whole process.”\nThe Norwegian market is one that is turning out to be “immensely receptive” to Maltese literature, with Mr Camilleri pointing out that a number of meetings he attended during last week’s festival had already translated into publishing deals for some Maltese writers in the near future.\nHis words are echoed by Ms Quintano, who is based in Norway and specialises in the translation of Maltese books into Norwegian.\nVital for Malta’s authors to be in foreign markets\n“It has always been a source of sadness to me that Norwegians are largely unfamiliar with anything connected to Maltese culture, apart from the recent topical political issues. I viewed this festival as a chance to rectify this, in part,” she remarked.\nMs Quintano has already translated works by Mr Zahra, Pierre Mejlak, Walid Nabhan, Clare Azzopardi, Immanuel Mifsud and Lou Drofenik into Norwegian.\nKristina Quintano, Trevor Zahra and Mark Camilleri in front of The House of Literature in Oslo.\n“Mr Zahra’s Il-Ħajja Sigrieta tan-Nanna Ġenoveffa, in particular, has been very well received here. Together with Mr Nabhan’s and Mr Mejlak’s works, it has been the recipient of a grant that sees 600 copies of the book distributed across all libraries in Norway,” she added.\nIl-Ħajja Sigrieta tan-Nanna Ġenoveffa was first published in Norway in 2017 by one of the country’s leading publishing houses for translated literature.\nThe same house published Norwegian translations of works by Aleksijevitsj, Poe, Doyle and Dostojevskij. During his visit to Norway, Mr Zahra had the opportunity to meet up with his Norwegian publisher for the first time, an experience he described as “highly satisfactory and promising”.\n“We discussed future publications and I am highly encouraged with the results yielded from this meeting. It is very gratifying to see books like Nanna Ġenoveffa striking a chord with Norwegian readers because the book – apart from the humour of its narrative – actually offers insight into Maltese history and our cultural identity,” he said, adding that besides being present in all public libraries in Norway a further 1,000 copies had also already been sold to book stores across the country.\nEurope is undergoing a revival in popularity with respect to literature originating from countries that are not the UK, with a renewed interest in smaller cultural identities such as those depicted in books like Nanna Ġenoveffa.\nTranslated Days, which takes place every three years at the House of Literature, in Oslo, is one of Norway’s biggest literature festivals, bringing together translators, authors, editors and publishers from across the world to discuss facets of the translation industry.\nThe festival offered an opportunity to Mr Zahra not only to carry out book-signings and networking but also a number of readings from Nanna Ġenoveffa itself, both during the official events and at other social evenings organised around the festival.\n“I read some excerpts in Maltese myself because I wanted to give the audience an idea of what our language sounds like,” he said.\n“I was also very flattered to have one of Norway’s most famous actors and audio-book readers, Ola B. Johannessen, present to carry out readings in Norwegian. His voice is immediately recognised across Norway, so this gave an added dimension to the readings.”\nMr Johannessen also carried out a reading of the Norwegian translation of Il-Mejda tal-Mogħdija, a short story by Mr Mejlak, during a literary salon organised by Ms Quintano.\nThe event was attended by publishers, writers and also by the Norwegian consul to Malta, Petter Larsen, and a number of Maltese expats.", "comment_count": 3, "id": 747}, {"keywords": "", "author": "Denise Grech ", "article_body": "Almost two weeks after a storm wreaked havoc across Malta, old trees at the Santa Maria Addolorata Cemetery remain uprooted, blocking paths and leaving graves damaged.\nGale force winds uprooted pine and Aleppo trees during the storm two weekends ago, with the largest public cemetery on the island bearing the brunt of the brutal weather.\nThe weekend storm saw gusts reach a record of 72 knots or 133 kilometres per hour – the worst since 1982 – and caused infrastructural damage in its wake. The damage was mostly in felled trees, demolished walls, water tanks, PV panels, collapsed roofs and balconies and downed masts and cables.\nThe cemetery, which is being restored, was littered with uprooted trees when the Times of Malta visited on Tuesday. Questions sent to the Health Ministry regarding the extent of the damage remained unanswered by the time of writing.\nThe church of St Philip, in Senglea also suffered extensive damages.\nSt Philip’s church in Senglea suffered extensive damage.\nSt Philip church in Senglea suffers extensive damages\nFr Antoine Farrugia, who takes care of the church, said the storm destroyed the windows forming part of the dome.\n“The paintings in the church were completely exposed. Five windows were found broken and falling stones made a complete mess within the building,” he said.\nThe strong winds tore a wooden chandelier off its hinges and badly damaged the membrane waterproofing treatment, causing leakages into the church.\nThe damage comes as a double blow as restoration works on the 300-year-old building had started a few months prior to the storm, after the church received funds from the Cottonera Rehabilitation Committee.\n\nFr Farrugia said the government would be stepping in to help repair the damage, although an estimate of the cost had yet to be completed.\nAt present, Mass is being celebrated in the sacristy as works continue. Thankful that the damage caused was not bigger, Fr Farrugia expressed concern that the church might by negatively impacted in the future.\n“We are mostly worried because we want to preserve it for future generations,” he said.\nThe Senglea church was not the only one to be affected in the Three Cities area.\nA statue on the façade of St Paul’s church in Cospicua ended up the worse for wear, with the statue’s head being blown away by the winds.", "comment_count": 3, "id": 748}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Maltese authorities have made “very limited improvements” after rule of law shortcomings were flagged by the European Commission, its vice-president, Jyrki Katainen, said.\nIn comments to the Times of Malta on the fringes of a conference organised by Nationalist MEP Roberta Metsola, Mr Katainen, who is also European Commissioner for Jobs, Growth, Investment and Competitiveness, said that an analysis of last year’s country-specific recommendations showed that not much had changed despite the Commission’s advice.\n“Unfortunately, I have to say that there was very limited improvement, so we keep encouraging [the Maltese authorities]. We are ready to engage in open discussion on what to do because it is so important for this country, for its citizens and for the rest of Europe,” he said.\nMr Katainen has, in recent years, spoken openly about the importance of safeguarding the rule of law in all member states, insisting last year there could be “no compromise” on this and that the issue was even more worrisome than Brexit.\nWe want to help Maltese authorities address these issues\nAsked about his views on the Maltese situation in light of criticism by Brussels that the rule of law could be in jeopardy, he pointed out that the Commission has been encouraging the Maltese authorities to update the judicial system, ensure that the judiciary was completely independent and that it could function properly.\nHe added that Malta had been urged to “accelerate the work on addressing money-laundering and corruption”.\n“We want to help the Maltese authorities to address these issues because Malta is part of the EU and every single one of the member states is responsible for the other citizens in Europe as well as other member states.\nRead: What rule of law experts said about Malta\n“What happens here has consequences on the rest of Europe,” Mr Katainen remarked.\nHe noted that while economic growth was “always good”, it was crucial to ensure this occurred in a sustainable way.\nEuropean Commission vice-president Jyrki Katainen with Nationalist MEP Roberta Metsola. Photo: Chris Sant Fournier\n“Thus, for instance, the fast-growing financial sector in Malta is good news for those who need financing for investment but, at the same time, the Commission encourages the Maltese authorities to take care of banking supervisory activities. We have, therefore, encouraged the authorities to pay attention to the regulatory and supervisory capacity in the banking sector,” he said.\nHe added that a fast-growing gaming sector could also be a source of concern, quickly pointing out that “nobody wants to demonise the sector” and insisting that this had to be monitored closely “to avoid unfortunate consequences if something bad happens”.\nDr Metsola told the conference that a “one-size-fits-all approach to EU funding and taxation issues did not and could not always work, especially when taking the country’s insularity and economies of scale into consideration”.\nAddressing business leaders, stakeholders and industry representatives during the event, Dr Metsola yesterday insisted on the need for an EU regulatory environment for Maltese businesses to grow.", "comment_count": 19, "id": 749}, {"keywords": "", "author": "", "article_body": "Updated 10.48am - \nAn AFM patrol boat rescued 87 migrants off Lampedusa overnight and brought them to Malta on Wednesday morning.\nThe Armed Forces of Malta said it was informed by Rome rescue centre on Monday evening about the presence of the wooden boat with 87 migrants on board. The boat was located some 30NM south of Lampedusa.\nAn Italian naval asset operating under Frontex, the EU border control agency, was dispatched to assist. However the vessel was unable to provide any assistance due to technical faults.\nTimes Talk: 'They say we help smugglers... but they're the ones financing them'\nAn AFM patrol craft rescued the migrants last night.  \nThis was the first major rescue of migrants by the AFM since 180 were picked up at the end of December and 69 more were rescued a few days previously. Most were later transferred to other EU countries along with other migrants rescued by NGO rescue ships. \nPrime Minister Joseph Muscat announced on Wednesday morning that another group of migrants brought to Malta a few weeks ago had left for France.\nNo further details were immediately available.\nMigrants leaving for France.", "comment_count": 0, "id": 750}, {"keywords": "", "author": "", "article_body": "The following are the stories making the front pages of Malta's newspapers on Wednesday.\nMost of the newspapers lead with the formal announcement that George Vella has been nominated to become Malta's next president.\nTimes of Malta also reports that over €3m of the €13m stolen in a cyberattack on Bank of Valletta have been recovered.\nMaltaToday reports that the courts cannot attack the new rules for means testing of tenants. \nThe Malta Independent quotes a European Commissioner saying that conditions must be equal and fair for both local and third-country workers. It also quotes the Energy Ministry saying there is no reason to doubt the safety of gas cylinders. It follows a spate of fires blamed on gas cylinders.\nIn-Nazzjon quotes a statement by the PN that the prime minister in nominating George Vella for the presidency lost an opportunity to instil credibility in the national institutions.\nl-orizzont devotes the whole of its front page to the nomination of Dr Vella. ", "comment_count": 0, "id": 751}, {"keywords": "", "author": "Ivan Martin", "article_body": "Bank of Valletta has recovered more than €3 million of the €13 million stolen by hackers last month, the bulk of the rest being frozen in foreign jurisdictions, financial services industry sources said.\nThe sources said that between €3 million and €4 million are in the process of being returned to the bank. A large chunk of the remaining stolen money has been traced in a number of jurisdictions, including the UK, the US, Hong Kong and the Czech Republic.\nWhile the sources were confident the money would be returned to the bank “eventually”, they acknowledged that some of the stolen funds might never be recovered.\n“You have to appreciate that legal proceedings have started in some jurisdictions and the funds frozen there will not be released until these have been concluded,” the sources pointed out.\nThe bank said €13 million were stolen during a cyberattack on February 13, which led the BOV to temporarily take its services offline.\nThe hackers were dubbed EmpireMonkey by the investigators due to the use of a hacking tool known as PowerShell Empire, which allowed the group of hackers to move about in the bank’s systems after having gained access.\nSources close to the investigators told Times of Malta one potential suspect was the international hacking organisation known as Cobalt Gang, which wreaked havoc on the international banking sector.\nIt is believed to have stolen as much as €1 billion from banks in as many as 40 countries in recent years.\nThe sources said the group had been known to infiltrate international banks’ ATMs, card-processing systems and the international interbank payment messaging network SWIFT before executing attacks.\nA review of last month’s breach has indicated that the hackers could have been attempting to infiltrate the bank as far back as October 2018.\nREAD: BOV hackers ‘planned back door opportunity’\nSimilar ‘phishing’, a method used to break into a computer system via electronic communication, had first been detected locally about four months previously. This had the same digital fingerprint as the hacking group believed to have carried out the heist, the sources noted.\nThe hacking group is also believed to have targeted another Maltese bank, however, their attempts to infiltrate it appear to have been unsuccessful.\nOne security expert said banks are regularly subjected to such threats and attempts to breach their systems are commonplace.\nThe Times of Malta reported last month that the hackers were believed to have broken into the Autorité des Marchés Financiers, which regulates the French stock exchange, last year.\nREAD: How BOV hackers got away with €13 million\nThey then sent e-mails to Maltese and French entities posing as the regulator and using an innocent-looking e-mail that included the official letterhead and a decoy document that allowed the hackers access to the bank’s systems once activated.\nThe BOV computers where the malicious e-mails were accessed and viewed, inadvertently giving the hackers the keys to the ‘vault’, were identified.\nIt is not clear yet how long the hackers had access to the bank’s systems before the cyberattack was carried out.", "comment_count": 63, "id": 752}, {"keywords": "", "author": "", "article_body": "The Planning Authority’s Executive Council has unanimously rejected two planning control applications for development in Ta’ Leħfar, Triq it-Tamar, Għasri, and Triq il-Qsajjem, Xlendi, both outside the development zone (ODZ).\nIn the Għasri application, the council cited that it strongly objected to the proposal, located ODZ, as it would introduce additional threats to the countryside in the form of a precedent for similar proposals.\nIn the Xlendi application, the authority said that it objected to the proposal not only because it was located ODZ and would introduce additional threats to the countryside in the form of a precedent for similar proposals, but also because it fell within a Natura 2000 site.", "comment_count": 13, "id": 753}, {"keywords": "", "author": "", "article_body": "Valley road widening works in Rabat and elsewhere have caused environmental destruction, the Environmental Resources Authority.\nThe authority said in a statement on Tuesday that following investigations by its Enforcement Directorate, it found that parts of Trejqa tal-Virtù in Rabat and other rural roads were widened considerably into the adjacent valley with some of them now having two lanes to the detriment of the valley which ended up like a roadside trench.\n\nThese works had destroyed the natural environment through the placing of construction material on land which had been colonised with natural vegetation, physically changing the profile of a valley and its natural water flow. The works was being carried out without the necessary permits from the authority.\nThe ERA said its offices on Tuesday issued a verbal stop order to the contractor - Galletta Construction Ltd, as well as to Infrastructure Malta. A formal Stop and Compliance order was later also issued and notified and this was applicable with immediate effect. The Planning Authority was informed.\n\nThe ERA said it was investigating several other cases of interventions on rural and non-rural roads, including at Wied is-Sewda.\nEarlier in the day, Times of Malta reported concerns by an environmentalist that country paths in Wied l-Isqof and Wied is-Sewda were being turned into “highways”.\nAn Infrastructure Malta spokesman said the agency was currently implementing several projects to reconstruct over 40 kilometres of rural roads which had been left in a state of disrepair for many years.\n\n ", "comment_count": 52, "id": 754}, {"keywords": "", "author": "Denise Grech ", "article_body": "Gozitan dental healthcare leaves much to be desired, according to a recent study, with over three-quarters of patients visiting dentists found to have “a high level of unmet needs”.\nThe report, compiled by the University of Malta Medical School and published in the Journal of the Malta Chamber of Scientists, looked at 332 Gozitans who attended a Mobile Dental Unit over a three-month period.\nOf the 332 patients, 76.8 per cent had plaque deposits while 78 per cent required restorative treatment in their gums. Signs of erosive wear were present in 28 per cent of the patients, the report noted.\nMost of the people over 50 had less than 10 remaining functional units, defined in the study as “pairs of teeth in contact”. Two thirds of those over 20 had missing teeth.\nGozitans' oral healthcare was found to be a far cry from the 2020 targets Malta is trying to achieve, the researchers said.\nThe Maltese population in general also found to have decaying oral hygiene, with the researchers noting preschool and schoolchildren had a significant increase in tooth erosion. This erosive wear was significantly associated with an increased consumption of carbonated drinks, flavoured water and packaged juices.\nWhat the research highlights\nThe research results underscore “the need for provision of better dental services in Gozo, re-orientation of existing services to focus on prevention, and introduction of evidence-based preventive strategies in school-children,” the researchers said.\n“The idea is to change the environment surrounding people making it conducive to the awareness surrounding the importance of oral hygiene,” the report noted. Improvements in economic and educational status, accompanied by policies that promote oral health, all bring about long-term improvements in health in general, it added.\nIt also noted that high obesity and diabetes prevalence rates in Malta were associated with a higher risk of dental caries, since they indicated higher sugar consumption. The report recommended working with other professionals such as doctors, nutritionists and teachers to bring about a decline in obesity and diabetes along with dental caries.\n“It is prime time that the Gozitan community is provided with a targeted and enduring oral health programme with the aim of mitigating the findings of this study,” the report said.\nIt recommended health services give more importance to early screening and prevention, and that more hygienists were employed in Gozo to promote preventive interventions.\nMore awareness of the accessibility and availability of dental health services in the population should also be increased, the report said.\nThe research was conducted by Anne-Marie Agius, Ethel Vento Zahra, Emad Alzoubi, Maria Luisa Gainza-Cirauqui, Gabriella Gatt and Nikolai Attard.", "comment_count": 11, "id": 755}, {"keywords": "", "author": "Keith Micallef", "article_body": "One of the oldest surviving buildings in Fgura could face the axe following a decision to remove a basic degree of protection that could have saved it from destruction, a move fiercely resisted by the local council.\nLocated in Triq Hompesch, the dilapidated, privately-owned farmhouse had been granted basic protection (Grade 3) in 1995 on the insistence of the Fgura council.\nThough this does not prevent such buildings from being demolished, if this were to happen the replacement would have to be “in harmony” with the surroundings.\nThe council had asked for the farm to be scheduled because parts of it date back some 200 years and the building boasts vernacular features such as stone slabs and kileb (corbels). The council had expressed its wish to restore the building, reconstruct a niche and transform the farm into a public cultural centre and open space.\nHowever, the building was recently de-scheduled on the orders of the Environment and Planning Review Tribunal, a decision, which took the council by complete surprise.\nIn a Facebook post, Nationalist councillor Mark Lombardo denounced this “shameful” move, which, he claimed, was taken behind the council’s back.\nShameful move taken behind the council’s back\nThe matter was debated at a council meeting last Thursday in which all those present agreed to challenge the decision in an attempt to prevent the old building from being lost forever.\nIt transpires that the request to de-schedule had been made by Landscape Properties Limited and Trevor Borg in a case they instituted against the Planning Authority. They had been seeking to remove the Grade 3 protection since 2009, however, the minister responsible for planning at the time had disagreed with them.\nA fresh request in 2015 was again rejected by the planning authority’s executive council. But, in its recent decision, the environment tribunal noted it had found no evidence of a niche at the farm, nor any concrete proof that the farm had special relevance to the identity of Fgura.\nThe tribunal also pointed out that, following changes to the law, the minister responsible for planning was no longer obliged to endorse a decision to de-schedule a property. Consequently, the request to de-schedule was upheld.\nTimes of Malta asked architect Robert Musumeci, who appeared for Landscape Properties, whether there was any intention to develop the site. However, no reply was received by the time of writing.\nIn 1998, a permit had been issued on behalf of Francis Buttigieg for the construction of a commercial centre.\nFor some reason, the development did not materialise.", "comment_count": 30, "id": 756}, {"keywords": "", "author": "Keith Micallef", "article_body": "Bulky refuse disposal centres, better known as civic amenity sites, are morphing into junkyards, with heaps of white goods and electronic waste left to accumulate haphazardly.\nThough the matter has already been flagged various times, it seems like the situation has continued to worsen.\nManned by state agency Wasteserv, these facilities have been in operation for more than a decade as part of a drive to encourage households to dispose of their unwanted wares in an orderly fashion, without putting additional strain on the Magħtab landfill.\nMoreover, the goods deposited at the sites located in Mrieħel, Ħal Far, Luqa, Magħtab, Ta’ Qali and Tal-Kus in Gozo, are sent for recycling either locally or abroad.\nRead: 565 tonnes of goods piling up at civic amenity sites\nThe facilities are supposed to be equipped with 16- to 20-foot containers allocated for different kinds of objects like wood, batteries, construction waste, electronic equipment, white goods, paper and garden waste.\nOver the years this site has degenerated\nUsers wanting to dispose of their bulky items would drive through the civic amenity site and deposit the item, according to the specific container which should be clearly marked. \nTimes of Malta was recently alerted about the “alarming” situation at Magħtab.\n“Over the years this site has degenerated to the point that you can barely drive through it, due to the heaps of white goods and other objects scattered all over the place,” a Times of Malta reader complained.\nFurthermore, it was pointed out that none of the containers were visibly marked, thus creating even more confusion among users on where they should de-posit their unwanted items.\n\nThe sorry state of affairs was further corroborated when the newspaper visited the site, which looked anything but cared for.\nBesides Magħtab, the newspaper also visited Mrieħel, where it was also evident that the facility had run out of space. Once again, there were no clear signs guiding the public where to deposit waste, while no instructions were being given at the entrance to make up for this shortcoming.\nThe only civic amenity site visited, which was arguably run in an organised manner was the one in Ta’ Qali, although this, too, was filled to capacity.\nLast year, a Wasteserv spokesman had insisted the situation was under control, while claiming the overfilled facilities were a testament to an increase in environmental awareness by conscientious citizens.\nQuestions sent to Wasteserv remained unanswered by the time of writing.", "comment_count": 21, "id": 757}, {"keywords": "", "author": "Ramona Depares", "article_body": "An MEP hopeful has cited the presence of \"archaeological remains” in a last-ditch attempt to try to stop controversial development works at Manoel Island. \nThe future of Manoel Island and its environs is expected to be decided during a Planning Authority hearing on Thursday.\nThe discovery of submerged archaeological features could spell the end for Manoel Island development plans. Photo: Chris Sant Fournier\nArnold Cassola, who recently resigned from Alternattiva Demokratika, has lodged a complaint with the Ombudsman claiming that “certain submerged archaeological features had been totally overlooked in the discussion on the proposed Manoel Island development”.\nRead: NGO backing to revoke Midi mega-project on Manoel Island\nIn his call to stop the works from getting the green light, Dr Cassola has enlisted the help of archaeologist Reuben Grima, who describes the archaeological remains in the area as having a “very particular significance”.\nA study published by an international team of researchers had in 2013 already surmised that these structures could “potentially be dated to the Roman period”.\nThe study had also referred to the fact that these remains offer a “very useful indicator of how past human activity exploited the shore when sea levels were lower”.\nRead: Gżira's amateur fishermen fear 'trauma and grief' if Manoel Island project goes ahead\nProf. Cassola insists that examples of such well-preserved evidence of past human activity, which has been submerged by rising sea-levels are “few and far between” and, as such, these features merit safeguarding.\n“Any proposal to destroy any part of these features to deepen or widen the channel between Manoel Island and the Gżira waterfront should be rejected.\n“These features are an eloquent witness of the long-term rise in sea level and may be the oldest cultural features still visible in the locality today,” he said, adding that their very accessibility and visibility makes them ideal for didactic purposes.\nRead: Manoel Island plans will eliminate most of the Gżira promenade, residents say\n“Future plans for the area should not only ensure they and their context are preserved in situ, but also that they are presented and interpreted to the public,” he added.\nProf. Cassola’s findings have led to ripple effects around the locality of Gżira, with residents approaching him with findings of artefacts garnered from the area, including what he believes to be Roman pottery.\n“The Superintendence of Cultural Heritage has been informed about these artefacts as required by law. The person who gave me these artefacts also described how there is reputed to be a possible historical wreck in Sliema Creek,” he said.\n“The wreck had been located by the Royal Navy’s fleet clearance team under John Gratton when they were based at Manoel Island in the 1950s. I have also had reports of various archaeological remains being washed up after a bout of rough seas around Manoel Island, such as the storm we experienced the week before last,” he said.\nProf. Cassola ended his appeal by reiterating that the granting of a permit to widen, deepen, dredge or dig the Manoel Island canal should not be permitted.", "comment_count": 10, "id": 758}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man currently serving an 18-year jail term over a road rage incident back in 2005 has been awarded €3,000 by way of non-pecuniary damages in constitutional proceedings filed three years ago.\nStephen Pirotta, 48, from Luqa, has been serving time behind bars ever since his conviction in 2010 following a trial by jury over the attempted murder, during which he had stabbed a motorist in the chest in Qormi.\nThe victim, David Azzopardi, had been stabbed as he sat in his car, in the course of an argument which had broken out between the two motorists after Mr Pirotta had allegedly hit the side mirror of the other motorist’s car during an overtaking manoeuvre.\nTwo hours after the incident, the aggressor had been arrested, subsequently releasing a statement to the police without consulting a lawyer.\nHe was arraigned over the attempted murder within 36 hours of his arrest.\nThe man ultimately underwent a trial by jury which resulted in a guilty verdict of 7-2, landing an 18-year jail term that was confirmed on appeal.\nIn February 2016, the man had filed a constitutional application claiming that his right to a fair hearing had been breached since he had released his statement to the police without being assisted by a lawyer.\nWhen delivering judgment, the First Hall, Civil Court, in its constitutional jurisdiction, observed that the applicant had not been linked to the crime on the strength of his statement to the police, but had been identified as the suspect through other circumstantial facts which led to his arrest and which could reasonably link him to the incident.\nThe absence of the statement “would have made the prosecution’s case more difficult to prove, but that did not mean that the police did not have other valid evidence to support its allegations against the accused,” the court observed.\nThe Court, presided over by Mr Justice Joseph R. Micallef, observed that the accused had not objected in this regard while criminal proceedings were still ongoing.\nIt held the view that if a party failed to take up the remedy of claiming a breach of his right to a fair hearing once proceedings were ongoing, “it would not be just for that party to resort to the ‘constitutional’ remedy so as to attempt to cancel the effects of those proceedings”.\nAs for the applicant’s claim regarding the denied access to his police file, the Court observed that it had not been proven how this could have breached his right to a fair hearing.\nThe man had been arraigned 36 hours after his arrest and from then on, all evidence in the police file had been “at the complete disposition of the accused and his lawyers,” the Court observed.\nIn light of all this, the Court upheld the applicant’s claim of a breach of rights but only limitedly because the statement had been released without the assistance or presence of his lawyer and had been produced as evidence throughout the criminal proceedings.\nFor this reason, the Court awarded the applicant €3,000 by way of non-pecuniary damages. This was to be borne jointly by the two respondents, namely the AG and the Police Commissioner.\nLawyers Franco Debono, Marion Camilleri and Amadeus Cachia assisted the applicant in the constitutional proceedings.", "comment_count": 0, "id": 759}, {"keywords": "", "author": "", "article_body": "A one-size-fits-all approach to EU funding and taxation issues did not and could not always work, especially when taking the country’s insularity and economies of scale into consideration, Nationalist MEP Roberta Metsola said on Tuesday.\nSpeaking to business leaders, stakeholders and representatives of the industry during a business breakfast alongside European Commission’s vice-president Jyrki Katainen, Dr Metsola said she wanted to see a bigger uptake of EU funds from businesses, and it was important that bureaucracy was reduced to ensure funds would be available to firms which did not have the clout or size of other EU companies.\nShe insisted on the need for an EU regulatory environment for Maltese businesses to grow.\n“I reiterate our concern as a nation with the moves towards tax harmonisation on a European level or any attempt to remove the concept of unanimity on this issue. The effect of this on the Maltese industry would be huge and disproportionate,” she said.\nNationalist Party leader Adrian Delia spoke on the challenges faced by businesses in their attempts to access EU funding. He insisted that besides investing in businesses, the EU, as well as its member states, should ensure proper investment in students.\nEuropean Commission vice-president Jyrki Katainen took note of business leaders and stakeholders who spoke about their challenges, especially in relation to the uptake of EU funding.\nHe promised to take note of all the remarks made during the development of new funding opportunities for businesses and supplied information about the InvestEU Programme, which as from 2021, would bring together under one roof the multitude of EU financial instruments.\nCommissioner Katainen also praised MEP Metsola for organising the meeting, saying it was an example of how MEPs should work: bridging the gap between policy makers and citizens.", "comment_count": 8, "id": 760}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A €23 million underpass project at the Santa Luċija-Tarxien roundabout was frozen after a legal wrangle erupted over a blunder during the evaluation process, Times of Malta has learnt.\nTimes of Malta was told that the tender was put on hold following the direct intervention by the director of contracts, Anthony Cachia, a week after it was awarded.\nThe tender was allocated to RM Construction Ltd on behalf of Infrastructure Malta.\nIndustry sources said a committee appointed to evaluate the contract “appeared” to have overlooked the fact that the successful bid was not up to the required standards requested in the call.\nThe director of contracts was informed, among other things, that the selected bidder failed to meet specific requirements, the sources added. He was told, they continued, that a lower grade of concrete was being proposed, thus making a big difference in the overall price of the project, and also that a central wall, considered to be a major aspect of the structure, was missing in the proposal made.\nNot composed of the right people having the right expertise\nYet, the government-appointed evaluation committee, chaired by engineer Robert Schembri, still proceeded in allocating the tender. However, a technical expert subsequently pointed out the omissions to the director of contracts who ordered the contract to be frozen, the sources said.\nRM Construction Ltd, made up of road-building companies Asfaltar Ltd, Bonnici Brothers Ltd and Schembri Infrastructure Ltd, objected to the contracts director’s decision, arguing their offer should not have been cancelled as it was fully compliant with specifications.\nWhen the Public Contracts Review Board started hearing the appeal, Mr Schembri was asked why the evaluation committee went ahead with the award despite the shortcomings.\nThe industry sources said Mr Schembri declared his committee relied on declarations made by the bidder with regard to the specifications. The board threw out the appeal and RM Construction is now seeking redress in court, thus delaying the project, the sources remarked.\nA spokesman for Infrastructure Malta said the agency “will determine the way forward in this process as soon as the appeals period ends”.\nPublic Contracts Review Board chairman Anthony Cassar last year warned the government about the quality of appointees sitting on evaluation committees dealing with important contracts.\n“We are finding that some problems are caused because evaluation committees deciding on tenders are not composed of the right competent people having the right expertise,” he had said.\nMr Cassar insisted that the government should solve the problem as most of the appeals being filed followed technical deficiencies on the evaluation committee’s part.\n ", "comment_count": 69, "id": 761}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A man who got mixed up in a scuffle during carnival celebrations at the Granaries on Monday was granted bail pending judgment after admitting he had been foolish.\nFaris Mahmud Harith, a 27-year old Syrian plasterer living at Cospicua, was marched to court under arrest on Tuesday and pleaded guilty to having grievously injured his partner’s ex-boyfriend and knowingly breached the peace.\n“This was an unfortunate incident,” prosecuting Inspector Jeffrey Scicluna explained.\nThe court heard how Mr Harith had rushed to the scene after his partner called to tell him that she had just quarreled with her ex, whom she met in Valletta.\nAt the Granaries, an argument broke out between Mr Harith and the woman’s ex, who happened to be close to one of the carnival floats. Four individuals were reportedly involved in the fight.\nFearing that the group would turn on him, the accused had allegedly dealt the first blow.\nInspector Scicluna told the court that the other people involved in the fight would be arraigned, and said Mr Harith may have been provoked.\n“I never had any argument with anyone. I’ve been here for four years,” the accused told the court.\nHis defence lawyer Mario Mifsud pointed out that Mr Harith had ended up caught up in an argument that did not concern him: the accused’s partner had apparently quarreled with her ex over family matters.\nMr Harith had a clean criminal record, was a first time offender and had filed an early guilty plea, the lawyer noted, saying his client had made a mistake in rushing to his partner’s side instead of calling the police.\nThe woman had suffered slight injuries in the brawl, the lawyer said.\nMoreover, the accused had expressed remorse for his action, Dr Mifsud argued.\nIn light of these submissions, the court, presided over by magistrate Donatella Frendo Dimech, upheld a request for bail against a deposit of €300, a personal guarantee of €1700, an order to sign the bail book twice a week and under strict conditions of not approaching the witnesses.\nThe court further placed the accused under a Protection Order before adjourning the case for judgment next week.", "comment_count": 0, "id": 762}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 6.20pm with Alfred Sant's statement\nGeorge Vella is set to become Malta's next president, Prime Minister Joseph Muscat confirmed on Tuesday afternoon. \nIn a tweet, Dr Muscat said that he was nominating his former Foreign Affairs minister to be Malta's next head of state. He will be Malta's 10th president. \nMalta's president is nominated by a simple parliamentary majority, meaning Dr Vella's ascent to the post is now all but a formality. \nDr Muscat said that the nomination had the unanimous approval of cabinet and the Labour Party's parliamentary group.\n\n\n\n'Expected and well-deserved'\nDr Vella's nomination was also praised by MEP Alfred Sant, who, as Prime Minister, had had Dr Vella as his deputy.\nThe nomination, he said, was expected and well-deserved. Dr Vella had continuously proven his ability, intelligence, attentiveness and tolerance.\nDr Sant said he learnt a lot from Dr Vella as he saw him take decisions in favour of Malta and the Maltese, without any sign of partisanship. Whenever he was faced with difficult decisions he took them courageously and honestly.\nHe said he was convinced that, as President, Dr Vella would again distinguish himself through his sincerity, sense of justice and wisdom and would be an agent of genuine unity.\nDr Sant also thanked outgoing President Marie Loiuse Coleiro, who, he said, carried out her duties with commitment and in an impeccable manner.\nShe gave the post of President a social dimension and showed that the position could provide the country with guidance.\nThe people, he said, should be grateful.\n'A missed opportunity'\nThe Opposition was less enthused by Dr Muscat's choice. In a statement, the Nationalist Party said that its MPs would be meeting to discuss Dr Vella's nomination. \nIt nevertheless said that the Prime Minister had missed an opportunity to look past partisan interests and pick a head of state which two-thirds of parliament favoured. \nIn the past months, PN leader Adrian Delia had openly called on Dr Muscat to nominate a Nationalist-leaning president, suggesting Lawrence Gonzi, Tonio Borg or Louis Galea as candidates.\nPD statement\nPartit Demokratiku said Dr Vella was a capable politician but said that in the context of the present political scenario it would have been prudent had someone perceived to be close to all citizens of Malta and Gozo been chosen.\nEnd of term\nIn a separate tweet, Dr Muscat said that cabinet had unanimously resolved a vote of thanks to President Coleiro Preca \"for her sterling work\".\n\"We are glad that she will continue with her contribution towards Maltese society through the Foundation for Social Wellbeing,\" Dr Muscat wrote. \nThe tweet pointedly did not refer to President Coleiro Preca's current role at the helm of the steering committee for a Constitutional convention. \nA long political career\nRumours about her replacement have been swirling for several weeks, with Dr Vella the acknowledged favourite.  \nDr Vella, who will be turning 77 next month, had already been touted as a favourite to take over the presidency five years ago, only for the Prime Minister to opt for Marie-Louise Coleiro Preca instead.\nA doctor by profession, Dr Vella has had a long career in Maltese politics, serving as cabinet minister in two separate legislatures and deputy prime minister in one. Dr Vella being made a companion of the National Order of Merit in 2017 by President Coleiro Preca. Photo: DOI/Clifton Fenech\nHe joined the Labour Party in 1976 and was elected to parliament for the first time two years later. That was the start of a parliamentary career which would stretch into seven legislatures, with a hiatus in 1987 when he served as Malta’s permanent representative to the Council of Europe after missing out on a parliamentary seat.\nHis appreciation for global affairs led the Labour Party to make him its spokesman on foreign affairs in 1992, and he served as minister with that portfolio on two occasions: first between 1996 and 1998, serving under Alfred Sant - when he also served as deputy prime minister - and again between 2013 and 2017 under Dr Muscat.\nIn 2017, he was made a companion of the National Order of Merit.As a Member of Parliament, he represented the 3rd and 5th Districts.  \nBorn in Żejtun,  and an alumni of De La Salle college, Dr Vella is married and has three children and seven grandchildren. ", "comment_count": 178, "id": 763}, {"keywords": "", "author": "Jacob Borg", "article_body": "Environmentalist Alfred Baldacchino has raised concerns that country paths in Wied l-Isqof and Wied is-Sewda are being turned into “highways”.\nGovernment workers have been spotted in both areas in recent days, pouring concrete over the country lanes, damaging flora and fauna on both sides of the paths in a bid to widen them.\nSources familiar with the works said they were ostensibly taking place to improve accessibility for farmers.\nMr Baldacchino argued that the works would actually have a detrimental effect on farmers due to the increased traffic that could now pass through the lanes.\nHe warned that the concrete paths are, in some places, lower than the foundation of the rubble walls, which could eventually lead to their collapse.\nMr Baldacchino lamented that the valley bed had been turned into a gutter, with a concrete road taking its place.\nPictures of the works show concrete spilling off the side of the road into a water gulley on the side of the country lane.\nConcrete poured onto the country lanes has spilled over into a gulley in Wied l-Isqof.\nConcrete paths are lower than the foundation of the rubble walls\nMr Baldacchino quipped in a blog post that biodiversity destruction in Malta was now synonymous with the works being undertaken by the Transport Ministry.\nWhy are lanes being paved?\nIn reply to questions by the Times of Malta, an Infrastructure Malta spokesman said the agency is currently implementing several projects to reconstruct over 40 kilometres of rural roads which had been left in a state of disrepair for many years.\nRead: Why Malta's rubble walls did not make a Unesco heritage list\nThe spokesman said concrete, asphalt and other materials that formed these roads, which were in a very bad condition due to lack of adequate road build-up and ongoing maintenance, are being replaced with stronger foundations and new surface layers.\nWied is-Sewda has come in for similar treatment.\nWhere the existing subsurface materials are not strong enough to withstand the loads required for road transportation, rebar and concrete are commonly used to lay a stronger base, the spokesman continued.\nThe spokesman said that in the past, many rural roads were built by applying thin layers of concrete or asphalt directly on existing soil or other similar material, which made them more likely to cave in or develop cracks, storm damage and other defects.\nOne reader who frequents Wied is-Sewda, which is located between Attard and Qormi, pointed out that motorists could soon start using the lane as a shortcut.\n“That would only serve to increase traffic through the quiet country area,” the reader said.", "comment_count": 38, "id": 764}, {"keywords": "", "author": "", "article_body": "Registered full-time employment increased by 5.9 per cent in September 2018, while part-time employment increased by 0.6 per cent.\nAdministrative data provided by national employment agency Jobsplus and published by the National Statistics Office on Tuesday, showed that, over a period of one year, the labour supply (excluding part-timers) had increased by 5.5 per cent, reaching 209,475.\nThis, the NSO said, was attributed to a year-on-year increase in the full-time registered employed (11,623) and a decline in registered unemployment (659).\nWhen September 2018 is compared to September 2017, the highest increase in employment came in the professional, scientific and technical activities categories.\nRegistered full-time employment in the private sector went up by 10,388 persons to 160,178. Public sector full-time employment increased by 1,235 persons to 47,484.\nThe number full-time self-employed rose by 1,350 when compared toSeptember 2017, while the number of employees increased by 10,273.\nFull-time employment for males and females went up by 5 per cent and 7.5 per cent respectively over 2017 levels.", "comment_count": 4, "id": 765}, {"keywords": "", "author": "", "article_body": "Firefighters quickly put out a gas fire at an Qawra commercial establishment on Tuesday morning, dousing the flames before anyone was hurt.\nCivil Protection Department members were called to the scene at around 6.05am after residents reported a syspected gas explosion.\nOne officer and eight firefighters responded to the call from Xemxija and Corradino fire station, and three vehicles were dispatched to the scene.\nAround 20 people living in nearby apartments, including one baby, as well as several pets, were quickly evacuated as the operation got under way. Having controlled the fire, they then cooled and extracted gas cylinders to a safe area.\nIn a statement, the CPD thanked police officers from the Qawra police station and Rapid Intervention Unit for having helped with evacuating residents.\nThis was the third gas-related incident in the space of a week. Last week, a 70-year-old man died when a gas heater malfunctioned and caught fire, while on Monday a 48-year-old man was badly hurt when a gas cylinder exploded at his house in Paola.", "comment_count": 0, "id": 766}, {"keywords": "", "author": "Ramona Depares", "article_body": "An entire revolution is needed within the education system, according to author Audrey Friggieri, who is best known for a series of children’s books featuring  fictional heroine Ms Ambrożja in the role of a teacher who teaches by adventure.Audrey Friggieri\nMs Friggieri said that while many educators were doing great work, the curriculum is “fragmented and artificial, with teaching and learning often taking place exclusively on a theoretical level”.\nHer latest book, Qabża f’Dinja Oħra mill-Klassi, in fact deals with themes of leadership and politics that the writer hopes will stimulate class discussion about the qualities of a good leader; how leadership is foisted on some when they are not keen on it; and when it is appropriate to remove a leader.\nMs Friggieri, who is an assistant school head by profession, insisted that the current system keeps pupils too “safely cocooned from the real life out there”, despite the fact that teachers are meant to be preparing students for the challenges of real life.\n“Schools need to function in tandem with the world out there but this would entail a revolution in the way we do education. Thinking, problem-solving, self-care, debating and public speaking, for example... these are all skills that should be prioritised over endless memorising of content that students will never use once the examination is over.”\nSuch a thing [students protesting] would be unthinkable on this tiny island of ours\nAnd, while she acknowledges that schools could never catch up with the speed at which progress happens, she believes that a “paradigm shift to linking theory with transformative action” is required.\nAudrey Friggieri’s latest book, Qabża f’Dinja Oħra mill-Klassi.\n“This would help students understand that they too have a voice, and that it can make a difference in the world. As educators, we need to help them become aware of their duty and power to act in the world for the common good,” Ms Friggieri continued, referring to iconic images of students protesting on the streets of Europe to draw the attention of the powers that be to the dire state of the environment as an example.\n“Such a thing would be unthinkable on this tiny island of ours. People would immediately interpret it as offensive act by a rival political party. We have a long way to go,” she acknowledged.\nThe Miss Ambrożja series of books, by Merlin Publishers, reveal her frustration at this educational status quo, in a direct reaction to what she sees happening in today’s schools and her own recollections of  “having to sit still in a classroom, with the teacher droning on and on”.\n“I believe educators have a duty towards learners to ignite their minds. We need reflective, responsible and assertive citizens if we want to get nearer to making democracy work,” she concluded.", "comment_count": 10, "id": 767}, {"keywords": "", "author": "", "article_body": "The Planning Authority’s failure to revise a controversial fuel stations policy is unacceptable, a group of 11 NGOs said on Tuesday.  \nThe groups also hit out at comments indicating that, when revised, the new policy might still allow fuel stations to take up large tracts of ODZ land.\nThe lengthy 2015 Fuel Service Stations Policy saga seemed destined to continue, the groups said, as one year and two months had already passed since the review was promised by the authorities and yet the public still had no answer as to why the policy revision had not been seen to.\nRead: New petrol stations policy will not apply to pending applications - minister\n\"It is also disconcerting that Planning Minister Ian Borg stated that, after all, the revised policy might still allow ODZ fuel stations,\" the statement reads. \n\"Despite repeated calls by citizens, NGOs and the Environment and Resources Authority (ERA) to remove the possibility of ODZ fuel stations, the authorities seem to be adamant on maintaining it.\"\nThe ERA’s recommendations, which had been requested by the Environment Ministry, had stated that: “ODZ sites shall not be potential candidate sites for new or relocated fuel stations.”\nThere are currently 14 applications for ODZ fuel stations. Photo: Chris Sant Fournier\n\"We are in agreement with moving fuel stations away from urban centres, but not on ODZ, since alternative, non-greenfield sites can be found,\" the NGOs said. \nWatch:Damning video shows impact of delay in fuel station policy review\nThe statement added that the current policy allowed for the development of both new and relocated fuel stations on up to 3,000 square meters of agricultural and natural land designated as ODZ.\nFourteen applications for ODZ fuel stations were being reviewed by the PA, with four having already been accepted and the others still being processed, covering a total area equal to five times the Floriana Granaries.\nAdditionally, the two applications for ODZ fuel stations withdrawn on February 26 by the applicants may be re-submitted at a later stage, the statement said.\n\"In fact, as this review continues to extend beyond any reasonable deadline, applications for such projects continue to be submitted, jeopardising the country’s rapidly-decreasing ODZ land,\" the NGOs warned. \n\"We strongly believe that every passing day is crucial to the safeguarding of our islands from predatory commercial interests that seek to exploit natural and agricultural land for their own profit, and that the current fuel stations policy is extremely detrimental. A revised fuel stations policy, one which prohibits ODZ fuel stations, needs to be implemented at once.\"\nThe statement was signed by Moviment Graffitti, Din l-Art Helwa, Flimkien għal Ambjent Aħjar, Friends of the Earth Malta, Nature Trust Malta, Futur Ambjent Wieħed, Bicycle Advocacy Group, Isles of the Left, Ramblers Association, Birdlife Malta and Żminijietna.", "comment_count": 10, "id": 768}, {"keywords": "", "author": "", "article_body": "Customs officials caught a passenger leaving Malta with more than €200,000 in undeclared cash as he was about to board his flight to Istanbul on Monday evening. \nThe record find, which Customs called \"unprecedented\", unfolded when officials searched the man and his personal belongings. Inside his checked-in luggage, which was taken off the plane to be searched, they found bundles of undeclared cash. \nIn total, officials seized €200,192, of which €10,000 were returned to the passenger and the rest seized by Customs.\nPassengers are allowed up to €10,000 in undeclared cash when entering or leaving Malta. \nThe man, who holds a Maltese passport and lives in Manchester, will be arraigned in court later on Tuesday, the Customs department said in a statement.\nThe Department said it collected €250,000 in undeclared cash in the past two months, adding the latest catch was a \"remarkable success in its fight against money laundering\".\nAnother man heading to Istanbul was caught with €18,000 in cash that had not been declared earlier this week. ", "comment_count": 0, "id": 769}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Tuesday.The Times of Malta reports that a global study has ranked Malta’s mobile data prices as being among the world’s most expensive. The newspaper also reports that an administrative blunder has forced authorities to put a €23m underpass project in Santa Luċija on hold. The Malta Independent leads with Finance Minister Edward Scicluna’s comments that while pensions are not reliant on foreign workers, “it helps”. L-Orizzont speaks to a man whose neighbour was hurt in a gas cylinder explosion, with the newspaper writing that many are expressing concern about cylinder safety.In-Nazzjon writes that Malta has Europe’s worst environmental record and that the government’s lack of environmental planning is having knock-on effects in various other sectors.", "comment_count": 0, "id": 770}, {"keywords": "", "author": "", "article_body": "A construction worker fell one storey down a skylight in Senglea on Monday afternoon, the police said on Tuesday morning. \nThe 52-year-old was working on the roof of a site on Triq San Lawrenz when he fell at around 2pm.\nAn ambulance was called to the scene and took him from there to Mater Dei Hospital, where doctors found that he had been grievously hurt in the fall. \nA police investigation is under way. ", "comment_count": 0, "id": 771}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Where does a 22-year-old Maltese Muslim woman go when she is sent back to her country by fellow countrymen?\n“Go back to your country” is one of the phrases - usually strung with expletives - that is often thrown at Sara Ezabe, a law student.\nBut the racist comments targeting the anti-hate activist who has been listed among Forbes’ top ’30 under 30’, does not always go unnoticed.\nIn a landmark judgement in January, a man who had been acquitted of incitement to racial hatred towards Ms Ezabe through a foul-mouthed post was handed a suspended sentence.\nMs Ezabe urges those who spew hate to use language as a means of communication and not to insult others. The latter, she notes, is quite pointless.\nShe hopes that people will one day realise that religious beliefs do not define one’s nationality, especially in an ever-changing globalised world.\nMs Ezabe is participating in a Times of Malta #stophate speech campaign which for the past weeks has seen personalities reading out the hate messages they receive on social media.\nThe project also seeks to raise awareness of the impact hate speech can have on its recipients and the responsibilities that come with freedom of speech.\nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com\nOther #stophate videos: \nWatch: ‘I wish migrants would rape your wife’ - Peppi Azzopardi\nWatch: ‘You will go down like Daphne’ - Godfrey Farrugia\nWatch: 'I have a bullet ready for you' - Lara Dimitrijevic\nWatch: An assault rifle bullet... the cure for a gay man - Chucky Bartolo\nWatch: 'May his father never rest in peace'' - Mark Sultana", "comment_count": 0, "id": 772}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 6.30pm, adds ministry's reaction\nThe Gozo Ministry is allocating jobs on major projects to a particular architectural firm without any call for tenders, the Times of Malta is informed.\nSources in Gozo said that architect Frank Muscat and his firm, The Doric Studio, were awarded most if not all major projects since the change at the helm of the Gozo Ministry in June 2017.\nThe assignments ranged from the drawing up of a new master plan for Comino to works on a shelter for Gozitans in a villa in Birkirkara.\nMr Muscat and his firm had already been given various jobs at the time Justyne Caruana was parliamentary secretary responsible for St Vincent de Paul Residence in Luqa, before she succeeded Anton Refalo as Gozo Minister, the sources commented.\n“For some reason, Mr Muscat’s expertise is now being used for almost all the main projects connected to the Gozo Ministry, with tens of thousands of euros being paid to his firm without any form of tender being issued,” the sources said.\nWorse, we are even being excluded from competing\nThe works awarded to Mr Muscat and his studio since Dr Caruana moved into the Gozo Ministry included the design and execution of the Comino master plan, the regeneration of the main square at Xewkija – the minister’s home town; the development of the long-awaited breakwater in Marsalforn; the building of an old people’s home in Għajnsielem and the restoration and refurbishment of Villa Lauri in Birkirkara that would serve as a shelter for Gozitan students and families of patients receiving treatment in Maltese hospitals, the sources said.\nArchitect Frank Muscat.\nThis “irked” some Gozitan architects who “expect” a share of the government-generated work, the sources noted.\n“Worse, we are even being excluded from competing,” one of the aggrieved architects told Times of Malta, pointing out that Mr Muscat had also replaced the Gozo Ministry’s in-house architect, Angelo Portelli, on the building of the Għajnsielem home, “just because [Mr Portelli] happened to work with Anton Refalo”.\nAsked to say why the Gozo Ministry was directing many of its projects to the same architect, a spokesman for Dr Caruana directed the Times of Malta to a set of questions tabled by Gozitan Nationalist MP Chris Said in Parliament on the same subject.\n“The questions were already answered in Parliament,” he said.\nHowever, the replies given in Parliament lacked details, except for a question on the Għajnsielem home, in which the minister acknowledged that Mr Muscat had replaced the ministry’s architect and had, so far, been paid €28,000 in fees.\nIn similar replies to different questions put, the minister told Dr Said “consultants are procured according to established procedures, paid through fixed rates, as used to happen under previous administrations”.\nMinistry's reaction\nFollowing the publication of the article, the ministry said an expression of interest for architectural services was issued on October 25, 2017.\nThe call was uploaded on the ministry’s website and published in several newspapers.\nMoreover, on May 9, 2018, the ministry also issued a tender for a framework agreement and a number of architects who submitted an offer were engaged.\nThe ministry was also using the services of its own architects and it had issued a call for the employment of more architects.\nThis, it said, showed the ministry’s commitment towards the implementation of a large number of projects.", "comment_count": 58, "id": 773}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Maltese mobile phone users pay among the most expensive rates for data in any country in the world, a new global ranking has found.\nWith an average price of €16.61 for one gigabyte of data, Malta was placed in 209th place out of 230 countries in an analysis of more than 6,313 mobile data plans worldwide carried out by British comparison service Cable.co.uk.\nThe researchers analysed 29 SIM-only mobile plans offered by Maltese operators in October 2018. Among these, the cheapest means for consumers to obtain 1GB of data was recorded at €2 and the most expensive at €80.\nAmong European countries, only Switzerland, Cyprus and Greece were found to have more expensive data than Malta, while prices in Finland, the cheapest European country for data and the 14th cheapest globally, were 16 times lower than those in Malta.\nGlobally, India was found to have the cheapest mobile data plans of any country, with 1GB of data costing an average of $0.26 (€0.23). The most expensive place in the world to buy mobile data is Zimbabwe, where the average cost is $75.20 (€66.37) – 289 times as much as in India.\nOnly Switzerland, Cyprus and Greece have more expensive data in Europe\nCommenting on the worldwide rankings, Dan Howdle, consumer telecoms analyst at Cable.co.uk, said the cheapest countries tended to fall into categories.\nRead: Would you spend €1,000 on a mobile phone?\nIn some, excellent mobile and fixed broadband infrastructure allowed providers to offer large amounts of data, which brought down the price per gigabyte. Others with less advanced broadband networks were heavily reliant on mobile data, forcing prices to remain low as that is what people could afford.\n“At the more expensive end of the list, we have countries where, often, the infrastructure isn’t great but also where consumption is very small.\n“People often buy data packages of just tens of megabytes at a time, making a gigabyte relatively large and, therefore, expensive amount of data to buy,” Mr Howdle said.\n“Many countries in the middle of the list have good infrastructure and competitive mobile markets and while their prices aren’t among the cheapest in the world they wouldn’t necessarily be considered expensive by their consumers,” he noted.\nPrevious studies by the same researchers – working with partners including Google and Princeton University’s PlanetLab – have included a broadband speed test in 2018, where Malta ranked 46th out of 200 countries, and a broadband price ranking, with Malta placed 89th out of 195.", "comment_count": 52, "id": 774}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The discretionary powers of the Attorney General have been placed under judicial scrutiny after a convicted arsonist claimed that the exercise of those powers breached his fundamental right to a fair trial.\nA court upheld the man’s request for his claim, which includes discrimination, to be referred to a constitutional court.\nThe issue came up in the course of proceedings over an appeal filed by Martin Marco Baldacchino, assisted by lawyer Franco Debono, against a jail term of four years and six months handed down by the Criminal Court in 2016.\nThe self-confessed arsonist and reformed drug addict had set fire to the door of a house in Main Street, Qormi, in August 2011. He was caught red-handed, by an off-duty police constable, throwing a petrol-doused T-shirt next to the front door of the residence.\nThe man subsequently admitted that he had committed the act “for a shot of heroin”.\nFollowing that admission, the man’s defence team and the prosecution traded arguments before the Criminal Court about the degree of punishment.\nThe defence pointed out that an attempt at plea bargaining had failed because the AG had refused to accept the accused’s admission to the lesser crime of arson without danger of life.\nArguing that everyone was equal before the law, Dr Debono highlighted similar cases of arson, resulting in identical charges, where the AG had agreed to an admission for the less serious charge.\n“God forbid if in this country we were to be left to the mercy of the Attorney General,” who chose to apply one article of law sometimes and another article at other times, Dr Debono argued.\nThe prosecution countered that the accused had taken drugs intentionally and could not plead that his act was unintentional. Moreover, the man had not registered an early guilty plea. Finally, the accused had violated the terms of a conditional discharge so he could not benefit from a suspended sentence.\nGod forbid if we were to be left to the mercy of the Attorney General\nIn December 2016, the Criminal Court sentenced Mr Baldacchino to four-and-a-half years in prison, below the six-year minimum prescribed by law.\nThe accused and the AG both appealed and the case was adjourned for final judgment before the Court of Criminal Appeal in January 2019.\nHowever, Mr Baldacchino’s lawyer filed an application before that court claiming that his client’s rights had been breached through the manner in which the AG had exercised the discretion entrusted to him by law.\nThe applicant requested the claim be referred to a constitutional court but the AG objected.\nThe appeal court, presided over by Chief Justice Joseph Azzopardi, Mr Justice Joseph Zammit McKeon and Madam Justice Edwina Grima, declared that its role was not to delve into the merits of the applicant’s claim but to assess whether his request was “frivolous and vexatious,” namely whether it was senseless and lacking sufficient grounds.\nAfter examining the jurisprudence cited by the applicant’s lawyer, the court observed that there had been three similar cases of arson resulting in identical charges to those issued against Mr Baldacchino.\nIn those cases, the AG had entered into a plea bargaining exercise, accepting an admission for the lesser crime of arson without danger of life, as envisaged under article 318 of the Criminal Code, instead of the more serious crime of arson envisaged under article 316(a), where there was no loss of life but the perpetrator “could have foreseen that any person was actually in the place”.\nWhereas the lesser crime carried a minimum jail term of two years and a maximum term of four, the more serious crime – insisted upon by the AG in respect of Mr Baldacchino – contemplated a jail term varying from six to 12 years.\nIn the light of this scenario, the court declared that the constitutional issue raised by the applicant was “neither frivolous and more so not vexatious, especially in view of the fact that the AG was seeking a revision of the judgment delivered by the Criminal Court, by requesting a more severe punishment”.\nConsequently, the court upheld the request and referred the matter to the First Hall, Civil Court in its constitutional jurisdiction.\nThat court will now be asked to determine whether Mr Baldacchino suffered a breach of his right to a fair hearing and was unduly discriminated against when, he alleges, he was not treated in the same way as others facing identical accusations.\nThis is not the first time that the AG’s discretionary powers have been challenged in court. Five years ago, after a legal challenge also mounted by Dr Debono, the Constitutional Court had declared that the discretion enjoyed by the AG to decide whether drug cases should be heard before the Magistrate’s or Superior Court constituted a breach of the right to a fair trial, as this had an impact on the punishment the accused could receive. An automatic legal remedy has since been in place.", "comment_count": 0, "id": 775}, {"keywords": "", "author": "Ivan Martin", "article_body": "Holocaust deniers can cause the Jewish community great distress but a recent study found that most Maltese do not consider this a problem on the island.\nAn EU-wide survey found that just six per cent of Maltese people consider holocaust denial an issue here. In fact, the Maltese were the least likely citizens of a European member state to think that anti-Semitism in general was a problem in their country.\nOnly 13 per cent of Maltese respondents said this was an issue online and on social media and just four per cent said this appeared in the form of any graffiti in public spaces. Similarly, eight per cent said they had ever witnessed any expression of hostility towards the Jewish community.\nAnti-Semitism was not an issue in Maltese schools, universities, workplaces or political life. Nor was it a cause for concern in the media, the survey found.\nAnti-Semitism was not a cause for concern in the media\nBy way of contrast, 80 per cent of French respondents said this was a problem in their community and three in four admitted they experienced the problem on social media.\nAccording to the survey’s findings, 15-to-24-year -olds were more likely to believe that anti-Semitism on the internet, including online social networks, was a problem but slightly less are likely to think the same about “desecration of Jewish cemeteries”.\nWhile Malta was not a hostile place towards the Jewish faith and culture, it was also not informed about it. In fact, Maltese respondents were the most likely to say they were well informed about their customs and traditions – just five per cent had a good grasp.\nAnd the Maltese were the most likely to complain, when asked, about not being taught enough about the Jewish religion and culture at school.\nThe bulk of the respondents, 44 per cent, also did not know about the laws prohibiting discrimination on grounds of religious beliefs either.", "comment_count": 37, "id": 776}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman, who accidentally set fire to her Msida apartment when dozing off after a drink too many, was conditionally discharged after admitting to having filed a false arson report.\nThe 34-year old Hungarian resident was arraigned on Monday and charged with having knowingly reported an offence which had, in fact, not been committed.\nAlthough few details emerged in the course of the hearing, it appears that the woman had initially told investigators that she suspected arson as the cause behind the fire which had caused damage to her apartment and left her suffering third-degree burns.\nWhile first attributing the blaze to a suspected arson attack, the woman had later confessed to having fallen asleep with a lit cigarette in her hand, after having had too much to drink.\n“I am guilty, yes,” pleaded the scarred woman when answering to the false report charge during her arraignment today, confirming her plea after being given due time to reconsider.\nAfter hearing submissions on punishment, the court, presided over by magistrate Aaron Bugeja, conditionally discharged the accused, binding her not to commit another offence within six months from the date of judgment.\nThe court further ordered the woman to make good court expert expenses and other costs involved in the magisterial inquiry that had stemmed from her false report, warning the accused to check her alcohol consumption.\n“Madam go slow with the booze, because it can cost you dearly in terms of money, health, well-being and relationships,” were the magistrate’s final words of warning.\nLawyer Graziella Tanti was defence counsel. Inspectors Colin Sheldon and Mario Xiberras prosecuted.", "comment_count": 0, "id": 777}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 9.30pm with PN statement\nFinance Minister Edward Scicluna said on Monday that the government was working relentlessly on improving Malta’s anti-money laundering supervision.\nAddressing a press conference about a recent International Monetary Fund report into Malta's financial sector, Prof. Scicluna insisted that these problems had not simply come about in 2013.\nHe said the report found that the banking sector remained sound and profitable. Tests undertaken by the IMF found that the sector would remain resilient even in the worst case scenarios, the Finance Minister said.\nThe Finance Minister said it was only natural that gaps or shortcomings were identified in such reports. He said such gaps were works in progress that still had to be tackled.\nAccording to the report, “urgent action” is needed to address shortcomings in banking supervision.\nThe Finance Minister acknowledged that a number of institutions had to be bolstered, and a lot of work was being done in this regard.\n\nHe dismissed claims by the Opposition leader that Malta had not implemented the EU’s fourth anti-money laundering directive.\nProf. Scicluna said two amendments to the legislation were going to be carried out after the European Commission provided its feedback about Malta’s transposition.\nLast July, the Commission had written to the government highlighting the parts of the directive which had yet to be fully transposed to Maltese law. \nBanking supervision\nSilvio Schembri, the parliamentary secretary for financial services, said some of the IMF’s recommendations when it came to banking supervision had already been implemented.\nMr Schembri said the government had taken on board the IMF’s feedback on decentralising recruitment at the Malta Financial Services Authority.\nThe IMF said in its report the fact that the MFSA’s recruitment budget needed to be approved by the Finance Minister and all recruitment approved by Mr Schembri’s secretariat eroded the financial watchdog’s independent.\nThe MFSA also came under criticism by the IMF for its abolishment of its supervisory council, whose functions were being taken over by an executive committee answerable to the CEO.\nMr Schembri said the MFSA would be forming an enforcement committee that was independent from its CEO.\nThe parliamentary secretary said the aim of the IMF’s report, which was in fact requested by the government, was to learn and improve.\n“It has been 17 years since the last financial stability report by the IMF. We asked the IMF to send its experts to analyse our system in detail”.\nHe said such reports should not be taken in isolation and improvements on multiple fronts had been made since 2013.\nPN: 'Minister must shoulder responsibility'\nThe Nationalist Party (PN) said later on Monday that Prof. Scicluna's claims that bullying by MEPs had damaged Malta's reputation were \"insulting\" to various authoritative bodies which had flagged a worsening situation. \nIn a statement signed by party spokespeople Mario de Marco and Kirsty Debono, the PN said the IMF, Maltese Chamber of Commerce, and the CEO of HSBC had all raised concerns. \n\"It is clear that the only ones to blame are Minister Scicluna, Prime Minister Joseph Muscat and their colleagues in cabinet. Edward Scicluna and his colleagues have destroyed the excellent reputation the country once enjoyed in the financial services sector,\" the party said, calling for the minister to shoulder responsibility.", "comment_count": 45, "id": 778}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, out on bail for threatening his ex-girlfriend in January, has been remanded in custody after allegedly repeating similar offences on Sunday.\nTyson Bugeja, a 23-year old Marsa resident, was arrested after allegedly breaching the terms of a Protection Order and previous bail conditions, following a police report filed by the woman’s mother in the wake of a phone call from her terrified daughter.\nThe man, who had allegedly smashed his former partner's car windscreen in an earlier episode of violence, apparently ignored a court order barring him from approaching the woman when he allegedly turned up on her verandah, angry and armed with a knife.\nDuring the arraignment on Monday, the man pleaded not guilty.\nA request for bail by his defence counsel was met with strong objections by the prosecution, led by Inspector Eman Hayman who pointed out that the accused had ignored earlier court orders, landing himself back in the same situation.\n“This was not an attack on the woman outside her property, now it is inside her property. He has been given several chances,” the inspector stressed, pointing out that the charges indicated previous incidents between the former couple and that the situation had escalated to the extent that the latest episode had allegedly taken place at the woman’s home.\nThe man “does not want to leave her alone,” the inspector said.\nDefence counsel Rene Darmanin, assisting the accused together with Arthur Azzopardi, rebutted that at this stage there were mere allegations against the man.\n“We have evidence of who made contact with whom and what photographs were sent. The accused had no problem with keeping out of the woman’s hometown,” Dr Darmanin argued.\nHowever, the prosecution pointed out that the incident could easily repeat itself and besides, the alleged victim was still to testify.\nUpon these submissions, the court, presided over by magistrate Aaron Bugeja, turned down the request for bail, pointing out, however, that the woman would face a possible jail term if it emerged that she had made a false report.\nUpon agreement between the parties, the court recommended that the accused be detained in the juvenile section of prison.\nLawyer Mario Mifsud appeared parte civile.", "comment_count": 0, "id": 779}, {"keywords": "", "author": "", "article_body": "Updated March 5, 1.05pm\nA British warship which angered the Chinese government is currently in Maltese harbours, prompting consternation at leftist think tank Żminijietna.\n“The government should not open Maltese ports to foreign military vessels, especially those involved in acts of provocation that can lead to wars,” Żminijietna said in a statement.\nThe HMS Argyll sailed into Valletta on Sunday and is scheduled to remain there until Wednesday, when she will sail onwards.\nA Foreign Affairs Ministry representative told Times of Malta that the vessel was in Malta to refuel, re-store and \"undertake general logistical activity\" ahead of its return to the UK. \nThe Royal Navy’s oldest serving Type 23 frigate is en route to return home following a nine-month deployment in Asia.\nThat mission saw it join US navy vessels in drills in the South China Sea last month, stoking irritation in Beijing.\nChina has built a series of outposts in the area, which is one of the world’s most trafficked sea lanes, prompting accusations that it is out to cement control of those waters.\n\n\n\nBeijing responded to the HMS Argyll exerices by accusing Britain of engaging in “provocation”.\n“China strongly urges the British side to immediately stop such provocative actions, to avoid harming the broader picture of bilateral relations and regional peace and stability,” the Chinese foreign ministry had said.\nThose diplomatic tensions weighed heavy on minds at Żminijietna, who called on the Maltese government to keep Malta’s declared neutrality in mind.\n“Malta is a neutral state actively pursuing peace, security and social progress among all nations by adhering to a policy of non-alignment and refusing to participate in any military alliance,” they said.", "comment_count": 33, "id": 780}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Only a small percentage of Maltese rent from the open market and are therefore susceptible to increasing rental prices, according to Central Bank of Malta data.\nHowever, this situation would change if the pre-1995 controlled rent agreements were ever thrown out.\nThe burgeoning rental market and its impact on the Maltese has been the topic of many articles. But insight provided by the bank’s chief economist, Aaron Grech, shows a much more nuanced situation, with some trends, such as tourism, playing an as-yet underestimated role.\nDr Grech used statistical data to break down this important sector, isolating those who rent under the pre-1995 controlled rents, those Maltese who rent from the market at commercial rents, the impact on foreign workers and the demand driven by tourists seeking private accommodation.\nMany protected by controlled rents\nSurveys by the National Statistics Office show that a fifth of the Maltese rent and the rest are home owners.\nHowever, of those, the great majority rent under the old regime, with only three to four per cent of the 200,000 or so households in Malta subject to commercial rents.\nThe NSO also checks how much people spend on housing (including electricity, for example) compared to their income, with 40 per cent being the maximum threshold considered sustainable from a risk-of-poverty point of view.\nVery few people who are in controlled rental properties would reach that level, Dr Grech confirmed.\nThe percentage spent on housing by those who rent from the market has increased slightly, the data shows. However, he cautioned that the numbers of people affected are small.\nOf course, the situation would need to be looked at quite differently if pre-1995 contracts were abandoned as a result of judgments by the European Court of Human Rights, which found them to be unfair. In a worst-case scenario, were the contracts to be struck down without any buffer, this would result in tens of thousands who would have to switch to commercial rents.\nWould they be able to afford them? As Dr Grech said, that is another story, and one for which little data is available.\nMaltese still afford own home\nWhat about those Maltese who aspire to own their own home? Certainly, current home owners are in a very positive position at the moment, given low interest rates. And Dr Grech stressed that official statistics show the proportion of Maltese who are becoming home owners is going up, despite the increase in property prices.\nHowever, people might be getting squeezed out of the type of property they would have aspired to in the past.\nThree to four per cent of the 200,000 or so households in Malta are subject to commercial rents\n“Whereas in the past, most of the stock was houses, now most of the new units are flats. So you could argue that people are having to shift to different types of accommodation. That said, it is difficult to see if that implies a lower quality of housing as some of the apartments are very high standard,” Dr Grech explained.\nThe Central Bank does not dismiss these thwarted expectations, with an increasing body of literature in Europe showing that this is what feeds into populism.\n“In Malta, it is still considered to be a downgrade to go to a flat, especially if your parents had lived in a house, which makes you bitter,” Central Bank Governor Mario Vella remarked.\nFortunately, the outlook in Malta has remained positive overall as people have been able to get a job easily, and jobs that pay better, with Maltese shifting up the employment categories – leaving gaps in the elementary occupations and those classified as unskilled, which have had to be filled by foreign workers.\n“This is what might have created this idea of a squeeze in the rental market as before that part of the property market was just for the Maltese,” Dr Grech added.\nIs free market squeezing tenants?\nEven though the numbers of Maltese renting from the market may be low, everyone who ends up being squeezed to pay a higher rent represents a human story. The Central Bank has a new social research unit which is anxious to get beyond numbers.\nHowever, statistics do flag up important trends, such as whether rising rents are pushing people out of their homes. \nDr Grech had to shrug helplessly once again: the nature of homelessness makes the collection of data rather sketchy. He said evidence showed that the number of those going to homeless shelters was increasing somewhat, but digging deeper one found it was mainly foreign workers and not locals who simply could not find affordable accommodation.\nAnd the overall number thankfully remained very low when one considered that the island had seen an increase of around 40,000 foreigners in four years, he added.\nVacant stock of properties\nThe price for rental properties depends on the balance between supply and demand. Dr Grech admitted that one thing being overlooked was how the island had managed to accommodate foreigners when the housing stock was what it was.\n“We started to build when the demand became obvious but it did take a few years till the new properties came online,” he said.\nWhat saved the island was the stock of vacant properties from the previous boom which helped to accommodate the influx.\n“In 2005, there were 43,000 completely vacant properties. In 2011, there were 41,000. So the stock was already being used up before the influx,” he explained.\nThe tourist population is growing – with a huge increase in those using private accommodation. Photo: Chris Sant Fournier\nIs tourist demand overlooked?\nHowever, to say that demand for rental property is only coming from foreign workers and residents ignores one other important reality: tourism.\nThe tourist population is growing – with a huge increase, even relatively speaking, in those using private accommodation.\nLast year, of the 2.6 million arrivals, 0.3 million went into accommodation that was not rented, either staying with friends or in their own property, and a further 0.6 million were in short-term rentals.\n“That means one million people in a year who are not staying in hotels – representing eight million nights. This works out to having the equivalent of 150,000 more people on the island each and every day,” he said.\nIf tourists continue to shift to private accommodation then demand for property will continue to grow\n“If this double-digit growth continues – and they continue to shift to private accommodation – then demand for property will continue to grow.\n“We have gone from 1.5 million arrivals to 2.5 million in five years, whereas it had taken us 20 years before that to increase by a million,” he pointed out.\nLong-term demand\nTourism may continue to grow but what about foreign workers once the economy slows down? Dr Grech shook his head in dismay at the misleading assumptions being made: “We would only need fewer workers if the economy started to decline. No one is arguing that the economy will decline, only that it will slow down to two to three per cent [growth].\n“The Maltese population is what it is and will not grow. We are an aging population and the female participation rate has caught up (although we will soon face a caring crisis – as we cannot assume that the government will continue to create places for people to go into institutional care). If we are going to grow – even by one to two per cent – we still need them,” he stressed.\nTemporary workers, different needs\nWorkers who stay here for a few years clearly have different needs to those who come here for a project. There was an uproar last week over whether Turkish workers coming to Malta for a construction project should be housed in pre-fabricated units.\nPrime Minister Joseph Muscat has said that they should definitely “not be housed in tents” but the Malta Chamber of Commerce, Enterprise and Industry warned against building to cater for foreign workers, as these properties might be left vacant once the economy slows down.\nHowever, the problem is not only one to contemplate as a long-term issue: from an economic point of view, does it make sense to put them into a housing stock that is already under pressure? \nDr Vella interjected that it was quite common, from Europe to the Middle East and beyond, for projects which require shift work to be centred around gated communities set up from scratch and dismantled afterwards. He reassured that this was a pragmatic and efficient solution, and that the lack of familiarity with such solutions may raise the fear that the accommodation was cheap or bad.\n“It is not,” he said emphatically.\nRenting by numbers:\n▪ Four-fifths of the Maltese own their own home, one fifth rent.\n▪ Three to four per cent of all households pay commercial rents; majority have controlled rents.\n▪ There were 41,000 completely vacant properties in 2011, down from 43,000 in 2005.\n▪ Tourists in non-hotel accommodation add 150,000 to the population every day.", "comment_count": 40, "id": 781}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "It is probably one of the most damming investigations carried out by the Office of the Ombudsman and its conclusions have been fiercely resisted by the government. His report exposed how the new Labour administration manipulated a promotion exercise to insert trusted people at the top. Ivan Camilleri digs into the findings.\nBrigadier Jeffrey Curmi took over command of the Armed Forces of Malta on December 20, 2013, just a few months after Labour was swept into power following more than two decades in Opposition. On the same day, Colonel Mark Mallia was appointed Deputy Commander.\nUntil the previous September, Mr Curmi and Mr Mallia were majors – middle ranking officers in the AFM.\nTo become a Brigadier – the highest rank in the Armed Forces of Malta – Curmi needed three promotions. Mallia needed the same. However, many other officers within the upper ranks had more experience and seniority. Some of them filed complaints to the Ombudsman.\nThe pair’s journey of a thousand miles had begun with a single step:\nThe crucial promotion\nIn May 2013, two months after the election of the new government, Brigadier Martin Xuereb, the then AFM Commander, issued a circular announcing two vacant positions, entailing promotions from Major to Lieutenant Colonel.\nIn his testimony to the Ombudsman, Brigadier Xuereb said that despite the fact the two positions had become vacant before the 2013 general election, he had felt the process should wait “as it did not make sense to go through a process which will take us to the eve of the election”.\nAn identical exercise had been carried out in 2011 on the basis of established policy grounded in both written and oral examinations and aimed at limiting, as far as possible, the element of subjectivity. Despite this, the new minister responsible for the army, Manuel Mallia, issued a new policy “totally sweeping away the written complement of the promotion process carried out in 2011,” according to the Ombudsman.\nCrucially, the new policy lowered the requirements for those applying for promotion when compared to the 2011 exercise.\nNo comfort that the selection was done properly\nFor example, in 2011, only those with 15 years of reckonable army service and at least two years of service as a major could apply. Under the new policy, the latter criterion was lowered to just one year.\n“If not for the 2013 seniority change, these criteria would have prevented a number of majors from applying, including Major Mark Mallia who three months after become the AFM’s number two,” the Ombudsman says in the report on his investigation.\nThe interviewers\nThe composition of the interviewing board had undergone some drastic changes.\nIn 2011, the Senior Ranks Appointments Advisory Committee, which examined the applicants, was composed mainly of military staff. This time round Brigadier Xuereb, an ex-uffico member, was the only military man on the newly composed board – Minister Mallia had made an unprecedented departure from protocol by appointing two members of his private secretariat to the committee.\nThese were former Labour TV reporter Ramona Attard and his customer care official Clint Cutajar.\nThe committee was presided over by the ministry’s permanent secretary Kevin Mahoney, who had no previous experience in a promotion exercise of this nature. He was answerable to the minister.\nA total of 24 majors applied for the two vacancies.\nThe result\nAll candidates were interviewed over three sessions held during August 2013. Brigadier Xuereb had prepared a dossier on each candidate to serve as an indication of their experience and credentials. However, the Ombudsman found that the marks awarded to the candidates by the majority non-military members of the committee were very different from those awarded by the only army man, Brigadier Xuereb.\nThe process resulted in the promotion from Major to Lieutenant Colonel of eight of the applicants, when there were meant to have been only two vacant posts.\nThe top four candidates to emerge from the exercise were Jeffrey Curmi, Mark Mallia, Pierre Vassallo and Mark Said.\nThe Ombudsman’s main conclusions\nThe Ombudsman observed that “there seems to have been more promotions than the vacancies warranted”.\nCrucially, he concluded: “This investigation does not give this Office the comfort that the selection was done properly.\n“Four of the five members of the SRAAC did not have any military knowledge and two of them were persons of trust who were not cognizant of public service protocol, let alone the specific regulation of the Armed Forces. The indications this Office had is that the process was intended to produce a desired outcome.”\nThe selection process, the Ombudsman said, was conducted in an “unprofessional manner and did not achieve the necessary rigour”.\n“The selection process was a screen for the choice made. The selection process lacks integrity and has given cause to an injustice toward the other candidates.\n“It was a process tailor-made to achieve a pre-ordained result. As such it improperly discriminated against the complainants and indeed against all the eligible candidates insofar as they were not allowed to compete on an equal, level playing field with the chosen candidates.\n“The Ombudsman can at this stage only conclude that the selection process was vitiated and that the complainants and indeed all the eligible candidates suffered an injustice as a result of an act of maladministration”\nIn a letter to the Ombudsman, Home Affairs Minister Michael Farrugia expressed disagreement with the majority of his conclusions but said he would discuss them “at length internally and take them into consideration for future processes”.\nRace to the top\nSeptember 13, 2013: At the end of the “vitiated” promotion exercise, Major Jeffrey Curmi and Major Mark Mallia were both appointed Lieutenant Colonels. This was the first step in a sprint to the pinnacle of the army.\nSeptember 27, 2013: Just 14 days later, the new Lieutenant Colonels, Curmi and Mallia, were given the rank of Colonel by then home affairs minister Manuel Mallia.\nOctober 4, 2013: Through a notification in The Government Gazette, the minister announced that Col. Curmi had been promoted to Deputy Commander of the Armed Forces.\nDecember 20, 2013: Another notification announced the appointment of Col. Curmi to Commander and his promotion to Brigadier – the highest rank in the Maltese army. On the same day, Colonel Mark Mallia was declared to be the AFM’s Deputy Commander.\nNon-military members of selection committee:\nHome Affairs permanent secretary Kevin Mahoney, chairman.\nMr Mahoney had never sat on a selection board related to the army. When the Permanent Secretary was questioned on this, his answer was that the policy had changed.\nHe said he had no input in the new policy. He had simply received it from the minster and did not feel that it should be questioned. He could not explain what motivated the change.\nWhen asked whether the policy was formulated by the minister himself, the permanent secretary replied that he thought so.\nRamona Attard, One TV reporter and deputy chief of staff at Home Affairs.\nMs Attard, who had no experience whatsoever in military affairs, thought, according to the Ombudsman, that the law imposed the presence of the Minister’s chief of staff (Silvio Scerri) on the selection board, and that she had been appointed in his absence. The Ombudsman said this was not reflected in the law. She admitted she had been appointed by the minister and that Prime Minster Joseph Muscat had also spoken to her.\nOn the assessment of communication skills during the interviews, Ms Attard told the Ombudsman that “that was her topic” meaning, presumably, that she could assess whether an army officer could communicate properly with those around him.\nClint Cutajar, canvasser and head of customer services at the ministry.\nMr Cutajar told the Ombudsman that he was not sure who had told him to be a member of the board – it could have been the minister or Mr Scerri.\nWhen asked how he allocated his marks on appearance he replied: “Appearance is his appearance, how he behaves and if he’s clean.”\nThe Ombudsman said: “Mr Cutajar was out of his depth and he seemed to realise this. He felt he had to obey the minister’s wishes, reinforced by those of the chief of staff, and sit on the board.”\nGovernment resistance to investigation\nManuel Mallia\nIn December 2013, six majors who had applied for the promotion filed a request for an investigation by the Ombudsman claiming the process was flawed.\nHowever, it took three long years for the investigation to start because the government objected to it, arguing that the Ombudsman had no remit to initiate the probe.\nThe Ombudsman sent letters and held meetings with the minister and the permanent secretary but the government and the army kept ignoring his order to pass on the files related to the promotion exercise.\nThe Ombudsman was forced to file an unprecedented law suit against the government over the matter and the court eventually found in his favour, ordering the government to give him access to the requested files.\nArmy choices: Ombudsman’s choice words\n▪ Unprofessional▪ A desired outcome▪ Lacked integrity▪ A screen▪ An injustice▪ Tailor-made▪ Pre-ordained▪ Vitiated▪ Maladministration", "comment_count": 191, "id": 782}, {"keywords": "", "author": "Ivan Martin", "article_body": "Teachers are getting pushed around and need insurance cover, according to the Union of Professional Educators.\nAddressing a press conference outside the Office of the Prime Minister, union president Graham Sansone said both indemnity insurance, and coverage against injury and loss of earnings were being proposed as requirements.\n“The teaching profession has changed over the years. The truth is that insurance was needed years ago and the risks and threats facing educators today are very different. We cannot continue to avoid this reality,” he said.\nThe union recently met Prime Minister Joseph Muscat and Education Minister Evarist Bartolo to discuss the matter and they had been “receptive”.\nRead: Boy in hospital with head injuries after attack at Pembroke secondary school\n“The next step is for us to come up with more concrete proposals which we will be handing over later today (Monday),” union director Rita Catania said.\nThe union had not yet met with insurance brokers to discuss the matter.\n'The teaching profession has become one riddled with safety concerns.' Photo: Shutterstock\nTeachers, Ms Catania said, were being harassed and often made to work in climates of fear.\nSecurity standards in many of the island’s schools were dismal, with gates often left unlocked and unguarded.\nAggressive parents or guardians could walk into a school and try take the law into their own hands - as had happened in recent months, the union warned as it called for the appointment of security guards.\nRead: Police called in as student, school official fight at Qormi school\nUnion financial officer George Debono told reporters that the teaching profession had become one riddled with safety concerns.\n“If we want to continue attracting people to this profession, we need to make it safe and attractive,” he said, adding that many teachers had resigned in recent months due to worsening safety concerns.\nIt was also time for insurance cover in cases of long leave that saw teachers put on half pay or no pay.\n“It is about time that this issue is addressed,” Mr Sansone said.\nLast week, the Malta Union of Teachers also formally asked for insurance cover for teachers while at school.", "comment_count": 16, "id": 783}, {"keywords": "", "author": "Ivan Martin", "article_body": "The head of the civil service defended the high number of persons of trust on the public payroll, insisting it was a cultural matter.\nThe number of persons of trust, now amounting to about 700, was highlighted as an issue of concern in an evaluation by the Venice Commission of Malta’s democratic infrastructure late last year.\nIn its report after a visit to the island, the Council of Europe’s advisory body on constitutional law, noted that even people working as gardeners or drivers had been recruited under the persons-of-trust procedure.\nRead: The number of people in positions of trust is not excessive – Mario Cutajar\n“The Venice Commission cannot investigate such cases. It is, however, evident that any exception to procedures that provide for appointments on merits are a danger to the quality of the civil service, which is the backbone of a democratic state under the rule of law,” the law experts sitting on the commission commented.\nThey concluded that, without a constitutional and real legal basis, the practice of indiscriminate trust-basis employment was illegal, even if it had a legitimate purpose.\nA mere tradition cannot be the basis for such expenses on a large scale\nTo remedy this, the Venice Commission recommended adopting a constitutional amendment together with clear legal basis, which strictly limited the appointments of persons of trust.\nWatch: 'Persons of trust don't worry me, and I'll tell you why'\nPrincipal Permanent Secretary Mario Cutajar said when approached about the matter that employment on a person-of-trust basis was resorted to in cases where personal trust was “a significant element of the employment relationship”.\n“Persons employed as drivers or gardeners have been among the persons of trust for a long time and this is not a development that happened during these last years,” he noted.\nOver the years, foreign delegations had tended to deride the fact that, for instance, a minister’s driver should be a person of trust or that a gardener in the Prime Minister’s official residence would be an employee in this category, he said.\nThis, however, was “not compatible with the established thinking in Malta”, Mr Cutajar remarked. Such positions, he added, had always required a strong element of personal trust.\nThe Venice Commission pointed out that, while it recognised the need for such exceptions in specific cases, limits should be clearly defined. “As the persons of trust are funded from the state budget, a mere tradition cannot be the basis for such expenses on a large scale,” it said.\nMr Cutajar also played down the 700 figure. The number of persons employed in such positions was “very small” in relation to those in ordinary employment with the government, he said.\nIt was also comparable to numbers for pre-2013, Mr Cutajar added.\nThe Venice Commission commented in its report on Malta that “a sound constitutional and legal basis” should be required for people to be employed on a trust basis.\nTo this end, it recommended introducing a constitutional amendment and legislation that permitted, but at the same time limited, the possibility to appoint persons to positions of trust. It said the type of activities that should require absolute trust should also be defined.\n“Only activities directly related to the exercise of power should be considered as a valid exception from the general system of appointments in the public service,” the Venice Commission argued.", "comment_count": 74, "id": 784}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "Four years down the line, outgoing Din l-Art Ħelwa executive president Maria Grazia Cassar finds herself repeating the same gripes in the face of development and destruction: too much, too fast. But she also knows that the worst thing would be to give up.\nFrom when you took on the role of DLĦ executive president in 2015, how has the situation in Malta changed as regards heritage and the environment? How has your own outlook on the status quo and the future changed?\nThere has been a lot of change in Malta over the past four years, and I have to say both heritage and the environment have suffered greatly. We have only to look around us to see the effects of the building frenzy everywhere. It is not only disfiguring what was a unique architectural landscape but making life rather unbearable, with the consequent effects on health and lifestyle.\nThere is a dichotomy, however, as many public and private projects have greatly improved degraded areas through sensitive and intelligent regeneration and conservation, including Pjazza Tritoni, for example (before the container shops were introduced).\nMy own personal position has not changed at all. In fact I would quote the very same things I said when I first took on the role of DLĦ executive president: too much and too fast; not enough planning and long-term vision; ugly is not a necessity and beauty is not a luxury.\nLooking back, has your stint at the helm of DLĦ been a fruitless and thankless battle overall, given that a tidal wave of development and demolition has hit Malta?\nYou are right in describing it as a tidal wave, as just as we face one battle there seem to be another three or four looming on the horizon! However, every achievement in saving part of Malta’s incredible patrimony must be deemed as a success, no matter how small. The worst thing that could happen to us is to become complacent, or give up, which is why I cannot bear to hear, when discussing the probable demolition of a degraded building, the argument: “What on earth do you want to save?”\nWe must continue speaking out, and in the end, the decision makers will listen. What is very encouraging is that the public has also become engaged, especially when it affects their neighbourhood.\nWhat would you say was the NGO’s biggest achievement during your term of office; and what was its biggest failure?\nI believe one of the biggest achievements during my term of office was when we won the appeal on the Townsquare high-rise development, along with the other appellants: Flimkien għal Ambjent Aħjar, the Sliema local council and the Environment and Resources Authority.\nI felt vindicated that DLĦ’s insistence that the tower would be seen over the Valletta skyline was legitimate, and in fact, the height has been considerably scaled down in order not to be seen from the other side of Grand Harbour. It was unfortunate that the Mrieħel appeal was not successful.\nAnother first for DLĦ was the sentence whereby contempt of court proceedings were initiated over the failure by the Planning Authority to protect St Ignatius Villa from partial demolition. We have also recently been granted the right to appeal the refusal to schedule this building of extremely high historical and architectural importance.\nAnother very big achievement was the coming together of 22 entities to make a declaration outside Parliament on April 18, 2018. We called it Wirtna – Our Legacy, and we called on the authorities to put a stop to the destruction of Malta’s heritage buildings and cultural landscape, with several tangible suggestions on how to protect it. It is a real satisfaction to know that there are so many entities that share the same concerns and love of our patrimony.\nOf course, there are the 19 historical sites DLĦ has restored, which are managed and opened to the public by dedicated teams of volunteers. This, in itself, is an immense achievement, with 90,000 visitors recorded this year, and rising! Our latest project, the White Tower of Armier is at a very advanced stage and will be an interesting educational visitor attraction, with the possibility of overnight accommodation for groups.\nIt is unfortunate that the PA seems to be more engaged in trying to meet developers’ demands than carrying out the role it was created for\nI think what has been achieved through the sheer hard work and dedication of the volunteers on council and at the sites is wonderful. They do everything, from fundraising to organising events; thinking up and co-ordinating the projects.\nAnd the greatest challenge over these years…\nI suppose it is the sheer magnitude and extent of the ‘watchdog’ role, which is DLĦ’s mission and which, in today’s scenario, may seem overwhelming. If planning laws and regulations were tighter and more clear-cut, then everybody would have more peace of mind. However, there is so much room for interpretation that, many times, even if a case officer recommends refusal, the vote would be in favour of the application.\nYou seem to be one of the few entities with enough teeth to attempt to resist the ruin of the islands. What about the actual authorities entrusted with this role? Where are they? What should they be doing? And why is any criticism and protest so ineffective?\nBeing a voluntary organisation, we are not beholden to anybody and this gives us the confidence to speak out about what we believe in. The authority entrusted with the role, that is, the Superintendence of Cultural Heritage, we feel needs to be given the necessary resources to carry out its job effectively and should have the last word when it comes to decisions on heritage.\nAlso, it is unfortunate that the PA seems to be more engaged in trying to meet developers’ demands than carrying out the role it was created for; that is, delivering a good planning vision and framework for development to take place, achieving a balance between the new and the old, and sensible land use as opposed to short-sighted speculation.\nOne of the greatest frustrations and paradoxes is that everyone seems to complain about the environment, yet these loud voices would appear to have no power whatsoever and the wanton destruction continues. Do you feel the public does not protest loudly enough and what would it take for these complaints not to fall on deaf ears?\nOn the contrary, the public is becoming very proactive and speaking out. One has only to see the constant discussions on social media; a lot of opinion is being voiced. You are right in saying that protests fall on deaf ears though, and it is a great shame that the authorities do not listen to the people enough.\nLook at the objections to the DB tower and ex-ITS site at Pembroke – there were over 4,000 objectors to this project. Surely, they should have counted for something?\nI disagree that people do nothing but complain. People are taking the future of their neighbourhoods very seriously and even forming grass-roots groups, and creating forums, where public discussions are taking place. We have seen this with Gżira, Pembroke and Żejtun residents, and now Xemxija residents too.\nPeople are refusing to accept building development in their locality that will have a negative impact on their health and environment. They demand to be listened to. In the case of Bulebel in Żejtun, it worked. Pembroke residents were ignored, but now there is the appeal outcome this week [The appeal decision is now public]. Dialogue is important, and people expect a modicum of transparency and fairness in decisions that affect their life. \nDLĦ files an average of 10 to 12 objections to PA applications each week. These are restricted to more urgent UCA and ODZ cases and do not even include applications for development zones. It would appear to be completely ignored and rarely are any cases won. Only around 10 per cent of permits objected to get refused. How demoralising is that?\nAgain, the tragedy is there is so much room for interpretation of the policies and regulations. Planning should not be like that. It should be tighter and with no room for ifs and buts. Everybody would be happy to comply.\nThe number of refusals of the permits objected to is, indeed, very low, but I would feel worse if we had not tried. We need to increase our presence at the actual hearings to communicate our reasons better and more directly to the board. However, with our present resources, this has not been possible.\nSince the Data Protection Act was passed, no photos of buildings that are the subject of applications are uploaded and this has become an administrative issue for DLĦ because it is now unable to scrutinise and judge if a building is worthy of retention or not. Would you say this is an infringement of our right to know and access information? And what are you doing about it?\nWe have written to the chairman and CEO of the PA about it but we should take it further. We have had to rely on our interpretation of the drawings only. Photographs are so helpful, and it is ridiculous to say they are violating someone’s right to privacy. I believe it is an infringement of the public’s right to access information.\nThe destruction we are witnessing has been described as the tip of the iceberg. What is actually going under the radar and what lies in store?\nThe problem is that there is a lot of money out there, and speculative construction projects are perhaps the best way to invest it. This is creating the current situation, where investors are buying entire rows of houses and large plots of land to do something that will earn them more money. There is no consideration for the needs of the community or the locality, nor of the consequent changes, both physical and social, these projects will bring.\nWe should be looking at what Malta needs rather than how much money will be made, and here the regulator is greatly to blame. Our health is suffering from this excessive construction, and this was one of our resolutions at the AGM last week: to protect well-being and quality of life.\nThe other five were to strengthen protection of cultural and natural heritage at law; to urge the PA to fulfil the role it was created for; to request that best options be sought for a Malta-Gozo permanent link; to protect the coast and foreshore from land reclamation; and for the protection of historic buildings and urban conservation areas through the creation of buffer zones.\nWhat was your parting shot at the AGM?\nAmong other things, I mentioned the recent hoarding at Malta International Airport, which consists of dozens of photos of Maltese doorways. It is so ironic that these very doorways, which are threatened and going down like dominoes every week, are chosen as the image to welcome visitors to our country.\nWe must recognise the value we have in our traditional streetscapes, which are truly unique, and give them the appreciation they deserve. Soon these will be only photos on hoardings and in coffee-table books. We are being incredibly short-sighted in allowing this to happen.\nYou will shortly be passing on the baton to a new president. What is your advice to the person who is stepping into your shoes and what are you expecting from his approach?\nThe new council has been elected and the president will be appointed at our first council meeting. There will be many challenges ahead as the issues of the Gozo tunnel, mega projects, land reclamation and the destruction of more historical buildings and gardens come to the fore.\nI am sure, though, that the new executive president will take this on with the characteristic level-headed yet impassioned approach that has distinguished DLĦ since its formation 54 years ago. The team spirit on council will ensure a supportive backing so that the many aims of the organisation will continue.\nDespite all these efforts, where do you see Malta from an environment and heritage point of view for the next generation? What have we already lost? And what can we still stand to gain?\nI think Malta is at a make-or-break point – we either stop the destruction and degeneration from overdevelopment now or we live to regret it. What we aren’t realising is that what we are destroying, as shown on the photos on the hoarding at the airport, is a valuable asset, which we have the duty to pass on to our children. It is what gives us identity, but instead of being proud of it and protecting it, we prefer to destroy it for immediate profit.\nThe natural environment is not faring any better, with the constant eating away at ODZ and the threat to many pristine agricultural areas and aquifers by more and more development. As you well put it in your article about Villa Barbaro in Tarxien, we are, indeed, in danger of losing our soul.", "comment_count": 30, "id": 785}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Pop a raisin into your mouth, close your eyes and focus on its tantalising flavours – it may help you cope with anxiety and stress.\nThis simple step is one of the exercises used in mindfulness, a tool to help people learn how to get in touch with their emotions and focus on the here and now. And it is a skill that would benefit children in a considerable way, en-abling them to cope with not only school situations but those they encounter as adults.\nThis is one of the reasons that mindfulness is being added to the curriculum in 370 schools in the United Kingdom, helping students to learn “relaxation techniques, breathing exercises and other methods to help them regulate their emotions”.\nA recent survey commissioned by the British National Health Service found that one in eight children in England between the ages of five and 19 suffered from at least one mental disorder at the time of their assessment in 2017.\nTo help them regulate emotions\nWould it help in Maltese schools? Yanica Richards Chircop, a manager and family therapist at the Richmond Foundation, which supports those with mental health issues, certainly thinks so.\n“I often use it with our clients here and have found it to be a very effective tool,” she said.\nMindfulness is all about awareness of one’s own feelings – something that is increasingly under threat in our ‘always on’ digital life.\nBut it also has a whole other scope when seen in the context of children who find it hard to cope with their anger or fear, which may result in disruptive behaviour or depression.\nResearch also shows that drop-out rates are lower in schools where mindfulness has been adopted and performances are better. There is also evidence that creativity is boosted over the longer term.\nMs Richards Chircop believes that interventions can be simple. For example, mindful eating would be a simple way of getting children to learn how to zone out when they need to.\n“A lot of people think that mindfulness is about meditation but that is actually just one of the many tools,” she remarked, adding that even mindful walking could be positive.\nThe possibilities range from introducing mindfulness into the curriculum in its own right, just as PE and PSD are, or offering short breaks for exercises between classes and during break.\nA big bonus is that the concept of helping students with non-academic issues has the support of the Malta Union of Teachers.\nUnion president Marco Bonnici told Times of Malta that, while it would not comment on specific programmes, the MUT had already suggested that the Ministry for Education and Employment should find ways to address issues such as substance abuse, bullying and also mental health problems of students.", "comment_count": 6, "id": 786}, {"keywords": "", "author": "", "article_body": "A 26-year-old man from Qormi was grievously injured in a fight on the Granaries in Floriana on Sunday.\nAnother two men and a women were slightly injured.\nPolice believe an iron bar was used during the fight, which happened at around 9pm. \nAll four injured people were treated Floriana Health Centre.\nThe police are investigating.", "comment_count": 0, "id": 787}, {"keywords": "", "author": "Claire Caruana", "article_body": "Women were less like to move to Malta for work, a study among expats has found, with the country dropping from third to ninth place in a year.\nIssued annually to mark Women’s Day being celebrated worldwide on Friday, a ranking by expats’ organisation InterNations showed that while last year Malta was among the top three countries women chose for work-related reasons, this year it seems the island has lost some of this appeal.\nAs a result, in this year’s list, obtained through research conducted in 2018, Malta has slipped down to the ninth spot.\nAccording to the organisations, just over half of the expats in Malta claimed they were satisfied with their career prospects on the island.\nSlips down to the ninth spot\nThe rate is slightly higher than that for their male counterparts, it emerged, as only 48% of men living here were happy with their career prospects.\nStill, male expats claimed they were more likely to enjoy a good work-life balance when working in Malta, with 81% saying they were happy with this. InterNations found this dropped to 70% in the case of women working here.\nOn job security, women were found to be only slightly more confident that they would enjoy job stability in Malta, with about two-thirds (66%) reporting they believed their job to be safe. Sixty-five per cent of men said they were satisfied with job security on the island.\nRead: Expats rank Malta high for good work-life balance\nThe report by InterNations comes just weeks after Malta was dubbed “the biggest loser” in a quality of life index by another expats’ group, The Expat Insider.\nIn that report, the country fell from 19th best for quality of life to 38th. According to the researchers, living in Malta was deemed as being “not as peaceful as it seems”.\nOne UK expat even reported that “corruption seems endemic at all levels of society” and an Irish respondent noted that “the horrendous corruption in every aspect of governance is appalling”.", "comment_count": 18, "id": 788}, {"keywords": "", "author": "Ivan Martin", "article_body": "Hackers who broke into Bank of Valletta’s IT systems last month could have tried to keep a ‘back door’ to try to regain access though this was noticed and blocked, the Times of Malta is informed.\nSources close to the investigation into last month’s cyberattack said that in the days after the breach, files were found hidden in the bank’s systems, possibly intended to allow the hackers to regain access at a later stage.\nThe hackers took €13 million from the bank on February 13 and crippled its operations for long hours.\nInvestigations are being carried out by the police, the financial services watchdog, the State IT authority and foreign counterparts to try and trace the missing cash and fish out any flaws in banking security systems.\nRead: How BOV hackers got away with €13 million\nThe hackers are being dubbed EmpireMonkey by investigators due to the use of a hacking tool known as PowerShell Empire, which allowed the group to move around in the bank’s systems after having gained access.\nThe sources said that one potential suspect was the international hacking organisation known as Cobalt Gang, which wreaked havoc on the international banking sector. It is believed to have stolen as much as €1 billion from banks in as many as 40 countries in recent years.\nThe suspect group, the sources continued, had been known to infiltrate international banks’ ATM systems, card-processing networks and the international interbank payment messaging programme SWIFT before executing attacks.\nNew guidelines on security being drawn up\nA review of the bank breach has already indicated that the hackers could have been attempting to infiltrate it as far back as October 2018. The sources said similar ‘phishing’ – a method used to break into a computer system via electronic communication – had first been detected locally some four months ago.\nThis had the same digital fingerprint as the hacking group believed to have carried out last month’s heist.\nThe hacking group was also believed to have targeted another Maltese bank, however their attempts appeared to have been unsuccessful, the sources noted.\nThe sources were quick to point out that banks regularly received such threats and attempts to infiltrate their systems were commonplace.\nTimes of Malta has reported that the hackers were believed to have broken into the Autorité des Marchés Financiers, which regulates the stock exchange in France, last year.\nThey then sent out e-mails to Maltese and French entities posing as the regulator and using an e-mail that included official letterheads and a decoy document which, when clicked on, gave the hackers access to the bank’s systems. The hackers then sought to move hefty sums to international banks in the UK, the US, the Czech Republic and Hong Kong.\nThe sources added the authorities had identified the BOV computers where the malicious e-mails were received and which inadvertently gave the hackers the keys to the vault.\nRead: Just €19 left and 'no access to my own money'\nIt is not yet clear how long the hackers had access to the bank’s systems before the robbery was carried out.\nMeanwhile, sources close to the financial regulator said new guidelines on banking security were being drawn up in the wake of the cyberattack.\n“These sort of attacks can happen but we are concerned that security might be lacking in some of the island’s banking network. For this reason, we are reviewing standards and best practices,” the sources pointed out.\nTimes of Malta reported last week that BOV was closing a number of accounts over the past weeks, mostly in US dollar denominations, citing “client relationship reviews”.\nRead: As cybercrime grows, banks are increasingly being targeted\nAs the island is facing increasing pressure on its reputational risk, particularly due to claims of lax monitoring against money-laundering and proceeds from organised crime, BOV informed some of its clients it would be closing down their accounts.\nClients, mostly international businesses and wealthy individuals, have been told that while the bank will continue to provide banking services in other currencies, it would close their dollar accounts with immediate effect.", "comment_count": 26, "id": 789}, {"keywords": "", "author": "", "article_body": "The following are top stories in Monday’s newspapers.\nTimes of Malta says hackers who broke into Bank of Valletta’s IT systems last month could have tried to keep a ‘back door’ to try to regain access though this was noticed and blocked. In another story, newspaper says a study among expats found women were less like to move to Malta for work, with the country dropping from third to ninth place in a year.\nThe Malta Independent says that although abortion is on the European Socialists’ manifesto, Labour MEP candidates are sticking to the party line.\nIn-Nazzjon leads with PN leader Adrian Delia accusing the government of destroying Malta’s reputation threating the banking and financial services sectors.\nL-Orizzont speaks to Tourism Minister Konrad Mizzi who says the necessary and positive change needed for the country would continue to be sought together with the Prime Minister.", "comment_count": 0, "id": 790}, {"keywords": "", "author": "", "article_body": "A 23-year-old man was grievously injured in a motorbike accident on Sunday.\nThe police said the man, who is from Għargħur, lost control of the KTM 250XC he was riding in Triq Dawret San Pawl il-Baħar, St Paul’s Bay and fell. The accident happened at 9pm.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 791}, {"keywords": "", "author": "", "article_body": "A 48-year-old man was grievously injured in a gas explosion at a residence in Paola on Sunday.\nThe police said the explosion was in Triq Nazzarenu at 9pm.\nMembers of the Civil Protection Department and the police went on site and the victim, who is from Paola, was taken to hospital by ambulance.\nThe police are investigating.\nJust last week, a man died when a gas heater in his Msida apartment caught fire. ", "comment_count": 0, "id": 792}, {"keywords": "", "author": "Keith Micallef", "article_body": "A General Workers’ Union subsidiary company has been found guilty of unfair dismissal with respect to an employee who claimed she was fired for the sole reason of becoming pregnant during her probation period.\nGiada Mifsud Calabrò has been awarded more than €10,000 in damages by the Industrial Tribunal after she felt aggrieved by the decision to terminate her employment at Union Print Company Limited.\nIn February 2016, Ms Mifsud Calabrò had been engaged as a sales executive by the GWU subsidiary for a period of two years on a full-time basis.\nDuring proceedings, the tribunal, presided over by Franco Masini, heard that she was contractually bound to sell €75,000 of adverts in her first year. However, in August, just before the six-month probationary period was due to expire, she was notified that she was being fired on grounds of non-performance.\nThe fact that such a decision was communicated to her days after she had notified Union Print about her pregnancy left no doubts about the reason for her dismissal, the employee claimed.\nOn its part the company insisted that it had abided by the law which states that in case where there is good and sufficient cause, a pregnant employee can be fired during probation, as long as the grounds for her dismissal are specified. While denying Ms Mifsud Calabrò’s claims, the company insisted that prior to terminating her employment, she had been warned various times about her poor performance.\nIn its decision the tribunal noted that according to the law, in cases where a pregnant employee sought redress, it was up to the employer to prove that such a decision was not related to pregnancy.\nTo this end, GWU president Victor Carachi testified that the only reason why Union Print sacked the employee was “based purely on performance and nothing else”.\nAs a matter of fact, during proceedings it emerged that Ms Mifsud Calabrò had only sold €9,500 worth of adverts. Though the latter complained that at first she could not carry out her duty due to problems with her laptop computer, it was established that this situation was resolved after a week. Furthermore, the tribunal heard that apart from the plaintiff, one of her colleagues had also missed the sales target, but the latter was not fired.\nA crucial element in the case was the lack of monthly targets in the employment contract. Such consideration was made by the tribunal in the wake of the fact that in her letter of discharge, Ms Mifsud Calabrò was told that the volume of sales reached was just “25 per cent of what is expected as the norm”.\nIt was pointed out that this “norm” had not been established or quantified by the employer. Had Union Print wanted to quantify the employee’s performance after six months, it should have listed the mid-year target as part of the wider objective of reaching €75,000 in annual sales, the tribunal said.\nIn view of this, the employee’s complaint was upheld and the company was ordered to pay €10,486 in damages.", "comment_count": 0, "id": 793}, {"keywords": "", "author": "Keith Micallef", "article_body": "As plans for a new resort to replace the Mellieħa Bay Hotel remain under wraps, no residential, office or commercial development is allowed on this prime site of ecological importance, according to the conditions laid down in a 1963 emphyteusis agreement.\nUnder the agreement, the government had leased a massive tract of public land to Beaufort Investment Trust for 150 years for the construction of the existing hotel. An annual ground rent of £150 had been set.\nLast month The Sunday Times of Malta reported that after precisely 50 years of operations, this iconic hotel opposite Malta’s most popular beach, Għadira Bay, is set to close down after the summer and the complex demolished.\nThis project is unfolding at the same time as other major players in the Maltese tourism sector, Corinthia Group and db Group, are forging ahead with massive developments comprising a mix of residential and  commercial elements alongside high-end hotels.\nAs in the case of the Mellieħa Bay Hotel, these developments were possible following the transfer of public land to each company. The Corinthia’s original agreement with the government, struck in the mid-1990s, was exclusively for tourism development but the government is now offering new conditions that would allow residential units to be built.\nA spokesman for Mellieħa Bay Hotel, which is part of Alf Mizzi & Sons Group, had said the company was looking into a new project consisting of the building of a brand new five-star resort hotel that will be a major addition to Malta’s tourism product.\nThere are no indications so far that residential or commercial elements will be part of the project. Any plans there might be have not been published and the company has not yet filed a development application. \nA few days ago, The Sunday Times of Malta made a fresh request for details about the planned resort but no reply was received from the company by the time of writing.\nHowever, the 1963 emphyteusis agreement had established strict parameters on what kind of development could take place at this site.\nSpanning over 147 tumoli, this site at Tal-Aħrax in the limits of Mellieħa had been transferred to Beaufort Investment Trust on condition that the company used the land “exclusively for the purpose of tourist development”.\nFurthermore, the agreement stated that the tenant was bound to build “a self-contained first-class tourist resort hotel with public rooms and single and/or double bedroom accommodation for not less than 420 guests”.\nApart from this massive plot, of which the hotel occupies about a third, the company recently acquired a nearby property in Għadira Bay, formerly housing the Costa Del Sol Restaurant.\nThough a development application has yet to be filed, according to the Planning Authority website an old application from 2007 is still pending. Back then the hotel had sought to extend the existing complex by 98 units, by constructing two additional blocks – one next to the bowling green and the other next to the pool area.\nHowever, the proposal had prompted the objection of the Planning Authority’s Heritage Advisory Committee which had recommended refusal. The application was considered to be proposing an extensive development on relatively unspoilt natural garigue land and maquis.\nThe committee had also based its objection on the grounds that the site was scheduled as an area of ecological importance.\nThe application was passed on to a case officer to assess the proposal in terms of the Strategic Plan for Environment and Development and other established policies.\nMeanwhile, the last documents submitted by the developer date back to January 2016. A month ago The Sunday Times of Malta had asked Mellieħa Bay Hotel if this application had been shelved but no reply was received.", "comment_count": 16, "id": 794}, {"keywords": "", "author": "", "article_body": "Miguel Debono, a Maltese consultant in endocrinology and diabetes in the UK, has obtained a prestigious grant from the National Institute for Health Research to assess the use of a new test to identify patients who suffer from a condition known as adrenal insufficiency.\nThe grant of a quarter of a million pounds (€290,000) will fund the study that aims to implement the test as part of everyday clinical care throughout the UK. It is estimated that the test will save the NHS around £10 million (€11.6 m) every year.\nDr Debono, Honorary Senior Lecturer at Sheffield Teaching Hospitals and the University of Sheffield, achieved top place, outperforming 13 other major centres in the UK in a highly competitive funding call.\nThe doctor is a lead specialist in the stress steroid hormone cortisol. Over recent years, he has established himself as a worldwide expert in the area. He has been invited to deliver presentations at both national and international conferences and has published seminal research studies in major endocrinology journals.\nAdrenal insufficiency (AI) is when the body is unable to produce cortisol, an essential hormone for overcoming stress, including illness and injury. Left untreated, the body can no longer regulate blood sugar, control blood pressure or reduce inflammation, increasing the risk of emergency admission, cardiac arrest and possibly death.\nAI is currently diagnosed in hospital by a laborious test involving taking blood to measure cortisol before and 30 minutes after an injection. Misdiagnosis and delayed diagnosis are common.\nThe aim of Dr Debono’s research is to provide a patient friendly, more convenient, cheaper salivary test to replace the use of the complex tests for the majority of patients.", "comment_count": 5, "id": 795}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Nearly 2,000 people have signed a parliamentary petition opposing the planned tunnel between Malta and Gozo, which they claim would cause “irreversible harm”.\nThe petition calls on legislators to prevent the permanent link from being built, warning that the tunnel would bring with it increased traffic, noise and air pollution.\n“The tunnel means fewer unspoiled areas, parking spaces and affordable places to live,” the petition states. “The tunnel means the destruction of Gozo as we know it, simply to line the pockets of private investors, developers and speculators.”\nRead: Malta-Gozo tunnel plans should be ready within six months\nThe petition also questions why there has been no consultation period or referendum, why alternatives such as a fast ferry or catamaran were not considered, and why the Gozitan people had not been asked for their opinions.\n“This island has a precious and unique charm - we must not let it be spoiled by greed,” it states.\nGovernment plans for a 13-kilometre tunnel running from Manikata to Nadur, which could be completed within five years, have drawn criticism over the effect of increased traffic on the sister island, as well as environmental impacts at the entrance and exit points.\nRead: Tunnel could run from Manikata to Nadur\nCritics have also raised concern about the massive amount of construction waste the project would generate and the controversial prospect of land reclamation being presented as the only means of addressing the issue.\nStudies, however, have consistently pointed to high levels of support for the project.\nA Social Impact Assessment carried out by Marvin Formosa in 2017 found that around 82 per cent of Gozitan respondents were in favour of the tunnel, with most citing reduced travelling times between the two islands and the lack of weather-related disruption compared to the ferry.\nRead: Seven bids for experts to help in Gozo tunnel preparations; talks underway for fourth ferry\nA later study by Vincent Marmara for Transport Malta confirmed these conclusions and also found similar levels of support among Maltese people. The vast majority of respondents said they would travel between Malta and Gozo more frequently if the tunnel were to be built.\nAlthough environmental studies are still being carried out, the government has made clear its intentions to forge ahead with the project, with a call for tenders planned to be issued in the coming months.\nPrime Minister Joseph Muscat has said the tunnel will be followed by the introduction of free public transport linking Gozo to the airport, Mater Dei Hospital and other strategic locations across Malta, but has ruled out the inclusion of a rail system.\nWatch: Gozo tunnel will be built and run by the private sector\nRead: Immersed Gozo tunnel ‘would cater for a monorail’", "comment_count": 129, "id": 796}, {"keywords": "", "author": "Jacob Borg", "article_body": "An investigation by the Mental Health Commissioner into the involuntary committal of former police officer Mario Portelli is still ongoing, The Sunday Times of Malta is informed.\nMr Portelli filmed the moment three police officers came to his home to haul him off to Mount Carmel last month.\nHis involuntary committal came after Mr Portelli posted a flurry of videos on Facebook in which he said he was going to confront Prime Minister Joseph Muscat about the Egrant case.\nQuestions have been raised by mental health practitioners about whether all the necessary procedures were adhered to prior to Mr Portelli’s committal.\nThese procedures necessitate that a doctor would have reviewed the person and recommended hospitalisation as the only reasonable course of action to preserve life and safety. The doctor would also establish that there are no safe alternatives that are less restrictive.\nThe Mental Health Commissioner confirmed to The Sunday Times of Malta on Friday that his investigation was still under way.\nHealth Minister Chris Fearne told the newspaper that the commissioner would inform him about the outcome of the investigation in the coming days.\nDr Fearne said the results of the investigation would not be published due to patient confidentiality reasons.\nIn a statement, the alliance for mental health requested both the Mental Health Commissioner and the police board to officially investigate and to ascertain that all procedures were adhered too.\nA spokeswoman for the police declined to say if Mr Portelli’s committal to Mount Carmel had been pre-authorised by a psychiatric team.\n“Kindy note that due to investigations being carried out, it’s not prudent to divulge further information regarding this case,” a police spokesman said.\nRead: Toxic oppression taken to new level - Godfrey Farrugia\nPD MP Godfrey Farrugia, who is familiar with Mr Portelli’s case, said on Facebook that the former PC did in fact arrive at Mount Carmel with the necessary documentation but that this was only because they took the “irregular” step of stopping at Mater Dei Hospital en route to sort out the paperwork with the patient in tow.\nMr Portelli’s parents have insisted that all the necessary procedures were adhered to.", "comment_count": 122, "id": 797}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A 20-year-old man’s wish to do missionary work in Africa came true 40 years later and he cannot wait until he retires to continue helping schools update their libraries.\nLaurence Zerafa took time off from his role as head Mcast librarian to spend a year helping a post-secondary Catholic mission school administered by the Salesians of Don Bosco to restructure its library.\n\nBy introducing an electronic system at the library in Dodoma, Tanzania, the 60-year-old hopes that students who can’t afford to buy their own textbooks will be able to find these books at their school’s library more easily.\n“Since turning 20, I had always wanted to carry out some missionary work outside of Malta, and while I managed to do voluntary work in Palermo, Cairo and Alexandria, studies, career and other things got in the way and I was only able to go to Africa for a whole year between 2017 and 2018,” he told The Sunday Times of Malta.\nMr Zerafa, whose past careers include pharmaceutical work and lecturing, headed to Tanzania after enrolling with the church-NGO Voluntiera Lajċi Missjunarji.\nWhile Mr Zerafa was helping to electronically catalogue books, the library was undergoing structural works with the help of an architect and an engineer who had been sent over as part of the Polish Aid programme.\nIn the area he was in, many families get by with $1.90 a day, pulling through with the bare necessities\nWhile at the school Mr Zerafa also helped train staff, with whom he is still in touch.\nBelief in social justice and sharing whatever one has with those who have less is what drives Mr Zerafa. Asked why he did not do such work in Malta instead, he said the needs in East Africa were bigger.\nIn the area he was in, many families get by with $1.90 a day, pulling through with the bare necessities.\nThose who manage to pay their way through secondary school, or get sponsored, do not always manage to get the textbooks required to complete their studies. At the same time, some libraries have multiple copies of the same books – sometimes running into tens of copies – that are just lying around in boxes.\nAs a result of electronic cataloguing, libraries are not only better able to control what books are being lent or returned, but some can be transferred to other libraries.\nBefore heading back to Malta, Mr Zerafa toured libraries at other secondary schools and colleges run by the Salesians in other cities to get an idea of what help was required, and he hopes to return after his official retirement in April.\nHe called on others who can volunteer for a year to get in touch with the VLM at 7, Triq il-Merkanti, Valletta or 2123 6962.", "comment_count": 12, "id": 798}, {"keywords": "", "author": "Claire Caruana", "article_body": "There are currently 27 supply teachers at the migrant learners unit, the highest number of all schools by a wide margin.\nThe supply teachers were recruited after the number of regular teachers at the unit was not enough to cater for the 500 students in primary schools all over the island following a specialised induction programme, a government spokeswoman told the Times of Malta.\nThe Education Ministry spokeswoman was replying to questions after figures tabled in Parliament by Education Minister Evarist Bartolo, in reply to a PQ by Nationalist MP Clyde Puli, showed that the highest number of supply teachers was at the migrant learners unit.\nAn increased demand for educators\n“The migrant learners unit co-ordinates the induction programme for migrant students who enter the education system with no knowledge of English or Maltese.\n“The service is offered in a number of primary schools through induction classes within the same primary schools,” the spokeswoman said.\nAsked if the high number of supply teachers suggested that educators were unwilling to take up teaching such subjects, the spokeswoman insisted that “as is always the case for all subjects”, supply teachers are recruited when the supply of regular teachers “did not meet the demand”.\n“Since this service is a new one to cater for the latest realities being faced by our society, there has been an increased demand for educators in this area which inevitably lead to the recruitment of supply teachers,” she said.\nThe spokeswoman added that in one particular college, “due to space limitations”, the programme is run in “an annexe of the primary school”, pointing out that the service is offered at various schools.\nIn total, there are currently 221 supply teachers at various colleges across the country. Apart from the number of supply educators at the migrant learners unit, there are also 19 supply teachers at the Alternative Learning Programme at the St Thomas More College in Paola.\nA breakdown of all subjects also shows that the majority of supply teachers, 58, taught primary students while a further 30 taught physical education.", "comment_count": 0, "id": 799}, {"keywords": "", "author": "", "article_body": "A 75-year-old man was grievously injured in a fall at a residence in Mqabba on Sunday.\nThe police said the man, who is from Mqabba, fell from a height of around a storey-and-a-half while carrying out some work in the house, in Triq Ħal Kirkop.\nHe was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 800}, {"keywords": "", "author": "Claire Caruana", "article_body": "A 43-year-old man was on Sunday afternoon denied bail after he pleaded not guilty to stealing from a supermarket last week. \nLudwig Bugeja, an unemployed man from Paola, was charged with thefts on two occasions from Carters Supermarket. Mr Bugeja pleaded not guilty. \nAccording to Inspector Sarah Zerafa, the supermarket reported two thefts last week. The man was arrested some days later after he was spotted at one of the supermarket chain's outlets, after he was recognised from CCTV footage. \nInspector Zerafa said that the man was held at the supermarket until the police showed up to arrest him. \nOnce at his home, the police confirmed he was the man on the CCTV footage from the clothes found at the house, the inspector said, adding that the police, however, did not find any of the items that were reported stolen. \nMagistrate Natasha Galea Sciberras turned down a request for bail by legal aid lawyer Josette Sultana. \nArguing against the request for bail, Inspector Zerafa said that not only did he accused have no possessions, but during investigations it emerged that while drug paraphernalia was found inside his home, no food or any other such good were found, which suggested that he was likely spending all his money on drugs. The man was also not willing to collaborate with the police.", "comment_count": 0, "id": 801}, {"keywords": "", "author": "Claire Caruana", "article_body": "A man on Sunday pleaded guilty to trying to leave Malta with more than €18,903 in undeclared cash on Saturday, of which the court ordered he pays a quarter as a fine.\nAccording to the law, amounts of more than €10,000 in cash need to be declared by those leaving the island.\nNasr Khalifa Abubaker was on Saturday found - in possession the cash as he was about to board a plane to Libya.\nInspector Brian Camilleri, who prosecuted, said that he was informed that cash control inspections were being carried out at the airport and it was then that the accused was asked whether he was carrying more than €10,000, which he immediately admitted that he did. He then voluntary gave up the €18,903.\nHanding down the sentence, Magistrate Natasha Galea Sciberras, who presided over the case, ordered Mr Abubaker to pay a quarter of the sum confiscated immediately.\nLawyer Gianelle Scerri Ferrante assisted the accused.", "comment_count": 0, "id": 802}, {"keywords": "", "author": "Denise Grech ", "article_body": "Hard-working people in the middle class are being pushed into poverty, Opposition leader Adrian Delia warned on Sunday.\nSpeaking during a short phone-in interview, the Nationalist party leader said there was a new form of poverty forming - one where those who were educated and employed were still struggling to make it to the end of the month.\n\"These are the realities we are meeting every day,\" Dr Delia said.\nLong-term planning was needed, but those who were struggling financially could not be told to wait 10 or 20 years for change, he said.\n\"We will continue to call for a long-term plan while being sensitive to the realities of these people,\" he said. \nTurning to a report by the International Monetary Fund calling for urgent action on the financial sector, Dr Delia said the government was ruining Malta's reputation internationally.\nA critical IMF report earlier this week warned anti-money laundering rules needed to be strengthened.\nBanks were suffering as a consequence, Dr Delia said, adding people were finding it hard to open accounts. \nTurning to a recent Ombudsman's report noting a selection process in the Armed Forces of Malta had been a \"screen\", Dr Delia said institutions had been captured by the Labour government.\n ", "comment_count": 17, "id": 803}, {"keywords": "", "author": "", "article_body": "Savage winter storm\nWidespread damage was reported across Malta as trees were uprooted, buildings flooded and boats and structures damaged by gale-force winds and large waves that lashed the island on Sunday. Several roads were closed, the power supply was cut in various localities and farmers reported extensive damage to crops.\nWhat made the headlines\nFisheries racket – tuna rancher named: Spanish investigators stumbled upon evidence that a Maltese tuna rancher could also have been involved in an EU-wide fisheries racket during investigations into a rogue Spanish operator last year. According to documents submitted in a Spanish court, Malta Fish Farming Ltd (MFF) was also identified in wire tapped phone calls as a supplier of illegal tuna to the Spanish market alongside Spanish-owned company Mare Blu. The Spanish probe has also pointed a finger at former Fisheries director general Andreina Fenech Farrugia, saying she had allegedly solicited bribes from Mare Blu tuna farm in return for higher fish quotas. Both MFF and Dr Fenech Farrugia deny the allegations.\nFabrizio Scirè after the incident.\nPolice investigated following alleged ‘beating’: An internal police investigation is being conducted following serious claims of police brutality in Żebbuġ, the Times of Malta revealed. The claims are accompanied by video footage in which eight officers from the Rapid Intervention Unit are seen manhandling and violently pushing two men, a Sicilian businessman and his son, with two officers clearly seen punching and striking blows at the men. The businessman, Fabrizio Scirè, who has a construction company, said one of his trucks had caught fire and when he asked the police, who were already on site, to help him move his other vehicles he was called names, punched and kicked. A magistrate is also investigating the allegations.\ndb Group project gets conditional approval: The planning appeals tribunal ruled that the db Group’s St George’s Bay mega-development could go ahead, but demanded fresh clearance from the transport authorities. Deciding on an appeal lodged by NGOs and local councils opposed to the project, the Environment and Planning Review Tribunal confirmed the controversial permit issued last September for the €300 million project, which includes a 37-storey tower and 17-storey hotel. The EPRT, however, said Transport Malta would need to certify that the “existing road network” was sufficient to cater for the increased traffic that will be generated by the development.\nBOV closing dollar dominated accounts: Bank of Valletta has been closing down a number of accounts during the past weeks, mostly in US dollar denominations, citing “client relationship reviews”, the Times of Malta revealed. A spokesman for the bank said that while BOV extends services in various currencies to a full spectrum of clients, it manages and maintains relationships and accounts within its risk appetite framework.\nBrussels signals ‘limited economic progress’: The European Commission warned that the current economic growth registered by Malta needs to be accompanied by substantial reforms if it is to remain sustainable. In its annual assessment of Malta’s economic and social performance, the Commission insisted that progress was needed to tackle reputational problems connected to corruption and money laundering, as well as shortfalls in skills, labour and education attainment levels.\nMan of Maltese descent stabbed to death in the UK: A man of Maltese descent was stabbed to death in the UK on Tuesday afternoon. St John Lewis, who turned 45 last Sunday, was attacked by a couple on his way home in his hometown in Bramley, Leeds, his father, Alfie Lewis, 72, who lives in Ta’ Xbiex, told the Times of Malta. A 48-year-old man and a 45-year-old woman have been arrested in connection with the incident. \nIMF warns against centralisation of power at MFSA: The International Monetary Fund (IMF) warned against the centralisation of supervisory functions around the MFSA’s CEO role. In a report it said Malta’s financial regulator should maintain a committee tasked with supervisory and enforcement powers to enhance checks and balances in the decision-making process. All supervisory powers currently vested in the MFSA’s supervisory council are planned to be transferred to the MFSA’s executive committee, chaired by CEO Joe Cuschieri and made up of five MFSA staff members, the IMF report noted.\nRising risk of poverty among vulnerable groups – IMF: Vulnerable groups like single women with children, low-income tenants and the elderly are experiencing rising risks of falling into relative poverty, according to a study by the International Monetary Fund. The IMF found that, as the share of population suffering from material deprivation had been declining, the proportion at risk of relative poverty (those earning less than 60 per cent of the median income) had been “increasing continuously”.\nWhat trended\nWeather dominates the headlines\nIt was a tough week for non-weather related news, with the storm of a generation soaking up headlines and readers’ attention.\nAs people huddled indoors, safe from the pounding wind and rain, Patrizia urged fellow readers to be considerate.\n“Please be sensible to not order take aways,” she suggested, adding the people should also avoid needless driving as it might force tow-truck drivers onto the roads.\n“They have families too!” she reminded people.\nFrankie thanked the heavens for having opened up on a Sunday.\nWeather is likely to become more extreme and more frequent in future\n“Think about the aftermath for commuters if it would have happened during a midweek working day,” he wrote. “We would still be counting deaths and searching for dispersed people”.\nWith electricity supply disrupted, trees blocking roads and coastal areas flooding, a bus delay warning came as no surprise – least of all to witty Andre.\n“That disaster happens 365 days a year,” he quipped.\nAs calm returned to Maltese shores, attention turned to the aftermath, as people began tallying up the destruction.\nA kiosk-owning couple’s misery – their livelihood was reduced to a mere husk – prompted a flood of sympathy and notes of encouragement.\nNot that everyone was positive.\n“Amazing to see the public pavement free from tables and chairs. Maybe like it legally should be,” wrote C., who is clearly no fan of seaside kiosks.\nMarianna argued it was time buildings close to the shore were built with such extreme weather events in mind.\n“Weather is likely to become more extreme and more frequent in future,” she wrote, with climate change weighing on her thoughts.\nThey say every cloud comes with a silver lining, and for several carefree fishermen, this storm cloud’s bright spot came in the form of a bounty of escaped farmed sea bream.\nNo matter the health warnings, people rushed out to catch the fish, reminding Martin of a story about a similar incident in Oklahoma.\n“A herd of goats invaded a cemetery and ate all the flowers. The rancher moved most of them out, leaving only a few stragglers to be rounded up later,” he wrote.\n“The townsfolk, well accustomed to shooting wild deer, saved him the trouble by re-stocking their freezers”.\nWhat they said\n“It is not acceptable to be given accommodation in tents. This is out of the question completely.”\nPrime Minister Joseph Muscat, speaking on One Radio, where he made it clear that if adequate living conditions were not provided for non-EU nationals employed by the construction industry, no work permits would be issued.\n“The wind was so strong and the waves were crashing in. You stand here seeing things get destroyed and you can do nothing. I felt helpless.”\nLiliana Tanti, owner of a kiosk in St Paul’s Bay which was destroyed by the pounding waves and wind during Sunday’s savage storm.\n\n“Is this the best of times, with children, the police and workers all in containers? Was this Joseph Muscat’s vision.”\nNationalist Party leader Adrian Delia, speaking on Net FM, where he criticised the fact that children were being taught in mobile classrooms, the Marsascala police station was in a mobile structure and workers were sleeping in mobile homes. \n“We need to incentivise people to ensure better forward planning. We cannot afford to have all of Malta become Buġibba and Qawra.” \nMalta Developers Association president Sandro Chetcuti addressing the lobby’s annual general meeting, where he said the country had failed at planning.\n\n“Did you ever hear criticism against my male predecessors because of their attire, because they wore a red, black or grey tie? Women should be evaluated by their substance not by their looks.”\nPresident Marie-Louise Coleiro Preca, who leaves office in April, speaking on Times Talk, where she claimed she had been unjustly criticised during her five-year presidency.", "comment_count": 1, "id": 804}, {"keywords": "", "author": "Denise Grech ", "article_body": "An International Monetary Fund report sounding warnings about shortcomings in the financial sector \"needed to be taken into context,\" Prime Minister Joseph Muscat said on Sunday.\nSpeaking during a call-in on One Radio, Dr Muscat said the report, coupled with the Venice Commission report, were \"like an exam\", where the teacher pointed out what students did right or wrong.\nRead: What rule of law experts said about Malta - and why it matters\nThe IMF earlier this week insisted “urgent action” was needed to address shortcomings in the banking supervision by the Malta Financial Services Authority. It also warned anti-money laundering rules needed to be strengthened through a multi-prong approach.\nConceding there were \"weaknesses\" the country needed to address, Dr Muscat said the reports were not too critical when taken in the context of other countries.\nTurkish workers\nReports of Turkish construction workers flown in to work in a quarry in Mqabba led to the discovery of a legal loophole that could give rise to abuses, Dr Muscat added.\nThe Sunday Times of Malta had revealed plans by TACA to import some 2,500 Turkish workers over the coming months. Discussions were held with the government’s employment agency, Jobsplus, to \"fast-track'' the required permits.\nWhile he did not go into the merits of the law, Dr Muscat explained the government would be seeing how to address the shortcomings.\n\"The issue revolves around the fact companies are not findings Maltese workers,\" he said.\nAs more children graduated, it was normal for them to look for a more \"comfortable job\", rather than construction work, he noted.\n\"But if we don’t want to do it because we are moving forward, then someone has to do it,\" Dr Muscat said.\nTurning to upcoming MEP and local council elections, Dr Muscat encouraged candidates not to take a win forgranted because of survey results.\n\"Don't count your chickens before they hatch,\" the Prime Minister said.", "comment_count": 88, "id": 805}, {"keywords": "", "author": "", "article_body": "As Malta’s authorities engaged in an open discussion on how this nation should treat law-abiding cannabis users with dignity, a Maltese academic risked tarnishing the name of an entire university faculty just to promote his personal anti-cannabis stance, ReLeaf, Malta's legalisation movement said.\nIt was referring to a statement by the Dean of the Faculty for Social Wellbeing, Andrew Azzopardi's on Friday in which he said regulating the use of cannabis around a harm reduction rationale would not solve anything and the dangers of the underground illicit drug trafficking would remain active and lively.\nReLeaf said it would continue to condemn any and all harmful comments that could only result in the perpetuation of a stigma that forced Maltese cannabis users to remain hidden out of fear of being judged, fired from their jobs, and kicked out of their families.\nRead: Legalising cannabis would be waving a white flag - Caritas\n\"We also strongly condemn misuse of the name of a University Faculty that, we believe, is meant to help push society forwards, and not take Malta backwards into darker, more judgemental times... regressive comments like these are based on outdated literature and disproved arguments based on fear.\"\nReLeaf reiterated its call for a strong educational campaign to combat such harmful, \"holier-than-thou\" rhetoric, since this aimed to interrupt the incredible efforts being undertaken by numerous individuals who hoped fora better future where cannabis users could live in peace, recognised as the non-harmful and equal citizens they were.", "comment_count": 44, "id": 806}, {"keywords": "", "author": "", "article_body": "Nadur's spontaneous carnival was bright, loud and as cheeky as ever this year.\nHere is a look at some of its highlights.\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Anaca Photography, https://www.anacaphotography.com\nPhoto: Mario Mercieca\n ", "comment_count": 12, "id": 807}, {"keywords": "", "author": "", "article_body": "The UK’s Financial Conduct Authority is investigating whether Ariadne Capital Limited, a venture capital firm that collapsed at the end of 2017, breached rules governing the promotion and management of investments, The Sunday Times (of London) reported.\nThe firm was run by Julie Meyer, whose Ariadne Capital Malta Ltd was last year stripped of its licence by the Malta Financial Services Authority for breach of conditions.\nThe MFSA also removed Ms Meyer’s fund Ariadne Capital ECO2 VC Limited Partnership and its four sub-funds: 2SQRS Venture Fund, ECO2 Fund, JGV Tamar Fund, and Sustainable Aviation Fund from the list of Notified Alternative Investment Funds because of “serious deficiencies in its governance structures”.\nThe newspaper reported that Ariadne Capital was founded in 2000 as an investor and adviser to early stage businesses. It also ran the Entrepreneur Country networking platform. It failed after one of its suppliers, GQ Employment Law, issued a winding-up petition. Unsecured creditors are expected to lose almost £2.2 million.\nMs Meyer is also subject to a separate investigation by the UK government’s Insolvency Service into her conduct as a director while leading Ariadne. Possible sanctions, if any wrongdoing is found, could include her being struck off as a director.\nMs Meyer’s new firm, Viva Capital, a Swiss entity that describes itself as a backer of early stage businesses, has been the subject of a complaint to the Swiss Financial Market Supervisory Authority, the newspaper said.", "comment_count": 6, "id": 808}, {"keywords": "", "author": "Jacob Borg", "article_body": "US prosecutors silently building a money-laundering case against Iranian banker Ali Sadr Hasheminejad were granted a warrant to search his e-mails in April 2014, at a time when Pilatus Bank was in the process of obtaining a category two investment licence from Malta’s financial services watchdog.\nRecent court filings in the case against Mr Sadr show a US court signed off on search warrants demanding access to 16 e-mail addresses linked to the Iranian banker, his family members and associates on April 16, 2014.\nAmong the e-mail addresses mentioned in the search warrants are three accounts linked to Robert Klingensmith, who still appears on the Malta Registry of Companies as one of Pilatus Bank Plc’s directors. \nIn an overview of the investigation justifying the search warrants, investigators noted how Mustafa Cetinel, another individual under their spotlight, served as a director and legal representative for Pilatus Bank.\nThe request for a warrant to access e-mail records described the Hasheminejads as an influential family with substantial ties to the government of Iran.\nSubstantial ties to the government of Iran\nIt was noted in the search warrant filings that US Office of Foreign Assets Control had previously sanctioned several entities in Malta as being fronts for embargoed Iranian entities.\nOfficials from the Malta Financial Services Authority told the European Parliament in April 2018 that there was no way they could have known the banker was under investigation at the time of the licensing process.\nA leaked 2016 FIAU report detailing transfers to a bank account owned by the Prime Minister’s chief of staff Keith Schembri made passing reference to the fact that the banker was being investigated in a “foreign jurisdiction” for money-laundering and illegal money transmission.\nMr Sadr was arrested last March on accusations that he facilitated transactions for a $475 million Iranian-Venezuelan housing project, in violation of US sanctions against Iran.\nProsecutors said in the search warrant request that these transactions involved a variety of non-transparent entities, banks in high-risk jurisdictions and frequently used Swiss bank accounts controlled by Mr Hasheminejad and his family.\nAccording to investigators, an informant from within PDVSA, Venezuela’s State-owned oil company, came forward with documents and information describing the project’s inner workings.\nPilatus Bank shot to prominence in Malta after assassinated journalist Daphne Caruana Galizia said a whistleblower passed on documents from the bank’s safe linking Prime Minister Joseph Muscat’s wife to the mystery Panama company Egrant. A magisterial inquiry concluded last year did not find any evidence to back the allegations.\n ", "comment_count": 37, "id": 809}, {"keywords": "", "author": "", "article_body": "These are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta says the highly controversial minister Konrad Mizzi is actively considering a party leadership bid. In another story, it quotes Repubblika, the NGO that promotes the rule of law, saying that the process of constitutional reform should be led by citizens and not be controlled by politicians.\nMaltaToday also leads with a story saying that Dr Mizzi has told delegates he is considering running for party leader.\nThe Malta Independent on Sunday says suspended Fisheries director Andreina Fenech Farrugia hit out at the perception that she was favouring one operator over others, stating she was accessible to all operators at all times.\nIl-Mument says financial companies are skeptical about moving to Malta.\nIt-Torċa says Prime Minister Joseph Muscat enjoyed double the trust enjoyed by Opposition leader Adrian Delia - 66.1% against 32%.\nKullħadd says the trust the Nationalist Party had created to sell its clubs was still active.\nIllum says Nationalist MP Robert Cutajar has asked for mail sent to the PN headquarters to be checked for drugs and bombs.", "comment_count": 0, "id": 810}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 8.10am, adds Konrad Mizzi's tweet\nThe highly controversial minister Konrad Mizzi is actively considering a party leadership bid, The Sunday Times of Malta has learnt. \nCabinet ministers and Labour Party delegates confirmed that Dr Mizzi, a former deputy leader, had made contact with them to ask for their support should he decide join the contest for control of the Labour Party. \nA few party heavyweights have already indicated they would in fact support a potential bid by Dr Mizzi, sources said. However, none of them are believed to form part of the Cabinet of Ministers but are among the 750 party delegates who vote in leadership elections.\nContacted on Saturday, Dr Mizzi declined to comment on the matter. Instead he said he was “fully behind Joseph Muscat’s leadership, his direction and vision”. \n“I am and will continue working on an active campaign to convince Joseph Muscat to stay on. I have no doubt this campaign will gain momentum,” he told The Sunday Times of Malta. \nThe Tourism Minister was a star member of the 2013 Cabinet but his name soon became synonymous with alleged corruption following the 2016 Panama Papers scandal which exposed how he had set up secret offshore financial structures while he was tasked with negotiating major government contracts. \nAlthough he has repeatedly protested his innocence, Dr Mizzi has faced relentless pressure to resign, even after being re-elected to Parliament in the 2017 general election.\nMinister made contact with party delegates\nIn the wake of the Panama Papers scandal, the Prime Minister had refused to sack him but in a 2017 Cabinet reshuffle removed him as energy minister and made him minister without portfolio. Dr Mizzi also stepped down as deputy leader of the PL. He has since been given the tourism portfolio.\nHe now joins other potential candidates – MEP Miriam Dalli, deputy Prime Minister Chris Fearne, Transport Minister Ian Borg, and Dr Muscat’s legal adviser and Labour backbencher Robert Abela – should the Castille hot seat be vacated anytime soon. \nMeanwhile, party insiders said Dr Mizzi had recently been involved in a heated meeting with Prime Minister Joseph Muscat during which the Tourism Minister was urged not to contest any future leadership positions.  \nKonrad Mizzi and Joseph Muscat are said to have had an ‘argument’ over the matter\nThe sources said the conversation, described by one as an “argument”, ended in Dr Muscat instructing Dr Mizzi not to run. \n“It surprised us when we heard that Konrad [Mizzi] was making calls despite being told not to,” one veteran party source said.  His chances of actually winning a party election were described by Labour veterans as “beyond slim”. \n\nIn a tweet on Sunday, Dr Mizzi denied there had been a meeting between him and Dr Muscat.\nThe issue of who will take over from Dr Muscat at the helm of the party first cropped up in 2017, when Labour was gearing up for an election in the hopes of securing a second term in office.\nHe had taken party supporters by surprise when he said he would not lead the party into a third general election, perhaps inadvertently firing the starting pistol on a hushed leadership tussle in the PL’s ranks.\nWhile the Prime Minister has so far kept his cards close to his chest on what will come next, there is a growing sense in the party that 2019 could be a year of change. \nLast week Dr Muscat confirmed what had long been an open secret in Maltese politics – that he harbours ambitions of snatching up a top post in the highest structures of the European Union.\nWhile he himself has described this as a “long shot”, party sources indicated that he has two posts in his sights: European Council President, which is currently occupied by Donald Tusk, and the EU’s top diplomatic position of High Representative, a position occupied by Italian Federica Mogherini.\nBoth these positions will be vacant in the second half of this year.", "comment_count": 207, "id": 811}, {"keywords": "", "author": "Anthony Manduca", "article_body": "The process of constitutional reform should be led by citizens and not be controlled by politicians, Repubblika, the NGO that promotes the rule of law, is insisting.\n“Reforms that are top-down, controlled by politicians, conducted by horse-trading between political parties behind closed doors, and introduced without the inclusion of citizens or by plebiscite after populist campaigns, concentrate power in the hands of the executive rather than enhance the workings of democracy,” the NGO said in its written recommendations to the President and the Steering Committee on Constitutional Reform.\nOn the other hand, it argued, “a citizen-led reform” that is inclusive and participatory has the potential of renewing Malta’s democracy. It would leave a legacy of a “vibrant institutional framework” that could protect the rights and interests of present and future generations and the built and natural environment.\nRepubblika said it had been told the parties prefer to hold their discussions privately and without media scrutiny, and although they intended to consult NGOs, these consultations would be in one direction – towards them – without public debate.\n“The committee was also very vague in its plans for community information, speaking in general terms about an ‘education campaign’ but without exact plans on proper public engagement and participation in the drafting and decision-making stages,” it said.\nThe NGO said the Steering Committee appeared to be intended as the place where decisions would be taken by the political parties before proceeding to adoption by Parliament in a rubber-stamping exercise.\n“The risks of this top-down approach to our democratic well-being, such as it is, are unacceptable,” Repubblika said.\nThe document presented to the President and Steering Committee sets out a number of basic principles the NGO considers should guide the reform process.\nThe Constitution, it holds, is to be amended, not replaced.\nThe parties prefer to hold their discussions without media scrutiny\nChanges are to be phased in thematic sectors and not adopted as a package.\nRead: Consult citizens on Constitutional reform, says PD\nChanges that in isolation could increase the powers of the executive should be adopted together with changes that curtail them.\nThe process of design is to be transparent and any proposed change must be considered on the basis of reasons for and against its adoption.\nAlso, constitutional reform is not time barred, the NGO says.\nRepubblika is also proposing the setting up of five organs that would interact at the stage of drafting constitutional changes, namely:\nA Parliamentary Working Group made up of all parliamentary political parties and led by a mediator they all trust on the lines of the existing Steering Committee;\nRead: Malta's constitution is like a bad essay, says Godfrey Farrugia\nA Civil Society Representative Group modelled on the Malta-EU Steering and Action Committee to provide an environment of structured information exchange and decision-making with civil society;\nA Citizen Jury chosen on the same basis as jury selection in the courts;\nA Reform Governance Committee with an inter-institutional background to manage the engagement between these organs.\nThe aim of the Citizen Jury, which is modelled on experiences in Ireland and Iceland, would be to oblige promoters of reform to persuade, in an open forum, people who would not wield power under a reformed Constitution but would be governed by it. The Parliamentary Working Group should seek the views of experts and civil society.\nRead: How would experts reform the Constitution?\n“These exchanges should be transparent and open to the media and public scrutiny. Debates should be streamed live and transcribed, and people with different and contrasting views should be given the space to provide alternatives and disagree publicly and on public record,” the NGO said.\nAfter agreeing on a coherent set of proposals about a single aspect of the reform, parties would argue their case in front of the Citizen Jury, which would also hear arguments against.\n“Approval by the Citizen Jury should guide MPs in their decisions and voting which should in any case be free of the party whip,” Repubblika said.\nEfforts by this newspaper to contact members of the steering committe for comment proved futile.", "comment_count": 18, "id": 812}, {"keywords": "Gozo", "author": "", "article_body": "A new audio visual system has been installed at the Silos site at the Citadel in Victoria after Wirt Għawdex, the custodian of the site, was awarded a grant through the Gozo Non-Government Organisation Annual Scheme.\nThe silos, which Wirt Għawdex volunteers open to the public for free, is one of the highlights of the beautifully- restored Cittadella. The site has had several upgrades over the past few years, including LED lighting and motion sensors, but it lacked a modern way to explain the silos history to visitors. Until recently printed information sheets were handed to visitors.\nVisitors can now enjoy an audio-visual presentation of the history of the silos, before they actually start the tour. Information includes the importance of the silos during the time of the Knights and why they were changed to water reservoirs by the British in 1800.\nThe eight-minute long presentation also features the history of the battery and gunpowder magazine and how the small WWII shelters were dug out and by whom they were used.\nThe presentation is currently available in Maltese or English but it can also include other languages. Both versions have sub-titles for visitors with a hearing impairment or a limited knowledge of English.\nFor the first time, visitors with mobility limitations will also be able to enjoy the visual history of this site since the presentation is available on tablets without the need to navigate the stairs to the presentation room.\nThe silos are visited by over 10,000 people annually.", "comment_count": 1, "id": 813}, {"keywords": "Gozo", "author": "", "article_body": "February’s edition of Il-Ħajja f’Għawdex chronicles, among others, the various activities held so far in Gozo to celebrate the current Marian Year, including the pilgrimage with the painting of Our Lady of Ta’ Pinu in each parish and the Marian art exhbition at Il-Ħaġar Museum in Victoria. In a lighter vein, there are articles on the inroads two young singers – baritone Charles Buttigieg and the X-Factor Malta winner Michela Pace – are making in the musical field. The photo of the month is a snapshot of early 20th-century Xlendi Bay first published in Germany. Charles Bezzina presents his second instalment of short biographies of the scores of Gozitans who died in action during World War I, while other features cover flora and fauna, sacred art, Christian monarchs, ferry connectivity, sport, Bible studies, and the many EU-financed restoration projects taking place in parish churches.", "comment_count": 0, "id": 814}, {"keywords": "Gozo", "author": "", "article_body": "The Liverpool Cathedral Choir performed at Xewkija Rotunda. The presentation was one of a series of concerts the choir gave both in Malta and Gozo. The 65-member choir, under the direction of Mro Lee Ward and accompanied by organist Ian Tracey, gave a concert of choral music taken from Royal Weddings, including solo organ music performed on the new Noel Gallo and Michael Farley Organ that was recently installed at Xewkija church.", "comment_count": 0, "id": 815}, {"keywords": "Gozo", "author": "", "article_body": "The Don Bosco Oratory will be staging a new musical in Maltese, entitled Wojtyla – God’s Clarion Call, written by Antoine Mercieca, lyrics by Joe W. Psaila. The musical, produced with the collaboration of Fondazzjoni Santa Ċeċilja, will commemorate the 40th anniversary since Karol Wojtyla became Pope and it will be launching special celebrations marking the 70th anniversary of the Don Bosco Oratory.\nWojtyla – God’s Clarion Call is a two-hour performance of original music, song, projections and dance entwined with a story that would make patrons remember the highlights of John Paul II’s life.\nJamie Camilleri will be playing the title role of John Paul II, while other characters will be interpreted by Maria Cassar, David Grech, Angelo Muscat, Ruth Portelli, Janelle Rapa, Antonella Rapa and Thomas Xerri.\nThe 70-strong cast, including musicians, singers and dancers, will be under the musical direction of Antoine Mercieca, while Saviour Cremona will be the artistic director.\nThe Gozo Ministry will be supporting the musical by extending the ‘Reaching for the Stars’ scheme to youths aged between 13 and 35 who will be given a subsidised entrance ticket.\nThe musical will be held on Saturday at 7.30pm and next Sundayat 2.30pm. Tickets from the Don Bosco Oratory, Victoria, daily between 5pm and 7pm, tel: 21556616 or 9948 7751. Booking by e-mail on donbogo@gmail.com is also accepted.", "comment_count": 0, "id": 816}, {"keywords": "Gozo", "author": "", "article_body": "The Victoria and Xagħra Scout Groups and the 1st Victoria Bishop’s Conservatory Girl Guide Unit marked the birthdays of their founders – Lord Robert and Lady Olave Baden-Powell – last Sunday. Canon Michael Galea celebrated Mass at the Good Shepherd church in taċ-Ċawla, Victoria. During Mass, the scouts and girl guides, together with the Group Scout leader of the Victoria Group, Lorrie Saliba, and the Group Girl Guide leader Elizabeth Mizzi, reaffirmed their Scout Promise. The church parade had to be cancelled due to bad weather. On February 23, the two scout groups and the girl guides took part in a hike from Żewwieqa in Mġarr to Ta’ Ċenċ.", "comment_count": 0, "id": 817}, {"keywords": "Education", "author": "", "article_body": "A project entitled ‘Step Up For Europe – Make it Count’, aimed at educating first-time voters aged between 16 and 19, as well as foreigners living in Malta and voting for the first time at the forthcoming European elections on May 25, has been launched by JCI Malta.\nThe project involves various initiatives, including speed networking with MEP candidates, a day shadowing competition and school visits. These are aimed at making voters aware about what they need to know in order to make an informed decision at the polls.\nIn the run-up to the MEP elections, JCI Malta officials will be visiting secondary schools to speak to fifth form students about their voting rights, what they need to know about the upcoming elections, as well as the importance of being active citizens.\nIt aims to stimulate young people to take part in political life\nOn April 26 at Is-Suq tal-Belt, Merchants Street, Valletta, voters will have the opportunity to meet and get to know as many MEP candidates as possible and to speak to them on a one-to-one basis for a few minutes.\nAnother initiative, called ‘A Day in the Life of an MEP Candidate’, will give first-time voters the opportunity to spend a whole day with an MEP candidate as they go about their daily tasks and events. These shadowing sessions will take place throughout March and April.\nThrough the project, which will run up to the MEP elections, JCI Europe hopes to encourage young people to have their say and to show them that their opinion counts. It aims to stimulate them to take part in political life and mobilise them to ensure the new generation of Europeans have a voice in the decisions for the future.\nThe project will empower young leaders by providing them with platforms and forums for political debates to advocate for their political positions. It will also promote grassroots solutions using the JCI Active Citizen Frame­work that young leaders can use to help build what they envision for the future of Europe.\nJCI Malta is a non-profit organisation that provides development opportunities for young people. For more information visit the JCI Malta Facebook page, e-mail Nicole Borg on nicole. borg@jci.org.mt, call 799 23403 or visit the website below.\nwww.jci.org.mt/make-it-count", "comment_count": 0, "id": 818}]