[{"keywords": "", "author": "Edwina Brincat", "article_body": "A man who admitted to trafficking drugs to fuel his own addiction was jailed and fined after he pleaded guilty upon his arraignment on Tuesday.\nRobert Spiteri, a 50-year-old Valletta resident, was arrested by officers from the Drugs Squad after he was caught red-handed in the act of selling drugs to a third party, who was also taken into police custody, on Monday.\nSachets found in the trafficker’s yielded some two grams of synthetic drugs which the man confessed were his means of sustaining his own addiction.\nUpon his arraignment, the accused pleaded guilty to possessing and trafficking psychotropic drugs, possession of heroin, and committing the offences within 100 metres of a place frequently visited by youths.\nThe man was further charged with being a relapser.\n“The charges are what they are. There’s also the charge of relapsing,” prosecuting Inspector Mark Mercieca pointed out when making submissions on punishment.\nIn the light of the accused’s early guilty plea, the court, presided over by magistrate Doreen Clarke, condemned the man to an 18-month jail term and a €500 fine payable within a year, after taking note of his full cooperation with the police.\nThe court also ordered the confiscation and destruction of the drugs seized in the search and arrest.\nLawyer Simon Micallef Stafrace was legal aid defence counsel.", "comment_count": 0, "id": 919}, {"keywords": "", "author": "", "article_body": "Some 40,000 counterfeit footballs and clothing items have been found in four containers at the Freeport after being intercepted by customs officers.The Customs Department said two of the containers were found to contain 21,624 items of clothing, all false versions of several popular brands, while the other two contained 19,356 footballs, also fake.The objects were certified as counterfeit by the legal representatives of the respective copyright holders. The companies will be taking court action against the counterfeiters over the breach of their intellectual property rights.The Customs Department said the operation was carried out in cooperation with the Container Monitoring Unit and the iScanning Team.", "comment_count": 7, "id": 920}, {"keywords": "", "author": "", "article_body": "Updated at 2.48pm\nThe Caruana Galizia family will benefit from up to €50,000 to help with legal support, including dealing with libel cases. \nFree Press Unlimited and the European Centre for Press and Media Freedom (ECPMF), said they were going to support the family of murdered journalist Daphne Caruana Galizia through a grant of €50,000.\nThe grant will come from an Free Press Unlimited fund and will be given to the ECPMF, which will use it to help cover costs in ongoing defamation lawsuits against Ms Caruana Galizia, a public inquiry on state responsibility for her murder and the monitoring of court hearings.\n\"Free Press Unlimited is contributing to the costs for the team of Maltese lawyers assisting the family. A legal expert from ECPMF will monitor the progress of the court cases,\" it added.\nFree Press Unlimited (FPU) is an NGO based in Amsterdam dedicated to press freedom and freedom of speech.The grant will be implemented by the ECPMF.\nMs Caruana Galizia was facing over 30 defamation lawsuits at the time of her death, many of which remain pending, the organisations noted.\n\"Because these are civil cases, the family can be held accountable for damages if the court rules in favour of the complainants,\" Free Press Unlimited said.\nFree Press Unlimited noted that Ms Caruana Galizia had faced numerous attempts to silence her when she was alive. Her front door was set on fire in 2006 and the family’s pet dog had also been left on her doorstep with a slit throat.\nThe organisation also said it will support the family with legal costs for a public inquiry into whether her murder could have been prevented.\nPrime Minister Joseph Muscat ruled out such an inquiry, saying that it would need to take place after the inquiry into Ms Caruana Galizia's murder is concluded. If the two inquiries had to take place at the same time, one could undermine the other, he said.\n\n\n\nOn behalf of the family, Matthew Caruana Galizia said, \"We are grateful for the generous support and the work of our excellent lawyers. The grant shows how serious and worrying the situation in Malta is.\"\nWelcoming the new initiative, ECPMF legal advisor Flutura Kusari said, \"Thanks to FPU, we will be able to continue helping to defend the investigative work of Daphne Caruana Galizia in court and supporting her family in seeking justice.\"\nCorrection 2.48pm: A previous version of the article implied that the €50,000 grant would be given to the family directly. The funds will be managed by the ECPMF.", "comment_count": 75, "id": 921}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Three young men who allegedly gang-raped a 20-year old woman, in what was described by the prosecution as “one of the most shocking cases investigated,” have been remanded in custody.\nThe men, aged 25, 23 and 22, all from Siġġiewi, pleaded not guilty to raping their alleged victim, engaging in sexual acts and holding the woman against her will.\nAlthough details of the crime were scanty, the abuse took place last summer when the men lured their friend to a field in Zebbuġ under the pretext of watching the fireworks display.\nThat was where the alleged gang rape took place.\nThe woman’s ordeal came to light months later when she recounted her experience to members of the Vice Squad, pointing a finger at a brother of one of the co-accused before later spilling the beans on the three.\nThe brother of one of the co-accused was arraigned over similar charges earlier.\nOne of the three was separately charged with committing the alleged crimes during the operative term of a suspended sentence and relapsing.\nDefence lawyers requested a ban on the publication of the names of the accused, with lawyer Stefano Filletti arguing that such cases generated great media interest which was sometimes “not justified” at a stage when all three were still protesting their innocence. \nLawyer Arthur Azzopardi, appearing parte civile, added that publication of the names would also run counter to the interests of the alleged victim since everyone knew the company she was keeping with.\nWhile two of the co-accused did not request bail, the third man, also afflicted by a form of disability, requested release from preventive arrest since he is about to start a training course leading up to a new job, specifically tailored to suit his needs.\nMagistrate Doreen Clarke, upheld the request for the ban on all names, whilst turning down the request for bail.\nAs for another of the accused, the court strongly urged the Director of Prison to send the man, certified by a psychiatrist, to the Forensic Ward.\nProsecuting Inspector John Spiteri informed the court that the victim would testify once forensic tests were concluded.\nInspector Kylie Borg also prosecuted.\nLawyers Stefano Filletti and Stephen Tonna Lowell were counsel to the 25-year old.\nLawyer Leslie Cuschieri was counsel to the 23-year old. Lawyers Arthur Azzopardi and Alfred Abela were parte civile.\nLawyer Roberto Montalto was counsel to the 22-year old.", "comment_count": 0, "id": 922}, {"keywords": "", "author": "", "article_body": "The number of households with dependent children increased by a staggering 12 per cent between 2013 and 2017, official figures issued on Tuesday show. No reason was given. \nThere were 55,501 households with children in 2013 and 61,255 in 2017.\nThe total number of households was 156,999 in 2013 and 180,054 in 2017. 66 per cent did not have dependent children. \nThe figures were published by the National Statistics Office as part of data to mark the International Day of Families. \nOf the 61,255 households with dependent children, 20,412 (33 per cent) had two adults and one child.\n26 per cent were households of two adults and two dependent children.\nThe share of single-parent households with one or more dependent children was of 12 per cent amounting to 7,307. \n65 per cent of mothers with children aged up to 17 years were in employment, 33 per cent were inactive and the rest were unemployed.  \nThe average gross annual salary of working parents rose by 5% since 2013. The increase was steeper for working mothers, but the average salary for mothers - at €17,597 in 2017, was still far lower than that of working fathers at €24,155.  \nDuring 2017 there were 4,319 live births in Malta, of whom 82 per cent were Maltese citizens. Just over half the babies were boys. The average age of the mothers was 30.2, at par with the previous year. It was 29.3 in 2012.\nMarriages in 2017 decreased slightly from the previous year to reach 2,934. Among those who got married in 2017 were 46 who were aged over 65 and 47 aged between 60 and 64. ", "comment_count": 4, "id": 923}, {"keywords": "", "author": "", "article_body": "A win for singer Michela in Saturday’s Eurovision Grand Final would delight fans but could end up costing mobile operators Vodafone a pretty penny.The  company has offered to pay out up to €500 to Gozitans who switch to its network if the Gozo-born singer triumphs with her song Chameleon. The full €500, in the form of gift vouchers, would only be paid out to those subscribing to pricier plans, while Vodafone will also handing out smaller amounts if Michela gets through the second semi-final on Thursday. While the offer means Vodafone - which is sponsoring Malta's Eurovision participation - is effectively betting against a Michela victory, the singer cheekily thanked the company in a Facebook post for its support and its belief that she could win the Eurovision.\n\nSo how likely is a pay-out? Bookmakers have given Michela strong odds of making it through the second semi-final on Thursday: across 20 major betting companies, Malta has been given an 84% chance of being among the 10 qualifiers, the sixth strongest odds on the night. Winning the Grand Final, however, seems a far more distant proposition. The same bookies rank Michela’s chances ofvictory at just 3%, though they also give her a 55% chance of being the first Maltese singer to finish in the Top 10 since Gianluca Bezzina managed eighth place in 2013. Malta has failed to qualify from the semi-final in three of the last four years, with Christabelle, Claudia Faniello, and Amber all falling short, while Ira Losco made it to the Grand Final in 2016 with the song Walk on Water, finishing a middling 12th despite high expectations.", "comment_count": 7, "id": 924}, {"keywords": "", "author": "", "article_body": "A motorcyclist was hospitalised on Tuesday morning after falling off his motorcycle in Floriana.\nThe police said the incident happened at about 9.20 in  Triq il-Vittmi Furjaniżi tal-Gwerra.\nThe 44-year-old Italian man residing in Paola lost control of the motorcycle he was driving, a Biaggio Beverly, and fell off.\nHe was given first aid on site before being taken to Mater Dei hospital, where he was found to be suffering grievous injuries. ", "comment_count": 3, "id": 925}, {"keywords": "", "author": "Claire Caruana", "article_body": "Babies and young children should not be involved in campaigns by political parties, the Commissioner for Children has insisted. \nIn comments to the Times of Malta, Commissioner Pauline Miceli said that she was aware that children are “once again being used by political parties in their campaigns”. \n“We, as an office, always stress that children are children first and should be considered so and have their particular needs catered for. It is their childhood that shapes their future – their parents’ voting decisions comes after,” Ms Miceli told this newspaper. \nThe commissioner’s views on the matter were sought after it emerged that both Labour and Nationalist parties have started featuring babies and young children in campaign material. \nWhile, so far in the campaign, the use of children by the PN was found to be limited to billboards, the Labour Party has included children in a video being shared on social media, with both babies and young students featuring in the footage.\nExtensive talks during drafting of guidelines\nOn this, the commissioner said there was a dilemma between children’s right to participate and voice an option and their right to protection. \n“Of course babies and very young children are far too young to know and should not be involved. Parents should be aware of the ‘future consequences’ when giving their consent to their children’s marketing presence.\n“Images of children could be used by anyone who would want to harm them,” Ms Miceli said. \nParents should also consider their children’s future and ask themselves if their children would be happy to leave such a digital footprint later on, the commissioner went on. She also pointed out that this also applies to all those who post pictures of their children on the social media.\nAsked whether the political parties had sought her advice ahead of the election campaign, Ms Miceli said that there were extensive talks during the drafting of guidelines regarding the participation of children in political activities.\n“The main political parties gave their input. We were surprised to learn that it is usually the parents themselves who push their children to appear in such adverts,” she said. \n“However, political parties should make their supporters aware of their children’s right to protection. The fact that our proposals are just guidelines is a bit disheartening.”  ", "comment_count": 13, "id": 926}, {"keywords": "", "author": "", "article_body": "Political parties are playing with fire when they use Malta’s tax and fiscal structures to score cheap electoral points, the Chamber of Commerce has warned.\nIn a statement, the Chamber expressed dismay that candidates in upcoming MEP elections had “given in to the temptation” of turning debate about fiscal affairs into a political football.\n“The threat of Malta’s current fiscal structures being put at risk, ought to be debated in a way that explains to the electorate how crucial it is that Malta maintains its current prerogative to design and determine its own taxation system and use it to attract investment in the light of its inherent limitations,” the Chamber said.\nMEP candidates have repeatedly clashed over their approach to tax harmonisation at the EU level, with the Labour Party in particular accusing Nationalist Party candidates of having voted against Malta’s tax interests during their time in the European Parliament. \nMalta's advantageous corporate tax system is a key component in the country's attractiveness to foreign firms. \nOn Tuesday, the Chamber of Commerce urged politicians to speak with one voice on the matter.\n“Malta’s needs are different to those countries and regions in the centre of Europe. Rather than for the principal aim of collecting revenue, Malta uses its fiscal structure as a necessary and legitimate tool to stimulate growth and overcome the island’s permanent natural disadvantages such as smallness and peripherality,” it said.“The Chamber calls on all MEP candidates as well as the electorate to treat this subject with the deserved caution”.", "comment_count": 1, "id": 927}, {"keywords": "", "author": "Jacob Borg, Philip Leone-Ganado", "article_body": "Updated 11.45am with video\nThe captain of the MV Lifeline has been fined €10,000 after a court found that the rescue vessel had not been properly registered when it entered Maltese waters after rescuing 200 migrants at sea last June.While the charges could have carried a 12-month prison sentence, magistrate Joseph Mifsud said this was never contemplated as the court “immediately understood the circumstances of the case”. He said the captain had a clean criminal record and always showed respect to the court proceedings.The fine will be distributed among Maltese organisations which help refugees and people living in poverty.The court turned down a request by the authorities for the MV Lifeline to be confiscated, on the basis that the vessel was not the property of the accused.\nA second charge, of using the vessel for commercial purposes without a licence, was also rejected. \nLawyer Cedric Mifsud told Times of Malta the defence team had requested a suspension of the judgment and would be appealing it, as they believed the captain to be innocent.\nRead: 'Handing the migrants to the Libyans was not an option' - CaptainCaptain Claus-Peter Reisch was at the helm of the Lifeline when it rescued 234 migrants in the Mediterranean last June, prompting an international dispute and days-long stand-off as countries squabbled over who would take the migrants in. Malta eventually allowed the Lifeline access to its ports - following an ad-hoc agreement to distribute the migrants among several countries - but charged the captain with steering a vessel within Maltese territorial waters without the necessary registration and licence.The vessel has been detained ever since, and the NGO Mission Lifeline has repeatedly complained about delays in the case.\nThe Lifeline is registered as a pleasure craft in the Netherlands, but Dutch authorities said this constituted only a certificate of ownership and did not grant the right to fly the Dutch flag. The defence argued that the certification indicated Holland as the vessel's flag state and therefore constitutes recognition by the Dutch authorities.\nThe court concluded that the registration \"was not to the satisfaction of the Dutch authorities\" when the vessel entered Maltese waters. \nActivists demonstrate outside the courts in Valletta ahead of the hearing. Photo: Chris Sant Fournier.\nLifeline pledges to resume rescues with new vessel\nSpeaking outside court shortly after the decision, Mr Reisch said rescue operations would get under way in the coming weeks as the Lifeline team had already bought another vessel. Mr Reisch said the Lifeline vessel would remain impounded by the authorities during the appeal period. Brandishing a copy of the Lifeline’s registration documents, Mr Reisch said it clearly showed the vessel was correctly registered in the Netherlands. He expressed his bewilderment about how the Dutch authorities had denied his vessel was correctly registered. “It means that 25,000 other boats have the same problem as MV Lifeline. I just want to say to these people: check your registration. Maybe it is meaningless”.\nLawyer Neil Falzon welcomed comments by magistrate Joe Mifsud, who he said strongly reiterated that saving migrants’ lives out at sea was not a crime.Disastrous verdict that ignored evidence presented- Mission Lifeline“We strongly feel this statement needs to be echoed loudly across the EU”, Dr Falzon said. “Our biggest surprise in this case as we have been saying from the very beginning was the fact that the Dutch government changed its mind when it was faced with such a situation,” fellow lawyer Cedric Mifsud said. He said “geo-political” considerations may have come into play when the Dutch authorities testified in court.\nIn a tweet confirming an appeal, NGO Mission Lifeline condemned the judgement as a \"disastrous verdict that ignored evidence presented\".\nThe NGO said in a statement: \"Open source data from IOM’s Missing Migrants project estimates that over 1,500 people have lost their lives in the Mediterranean during our 322-day detention.\"“As long as people continue to risk their lives, and drown, in pursuit of peace and safety, we will extend our hand in support.”\n'Court shocked by racism and intolerance towards migrants'\nIn his judgment, the magistrate said he had been \"shocked\" by the comments he had seen on 'blogs' dealing with the case. \n\"The level of racism, intolerance and animosity towards fellow human beings who face much greater problems than we do is frightening,\" he said. \"When reading such comments, this courts asks what has become of the values of hospitality and love to the afflicted that shaped this country.\"\nThe judgement acknowledged the captain's humanitarian act but said there was a \"limit to how flexible the court could be\" in applying the law. \nThe court also lamented the long delays in the case, which it said were largely due to the time taken by Dutch authorities to provide requested information. \"In such cases of global interest, the process must take place quicker,\" it said. ", "comment_count": 0, "id": 928}, {"keywords": "", "author": "", "article_body": "Updated at 4.30pm with PN press conference\nAdrian Delia will not receive a full copy of the Egrant inquiry, after a court denied his application on Tuesday.\nMr Justice Robert Mangion read out the final part of his judgement in a brief court session on Tuesday morning which did not delve into the legal reasoning behind his judgement.\n\n\n\nDr Muscat says that despite the AG’s position, he will publish the full inquiry himself in “another few days” once a review process is completed.\nAugust 9, 2018: Adrian Delia files a constitutional application seeking a full copy of the Egrant inquiry. He says the report should be published in the interests of equity as the opposition has been placed in a political disadvantage by not knowing all the findings. \nAugust 16, 2018: The courts accept a request by Dr Delia for the case to be heard with urgency.\nSeptember 2018 – March 2019: The court hears several high-profile witnesses, including Dr Muscat, attorney general Peter Grech and Justice Minister Owen Bonnici.\nMarch 2019: Dr Muscat says he has not published the inquiry as promised because of the ongoing court case.\n“I think that out of courtesy and respect towards the institutions, I will await the court decision”, he says. \nMay 12, 2019: Dr Muscat tells a Sunday crowd that it's a matter of \"when\" rather than \"if\" the inquiry is published, as long as doing so does not hinder ongoing investigations. \n ", "comment_count": 0, "id": 929}, {"keywords": "", "author": "", "article_body": "Government personnel have removed the word 'Justice' spelt out by flowers on Daphne Caruana Galizia's makeshift monument at the foot of the Great Siege Memorial.\nActivists from the protest group Occupy Justice had formed the word using flowers taken from the government's infiorata at St George's Square after it ended on Sunday night.\n\"It seems that only government sanctioned infioratas are permitted in Malta,\" the group commented.\nIt observed that while the lettering was removed, the borders were left untouched.\n\"Why would anyone not want justice for Daphne Caruana Galizia? Worse still, why are the authorities so allergic to a call for justice?\" the group asked. ", "comment_count": 117, "id": 930}, {"keywords": "", "author": "Denise Grech ", "article_body": "Medical students fear their studies are “in jeopardy” as Barts students will be joining their clinical practice at Mater Dei Hospital in the coming scholastic year.\nThe Health Ministry confirmed an “average of 15 to 20 Barts medical students will have their clinical rotation at Mater Dei Hospital”, which will be spread over different specialties.\nA maximum of six students will be assigned to each speciality, a spokeswoman for the Health Ministry said.\nThe Malta Medical Students’ Association, however, warned this could jeopardise students’ studies, since the wards for clinical practice are already crowded.\nThe issue will “surely be made irreparably worse” through the additional student load at Mater Dei, the students’ organisation fears, telling the Times of Malta 16 students were too much in the current circumstances.\nAt present, students were already finding it difficult to view procedures in certain specialities such as obstetrics and paediatrics wards, placing their studies “at risk”.\nAssurances were not met\n“Even one student will tip the balance,” students told the Times of Malta. The organisation fears students will not be getting enough exposure ahead of exams.\n“When authorities invest in medical education, the entire country benefits,” MMSA president elect Omar Chircop said.\nThe union is calling for a signed agreement that would ensure no more Barts medical students are added to the course until the Gozo facility is completed.\nThe students’ organisation also said, following meetings, that authorities seemed to be “willing” to work to avoid clashes with University of Malta students.\n“But the reality is that we have been in the same situation before and were given assurances which were not met later on,” the organisation said, adding they have not yet seen any advantages proposed for University of Malta students.\n“Rather, we have been asked to make do and accommodate these new students,” the organisation added.\n“Hence, we call upon the authorities to first and foremost safeguard the education of our local University and to continue expanding and improving on our local resources and teaching, especially since some of our current resources will now be directed towards Barts too.”\nA spokesman for the University of Malta confirmed that Barts clinical students will be joining the University of Malta students at Mater Dei Hospital.\nThe students will be performing their attachments with University of Malta third-year student groups, the spokesman said.\nThe spokesman, however, did not reply to questions asking whether the institution was concerned with the new student intake.", "comment_count": 28, "id": 931}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Freeport is experiencing a significant slowdown in business activity as one of its major clients – Maersk – has decided to move most of its operations from Malta to other ports in North Africa. \nThe Freeport’s management has informed unions and other clients that the departure of Maersk and another associated company, MSC, is expected to reduce business at Malta’s container terminal by some 35 per cent by the end of next month. \nEfforts are being made by the Freeport authorities to try to attract new business to compensate for the massive loss, and some 10 per cent of the container business throughput has already been recouped through new clients.\nLast year, the Malta Freeport handled more than 3.3 million containers in its transhipment activities.\nA spokesman for the freeport confirmed the withdrawal of services by Maersk and MSC.\n“Maersk recently informed us that it will be shifting some of the services that are being carried out through Malta Freeport to a new fully-automated facility in Tangier Med, Morocco, and to Port Said in Egypt.\"\nMaersk, the world’s largest container shipping company, has been using the services of the Malta Freeport for many years. \nMalta Freeport said the nature of the transshipment industry meant that it was not uncommon for shipping lines to opt to make use of different terminals for operational purposes. Malta Freeport was accustomed to operating in such an environment and, for several years, has managed to thrive within it.\nMaersk, it stressed, is to retain a presence in Malta through services covering South America and Northern Europe and, furthermore, the Freeport will be significantly increasing its handling of services operated by the CMA CGM shipping line.\n“Meanwhile, we remain optimistic about attracting further business opportunities and have absolutely no intention of downscaling our operations. On the contrary, we are continuing to plan for the future.”\nIndustry sources said that business has already slowed down at the Freeport.\n“The slowdown can already be felt and there are already fewer people working, particularly on overtime,” the source said. The company, however, does not have plans to make any of its employees redundant.\nWhile confirming that the Freeport management are doing their utmost to attract compensatory business through other shipping lines, the sources noted that “Malta has much more competition than it used to have and attracting new business will not be easy”.\nLast January, the Freeport announced expansion plans, with millions of investment on new facilities including an extension of the Terminal Two North Quay. So far, no changes have been announced to the plans despite the expected reduction in business.\nIn 2018, the Freeport handled 20 weekly mainline services, providing network links to 130 ports around the world.\nJoe Gerada, Group Managing Director at Thomas Smith, representing Maersk, explained that Malta-destined and originating cargo is presently serviced via Port Said Egypt versus a direct Far East to Malta call. The effect of this is that it adds a few days to the transit time of the service Far East to Malta. The feeder services that used to feed other Mediterranean ports from the Far East service via Malta automatically moved with the service.\nOtherwise all other services have stayed and there is no intention for any of them to change in the foreseeable future.\nMaersk Line still operates direct services from North Europe and South America besides being still connected worldwide via other transhipment ports.\nShipping, he said, is a dynamic business involving many international variables and nobody in the business is surprised by changes in shipping patterns.\n\"Maersk Line's contribution to Malta has been and still is that of giving worldwide container shipping connections to Maltese exporters and importers as well as bringing transhipment opportunities to Malta where Maersk has been and still is a significant player at Malta Freeport Terminal.\" ", "comment_count": 0, "id": 932}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Updated on Tuesday at 5.55pm with PN press conference\nParliament was unexpectedly adjourned for two weeks on Monday, a day before a debate was due on the financial estimates of the Embryo Protection Authority.\nGovernment whip Byron Camilleri told the House at the adjournment that the House would sit again on May 27 - just after the European Parliament and local council elections.\nNo prior decision had been taken by the House Business Committee, which plans the business of the House. \nSittings only resumed on Monday last week after the Easter recess.\nBut Mr Camilleri noted poor attendance for sittings due to the ongoing electoral campaigns. \nHe said that although the government had originally proposed resuming sittings on May 27, immediately after the election weekend, it had accepted an Opposition proposal for sittings to resume on May 28 due to the fact that vote-counting would still be underway the day before.\nPN complains\nBut a PN spokesman said the government had not even informed the opposition it would adjourn parliament now until after the elections.\n\"The truth is that the government wants to avoid a discussion on Embryo Protection Authority which was scheduled for tomorrow,\" he said. \nAbortion has in the past been brought up during the debate on embryo protection, and the issue has also become one of the election controversies. \nNo detailed breakdown of the €1.2 million the Lands Authority spent on legal and professional fees was forthcoming, Opposition MP Ryan Callus said. \nGovernment in state of panic - PN\nThe government “cancelled” Parliamentary sittings just as soon as the debate on the protection of embryos was about to start because it was in a state of panic, the Nationalist Party charged on Tuesday.\nDeputy leader for Parliamentary Affairs David Agius, whip Robert Cutajar and MP Karol Aquilina told a news conference the government was running away from a debate on life and postponed everything to after the May elections. This was done without notice, without consultation and against what had been agreed upon during the House Business Committee.\nThey said this was without precedent and not even the Office of the Speaker knew what was happening, signifying a lack of respect towards the country’s highest institution. It was a strong message that democracy in the country was being threatened, the PN insisted.\nPD slams government\nIn a Facebook video posted on Tuesday morning, Democratic Party leader Godfrey Farrugia said parliament had been reduced to a \"farse\", with the government ignoring Opposition calls and deciding to adjourn parliament whenever it pleased.\n\nLands Authority debate\nThe House on Monday debated the estimates of the Lands Authority. \nOpposition MP Ryan Callus said the creation of the new Authority saw experienced and capable lawyers sidelined while the government dished out direct orders for the work they had previously carried out \nMr Callus, who is the Opposition’s representative on the Lands Authority board, said he would not vote in favour of the authority’s estimates because of an “exaggerated” €1.2 million in legal and professional fees, for which no detailed breakdown was forthcoming.This cost to the Authority - which had registered losses of €750,000 during its first year of operation - was the result of “damage” done during the Lands Department’s metamorphosis into the new authority. Mr Callus expressed his view that the Government had seen the transition as an opportunity to issue direct orders for work previously carried out by lawyers with years of experience who had been sidelined in the process. As a result, he had not been prepared to endorse a document when he was not sure exactly what he would have been endorsing, he stated.Opening the debate, Ian Borg, the minister responsible for lands, said Labour’s decision to constitute a new authority to administer government land had been a courageous and necessary decision. Criticism today focussed on the fact that the Authority was almost “too independent,” he said, and set the government’s policy agenda in the field itself.He thanked Mr Callus for his contribution to the Board, noting that the Opposition MP spent a lot of time at the Lands Authority examining files. Mr Callus was welcome to do so, he added, but said he was perplexed at the fact that the Opposition spokesperson for sport was also the Opposition’s representative on the Lands Authority board. ", "comment_count": 37, "id": 933}, {"keywords": "", "author": "", "article_body": "A 50-year old man was arrested on Monday over drug trafficking, following several weeks of observation by the Drugs Squad, police said.The man, originally from Marsa but living in Valletta, was observed over several days selling synthetic drugs outside an establishment in Triq N. Isouard, Marsa, according to police.Several sachets of the same drug, ready for sale, were found on his person together with empty plastic bags and a large amount of cash.The man is expected to be arraigned on Tuesday on charges of drug trafficking and possession. Police investigations are ongoing.", "comment_count": 0, "id": 934}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Għargħur local council and a group of residents have filed an appeal over a permit granted to convert dilapidated rooms into a two-storey dwelling with a swimming pool and surrounding deck area in a cultivated field.\nThe project in Sqaq Charlotte, most of which is in ODZ, was given the green light in February but two appeals were filed against it.\nThe permit was granted despite objections by, among others, Din L-Art Ħelwa which insisted the construction should not extend beyond the ODZ boundary and that the dilapidated rooms had historical value and should therefore be restored. The Superintendence of Cultural Heritage did not oppose the proposal.\nThis project will see the dismantling of dilapidated rooms which have a corrugated roof and the subsequent excavation to construct a two-car garage at basement level, with dwelling on ground floor and first floor. It will also include the dismantling of rubble walls and their reconstruction using the same stone as well as the construction of a swimming pool with an underlying reservoir and a surrounding deck area not exceeding 75 square metres.\nThe site is located at the end of Sqaq Charlotte and lies partly within the Urban Conservation Area and partly in Outside Development Zone. The council said it had not objected in the first place because it was indicated as having been within the development zone.\nIt further insisted that according to planning policies, development must be three metres away from rubble walls, meaning the plans as proposed could have never been accepted.\nResident Dimitri Gindin, who lives nearby, has filed a separate appeal, insisting that the proposal should never have been allowed since it “clearly reduces a rural open space” and represented “a violation of the natural delineation of the rural confines of the locality and further urban sprawl on the border of the Għargħur urban conservation area.”\nHe explained that the proposed development, located at the end of a narrow alley along the edge of the urban conservation area, will destroy a rubble wall boundary and will create a blank party wall along the entire garden.\nMoreover, the alley, which is just over two metres wide, is not wide enough for vehicular traffic, so a garage at the end of the alley will pose danger for pedestrians.\nHe therefore called on the tribunal to revoke the permit.", "comment_count": 6, "id": 935}, {"keywords": "", "author": "", "article_body": "A 57-year old construction worker was seriously injured when he was struck by the door of a truck in Naxxar on Monday afternoon.Police said the man, who is from Attard, was injured while carrying out works in Triq il-Kapella ta’ Santa Marija at around 3.30pm. He was taken to Mater Dei Hospital for treatment. Police investigations are ongoing.", "comment_count": 0, "id": 936}, {"keywords": "", "author": "Claire Caruana", "article_body": "Patients at Mater Dei Hospital are being treated in corridors “all year round”, the nurses’ union has charged, with corridors being given names “as a cover up”. Nurses are bearing the brunt of shortcomings in the healthcare system – MUMN\n“The situation of treating patients in corridors in Mater Dei is now all year-round while at Mount Carmel Hospital there are daily cases of patients being provided a bed in the evening.\n“In the Gozo General Hospital, beds in the corridor do occasionally exist but are limited due to union directives,” Malta Union of Midwives and Nurses (MUMN) president Paul Pace said. He made the comments in a statement marking International Nurses’ Day, celebrated on Sunday.\nMr Pace insisted in the statement that the recent years’ drastic increase in population “is not helping at all”, arguing that it would be unwise for the government to consider that the three hospitals have “sufficient beds to cater for the needs of the population”.\n“Is investment in additional beds being made in these three hospitals? The reply is a big ‘no’. Mater Dei corridors are given names to cover up this situation, while Mount Carmel is literally falling to pieces due to poor investment over the years,” he said.\n“The Gozo hospital is barely coping with providing services to the local population let alone with medical tourism.”\nWhile acknowledging that Malta’s health care system provides “a very good service”, accessible by all the population since it is one of the few systems in the world that is free, Mr Pace pointed out that it was the nurses who had to bear the brunt of various shortcomings.\nDrastic increase in population is not helping at all\nThe sheer lack of nursing staff in all local health institutions, the inadequate number of student nurses, the exodus from the nursing profession, and the poor conditions of nurses in the wards are just some of the factors which nurses here face on a daily basis, the union head insisted.\n“To be fair and just, the same problems can be found in most countries across the world but it does not justify that this distress is also found locally,” Mr Pace went on.\nIn recent weeks, the nurses’ union had repeatedly threatened action after flagging a series of shortcomings in the various state hospitals.\nIn April, the union requested time frames on the works being carried out Mount Carmel, insisting nurses and patients there were struggling as a result of the run-down premises.\nMeanwhile, earlier this month, Times of Malta revealed that the only physiotherapy department on the island was also in need of upgrading, with the only treadmill there not working in months. Last Tuesday, shortages at the Intensive Therapy Unit prompted the union to again threaten action.\nclaire.caruana@timesofmalta.com", "comment_count": 14, "id": 937}, {"keywords": "", "author": "Ivan Martin", "article_body": "If you’re thinking of running for MEP, then you had better have deep pockets.\nA campaign running for the European Parliament could set you back around €26,000, according to candidate Peter Agius. \nIn a Facebook post, the Nationalist European Parliamentary hopeful said that so far his campaign had cost €26,500. Around €3,600 of this cost has so far been offset by small donations collected during political gatherings organised by him and his teams, Dr Agius wrote.\nThe law, he said, required candidates to declare campaigning costs only after voters cast their ballots.\n“However, I believe that to truly choose an independent person of integrity it would be best if this was done before the vote. I want to do my part by declaring the costs of my campaign,” he wrote, urging others to follow his lead.\n\nDr Agius said he had also benefited from around 4,500 hours of voluntary work from around 45 volunteers and friends, who worked on things from campaign calls, to design work for logos.\nThe MEP hopeful, who used to head of the European Parliament Information Office in Malta, even mentioned the €60 worth of auberigines and other fruit and vegetables that farmers had given him throughout his campaign which largely featured the farming community.\nA spokesman for the candidate said the expense calculations dated back to 19 September 2018. \nMalta goes to the polls to elect six MEPs - as well as councillors for all local councils - on May 25. ", "comment_count": 11, "id": 938}, {"keywords": "", "author": "", "article_body": "The University of Malta currently has 1,073 international students, the highest number ever.\nAccording to the annual report on internationalisation trends at the university, written by Pro-Rector Professor Godfrey Baldacchino, eight per cent of the student population of the 14 faculties are international students.\nThe Faculties of Medicine & Surgery, Arts and Economics, Management and Accountancy registered the highest number of international students.\nWithin the University’s institutes, centres and schools, the proportion of international students is even higher: 18 per cent.\nThe data also shows an increase of international students following doctoral level programmes. The Doctorate in Pharmacy programme was the main contributor to this surge, with numbers doubling over the previous year. \nThe reports also revealed more interest by students to undertake exchange study periods overseas when compared to previous years.\nA total of 356 university students took up an Erasmus mobility experience, while 14 other students opted to go and study for a semester in a non-EU country. This was 13 per cent higher than the previous year.\nThe university, in turn, hosted 359 Erasmus students and 41 other students from non-EU countries. This was 12 per cent lower than the previous academic year.\nThe report attributes these positive results to the development of agency networks in specific feeder countries, along with improved and fine-tuned communication and marketing tools that the University is using to reach out to both local and overseas audiences.\n ", "comment_count": 2, "id": 939}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Relaunch the 24/7 Crisis Intervention Team and set up a national suicide support line, the Opposition is urging the government.\nLaunching a set of 18 proposals to fight mental health issues, PN spokesman Mario Galea said that one out of every four people in Malta suffered mental health issues.\nHowever, only three out of every 10 people with depression actually looked for help.\nThe number of those who did not seek support was too high, and something needed to be done about it, he said at a press conference on Monday. \nUntreated depression remained the main cause of suicide, which worldwide cost a life every 40 seconds, Mr Galea said, adding that for every successful suicide there were another 20 attempts.\n“In two years, mental health issues will be more common among the Maltese than cardiovascular diseases,” he said.\nIn light of the depletion of resources in the sector, the PN’s proposals include employing more professionals such as psychologists, psychotherapists and social workers.\nIt is also calling for more resources at the Mental Health Commissioner’s office and more 'psychiatric beds' within Mater Dei Hospital’s footprint.\nPN MEP candidates Frank Psaila and David Stellini also addressed the conference.\nPN’s mental health proposals\n-Build a unit for children and adolescents that is equipped with the latest technology and which is not housed in Mount Carmel Hospital\n-Launch a national study on the prevention of suicide, as requested by the EU\n-Kick off a Zero Tolerance campaign about mental health stigma\n-Set up a unit that supports relatives of people with mental health issues\n-Ensure a mental health policy at every workplace\n-Screen students so that those with mental health issues can start being treated from an early age\n-Every local council should ensure one of its councillors is responsible for mental health issues within the community", "comment_count": 3, "id": 940}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A couple’s argument over child maintenance payments sparked off a full-scale punch-up between rival Cospicua families on Easter Sunday afternoon, a court heard on Monday. \nThe dynamics of the violent episode emerged as a young mother-of-two, in an on-again-off-again relationship with one of the men injured in the fight, provided a witness's account of the events of that afternoon.\nEight family members, ranging in age from 18 to 59, allegedly assaulted various members of a rival family living in the same town.\nCarmelo Dalli, 59, Fredrick Dalli, 36, Charlston Cassar, 26, Lee Julian Cassar, 25, Josloann Cassar, 25, Redent Cassar, 24, Tristan Cassar, 22 and Kurt David Azzopardi, 18, all stand accused of having breached public peace, threatened and assaulted members of the Brincat family between 2.45pm and 4pm on Easter Sunday.\nTwo of their alleged victims were grievously hurt in the assault, with two others ending up slightly injured.\nAn eyewitness testified how she and a female friend had gone for a drink at a Cospicua kiosk close to 2pm on the afternoon of the incident.\nHer partner, father of her two children, had been there too, together with his brother, sister-in-law and cousin.\nSipping her first drink while chatting to her friend, the woman recalled how her attention had suddenly been caught by a commotion a short distance away. A fight appeared to have broken out between a number of individuals, stemming from an ongoing dispute regarding maintenance payments.\nUrged partner to keep out of fight\nSpotting her partner making his way towards the scene of the commotion, the witness described how she had run across, urging him to keep out of the fight and recalling having caught sight of a horsewhip in his hand.\nThe man had apparently armed himself to defend himself and his cousins against the hostile gathering, the witness said, adding that she had tried to calm down her partner before a plump man, identified in court as Frederick Dalli, one of the co-accused, had allegedly gone up to him stating, “Why did you touch my son?”\nThe two allegedly come to blows and in the “total confusion” that followed the witness caught sight of her partner being assaulted by another man who held a knife to his neck.\nThe woman also described how she had suffered leg injuries as the knife was wrestled out of the other man’s grip. However, the witness could not tell who had actually caused her the injury which had required treatment at a health centre.\nCarmelo Dalli, Josloann Cassar, Tristan Cassar and Kurt David Azzopardi had been granted bail upon their arraignment against a personal guarantee of €5,000.\nThe other four co-accused were granted bail in a later hearing after a number of civilian witnesses, including the alleged victims, had testified.\nBail was granted against a deposit of €5,000 and a personal guarantee of €10,000.\nThe case continues.\nLawyers Franco Debono, Arthur Azzopardi, Amadeus Cachia, Marion Camilleri and Mario Mifsud are defence counsel.", "comment_count": 0, "id": 941}, {"keywords": "", "author": "", "article_body": "Customs officers have seized 232 bottles of alcohol from various localities are finding that no excise duty had been paid.\n3,360 unused excise stamps were also found.\nThe Customs officials carried out routine searches in Gzira, Paceville, Fgura, Bugibba and Xemxija. They found the bottles without excise banderols.\n ", "comment_count": 5, "id": 942}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Members of a local law firm had feared for their personal safety and that of their loved ones after a former colleague whose consultancy contract was not renewed by the firm, bombarded them with threatening messages vouching revenge, a court was told on Monday.\nBartosz Marcin Adruszaniec,  42-year old Polish lawyer who ended up a squatter in abandoned premises lacking water and electricity, was back in court as a number of former colleagues and a relative of one of the partners, recipients of the allegedly threatening mail, took the witness stand.\nThe accused, who was remanded in custody upon his arraignment in April, is pleading not guilty to charges of harassment, blackmail and threats, instilling fear in the partners and other employees at the firm.\nRead - Lawyer sent 87 pages of threatening email, court hears\nHe is also facing charges relating to simple theft from a shop and an attempted robbery from a private residence at St Paul’s Bay.\n“It was scary. It put me under mental stress. I felt I was targeted,” recalled the personal assistant to one of the partners at the law firm, the name of whom was banned by the court after parte civile lawyer Stefano Filletti pointed out that the story generated negative publicity which was having an adverse effect on the professional and personal lives of the alleged victims.\nThe court was told that the non-renewal of the lawyer’s consultancy contract around February had unleashed a barrage of WhatsApp messages, calls and Instagram posts, including disturbing images of a burnt-down house and a woman lying at the foot of a flight of stairs, besides mention of assassinated journalist Daphne Caruana Galizia.\n“Tonnes of WhatsApp messages were being sent. I was scared,” recalled the assistant, explaining that she had forwarded the mail to the HR Manager.\n“We were all very tense. At one point we had to get security at the office,” the woman concluded.\nThe wife of one of the partners testified that she too had ended up a recipient of messages. They had threatened to destabilize her marriage after the accused alleged that her husband had been involved in an extramarital affair while on a business trip abroad.\n“I trust my husband but I confronted him. It caused stress in our relationship. We worked through it,” the woman explained, adding that although later, the accused had apologized, saying that he had not wished to involve her, after a brief interval, the threatening messages resumed.\nThe accused had allegedly told his former employer’s wife that her husband “had unleashed him,” also making reference to the Caruana Galizia murder which had accentuated the woman’s fear for the safety of her husband, particularly when the sender of the messages claimed “I have nothing to lose.”\nAs a mother of two young kids, the woman feared that she would find her tormentor waiting outside the family home. Stress and anxiety kicked in, the witness recalled.\nAnother partner at the firm had also shared the same feelings, recounting his experience when testifying as to how he too had been bombarded with threatening mail over a span of a few weeks, pointing out that it was not normal to receive 28 long messages over just four days.\nEven worse was one particularly “disturbing video” wherein the accused- in an intimidating tonne-told the viewer “It’s such a beautiful day……this will not stop here.”\n“I felt threatened,” the witness said, explaining further how he feared that the former consultant might turn up outside his family home scaring his wife and children.\nThe accused had threatened “to publish things,” taking out or inventing information “to damage the reputation of the firm,” the witness went on, explaining how the firm serviced a certain clientele who would expect no correspondence save for that which was work-related.\n“We risked losing important clients,” the legal partner stressed.\nIn spite of all this, the firm had felt concerned about their former colleague’s well-being, even agreeing to offer him psychiatric help and money to settle his accommodation bills.\nThe case continues.\nLawyer Graziella Tanti is defence counsel.\nLawyer Stefano Filletti is appearing as parte civile for the law firm.\nInspector Clayton Camilleri is prosecuting.", "comment_count": 0, "id": 943}, {"keywords": "", "author": "Ivan Martin", "article_body": "Work to transform abandoned and derelict buildings across the island into modern social housing accommodation is well underway, the government said on Monday.\nAddressing a press conference outside one such property along a sleepy street in Vittoriosa, Infrastructure Minister Ian Borg said 33 government-owned buildings had recently been handed over to the Housing Authority to be renovated and turned into social housing.\nA preliminary review of four of these properties, he said, had indicated how they could be developed into 11 housing units.\n“This sort of initiative serves, in my opinion, multiple purposes, providing social housing directly in the community where it is needed most, upgrading buildings that could be causing damage to third parties and injecting life into areas that could do with some help,” Dr Borg told reporters.\nInfrastructure Minister Ian Borg (second from right) outside the Birgu property being transformed into social housing.\nThe provision of social housing has been a hot-button issue for the Labour administration, with critics lamenting government lethargy.\nRead:Social housing is not something that should be inherited - Muscat\nJust last week Prime Minister Joseph Muscat weighed in on the subject when he announced that the number of social housing units being financed through the sale of passports would be doubled to 1,000.\nMeanwhile, Dr Borg said that between 2017 and last year, the Housing Authority had been handed around 516 worth of units in government property by the Lands Authority.\nIn deciding to turn these properties into social accommodation, the government was forgoing the funds that lucrative revenues that it could make were it to sell the buildings instead. \nRoderick Galdes, Parliamentary Secretary for Housing, said most of the properties being turned into social accommodation had been abandoned for decades. ", "comment_count": 18, "id": 944}, {"keywords": "", "author": "Jacob Borg", "article_body": "• Activists demand criminal probe to establish if there was criminal complicity by three ministers in controversial contract to shell company for the running of three public hospitals worth over €1 billion\n• Secret agreements signed by VGH investors prior to public calls for the running of the three hospitals \n• ‘Act of modern day piracy’ carried out in ‘complicity’ with Finance Minister Edward Scicluna, Tourism Minister Konrad Mizzi and Economy Minister Chris Cardona, activists tell court\nThree senior government ministers have been accused by activists of being complicit in a criminal conspiracy to drain the public coffers as part of the controversial Vitals Global Healthcare (VGH) deal worth over €1 billion. \nIn a 150-page application demanding an inquiry into the VGH deal, activists from the Civil society NGO Repubblika singled out Finance Minister Edward Scicluna, Tourism Minister Konrad Mizzi and Economy Minister Chris Cardona as key facilitators in the “coordinated” act of modern day “piracy”.\nThey question in the application signed by PN MP Jason Azzopardi why the three ministers, who played differing roles in the deal, were so willing to give a “disproportionate” financial advantage to a company with no medical experience.\nMinisters 'went through the motions' of public competition\nThe activists accuse Dr Cardona and Dr Mizzi of going through the motions of a public process based on impartiality and value for money to award the contract, while in reality being part of a criminal conspiracy with the winning bidder.\nAs previously reported by The Sunday Times of Malta, the application details how Dr Cardona signed a memorandum of understanding in October 2014 with the investors behind VGH.\nThis MoU was signed five months before the request for proposals for the running of three public hospitals was even published by Projects Malta, which falls under Dr Mizzi’s control.\nProjects Malta has refused to publish who sat on the selection committee that awarded the contract to VGH.\nThe ministers are facing accusations that their primary interest was lining their own pockets, rather than safeguarding taxpayers’ money and patients’ needs.\nThe Shift News had revealed how another MoU between the investors was signed in November 2014. This MoU contained specific details about the request for proposals eventually published by Projects Malta, the application states.\nFinance Minister continued to dish out millions\nRepubblika accused the Finance Minister of continuing to dish out millions to VGH whilst being fully aware of the misgivings about the investors behind VGH.\nThe application charts how slain journalist Daphne Caruana Galizia had correctly predicted that VGH would win the contract and had also published a due diligence report raising serious questions about the “sham company”.\nAccording to a transcript of the due diligence report annexed to the Repubblika application, the unnamed author of the report flagged the way how the Prime Minister’s chief of staff Keith Schembri told those interested in the contract that if they worked with Ram Tumuluri, the project’s frontman, the project would be awarded to them.\nThe application says Prof. Scicluna was aware that VGH only had a share capital of €1,200, yet was supposed to invest some €200 million to upgrade the three hospitals.\nThe 1,600 employees at the three hospitals were placed on the public payroll, and the Finance Minister even signed off on an €18 million increase in the €50 million already being given annually to VGH.\nNumerous side letters were signed by Prof. Scicluna granting VGH additional millions, at a time when the Finance Minister was fully aware of the company’s suspicious set up, Repubblika says in the application.\nThe Finance Minister was also the one who gave the go-ahead to allow VGH to unilaterally extend the 30-year extension to a 99-year period.\nRepubblika questioned how Prof. Scicluna did not find it strange that VGH’s CEO popped up as the new CEO of Steward Healthcare, soon after the shell company sold off the concession to the American firm.\nSuspicions of 'coordinated criminal activity'\nThe applications reveal how Ganado Advocates had to write to the registry of companies after discovering that VGH had listed the law firm’s Valletta offices as the company’s registered address, without their permission.\n“Konrad Mizzi and Edward Scicluna had no qualms negotiating with people who stole and even lied about their address”, the application says.\nThis all showed the lack of due diligence carried out by the Maltese authorities, with the blessing of the three ministers, the activists argue.\nThis gave rise to suspicions of coordinated criminal activity by the three ministers, and there was reasonable suspicion they were complicit with third parties to steal or defraud million from the Maltese public.\nThe modern day act of piracy, which saw the investors behind VGH flee the country, leaving behind a trail of debt amounting to €50 million, could not have been possible without the “active and essential” contribution of these three ministers, the activists accuse.\nNews reports about the manoeuvres by those behind VGH would have been enough to spark an investigation, Repubblika said, yet the police sat back and did nothing.\nThe activists are also accusing Ivan Vassallo, the owner of medical supply firm Technoline, of being part of the criminal conspiracy.\nTechnoline was given the exclusive right by VGH to handle procurement for the three hospitals, meaning other medical firms had to submit their bids for contracts to a rival.\nThe Shift News had revealed how VGH funded the €5 million takeover of Technoline, which saw Mr Vassallo suddenly buy out its long time owners.\nOpposition leader Adrian Delia has taken to the courts to try get the deal rescinded.\nTimeline of some key events\nOctober 2014 – Economy Minister Chris Cardona secretly signs a memorandum of understanding (MoU) with the businessmen behind VGH.\nNovember 2014- The businessmen sign another MoU between them based on specific details contained in the request for proposals.\nMarch 2015 – Projects Malta, which falls under Tourism Minister Konrad Mizzi’s control, publishes a request for proposals for the hospital project.\nSeptember 2015 – Then Health Minister Konrad Mizzi agreed to pay VGH €70 million a year, cover the pay of all employees at the hospitals and agreed to pay €1.2 million for the Barts medical facility in Gozo and €1 million for the air ambulance service.\nOctober 2016- Heavily redacted versions of the contracts signed with VGH are released. All key figures and dates are removed.\nDecember 2017 – ‘This is the real deal’- Health Minister Chris Fearne heralds the entry of Steward Healthcare and the exit of VGH.", "comment_count": 91, "id": 945}, {"keywords": "", "author": "Sarah Carabott", "article_body": "€50 million are being made available to small businesses that are planning new capital investment projects.\nLaunched by Bank of Valletta and the Malta Development Bank, BOV SME Invest allows small and medium enterprises easier access to finance through reduced collateral requirements and a 3.5 per cent interest rate.\nInterested businesses can seek financing ranging between €200,000 and €750,000 for a maximum maturity period of 10 years.\nThe €50 million financing package is being made available through a €10 million guarantee provided by the MDB. This is what allowed BOV to lower the collateral obligations, according to the bank’s Chief Credit Business Development Officer Albert Frendo.\nMr Frendo said that through risk-sharing programmes, such as the Jeremie and Jamie schemes, the bank has been better able to support SMEs since 2011.\nHe noted that micro customers made up more than two-thirds of its latest such scheme, while half of these same businesses have been around for five years or less.\nAddressing the launch, Finance Minister Edward Scicluna said he was proud that work usually carried out by international banks was being implemented by Malta’s own development bank.\nBOV Chief Credit Business Development Officer Albert Frendo. Photo: Mark Zammit Cordina\nMeanwhile, Prime Minister Joseph Muscat said the decision to open a development bank was taken some four years ago.\nThe route to opening the bank was a challenging one as it had no precedent, and it required political will and capital, he said.\nHe noted that the €50 million planned to be injected in the economy would result in a total investment of around €90 million.\nDr Muscat also flagged international bank regulations as the “Achilles heel of the Maltese economy” and BOV’s atypical situation. The bank was a small one when compared to its European counterparts, however, it was a large one nationally.\nThe government was engaged in discussions with the bank about long-term solutions he said, adding that international rules would not change for our sake.\nMore information on smefinance@bov.com", "comment_count": 1, "id": 946}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The subject of abortion should not be ridiculed but should rather be a subject of major discussion, Prime Minister Joseph Muscat said on Monday.\nTurning the European Parliament electoral campaign into a referendum on abortion, as the leader of the opposition was doing, was a sign of panic,  Dr Muscat said.\n\"We are ridiculing a very serious subject about which the Maltese deserve a sober discussion,\" he insisted.\n“The government does not have a mandate to introduce abortion. The PN leader is being irresponsible, when, as a survival strategy, he makes declarations that will come back to haunt him.”\nOn Sunday, the PN leader claimed that the upcoming European Parliament elections would be a referendum on abortion since every seat going to the Labour Party would be a seat in favour of abortion.\nDr Muscat said Dr Delia had seen a panic button and pressed it.\n\"That is a short-term and short-sighted strategy by the Opposition leader,” he added. \nIt was those who had no valid argument who ended up scaremongering.\n“From my end I will continue campaigning on real issues – if anything, his comments confirm that the upcoming May 25 elections are a choice between myself on one side, and Dr Delia on the other.”\nWhat does the future hold for Joseph Muscat?\nDr Muscat was evasive when asked about his future after he recently hinted that he will “not stop abruptly”.\nDr Muscat has repeatedly declared that he will not contest another general election, however, he has not said when he will step down and whether he will give up both the government and the party leadership.\nHe has also not ruled out seeking a top EU post.\nAsked about his future and whether he had a cut-off date, Dr Muscat said at the moment he was only focusing on the May 25 elections.\nI will especially continue to focus on May 25 when seeing all of the scaremongering going on, he added.\nPressed further, he said: “After May 25 there will be May 26,” he said.", "comment_count": 235, "id": 947}, {"keywords": "", "author": "Claire Caruana", "article_body": "Sex abuse is a pervasive global issue that goes beyond the Church and which \"will not go away\", Archbishop Charles Scicluna believes.\nIn an interview that sheds some light on his work as the Vatican's leading sex crimes investigator, Mgr Scicluna told The Washington Post that he \"hoped and prayed\" that the institution can \"become an example of best practices\" for its way of responding to and preventing abuse. \n\"But we will not solve the problem,\" the Archbishop told the US newspaper, calling sex abuse a pervasive global issue that goes beyond the church. \nMgr. Scicluna has been travelling to Rome for a week each month since Pope Francis gave him a major role to promote and safeguard the doctrine on faith and morals in the Church. But he was involved in tackling abuse for years before that, having served in the Congregation of the Faith under Cardinal Ratzinger under the Pope John Paul II papacy.\nThe Pope sent him to Chile at the end of January last year to look into allegations against a bishop accused of covering up clergy crimes against minors there.\nWhile he has interviewed hundreds of victims over the years, most of the time, Mgr. Scicluna refuses to speak about cases or his work, with his findings going directly to the Pope. \nAccording to the US newspaper, the Archbishop dismissed the notion that priestly celibacy can lead to a culture of sexual secrecy. The more difficult question, he told the Post, was what to make of data that showed clerical abuse victims were predominantly male, and often teenagers. \n\"People invariably make the link with same-sex attractions. \n\"I don't think you can pinpoint only one set of causes. This cannot be a judgement about a category of people,\" he told the newspaper. \nWhen asked about the possibility of being involved in any future investigations, Mgr. Scicluna said that he would be \"available\". \n\"Probably I will do it again by mandate of the Holy Father.\"  ", "comment_count": 6, "id": 948}, {"keywords": "", "author": "Denise Grech ", "article_body": "Malta has so far taken its protection from natural disasters such as earthquakes and tsunamis for granted, an international body has warned.\nLassina Zerbo, the executive secretary of the Comprehensive Nuclear-Test-Ban Treaty Organization (CTBTO) said the country should step up its monitoring of earthquakes and tsunamis.\nA CTBTO delegation was in Malta to encourage the government to establish a 24/7 monitoring system that gathers data about potential natural disasters.\n“The last tsunami in this region dates back to 1908 – that is long ago, but you never know when a tsunami will hit,” he said.\n“It could happen in the next hour, we do not know. An earthquake in Greece or France can affect Malta,” Mr Zarbo said.\nScientists investigating evidence of tsunami damage on Comino in 2014.\nUniversity monitoring \nThe University of Malta currently has its own seismic monitoring and research group, but Mr Zerbo is concerned this is not being monitored constantly.\n“Malta has an earthquake monitoring centre at the university, but that earthquake centre is not functional 24/7,” Mr Zerbo said.\nThe CTBTO has an international monitoring system that is made of seismic sensors, distributed around the globe.\n“Using that information, Malta can gather information and give it to a centre for tsunami warnings,” he said.\nThe island is “tsunami-genic”, Mr Zerbo said, so it was critical for Malta to have its own centre or for it to be part of an overall region of tsunami centres that will provide the information it needs.\n“This will allow people to save lives, instead of being surprised by the tsunami,” he said.\n“We never anticipate. We deal with crises better than we anticipate them,” Mr Zerbo added, noting this was human nature.\nHe also said authorities seemed open to the idea and hoped the government and the university would join forces to get the best data gathered by the monitoring system.\n“What Malta needs is a system that works,” he said, adding continuous coverage will ensure the country can be prepared for when the next natural disaster hits.\nThe CTBTO has also trained professionals in Malta in order to help with continuous monitoring.\nREAD: Malta might not be prepared for a natural disaster\nMalta's tsunami history\nThe 1908 tsunami was the result of a 7.4 Richter scale earthquake in Messina, Sicily that killed around 200,000 people.\nThe tsunami caused waves to crash into Msida creek. No one was killed. \nExperts have warned that the South-Eastern side of Mt Etna in Sicily is slowly sliding into the sea and could collapse suddenly, causing a tsunami in the Mediterranean. A large part of the eastern side of Mt Etna is believed to have collapsed some 7,000 years ago, causing a major tsunami in the central and eastern Mediterranean.\nScientists at the University of Portsmouth have found geological evidence of \"historic tsunami waves\" that swept over Malta’s north east coast and up to 20 metres above sea level in some places.\nREAD: UK expert urges Malta to re-evaluate tsunami risk\nThe Civil Protection Department subsequently said that it had a disaster master plan catering for such eventualities and it was also conducting a national risk assessment.", "comment_count": 39, "id": 949}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports that medical students fear their studies are “in jeopardy” as Barts students will be joining their clinical practice at Mater Dei Hospital in the coming scholastic year.\nThe newspaper also reports fears by the Insurance Association that breathalyser tests are not serving as much as a deterrent for errant drivers as speed cameras. \nThe Malta Independent quotes Sandro Chetcuti, president of the Developers' Association, saying some developers are promising 'the impossible'. It also carries complaints by NGOs about lack of transparency at the Planning Authority. \nIn-Nazzjon reports how PN leader Adrian Delia warned Sunday that every vote for Labour's MEP candidates is a vote for the European socialist manifesto which includes abortion.\nl-orizzont says there is a major risk that Islamic State could see a resurgence in Libya. It also quotes Prime Minister Joseph Muscat saying his government in a few years created as many jobs as the previous government in 25 years.", "comment_count": 1, "id": 950}, {"keywords": "", "author": "", "article_body": "While speed cameras are widely accepted as a deterrent to speeding, the use of breathalysers to curb drink-driving has yet to be regarded in the same manner, insurers believe.\nIn a Talking Point in Times of Malta, the head of the Malta Insurance Association, Adrian Galea, argues that while speed cameras seem to be acceptable “because they rake in several euros in fines”, breathalyser tests, which he said also save lives, do not seem to be similarly accepted.\n“The association encourages further investment in deterrent, including more breathalyser kits as well as kits to test for drug consumption,” Mr Galea said.\n“The police can only improve their effectiveness if more resources are available to them.\n“The difficulty of the task they face in having to deal with individuals who may be driving under the influence of alcohol and/or drugs and who are facing the prospect of a combination of heavy fines and licence suspension, not to mention the possibility of spending the night locked up, should not be underestimated.”\nHe also insisted on the importance of organising awareness campaigns throughout the year, and not just during the festive period.", "comment_count": 58, "id": 951}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "The magistrates and judges controversially appointed just over two weeks ago have been assigned work despite a challenge to their appointments set to be decided in the coming weeks by a constitutional court.\nThe urgent constitutional lawsuit filed by NGO Repubblika, just hours before the new members of the judiciary were sworn in on April 25, requests the suspension of the appointees until final judgement, as well as referring the case to the European Court of Justice under the preliminary reference procedure.\nSubmissions over these interim measures were heard in two urgent hearings – and lengthy written duels on jurisprudence and legal enunciation put forth – by the First Hall in its constitutional jurisdiction.\nIn the last hearing last on Monday Mr Justice Mark Chetcuti said that since the request involved the judiciary an expeditious decision had to be taken. He deferred the case for judgment on the interim measures, including suspension of the latest appointees, for May 29.\nYet cases have since been assigned to some or all of the new magistrates and judges.\nOne of the appointees, Mr Justice Francesco Depasquale, has issued decrees on deferments, an administrative matter.\nAnother appointee, Magistrate Brigitte Sultana, has hearings scheduled in the Gozo court as early as May 28, a day before Mr Justice Chetcuti is scheduled to pronounce judgment on the request to suspend the appointees. \nSources in some quarters of the court deplored the pressure that getting to work puts on Mr Justice Chetcuti, especially since he had pronounced his intention to deliver judgment expeditiously.\n “Once they have been appointed, and absent any court order to prohibit them from carrying out judicial duties, the Chief Justice has to assign them cases,” said Kevin Aquilina, dean of the Faculty of Laws at the University of Malta. “And they are obliged to perform their duties; otherwise they may be liable to disciplinary action.”\nAsked if this puts pressure on the judge who is considering the request for their suspension, he said: “This puts pressure on everyone – on the judge, the Chief Justice, and the appointees themselves.”\nThe Chief Justice said he could not reply to questions.", "comment_count": 38, "id": 952}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Small countries have a crucial role in urging wealthier nations to take climate change seriously, as the issue is an existential one for them, according to the UK’s special Representative for Climate Change.\nEnsuring that politicians commit to climate change required action from all, including civil society, small States, businesses and financial investors, Nick Bridge said.\n“Small vulnerable Island States had a huge impact in achieving the Paris Agreement on Climate Change as they showed the rest of the world that the issue was an existential one for them.\n“Businesses also have to shift their models to sustainable ones as otherwise they won’t have a future, while financial centres have to invest money in green centres if they want a financial return in the future. Everyone has a stake and an opportunity to play a role.”\nMr Bridge was speaking to The Sunday Times of Malta following a debate on ‘Climate Change and Small States’. It was held last week in Malta in the run-up to the UN Climate Summit in September and as part of a series of events marking the 70th Anniversary since the foundation of the Commonwealth.\nIt follows the publication of a UN landmark report warning about the extinction of a million species, and freak weather patterns earlier this year, when northern Europe basked in high temperatures and the southern part flooded.\nBack then Mr Bridge had tweeted: “Here I sit in deepest existential unease knowing what collectively these bonkers (diplomatic term) record-breaking weather events and trends across the world probably mean.”\nWhat do they mean?\nWe are on track for complete environmental and climatic breakdown\nMr Bridge noted that according to the UN’s Intergovernmental Panel on Climate Change, if global warming is kept to 1.5°C in the next decade, the world would lose 70 to 90 per cent of its coral, which is what sea life depends on. Currently the world is on track for a global warming of 3.5°C throughout this century.\n“That is just one illustration of the existential part – we are on track for complete environmental and climatic breakdown.”\nGlobal warming is already at 1.5°C in some parts of the world, including the Pacific, where hurricanes and cyclones were destroying whole economies, he said, adding that while many in the wealthier countries were aware of the consequences intellectually, they were not feeling them physically.\nNick Bridge. Photo: Matthew Mirabelli\nFor Mr Bridge, climate change is “undoubtedly the biggest challenge of the century and it will be disastrous if we don’t tackle it”.\nWhile the world has not ran out of time yet, it was incredibly urgent to tackle climate change.\nThe UK is aiming at taking a leading role in this regard, hoping that other nations will follow suit.\nIn 2008 its Parliament passed the world’s first climate change legislation, which was recently reviewed by an independent climate committee in order to remain compatible with scientific developments.  \nThe UK is trying to walk the talk and for the first time since 1882, this week it experienced seven days of coal-free power generation. Up until six years ago, 40 per cent of its power generation depended on coal, and the UK is hoping to completely phase coal out by 2025, investing, instead, in offshore wind generation among others.\nHowever, Mr Bridge pointed out that the ground-breaking 2008 Act knew its origins in campaigns by civil society demanding action.\nThe recent protests, he added, reflected a renewed realisation of the urgency that calls on the government to do what is needed in view of what science was forecasting.\nAsked to comment about small States, he said that while they were more vulnerable, they also had a big opportunity to become more sustainable and self-sustaining.\nAmong others, the Scottish Orkney islands were developing tidal power generation, becoming increasingly and completely self-sustaining on renewable energy.\n“Faced with climate change, the Orkney community felt the need to become less vulnerable and more resilient and has therefore gone further faster than the rest.\n“Smaller States do have a harder time accessing international capital, while renewable energy is also not as cheap when it is not on a huge scale, however, these challenges make such States very innovative, creative and self-sufficient.”\nStill, wealthier countries needed to ensure that small States had access to expertise, technical assistance and finance.\nMr Bridge added that the whole world was in a critical political phase at the moment. September’s UN Climate Summit, next year’s UN’s Climate Change Conference and the Convention on Biological Diversity could put us all back on a sustainable track, he said.", "comment_count": 19, "id": 953}, {"keywords": "", "author": "Jacob Borg", "article_body": "A court in April agreed that evidence of criminal activity could exist in the Panama Papers. The decision, which came about thanks to an application by former Opposition leader Simon Busuttil and NGO Repubblika, was only a starting point for the evidence-gathering process against the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi to begin. Jacob Borg looks at the evidence of suspicious activity that can be found in the Panama Papers leak.\nA fishy business in Bangladesh?\nOne of the key pieces of evidence found in the Panama Papers is the famous 17 Black e-mail.\nAn aspect often overlooked in the e-mail is the “business activity” of the Panama companies.\nThe Prime Minister’s top aide and Tourism Minister Konrad Mizzi were supposedly eyeing maritime and fisheries business in Bangladesh, infrastructure projects in Africa and India, tourism in Asia, remote gaming and recycling.\nWhy is this suspicious?\nEven if the e-mail is taken at face value, it is already questionable why two government officials would be secretly entering into such business activities half way across the world.\nA far more likely explanation is that the stated business activities were being given to justify the $2 million (€1.7 million) in deposits the same e-mail suggested Mr Schembri and Dr Mizzi were planning to receive in just one year.\nThe source of these funds is said to be two companies in Dubai called 17 Black and Macbridge.\nNo further information about these companies, or who owns them, can be found in the Panama Papers.\nThe magistrate leading the Panama Papers inquiry is seeking official evidence confirming 17 Black is owned by Tumas Group CEO and Electrogas investor Yorgen Fenech.\nKeith Schembri has already confirmed in an official government statement his link to 17 Black and Macbridge in the form of “draft business plans”, despite assurances by Prime Minister Joseph Muscat that his top aide was no longer involved in any business dealings after taking office in 2013.\nKonrad Mizzi told a court during a libel case in January that he received assurance from Nexia BT that the 17 Black e-mail had nothing to do with him.\nA man walks into an office and buys a Panama company?\nIn July 2013, Nexia BT’s Karl Cini sends an e-mail to Mossack Fonseca about his interest in acquiring three Panama companies.\nBanks reluctant to deal with politically exposed persons owning shell companies\nMossack Fonseca, from whom the shell companies called Hearnville, Tillgate and Egrant were bought, inform Nexia BT of their fee structures.\nInvoices found in the document leak show Nexia BT were being asked to pay $4,356 (€3,876) annually for all three companies.\nThe services provided by Mossack Fonseca included the provision of nominee directors and shareholders. These nominees disguised the true ownership of Hearnville, Tillgate and Egrant.\nWhy is this suspicious?\nCorporate service providers usually incorporate companies upon request by a client.\nThis raises the question as to why Nexia BT would go through the expense of maintaining these companies, on the off-chance that a client or clients would walk into their San Ġwann office asking for three Panama shell companies that were set up in a way that disguises their ownership. \nA leaked FIAU report questioned if the Panama companies were owned by Mr Schembri and Dr Mizzi from the start. Both men deny this.\nMr Cini’s enquiries about setting up a Panama company and a trust started in March 2013, a few days after Labour swept to power in the general election.\nIn August 2013, the shell companies were transferred into the custody of Brian Tonna, Nexia BT’s managing partner and a good friend of the Prime Minister’s chief of staff, Mr Schembri. Evidence to this effect can be found in the Panama Papers.\nTwo months later, a consortium of Maltese businessmen along with Azerbaijan’s State energy company Socar and German company Siemens were announced as the preferred bidders for the power station project.\nThis deal gave the Electrogas consortium a guaranteed revenue stream worth €3.9 billion over a 19-year period.\nMr Tonna headed one of the selection committees that awarded Electrogas the contract.\n\nBanking on secrecy\nDuring the run-up to Christmas 2014, Nexia BT are told what documents they need to set up a New Zealand trust for their as yet unnamed clients.\nFive months later, Karl Cini asks Mossack Fonseca if they can forgo the two bank reference letter for their “clients”, who he says would like to avoid informing their banks about what they were doing.\nLater correspondence and documents in the Panama Papers proves these two clients were Mr Schembri and Dr Mizzi.\nAt least eight attempts to open bank accounts for the government officials can be found in the Panama Papers.\nMossack Fonseca’s attempts to open up these accounts for Nexia BT’s client were often frustrated by the fact that the banks were reluctant to deal with politically exposed persons owning shell companies, due to the increased corruption and money-laundering risk.\nWhy is this suspicious?\nDocuments in the Panama Papers indicate Mr Schembri and Dr Mizzi were planning on receiving monthly payments of €150,000 into their Panama companies.\nIf the planned injection of funds was going to originate from their pre-existing wealth, as the two men claim, their local banks would have nonetheless noticed any monetary transfers from their local accounts to Tillgate and Hearnville.\nThe apparent reluctance to even risk informing local banks about what they were doing shows the lengths to which the two government officials went through to disguise their activities.\nNexia BT also failed to inform the local tax authorities about the trust structures they set up for Dr Mizzi and Mr Schembri.\nHow is money laundering carried out?\nMoney laundering is typically carried out in three stages: Placement, layering and integration.\nAt placement stage, the money launderer aims to introduce his ill-gotten gains into the financial system. Shell companies and trusts are one of the favoured vehicles for doing this, as they disguise the owners of those funds.\nEvidence of Mr Schembri’s and Dr Mizzi’s desire to disguise their link to any funds generated by their offshore vehicles exists in the Panama Papers, as already shown above.\nLayering\nNext up comes the layering, where the money launderer seeks to hide the origins of the funds and make tracing transactions difficult.\nJurisdictions like Panama are known to be favourite countries for money-laundering activities.\nEvidence of this layering technique can be found in the Panama Papers, as documentation shows ownership of the Panama companies was transferred to the New Zealand trusts.\nNexia BT told Mossack Fonseca most of these funds would remain in the same bank account unless transferred up into the New Zealand trust in the form of dividends.\nMr Schembri and Dr Mizzi were in the process of opening bank accounts in the Bahamas for the Panama companies, adding another layer in the form of an additional jurisdiction where funds would have moved through.\nFor the trust set up by Dr Mizzi, his wife and children were named as the beneficiaries of any funds flowing into it from the Panama company.\nThis is typical of a trust set-up, where the settlors transfer assets for the benefit of a third-party, divesting them from the person putting in the funds.\nDr Mizzi’s trust was revocable, meaning the minister could terminate the trust and take back the assets at any time.\nThe trust set up by Mr Schembri has been viewed with more suspicion, as he was both the person settling the funds into it, as well as the beneficiary of those same funds.\nIntegration\nA money launderer’s final task is extracting his ill-gotten gains so it can be used without attracting the attention of law enforcement officials or the tax authorities.\nNo evidence of this stage of the process exists in the Panama Papers, as Dr Mizzi and Mr Schembri’s attempts to open up bank accounts halted as soon as assassinated journalist Daphne Caruana Galizia published her first stories about the scheme.\n\nWhy are we still writing about this?\nThe FIAU first asked the police to investigate potential evidence of criminal action in the Panama Papers in April 2016.\nSince then, little known action has been taken by the police to mount a serious investigation into Mr Schembri (right) and Dr Mizzi’s actions and intentions. They are not known to have ever been called in for questioning about their activities.\nThe German federal police passed on Panama Papers documents to the Maltese authorities towards the end of 2017.\nPrime Minister Joseph Muscat has spent the past three years sheltering the two men from calls to resign. He has also refused to sack them.\nJust last month, Dr Muscat said he saw no reason to question Mr Schembri’s business plans with 17 Black.\njacob.borg@timesofmalta.com", "comment_count": 59, "id": 954}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Tension is brewing at the Presidential Palace over an unprecedented arrangement made between Prime Minister Joseph Muscat and former Presi­dent Marie Louise Coleiro-Preca that allows her to retain certain functions of her former office, The Sunday Times of Malta is informed.\nThe new State-funded ‘Office of the President Emeritus’ permits Dr Coleiro-Preca to carry on with her charity work, which is completely unremunerated, according to her spokesman.\nThe former president has also retained the administration of two entities – The Presi­dent’s Trust and The President’s Foundation for the Wellbeing of Society – which she had set up during her time as President.\nThe spokesman said the foundations’ statutes have now been changed to reflect the new set-up. However the changes have not yet been registered. ­\nAccording to the statutes, it is the serving Presi­dent who must act as the head of these foundations and approve any changes made.\nThe Sunday Times has been told that the new arrangement did not go down well with the new Presidency.\n“The former president is assuming functions which, apart from being unregulated, may also clash with the official Office of the President,” one government official close to his office said on condition of anonymity.\nSoon after ending her term last month, Dr Coleiro-Preca transferred her office and the two foundations to a government building in Floriana and former members of staff accompanied her.\nThe building, previously used by the Foreign Affairs Ministry, was assigned to Dr Coleiro-Preca by the government on the direct instructions of the Prime Minister.\nAll former presidents, who have no constitutional role or function have a driver and a secretary paid for by the government, to be of assistance during their retirement.\nDr Coleiro-Preca has been joined by the former secretary to the presidency, Carmel Briffa, and another senior official previously employed at the Presidential Palace.\nIn addition, 10 former employees of San Anton Palace assigned to the President’s Foundation for the Wellbeing of Society have also been transferred.\nIn answer to questions on this matter, Dr Coleiro-Preca’s spokesman – the same person who performed the role while she was presi­dent – said she had been assigned two officials “in light of the additional responsibilities she has assumed since the end of her term”.\nOffice of the President Emeritus set up after consultations with Prime Minister\nAsked on whose authority Dr Coleiro-Preca had opened the Office of the President Emeritus and taken on the new functions, the spokesman said this followed “consultations with Prime Minister Joseph Muscat”.\nThe spokesman said: “The Office of the President Emeritus Coleiro-Preca was set up by the government and is based in Floriana along with the foundations, following consultations with the Lands Authority.\n“It is allocated its budget by the Ministry of Finance and confirms that no costs are incurred by the office for any external services.”\nThe statutes of the two foundations were “being amended to reflect the new structure and have been filed and registered,” the spokesman added.\nOn checking, however, The Sunday Times of Malta found that no changes in the statutes had yet been filed with the Office of the Regis­trar for Legal Persons. Both foundations are still registered at San Anton Palace, the official residence of the President of Malta.\nThe trustees of the President’s Foundation for the Wellbeing of Society have not changed since Dr Coleiro-Preca was president. They include Mr Briffa, John Camilleri, who is the former chief of staff of the Office of the President, businessmen Michael Bianchi, Corinthia Group chairman Alfred Pisani and entrepreneur Winston Zahra.\nA number of questions sent to the former president over her new functions were not answered. She was asked how many people have been employed by the new Office of the President Emeritus, what is their rank, who is funding their operations, when the arrangement to take over the Floriana premises was made and whether any outside media services had been engaged by the Office of the President Emeritus.\nSo far, Dr Coleiro Preca has been using the services of the same PR agency for the Wellbeing Foundation that she used as president.\nThe spokesman did say, in answer to the questions, that the former president was receiving no remuneration “for her dedicated commitment to the abovementioned causes and organisations”.\nOn his part, a spokesman for President Vella gave a diplomatic reply when asked about consultations with the former presi­dent and the Office of the Prime Minister.\n“The Office of the President would like to highlight that, on agreement between the Office of Prime Minister and President Emeritus Coleiro Preca, there was an understanding that the Foundation for the Wellbeing of Society would continue to be administered by President Emeritus Coleiro Preca,” he said.\n“Since the new Presidency has nothing to do with the foundation there was no need for any consultation or handover,” he said. The office avoided replies on the taking over of The President’s Trust.\nThe Prime Minister’s spokesman did not reply to questions.\nFormer president decries 'distorted picture'\nIn a reply after The Sunday Times of Malta published its story, the former President described the article as an attempt to paint a \"distorted picture\" of the state of affairs surrounding the office and Dr Vella. \nHer office referred to a statement issued by the Prime Minister on March 5, before her term as President of Malta expired, which stated the following: “Following consultation with the President (Marie-Louise Coleiro Preca), it has been decided that upon leaving office the President shall continue to serve as the Chair for the Foundation of Wellbeing for Society which she herself had set up during her term. The foundation will retain its autonomy and, in order to continue to perform its functions, will retain the resources with which it already operates in order to perform its functions.” The article \"gives the distorted impression that this was a decision taken by Her Excellency to exclude the President of Malta – when nothing could be further from the truth.\"\nHer office pointed out that while former presidents had been assigned one official, Marie-Louise Coleiro Preca has been assigned two in the light of her involvement with the Malta Foundation for the Wellbeing of Society as well as the privately-funded Emanuele Cancer Research Foundation and the Malta Trust Foundation. \"These organisations are all fully regulated, bring together professionals of the highest calibre and operate the highest standards of governance, as well as carrying out valuable work that benefits a very large number of people’s lives. There is no competition when undertaking social work and good, which can benefit all those members of society that are vulnerable.\"The office made it clear that it was Dr Coleiro Preca's intention from the outset, to have the best possible relations with her successor, whom she holds in the highest regard. ", "comment_count": 77, "id": 955}, {"keywords": "", "author": "", "article_body": "A blaze which broke out in a third-floor apartment in Ħamrun was quickly put out by firefighters on Sunday.\nThe mid-morning blaze near the Mile End ground started in a kitchen and was controlled before spreading.\nNo one was injured. ", "comment_count": 0, "id": 956}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government is committed to making sure everyone in Malta enjoys a good quality of life, Prime Minister Joseph Muscat said on Sunday morning, insisting this would be its main priority moving forward.\nAddressing Labour Party supporters in Mosta, Dr Muscat said the government’s main priority would be ensuring that the people’s ambitions and priorities are met.\n“We do not scare people but we give them courage. That is why our families’ priorities are changing. Today, people’s biggest priorities aren’t jobs, high bills or the uncertainty of fluctuating fuel prices. They are now talking about a good quality of life.\n“We will not just stop at talking about what we have managed to achieve, but about the quality of what we can do next,” he said.\nWhile speaking about plans for the future, Dr Muscat insisted that it is also important “to keep in mind where we were when we left off”.\n“We had 7,000 people had been registering for work. Today, that number has been reduced to 1,800 people,” he said, adding that young people and women who joined the workforce for the first time also managed to find work. \n\nOn poverty, Dr Muscat said that this was a reality which the party believed could be combated through work, education but also through social services.\n“We inherited a situation where 43,000 people could not lead a decent life. Of these, three of every four who were in such a state are no longer in that situation. We still have 14,000 people and we will keep working until there will no longer be a single person who is experiencing poverty,” Dr Muscat said.\n\"What others created in 25 years, we exceeded in just a couple of years,\" he iterated.\n“That is why people trust us. That is why people’s priorities change and develop. No wonder the people are not worried about the island’s economy,” he said.\nThe government’s strength, he said, came from the good teamwork among its members. If one person erred, he insisted, the others stood by them.\nEnvironment, housing initiatives\nReferring to the project to create an open space in Ta’ Qali, announced earlier this week, Dr Muscat said once completed, the space would be equivalent to a third of London’s Hyde Park.\n“We will be planting more than 100,000 trees in total,” Dr Muscat said, referring to other projects in other places on the island, including Birżebbugia.\nOn social housing, Dr Muscat said that the decision to have more housing would enable more people to have their own homes, insisting however that abuse would not be tolerated, with programmes designed specifically to help people get back on their feet to continue educating those in need.\nReferring to a ward at St Vincent De Paul for those who receive treatment there even though they are still young, Dr Muscat said that during the week he saw first-hand the need for investment there.\n“We will not just leave them there. We will continue to ensure that they enjoy a good life. We want to encourage them to get out from their beds and instead have them in an environment where they can interact with people their own age. We hope to encourage them and to provide them with all the help they need so that they return to living with the community. That is our vision,” he said.\nThroughout this campaign, the Prime Minister added, he was happy to see that the Labour Party was speaking about things that mattered, instead of wasting time scaring people.\n“I ask you to look closely at what is being said. Others have yet to discover what their principles are and so what they say is contradictory. They end up with a hotchpotch of declarations,” Dr Muscat said.\nIn the past week, some from the PN again said they are not sorry about the lies they invented about him and his wife, he said, in reference to the Egrant allegations.\n“I don’t need an apology. My family and I know what we went through. But there should be an apology made to the Maltese people,” he went on.\nOn calls to publish the Egrant inquiry report in full, Dr Muscat reiterated that he would be following the instructions of the Attorney General, adding it was a matter of ‘when’ the report is published and not ‘if’.\n“I will never forget driving past a balcony and seeing a poster of me and my wife behind bars and my daughter asking me what she would do if we were to go to prison,” Dr Muscat said.\nThe answer to those who are still trying to unearth such a lie will be given to these people on May 25.", "comment_count": 41, "id": 957}, {"keywords": "", "author": "Denise Grech ", "article_body": "The upcoming European Parliament elections will be a referendum on abortion since every seat going to the Labour Party would be a seat in the European Parliament in favour of abortion, PN leader Adrian Delia claimed on Sunday.\nSpeaking at a party event in Mellieħa, Dr Delia started by referring to those mothers who had had an abortion, saying they did not deserve to be condemned but to be helped.\nThe Opposition leader thanked mothers facing various circumstances. He thanked single mothers and the mothers of politicians, \"who have to watch as their children are mocked on the public stage\". \nDr Delia criticised those who said they were pro-choice instead of saying they were pro-abortion. They were saying they were in favour of the choice to end the life of someone else, Dr Delia said.\nThe government, he added had described the embryo as a clump of eight cells, showing it did not recognise the rights of the unborn child.\nQuoting from the European Socialists' manifesto, Dr Delia said that Frans Timmermans, the \"intimate friend\" of Prime Minister Joseph Muscat had proposed that \"every individual should have equal access to sexual and reproductive rights\".\nThis was a guarantee that every seat the Labour Party won was a seat in favour of abortion in Malta, Dr Delia said.  \"A vote for Labour is a vote in favour of abortion\". \nThe Labour party had repeatedly said it was not in favour of abortion in Malta, but Labour MEPs did not respond to a survey by the Life Network Foundation on whether they were in favour of the measure.  \nThe Labour Party was not saying the truth because it had \"something to hide,\" Dr Delia said.\n'20 people will die in two weeks due to air pollution'\nTurning to environmental concerns, the Opposition leader said climate change would lead to more injustices.\nImmigration would become a bigger problem as the climate changed because people in the most affected countries had to flee and come to Malta and other countries, he said. \n\"We cannot stand around and not do anything any longer,\" Dr Delia said. Premature deaths due to air pollution in Malta were on the rise, and 20 people would die by the time the election took place in two weeks. \nThe Nationalist Party wanted to change the government's attitude on the environment. The government had pledged to double the park in Ta' Qali but everyone knew that the environment was not a Labour priority.\nThe government had also lost its social consciousness since it did not support youth. Young people were trying to start their own life but could not afford to buy or rent a house, Dr Delia said, adding Dr Muscat was the only Prime Minister that has not yet built social housing. \nA fired-up Dr Delia encouraged people not to lose heart. \"You have a duty and a responsibility, with MEPs, with us, to stand up to take on this responsibility to give [the government] a response,\" he said.\n\"Do not lose heart,\" he said. \"Be convinced. I am convinced,\" he told supporters. \nLabour: Delia coming up with issues which do not exist\nIn a reaction the Labour Party, without mentioning abortion, said Dr Delia had run out of arguments and was inventing issues which did not exist. It said the elections on May 25 were a contest between him and Joseph Muscat and about where they wanted to take the country. ", "comment_count": 120, "id": 958}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Maria Portelli woke up more than three hours after she was scheduled to give birth to her first daughter, but there was only an operating theatre nurse with her, and no baby.\nMaria Portelli and her two children.\nHer maternal instinct kicking in, the 30-year-old immediately thought something was wrong with her daughter, but the hospital staff reassured her she had given birth to a healthy girl.\nIt emerged that she was the one who had required urgent medical intervention – she had lost so much blood after birth that blood had to be transferred urgently to Gozo by helicopter.\nMs Portelli said she never ima­gined she would need blood, especially considering that her pregnancy was a regular one.\nShe had been asked to turn up on a Monday for a C-section, when the Gozo General Hospital’s blood reserves are well-equipped. But not even this was enough for her postpartum hemorrhage, and more blood had to be flown in from Malta.\n“I continued to need blood the following day, and as I started to come back to my senses I thanked God that I had been born at a time when blood transfusion was a regular procedure.\n“My family knows someone who a couple of generations ago had gone through a similar experience and lost so much blood that she died.”\nIt has been six years since the ordeal, and Ms Portelli gave birth without any similar issues for the second time in 2016.\nThere are quite a few in­stances when a mother could require blood either before or after birth.\nAstrid Zarb, charge midwife at Obstetrics Ward 2, said these included situations when a pregnant mother has a blood disorder, such as iron or folate deficiency.\nThis could see the mother’s haemoglobin dropping and the medical staff would want the mother to have a good level of haemoglobin before delivery as it could drop further because of bleeding. A blood transfusion could do the trick.\n An urgent blood transfusion could also be required when a pregnant mother suffers ante­partum bleeding. Such situa­tions could put both the mother and baby in great danger of losing their life, and a bag or two of blood could save both lives, she added.\nMothers can also bleed heavily postpartum, immediately after delivery or even up to six weeks later. Losing a lot of blood could be a serious threat to the woman’s life, and again, a blood transfusion could be a life saver, she noted.\nSometimes it is newborns who need a blood transfusion. Babies are very fragile, especially if born prematurely or have a medical problem.  \n“I can recall several cases of mothers with massive bleeding both pre- and post-delivery. Thanks to the prompt action of all the team and the availability of blood, these mothers and their babies were saved.\n“The message we need to deliver is that every drop of blood is essential and it does not take much for a healthy adult to donate blood.”\nThe blood transfusion unit has a daily demand of 50 bags, often struggling to keep up.\nAt the moment there is a huge demand, especially for the O and A+ type.\nThose who wish to give blood and have returned from abroad over the past four weeks should phone 8007 4313 to check if they are eligible. Donors should take their identity card, driving licence or Maltese passport with them.\nTo keep updated, look up National Blood Transfusion Service – Malta on Facebook.", "comment_count": 4, "id": 959}, {"keywords": "", "author": "", "article_body": "The first 24 of 70 beams that will form the deck of the first flyover at the Marsa junction project were unloaded at the Grand Harbour, a short distance away from the project site, this weekend.\nThe €70 million project will be finalised by end of 2020.\nEach concrete pre-stressed beam is 26 metres long, weighing 36,000 kilos (36 tonnes).\nThe other straight beams of this and other flyovers will be produced by the contractors in a temporary pre-stressed beams plant being set up within the project site.\nThe curved steel beams of the second flyover are being produced in Turkey and will be on their way to Malta in the coming months.\nThese two connected flyover structures will form the new direct link between Triq Giuseppe Garibaldi and Triq Aldo Moro.\nRead:Marsa junction lights dismantled after 21 years\nA third flyover structure will eventually be connected to the first structure as well, to link Triq Aldo Moro with Vjal Santa Lucija, forming the tallest flyover on the island.  \nA render of how the Marsa Junction will look once finished by the end of next year.\nMeanwhile work is going ahead full-steam on site, with Infrastructure Malta currently focused on the construction of the 14 pillars that will support these two flyovers.\nThis weekend, workers prepared the foundations of the last three columns, towards Triq Garibaldi.\nExcavation and concrete works are continuing day and night so that part of Triq il-Gvern Lokali which was closed on Friday night can be reopened by 5am on Monday, avoiding unwanted congestion for road users during the week.\nThe beams that arrived in Malta this weekend will start being laid over the 14 columns soon, Infrastructure Malta said.   \nThe flyovers and over 12 kilometres of new or reconstructed lanes, grade-separated at three different levels, will create direct northbound and southbound connections between Triq Aldo Moro, Vjal Sir Paul Boffa, Vjal Santa Lucija, Triq Giuseppe Garibaldi and Triq il-Marsa.\n\nThe project will see the end of  traffic lights waiting times, and related congestion emissions, for over 100,000 road users who travel through this junction every day.\nThe new multi-level intersection includes the highest, the longest and the widest flyover structures ever built in Malta.\nAt four storeys high, the junction will boast the island's tallest flyover\nThe tallest section will rise over four storeys to surpass a lower flyover beneath it, and the two longest ones, extending over 400 metres, will connect Triq Garibaldi and Vjal Santa Lucija to Triq Aldo Moro.\nThe widest of the seven structures will include four vehicle lanes, forking into two different flyovers, each with two lanes.", "comment_count": 40, "id": 960}, {"keywords": "", "author": "", "article_body": "Europe's popular annual fest of kitsch and outrageous fashion kicks off Tuesday in Tel Aviv, with Israel hoping the Eurovision Song Contest may help burnish its image despite boycott calls.\nLast year's winning performance by Israeli singer, Netta Barzilai, with her #MeToo-inspired song \"Toy\" -- which included clucking sounds and chicken-like dance moves -- secured her country the right to host this year's televised extravaganza.\nBookmakers are putting The Netherlands as this year's favourite, followed by Russia.\nOne bookmaker has placed Malta's Michela at sixth. Michela, Malta's young X Factor winner, had two successful rehearsals last week.\nShe commented on Facebook that the dance for her Chameleon entry is the 'latest craze' among Eurovision contest followers. \nYouTube figures appeared to back her claim, with Malta having overtaken The Netherlands as the most viewed music video of 2019.\nMichela will perform 11th in the second semi-final on Thursday. The final night will be held on Saturday. \n\nThe largely European competition, which gifted to the world the Swedish supergroup ABBA, dates back to the 1950s and has widened over the years to include broadcasters who subscribe to the European Broadcasting Union, spreading now as far as Australia.\nMany culture lovers openly sniff at the contest, deriding it as the height of bad taste. But its irreverent mix of glitz, glamour and over-the-top costumes has won a devoted following of millions, particularly among gay fans.\nMadonna under pressure \nAlthough it has waded into complicated geo-political waters in the past, this year's competition has become embroiled in the deep divisions of the Israeli-Palestinian conflict.\nBig-name rock stars including Pink Floyd's Roger Waters and British singer Peter Gabriel have unsuccessfully urged that it be relocated to another country.\nUS music icon Madonna has come under pressure to drop two performances she will reportedly give when the semi-finals culminate in the finals on Saturday, May 18.\nAnd the pro-Palestinian Boycott, Divestment and Sanctions (BDS) movement is calling for the event to be boycotted as part of its campaign against Israel's occupation of Palestinian territories.\n\"We Palestinian singers, songwriters, dancers, musicians and other artists urge all Eurovision 2019 finalists to withdraw from the contest,\" it said in a statement on its website.\nBut such moves have been dismissed by organisers and this year 41 nations are competing, with the Netherlands favourite to win, according to a survey of bookmakers by independent fan website Eurovision World. Dutch singer Duncan Laurence sits at a piano to perform his love song \"Arcade\".\n\"Hosting Eurovision is one of Israel's biggest coups in terms of popular culture on the international stage,\" Israeli daily Haaretz wrote on its opinion page.\n\"The prestige and primetime global attention for Israel may prove too big a temptation for Hamas to ignore.\" \n'Voice of LGBT youth' \nAround 200 million people are expected to tune in for Saturday's finals, and to mark the occasion Tel Aviv is also brushing up its gay-friendly image.\n\"Eurovision is an opportunity for incredible global exposure,\" the coastal city's mayor Ron Huldai told a recent press conference.\n\"Tel Aviv will welcome thousands of tourists, will host 1,500 journalists, and will be seen by tens of millions of viewers.\"\nIsrael won the job of hosting this year's 64th Eurovision contest after Barzilai's stunning show in Portugal last year.\nBut this year, the Israeli entry \"Home\", an operatic-style ballad sung by Kobi Marimi, has been ranked at a lowly 25th place. \nOther favourites for lifting the trophy include France, whose 19-year-old hopeful, Bilal Hassani, proclaims to be the \"voice\" and the \"face of the LGBT youth who want to change things\" with his song \"Roi\", or king.\nA huge Eurovision fan since he was a young child, Hassani has become known for his blonde wigs and androgynous looks. But he has faced a barrage of homophobic insults and death threats.\nEntries from Sweden and Azerbaijan are also among the top favourites.\nWhile Australia's Kate Miller-Hiedke is making waves with her haunting \"Zero Gravity\" apparently based on her experiences of post-natal depression.\nPromoter Live Nation Israel said last month that Madonna would sing two songs during the interval of the contest's finals.\nAn admirer of the Jewish mystical tradition of Kabbalah, she has performed in Israel several times and also made private visits.\nEurovision truce? \nApart from the boycott threat, there has also been talk of possible disruption by rocket fire from Palestinian militant groups Hamas and Islamic Jihad.\nLast weekend the two groups rained rockets on southern Israel from launch sites in the Gaza Strip, drawing waves of Israeli retaliatory strikes.\nAt least 25 Palestinians, including at least nine militants, were killed. Four Israeli civilians died in the Palestinian rocket attacks.\nThe cross-border duelling petered out Monday after the Palestinians said they had agreed to a truce brokered by Egypt, but there were warnings it might not hold for long.\nThe \"contest might actually have saved the parties from escalating\", said Tareq Baconi, analyst with the International Crisis Group think-tank.\nThose who win through to Saturday's final will join host Israel and the so-called \"big five\" of Britain, France, Germany, Italy and Spain -- all of whom are entitled to skip the elimination rounds.\nBarzilai's win was Israel's fourth victory and the country previously hosted the contest in Jerusalem in 1979 and 1999. ", "comment_count": 24, "id": 961}, {"keywords": "", "author": "Keith Micallef", "article_body": "Taxpayers have so far forked out more than €2 million in subsidies for a select group of door-to-door gas vendors under a 2014 concession agreement, even though the service is already provided for free by Liquigas.\nKnown as a public service obligation, the 15-year concession was granted by the government on the eve of the 2014 European Parliament election. It allows 31 vendors to claim compensation, at 13c3 per kilo, if they suffer a drop in sales below the base level, which is set at that of 2013.\nThe deal was justified on the ground that delivery of gas to certain remote areas of the island is not economically viable.\nA fortnight before the signing, gas vendors had staged a protest demanding compensation for the losses incurred due to the termination of a long-standing territorial exclusivity agreement. This agreement had been declared null by the competition watchdog as it breached competition law.\nThe government’s decision to award subsidies to the vendors had raised eyebrows. Many questioned the need for such a mechanism when Liquigas (a joint venture between Liquigas S.p.A. of Italy and Multigas Ltd of Malta) which bottles and distributes LPG, makes door-to-door deliveries free of charge. The service is offered over the phone, through the company’s website and even on Facebook.\nIndustry sources had said at the time that the agreement smacked of State aid through the back door, an attempt to avoid landing in hot water with Brussels. \nDetails on the subsidies paid so far were only granted to The Sunday Times of Malta following a Freedom of Information request, after the Energy Ministry failed to reply to questions.\nBetween May 2014 and May 2018, a total of €2,040,942 were paid out in subsidies, with the annual amount increasing each year. It totalled €271,089 in the first year, more than doubling to reach €572,535 in the next, while between June 2016 to May 2017 it rose further to €614,358. Then, in the period June 2017 to May last year, taxpayers ended up forking out €854,049, more than three times as much as the subsidy paid in the first year.\nConsequently, the average compensation per vendor also registered an increase, from €11,295 in the first year up to €30,502 in the fourth. During this period the highest subsidy given to an individual door-to-door seller shot up from €39,646 to €81,844 last year.\nHowever, not all of the 31 licenced vendors benefitted, with the number of those receiving compensation ranging between 24 and 28. For some reason, not all of those entitled to it filed a compensation claim. \nNonetheless, the initial warning of some in the industry has been confirmed: as more players entered the gas distribution market, the level of compensation claims would rise. This is because with the presence of more licenced vendors and more fixed-sale points, these select group of door-to-door distributors are more likely to suffer a drop in sales.\nState Aid is forbidden under EU rules except if a particular sector is declared to be of “general economic interest”. In the case of gas vendors, the government had justified the compensation on the basis that it wanted to guarantee the gas distribution service to remote areas deemed not to be commercially viable.\nThis concession came into force after the competition watchdog in 2013 had declared null an exclusivity agreement that went back to 1992. This ruling had paved the way for the liberalisation of the gas distribution sector. However, door-to-door vendors who were granted a licence after the 2014 PSO agreement are not eligible to subsidies. ", "comment_count": 23, "id": 962}, {"keywords": "Education", "author": "", "article_body": "Junior Achievement Young Enterprise Malta Foundation (JAYE) concluded its 30th anniversary celebrations with its Annual Finals and Awards Night a few days ago. Recently-appointed CEO Fiona Captur revisits the events of the year, while looking ahead to new opportunities.\nIt has been an incredible year for the Junior Achievement Young Enterprise Malta Foundation (JAYE). For its 30th anniversary celebrations, the organisation held the Junior Achievement European Annual Conference in Malta last December, including an Entrepreneurship Education Summit. This was followed by a 30th Anniversary Gala Dinner, bringing together past and current CEOs, mentors, teachers, staff, alumni, students, sponsors and JAYE friends.\n“It was an opportunity to meet all the people touched by JAYE and to see the JAYE influence feeding down the generations,” said new CEO Fiona Captur.\n“Having taken a good look behind us at all our achievements, the baton has now been handed over to me to take JAYE into its next phase of growth.”\nJAYE offers extraordinary experiences to people of different ages. At primary level, the organisation works on building students’ awareness of the part they ought to play in their community and society as a whole. At secondary level, the foundation promotes a more European concept of economics. There is also strong focus on the importance of continued education and the correlation between education and the working world.\nThe Company Programme at sixth form and the StartUp Programme at tertiary level are the basis of the – by now familiar – annual competition.\n“The competition is but a means to an end,” she continued. “The JAYE experience gives our students more than business plans and financial statements. Our achievers take away life skills they didn’t know they had; skills that employers today are desperately looking for. Initiative, communication, teamwork, negotiation skills and perseverance complement the business and financial acumen they learn, making them more work-ready.”\nThe 2019 Company Programme winners announced at the Awards were Code B, from GF Abela Junior College, who were named Company of the Year. YGM from St Edward’s College won the Best Presented Financial Statements Award, while the Best Business Plan Award and Best Digital Marketing Awards went to Exhale, from St Aloysius College. Enlight, also from St Aloysius College, won the Best Human Resources Award, while the EFQ Quality in Excellence Award was won by AIDA from GF Abela Junior College. Rel8 from St Aloysius College was named Best Social Enterprise.\nThe StartUp of the Year 2019 Award was won by JAXI, from St Martin’s Institute. Other StartUp winners were IntolerEat from the University of Malta, which was awarded the Best Social Enterprise Award, and Rizerve from St Martin’s Institute won the Best Business Potential Award. Finally, Elaine Busuttil Gili from St Edward’s College won the John Harper Award, and the Philip Bonnet Award for Perseverance was awarded to Andrew Emanuel Attard, from the University of Malta.\n“We were awed and humbled to have been selected as finalists,” said the students behind Code B. “So, when we won JAYE Malta Company of the Year Award, we could not\nhave been happier. What started as a simple idea eventually came to fruition as BIN IT, a product that is now used by hundreds of households in Malta and Gozo. This experience has been like no other, and one that taught us new skills that we could not have learnt academically in a class.”\nJAXI’S team members were equally enthusiastic. “The announcement provided a moment of true happiness. We couldn't believe we had really made it, together, as a team. We worked hard to achieve this. We received a lot of valuable advice from our mentors and judges, and are very appreciative of it.\n“Winning did not come easy,” they added. “It required diligence, energy and long hours. Yet we believe that we can now apply the new skills we learned to the real business world.”\n“The critical point is that while we have winning teams, the individual experience for each achiever makes them all winners. Managing disappointment and learning from it is equally part of that journey,” emphasized Captur. “The winners now head for the JA European Finals where standards are very high so while excited, they really need to up their game!”\nTaking a walk down memory lane, Captur recalled being actively involved in the setup of the then-Young Enterprise 30 years ago.\n“We had one desk phone and one floppy disk on a shared PC. No e-mail or mobiles – nothing. What certainly hasn’t changed is the passion that inhabits all those involved with JAYE. On the other hand, the products the students come up with reflect an interesting evolution – going from clocks and cork mats in the 1980s to apps and technology now.”\nLooking ahead, Captur affirmed that entrepreneurship education is critical in a constantly-evolving world, and needs its place in the school curriculum. To this end, JAYE will be participating in the JA European Entrepreneurship Education Summit in Lille, France, this July. It will bring together European governments, businesses, NGOs, researchers and educators, and its mission is to increase the quantity, quality and impact of entrepreneurship education in Europe.\n“Students need to keep evolving in a world where we do not understand what tomorrow’s jobs will require,” she added. “In this competitive world we live in, the skills JAYE imparts are critical.”\nJAXI – StartUp of the Year Winners – St Martin’s Institute", "comment_count": 0, "id": 963}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday. \nThe Sunday Times of Malta reports that tension is brewing at the Presidential Palace over an unprecedented arrangement made between Prime Minister Joseph Muscat and former Presi­dent Marie Louise Coleiro-Preca that allows her to retain certain functions of her former office.\nThe newspaper also reports that the number of traffic tickets issued by the police in 2018 dropped to a six-year low, with an average of 4,400 fines issued every month.\nThe Malta Independent on Sunday says climate change and migration are having an impact on infectious disease levels in Malta.\nMalta Today reports about possible dangers from a Huawei communications ling. It also reports that according to its survey, defending Malta's name is a major concern in the forthcoming MEP elections.  It also raises concern about an 'assault' on farmland earmarked for development in Swater. \nIl-Mument insists that Labour MEPs voted 16 times in favour of abortion. It also says minister Konrad Mizzi is continuing 'to destroy' Air Malta with manoeuvres to sell off the engineering section. The newspaper also quotes PN leader Adrian Delia as saying that the PN wants to plan the country's future with young people.\nKullĦadd says Nationalist MEPs had backed EU tax harmonisation, something which would undermine thousands of jobs in Malta. \nIt-Torċa recounts the story of a victim of a paedophile, saying the victim had come to love the aggressor. Separately, it reports that Malta would come to a halt if it had no foreign workers.  \nIllum says there is a battle for the PN's second seat in the European Parliament, with Frank Psaila seen in the lead ahead of incumbent David Casa. Roberta Metsola appears certain to win the first seat and Casa's supporters hope he will inherit her second preferences. \n ", "comment_count": 1, "id": 964}, {"keywords": "", "author": "", "article_body": "Giorgio Veroni, the co-owner of Formula E, was in Malta last week on a flying visit where he met up with various ministers regarding the possibility of holding a Formula E race in Malta annually.\nGiorgio Veroni, right, having lunch in a Valletta restaurant with his friend Peter Darmanin.\nThe idea of holding such an event locally was suggested to Mr Veroni by his friend Peter Darmanin, an entrepreneur who owns three top restaurants in Spinola Bay, St Julian’s.\nMr Darmanin told The Sunday Times of Malta that the ministers who met Mr Veroni, namely Roads Minister Ian Borg, Tourism Minister Konrad Mizzi and Parliamentary Secretary for Sports Clifton Grima, were all quite “enthusiastic” about hosting a Formula E race in Malta.\nFormula E is a class of motorsport that uses only electric-powered cars. The series was conceived in 2011 and the inaugural championship commenced in Beijing in September 2014. The series is currently in its fifth season. It is sanctioned by the FIA, the global organisation that promotes motor sport.\nRacing takes place on temporary city-centre street circuits which are 1.9 to 3.4 km long.\nChampionship boasts one of the best sporting calendars in the world\nFormula E has grown into a global entertainment brand and with 11 teams and 22 drivers on the grid, the Championship has become a destination for the world’s best motorsport teams and talent. With a total of nine manufacturers on board – the likes of Jaguar, Nissan, BMW, Audi, DS and Mahindra – Formula E serves as a competitive platform for global car manufacturers and mobility providers to test and develop road-relevant technologies.\nThe Championship boasts one of the best sporting calendars in the world, with 13 races in 12 of the world’s most progressive cities covering five continents.\nA Formula E race was held yesterday in Monte Carlo; a week before one was held in Paris and before that in Rome.  Other Formula E races coming up are in Bern, Berlin, London and New York.", "comment_count": 95, "id": 965}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Ministry held the second edition of the Gozo Alive weekend of cultural activities. The many popular events varied from popular music to dance, visual arts, history, culture, digital arts, gastronomy and fashion shows.\nThe main highlight of the event was on Saturday where the streets and public areas around Victoria were the setting for popular cultural performances, while churches and chapels served as the background for classical concerts.\nOver the weekend, Gozo certainly came alive with musical performances by renowned local entertainers, including Mae, Novel, Firelight, Tribali  and the exclusive participation of the popular English singer, songwriter, rapper and record producer Craig David.", "comment_count": 1, "id": 966}, {"keywords": "Gozo", "author": "", "article_body": "An exhibition featuring Vincenzo Cremona’s best-known works in Malta and Gozo was inaugurated by Gozo Minister Justyne Caruana at the La Stella Band Club in Victoria. The exhibition is the prelude of a programme of festivities spread over three months leading to the feast of St George in the third week of July. The liturgical feast of St George was celebrated on April 29. The La Stella Band Club is this year commemorating the 125th anniversary of Cremona’s masterpiece representing the victory of St George over evil. The statue is used in the external festivities in honour of the saint.", "comment_count": 0, "id": 967}, {"keywords": "Education", "author": "", "article_body": "As part of the EU project led by the University of Malta, a diverse group of educators, researchers, entrepreneurs and artists from various countries recently held an intensive five-day course in Greece led by experts from around Europe to tangibly reimagine how education could be in 2050.\nDr Kerry Chappell, one of the course experts performing her workshop.\nThe course showed how difficult it is for groups with diverse backgrounds to work together. Participants were purposefully placed with other individuals who shared differing expertise, creating a space where highly philosophical and practical minds needed to find a way to create and build on ideas together.\nDespite the inevitable hiccups in these challenging working groups, participants produced highly creative and innovative projects. Their ideas ranged from a posthumanist vision for education to an education model with continuous learning where the school is the community. The transdisciplinary approach worked to envision a different future that tries to make small strides to improve society.\nOver the next couple of years, the project, entitled Sci Culture, hopes to develop the course to effectively combine various disciplines to facilitate the skills of critical thinking and dialogue. Such skills are needed to guide decision-making to arrive at solutions for the complex challenges society faces. The project has the ambitious goal of facilitating a network of ‘Sci Culture ambassadors’, and engaging thousands of individuals all over the globe with the idea that transdisciplinarity is the way forward.\nSci Culture’s next course, to be held in Norway in November aims to continue to improve the approach. Grants will soon open for University of Malta students interested to participate in the course.\nSciCulture is funded by the Erasmusplus programme with support from the European Commission. The project is led by the University of Malta in partnership with Science View, the University of Exeter, the University of Bergen and TU Delft. For more information visit the links below.\nsciculture.eu\nwww.facebook.com/sciculturecourse\ntwitter: @culture_sci", "comment_count": 0, "id": 968}, {"keywords": "Gozo", "author": "", "article_body": "The third edition of Science in the Citadel provided a stimulating experience for children and adults. The one-day science extravaganza included an interactive fair where visitors joined in experiments, demonstrations, games, workshops, exhibitions and exciting shows incorporating puppetry, comedy, dance and magic. Talks on various topics, including innovative farming, sustainable energy, bee therapy and maritime archaeology, were also held.", "comment_count": 0, "id": 969}, {"keywords": "Education", "author": "Carm Cachia", "article_body": "Artificial intelligence (AI) is a pivotal technology that is bound to disturb the world in the way digital technology works and its effect on society, industry and education. AI has been with us for some time through existing technology, sometimes unknowingly, but other times very evidently.\nIt would be naïve to say we did not know that this was coming. In the past 15 years, Amazon, Google and others leveraged the use of machine learning to their commercial advantage using natural language processing on voluminous data to understand consumer behaviour and embedded use in their online services.\nNowadays, robotic devices work alongside humans in manufacturing and services. Driverless cars are being tested as we speak, and smart algorithms are working in the background to offer suggestions to internet users for products and services through the use of vast consumer data being captured.\nThe European Union’s ambition is “to become the world-leading region for developing and deploying cutting-edge, ethical and secure AI, promoting a human-centric approach in the global context”. To this end, a coordinated plan on AI has been drawn up to maximise the impact of investments at EU and national levels, encourage synergies and cooperation across the EU, have a common approach on ethics, foster the exchange of best practices and collectively define the way forward.\nIt is therefore important that the European Commission keeps a close watch on Member States’ developments on AI. Terming this ‘AI Watch’ and led by the Commission, this initiative will provide strategic guidance for national strategies in a coordinated European fashion.\nThe foreseen AI Watch tasks include:\n• the development of an AI ecosystem;\n• the benchmarking of capabilities and performance of AI-based systems;\n• the monitoring in the uptake of AI applications across the economy;\n• the development of a precise estimate on the evolution of the European market shares in robotics;\n• to monitor the impact on the workforce;\n• the gathering of information on Member States’ national initiatives on AI;\n• the analysis on the use and impact of AI in public services;\n• the development of a set of structured AI indicators, and\n• the setting up of an online portal for the dissemination of all the information for timely use by Member States.\nAdditionally, the EU has proposed the setting up of national or regional innovation hubs to build up national capabilities in AI and share information. To complement national investments by the Member States, these hubs will be instrumental to acquire EU funding on AI. Various workgroup meetings, led by the Commission, have already started between the Commission and the Member States. The eSkills Malta Foundation is one of the Malta representatives.\nOn the local scene, yet again, Malta’s commitment into the digital world of AI was already shown by setting up the ‘Malta.AI’, which launched a high-level policy document for public consultation in March 2019. The main areas of focus include investment, start-ups, and innovation, public and private sector adoption, education and workforce, legal and ethical frameworks, and the AI ecosystem infrastructure.\nMalta.AI has set up various national workgroups to come up with feedback on these areas which will eventually feed into a national AI strategy. The EU is very conscious of this effort and is following our work closely. Only a few countries have really tackled the launch of an AI strategy, and yet again Malta will be in the leading pack.\nThe national AI strategy will be in sync with other existing strategies and initiatives, such as the national eSkills strategy and Distributed Ledger Technology (DLT) regulation. It is also a fact that the national ICT industry has started transforming their products for AI, and some firms are also working hard to launch products.\nAI introduces opportunities in almost all areas, including healthcare, mobility, fintech, advanced manufacturing, smart power systems, bio-economy, media and crime detection. In the past, we have been speaking about the subject of digital transformation and this is part of it. The truth is that when technologies develop they are bound to replace older technologies or integrate with existing ones, disrupting industry, education and society. It is therefore crucial that we prepare for this.\nCarm Cachia is chief administrator, eSkills Malta Foundation.", "comment_count": 0, "id": 970}, {"keywords": "Gozo", "author": "", "article_body": "The Augustinian Sisters celebrated their 125th anniversary of their presence in Malta with a pilgrimage to Ta’ Pinu Sanctuary. Gozo Bishop Mario Grech celebrated evening Mass animated by the sisters. During his first weekly homily, in preparation for the feast of the Assumption, Mgr Grech encouraged those present, including couples, families and religious, to take their interior life seriously just as Our Lady did.\nOn behalf of the Augustinian community, Għajnsielem Superior Sister Margaret Vassallo presented Mgr Grech with a picture of their foundress, while Mgr Grech presented Mother Provincial Rachel Ann Frendo with a picture of Our Lady of Ta’ Pinu.\nIn the morning, the sisters visited Tal-Mixta limestone cave, from where they enjoyed the coastal views of Ramla l-Ħamra, followed by lunch.", "comment_count": 0, "id": 971}, {"keywords": "Education", "author": "", "article_body": "The Institute of Tourism Studies (ITS) is launching its first-ever master’s degree programme as from the 2019-20 academic year. The programme is recognised by the National Commission for Further and Higher Education (NCFHE). Applications open on July 22 and close on August 9.\nThe ITS recently signed an agreement with the Emirates Academy of Hospitality Management (EAHM) to assist the ITS in the introduction of an MBA master degree programme and provide quality assurance to other ITS study programmes.\nThe agreement will also enable the ITS to train up to 15 lecturers in facilitating interactive and problem-based teaching and learning and providing effective classroom management skills.\nThe long-term vision of the ITS is to develop into a world-class international Hospitality and Tourism Educational Institute in the Mediterranean.\nThe ITS prospectus may be found at the website below.\nwww.its.edu.mt", "comment_count": 0, "id": 972}, {"keywords": "", "author": "", "article_body": "A man and a woman were injured in separate traffic accidents on Saturday.\nIn the first accident, a 71-year-old Japanese woman was grievously injured when she was hit by a Smart that was being driven by a 27-year-old woman from Fgura in Triq Manuel Dimech, Sliema at 2pm.\nThe victim was taken to Mater Dei Hospital by ambulance.\nIn the other accident, a man, who is likely a foreigner but has not yet been identified, was seriously injured when he was hit by a Chevrolet Kalos in December 13 Road, Marsa at 5.30pm\nThe car was being driven by a 38-year-old man from Valletta. \nThe victim was assisted by a medical team on site and then transferred to Mater Dei Hospital by ambulance\nThe police are investigating both accidents.", "comment_count": 0, "id": 973}, {"keywords": "", "author": "", "article_body": "Updated 9.50pm, adds David Casa's reaction\nNationalist MEPs voted for tax harmonisation against Malta’s interests, Prime Minister Joseph Muscat said on Saturday.\nAddressing an activity in Gozo, Dr Muscat reiterated the claims made earlier by Labour MEP Miriam Dalli, which claims were later denied by the Nationalist MEPs.\n\nIn a post on Facebook following Dr Dalli’s press conference, Nationalist MEP David Casa said Nationalist MPs voted against this matter, which only the Labour Party agreed with. The PL, he pointed out, supported socialist candidate Frans Timmermans who had come up with this idea.\n\nLabour, however, replied that while the PN MEPS had voted against certain amendments, they voted in favour of others, including moving from unanimous approval to approval by a qualified majority, where the vote of bigger countries was worth more than that of smaller ones.\nDr Muscat said that while frightening people that foreigners could tell Malta what to do about taxes, the Nationalist MEPs voted against Malta retaining its veto on such matters\nHe said that the taxation system the Nationalist MEPs  voted agains had been inherited from a Nationalist government and was in conformity with EU regulations. The Prime Minister promised that it would continue to find the government’s support.\nEuropean Socialists, he said, knew that the Malta’s Labour Party did not agree with its position.\nHe said he was giving the Nationalist MEPs a chance to correct their vote, adding that the Maltese and other governments would never give up their right to veto such matters. \nDr Muscat encouraged his listeners to vote for Labour candidates in the forthcoming MEP and local elections.\nIn comments to Times of Malta, Mr Casa insisted the Labour Party was lying when it said that Nationalist MEPs had voted against Malta’s taxation system.\n\"The PN introduced Malta’s taxation system, has defended it within the European Union for last 15 years and will always continue to do so.\"\nMr Casa said the Labour Party was shunned in the EU because it had to spend the last five years defending corrupt politicians to the detriment of the Maltese.\nAnd just weeks ago Dr Muscat was in Madrid to endorse a manifesto that clearly set out the European Socialist Party’s agenda for the next five years – tax harmonisation. \nBlatant lies about PN MEPs’ position on taxation issues were a pathetic attempt to draw attention away from the party's astounding ineptitude at EU level. \nNot only had PN MEPs always voted to defend Malta’s tax system, they also campaigned strongly and consistently in favour of Malta’s position on taxation.\n ", "comment_count": 63, "id": 974}, {"keywords": "", "author": "", "article_body": "Tourism Minister Konrad Mizzi and the rest of the “Panama Papers gang” must step down after finally accepting they would be subject to a criminal investigation, former Opposition leader Simon Busuttil said.\nReacting to news that Dr Mizzi would not be appealing a court decision to include him in a Panama Papers inquiry, Dr Busuttil said those involved should resign until the investigation is over. If they remained in office, it would put unnecessary pressure on investigators, he said.\nFormer Opposition leader Simon Busuttil.\nA court last month ruled that evidence of a crime could exist in the Panama Papers. It said the evidence presented by Dr Busuttil and NGO Repubblika gave credence to the request for an inquiry to preserve evidence. Facts were submitted in court which could indicate a crime took place, Magistrate Doreen Clarke found.\nNoting that the list of potential crimes presented to it were not fully covered by another inquiry conducted by a different magistrate, the court ordered that the evidence produced should form part of this other inquiry, which is looking into the ownership of the Dubai company 17 Black.\nDr Mizzi told The Malta Independent earlier this week the decision not to appeal the inquiry decree was taken after a careful review of the decree. This simply referred the matter to another inquiry, he was quoted saying.\nQuestions sent to the Tourism Minister by Times of Malta on Wednesday about the matter were not answered.\nAlthough not appealing the decree, Dr Mizzi has argued before the Constitutional Court that any such inquiry breaches his right to a fair hearing. This was the second time he made such a submission. He had dropped the first claim after a request made in 2017 for an inquiry was successfully blocked by an appeal.", "comment_count": 94, "id": 975}, {"keywords": "", "author": "Claire Caruana", "article_body": "Parents whose children were still being denied free school transport would not get any compensation, Education Minister Evarist Bartolo said.\nThe government launched the scheme in September last year, providing parents of children attending State, Church and independent schools free transport. \nHundreds of students were placed on a waiting list as the number of available vehicles was not enough to meet the demand. \nAlthough the scholastic year ends in a few weeks’ time, about 170 students remain on the list.\nAsked about this and whether the government would be offering some form of compensation to parents who had to pay for the transport themselves, Mr Bartolo said no such plans were in the pipeline.\n“We are not considering that for the moment. Our commitment is to provide publicly-funded transport,” he said.\nParents whose children are still on the waiting list and who spoke to Times of Malta on condition of anonymity, said they believed they had a right to some form of compensation since they had wanted to sign up for the scheme but could not.\nThey insisted that, by not being compensated, they were being discriminated against since other parents were saving money while they were still funding their children’s school transport.\nAbout 170 students remain on the waiting list\n“Parents who could not find free school transport, which was promised by the government, rightly deserve to be compensated for the time and the resources employed in driving children to and from school throughout this school year,” one parent insisted.\nFielding questions by the press after announcing that the free transport scheme would continued in the next scholastic year, Mr Bartolo said the government would be “doing all it can to provide” the service for all parents.\nOn the devices that were expected to be attached to students’ backpacks to let parents know their children had arrived safely, commonly referred to as FOBs, the minister said the scheme was still being tested with a pilot project now expected to be extended.\nThe permanent secretary at the Education Ministry, Frank Fabri urged parents to think ahead, insisting they apply as soon as application forms were available in the coming days.\nHe clarified that while in the case of State schools the government served as both the operator and regulator it could only ensure operators servicing Church and independent schools were following the rules.\n ", "comment_count": 25, "id": 976}, {"keywords": "", "author": "", "article_body": "The Commissioner for Environment and Planning within the Office of the Ombudsman ruled that a Planning Authority’s circular relating to irregular developments is “unfair, irregular and against the principles of natural justice”.\nThe issue had been raised by the Kamra tal-Periti, which felt that this had serious implications for those property-owners who had minor irregularities.\nIn a statement, the Kamra tal-Periti said that while it did not condone illegal development, certain rights had been granted to property owners in the past and these could not be taken away at a later date.\nCategory B concessions (CTB) came into force in August 2012, enabling residential property owners to submit an application to the Planning Authority to cover illegal development that fell within specific strict parameters.\nIf approved, the applicant would then be allowed to request permission for alterations and additions to the property, and a compliance certificate for the provision of new water and electrical services to the dwelling could be issued. \nThe CTB regulations restored the affected properties’ market value to levels comparable to legal properties of a similar description. As a result, these properties became sellable again, and banks were reassured that the effects of the concession were permanent.\nWith the coming into force of the Development Planning Act in 2016, the CTB regulations were repealed and no further applications could be submitted. In August 2016, new regulations were published that allowed for the regularisation of various types of illegalities, with no specific parameters, as long as these were not deemed to be an “injury to amenity”.\nBanks reassured that the effects of the concession were permanent\nHowever, the Kamra tal-Periti was concerned by reports from its members that the Planning Authority was requiring holders of CTB concessions to regularise their property at a much heftier fee than what they had originally paid for the concession.\nIn January 2019, the Planning Authority published a circular saying applications for sites covered by a CTB concession could only be made once the irregularity was either sanctioned or removed.\n“If the illegal development cannot be sanctioned, a regularisation application would need to have been submitted and approved prior to the planning application being confirmed as complete,” the circular read. \nThe Kamra tal-Periti requested the Ombudsman’s office to investigate this matter in March 2019, explaining that holders of CTB concessions for minor irregularities could be facing serious risks on their investment unless the Planning Authority changed its interpretation of the law.\nIn a decision delivered on May 7, the Ombudsman’s Office recommended that the Planning Authority should “withdraw and cancel this part of the circular”. \nThis would allow new applications to be submitted on a site covered by a CTB concession without the need for sanctioning, regularising or removing the illegal works covered by the same CTB concession, as long as no further illegal development has taken place on site.", "comment_count": 2, "id": 977}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Tourism Minister Konrad Mizzi has asked for more time to refer to documents and give a breakdown of his trips abroad since 2013.\nReplying to a request made by Times of Malta at the beginning of April under the Freedom of Information Act, a spokesman said more time was needed. “Your request has been extended by 20 days, to June 5, due to the fact that the request is for a large number of documents or necessitates a search through a large number of documents,” the spokesman said, invoking provisions of the law.\nInformation related to his journeys abroad has also been sought through parliamentary questions, dating back to 2014. Whenever he was asked for a breakdown of his missions abroad, Dr Mizzi usually gives a stock reply: “the information is still being compiled”.\nOther Cabinet ministers, including the Prime Minister, regularly publish information on their visits overseas.\nTimes of Malta last month sent requests seeking similar information from the ministries for which Dr Mizzi was politically responsibility since he was first appointed in 2013.\nThe request was also channelled through the Office of the Prime Minster but Principal Permanent Secretary Mario Cutajar said the information had to come from Dr Mizzi’s ministry.\n“Documents pertaining to the relative sector have been transferred from the Office of the Prime Minister to the pertinent ministry following the formation of Cabinet and the new portfolios in 2017,” the head of the civil service said.\nThe Health Ministry, now headed by Chris Fearne, however did say that during the short stint there, Dr Mizzi had travelled once to Algiers.\nDr Mizzi had been appointed minister for energy and water conservation in 2013 and was also assigned the health portfolio a year later, following the resignation of Godfrey Farrugia. \nHowever, he was stripped of both portfolios in the wake of the Panama Papers, which indicated he had a trust in New Zealand and a company in Panama. It had also emerged that the Prime Minister’s chief of staff, Keith Schembri, had made similar arrangements.\nResponding to public dissent over the issue, including internally, Prime Minister Joseph Muscat accepted Konrad Mizzi’s resignation from his newly-elected role as deputy leader of the Labour Party, but still kept him in his cabinet, although without a portfolio.\nDr Mizzi was appointed minister within the office of the Prime Minister and then named Tourism Minister in 2017.", "comment_count": 98, "id": 978}, {"keywords": "", "author": "Jacob Borg", "article_body": "A home intruder who attacked a St Paul’s Bay resident, causing him serious head injuries, was trying to save his girlfriend, a court heard on Saturday.\nLuke Farrugia, 24, from Żabbar, was on Saturday charged with grievously injuring the man and stealing electronics from his home.\nDefence lawyer Roberto Montalto said in court it was apparent from his client’s statement to the police that he was, in fact, trying to save his girlfriend, who he found in a bad way inside the St Paul’s Bay flat.\nHe said the girlfriend’s own statement to the police more or less matched this version of events.\nIn arguing for bail, Dr Montalto said it would appear that there was some sort of drug activity going on inside the residence.\nThe man who had suffered the head injuries, he said, would probably not want to testify, so it would be unfair keeping his client in jail for a month.\nProsecuting officer Clayton Camilleri told the court that the victim had suffered a brain haemorrhage and was still being kept in an induced coma.\nThe police inspector expressed his fear that Mr Farrugia would try and approach witnesses if released on bail.\nHe said the accused had kept on insisting he wanted to speak to his girlfriend on the way to the courtroom.\nPolice were still looking for the driver of the vehicle used to flee the scene, the inspector continued, and other witnesses were being questioned.\nMagistrate Simone Grech denied bail.", "comment_count": 0, "id": 979}, {"keywords": "", "author": "", "article_body": "A man and a woman were arrested by the police on Friday after they were found in possession of drugs in amounts indicating they were not for personal use.\nThe police said the arrests were carried out by the Drug Squad following investigations in Malta and Gozo.\nThe woman, who is 43 and lives in Valletta, was arrested in Ħamrun after she was found in possession of cocaine and cannabis.\nThe man, who is 29 and lives in Xagħra, was arrested in Mġarr, Gozo, after he was found in possession of cocaine ready for trafficking.\nBoth are expected to be arraigned, separately, in the coming days.\nPolice investigations are continuing.\nPhoto: Malta Police Force", "comment_count": 3, "id": 980}, {"keywords": "", "author": "", "article_body": "The only solution to address the plights of refugees is for the EU to consolidate its migration and foreign policy, especially with Libya, the Democratic Party said on Saturday.\nThe EU must prioritise Libya, as it did in Somalia with success, by addressing good governance, poverty and piracy comprehensively, PD general secretary and MEP candidate Colonel Martin Cauchi Inglott said in a statement. \nHis statement comes in the aftermath of another migrant tragedy - 65 are believed to have drowned between Tunisia and Malta on Friday while another 85 were rescued by the AFM in a separate incident.\nRead: Dozens of migrants dead between Malta and Tunisia\n\"This implies that the EU continues to fail on its migration and asylum policy for the 17th consecutive year,\" Col Cauchi Inglott said.\n“While member states discuss ad hoc solutions in Brussels, citizens are beginning to realise that the EU is only capable of providing short terms solutions, until the summer is over, and then it is back to square one following May.\"\nPD leader Godfrey Farrugia said member states should forget about their egoistic interests in Libya, and indeed Europe, and seek long-term solutions.\n“The longer the EU procrastinates, the stronger we can expect the far right to grow as the forthcoming European Parliament elections will show.”\nPD MP Marlene Farrugia said blocking migrants in the desert or at sea is too late because it is both inhumane and dangerous.\n“The problems need to be addressed by the EU in sub-Saharan Africa, but until then, the EU must treat Libya as an equal partner in the game, so migrants do not need to cross the perilous Mediterranean to apply for asylum.”", "comment_count": 0, "id": 981}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Hana went to a Qawra hairdresser to get her hair done but instead got sent back to her country.\nAs she sat in the chair for an appointment set the week before, her hair wet waiting for a blow-dry, a woman walked in and told the hairdresser she needed to be slotted in quickly as she had a wedding that evening. Dursa: “I have a few seconds to qualify for the national team... next year, I want to be on it.” Photos: Aditus\nThe hairdresser told Hana that the woman had an appointment before her but arrived late as she was stuck in traffic. \n“I told them that I had understood what had been discussed and repeated every word to them back in English. At that point, the hairdresser started yelling at me, using vulgar language. \n“Two other women looked down when I corrected the hairdresser and one of them advised me to leave. The hairdresser continued yelling at me and said that I am African and that I should go back to my country.”\nHana’s is one of 12 accounts in a new publication by Aditus Foundation called Our Island II. Funded by the President’s Award for Creativity (Arts Council Malta), it is Aditus’s second publication to document refugees’ Malta experiences. Both books are available from the Aditus office against a small donation.\nWhile Our Island featured personal stories from people offering protection, the second book presents stories about living in Malta as a refugee.\n“We wanted to avoid asking refugees to repeat, for the umpteenth time, why they left home and about the voyage,” Aditus director Neil Falzon said.\n“It is a book about integration and the paths that people follow – voluntarily or otherwise – as they slowly make Malta home, their island.”\nThe contributions are quite different from each other – each and every refugee has an individual personal story in the same way that each and every one of us has an individual life, history and future, Dr Falzon told the Times of Malta. \nIn the introduction to the book, he notes that as refugees try to normalise their lives in Malta they try to behave in a way that does not merely meet social standards, but quite often surpasses such standards. \nHairdresser started yelling at me, using vulgar language\nColourfully described, there is a feeling that migrants’ only path to acceptance, integration and respect is by being cleaner, more obedient, more hard-working and punctual, learn more languages, do more voluntary work, get higher grades and, generally, be true heroes in everything.\nIn this book, however, they are not being presented as superheroes or even  model citizens.\nAdil, arrived in 2008\n“I met an old man, who asked me if I had been born and raised in Birkirkara because I said I felt I was a Karkariż. He told me that he couldn’t understand why I said that because I was black. I did not hold it against him, though. I understood that he just didn’t know better. To me, it was just a funny situation.”\nFarah, arrived as a minor\nI could not recall doing anything to anger the client. I had only just met him. My colleague pulled me to one side. “Farah, I need to speak to you,” he said in a regretful tone. He barely gave me eye contact as he spoke to me. “I’m sorry, but the client does not want a man of colour in his house.”\nMary, arrived in 2000\nI will have a good future. This house is mine. I bought it because both of us have a good job, we went to the bank and got a loan.\nGrowing old in Malta? Yes!\nRacism? No, I’ve never had any problem with racism, because there is a zero tolerance at the hospital.\nMaybe because I am assertive or so? Because if you try it, I am going to put you down and tell you: “Listen, I am working and paying taxes.”", "comment_count": 0, "id": 982}, {"keywords": "", "author": "", "article_body": "The designs for a new €170 million Outpatients block at Mater Dei Hospital have been presented to the Planning Authority. \nThe project, which will be completed within four years, will be built over an area of 16,550 square metres, including a 661-vehicle car park. \nA floor of the building will host the bus terminus to try to reduce traffic congestion right by the entrance of Mater Dei. \nThe building will offer medical consultancy rooms while it will integrate related clinical services which are currently not being hosted in the current Outpatients building. ", "comment_count": 18, "id": 983}, {"keywords": "", "author": "", "article_body": "Eight NGOs have requested the postponement of the controversial db Group project in Pembroke after an undeclared underground Cold War bunker which housed a sub-station in the 1950s, and an engine room dating from the 1930s were revealed underneath St George's Barracks.\nThe NGOs requested the Superintendent of Cultural Heritage to issue an Emergency Conservation Order on the heritage features on site and to carry out a proper assessment to save what can still be saved.\n\"This smacks of a shoddy and negligent approach where all is fast-tracked and heritage is ignored so that it can easily be destroyed,\" the organisations said in a statement. This smacks of a shoddy and negligent approach where all is fast-tracked and heritage is ignored\nFollowing the Planning Authority's approval of the db Group project last year, three local councils, several NGOs and residents came together to appeal the decision.\nThe NGOs said the features are of considerable significance from an industrial heritage as well as military point of view, however they have not received any mention in the heritage assessment reports commissioned by the developer.\nBoth features would be totally obliterated if the project is allowed to go ahead, along with the earliest example of British period barrack blocks in Malta.\nThe NGOs said: \"We cannot understand how such features have failed to show up on any of the studies presented to the public and supposedly scrutinised by the Planning Authority. It shows that the public has no one to turn to for effective assessment of applications.\"\nThe eight organisations are Din l-Art Ħelwa, Ramblers' Association of Malta, BirdLife Malta, Friends of the Earth Malta, Moviment Graffitti, Flimkien għal Ambjent Aħjar, Bicycle Advocacy Group and Żminijietna – Voice of the Left.\nThe sub-station.", "comment_count": 50, "id": 984}, {"keywords": "", "author": "", "article_body": "A widow and her five children who lost their father in a horrific workplace accident in 2015, were awarded €60,000 in damages payable by the owner of the stone quarry where he died.\nThe Falzon family filed civil proceedings against Tlata Ltd, which operated a quarry in the limits of Rabat. The victim had been employed as truck and heavy machinery driver.\nThe 53-year-old labourer, a seasoned construction worker, had been operating an excavator in a laborious rinsing process whereby sand was lifted out of a large reservoir, containing a mixture of water, mud and sludge, and transported onto trucks to dry before being delivered to construction sites.\nOne of the man’s sons, testified that his father was an experienced worker who could handle the task that required “patience and care”.\nOn that fateful day, the weather had been fine, but it had rained heavily the night before, probably causing the wet sand to give way beneath the excavator which toppled over, with the trapped driver ending in the water and drowning.\nAn Occupational Health and Safety Officer, investigating the accident, testified over a number of shortcomings at the quarry, which meant that there was “no safe system of work”.\nThe court, presided over by Mr Justice Lawrence Mintoff, observed that “it would have cost nothing in terms of money” to use stone from the quarry to build a barrier which would have prevented the accident.\nSince necessary safeguards had not been adopted, the court held the respondent solely responsible for the accident and ordered it to pay €60,000 by way of compensation to the victim’s family.", "comment_count": 0, "id": 985}, {"keywords": "", "author": "", "article_body": "A group of 85 migrants was saved off Malta after their boat was reported to be in distress.\nThe Armed Forces of Malta said its rescue vessel was dispatched to a location where the wooden boat was reported to be in trouble. \nThe migrants - 77 men, seven women and a child - were transferred to the AFM vessel and landed in Malta early on Saturday.\nThe rescue comes just hours after dozens died between Tunisia and Malta after their boat capsized.\nRead: Dozens of migrants dead between Malta and Tunisia", "comment_count": 0, "id": 986}, {"keywords": "", "author": "", "article_body": "The government should seek to establish a new permanent rent regime applicable for all rented property to be introduced in stages during a reasonable transitional period, the Malta Developers' Association said. \nIt was referring to this week's landmark Constitutional Court decision, whereby the current legal regime regulating rents of properties leased before June 1995 was declared as breaching landlords’ fundamental rights. \nRead: Landmark judgement opens pre-1995 leases to scrutiny\nCurrently, owners of property that was rented out prior to June 1, 1995, had no right to refuse renewal of the lease and had to make do with a ‘fair rent’, despite soaring market values.\nThe court ruled that this regime created an unjust imbalance between the rights of the owners and those of the tenants, with the former having to shoulder, for years on end, the social burden induced by the current legislation.\nThis means that various areas of rent control legislation have been found to breach the fundamental rights of citizens to enjoy their property. At the same time, the government is considering the reaction to the recently issued White Paper on rent reform.\nIn a statement on Saturday, the MDA said it believed that the whole issue of rent reform should be tackled comprehensively so that a balance is found between the rights of landlords and the protection of tenants.\nAttempts at piecemeal solutions have led to more legal complications than solving problems.\nMDA appealed to all property owners to continue to join and insisted that it will be at the \"forefront\" to address these injustices.", "comment_count": 37, "id": 987}, {"keywords": "", "author": "Keith Micallef", "article_body": "A long-awaited policy regulating timed parking schemes manned by local councils seems to have been lost in oblivion, as not even the Transport Minister himself was able to say when it would be seeing the light of day. \nAnnounced six years ago, the policy was supposed to be based on the findings of a nationwide study which was meant to gauge the success or not of such schemes. This exercise was meant to find a compromise between resident schemes and the needs of the business community. \nThe review had been announced in the midst of a controversy involving the Sliema council, which had rolled out a residents’ parking scheme on a trial basis. However, this experiment was short lived as it was lifted, through the direct intervention of Cabinet. \nRead: Sliema parking scheme has spent six years in limbo\nThe move came in the wake of an hour-long strike by teachers in five Sliema schools in protest against what they had deemed as a draconian scheme.\nDespite, repeated calls by the Sliema council for the government to roll out this policy or give a definite reply on the matter, there were no developments. \nLast March, the matter was raised in Parliament by Opposition MP Karol Aquilina, only for Transport Minister Ian Borg to say that the study launched in 2013 was still under way. \nTimes of Malta raised the matter at a news conference Dr Borg addressed about roadworks in Sliema. \nAsked if this saga was coming to a close, the Transport Minister replied there were “no developments” to report. \nAsked why the government had only halted the resident scheme in Sliema, Dr Borg insisted that all pending parking scheme requests had been put on hold, while those which had been already in place were still in force. \nWhen it was pointed out that such matter was of great interest as it affected thousands of residents not only in Sliema, but in the rest of the country, the minister insisted he had no other details to give.\n“If you send questions I can follow up the matter, with the respective authorities,” he said.", "comment_count": 14, "id": 988}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports President George Vella calling for greaterrespect for construction workers and those who work in harsh conditions, saying some were working in “pitiful” situations. It also reports the government plansto effectively double the area of the Ta’ Qali National Park, with an additional 200,000 square metres of land turned into open spaces.\nL-orizzont also reports the proposal to create Malta's biggest open space at Ta' Qali. Amid the Tripoli unrest, the newspaper also reports that Palm City will remain open.\nThe Malta Independent says balloon releases and plastic confetti during public events will be banned as part of a new environmental strategy.\nIn-Nazzjon reports the initiative for a European master plan to fight cancer. Another story says the majority of Labour MEP candidates were concealing the fact that they backed the European Socialists pro-abortion manifesto. \n \n ", "comment_count": 1, "id": 989}, {"keywords": "", "author": "Denise Grech ", "article_body": "President George Vella called for greater respect for construction workers and those who work in harsh conditions on Friday, saying some were working in “pitiful” situations.\nOpposition leader Adrian Delia echoed the calls for better working conditions, saying that workers were being sacrificed at the altar of competitiveness between companies. \nThe two leaders were speaking at a conference on the future of work, organised to mark 100 years since the International Labour Organisation was founded.\nThe President insisted workers’ health could not be compromised for the interests of those who employ them.\nThe humanity of workers needed to remain a focal point, Dr Vella noted, adding that Malta’s biggest resource was its workers.\nWorkers used to previously be considered as a “machine”, leading to unrealistic expectations of production – and shifts that did not take into account people’s natural biological clock, he said. \nThe results, Dr Vella said, were obvious. The situation led to less efficiency, people lying about taking sick leave and tense industrial relations, he added.\nEchoing similar concerns, Dr Delia said authorities needed to ensure workplaces were more adequate.\nThe country has to prepare itself for the rapid changes in the workforce, Dr Delia said. Various sectors, including the infrastructural and educational sectors, needed to ensure they were ready for change, Dr Delia said.\nWorkplaces could soon come to an end, he warned, as more people chose to work from home. There will no longer be the physical environment at work that people were accustomed to, the Opposition leader noted.  \n“It’s time to start thinking about a change in mentality – where education is the same everywhere,” Dr Delia said. \nBy the time many finished studying, what they had learnt would have become obsolete. \nTurning to pensions, the Opposition leader said the country had a crisis that no one wanted to face. This was not a problem that was caused by one government but by successive administrations, he said. Dr Delia called for pensions to be sustainable in the long-term.\nGrowth brought loopholes to light - Muscat\nPrime Minister Joseph Muscat said only a few employers were breaching regulations. Economic growth had brought to light loopholes in EU directives that Malta had transposed years, he said.\nSome employers were trying to circumvent regulations to try and take advantage of both Maltese and foreign workers, he said, adding this was creating an imbalance in the workforce.\nHe also said seven out of 10 people on the benefit tapering scheme continued to work even when they stopped receiving benefits. Admitting he had had apprehensions about the scheme, Dr Muscat said he was ultimately happy the government had taken the step.\nThe benefit tapering scheme provides support to people who have been receiving un-employment assistance, social assistance or single parent benefits, helping them to enter the employment market.\nDr Muscat said that the gender pay gap was worsened by women entering the workforce. \n“I prefer this problem to not having women working,” he said, adding that the kind of work women did would now need to be taken into account.", "comment_count": 7, "id": 990}, {"keywords": "", "author": "", "article_body": "The EU needed a master plan in order to combat cancer, the Nationalist Party proposed on Friday.\nOpposition leader Adrian Delia said on Friday night that the party was already working on this proposal was the EPP candidate for European Commission president, Manfred Weber.\n“If there is one enemy that we can beat, it is cancer. Together we can do it,” he said.\nAround 2,000 people every year in Malta are diagnosed with cancer, with one in every four dying of the disease.\nHe pointed the finger of blame at poor air quality, saying that 10 people a week in Malta died prematurely as a result.\nDr Delia’s proposals are for increasing screening for more types of cancer, as well as prevention. Apart from more EU funds, he said that patients and relatives required support.\nHe was speaking at a party activity in Żurrieq.", "comment_count": 13, "id": 991}, {"keywords": "", "author": "", "article_body": "A 35-year-old man from Għarb was flung to the ground after he lost control of the motorcycle he was driving.\nThe police said that no other vehicles were involved in the accident, which occurred at 5pm on Triq Ta’ Bur il-Kbir, in Siġġiewi.\nThe man was hospitalised and his injuries were later confirmed as being serious.\n ", "comment_count": 0, "id": 992}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A betting company employee who admitted to having misappropriated over €5,000 worth of betting slips was handed a suspended sentence after admitting to the charges on Friday afternoon.\nLuca Celotto, 21, from Sanremo, Italy was charged with misappropriation and fraud after helping himself to the betting tickets and tampering with reconciliations to cover up his tracks.\nProsecuting Inspector Roderick Agius explained how later checks by the company, backed up by an internal investigation which had found incriminating CCTV, had pointed at the accused as the suspect.\nThe man admitted to his wrongdoing upon arraignment, his legal aid lawyer pointing out that the man had cooperated fully with investigators and had undertaken to reimburse his former employer the full sum of €5,112.\nIn fact, he had already paid €300 and his father would settle the remaining balance, the lawyer explained, while her client wept at the dock.\nUpon the accused’s own admission, the court, presided over by magistrate Charmaine Galea, declared him guilty and condemned him to a 20-month jail term suspended for two years, ordering him to refund the money within 48 hours.", "comment_count": 0, "id": 993}, {"keywords": "", "author": "Jacob Borg", "article_body": "A judge ruled that the financial arbiter was correct in awarding compensation to an illiterate elderly housewife who was sold a complex financial product by an investments company.\nMr Justice Anthony Ellul ruled it was obvious the product sold to the woman was not a suitable one, notwithstanding representations made by former Crystal Finance owner and former Central Bank deputy governor Alfred Mifsud and investment adviser Michelle Stanmore.\nOwnership of the company has since changed hands.\nThe financial arbiter awarded Rita Sciberras €3,700 in damages in December 2017. Crystal Finance appealed the decision, arguing the arbiter had no jurisdiction over the dispute and the conclusions reached were not based on fact.\nThe arbiter had been told that Ms Sciberras entered into what she thought would be a two-year investment in 2015. She said her adviser at Crystal Finance had asked her to sign the investment documents without first explaining or reading them out to her, the judge was told. A year later, Crystal Finance informed her she would not be able to access her capital until 2026.\nThe adviser should have known the product in question was not suitable\nThe arbiter found the client had not received proper advice from Crystal Finance as the complex product she was sold did not match her customer profile. The bond in question was found to be a high-risk one of a speculative grade.\nAccording to the arbiter, Ms Sciberras put all her trust in the financial advice given to her by Crystal Finance. The adviser should have known the product in question was not suitable for his client, the arbiter commented.\nThe court agreed, saying it was clear Crystal Finance had not carried out an adequate suitability test.\nIn examining the company’s claim that the arbiter had no jurisdiction over the complaint, Mr Justice Ellul noted that past case law involving the firm had already ruled on that point. \nThe court noted that Crystal Finance had even informed Ms Sciberras she could take her complaint to the arbiter when the dispute between the two parties arose.\nIn January, the arbiter awarded five investors €31,000 in compensation after losing money they invested with Crystal Finance.", "comment_count": 0, "id": 994}, {"keywords": "", "author": "Denise Grech ", "article_body": "Workers were being sacrificed at the altar of competitiveness, with companies seeking to one-up each other to the detriment of their employees, Opposition leader Adrian Delia said. \nSpeaking at a conference on the Future of Work, Dr Delia said the country needed to prepare for changes in employment.\nHe warned workplaces could soon come to an end, as more people choose to work from home. There will no longer be the physical environment at work that people were accustomed to, the Opposition leader said.\nThis had some advantages since it would lead to less traffic and less emissions, Dr Delia said. However, the Opposition leader warned, it was important to think about the decline in human interaction. \nDr Delia reiterated his calls for the government to prepare for foreigners, saying climate change was bringing about migration from some countries. \nWe need to look at the responsibility of climate change, he said.\nPensions 'crisis'\nTurning to pensions, the Opposition leader said we had a crisis and no one wanted to admit it. This was a problem that came following successive administrations. We need to ensure that pensions are sustainable in the long-term.\n\"It’s time to start thinking about a change in mentality - where education is the same everywhere,\" Dr Delia said, adding that by the time many finished studying, what they had learned would have become obsolete.", "comment_count": 8, "id": 995}, {"keywords": "", "author": "", "article_body": "The Broadcasting Authority has fined television station F-Living after far-right MEP candidate Norman Lowell made disgraceful comments about disabled children. \nMr Lowell, a 73-year-old Nazi sympathiser, will be running for MEP in the 2019 elections for the third time. In its decision, the BA referred to the comment made during a television programme on April 5.\nThe decision comes a day after the Commission for the Rights of People with a Disability filed a report to the police over Mr Lowell’s comments promoting eugenics during the TV interview on F-Living.\nDuring the Nazi era in Germany, eugenics prompted the sterilisation of several hundred thousand people then helped lead to anti-Semitic programmes of euthanasia.\nMr Lowell was reported to have said on TV that horribly mentally defective babies should be aborted or granted a benign mercy killing.\nDuring the interview, just weeks ahead of the European Parliament elections, he asked whether anyone enjoyed going to a village which was full of \"village idiots\" and whether anyone wanted \"handicapped people\".\nThe Broadcasting Authority said Mr Lowell had passed offensive remarks during the programme during which he also incited hatred based on race, religion or nationality.\nHe also passed comments about the African race by saying that their IQ was lower than that of Europeans.\nF-Living CEO Karl Bonaci said his station was giving space to MEP candidates and that it respected freedom of expression of the people who appear on its programmes.\nThe BA said that while it respected the principle of freedom of expression, this was not absolute and that it was the station responsibility to ensure that people’s rights were protected from such comments.\nThe watchdog said the comments, especially those about disabled children, were “in poor taste”, fining the station €1,160 in the process.\nMr Lowell, who once said migrants should be gunned down at sea, was handed down a two-year jail term suspended for four years in 2008 after he was found guilty of inciting racial hatred and insulting the President of Malta.\nHe recently sparked more controversy after he compared the World War Two concentration camp Auschwitz to the \"Disneyland of Poland\".", "comment_count": 0, "id": 996}, {"keywords": "", "author": "Denise Grech ", "article_body": "A substantial amount of money spent by authorities investigating workers’ rights’ breaches was being spent on only a few employers, Prime Minister Joseph Muscat said.\nEconomic growth had emphasized the loopholes in EU directives that Malta had transposed years before, Dr Muscat said. For instance, third-country companies were employing third-country nationals in an EU country, he said.\nSome employers were trying to circumvent regulations to try and take advantage of both Maltese and foreign workers, he said, adding this was creating an imbalance in the workforce.\n\"This is our challenge: to ensure everyone is treated equally and strengthen enforcement so that no one will be put in conditions inferior to those we have regulated,” he said.\nThe prime minister was speaking at a conference on the future of work, during which a number of stakeholders, including the Department of Industrial and Employment Relations and trade unionists were present.\nSeven of 10 people on the benefit tapering scheme continued to work even when they stopped receiving benefits. Admitting he had had apprehensions about the scheme, Dr Muscat said he was ultimately happy the government had taken the step.\nThe benefit tapering scheme provides support to people who have been receiving unemployment assistance, social assistance or single parent benefits, helping them to enter the employment market.\nTurning to the gender pay gap, Dr Muscat said it had increased as more women entered the workforce.\n\"I prefer this problem to not having women working,” he said, adding that the kind of work women did would now need to be taken into account.\nDr Muscat also said a committee was conducting a review of minimum wage that would determine the necessary increase. \"This is a breakthrough from both the government’s and the stakeholders’ end,\" he said.\nMalta needs to be ‘future-proof’\nSpeaking at the end of the session, Parliamentary Secretary for EU funds Aaron Farrugia said Malta needed to become future-proof.\n\"It’s important to talk about workers’ rights, but we need to see how we are going to move forward,” he said.\n\"The world is becoming more globalised and that is why I have a problem with people saying we need to bring in a certain type of worker,” Dr Farrugia said.\nHe called for people to double down on lifelong learning, saying professionals now have to compete with workers in different countries, that were available immediately and at all times.", "comment_count": 22, "id": 997}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The young man charged with allegedly raping the mother of his 15-year old girlfriend and defiling the underage girl in the course of satanic practices, has been granted bail.\nThe 18-year old, whose naming was banned under court order, had been detained under preventive arrest ever since his arraignment on February 8. He has pleaded not guilty to rape, violent indecent assault, holding his victims against their will, coercing them to engage in indecent acts and slightly injuring the women.\nA request for bail was turned down at the arraignment, with the youth spending over three months in custody while the compilation of evidence continued, presided over by former Magistrate Aaron Bugeja.\nFollowing the elevation of Dr Bugeja to judge, the case had to be assigned to another magistrate.\nWhile awaiting notification of the next hearing, the accused’s defence lawyers on May 7 filed a fresh application to the Criminal Court for his release from custody.\nThat Court, presided over by Madam Justice Consuelo Scerri Herrera, declared that presumption of innocence was the cardinal principle to which detention or arrest was only the exception.\nThe Court observed that after having been summoned by the police for questioning, the accused had been granted police bail for 10 days, prior to his arraignment in court. During that period, the man had abided fully by the conditions set down by the police, the Court observed, adding that the police had not imposed any form of personal guarantee at the time.\nMoreover, the youth had been living with the mother but there had been no reports of him attempting to coerce the witnesses into changing their testimony were received, the Court pointed out.\nSince his arraignment, both the prosecution and the Attorney General had constantly objected to bail, primarily on the grounds that the mother was still to testify and also because they argued that the man could manipulate his alleged victims.\nHowever, the Court “found it difficult to embrace this reasoning,” pointing out that the accused was “an 18-year-old boy with a clean criminal record,” and that although there would always be the risk that an accused would breach court orders, this risk had to be weighed against the right to personal freedom.\nThe Court therefore granted bail against a deposit of €1,000, a personal guarantee of €8,000, a curfew between 9pm and 8am and an order to sign the bail book every day.\nLawyers Jason Azzopardi and Kris Busietta were defence counsel.", "comment_count": 0, "id": 998}, {"keywords": "", "author": "Denise Grech ", "article_body": "The 20 MEP candidates who responded to a survey by Allied Rainbow Communities said they were in favour of equal reproductive rights and “family-planning”.\nThe ARC survey found that most candidates from all political parties were in favour of providing equal access to all reproductive health services, including family planning services.\nThe ARC survey was conducted among 20 candidates: 10 from the Labour Party, five representing the PN, two from the Democratic Party, two independent candidates and one from Alternattiva Demokratika.\nAll of them, bar three, said they supported equal access to reproductive health services to individuals and couples regardless of their sexual orientation or gender identity.\nIndependent candidate Arnold Cassola said he was “against reproductive and sexual rights” when this was equivalent to abortion. However, he said he was not against abortion when the mother’s life was in danger.\nPN candidate Roberta Metsola declared she agreed with reproductive rights, making it clear she was against abortion. PN candidate Michael Briguglio also said he was against surrogacy and abortion.\nIn the survey, the ARC based the definition of reproductive health services on that given by the World Health Organisation, which insists people should be free to decide if, when and how often to have children. \nThe survey also shed light on other issues regarding sexual health. Labour candidate, Joseph Sammut, said he was against allowing men who had sexual relations with other males to donate blood. Health Minister Chris Fearne had announced gay men would be allowed to donate blood by this summer.\nLife Network Foundation survey results continue trickling in\nMost Labour candidates for the upcoming European elections did not reply to a survey by Life Network Foundation asking whether they were in favour of abortion.\nThe survey by the LNF – to which 17 candidates originally replied – sought to gauge the candidates’ views on a number of sensitive issues, including abortion, euthanasia and surrogacy. The vast majority of Labour candidates did not reply when asked whether they would vote in favour of legislation, resolutions and other measures promoting abortion.\nAmong other things, the candidates were asked whether they would ever vote in favour of abortion, whether they were in favour of surrogacy, whether they were committed to defending everybody’s freedom of conscience and whether they would vote for any measures favouring euthanasia or assisted suicide.\nFrom among those contesting on the Labour ticket, only Robert Micallef, Fleur Vella, Felix Galea Busuttil and Alex Agius Saliba replied to the questionnaire. They all said they were against abortion but in favour of surrogacy. The last three also said they were in favour of euthanasia.\nAn updated version of the survey results was sent on Friday. Labour MEP candidates had still not replied to the question on abortion. \nHowever, PD candidate Martin Cauchi Inglott and leader Anthony Buttigieg confirmed they were against the introduction of abortion.\nDr Buttigieg and Mr Cauchi Inglott also indicated that they were in favour of surrogacy.\nInternational bodies such as the Council of Europe have warned that Malta’s laws on abortion are too restrictive and breach women’s rights. Published studies and NGOs have indicated that the blanket ban on abortion did not stop Maltese women from undergoing the procedure.\nBoth large political parties have adopted a pro-life stand and declare they are against abortion.\nThe Nationalist Party said a vote for Labour would support the European Socialists who had expressed support for equal reproductive rights while a vote for the PN would be “a vote in favour of life”.\nThe Labour Party said PN leader Adrian Delia was “desperate” and “trying to sow division”. Labour’s stand against abortion was clear, it said.", "comment_count": 21, "id": 999}, {"keywords": "", "author": "", "article_body": "An elderly woman was seriously hurt in San Ġwann on Friday afternoon after she was hit by a Land Rover.\nThe 86-year-old San Ġwann resident was on Naxxar Road at around 2pm when she was hit by a Land Rover Freelander being driven by a 40-year-old woman who also lives in San Ġwann.\nDistrict police and paramedics were called to the scene, and the elderly victim was taken to Mater Dei Hospital by ambulance.\nMagistrate Charmaine Galea is leading an inquiry into the case. The police said they are investigating further.", "comment_count": 0, "id": 1000}, {"keywords": "", "author": "Jacob Borg", "article_body": "Former FIAU manager Jonathan Ferris is seeking damages after alleging discriminatory treatment by police commissioner Lawrence Cutajar.\nIn a case filed before the Constitutional court on Friday, Mr Ferris claimed the commissioner’s failure to reinstate him to the police force after he was sacked from the Financial Intelligence Analysis Unit (FIAU) violated his human rights.\nMr Ferris had taken separate legal action against the FIAU over what he termed as an unfair dismissal during his probation period.\nAccording to Friday’s application, Mr Ferris sent out feelers about returning to the police one month before he was dumped by the FIAU in June 2017.\nVerbal assurance\nDuring a meeting with the police commissioner, Mr Ferris was verbally assured that his reinstatement would not be a problem given his past record.\nHe put in a formal request for reinstatement to the police force in July 2017, but to date the request has not been answered, the court application says.Mr Ferris says he was 'verbally assured' about his reinstatement by police commissioner Lawrence Cutajar\nApart from the “discriminatory” decision not to reinstate him, Mr Ferris is claiming the original decision not to second him from the police to the FIAU also breached his rights.\nHe says in the application that 26 police officers had been seconded to other government entities and even the private sector since 2013.\nThe fact that he was not seconded meant he had to quit the police force when he joined the FIAU in November 2016.\nVarious meetings about the secondment were held prior to this, yet Mr Ferris was never told why his request was being refused, the application says.\nMr Ferris said he felt there were certain “shortcomings” in the police force, so he liked the idea of going to work for the FIAU until matters improved.\nSimilarly, he said in the application that the decision to seek reinstatement to the police in May 2017 came about after noticing shortcomings and abnormalities at the FIAU.\nMr Ferris is claiming before the Constitutional court that the discrimination he faced meant he lost the right to a service pension.\nHe asked the court to order the police commissioner to compensate him.\nThe application was signed by lawyers Andrew Borg Cardona, Therese Comodini Cachia, Jason Azzopardi and Evelyn Borg Costanzi.", "comment_count": 0, "id": 1001}, {"keywords": "", "author": "", "article_body": "The Commissioner for Environment and Planning within the Office of the Ombudsman ruled that a Planning Authority’s circular relating to irregular developments is “unfair, irregular and against the principles of natural justice”.\nThe issue had been raised by the Kamra tal-Periti, which felt that this had serious implications for those property-owners who had minor irregularities.\n“The council of the Kamra tal-Periti does not condone illegal development in any way. However, once certain rights have been granted to property owners in the past these cannot be taken away at a later date, more so when the legal ramifications are wide ranging and potentially serious,” it said on Friday, following the Ombudsman’s decision.\nBackground to the Category B Concession\n• Category B concessions (CTB) came into force in August 2012, enabling residential property owners to submit an application to the Malta Environment and Planning Authority – as it then was – to cover illegal development that fell within specific strict parameters.\n• If approved, the applicant would then be allowed to request permission for alterations and additions to the property, and a Compliance Certificate for the provision of new water and electrical services to the dwelling could be issued. CTBs did not have an expiry date.\n• The CTB regulations restored the affected properties’ market value to levels comparable to legal properties of a similar description. As a result, these properties became sellable again, and banks were reassured that the effects of the concession were permanent.\n• With the coming into force of the Development Planning Act in 2016, the CTB regulations were repealed and no further applications could be submitted. In August 2016, new regulations were published that allowed for the regularisation of various types of illegalities, with no specific parameters, as long as these were not deemed to be an “injury to amenity”.\n• However, the Kamra was concerned by reports from its members that the Planning Authority was requiring holders of CTB concessions to regularise their property at a much heftier fee than what they had originally paid for the concession.\n• On January 28, 2019, the Planning Authority published a circular titled “Category B Concession (CTB) Explained”. The circular explains that applications for sites covered by a CTB concession can only be made once the irregularity is either sanctioned or removed.\n“If the illegal development cannot be sanctioned, a regularisation application would need to have been submitted and approved prior to the planning application being confirmed as complete,” the circular continued.\nThe Kamra tal-Periti requested the Ombudsman’s office to investigate this matter in March 2019, explaining that holders of CTB concessions for minor irregularities could be facing serious risks on their investment unless the Planning Authority changed its interpretation of the law.\n“Banks that have taken such properties as security against mortgages are also at risk in case of default, as the value of such properties may be much lower than expected as a result,” it said.\nIn a decision delivered on May 7, the Ombudsman’s Office recommended that the Planning Authority should “withdraw and cancel this part of the Circular to the effect that a new application can be submitted on a site covered by a CTB concession without the need for sanctioning, regularising or removing the illegal works covered by the same CTB concession, as long as no further illegal development has taken place on site.”", "comment_count": 5, "id": 1002}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "Two teenagers accused of robbing a 16-year old boy at knifepoint were arraigned over the violent crime on Friday.\nMohammed Kim, an 18-year old construction worker from Morocco was arraigned alongside his alleged co-accused, a 17-year old youth from Sudan. Both live at an AWAS-run refugee centre.\nThe mugging took place on the evening of April 22 in Triq San Tumas, Tarxien, when the duo allegedly held up their victim, a Maltese teen, and made off with his cash and mobile phone.\nThey were charged with aggravated theft and holding their victim against his will. The older suspect was separately charged with carrying a knife in public without a police licence.\n18-year old Mr Kim pleaded not guilty and was remanded in custody. No request for bail was made at this stage.\nHis young partner in crime, claiming at the arraignment to be only 15 years of age, ultimately registered an admission, after some uncertainty, and was placed under a three-year probation order.\nInspectors Fabian Fleri and Lydon Zammit prosecuted.Lawyer Charmaine Cherrett was counsel to Mr Kim, whilst lawyer Christopher Chircop was counsel to the other accused.", "comment_count": 0, "id": 1003}, {"keywords": "", "author": "Claire Caruana", "article_body": "A total of 170 students have yet to be provided with a seat on a mini-bus as part of the government's free school transport scheme, Education Minister Evarist Bartolo confirmed on Friday afternoon. \nFielding questions from the press after announcing that the free transport scheme will be carried out to the next scholastic year, Mr Bartolo confirmed the number on the waiting list. While acknowledging that each number meant one less student benefiting from the scheme, Mr Bartolo said that the government had managed to slash the waiting list figures, especially when compared to those at the start of the scholastic year.\nWhen school doors opened in September, some 1,900 school children were still waiting for a mini-bus seat. \nAt the time, the government had said that the waiting list was a result of more people than expected rushing to sign up for the scheme at the last minute as well as operators not having enough mini-buses in their fleets to cater for the increase in demand.\nAsked by the Times of Malta whether any compensation would be offered to those parents who had not benefited from the scheme, Mr Bartolo said this was not currently being considered. \n\"We are not considering that for the moment. Our commitment is to provide publically-funded transport,\" Mr Bartolo said. \nAsked whether, come the next scholastic year, the government was foreseeing a repetition of last year's waiting list situation, Mr Bartolo said that it would be \"doing all [it] can to provide\" the service. \nOn the devices that were supposed to be attached to students' backpacks to allow parents to know their children had arrived safely, commonly referred to as FOBs, the Minister insisted this scheme was still at testing stage, with a pilot project currently underway expected to be extended. ", "comment_count": 6, "id": 1004}, {"keywords": "", "author": "Denise Grech ", "article_body": "Construction workers and those tarmacking roads were working in conditions one could not help but pity, President George Vella said.\nSpeaking at a conference on the Future of Work, Dr Vella called for respect for those whose work involves them being exposed to harsh conditions. \n\"We cannot compromise the health and the interests of those who work,\" he said.\n\"This cannot be done if we don’t ensure decent work and competitive wages,\" Dr Vella said. \"We need to ensure every measure that is introduced will benefit our wallets as well as the health of employees,\" Dr Vella added.\nThe country's biggest resource was workers, the President said, adding that the humanity of workers needed to be kept at the centre.\nWorkers used to previously be considered as a \"machine\", leading to unrealistic expectations of production - and shifts that did not take into account people's natural biological clock. \nThe results, Dr Vella explained, were obvious: less efficiency, people lying about taking sick leave and tense industrial relations.\nHe explained that in the past, workers were secure in the knowledge that all they had learned decades before would be sufficient to guide them throughout their whole career, he said. However, things had changed and continuous learning was required to ensure that people remained active, he said. \n ", "comment_count": 14, "id": 1005}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 6pm with PN reaction\nA ban on single use plastics, the end of free plastic bags at shops, and restrictions on other non-biodegradable products are among the green measures set to be implemented in the next few years.\nOther incentives include the introduction of “packaging free” areas in supermarkets, and the controversial announced beverage container refund scheme. \nThe proposed measures were announced at a press conference on Friday by Environment Minister José Herrera who unveiled the government’s single use plastic strategy.\nThe local strategy document, which is open for public feedback for the next six weeks, mirrors an EU policy adopted back in January.\nTimes of Malta first reported on plans for the policy last year. \nThe PN said in a statement on Friday evening that it was committed to the phasing out of single-use plastic, and that this formed part of its manifesto for the European Parliament elections.\nIt also pointed out that a Labour minister had removed the eco-contribution originally introduced by the Nationalists 10 years ago as an environmentally-friendly measure.\nHow does the government plan to fight single use plastic? \nEliminate single-use plastic products\n• By 2021, a number of single use plastic items would be prohibited from the local market in view of the readily available and economically feasible alternatives available.\nEncourage waste separation at source\n• By 2022, all tourist accommodation establishments, including hotels, hostels, guesthouses as well as holiday premises and yacht marinas would have to provide guests with bins for the separate collection of plastic waste. \nMake it easier not to litter\n• By 2020, the government planned to provide bins for the separate collection of plastic waste in coastal areas, camping sites, picnic areas and touristic zones.\nProtect Maltese waters\n• The use of fishing gear made from plastics and nylon should be progressively substituted to gear made from more sustainable material.\n• By 2022, the use of polystyrene in fishing activities should be restricted and substituted by reusable plastic floats or other sustainable material.\n• By 2024, an extended producer responsibility scheme should be established for fishing gear containing plastic and placed on the market.\nEncourage the reduction of plastic carrier bags use, and increase use of reusable bags\n• By 2022, all kinds of plastic carrier bags would not be distributed for free at points of sale.\nIf consumers required a bag, they would have to buy it.\nThis would encourage consumers to use reusable shopping bags. The excise duty imposed on such bags would also be increased. The move towards imposing an excise duty on plastic carrier bags  had first been introduced in the 2008-2013 PN administration.  \nEnsure packaging-free areas in supermarkets\n• By 2022, a voluntary scheme should be set up to encourage supermarkets to provide packaging-free areas from where customers would only be able to buy selected food products without plastic packaging. This would encourage consumers to move towards reusable containers, reducing plastic waste.\nSeparate collection for valuable waste streams\n• By 2022, a return or refillable system should be introduced, where consumers who returned or refilled containers used for washing preparations, and other personal care products, might benefit from a reward scheme.\nNo to harmful entertainment\n• By 2020, the release of balloons and plastic confetti would not be allowed during public events to avoid having these items end in the marine environment.\nMeasures affecting smokers\n• By 2022, producers of tobacco and tobacco products would have to finance the provision of ashtrays at beaches and beach resorts.\n• From 2023, producers of tobacco products with filters and filters marketed for use in combination with tobacco products should at least cover  the cost of:\nawareness raising measures;\nthe cleaning-up of litter; and\nthe collection of such waste discarded in the public collection system.\nThis might include the installation of bins for cigarette filters in common litter hotspots.\nThe entire list of proposed measures can be read in the pdf link below.\n ", "comment_count": 62, "id": 1006}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The presence of the Prime Minister’s head of security at public hearings on a planning development application is giving rise to questions, Times of Malta is informed.\nPlanning Authority sources told the newspaper John Portelli, who was appointed Joseph Muscat’s official personal bodyguard soon after the 2013 election, was seen at public hearings of an appeal to sanction an illegal structure on top of City Lounge, a trendy bar and restaurant overlooking St George’s Square, Valletta.\nThe sources described Mr Portelli’s presence as “odd”, particularly since he does not appear in any official documents as having any particular personal interest in the catering establishment. It was also rather strange, they continued, because the sittings were held during regular office hours when he would usually be on duty.\nA spokesman for the Prime Minister replied when asked about the matter: “Mr Portelli said he was present for one or two public meetings (on this application) as a private citizen. He confirmed that he has no interests in this application or any other business venture with City Lounge or its shareholders.”\nAsked whether Mr Portelli’s presence at the hearings formed part of his duties at Castille, the spokesman said there was no connection whatsoever.\nMr Portelli, 66, from Żejtun, was reinstated into the police force on the first day Labour was returned to power in 2013, almost 10 years after his retirement from the corp. \nJohn Portelli (centre) stands behind Joseph Muscat. Photo: Chris Sant Fournier\nHe was immediately promoted to sergeant major on the instructions of then police minister Manuel Mallia.\nKnown among colleagues as Iż-Żubina, Mr Portelli used also to have a private business together with Frankie Grima, the developer of City Lounge. However, the company, J&F Company Ltd, was struck off in 2002.\nIn 2017, the government had refused a request by Times of Malta under the Freedom of Information Act asking for details of Mr Portelli’s engagement contract including his financial package and perks. The Office of the Prime Minister had argued that the information was not available for publication as it “refers to documentation held by the security services”.\nIt had also refused to provide information on how many police officers formed part of Dr Muscat’s personal security detail and whether they were answerable to Mr Portelli or the Police Commissioner.\nIn the beginning of 2018, the Planning Authority had refused to sanction a retractable canopy, glass railing and a sign set up illegally by the owners of City Lounge overlooking the historic Valletta square. The canopy is still in place as an appeal filed by the company running the restaurant is being heard by the Environment and Planning Review Tribunal.\nArchitect and lawyer Robert Musumeci, a consultant to the Office of the Prime Minister, is representing the restaurant in the appeal proceedings.\n ", "comment_count": 97, "id": 1007}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The government on Friday announced a project that will effectively almost double the area of the Ta`Qali National Park, with an additional 200,000 square metres of land turned into open spaces for families to enjoy.\nPrime Minister Joseph Muscat said this project will return to the people an area that was used abusively over the years as a concrete factory.\n“This is not simply the embellishment of the area but the result of direct action on a zone that until a few weeks ago was a dilapidated concrete factory. We could have easily given it up for commercial use because we have investors who need the space but we saw the potential and decided to return it to the people,” he said.\nThe 52,000 square metres of land will be rehabilitated to create the new Malta National Park. It will include pockets of land that are currently not accessible, or are dangerous.  The present parking areas, which in total cover another 150,000 square metres of land, will also be improved.\nThe national park is practically being doubled to 450,000 square metres which was a third of Hyde Park in the UK, Dr Muscat said proudly. It will include an extension of the dog park and the creation of a camping site, an electoral pledge, he added.\nDr Muscat said the government is also looking into roofing over the Santa Venera tunnels which divide Santa Venera in two. This will create another 13,000 square metres of open space for families. Along with Ta`Qali, this will create “a new lung in the centre of the country”.\n“These projects and others show that our priority is the country’s economic well-being but this is a means to an end. The end is social justice, social mobility and quality of life, along with national unity and equality.\n\"This government knows that people want more open spaces so we are providing the solutions,” he said.\nEnvironment Minister Jose Herrera said the new site, on which 80,000 trees will be planted, will be managed by Ambjent Malta while Transport Minister Ian Borg said the project, which will cover the equivalent of 63 football pitches, will cost around €20 million.\nPlanning Authority chief executive Johann Buttigieg said the site, which previously housed a concrete plant that was disused fort several years, took the PA around six weeks of continuous work to clear.\nHe said the nearby Nissen Huts could not be removed as the authority was stopped by the Superintendence of Cultural Heritage which is looking into alternative use for them or an alternative site where they can be placed.", "comment_count": 86, "id": 1008}, {"keywords": "", "author": "", "article_body": "Three leading training institutions have formed an alliance to set up a Malta-based training hub catering for the growing needs of the maritime, aviation and oil and gas industry.\nThe International Safety Training College, the Malta Maritime Hub Academy and Motherwell Bridge combined their expertise to offer tailored programmes in their own industry work environments across a three-mile radius in proximity to Malta International Airport.\nA programme list of more than 25 courses features diverse disciplines including drilling, marine and technical tuition, a variety of welding certifications, and emergency response, disaster management, environment protection, and health and safety training.\nThe courses are aimed at international companies seeking to train or retrain their teams in certified environments, people seeking to embark on careers in these fields, enhance their skill set and obtain certification and accreditation.\nAll three training centres are accredited and recognised by bodies including IATA, Transport Malta, the International Well Control Forum, OPITO, NCHFE and others.\n“Combining our skills and knowledge in a single alliance will allow us to access greater opportunities in countries and areas of business, previously closed off to a single operator,” Andrew Gilravey, ISTC director said. “It will also help us to strengthen our current position in markets where we are already established.”\nMMH director Angelique Maggi said the consolidation of similar markets and clients through collaboration delivered a unique value proposition within the MENA region.\n“This will position Malta at the forefront of this industry. This collaboration also reflects a new way of working between the different players in the industry. Collaboration is key to success,” she added.\nThis will position Malta at the forefront of this industry\nThe three training centres, close to each other and to Malta’s international airport targeted the oil and gas industry and related sectors, Ruben Cuschieri, managing director at Motherwell Bridge, said.\n“With over 25 courses on offer and a combined training experience of over 20 years, this one-stop-shop will address the needs of employers and employees alike,” he noted.\nISTC focuses on emergency response, disaster management, health, safety and the environment. Its training facilities have been specifically designed for the aviation, oil and gas and maritime sectors.\nMMH Academy is dedicated to the training and education of the oilfield and marine communities throughout the Mediterranean region. It offers a range of high-quality instruction across the spectrum of industry disciplines, from drilling to marine and technical courses. Courses are delivered in a classroom environment, accompanied by simulators and workshops for hands-on training.\nMotherwell Bridge is an accredited training provider for the most demanding oil and gas welding projects. Delivering courses to suit individual requirements and career aspirations, it guides participants through modules delivered in a classroom environment and in a dedicated workshop.", "comment_count": 2, "id": 1009}, {"keywords": "", "author": "", "article_body": "An extremely rare BMW Alpina C1 is being sold by the Malta Customs Department in an upcoming sale by tender. It is a right hand drive specimen from a production run of 35 cars, most of which were built left hand drive by German tuning company Alpina Burkard Bovensiepen GmbH & Co. KG in the early 1980s. This BMW Alpina C1 is based on the E21 and features the original Alpina Dash Plate (3-1781), custom Alpina interior, a lower front lip, the shark-nose BMW grille, the distinctive Alpina lateral green/blue stripes.\nThe engine has been tuned to produce 168bhp, and the extra power is due to special Mahle pistons and a special exhaust and ignition system. It also received dry-sump lubrication and a short-ratio five-speed gearbox.Tenders will be received by the director general (customs) at Newport Bonded Stores in Marsa from May 20 to 23 between 8am and noon and from 1 to 4pm and on May 24 between 8am and noon.\nThe department is also receiving sealed tenders, on the same dates and times, for the tale quale purchase, and removal, of various lots including:• a Ford Sierra Sapphire Cosworth;• a Mercedes Benz 116;• Gold Jewellery;• Footwear;• Clothing;• Mink blankets; and• Plastic socketsViewing of lots, collection of tenders forms and further information can be obtained from the Auction House, Customs Newport Bonded Stores, Marsa , tel: 2123 7209 during the said dates and times.\nValid identity cards or passports have to be presented by all bidders/representatives when submitting tenders.", "comment_count": 15, "id": 1010}, {"keywords": "", "author": "", "article_body": "Customs officials on Friday seized undeclared cash from a passenger at Malta International Airport, putting into force subsidiary legislation which came into force recently.\nThe department said in a statement officials from its Anti-Money Laundering Team and the Enforcement Unit were carrying out currency checks at the airport's departures lounge, screening passengers boarding a flight for Tunis.\nA Libyan national was asked to proceed to the Customs Departures Office for a currency check. Searches on the passenger and his belongings yielded a discovery of $20,000.\nUnder new legislation pertaining to undeclared cash, which came into force recently, the passenger forfeited the cash being carried in excess to that allowed by law, the equivalent of €10,000, to avoid appearing in court and risking a heavy fine.\nThis is the first time that recently enacted subsidiary legislation was put into force.\nThis legislation states that if a passenger was found carrying undeclared cash that amounted to less than €20,000, he could agree to an out of court settlement with the Customs Department, avoiding losing the flight and appearing in court, where he could also possibly be fined.", "comment_count": 10, "id": 1011}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "While blockchain operators struggle to open bank accounts in Malta, Estonia and Switzerland are forging ahead and attracting business, the organiser of the Malta Blockchain Summit has warned.\n“The hype about Malta as the Blockchain Island peaked during the Malta Blockchain Summit last autumn, but while the Virtual Financial Asset agents have since then been approved by the Malta Financial Services Authority, operators are getting impatient about the lack of banks willing to open accounts for them,” Eman Pulis warned.\n“Banks are very concerned that doing so might spook their correspondent banking relationships – and if these were pulled, then Malta would lose its ability to work in the US banking system. It is a major issue so I cannot say that I blame them,” he said.\nHe pleaded for all the stakeholders to remain aligned, saying that much could be achieved if everyone worked together.\nIn spite of the competition and delays, he still sees considerable potential in the blockchain/artificial intelligence sphere, saying it would complement what has already been achieved in the gaming sector.\n“Blockchain and AI will be the future for gaming and its regulation puts the Malta Gaming Authority way ahead of the competition,” he confirmed.\nA task force is currently looking at incentives to attract artificial intelligence companies to the island, while the University of Malta is already offering a masters degree relating to the field.\n“Estonia and Zug in Switzerland have different barriers to entry: Malta attracted the bigger players like Binance, but is not as interesting for start-ups, which might deter the next unicorn,” he pondered.\nApart from the task force, there are other initiatives under way. A fourth piece of legislation is in the pipeline which would look into the tricky concept of ensuring consumer protection from so-called ‘Decentralised Autonomous Organisations’, which can run without human intervention.\n“The government wants to find ways to prevent criminal abuse of DAOs, while the MFSA is looking at ways to protect the end user and ensure that consumers can make claims to protect their rights,” he explained.\nMr Pulis is in touch with many of the major players in this industry: the Sigma conference in November will attract 15,000 delegates and his company, Gaming Hub, now employs 40 people to handle the complex requirements of this and other summits: the blockchain and artificial intelligence summit at the Hilton on May 23-24 will attract some 4,000 delegates.\nThe gaming sector is now maturing – with the Nordic markets particularly well established. However, there is still scope for new markets, with companies transferring here from Gibraltar because of Brexit being only one development. Mr Pulis said that at one point, there was considerable interest in the Asian market but that the appetite for this region had cooled, replaced by interest in Latin America and North America. Recent court decisions have opened up the latter market, allowing each state to determine whether to allow online sports betting.\n“Until now, gaming in the US remained focussed on land-based casinos while Europe was increasingly online, so this sector has a real advantage as it is already a robust platform,” he stressed, saying that allowing people to pay in cryptocurrencies could be the next frontier.\nIndeed he is clearly enthusiastic about the evolution of gaming into the blockchain and artificial intelligence spheres – with banks being the ones which have most to lose.\nApart from Fintech payment options, which are being increasingly regulated by the MFSA, he warns that operators could bypass banks completely and rely on EU ones to service their needs.", "comment_count": 25, "id": 1012}, {"keywords": "", "author": "Claire Caruana", "article_body": "The course aimed at making Mcast engineering graduates eligible for a warrant should be first approved by an “independent foreign body” before starting, the Chamber of Engineers has insisted.\nThe issue with the warrant made headlines again this week after the Chamber expressed its dismay that despite an agreement with the Engineering Board, requirements for Mcast students to obtain a warrant remained inferior to those demanded from University students.\nContacted about the matter, the board insisted that the course was formulated with the intention of “addressing the lacuna” that existed in the study units offered in the Mcast course. \nIt also insisted that “there is a mutual understanding” between the college and the board that should any of the courses, including the pre-warrant, need changes, these would be implemented. \n“The process of implementations made in the Accreditation Agency Specialised in Accrediting Degree Programmes in Engineering, Informatics, the Natural Sciences and Mathematics (ASIIN) reports is being presently undertaken and in the coming days a public call will be issued to commission external international reviewers to ascertain that both the new BEng course structure and that of the pre-warrant qualification course is full in line with their recommendations made in those reports and reach the desired objective of past graduates reaching the level established by the EPB to obtain the warrant of engineer,” the board said. \nThe board and Chamber had agreed that past Mcast graduates should bridge any deficiencies through targeted bridging studies comprised of 60 credits at level six with an examination-based assessment. However, this was halved to 30 so the total of credits would be 150, compared to the university’s 240 credits, the chamber has insisted.\nIn its reaction, the Chamber again reiterated that having a course with only 30 credits at level six is “completely unacceptable”.\n“There is a lot at stake for Maltese society if the necessary standard of engineering education is not attained. The economy, safety, health and well-being and quality of life of Maltese citizens could suffer if the country is not equipped with the right level of academic engineering education. “We as a Chamber remain committed to safeguard the interests of not only our profession but also of the rest of society,” the body insisted.\nREAD: Mcast is still restructuring engineering courses - Chamber of Engineers\nMeanwhile, in a separate statement, a group of engineers, who call themselves the Warranted Engineers Action Group, said that many engineers believe that the situation was “a long time coming”. \n“It was only the Chamber of Engineers that was and possibly remains in denial, and alone bears responsibility for this state of affairs.\n“It is being reported that the Chamber will be calling an extraordinary general meeting, and at the same time inviting all engineers and others to the event. An extraordinary general meeting is called by members of an organisation, mainly to debate and vote on strategic decisions that may need to be taken. Persons that are not paid-up members of the organisation are not normally invited to an extraordinary general meeting, and definitely have no right to vote.\n“In this extreme situation, the organisation of a National Conference for all Warranted Engineers, in which all matters are laid bare and effective consultations with all warranted engineers will take place is now an imperative. This is very different from the extraordinary general meeting that the Chamber of Engineers is proposing to hold,” a spokesman for the group said.", "comment_count": 23, "id": 1013}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Friday’s newspapers\nTimes of Malta quotes Archbishop Charles Scicluna saying that a new Vatican law making the reporting of sex abuse compulsory laid down that Church leaders were not above the law and must answer to wrongdoing like everyone else. In another story, it says an Italian man suspected to have links with the Mafia will be returned home after the court accepted a request by the Italian authorities for his extradition.\nThe Malta Independent says that the remaining €2.9 million stolen in the cyber attack on Bank of Valletta have been found in Hong Kong.\nL-Orizzont says 500 doctors have joined forces against abortion.\nIn-Nazzjon says that a vote for Labour candidates was a vote for European socialists who wanted to impose abortion on Malta.", "comment_count": 0, "id": 1014}, {"keywords": "", "author": "Claire Caruana", "article_body": "The nurses’ union wants the time frame for renovation works at Mount Carmel Hospital to be cut shorter so the job could be done sooner, Times of Malta was told.\nThe Malta Union of Midwives and Nurses last month threatened the government it would take action if it was not informed about the time frames of the works.\nThis followed reports in Times of Malta indicating that most of the wards at the country’s only mental health hospital had condemned ceilings. As a result, patients were crammed into a few wards, with beds lined up too close to each other, at times even forcing them to keep their belongings on the floor.\nIn comments to Times of Malta following a joint press conference with the union on a recruitment drive, Health Minister Chris Fearne confirmed that discussions on the issues at Mount Carmel were under way and “progressing well”.\n“We have a plan for Mount Carmel, which was already there but which, together with the MUMN, has been tweaked a bit,” he said.\nUnion president Paul Pace said that the government had supplied the union with the time frames adding these had to be cut even shorter so the much-needed work could be carried out sooner.\n“We were given the time frames but we will have a further meeting in June because we still think there is room for improvement. At least, we have acknowledged there is a problem and we are working on the set time frames. We are doing our best to have them shortened even more,” Mr Pace said.\nHe also told the newspaper that talks had started to address staff shortages at Mater Dei Hospital’s intensive care unit and, in the meantime, nurses would be deployed there in the coming months. Mr Pace said the numbers still did not match what the union was asking for.\n“To issue directives at the only ITU in Malta is very challenging. It wasn’t our pleasure, not at all. We rarely issue directives in such places. The nurses there are very dedicated and only resort to the union when they feel their backs are against the wall. We must acknowledge the effort by the management but, unfortunately, our numbers have not yet been met,” Mr Pace commented.\nThe union warned on Wednesday it would issue directives unless more nurses were brought in, insisting that, should a major accident occur, the ITU would not be able to handle an influx of patients.", "comment_count": 8, "id": 1015}, {"keywords": "", "author": "Keith Micallef", "article_body": "Although Tower Road in Sliema is set to be reconstructed from scratch in the coming months, Infrastructure Malta has just spent €830,000 in an extensive resurfacing job stretching from the Ferries to St Julian’s.\nTower Road, Sliema, has been resurfaced even though it will be rebuilt from scratch in the coming months. Photo: Chris Sant Fournier\nAddressing a news conference at Fond Għadir, Sliema, Transport Minister Ian Borg justified the decision on grounds that parts of this arterial thoroughfare were in such poor state that urgent action was needed.\nHowever, the timing of the project a few weeks before the European and council elections and the manner in which the works were conducted raised eyebrows.\nWhile Sliema mayor Anthony Chircop told Times of Malta they had neither been notified about the news conference nor on the works themselves, questions were raised about the fact that the area reserved for parking at the side was not resurfaced.\nAsked about this, Dr Borg said it was technical. “Since we are not constructing the road from scratch, part of the old asphalt layer had to be retained to calibrate the resurfacing machine to keep the existing levels. Failure to do so would have made the road prone to flooding,” he said.\nThe minister noted that several roads in Sliema would be rebuilt in the coming months as part of the first batch of roads Infrastructure Malta would be doing from scratch.\nThe works were part of the government’s €700 million roads programme, spread over seven years. Tower Road, High Street, Manuel Dimech Street and Sir Arturo Mercieca Street were included in the list of 290 roads to be done in the first year across Malta and Gozo, he said.\nOur intention is to ensure that these roadworks do not bring Sliema to a standstill\nAsked about the lifespan of the new roads, Dr Borg said these were expected to last for 20 years. He added that contractors would be liable in case of bad workmanship for the first five years and, subsequently, there would need to be a maintenance agreement.\nIn the case of Sliema, Dr Borg remarked that the council had made a formal request for the government to intervene because it did not have the resources to carry out maintenance on arterial roads. “We did not blame the local council but decided to intervene given that there are funds available from the government’s surplus,” he said.\nContacted by Times of Malta, the Sliema mayor welcomed the project but also expressed his dismay on the manner in which it was handled.\n“While we only learnt of these works from shop owners and residents, we would have expected to be notified about the news conference as the matter is highly relevant to us, given we had requested the government’s assistance,” Mr Chircop said.\nHe admitted he was surprised that long-awaited works in St Helen’s Street, which had been flagged a year and a half ago, had not yet been carried out. These works were meant to solve issues related to flooding.\nThe mayor urged the government to consult with the council on the traffic management system that would be in place during the planned works for Manuel Dimech Street and High Street.\n“Our intention is to ensure that these roadworks do not bring Sliema to a standstill but are staggered in a way to minimise inconvenience,” he said.", "comment_count": 54, "id": 1016}, {"keywords": "", "author": "Denise Grech ", "article_body": "The strategy for Valletta was a “shortsighted view” on the future of the city and was more about generating investment than helping liveability, a V18 study found.\nThe findings are part of a research plan by the Valletta 2018 foundation, which had set up a research department to gauge the impact of its stint at the helm of the European Capital of Culture.\nThe study, with architect Antoine Zammit as lead author, found “strong proof” that Valletta was transforming from a residential to a catering destination. \n“The Valletta research reveals a number of lost opportunities and the decline of involvement due to policies,” it noted.\nMost regeneration schemes spurred on by V18 did not have explicit policies on community participation, nor did they incorporate it into their strategic planning.\nResearch focused on four areas within Valletta that underwent regeneration: Strait Street, the Valletta market (Suq tal-Belt), the historic Biċċerija (slaughterhouse) quarter and fine arts museum Muża.\nThe evidence showed most regeneration schemes did not have explicit policies on community participation, nor did they incorporate it into their strategic planning, the report said.\n“Overall, the impression is that community involvement is often assumed to be taking place, and is approved of in principle, but is marginal in practice, with much loss of effectiveness in regeneration schemes,” the report added.\nValletta research reveals a number of lost opportunities\nThe research spanned over the period 2015-2018. \nThe study recommended that local development initiatives would not serve as a “substitute” for top-down approaches. \nIt found a disconnect between the four projects, noting a “lack of all-inclusive vision” for cultural infrastructure in Valletta.\nThe Valletta market regeneration project was a “missed opportunity”, the researchers noted, criticising the “over-appropriation of the public space”. The project, unveiled last year, could have been used to enhance rather than detract from the nature of the public space even further.\nStrait Street, they noted, was taken over by commercial entities, making it less walkable but livelier. \nConstruction work impeded the flow of pedestrians there, apart from accessibility concerns because of stairs and inclined and uneven ground levels.\nThe research applauded ongoing restoration works but said most of the buildings that had undergone renovations were boutique hotels. This highlighted the role of tourists in the area and how it was losing a residential feel, the report remarked\n“The four sites have given an overall indication of the changing character of Valletta – one wherein more external visitors are being accommodated,” the researchers concluded.", "comment_count": 8, "id": 1017}, {"keywords": "", "author": "", "article_body": "Far-right MEP candidate Norman Lowell has been reported to the Broadcasting Authority and the police for hate speech following his disgraceful comments about children with disability.Norman Lowell\nThe report was filed by the Commission for the Rights of People with a Disability soon after the leader of the so-called Imperium Europa was seen as having promoted eugenics during a TV interview on F-Living. \nDuring the Nazi era in Germany, eugenics prompted the sterilisation of several hundred thousand people then helped lead to anti-semitic programmes of euthanasia.\nMr Lowell was reported to have said on TV that horribly mentally defective babies should be aborted or granted a benign mercy killing.\nDuring the interview, weeks ahead of the European Parliament elections, he asked whether anyone enjoyed going to a village which was full of \"village idiots\" and whether anyone wanted \"handicapped people\".\nCommissioner Oliver Scicluna said the CRPD had received complaints from several people.\nMr Lowell, a Nazi sympathiser who once said migrants should be gunned down at sea, was handed down a two-year jail term suspended for four years in 2008 after he was found guilty of inciting racial hatred and insulting the President of Malta.\nHe recently sparked more controversy after he compared the World War Two concentration camp Auschwitz to the \"Disneyland of Poland\".\nHis comment elicited a reaction from the Democratic Party's MEP candidate Martin Cauchi Inglott, who wrote: \"Auschwitz remains a living pain to decent people. More than 6 million dead deserve better. Lest we become complacent thinking it cannot happen again...\"\n ", "comment_count": 0, "id": 1018}]