[{"keywords": "", "author": "Sarah Carabott", "article_body": "Stop returning rescued people to Libya and start supporting search-and-rescue operations, a group of 65 organisations, including eight Maltese ones, are urging European leaders.\nBodies of migrants lie on a boat after being recovered by a Santa Lucia merchant ship 20 nautical miles off the Libyan coast, on August 1, 2017. Photo: AFP/Angelos Tzortzinis\nIn a letter signed by Oxfam and Caritas Europa, among others, the organisations express grave concern over the death of 2,500 people in the Mediterranean since January 2018. \nRead: 'If you're Christian how can you not save migrants' - bishops ask, amid impasse\nThey claim that EU governments have become complicit in the tragedy unfolding before their eyes.\nSent ahead of the informal Justice and Home Affairs Council meeting and addressed to home affairs ministers and the European Council and Commission presidents among others, the signatories said that some member states were making it more difficult for civil society organisations to rescue people.\nThis included making unfounded allegations against them and preventing search-and-rescue boats from leaving their ports. Five organisations were conducting such operations this time last year but only one was able to do so now, they added.\nRead: Rescued migrants brought to Malta following agreement with Spain\nThe Libyan coast guard intercepted 15,000 people and took them back to the North African country last year. Those forcibly returned to Libya are likely to be placed in detention, are abused, tortured or sold into slavery, according to the organisations.\nThe letter, signed by Malta NGOs African Media Association, Blue Door English, Kopin, Malta Microfinance, SKOP, Aditus Foundation, Integra Foundation and Moviment Graffitti, calls on leaders to reach an agreement on timely disembarkation that would save lives and respect people’s fundamental rights, including that of seeking asylum.\n“Given the urgent need for measures on responsibility-sharing and the obstacles to an EU-wide solution, arrangements should be agreed upon immediately and participating states should be identified from the outset, not on a ship-by-ship basis,” the organisations say. Countries should also allow all vessels conducting search-and-rescue activities to dock in their ports, disembark people who have been rescued and return to sea in a timely manner. \nRead: Migrants land in Sicily as ship crew faces uncertain fate\nEuropean governments should establish clear benchmarks, including an end to arbitrary detention, and be prepared to suspend cooperation and assistance to the Libyan coast guard if not met, they argue.\nWhat migrants told Oxfam\nMoussa, 17, from Mali, was intercepted by the Libyan coast guard and taken to a Tripoli detention centre: “They asked me for more money but I didn’t have any left. They beat me on the soles of my feet, my calves and my knees but I kept saying I couldn’t contact anyone because I had no family left in Mali… I saw a young Gambian boy beaten to death because he dared to answer back.”\nYonas, 28, from Eritrea, was detained by various gangs in Libya: “I lived for a year and a half in two prisons… in terrible conditions, with many people getting sick and not receiving care. Many died and were buried like animals. Women were raped in front of us. We were beaten every day by prison guards selected from among migrants… They beat us and made us call our family to ask them to send money.”\nIbrahim, 26, from Guinea, was kidnapped by a Tripoli street gang: “On the days when UN staff came they treated us well, cleaned everything, cooked good food, brought us clothes, brought us to a doctor for check-ups. As soon as the UN staff left, things changed immediately. They took everything they had given us: food, clothes, soap.”", "comment_count": 0, "id": 2019}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The proposed railway station in Attard has nothing to do with the original building that was demolished during the war, according to the railway foundation, which will be meeting the local council over its objection.\n“The Malta Railway Foundation does not agree with the proposed design of the new building as it will not be restoring history,” founder Paul Galea told Times of Malta.\n“If we’re going to build something from scratch we should at least make the outside of the building as close as possible to the original Victorian one, and adapt the indoors to our needs.”\nIn 2018, the local council announced that Malta's only remaining railway embankment is being restored and incorporated into a walking heritage trail leading to an information centre. \nThe Attard Railway Station will serve as an information centre and a public library.\nThe embankment, which abuts the Corinthia Palace Hotel and lies just 100 metres away from San Anton Palace, was built in 1882 as part of Malta's railway system, which operated until 1931.\nWatch: Restored railway carriage is back at Birkirkara station\nThe Attard local council’s station railway station project will be financed through ERDF funds.\nThe foundation provided the council with historical information about the railway station and system, and will also be providing the exhibits that will be hosted in the new information centre.\nIt is objecting, among others, to a proposed awning that has nothing to do with the old railway station.\nThe proposed Attard Railway Station. Photo: Malta Railway Foundation\n“There is no comparison at all. This is not acceptable at all. We need to be more sensitive to our cultural heritage and rebuild the Attard Railway Station to the original architectural Victorian design.\n\"The Malta Railway Foundation will not be taken for a ride,” it said on Facebook.\nA meeting has been scheduled with the Attard council for Wednesday.\nWatch: Malta's last surviving train carriage chugs toward restoration\nKnown as il-vapur tal-art (ship on land), the railway ran from 1883 to 1931, when the service was halted because it could not financially compete with trams and buses.\nRemnants of the service remain in Mtarfa, where there is another station, and Birkirkara, which also hosts the last surviving carriage.\nRead: Railway tunnel offices plans are 'a stab in the back' - Foundation chairman", "comment_count": 31, "id": 2020}, {"keywords": "", "author": "", "article_body": "Charles Mizzi has been appointed chief executive officer of the Malta Residency Visa Agency, replacing Roderick Cutajar whose contract has expired.\nMr Mizzi began his career in the banking sector and worked with a number of local banks, where he occupied several roles in the marketing department.\nIn 2014, he became executive director media and marketing of the Maltese Presidency for the European Council. In 2017, he became chief officer of the Individual Investor Programme Agency, responsible for communication and business development, garnering important experience in the sector.\nMr Mizzi graduated with a Masters in business administration from the Henley Business School.\nParliamentary Secretary Julia Portelli thanked Mr Cutajar for his work in the past years and congratulated Mr Mizzi on his new role.", "comment_count": 1, "id": 2021}, {"keywords": "", "author": "Jacob Borg", "article_body": "Nationalist Party leader Adrian Delia ‘survived’ a three-hour-long meeting of the executive committee on Wednesday without any calls for a secret vote about his leadership being made, Times of Malta learnt.\n\nThe executive committee is the party’s second-highest decision-making organ.\nA show of hands, made upon a proposal by MP Mario Galea, saw the committee unanimously declare their confidence and support in Dr Delia.\nA source well-versed with the committee’s procedures said it was normal for votes to be taken by a show of hands, unless a secret ballot was specifically requested. “One could argue that the request for a vote should have come from Adrian Delia,” one of those present told Times of Malta.\nParty sources said that although the meeting was well attended, a number of high-profile MPs who privately expressed doubts about Dr Delia’s leadership were not present.\n“Those who oppose Dr Delia probably chose to stay away from the meeting because they would be loath to have openly voted in favour of him but would not want to be seen voting against him either,” one source remarked.\nSome of those who attended the meeting and who spoke to the newspaper insisting on anonymity described the meeting as “productive”, with Dr Delia once again fielding questions about members’ concerns. \nThe party sources said there was a general acceptance among those who opposed Dr Delia’s leadership that nothing could be gained at this stage by forging ahead with calls for his resignation. “We really need to focus on the upcoming elections. It is time for as to all work together”, one source said.\nThe executive committee met on the back of a “fiery” assembly of the PN’s parliamentary group on Monday. Then, too, Dr Delia did not face any calls for his resignation from MPs, though nor were any public pronouncements backing his leadership made.\nThe PN’s administrative council expressed its unanimous backing of Dr Delia in January. This had been announced by the party in a brief statement, as was the case with the outcome of the executive committee meeting but no statement was issued after the Nationalists MPs met.\nAn MP who spoke to Times of Malta on Thursday also admitted that the time for dissent had passed. “It is now time to turn our energies towards the MEP and local council elections. We will see whether the support for Adrian Delia emanating from the party structures is reflected in the wider public,” the MP commented.", "comment_count": 95, "id": 2022}, {"keywords": "", "author": "", "article_body": "These are the main stories in Friday’s newspapers.\nTimes of Malta says the teachers’ union has expressed fears that the introduction of 13 new subjects next year would result in more staff shortages, again accusing the government of lack of planning. In another story, it says a former European justice commissioner agreed with Malta’s passport sales programme and endorsed it in writing.\nThe Malta Independent says the Malta Financial Services Authority has begun a transformative journey through reform.\nL-Orizzont says the Prime Minister has offered to drop proceedings against Daphne Caruana Galizia if the family accepted the conclusions of the Egrant inquiry.\nIn-Nazzjon says the government has once again postponed debate on the Corinthia land.", "comment_count": 0, "id": 2023}, {"keywords": "", "author": "", "article_body": "President Marie Louise Coleiro Preca hoped that serious efforts will continue to resume the much-needed peace process and to achieve a two-state solution which allows Palestinians and Israelis to live side-by-side in peace.\nIn a statement following bilateral talks with Palestinian President Mahmoud Abbas on Thursday, the President noted that the Israeli-Palestinian Peace Process had experienced many challenges and struggles.\nTherefore, the active support of Malta, the European Union, and the international community had to continue to provide hope that an independent and democratic State of Palestine would one day exist alongside the State of Israel, in the context of the two-state solution, she said.\nThe President said her visit reaffirmed the political will of Malta’s government to be an active collaborator in efforts to create and to safeguard strategies for sustainable peace.\nFor peace to be long-lasting, it had to become an intrinsic part of all of societies and cultures.\nFor decades, Malta had engaged with Palestinians through various educational initiatives, including opportunities for Palestinians to study in a variety of educational sectors, the President said.\nShe added that as the international community affirmed, the Palestinian people deserved the right to self-determination and to reach their aspirations.\n“Everybody, every member of our human family, deserves to move and travel freely, to feel secure in their communities, and to receive opportunities to fulfil their legitimate aspirations.”\nShe reiterated Malta’s support to the Palestinian people to achieve the full enjoyment of their human rights and fundamental freedoms saying this was what the Universal Declaration of Human Rights was all about.\nAll stakeholders, President Coleiro Preca said, had to continue to work together to build trust and mutual respect to ensure that human rights for all were safeguarded.\nDialogue could only exist when it was rooted in these principles of respectful cooperation and peaceful coexistence.\nThe President participated in a wreath-laying ceremony at the Yasser Arafat Mausoleum in Ramallah after which she was given a tour of the adjacent museum dedicated to Yasser Arafat.\nShe also visited the Church of the Nativity in Bethlehem.\nPresident Coleiro Preca gave a public lecture on tourism at peace at the University of Bethlehem.\nShe appealed to those present and to tourism stakeholders to lead by example, “to encourage dialogue, to nurture opportunities for friendship, to celebrate diversity, and to promote positive investments in peace around our world”.\nShe was then given a tour of the faculties of Bethlehem University, which is run by the De La Salle Brothers.", "comment_count": 5, "id": 2024}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 8.50am with PN statement\nThe teachers’ union has expressed fears that the introduction of 13 new subjects next year would result in more staff shortages, again accusing the government of lack of planning.\nMalta Union of Teachers president Marco Bonnici insisted on Thursday that with 13 new subjects in the coming scholastic year, the problem of an insufficient number of educators that persisted for years would only get worse.\n“If the government pushes forward with its campaign to get students to choose these new subjects, the MUT can foresee a situation where the Education Ministry will struggle to have all students covered with enough teachers,” he told the Times of Malta.\nAt present, he said, such a problem existed with regard to a number of subjects, namely the three core ones: Maltese, English and mathematics.\nMr Bonnici said the union had raised the staff shortage issue on several occasions, however, so far, “no formal discussions have been held”.\n“There are not enough educators to teach traditional subjects, let alone to cater for an additional 13 applied subjects being introduced next year. Despite this, the ministry is embarking on campaigns to attract students to these new subjects without stating who will be teaching them,” he pointed out.\nQuestions on the matter sent to the Education Ministry were not answered by the time of writing. \nThe union was also concerned that while there was “massive investment” in the labs and workshops to be used for the teaching of the 13 new subjects, a move aimed at encouraging more students to go for such options, others were becoming “second class in terms of resources”, Mr Bonnici remarked.\n“The MUT is highly concerned about the situation and is calling on the education authorities to take the necessary measures before the system collapses due to lack of human resources,” he added.\nAccording to circulars issued to educators by the ministry, education officers, together with MUT members at Church and independent schools, the University of Malta, the Malta College of Arts, Science and Technology and the Institute of Tourism Studies are in the process of finalising the first draft of the so-called Secondary Education Applied Certificate syllabi for nine of the subjects. Consultations on the development of the certificate programmes in maths, Maltese, English and science are also under way.\nIn recent years, the union often flagged the issue of an increasing shortage of teachers, urging the government to adequately address the problem. It has also often accused the government of getting projections wrong and miscalculating the number of educators needed to cover all lessons.\nThough calls for applications for teaching jobs were still being made after the start of the scholastic year in September, the Education Ministry had downplayed the problem, insisting there were only very few spaces that had yet to be filled when school doors opened. \nPN statement\nIn a statement, shadow minister Clyde Puli and MEP Francis Zammit Dimech said the government needed to immediately establish a national strategy to attract greater numbers of motivated candidates with a sound academic or professional background and pedagogical competencies to the teaching profession.Mr Puli said it was unacceptable that the government was introducing 13 additional applied subjects as of the next academic year without being sure of teachers' availability.\n\"This is unfair on schools, administrators, teachers and students who will have to face all the stress. This shows lack of long-term planning by the government in the field of education. The government is aware of the problem and there were already instances when the government had to make use of students for teaching purposes.\"\nDr Zammit Dimech meets teachers.Dr Zammit Dimech, a member of the EP's Committee on Education, who also tabled several proposals to a a report on the modernisation of education in Europe, said the government needed to take concrete actions to improve teacher status including providing more professional opportunities and improve working conditions by increasing teachers' remuneration and ensuring their safety and protection in schools.\nThe latter was of crucial importance in the light of a recent study by the union showing that 87.4% of respondents had experienced aggression in their schools.\nThe government should also provide teachers with support comprising mentoring programmes, peer-to-peer learning and the sharing of best practices.", "comment_count": 37, "id": 2025}, {"keywords": "", "author": "", "article_body": "The Nationalist Party said on Thursday that a report by the Auditor-General had confirmed its concerns about the way the Malta consulate in Algiers issued visas.\nIn a statement over the signature of Beppe Fenech Adami, shadow minister for national security and Carm Mifsud Bonnici, shadow minister for foreign affairs, the PN observed that owing to a lack of transparency, the Auditor-General could not be sure that money had not changed hands for the granted of visas to be hastened for certain people.\nThe PN said political responsibility needed to be shouldered because the findings of the report were worrying.\nThe report showed that 500 applicants for a visa were recommended for refusal by the police but they were still granted a visa by the consulate. \nFor a long time, Malta had been issuing Schengen visas which enabled people to come to Malta and then disappear in Europe. Of 3,696 Algerians granted a visa by the consulate, 2,846 had not returned to their country and there was no trace of them. This amounted to a threat to Malta's security and that of other countries, the PN said.  \nThere was no transparency and accountability in the way the visa process was handled, the audit investigation had found. \nThe report also confirmed that it was an unexplained decision by Castille in 2013 which led to the setting up the consulate, when the consul was the prime minister's cousin. \nThe Auditor-General had said that the system of vetting applicants for visas was inadequate. Action was therefore needed to establish responsibilities, the PN said. Action was also needed for legal and political responsibilities to be borne. \n ", "comment_count": 11, "id": 2026}, {"keywords": "", "author": "", "article_body": "Pupils, parents and teachers are to be consulted by the authorities on uniforms in state schools.\nThe Ministry of Education said a consultation among pupils in middle and secondary schools will be held next week.\nThe pupils will be asked to say, through a link, whether they prefer the traditional uniform or a tracksuit.\nPrimary school children will be consulted through focus groups.\nThe process will later be followed up with consultation among parents and teachers.\nThe ministry said that should tracksuits be chosen, they will be phased in gradually to avoid financial burdens on parents.\n ", "comment_count": 57, "id": 2027}, {"keywords": "", "author": "", "article_body": "A young man was acquitted of possessing illegal psychotropic drugs on Thursday after it turned out that a sachet which he threw away from a car contained paracetamol and not an illegal substance.\nNathan Agius, 24 of Qormi, had been a passenger on the back seat of a Mercedes in June 2014 when a police patrol spotted him throwing away a small sachet of white powder, which they suspected of being an illegal drug.\nHe was arrested and made a statement to the police before being arraigned and accused of possession of mephedrone and ecstasy, both illegal psychotropic drugs.\nDuring the proceedings his defence lawyers challenged the probatory value of the accused’s statement to the police since he was not assisted by a lawyer.\nMagistrate Natasha Galea Sciberras, on the basis of local and EU jurisprudence, declared the accused’s statement inadmissible as evidence against him.\nOnce this statement was discarded, all that was left was the testimony of a police constable who had seen the accused throw away the sachet.\nBut a court-appointed scientific expert reported that the powder inside that sachet contained paracetamol, a licit drug, leading the court to pronounce an acquittal.\nLawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 2, "id": 2028}, {"keywords": "", "author": "", "article_body": "A Maltese driver has been arrested in Sicily after 231kg of marijuana were found in his trailer.\nIt is estimated to have a street value of €1.5 million.  \nThe drug was found by sniffer dogs among frozen food items during a random search before the trailer was due to be driven onto the ferry to Malta. It was packed in 114 packages, perfectly sealed under vacuum.\nThe driver, 32, is being questioned by police in Ragusa. \nThe source of the drug is not yet known. ", "comment_count": 0, "id": 2029}, {"keywords": "", "author": "", "article_body": "Property developer Marco Gaffarena cannot force the co-owners of a Valletta property to honour a promise of sale agreement, a court ruled on Thursday.\nThe property, in Old Mint Street, has been at the heart of political controversy since 2015, when The Sunday Times of Malta revealed that the government paid €1.65 million for the share of the property Mr Gaffarena had at the time. \nMr Gaffarena had bought his share for a fraction of that price just weeks prior to the deal.\nThe co-owners held the remaining one-fourth undivided share of 36, Old Mint Street, Valletta, corner with St Patrick Street. It was set to be transferred to Mr Gaffarena for €68,134 in terms of a promise of sale signed on October 31, 2014.\nBut when The Sunday Times of Malta revealed that the property had been targeted by two expropriation orders, issued on January 22 and April 20, 2015, the co-sellers backtracked, refusing to proceed with the sale, which was set to be concluded by end of April 2016.\nThe court upheld the co-vendors’ argument that they could not be forced to sell property which “no longer belonged to them.”\nIn March 2018 a court had ruled that the Commissioner for Lands was wrong to only offer compensation to Mr Gaffarena and his wife, when the Old Mint property was jointly owned by a group of people.\n\"The Commissioner should have compensated each of the owners pro-rata,\" the court ruled. \"The government effectively acquired part of the property belonging to all its owners and only paid one owner for it.\"\nAn inquiry into the scandal, conducted by the Auditor General, found “collusion” between Land Department officials, Mark Gaffarena and Planning Parliamentary Secretary Michael Falzon, who subsequently resigned. The prime minister launched a court case seeking to nullify the deal.\nThe First Hall, Civil Court on Thursday upheld practically all the pleas put forward by the co-owners, declaring that conditions in the promise of sale had come into play, thus releasing the co-vendors from proceeding with the sale.\nThe words of the promise of sale were “clear, unequivocal and left no room for interpretation,” declared the court, presided over by Madam Justice Lorraine Schembri Orland, referring to one condition whereby the final sale was to be made subject to no expropriation order.\nOnce the property had been targeted by two expropriation orders, the resolutive clause came into effect.\nThe court also upheld the co-owners' argument that they could not grant peaceful possession over property that no longer belonged to them and that “they certainly could not be coerced to sell that which they no longer owned.”\nMoreover, the share to be transferred had never been precisely determined, the court observed, pointing out that the testimony of the two notaries involved in the transfer had “not at all been precise.”\nThe court said it found it difficult to believe Mr Gaffarena's testimony that he could not recall whether the share had been specified, whether notarial searches had been completed and whether the documents had been passed on to one of the notaries.\nIn the light of such evidence, the court rejected the applicants’ request.\nLawyers Peter Caruana Galizia and Eve Borg Costanzi assisted the respondents.", "comment_count": 0, "id": 2030}, {"keywords": "", "author": "", "article_body": "Updated 3.15pm\nMalta Financial Services Authority’s Vision 2021 has been launched, serving as a blueprint for what the authority described as its mission to “enhance its position as a forward-looking, proactive and trustworthy supervisory authority”.\nThe authority said it aims to safeguard the integrity of markets and maintaining stability within the financial sector.\nThe three-year strategy also articulates the authority’s approach to risk management, conduct, enforcement, and anti-money laundering (AML)/counter-financing of terrorism (CFT) supervision.\nThe MFSA has been rocked by a number of failures over the past few years, including the closure of Pilatus and operational problems at Satabank, as well as the collapse of Nemea Bank.\nHowever, chairman John Mamo vowed in his foreword to the 36-page document that the MFSA aimed to “be proactive in monitoring the trends in the financial market and in identifying potential risks or indicators of misconduct at an early stage”.\nMFSA CEO Joseph Cuschieri tackled the issue in his foreword, saying the MFSA acknowledged that “instances of misconduct by licensed entities have an impact on the integrity and stability of the financial market and public trust.\nIn his speech, he said that, given the challenges, the regulator could not shy away from making the necessary investment in people, technology and organisational structures, saying the MFSA was facing a \"race to the top\".\nThe MFSA is currently revisiting its governance structure to take into account certain concerns expressed by stakeholders, one of the main aspects of which is the introduction of a risk committee which will be responsible for the design, implementation and review of the authority’s risk management policies, while an audit committee will scrutinise the governance, risk management and internal control mechanisms in place. \nThe launch was also addressed by Prime Minister Joseph Muscat, who re-affirmed government support for the MFSA’s transformation and reform programme.\nParliamentary Secretary for Financial Services, Digital Economy and Innovation Silvio Schembri confirmed that a consultative body would be set up to serve as a forum for discussions between the government, the regulator and practitioners,  to better understand the difficulties and anticipate any developments on the international scenario.\n\"It is crucial to have the right mindset if we are to achieve this ambitious goal,\" he told the audience.\n\"Let's elevate it to an authority that is well ahead of its time.\"\n\nThe MFSA also published a consultation document outlining its FinTech strategy which includes the introduction of a ‘FinTech Regulatory Sandbox’ and a FinTech Innovation Hub.\nThe sandbox is a platform where start-ups and firms may explore and test their business concepts in a specially designed environment.\nThe authority also unveiled its corporate branding, including a new website which provides an enhanced user experience.\nCurrently the MFSA is responsible for 2,300 licensed entities.", "comment_count": 3, "id": 2031}, {"keywords": "", "author": "", "article_body": "More than 864 tons of waste have been collected by the Cleansing and Maintenance Division since the beginning of the year, division director general Ramon Deguara said on Thursday.\nHe was speaking during a visit by parliamentary secretary for public cleansing Deo Debattista to Paradise Bay, which is going to be cleaned by the division.\nREAD: Paradise Bay or plastic graveyard?\nMr Deguara said that more than 1,000 tons of waste per month were collected in 2018.\nDr Debattista said that an intensive effort was required to clean up Paradise Bay, since there was no access to machinery and all work had to be done manually.\nPrecautionary measures were taken to protect the health and safety of the division’s workers and the works would be completed in about seven days, he said.", "comment_count": 8, "id": 2032}, {"keywords": "", "author": "", "article_body": "The Chamber of Commerce has called for explanations about the concession being granted to the Corinthia Group for a major development in St George’s Bay.In a statement, the Chamber said it was seeking to ensure the amount paid was “reasonable and transparent” and that the value incorporated fair compensation for allowing a change of use for the concession.Times of Malta has reported that the international hotel chain will acquire a commercial concession worth €700 million for just €17 million, if draft deed negotiated by government is approved by Parliament.Corinthia is planning to build 100,000 square metres of commercial and residential real estate and offices, including high-rise blocks.The Chamber said that, given Corinthia’s track record in the hospitality industry, there would have been fewer questions asked had the project continued to be exclusively tied to tourism, rather than including residential blocks. “The placing of these new units on the market may potentially lead to distortions if, as reported, it eventually emerges that the investor has been granted favourable conditions in the process of renewing the concession of the land as well as in enabling the transfer of lease to third parties,” the Chamber said.“Besides, in the interest of sustainability, the Chamber is assuming that the relevant authorities are giving due consideration to all environmental concerns that this proposed project has raised.”The Chamber expressed disappointment that there had been no official communication about what the project would actually entail and urged authorities to clarify all aspects of the project to eliminate “unnecessary speculation and suspicion”. The Chamber said its principles on the transfer of public land remained unchanged from those expressed two years ago in relation to the negotiations with db Group over the Institute of Tourism Studies (ITS) site.Citing its comments at the time, the Chamber said: “The transfer of public land to private interest is often the subject of serious controversy and going forward, we believe that agreements and procedures must be – and be seen to be – above board and transparent. “People dealing in public land must act as if they were dealing with their own property. They must be made accountable for earning the full market value expected from the asset.”", "comment_count": 3, "id": 2033}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The third member of a thieving trio allegedly behind a violent robbery from a Qormi residence earlier in January was remanded in custody on Thursday following the same fate as the other two co-accused who were arraigned a day earlier.\nPatrick Mangion, from Valletta, who celebrated his 46th birthday on Wednesday, pleaded not guilty to committing the aggravated theft, holding the victim against her will, slightly injuring her, and carrying a knife without a police licence.\nHe was further charged as a relapser as well as with breaching earlier bail conditions.\nThe man’s arraignment was put off to Thursday since he had been taken to hospital after complaining of chest pains before he had been due to face court on Wednesday. He was released from hospital earlier on Thursday.\nThe man pleaded not guilty but was remanded in custody after a request for bail was turned down by the court.\nAnother request by defence lawyer Alfred Abela for the accused to be detained at the Forensic Unit at Mount Carmel was upheld by the court, presided over by magistrate Simone Grech.\nMark Anthony Cardona, 41, from Birkirkara and Ryan Briffa, 28, from Qormi, were remanded in custody on Wednesday after likewise pleading not guilty to their involvement in the robbery.\nInspectors Fabian Fleri, Lydon Zammit and Roderick Agius prosecuted.", "comment_count": 0, "id": 2034}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority has approved plans for a 12-storey extension to the Bay Street Hotel on land leased from the Augustinian Order in Paceville, backtracking on its intention to throw out the proposal.The application had been headed for rejection after the PA board indicated its opposition at a hearing in December, amid concerns over its impact on the Grade 2 scheduled Augustinian Priory and the St Rita Chapel.Board members had also highlighted the impact on residents - particularly as the project is within a residential buffer zone - and traffic generation, and the lack of a masterplan to guide development in Paceville.But at a hearing on Thursday, the board voted by seven to four to approve the application after project architect Paul Camilleri presented tweaks to address these concerns, while insisting the development was in line with local plan policy.Tables and chairs were dropped from the proposed public plaza and improvements made to a planned drop-off zone for buses and taxis, to reduce traffic concerns.Watch: ‘Paceville masterplan was dropped for commercial interests’ - KTP head\nThe architect argued that the St Rita Chapel itself constituted a buffer between the residential and commercial zones, and that residents would benefit from the hotel’s facilities. He also said the project’s impact would be much lower than that of others in the area, or than a hypothetical residential or office-space development on the same site.Although several board members rejected these arguments and reiterated the concerns raised in the December hearing, the architect’s submissions were ultimately enough to sway the board.The architect’s submissions were ultimately enough to sway the board\nVoting against were PA board chairman Vince Cassar, Environment and Resources Authority chairman Victor Axiak, NGO representative Annick Bonello and St Julian’s local councillor Edgar Montanaro. Government representative Clayton Bartolo and Opposition representative Marthese Portelli both voted in favour. The plans had previously come in for criticism from the Superintendence for Cultural Heritage as well as the Church Environment Commission, which was asked by Archbishop Charles Scicluna to look into the matter. Both expressed concern the hotel’s scale would dwarf the nearby priory and diminish its heritage value by further taking away from its original context. A separate application for the restoration of buildings’ façades and external areas was submitted last October. The PA case officer had originally played down these concerns, noting that the project would not impose any changes to the existing skyline, due to the surrounding buildings. The case officer also said the introduction of the public plaza at ground level would improve views of the historic building. Moreover, the design of the façade was said to “provide a fluid shape which allows the sun to penetrate to the ground floor”.The basis of the recommendation for approval was the height limitation adjustment policy for hotels, which allows hotels extra floors over and above the local plan’s height limits. The Augustinian Order, which leased the land for the development, has justified the move as a way of funding its religious, social and educational programmes.", "comment_count": 29, "id": 2035}, {"keywords": "", "author": "", "article_body": "Over 8,000 motorcycles were put onto the Maltese roads in the past three years, bringing the stock at the end of 2018 up to 27,329.\nWhereas in 2015, they only made up 5.5% of the vehicles on the road, the percentage has now nudged up to 7.1%, according to figures released on Thursday by the National Statistics Office.\nThe overall number of vehicles has been growing steadily over the years and the stock of licensed cars reached 385,326 by the end of last year, with 26,497 vehicles being added to the already congested roads. Like previous years, more used vehicles were registered than new ones.\nIn spite of the ever-growing network of charging points for electric cars, uptake by the public is still slow, with only 926 at the end of the year.\nHowever, there are over 2,800 vehicles that are hybrid, using either fuel or electric power, or LPG.", "comment_count": 15, "id": 2036}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Updated 4pm with family reaction\nPrime Minister Joseph Muscat said he is willing to drop libel proceedings against Daphne Caruana Galizia if the late journalist’s heirs accepted the conclusions of the Egrant inquiry.\nTestifying in court in a libel suit he had filed against Ms Caruana Galizia, the Prime Minister said he rarely filed libels because he accepted that in his position he was  subject to criticism.\n\"But in this case the lie was so large, involving my wife and family, that the political stability of the country were being affected.”\nDescribing the allegations as a “massive lie”, he explained that he had immediately gone to the magistrate and asked for an inquiry.\n“I was frustrated that it took so long but the magistrate made a thorough job, speaking to hundreds,” adding that whoever did not “accept the results of the magistrate’s decision did not want to accept the truth.\nRead: The Egrant saga so far\n“I expect and demand a clear declaration from the other party that they were wrong, I am ready to drop the libel cases,” the PM continued.\nIn view of this declaration, the Prime Minister’s lawyer Pawlu Lia asked the respondents, to make their position clear.\nDr Joseph Zammit Maempel, assisting the Caruana Galizia family, rebutted that the PM was basing himself on a report that nobody had seen, prompting Dr Muscat to state that he was basing himself “on the conclusion of the inquiry which is public. The magistrate gave no hint of doubt.”\nAt this point, magistrate Francesco Depasquale asked Dr Zammit Maempel whether he needed time to regulate his position, with the lawyer replying he would have to consult his clients.Someone targeted us specifically and in a cowardly manner\n“My position is clear and emerges from what other people are saying. There is nothing to these allegations. 477 witnesses were spoken to, several rogatory letters were sent to foreign countries. Several details were incorrect especially were given by (former Pilatus Bank employee) Maria Efimova. None of the documents quoted were found to exist. They are false documents made by someone who is not identified yet and this was confirmed by several foreign experts.\nRead: 'I was always hoping that the libel cases would be withdrawn' - Peter Caruana Galizia says\n“It was a moment of great crisis. The country was on the brink of instability. This thing will hound me, because whenever someone googles my name or my wife’s name this will come up. This is why I’m filing this libel.”\nQuoting from the conclusions of the inquiry he recalled that there were numerous contradictions between testimony given by Ms Caruana Galizia and Ms Efimova.\n“Personally, I have no idea if Caruana Galizia came up with these allegations herself or was fed them by someone else or something else. I’m not going to speculate. The fact is that she made them her own, I don’t know if she checked them,” adding that all legal advice had been not to publish the inquiry.\n“I am not a lawyer but I understand that if someone invents a story to get someone in trouble it is a criminal act. I don’t know who did it yet, what I know is that the victims are myself and my wife. Someone targeted us specifically and in a cowardly manner.\n“I’m not hunting for the person responsible but I will be content if it is accepted that it was a lie.”\n\n\n\nQuoting at length from the inquiry conclusion, he said “I’m sorry that I’m being emotional but this affected my life. Politics require a thick skin but I’ve been in frontline politics for a long time and have only filed another two libels.\n“Were I to go through the blog and sue for every libelous thing I could set up camp in this courtroom,” the Prime Minister said adding: “My level of tolerance is very high but this is unacceptable.”\n“Honestly, I cannot understand a situation where that which I requested in the beginning is not accepted. I understand the political and international context but this isn’t a question of opinion any more but a question of fact. We are ready to take a step back if the allegations are withdrawn,” he insisted.\nIn a one-liner reaction to the Prime Minister's statement, the Caruana Galizia family said: \"We are not conceding to extortion from our public servants\".\nThe case continues in March.", "comment_count": 0, "id": 2037}, {"keywords": "", "author": "", "article_body": "A 44-year-old man was admitted to hospital on Thursday morning after being involved in a crash between three vehicles in Żebbuġ.\nThe man, from Gudja, was driving a Honda on Mdina Road at around 9.30am.\nHe was rushed to Mater Dei Hospital but his condition is not yet known.\nTraffic accident on Mdina Road, Żebbuġ. Photo: Daniel Cilia\nThe other vehicles involved in the car crash included an Audi TT4 driven by a 35-year-old from Birkirkara and a truck driven by an Albanian man.\nThe police are investigating.\n ", "comment_count": 0, "id": 2038}, {"keywords": "", "author": "Claire Caruana", "article_body": "The majority of bacterial meningitis cases in the past three years occurred in adults despite the illness often being associated with young children, Times of Malta has learnt.\nData on the number of bacterial meningitis cases since 2016, supplied to Times of Malta by the Health Ministry, show that of the 34 cases reported to the authorities, 21 involved patients over the age of 18. There were 11 patients who were younger than five years of age when they contracted the illness and another two aged between six and 17.\nRead: What you can do to prevent meningitis\nThree patients died of the illness in the three years under review – a four-year-old boy earlier this month, a 13-month-old baby in 2017 and a 19-year-old in 2016.\n\nInformation on the less-serious viral meningitis was not supplied by the ministry.\nTimes of Malta sought the information following reports of children being rushed to hospital with the illness in recent weeks, including the boy who died of a form of the illness the authorities said was “very rare”.\nSome days later, a new-born baby was admitted to Mater Dei Hospital after developing signs of the illness.\nBacterial meningitis is the most dangerous\nAccording to the health authorities, meningitis could be caused by many different types of bacteria and the kind contracted by the baby only affected infants in the first three months of their life.\nDoctors who spoke to Times of Malta last week echoed the health authorities’ reactions, insisting the two cases were in no way connected adding the public’s fear of an outbreak was the result of the two cases being reported around the same time.\nRead: Meningitis – everything you need to know\nAccording to paediatric cardiologist Victor Grech, the common types of meningitis are viral and bacterial.\nViral meningitis usually leads to fever, a headache, discomfort or pain to the eyes due to light exposure and neck stiffness. No treatment is usually necessary except supportive: treating the pain and drinking lots of fluids.\nOn the other hand, bacterial meningitis is the most dangerous as it could be fatal or leave permanent consequences such as deafness. Such forms are mainly haemophilus influenza B (HIB), which is covered by the five-in-one vaccine given to infants at the age of two, three and four months; pneumococcus, which also causes respiratory disease such as pneumonia, and meningitis and meningococcus.\nHealth Minister Chris Fearne said in Parliament on Wednesday the Health Department will later this year start providing the pneumoccal conjugated meningitis vaccine to children free of charge.", "comment_count": 0, "id": 2039}, {"keywords": "", "author": "", "article_body": "No one was injured when an armed robber entered a shop in St Paul’s Bay and demanded money from the cashier.\nThe police said the incident happened in Triq il-Mosta on Wednesday at 9.30pm.\nThe shop was being manned by a 62-year-old woman from St Paul’s Bay.\nAn inquiry is being held and the police are investigating.", "comment_count": 0, "id": 2040}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A highly qualified engineer was engaged by Porsche to offer his expertise in the wake of the 2015 Paqpaqli ghall-Istrina car crash, with the car manufacturer ultimately footing the bill for his work.\nNicholas Durisek, a PhD expert working for Texas-based Dynamics Analysis Group LLC, revealed this when testifying at length via video conference in a two-hour long hearing on Wednesday evening in the compilation of evidence before the Magistrates’ Courts.\nThe questioning was conducted mainly by parte civile lawyer Michael Grech.\nDr Durisek explained that he came to Malta on October 13, 2015, for three days, after being contacted by Jeffrey Gates, an attorney for Porsche, and hired to “work with the Maltese police on this crash”. On arrival, he met the court-appointed expert Martin Bajada and the Police Commissioner.\nA specialist in crash reconstruction and failure analysis, as well as vehicle dynamics and testing, Dr Durisek inspected both the scene of the accident at the Ħal Farruġ runway, as well as the Porsche Spyder 918 hypercar, owned by Paul Bailey, which had crashed into spectators.\nAll the data – from photos and measurements to a reconstructed 3D model of the vehicle – was ultimately handed over to Porsche.\nThis information was seized upon by Mr Bailey’s lawyers during their cross-examination of the witness, who confirmed that he had been contacted by Dr Gates, and that it was Porsche who had ultimately footed the bill for his engagement.\nAsked by the lawyer whether he was aware that Mr Gates was general counsel worldwide for products liability, Dr Durisek replied in the negative.\n“Is it normal that when a Porsche has an accident so many people from all parts of the world fly in, accompanied by the Porsche general counsel on product liability?” lawyer Giannella de Marco questioned.\n“It is not uncommon in the work I do for one or more Porsche engineers to be present,” Dr Durisek replied, explaining that the number could vary from five to 10 and clarifying that different experts had been working on the same incident – but not together.\n“Porsche engineers were collecting data stored in the system. I collected different data,” the expert said, explaining how he had followed tyre marks at the site of the incident to reconstruct the dynamics of the crash, besides inspecting the crashed Porsche at a dealer’s shed in Gżira.\nThe witness said he had given “everything to Dr Gates,” or possibly “to the assistant at his office,” further stating that he had not issued a written report.\n“Nothing in writing?” was Dr de Marco’s next question, answered with an outright “no”.\nAsked whether this was the norm, Dr Durisek said that this was “almost always” the case, providing a comprehensive report only if asked to do so later.\nIn this case, the expert had handed over all data, namely photos and measurements, to the Porsche general attorney, reporting verbally to him “within some two months” of the visit, during an independent conversation during which he had said that he “had found no fault with the car”.\nAn intervention by presiding magistrate Aaron Bugeja, seeking clarification on this matter, prompted the witness to confirm that he had also given the collected data to Dr Bajada and another local court expert (Mr Tanti) and also to Dr Gates from Porsche, but that no written report had been issued.\nFurther questions by the defence revealed that the physical evidence collected by the expert had been preserved for his company. “I still retain that. For my reference.”\nQuestions about the witness’s awareness of other Porsche accidents in the US and in Sheffield, UK were met with a negative reply.\nTurning to the issue of vehicle safety recalls for the Porsche Spyder 918 model, obviously “costing Porsche a lot of money”, Dr de Marco asked whether Dr Durisek was aware of them, pointing out that her client’s car had been targeted by such a recall since the Paqpaqli incident.\nDr de Marco said that such a recall had been to replace “the connecting shafts of the longitudinal and transverse control arms”.\n“Recalls by Porsche are outside my knowledge basis,” said Dr Durisek, also stating “I don’t have any influence on these recalls”.\nAnswering another direct question by the court, the expert explained that he did independent research, “not for Porsche”, clarifying that he would charge Porsche for his time.\n“Did Porsche ever outline its conflict of interest in this case? Was this ever mentioned to the court experts or even the Court, because Porsche could be responsible for damages caused?” Dr de Marco pressed on.\n“I wasn’t involved in that kind of conversation. There was no such statement in my presence,” the witness replied.\nEarlier on, the witness had been asked whether he recalled the presence of “two local lawyers, a male and a female” during his local inspection of the Porsche, when Mr Bailey’s defence lawyers were not.\n“There may have been,” came the reply.\nThe case continues in February.\nSuperintendent Josric Mifsud together with Inspectors Silvio Magro and Hubert Cini prosecuted. Lawyer Stephen Tonna Lowell also assisted Mr Bailey. Lawyer Stefano Filletti was counsel to Brian Gatt and Julian Manara.\nLawyers Joe Giglio and Anna Mifsud Bonnici are counsel to Tonio Darmanin. Lawyer Arthur Azzopardi is defence counsel for Ian Cilia Pisani, Kevin Perry and Chris Sultana. Other members of the Paqpaqli team are being assisted by Dr Michael Sciriha, Dr Raphael Fenech Adami and Dr Albert Zerafa.\nLawyers Jason Azzopardi, Franco Debono, Amadeus Cachia, Roberto Montalto, Shazoo Ghaznavi, Alessia Zammit Mackeon and Reuben Farrugia are among the lawyers appearing parte civile for the victims.", "comment_count": 0, "id": 2041}, {"keywords": "", "author": "Ivan Martin", "article_body": "Neville Gafà has still not been given a new government contract, more than a month after deputy Prime Minister Chris Fearne terminated his contract with the Foundation for Medical Services.\nDespite not having a contract, Neville Gafà has been reporting to the Office of the Prime Minister.\nPrime Minister Joseph Muscat last month denied the contract had been terminated, insisting the official was being “transferred”.\nPrinciple Permanent Secretary Mario Cutajar said he had “no visibility of any engagement for Mr Gafà” when asked about his designation and in which entity he was employed.\nAccording to sources, Mr Gafà is expected to be engaged with a government entity any day now. Despite not having a contract, Mr Gafà has been reporting for work at the Office of the Prime Minister.\nHis previous job as senior manager with the Foundation for Medical Services on a position of trust basis was terminated shortly after Times of Malta reported he had met with a Libyan militia leader during a trip to Tripoli in December. \nMr Gafà insisted he had “bumped into [the militia leader] on the street”.\nHe also said that, during the same visit, he met with Libyan government ministers in a personal capacity and not as a “special envoy of the Prime Minister”, as reported in official communications from the Tripoli government.\nThe head of the Foundation for Medical Services, Carmen Ciantar, is on record as saying she had been directed by the chief of staff at the Health Ministry to terminate Mr Gafà’s employment as per Mr Fearne’s wishes.\nDr Muscat, however, had stood by Mr Gafà. He had said Mr Gafà had not travelled to Libya in an official capacity, adding it was, however, prudent to meet as many different people as possible in a country like Libya. Mr Gafà, he added, was doing “very good work”.\nThe sources that spoke to Times of Malta said “more than one” Cabinet minister had been approached over the past few weeks on the possibility of engaging Mr Gafà in an entity falling under their political responsibility.\nIn 2016, when Mr Gafà served as an official at the Health Ministry, he had been accused by a whistleblower of having masterminded a medical visa racket. \nHe had been investigated for allegedly charging Libyans €2,500 a month to secure medical visas, treatment and accommodation, along with an additional payment of €100. The police found no proof of any wrongdoing.", "comment_count": 16, "id": 2042}, {"keywords": "", "author": "", "article_body": "These are the main stories in Thursday’s newspapers.\nTimes of Malta says three years after losing their only daughter in a traffic accident, Josephine and Pippo Boni got another horrific shock last week when they discovered she had been buried in a body bag placed inside the coffin. In another story, the newspaper says an inquiry board set up last July to investigate allegations of “administrative and operational aspects” at the Malta College of Arts, Science and Technology has been given a second extension.\nThe Malta Independent says that Maltese Schengen visas for Algerians have been slapped by the National Audit Office as one in four recipients never returned home.\nL-Orizzont says the General Workers Union is in favour of more measures to support working parents.\nIn-Nazzjon says the Nationalist Party’s executive council has expressed unanimous support for party leader Adrian Delia.", "comment_count": 0, "id": 2043}, {"keywords": "", "author": "", "article_body": "President of Malta Marie-Louise Coleiro Preca held bilateral talks with her Israeli counterpart Reuven Rivlin at the Presidential Palace in Jerusalem.\nBoth presidents spoke of the potential to transform Malta and Israel’s excellent bilateral relations into tangible collaborations, where both countries could collaborate in various sectors including commercial, cultural and tourism.\n“We need to engage on as many levels as possible, even through our institutions, and even at civil society level”, President Coleiro Preca said, adding that following a meeting which was held with the Malki Foundation, which empowered people with disability, it was agreed that a collaboration with Malta would be looked into in the near future.\nThe President said that such connections would definitely lead to sustainable friendships between the two peoples, “and when one establishes friendship, then the issue of respect comes second to nature”. The President said that if there was respect, then there was much more room for positive peace.\nPresident Coleiro Preca also said that the relationship between the peoples of Malta and Israel was built upon a shared Mediterranean identity adding that “as nations from this important region of the world, we must be the guardians of hope and promoters of human rights, for the benefit of both present and future generations”.\nDuring her official visit to Israel, the President had a number of other meetings and discussed possibilities of collaboration within the aviation industry.\nShe participated in a wreath-laying ceremony at the Yad Vashem World Holocaust Center in Jerusalem, laying a wreath at the Hall of Remembrance.\nThe wreath was laid on a stone slab under which the ashes of the Holocaust victims from the six extermination camps are buried.\nPresident Coleiro Preca said that the acknowledgement of the suffering which the Holocaust represented had to be translated into a firm commitment to promote and to prioritise the dignity and the wellbeing of all people who were experiencing precarity, vulnerability, discrimination and abuse.\nAt present, Yad Vashem has two Memoranda of Understanding in place with the Ministry for Education and Employment and with the President’s Foundation for the Wellbeing of Society.\nThrough the MoU with the President’s Foundation, Yad Vashem representatives visit Malta every January to participate actively in the activities organised by the Foundation on the occasion of World Holocaust Remembrance Day, which also include school visits.\nThe President also met the Maltese community in the Holy Land.", "comment_count": 5, "id": 2044}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Three years after losing their only daughter in a traffic accident, Josephine and Pippo Boni got another horrific shock last week when they discovered she had been buried in a body bag placed inside the coffin.\nJosephine Boni stands near the shrine commemorating her daughter, Johanna, who was crushed to death by a cement mixer in Naxxar three years ago while riding her motorcycle (foreground) to work.\nThe parents only discovered this by chance, prior to the burial of Johanna Boni’s grandfather who was to be interred in the same grave at the Mosta cemetery.\n“I cannot even describe how disgusted I was at seeing my daughter in a plastic bag. You wouldn’t even treat an animal like that. And the clothes I had given them to dress her in were stuffed in a corner of the coffin. My husband and I cannot sleep at night. We keep seeing that horrible sight over and over again,” a distraught Ms Boni told Times of Malta.\nJohanna Boni was crushed to death by a cement mixer in Labour Avenue, Naxxar on January 5, 2016. The 27-year-old was riding her Kawasaki ER6N to work.\n“Now we know why they advised us not to look into the coffin on the day of the funeral. We were told they had dressed up the body with the red dress we had purchased for Johanna and we also gave them a necklace and a pair of shoes but even these were placed in the corners of the coffin,” she continued.\nWatch: Parents feel 'abandoned' one year after Johanna's death\nMs Boni, a Maltese national married to a Sicilian man, said her father passed away recently and space was needed in the family grave.\nThe intention was to clear the coffins but the burial assistants refused to open the bag as the body had not yet decomposed. She said she could not believe her eyes when they opened the coffin and realised her daughter had been buried in a plastic bag.\nWe keep seeing that horrible sight over and over\n“It’s just a never-ending saga. We never found Johanna’s smartphone, which went missing at the site of the accident.\n“We would have loved to see the images, videos and messages it contained. We had to plead for months to be given the clothes she was wearing on the day of the accident and now this. It’s just one big odyssey,” the distressed mother said, fighting hard to hold back tears.\nLegal practitioners said that, according to the Code of Police Laws, “every dead body shall be buried with such covering as decorum and decency required”.\nWatch: A grieving family still waiting for closure, two years on\nThe Mosta cemetery where Johanna Boni was buried. Photo: Jonathan Borg\nA spokeswoman for the Health Ministry, which is directly responsible for the Mater Dei Hospital mortuary and for cemeteries, said the responsibility in this case was the funeral director’s.\n“When a person dies outside Mater Dei, the hospital is not responsible for the body of the deceased,” she said.\n“In these instances, the funeral organisers shoulder the responsibility to shroud the body.”\nThe Bonis’ experience is similar to that of the relatives of German teenager Mike Mansholt who died while hiking in Dingli Cliffs in 2016 and his body was returned home with most of the organs missing.\nA medical examination in Germany found that his heart, brain, neck organs, lungs, liver, pancreas, adrenal glands, the right kidney, the bladder, the stomach and the small intestine were missing.\nNo one assumed responsibility.", "comment_count": 122, "id": 2045}, {"keywords": "", "author": "", "article_body": "The Executive of the Nationalist Party said on Wednesday that its members had unanimously declared their confidence and support to party leader Adrian Delia.\nIn a brief statement, the executive said that at a meeting on Wednesday, the members also condemned 'coordinated and malicious' attacks made against him and the party.\nThe statement gave no details of what was discussed at the meeting.  \nThe meeting was held two days after a fiery meeting of the PN parliamentary group during which Dr Delia reportedly faced an ‘onslaught’ but none of those present openly called for his resignation.\nA Nationalist MP who spoke to Times of Malta on condition of anonymity had words of praise for  the manner how Dr Delia handled the ‘onslaught’ and allowed everyone to have their say during the meeting, which lasted about four-and-a-half hours, ending at 10.30pm.\n“There was lots of criticism. People expressed their doubts about him. In my opinion, he provided convincing replies to all the matters raised…He is not my cup of tea. Before this meeting, I was 95% against him. After the meeting, I would say I am 60% against him,” the MP admitted.\nDr Delia is going through separation proceedings with his estranged wife, who levelled domestic violence accusations against him in court last month.\nThe woes facing the PN leader also involve tax issues and an investigation on matters dating back years when he worked as a lawyer.\nThe PN's administrative Council on January 16 also expressed its unanimous support for Dr Delia, and in similar language to that used on Wednesday,  condemned what it described as \"coordinated and malicious attacks being made against Dr Delia and the party.\"", "comment_count": 22, "id": 2046}, {"keywords": "", "author": "", "article_body": "One would undoubtedly feel extremely lucky to win the Super 5 jackpot, but is that feeling tarnished somewhat when the prize money is shared by 76 other ticket holders?\nMaltco said on Wednesday that 77 players had won this week's jackpot, possibly the biggest ever number of winners.\nThey will each get €4,545, a far cry from a potential prize of €350,000.\nThe winning numbers were 5 • 20 • 10 • 25 • 15 -- all numbers which can be divided by five. \nInitial reactions - better not to have won at all?\nReactions to the unusual draw were mixed.\nA man laconically commented on The Salott Facebook page: ‘Imagine handing in your notice after winning Super 5, only to find out it has been won by another 76’.\nAnother said it was better not to win at all, he would not be able to buy a car with this reduced prize. \nIn response, another said he would not mind if any of the disappointed winners handed their winnings to him.\nMany said he was sheer bad luck, but clearly many people knew the x5 table – as the winning numbers showed. \nOne man said he could not believe so many had won. He thought it was a joke. A woman wondered how many of those who won had jumped for joy, not knowing the prize was shared by so many. \nOnly one woman said she would still have been happy to have won.\nNext week's jackpot is €200,000.", "comment_count": 27, "id": 2047}, {"keywords": "", "author": "", "article_body": "A baby who was admitted to hospital on Sunday suffering septicaemia has passed away, the Ministry of Health said on Wednesday in a single-sentence statement.\nThe eight-month girl was the third child admitted with a bacterial infection in two weeks.\nThe health authorities had stressed on Monday however that there was no epidemic in the community or at hospitals in Malta and this case had nothing to do with meningitis reports.\nMedical Director Walter Busuttil said that two of the three cases – which have already been reported by the media – had unrelated bacterial meningitis.\nOne of the two, a four-year-old boy, passed away, while the condition of a three-week-old baby who was admitted to hospital last week, is improving.\nThe two cases were caused by two different types of bacterial meningitis.  \nAsked to explain three bacterial infections in two weeks, Superintendent of Public Health Charmaine Gauci said on Monday that this was a matter of coincidence and they were not related in any manner.  ", "comment_count": 0, "id": 2048}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Siġġiewi residents hoping that a petrol station adjacent to a 16th-century chapel in the main square would be relocated outside the village core were disappointed following a decision by the Planning Authority.\nAccording to a new fuel stations policy, introduced in 2015, petrol stations in urban areas were deemed to be incompatible with the surrounding context and had to be relocated to areas outside village cores.\nResidents told the Times of Malta that since Mallia Petrol Station, situated on a kerbside adjacent to the 1942 St Mary’s chapel, in the middle of Pjazza San Nikola, was one of the stations in conflict with the new policy, they were expecting that an application for its refurbishment would be accepted only if it was moved to a place outside the village core.\n“To our big surprise, it seems that this will not happen at all, despite the clear policy.  Somehow, the Planning Authority accepted that our piazza is to be excavated to put in new fuel tanks and the petrol station can stay in place,” a frustrated resident told this newspaper.\nThe local council gave its go ahead for the project without consulting us\n“To add insult to injury, the architect working for this green light was a former Siġġiewi mayor, while the Siġġiewi local council gave its go ahead for the project without consulting us,” another resident complained.\nIn 2015, architect Robert Musumeci, also an OPM consultant, filed an application on behalf of his clients to refurbish the petrol station, which has been in the same place for decades.\nThe application was originally refused by the planning board citing various reasons, particularly, that the application went against the new fuel stations policy to relocate outside urban zones and due to its proximity to the historical chapel. \nHowever, the PA dropped its objections following a letter from the local council in favour of the application.\nWriting following a discussion on the application, the Siġġiewi council said that it “deems that the service offered by the station is essential to the Siġġiewi community and confirms the need that its fuel tanks are up-graded due to the receipt of various complaints on fumes from residents living close by”.\nIn its letter, the council underlined that it understood that for the time being, a relocation of this station was not possible as no alternative zone outside the village core was identified or available.\nFollowing this letter, the PA revised its decision and granted its green light for the project to take place.\nivan.camilleri@timesofmalta.com", "comment_count": 18, "id": 2049}, {"keywords": "", "author": "", "article_body": "Reports of children abusing their parents or carers are on the rise, the operations director of the Appoġġ agency, Ruth Sciberras, told a parliamentary committee on Wednesday. \nShe attributed the increase to the fact that many of the children would themselves have witnessed abusive behaviour in families. However there was no necessary link between the witnessing of domestic violence and the committing of domestic violence.\nShe said the rise in reports could also be partly attributed to increased awareness arising from the provision of services relating to domestic violence.\n100 such cases had been identified by Appoġġ to serve as the focus of expert research into the problem.\nThe comments were made as the Family Affairs Committee discussed abusive behaviour by children on their parents or other adults.\nMaria Mangion, who leads the domestic violence services offered by Appoġġ, said that most parents who had suffered abuse at the hands of their children were between the ages of 30 and 45. Children generally abused the parent of the opposite sex, with most cases involving boys who abused their mothers.\nThe reported abuse was either emotional, psychological, or physical, with no incidents of sexual violence included in the cases under examination, she said.\nHowever, social taboos surrounding domestic violence in general could be responsible for the lack of reports of sexual violence, and for the underreporting of domestic violence committed by children.\nMs Mangion said that parents often feared correcting their children’s behaviour, or were unable to do so.\nShe emphasised the importance of setting boundaries for children from birth, pointing out that children were becoming increasingly conscious of their power to influence adults, and often tested these boundaries in order to learn how best to get what they wanted.\nReferring to the approach taken by the positive parenting course offered by the Foundation for Social Welfare Services, she said that consequences for disobedience or improper behaviour should reflect the nature of the action committed.\nShe also pointed to the involvement of children in the setting of their own boundaries - such as by allowing them to choose when to play and when to do their homework - as a key way in which to get them to behave.\nMs Sciberras said Appoġġ aims to help both the victims and the perpetrators of domestic violence.  \nThe agency kept itself abreast of new behavioural issues such as addiction to the internet.\nThe agency now had social workers on call 24 hours a day to respond to reports made through its helpline or from police stations.\n ", "comment_count": 39, "id": 2050}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Gozo Ministry is still considering at least one alternative to the recently-published design for the proposed Marsalforn breakwater, a spokesman has said.\nThe ministry released designs earlier this month for two new breakwaters all but enclosing the mouth of the bay, with a 200-metre-long arm at Santa Maria point and another 170-metre-long protrusion from Għar Qawqla.\nIt also issued calls for two tenders for studies relating to the project, one for an environmental impact assessment and one for geotechnical investigations.\nThe first tender refers to plans corresponding to the published designs but the second is about a different plan for two much smaller breakwater arms: 150 metres long at Santa Maria point and 100 metres at Il-Menqa, with a much wider gap between them. This plan is also dated earlier than the published designs, August instead of October 2018.\nThe second tender, which refers to the smaller breakwater arms, was pulled from the government e-Tenders website days after it was issued and remained unavailable at the time of writing.\nNevertheless, a Gozo Ministry spokesman confirmed the different options were still under consideration and that it was the studies that would guide the final decision.\nHe could not explain why the second tender was no longer available, saying this was a technical problem outside the ministry’s remit. Nor could he say why the two tenders referred to different plans, suggesting that different studies were being commissioned for different proposals.\nAs recently as Monday, Gozo Minister Justyne Caruana said in response to a parliamentary question that the two tenders had been published on the government website and that the process was open. \nThe published designs, featuring the longer breakwater arms, have provoked a mixed public reaction, with residents and business owners expressing concerns over whether seawater circulation will be hindered by the narrow opening to the sea.\nFears were also raised that the project could lay the groundwork for part of the bay to be converted into a private yacht marina.\nPlans for coastal defences at Marsalforn have been mooted since the destruction of an old breakwater dating back to the 1960s. The bay is plagued by strong waves during stormy weather, flooding the promenade and the bars and restaurants that line it.\nThe new proposal supersedes 2011 plans by the last Nationalist administration, which incorporated the construction of a submerged breakwater, beach nourishment and the building of a seawall.\nThe ministry’s plans also include an upgrade of the promenade, an extension of the sandy beach and the rebuilding of the road from Victoria to Marsalforn.", "comment_count": 13, "id": 2051}, {"keywords": "", "author": "Claire Caruana", "article_body": "The environment watchdog has issued just three fines for breaches of waste collection permit conditions so far despite various reports of shortcomings by residents.\nA spokesman for the Environment and Resources Authority earlier this month said operators of refuse collection vehicles had been fined following the introduction of new recycling rules at the end of last year. When pressed and asked for detailed information, the spokesman said three fines had been imposed so far for “infringement of their permit conditions”.\nHowever, he did not specify what the conditions breached consisted of and neither did he say whether the fines were issued to the same operators or to different ones.\nQuestions to the government on whether the Environment Ministry deemed the number of fines a realistic reflection of the prevailing situation remained unanswered by the time of writing.\nThe Nationalist Party’s environment spokesman, Jason Azzopardi, said that while residents were being fined for not abiding by the rules, the figures suggested the same could not be said for the operators who were being allowed to operate with impunity. \nI get the impression this is all organised disorganisation as a result of lack of planning\nHe told Times of Malta that residents across the country were complaining of operators mixing waste bags on a regular basis.\n“I get the impression this is all organised disorganisation as a result of lack of planning and consultation and that’s a pity because people’s efforts are being flushed down the drain,” Dr Azzopardi said.\nSince the new system was introduced, residents from various localities were left fuming after witnessing refuse collectors mixing the white (organic) and black (mixed) garbage bags, expressing concern that their waste separation efforts were all in vain.\nSome residents had even resorted to posting videos of such a practice on social media, expressing disbelief that this was still being allowed despite stepped up efforts and campaigns for the implementation of the new rules.\nThe government unveiled a new waste separation and recycling scheme in October as part of efforts to address mounting waste problems. Regulations came into force after weeks of extensive campaigns warning of harsh fines for those who did not abide by the new rules.\nFollowing a month-long information period, Environment Minister José Herrera had said a “grace period” would be in force until the end of the year to ensure residents were up to speed with the new garbage collection system.\nIn the run-up to the launch of the scheme, serious doubts had been raised on how offenders who breached waste separation regulations would be identified, with the Opposition saying the regulations were “amateurish”.", "comment_count": 8, "id": 2052}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government has been forking out almost a quarter of a million euros every year in payments to credit rating agencies, it has emerged. According to figures tabled in parliament by Finance Minister Edward Scicluna on Wednesday afternoon, in reply to a question by PN MP Jason Azzopardi, in 2018, the government paid such agencies a total €237,502.The figure is slightly lower than that of the previous two years, when the government had forked out €248,697 and €243,883 in such payments. The data supplied, which dates back to 2013, also shows that the Labour government has been paying much more in recent years then it did when it first took to office six years ago. In fact, in 2013, the government had only paid €76,119 to credit rating agencies, up to €126,576 in the following year. The tabled information did not include details on the names of the agencies that the government had paid. According to Prof. Scicluna, Malta had been making such payments since 2000.\n\nIn recent years, the government has used the ratings by a number of such agencies, including those by world-renowned agencies like Fitch Ratings, DBRS, Moody’s and Standard and Poors, when speaking about Malta’s booming economy.Credit rating agencies are independent companies that assign ratings that reflect the ability of a debtor to pay back debt. Agencies rate countries as well as private firms. Rating are either solicited or unsolicited, with agencies initiating them themselves. ", "comment_count": 55, "id": 2053}, {"keywords": "", "author": "", "article_body": "The Auditor General's office has been unable to draw conclusions following allegations over the manner how the Maltese consulate issued visas in Algiers, but it found a \"less than optimal\" system for vetting applicants.\nThe Public Accounts Committee asked the Auditor General to investigate the matter in November 2015, after an Algerian travel agent had alleged that irregular payments were made by visa applicants for preferential treatment. No evidence was provided in support of these claims and following referral to the Algerian Police by the travel agent, nothing illegal was established. The alleged wrongdoing did not include the consul.\nREAD: Algeria 'visa scam': Beppe Fenech Adami insists on getting an explanation\nThe audit office investigation covered the period between March 2014 and September 2015. During this period, 14,640 applications were received, of which 6,779 were issued a visa while 7,589 were refused. 99.5% of applications were decided within the 15 days stipulated in the Visa Code.\n\"Notwithstanding this, there was no visibility over the process beyond the point when the Consul decides to issue or refuse a visa, at which stage third parties are involved. This heightened the risk of wrongdoing, precluding the National Audit Office from establishing whether the issuance of visas was intentionally prolonged to elicit payments for hastening thereof,\" the Audit Office said.\nIt said that the setting within which the consulate operated itself gave rise to allegations. The consulate operated from the same premises as VFS,the consulate’s external service provider, blurring the distinction between the two from the perspective of applicants.\nREAD: PN asks auditor to probe Algerian visas\nAggravating matters were the difficulties encountered by prospective applicants when seeking to schedule appointments with the VFS. Gaps in the screening process, attributed by the consul to a lack of resources, also resulted in \"a less than optimal system\" of vetting applicants.\nAnother factor was the poor contract management of the VFS by the consulate, with various contractual obligations not adhered to, with no consequence.\n\"The extent to which this and other shortcomings could be attributed to the lack of experience of the consul is debatable, with the language-related issues identified by this Office compounding matters. The NAO also acknowledgesthe possible effect that the high refusal rate may have had on agents and other third parties, which rate was deemed significant when compared to that of other representations in Algeria.\"\nDuring the period reviewed, arrivals from Algeria to Malta and departures from Malta to Algeria amounted to 5,083 and 2,664, respectively. Of the 5,083 arrivals and 2,664 departures, 3,696 and 882, respectively, travelled on the basis of a visa issued by the Consulate.\nThe NAO established that for every four arrivals presenting a visa issued by the consulate, there was one departure. At least 2,846 of the 3,696 arrivals did not have a corresponding departure. Of the 882 departures, in 32 instances, nocorresponding arrival was identified within the audit period. These discrepancies had to be considered in terms of the regulatory framework that allows for free, unrecorded movement within Schengen, the Audit Office said. \nIt said that the government was aware of the allegations made in relation to theconsulate and it acted appropriately by informing the police  of the alleged irregularities. The police took action by seeking the views of persons of interest, including the consul and the Algerian travel agent, from whom most allegations originated.\n\"Whether any other action could have been taken by Government remains subject to debate, conditioned by the context within which the consulate was operating, as well as its operational setup. Moreover, the NAO acknowledges that there were aspects of the allegations beyond the control of the Consulate, particularly the involvement of the VFS and other agents in the visa process,\" the audit office said. \nThe consul was engaged following an internal call for applications for commercial representatives issued by the Malta Enterprise, with consular duties forming part of this role.\n\"While the NAO acknowledges an element of convergence in these responsibilities and that of a consul, this Office is of the understanding that the latter’s role encompasses a broader array of functions that extend beyond the promotion of business. The NAO contends that requirements deemed satisfactory for the appointment of a commercial representative may be inadequate in the selection of a consul,\" the audit office said. \nForeign Ministry to study auditor's report\nIn a reaction to the report, the Foreign Ministry said it would analyse the conclusions before deciding on its actions.\nThe ministry welcomed the fact, however, that the auditor had said it acted appropriately by calling in the police when the allegations became known.  ", "comment_count": 5, "id": 2054}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A thief disguised as a postman tricked a woman into opening her front door to give him and his accomplices access to her home, a court heard on Wednesday.\nThe 58-year old Qormi woman ended up tied up as the three strangers ransacked her home, making off with gold, money and a CCTV decoder.\nProsecuting Inspector Fabian Fleri recounted events of the January 11 theft as Mark Anthony Cardona, 41, from Birkirkara and currently unemployed, stood alongside Ryan Briffa, 28, from Qormi, who declared that he had been “boarded out”.\nThe two pleaded not guilty to the aggravated theft, holding a person against her will, causing her slight injuries as well as carrying a knife without a police licence.\nBoth were charged as recidivists, while Mr Briffa was separately charged with breaching bail conditions.\nA third man, also arrested in relation to the robbery, had been admitted to hospital after complaining of chest pains shortly before the arraignment. He is due to face charges at a later date.\nInspector Fleri said that CCTV footage clearly identified Mr Cardona as one of the thieves.\nMobile phone data, searches at the suspects’ homes as well as tests on clothing led investigators to close in upon the trio who had even, allegedly, scouted the area days before the robbery.\nNo request for bail was made at this stage and both co-accused were remanded in custody after pleading not guilty to the charges.\nInspectors Lydon Zammit and Roderick Agius also prosecuted.Lawyers Franco Debono, Amadeus Cachia and Noel Bartolo were defence counsel.", "comment_count": 0, "id": 2055}, {"keywords": "", "author": "Jacob Borg", "article_body": "The European Parliament’s committee on financial crime is set to hold a hearing on 17 Black next month after answers provided by Malta’s permanent representation were deemed “insufficient” by MEPs, the Times of Malta has learnt. \nThe committee, formally known as Tax3, is tasked with following up on the work of the special committee on the Panama Papers and tax evasion schemes.\nSources close to the committee said Justice Minister Owen Bonnici had already accepted an invitation to testify during the hearing. \nA member of the Daphne Project is also invited together with representatives from Moneyval, the Council of Europe’s anti-money laundering body.\nOther hearings about “alleged financial crimes” in other EU member states are also expected to take place. \nCommittee member Sven Giegold told the Times of Malta the hearing on 17 Black would be held after proposals by both the EPP and European Greens.\nMalta’s Permanent Representative to the EU, Daniel Azzopardi, had slammed as “speculative” a question by MEPs on the committee linking Daphne Caruana Galizia’s work on the power station contract to her assassination.\nMEPs had also asked whether there was any explanation why the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister, Konrad Mizzi, planned to receive up to $2 million from 17 Black. \nThe Times of Malta and Reuters reported last November that the company was owned by power station investor Yorgen Fenech. Nationalist MP David Casa, who also sits on Tax3, said the 17 Black issue had exposed the relevant authorities’ reluctance or inability to effectively investigate and prosecute what he termed as “serious cross-border crimes”.\nHe pointed out that concerns had also been raised about securing and transmitting evidence related to 17 Black coming from foreign authorities that had such information.\nAn intelligence report identifying Mr Fenech as 17 Black’s owner was sent to the police by the Financial Intelligence Analysis Unit last spring. \nPolice economic crimes unit chief Ian Abdilla would not provide an update about the investigation when approached by the Times of Malta last month.\nIt is known that the police only sought assistance from a magistrate to send requests for information to Dubai and Latvia about 17 Black’s ownership several months after the FIAU report was received.\nSources had toldTimes of Malta the investigation would only progress further once ownership details about 17 Black had been confirmed. It would only be then that Dr Mizzi and Mr Schembri could fall within the scope of the investigation, the sources had said. \nThe FIAU report in question was about Dr Mizzi’s energy deals.\nPN: Minister and chief of staff are embarrassing the country\nIn a reaction, the Nationalist Party said that the fact that the European Parliament committee would be holding a hearing about 17 Black was a matter of concern for Malta's reputation.\nYet again, minister Konrad Mizzi and chief of staff Keith Schembri were shaming the country as a result of their secret companies.\nThe PN said that after the revelations of the Panama Papers Dr Mizzi should have stepped down, as had other people abroad who were similarly named. \n \n ", "comment_count": 29, "id": 2056}, {"keywords": "", "author": "", "article_body": "Revenue by the Customs Department in 2018 rose by €20.4 million over 2017, and the biggest driver of the increase was the importation of materials for the construction industry.\nThe department said on Wednesday that its revenue last year was €447,399,157.\nAlthough there was a slight decrease in import duties, income from excise duties saw an increase of €10.5 million over 2017, with a sharp spike in excise duty pertaining to construction items and materials.\nVAT collected by the Customs Department on behalf of the VAT Department during 2018 also increased by nearly €12.5 million.\nWatch: The airport could prove to be a Brexit bottleneck for Malta Customs\nCustoms inspectors last year also seized a record amount of illegal items including 56,612,956 contraband cigarettes and 16,209,2kgs of narcotics. \nDuring the year the department introduced a new canine unit and commissioned new scanning equipment at the Freeport.\nIt also beefed up its human resources complement and increased the number of enforcement operations in a bid to curb illegal excise-goods importation. \n  ", "comment_count": 15, "id": 2057}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, who allegedly first threatened his ex-girlfriend over the phone and then turned up outside her home, accompanied by two others, and set about destroying her car, was denied bail.\nTyson Bugeja, 23, Natasha Bugeja, 20 and Ismael Magro, 19, all from Vittoriosa, were arraigned jointly over the attack which allegedly took place at on Monday afternoon.\nThe victim had, shortly before the incident, reported to the police that she had been receiving threatening phone calls from her ex, Mr Bugeja. Soon after, a silver Toyota Tercel turned up outside her home. The woman reportedly witnessed her ex getting out of the car and smashing the rear windscreen of her car, which was parked outside.\nAnother male, later identified as Ismael Magro, also got out of the Toyota and walked about during the attack. The third passenger, identified as Natasha Bugeja, allegedly sprinkled liquid from a jerry can onto the victim’s car.\nCCTV footage from the scene of crime led to the arrest of the trio who were charged over their involvement in the incident on Wednesday.\nTyson and Natasha Bugeja were jointly charged with causing voluntary damage to third party property and breach of bail, with the former also being separately charged with misuse of electronic communications equipment, threats against the alleged victim and causing her to fear violence.\nThe third co-accused was charged as an accomplice and of driving without a valid licence and insurance cover.\nA request for bail was upheld in respect of Ms Bugeja and Mr Magro, but was turned down in respect of Mr Bugeja in view of the gravity of the offences, his tainted criminal record and his lack of trustworthiness, besides the possible risk of tampering with evidence.\nMs Bugeja was granted bail against a deposit of €500, a personal guarantee of €5,000, signing the bail book twice a week and a curfew. She was further warned not to set foot in Żabbar.\nMr Magro was granted bail against a personal guarantee of €5,000, with similar orders to sign the bail book and to abide by a curfew.\nThe court, presided over by magistrate Natasha Galea Sciberras, also issued a Protection Order in favour of the alleged victim.\nLawyers Franco Debono and Arthur Azzopardi appeared for Natasha Bugeja. Dr Azzopardi also appeared for the other two accused. \nInspector Eman Hayman and Oriana Spiteri prosecuted.", "comment_count": 0, "id": 2058}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "Four youths who stole a Mercedes car and used it to flee the scene of an arson attack on another vehicle, were granted bail upon their arraignment on Wednesday afternoon.\nJoel Falzon, 23, from Safi, siblings Danica and Silvan Cilia, 22 and 20 from Rabat and Paul Farrugia, 28, from Siġġiewi, were arrested after a high-speed car chase by the police, who sped after them after reports of a burning vehicle in Triq Selmun in Mellieha on Monday evening.\nPolice officers tried to block the Mercedes’ path as it fled the site with the burning vehicle, but the driver somehow managed to slip past, sparking a ‘long car chase’ which ultimately resulted in the arrest of the four suspects.\nAll four were arraigned on Wednesday afternoon, admitting to some of the charges and pleading not guilty to others, including theft of a vehicle, stolen number plates and reckless driving.\nJoel Falzon and Silvan Cilia were separately charged over the arson.\nDefence lawyer Joseph Giglio told the court that the Cilia siblings harboured strong feelings towards their estranged mother and her partner.\nIt was no coincidence, Dr Giglio argued, that both the stolen Mercedes and burnt van belonged to their mother’s partner.\n“I wish to make a particular request in respect of the brother and sister Cilia as well as Joel Falzon, Danica’s boyfriend. They need psychological help for great difficulties they are facing on account of their relationship with their mother’s partner.”\n“Unless this problem is tackled, these proceedings will serve little use,” Dr Giglio continued, stressing that any appointed expert would need to break down “the barrier.”\nThe request was upheld by the court, presided over by magistrate Natasha Galea Sciberras, who issued a temporary supervision order in respect of the three co-accused for the reasons mentioned by Dr Giglio.\nA request for bail was upheld in favour of all four of the co-accused against a €1000 deposit each, a personal guarantee of €10,000, an order to sign the bail book daily and a curfew.\nInspectors Arthur Mercieca, Spiridione Zammit and Godwin Scerri prosecuted.", "comment_count": 0, "id": 2059}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Electoral Commission's guidelines on where people could register to vote in Malta appear to contradict the electoral law, an MEP candidate has warned. \nPartit Demokratiku candidate Camilla Appelgren said that while the Commission's own website instructed Maltese citizens to head to Identity Malta offices in Blata l-Bajda if they needed to register, and expats to Valletta's Evans Building to register themselves, the electoral law was far more flexible. Ms Appelgren\nArticle 6 of the General Elections Act states that any applications made to the Commission \"regarding the registration, cancellation, correction or transfer of a voter\" can be made at the Electoral Office, local council offices, police stations or by post, free of postal fees. \n\nAn FAQ section on the Electoral Commission's website makes no reference to this, and only lists Evans Building, Identity Malta offices and the Gozo Ministry as relevant registration sites. \nMs Appelgren, who relocated to Malta in 2011, called for a clarification about the registration process, which she believed should be made easy for Maltese and non-Maltese to register to vote.\n“Overall, registering to vote should be something anyone can do, without having to take time off work to visit an office with a long queue,\" she said.\n\"We should encourage people to exercise their right to be part of the democracy.”\nThe Office of the Prime Minister had yet to reply to questions at the time of writing. \nMs Appelgren's concerns come just as preparations for May's EP elections step up a gear. \nIn an effort to increase voter participation rates and encourage more people to vote, the European Parliament has created a website answering most of the common questions voters often have about European elections. \nQuestions range from 'how do I vote?' to 'can I vote by mail?'. \nVisit the website at https://www.european-elections.eu/how-to-vote/malta.", "comment_count": 2, "id": 2060}, {"keywords": "", "author": "", "article_body": "The European Parliament on Wednesday published new guidelines to ensure gender-inclusive language in all its communications.\nThe guidelines aim at being a source of inspiration for Parliament's administrative services.\nAmong other things, the guidelines propose the use of the word humanity (for mankind), staff (for manpower), a French person (for Frenchman/the French/French people/ Frenchmen), synthetic or artificial (for man-made), advisory panel (for committee of wise men) and political leaders (for statesmen).\nThe guidelines also propose the use of ‘Mr’ for a man, ‘Ms’ for a woman, avoiding ‘Miss’ and ‘Mrs’, unless it was known that the person referred to specifically wanted to be referred to by one of those titles.\nReiterating its commitment to gender equality and non-discrimination on gender grounds, the EP said the use of gender-sensitive language was one of the ways of implementing this commitment.\nThe many languages and cultures represented in Parliament meant there was no “one size fits all” solution, but that appropriate solutions had to be sought in each specific context, taking into account the relevant linguistic and cultural parameters, it said.\nParliament’s role as a European legislator also had to taken into consideration when seeking to achieve gender-neutral language. It noted that not all solutions that could otherwise be applied could be used in the context of legislation, which required clarity, simplicity, precision and consistency.\nBias-free language had more chance of being accepted by users if it was natural and unobtrusive, it said, adding that genuinely neutral and inclusive alternatives should be sought while respecting the multilingual nature of Parliament's working environment and the specific rules governing the drafting of legislation.\nThe document in full can be read in the pdf link below.", "comment_count": 185, "id": 2061}, {"keywords": "", "author": "", "article_body": "European Parliamentarian Francis Zammit Dimech has been shortlisted for an MEP Award for his work in the education, cultural and media spheres.\nDr Zammit Dimech, who has only formed part of the European Parliament for the past 18 months, has pushed for more EU funding for festivals and for partisan politics to be kept out of cultural spheres.\nHe has also pushed for visual literacy to form a bigger part of curricula and called for minority languages to be made more available on more online platforms and tabled various amendments on legislative reports concerning whistleblowers.\nThe veteran politician and former minister serves as EPP Group rapporteur on a New European Agenda for Culture and on a report into press freedom and pluralism.\n“This shortlisting fills me with courage and determination to continue working to serve as the voice of the people at the European Parliament. I humbly thank all those supporting me throughout my work,” he said after being informed of his MEP Award nomination.\nDr Zammit Dimech is one of three shortlisted candidates in the category, with the other two being Polish S&D MEP Krystyna Łybacka and German S&D MEP Petra Kammerevert.He is the only Maltese MEP to be shortlisted for an award.\nThe MEP Awards, handed out by The Parliament magazine, are given to recognise deputies who have contributed significantly to the legislative, supervisory or budgetary role of the European Parliament through their parliamentary activities.\nThe award ceremony will be held on March 20.", "comment_count": 12, "id": 2062}, {"keywords": "", "author": "Jacob Borg, Claire Caruana", "article_body": "The European Commission does not endorse any of the EU states’ cash-for-passport schemes, justice commissioner Vera Jourova insisted.\nReplying to a question by MEP Roberta Metsola days after a report urging member states to crack down on such schemes, Ms Jourova said that such schemes did not have the Commission’s backing.\n“I think it was very clear what we wrote [in the report] and I will clearly repeat, we do not endorse the system,” the justice commissioner said. \nFollowing last week’s publication, Ms Jourova had already made it clear that the Commission was looking at the schemes “with concern”.\nMalta is one of only three member states that have “investor citizenship schemes”. The other two are Cyprus and Bulgaria.\nIn last week’s report, the Commission said that Malta’s scheme has no actual mechanisms to ensure that passport buyers actually lived on the island or formed a genuine link in other ways.\nThe Commission also noted how non-public bodies such as approved agents or the schemes concessionaire Henley and Partners played a significant role throughout the application process, acting on behalf of applicants and interacting directly with the competent authorities.\nSources familiar with the drafting of the publication had told Times of Malta that the final version had been toned down by the EU’s executive.\n\nDirecting her question at the Commissioner, Dr Metsola said that Prime Minister Joseph Muscat “travels the world boasting that his passport-sale scheme is the only one with what he calls the official endorsement of the European Commission.\n“Based on what you said, can I say that the European Commission does not endorse the sale of passports? And while I understand that legally your interpretation is such that you are unable to stop it, are you at the very least able to say that this scheme of my country does not have the endorsement of the Commission?” the MEP asked.\nSince it was first introduced in 2014, soon after the Labour Party was elected to office, the passport sale scheme has encountered strong resistance from the Commission.\nThe body only backed down after the government agreed to ensure that those buying the passport established a genuine link with the country through a 12-month residence period prior to becoming a Maltese citizen.", "comment_count": 59, "id": 2063}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Every day, six people die trying to cross the Mediterranean, which has become the world's deadliest sea following cuts in search-and-rescue, UNHCR is claiming.\nDespite a major drop in the number of arrivals reaching European shores in 2018 when compared to the last five years, some 2,275 people died or went missing in the Mediterranean that year.\nOn routes from Libya to Europe, one person died at sea for every 14 who arrived in Europe – a sharp rise on 2017 levels.\nThousands more were returned to Libya where they faced appalling conditions inside detention centres.\nAccording to UN High Commissioner for Refugees Filippo Grandi, saving lives at sea is not a choice or a matter of politics, but an age-old obligation.\n“We can put an end to these tragedies by having the courage and vision to look beyond the next boat, and adopt a long-term approach based on regional cooperation that places human life and dignity at its core,” he said as UNHCR released the latest ‘Desperate Journeys’ report.\nThe report flags shifts in policy by some European states that left large numbers of people stranded at sea for days, while NGO boats and their crews faced growing restrictions on their search-and-rescue operations.\nFor many, setting foot in Europe was the final stop of a nightmarish journey during which they had faced torture, rape and sexual assault, and the threat of being kidnapped and held for ransom, according to UNHCR.\nFrom UNHCR's report called Desperate Journeys\nWhat will likely happen in 2019\nSome of those currently in Libya, many of whom have likely been there for a year or more, along with some more recent arrivals may continue to try to leave. Some smugglers are adapting their methods by providing sturdier boats, more fuel and satellite phones, and sometimes escorting or carrying boats further from Libya so as to move beyond the area patrolled by the Libyan Coast Guard, the UNHCR said. \nIn the continued absence of a consistent and coordinated approach within the region to rescue at sea and subsequent disembarkation, rescues by NGO vessels, in particular in the Libyan SRR are likely to continue to be responded to on an ad hoc, case by case basis, according to UNHCR.\n\"As a result, there will be more situations in which often severely traumatised people are kept at sea for days while governments debate where they can be disembarked.\"\nThe high death rate is also likely to continue, given the worrying reduction in search and rescue capacity.\nMalta, along with Lampedusa, may continue to receive an increase in direct arrivals.\nUntil the root causes and triggers of displacement and migration are addressed in many countries, people will continue to seek safety and protection, while others will try to escape poverty with the hope of finding work or educational opportunities.\nFor example, forced displacement from Mali, northern Nigeria, Cameroon, Burkina Faso, and western Niger could contribute to onward movement towards Europe via the Central or Western Mediterranean routes.\nChildren on the move\nIn Spain, unaccompanied children from Morocco, Guinea and Mali were frequently observed among the arrivals - around 5,500 unaccompanied children are thought to have reached the country last year.\nSimilar challenges were observed in Malta, where up to 20 per cent of those arriving by sea in the latter half of 2018 were unaccompanied children.\nChildren had to endure challenging reception conditions, with many sharing overcrowded accommodation with adults and being placed in detention-like facilities.\n \n\nMigrantsInfogram\nIn 2018:\n2,275 people died or went missing crossing the Mediterranean\n139,300 refugees and migrants arrived in Europe - the lowest number in five years\nSpain became the primary entry point to Europe as around 8,000 people arrived by land and a further 54,800 successfully crossed over the Mediterranean\nThe death toll for the western Mediterranean nearly quadrupled from 202 in 2017 to 777\nSome 23,400 migrants arrived in Italy - a fivefold decrease from 2017\nGreece received 32,500 people, compared to 30,000 in 2017", "comment_count": 0, "id": 2064}, {"keywords": "", "author": "", "article_body": "Spending on defence dropped by €5.6 million in 2017 compared to 2016, the second consecutive annual decrease.\nThe government spent €55.2 million on military defence that year, even less than the €62.9 million spent in 2014.\nThe National Statistics Office reported on Wednesday that government spending had increased across all sectors except defence and housing, the former dropping by 9.2 per cent and the latter by 1.8 per cent.\n\nGovernment expenditure on defence had peaked at €77.9 million in 2015 – although the figures do not distinguish between recurrent and capital amount.\nThe amount spent by Malta – 0.6 per cent of GDP in 2016 – was already below the EU average of 1.3 per cent, putting the country in 25th place.\n ", "comment_count": 7, "id": 2065}, {"keywords": "", "author": "", "article_body": "Allowing MEP candidates for May’s European elections to purchase radio slots to promote themselves was unconstitutional and would favour the two major political parties in Malta, Partit Demokratiku said on Wednesday.\nParty leader Godfrey Farrugia said in a statement that major parties were in a position to dominate radio through sheer purchasing power, violating Article 119 of the Constitution.\nThe article states that: “It shall be the function of the Broadcasting Authority to ensure that, so far as possible, in such sound and television broadcasting services as may be provided in Malta, due impartiality is preserved in respect of matters of political or industrial controversy or relating to current public policy and that broadcasting facilities and time are fairly apportioned between persons belonging to different political parties.\"\nPD noted that the Broadcasting Authority lacked a true independent function that an impartial institution merited.\nThis needed to be redressed, the party said. The current appointment of Broadcasting Authority members was not made in the public interest but in the interest of the two major political parties. It was unfortunate that the Broadcasting Authority in Malta had been rendered a political bi-partisan institution, PD said.", "comment_count": 2, "id": 2066}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who robbed a gas cylinder deliveryman of €1,700 has been handed a suspended sentence and forfeited the €10,000 bail bond relating to another offence.\nKeith Cremona, 32, stole a cash-filled pouch from the cabin of a gas delivery truck while the owner was working at the rear of the vehicle.\nThe gas distributor told police he noticed the man acting suspiciously around his truck, at one point going underneath it, pretending to trim some weeds. At one point, he noticed the accused opening the cabin door and lifting up his cash pouch. He gave chase and nearly caught the hooded thief, but he managed to slip away.\nThe victim and his son identified the accused in the courtroom as the culprit had stopped and stared at them at one point while they were chasing him - before throwing away the empty pouch.\nThe court, presided over by magistrate Claire Stafrace Zammit, said there was no doubt that it was Keith Cremona who had stolen the pouch and that he had been caught red handed.The court further observed that despite the man’s alleged tainted criminal record, no evidence of his previous convictions was exhibited in court, meaning that he was to be regarded as a first-time offender.\nIn the light of such circumstances, the court condemned the accused to a one-year jail term, suspended for two years. It also ordered the confiscation of the man’s €10,000 bail guarantee.\nIt transpired that the man had not signed the bail book for six months.\nInspector Elliott Magro prosecuted. Lawyer David Gatt was defence counsel.", "comment_count": 0, "id": 2067}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A new tender for a multimillion-euro cleaning contract at St Vincent De Paul Complex raised eyebrows within the industry due to conditions that disqualify potential bidders, Times of Malta learnt.\nAccording to the specifications of the tender, issued last month after three years in the making, companies interested in offering their services must submit details of similar jobs they did over the past three years, which had a minimum turnover threshold to the value of “not less than €12 million”.\nIndustry sources told the newspaper that, apart from the “very high” minimum threshold, meaning only a few local companies would be eligible, the call contrasted sharply with a similar one made only a few months ago but covering a much bigger operation, for Mater Dei Hospital.\nThe Mater Dei tender, issued last year, set a “minimum value [of similar works] which must not be less than €1 million per annum for the quoted period”. The contract covered a period of three years.\nThe industry sources pointed out that while the cleaning tender for the Luqa elderly people’s home, valued at less than €1.5 million a year until 2015, demanded a minimum previous works’ value threshold of €12 million from bidders, the Mater Dei contract, worth more than €6 million a year, was set at just €1 million.\n“This is either a mistake by those who drafted the specifications for the St Vincent de Paul job or it’s a way of excluding certain potential bidders to ensure some particular company is given an obvious advantage,” the industry sources said.\nQuestioned about the evident anomaly, the director general for Contracts, Anthony Cachia, said that “the requested minimum value of services of similar nature, as part of the wider selection criteria, are set by the contracting authority [St Vincent de Paul Complex] and are duly published within the procurement documents. \n“Any variation in the requested values reflects the particular requirements of each specific contracting authority.”\nThis is a way of excluding certain potential bidders\nHe noted that aggrieved economic operators worried about “potential playing field disparity” could make a pre-contractual complaint free of charge to the Public Contracts Review Board while the tender was still in the publication stage.\nHe was also asked for details on the value of payments made to the cleaning contractor at the Luqa complex, who was selected without a call for tenders in 2015, but none were forthcoming.\nThe last time a tender for cleaning services at St Vincent De Paul was issued was in 2011. \nWhen a new tender was due in 2015, the job was given to a newly-registered company, X-Clean Ltd, owned by Denis Xuereb from Naxxar, by direct order. The company was selected even before it was officially registered. The cleaning services at the old people’s home kept being awarded to the same supplier through repeat direct orders for more than three years.\nDocuments show that Mr Xuereb also billed the government more than €300,000 a month for services unrelated to cleaning including engineering, hairdressing and gardening. \nOriginally, the services were costing the government less than €100,000 a month.\nThe Department of Contracts and the Finance Ministry, which are responsible for government procurement, defended the granting of multimillion-euro direct orders issued to X-Clean, insisting that was necessary until a new tender, which was being formulated, was issued.\nInsisting his department had only authorised the old people’s home administration to issue direct orders limited to cleaning, Mr Cachia said that the issue of a new tender was “a complicated” one that required time.\nTimes of Malta is informed that X-Clean received about €9 million over the past three years from St Vincent De Paul, apart from being awarded other direct orders related to cleaning services at other government old people’s residences around the island. \nThis happened when elderly people’s facilities fell under the political remit of Michael Farrugia, who is now Home Affairs Minister.\n ", "comment_count": 31, "id": 2068}, {"keywords": "", "author": "", "article_body": "‘Big Frank’, who ran a vice syndicate in London’s red light district in the 1960s and 1970s, lost a case he took to the European Court of Human Rights after being forced to submit to a paternity test against his will.\nFrank Mifsud\nFrancesco Saverio Mifsud, who resided in Sliema, complained in mid-December 2015 that a Maltese law forcing him to provide a genetic sample in paternity proceedings contrary to his will violated his right to respect for private and family life. He died in Malta two years later, aged 91 and his Irish wife, Margaret, decided to continue with the proceedings.\nThe case dates back to December 2012 when a woman – named in the Maltese proceedings as Diana Abdilla, then 54, but who is not identified by the Strasbourg Court, which refers to her as ‘X’ – claimed that Mr Mifsud was her biological father and asked the Civil Court (Family Section) in Malta to order that this be reflected on her birth certificate.\nThe Public Registry director requested the court to order the parties submit themselves to genetic tests. On the same day the director filed his application, Mr Mifsud denied he was the father and claimed that Ms Abdilla’s mother had had various partners.\nMs Abdilla had also asked that both herself and Mr Mifsud should undergo genetic tests but he objected on various grounds including violation of his fundamental rights and also because any intervention could have negative medical implications given his advanced age.\nThe test was eventually held and the expert conducting it put the probability of paternity at 99.9998 per cent\nHowever, the court disagreed with him and he appealed. \nThe Constitutional Court rejected the appeal and confirmed the first judgment arguing that Mr Mifsud would not have suffered any humiliation in having to undergo a buccal swab (collecting DNA from cells on the inside of the cheek), which was not an invasive action, and any turbulence that could be caused to his private and family life did not outweigh Ms Abdilla’s interests.\nThe test was eventually held and the expert conducting it put the probability of paternity at 99.9998%. Mr Mifsud was, therefore, declared by the court to be Ms Abdilla’s biological father and this was to be reflected in her birth certificate.\nHow one UK newspaper reported Big Frank’s conviction.\nThe Strasbourg Court, which included Chief Justice Emeritus Vincent De Gaetano, agreed that forcing somebody to submit to a DNA test and the actual test itself despite the person’s objections amounted to interference with that person’s private life. However, in this case, the interference pursued a “legitimate aim”, that is, the protection of Ms Abdilla’s rights and freedoms.\nIt agreed with the Constitutional Court that, respect for private life demanded that everybody should be able to establish details of one’s identity as an individual human being. Furthermore, entitlement to such information was important because of its formative implications for one’s personality, including obtaining the information required to uncover the truth on important aspects of one’s personal identity, like knowing who one’s parents were.\nThe Strasbourg-based Court described Mr Mifsud as being a British national. In fact, it notified the UK about the case but it did not intervene.\nFruit of extramarital affair\nDiana Abdilla was the fruit of an extramarital affair Frank Mifsud had with a woman who used to work for him, Margaret Felice, according to court evidence both in Malta and in Strasbourg.\nAccording to Ms Felice, she used to date Mr Mifsud in the late 1950s and at some point she got pregnant. She testified he wanted to interrupt the pregnancy and had seen a man who gave her an injection. She then miscarried.\nMr Mifsud had bought her a place in London where they used to meet since he was married. Ms Felice insisted she had always been faithful to him because she feared him, given he was a powerful man involved in criminal activities.\nShe conceived again from the relationship she had with Mr Mifsud and Ms Abdilla was born in January 1960. \nHowever, the affair had eventually deteriorated, to the extent he also wanted her to prostitute herself. \nMs Felice said she finally plucked up courage, left him and returned to Malta with her daughter.\nMs Abdilla recounted that, even when still young, she had always been told that Mr Mifsud was her father. Whenshe turned 16, she decided to write to him but he never answered. \nThen, in 1978 she learned that Mr Mifsud would be visiting Malta and she went to meet him at the airport.\nIn her affidavit to the European Court of Human Rights, Ms Abdilla said he arrived with his family and noted a resemblance between herself and his daughter. However, she did not approach him though they did meet some time later in the presence of a lawyer.\nAccording to her, Mr Mifsud greeted her warmly and, subsequently, met on several occasions. She said she also met his wife. Ms Abdilla said her father told her he would not inform his children about her not to disrupt their schooling and she agreed.\nMr Mifsud used to visit Malta regularly on his own and when she became pregnant he offered her one of his properties where to stay, thus living together on his visits to the island. \nMs Abdilla had a daughter in 1979 and Mr Mifsud was her godparent.\nShe said Mr Mifsud suggested she should move to London but returned 16 months later because she missed Malta and Mr Mifsud had allowed her to reside in a property he owned in Sliema. In 1998, Ms Abdilla said she was evicted from the property and then their relationship deteriorated. \nDuring the eviction proceedings, he had promised her a sum of money to leave the premises peacefully, which she accepted but the money never arrived and the matter ended up in court, she said.", "comment_count": 7, "id": 2069}, {"keywords": "", "author": "", "article_body": "Former Opposition leader Simon Busuttil pledged on Tuesday he would keep knocking on the doors of justice after his bid for an inquiry into Konrad Mizzi and Keith Schembri was rejected by a magistrate.\nSimon Busuttil\nHe noted that, for the second time in just a few weeks, the courts had turned down a request for a magisterial investigation into the Tourism Minister and the Prime Minister’s top aide in the wake of the Panama Papers revelations.\nThe Panama Papers had led to investigations, arrests, criminal procedures, resignations and even imprisonment across the globe but justice was not being served in Malta, Dr Busuttil said.\nPointing out he respected the court’s decision, the former Nationalist Party leader said he was saddened that the country had no institution willing to investigate alleged corruption involving members of the government.\nDr Busuttil said he could either give up on the chance of justice ever being done or persist. To him the choice was clear. “I will continue insisting on justice in Malta and within the EU,” he said. \nNationalist MEP David Casa said the court decision was proof of what the Council of Europe’s rule of law experts had said when they expressed concern over the island’s democracy.\nIn a tweet, Dr Mizzi welcomed the court decision, adding that Dr Busuttil’s baseless allegations had again been thrown out by the courts. \n“Court sees through more speculations and conjectures,” he tweeted.\nThe Labour Party said this was the third legal blow to Dr Busuttil. \nLabour MP Robert Abela told a press conference that Dr Busuttil’s legal manoeuvring “showed an enormous amount of disrespect for the rule of law and for our law courts”.\nIn an official statement, the government noted that, “as always”, it would respect the independence of the court and hoped “others” would do the same.\nCourt sees through more speculations and conjectures\nThe request by Dr Busuttil and Mr Casa for an inquiry was rejected by Magistrate Francesco Depasquale who said: “Contrary to what the two applicants seem to think, there is no ‘legal and judicial limbo, neither dead nor alive’.”\nHe said the court’s original decision turning down their request last May was final and could not be appealed. He had decided then that it made no sense to have “double or even triple” investigations into the same case.\nHe had ordered all documents and evidence to be handed over to Magistrate Ian Farrugia who was already considering a similar request. Dr Farrugia had ruled there were grounds to investigate Dr Mizzi, Mr Schembri and others, including the Prime Minister.\nHowever, earlier this month, Mr Justice Giovanni Grixti reversed that decision and said there was no legal basis to launch such an inquiry. Dr Busuttil and Mr Casa then filed their application to revisit Magistrate Depasquale’s original decision.", "comment_count": 111, "id": 2070}, {"keywords": "", "author": "", "article_body": "These are the main stories in Wednesday’s newspapers.\nTimes of Malta says Opposition leader Adrian Delia faced an onslaught during a fiery parliamentary group meeting on Monday evening but none of those present openly called for his resignation. In another story, the newspaper says British Prime Minister Theresa May won Parliament’s backing on Tuesday night to renegotiate her Brexit deal.\nMalta Today says former Foreign Minister George Vella will be Malta’s 10th President.\nThe Malta Independent says petrol station profit margins are to be increased in line with an agreement reached on Saturday between the GRTU and the government.\nL-Orizzont quotes Minister Konrad Mizzi saying that the truth is coming out and he is proud to have bowed his head and followed the Prime Minister.\nIn-Nazzjon refers to a Transparency International report which, it says, condemns the government on corruption.", "comment_count": 0, "id": 2071}, {"keywords": "", "author": "", "article_body": "Malta Enterprise has approved seven projects originating in Israel in the past seven months, President Marie Louise Coleiro Preca said.\nAddressing an activity organised by Malta Enterprise in Jerusalem during an official visit to Israel and Palestine, the President said another 100 companies registered in Malta were owned by Israeli entrepreneurs.\nShe said that the excellent connectivity between Malta and Israel, the Double Taxation Agreement in place between the countries, and the highly-skilled and flexible workforce Malta had, would definitely serve as an extra incentive for Israeli entrepreneurs to invest in Malta.\n“In fact, Malta envisages collaboration in the IT and digital sector, in life sciences, and in research and education, to mention but a few,” the President added, thanking Malta Enterprise for facilitating the business forum and networking event.\nDuring the visit, Malta and Israel also signed a collaboration agreement for the health sector.", "comment_count": 16, "id": 2072}, {"keywords": "", "author": "", "article_body": "A 30-year-old woman from Żebbuġ was grievously injured on Tuesday in a traffic accident in Marsa.\nThe police said the accident happened in Triq Diċembru Tlettax at 6.10pm.\nThe woman, who is Hungarian, was riding a Syn Wolf that was involved in a collision with a Nissan Juke that was being driven by a 32-year-old woman from Żabbar.\nA medical team was called on site to help the victim, who was then taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2073}, {"keywords": "", "author": "", "article_body": "Malta is to host the next summit meeting of southern EU countries, Prime Minister Joseph Muscat has announced.\nThe meeting, to be held during the summer, will group the French President and the prime ministers of Italy, Spain, Portugal, Greece and Cyprus\nThe heads of government met on Tuesday in Cyprus, where they discussed issues which included migration, regional stability and growth, the drawing up of an EU digital policy, the formation of a European Labour Agency and Brexit.\nOn Brexit, the leaders said in a declaration that the decision of the United Kingdom to leave the EU remained regrettable but it was one they respected.\n\"We remain committed to an orderly withdrawal of the United Kingdom from the EU in order to guarantee certainty for citizens and businesses and the basis for an ambitious future partnership, in accordance to the EU’s own principles and internal order. We stand firmly by the Withdrawal Agreement and we intend to proceed with its ratification. We will also intensify our work on preparedness for the consequences of the United Kingdom’s withdrawal, taking into account all possible outcomes.\"\nBritish Prime Minister Theresa May on Tuesday said she would like to see changes to the Withdrawal Agreement. \nRead the Cyprus summit final declaration here.", "comment_count": 3, "id": 2074}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia faced an ‘onslaught’ during a “fiery” parliamentary group meeting on Monday evening but none of those present openly called for his resignation, Times of Malta was told.\nA Nationalist MP who spoke to the newspaper on condition of anonymity had words of praise for how Dr Delia handled the ‘onslaught’ and allowed everyone to have their say during the meeting, which lasted about four-and-a-half hours, ending at 10.30pm.\n“There was lots of criticism. People expressed their doubts about him. In my opinion, he provided convincing replies to all the matters raised…\n“He is not my cup of tea. Before this meeting, I was 95% against him. After the meeting, I would say I am 60% against him,” the MP admitted.\nHe said there were no outright calls for Dr Delia to step down during the meeting although it was implied – “between the lines” – in the very nature of some of the questions put to him.\nBefore this meeting, I was 95% against him. After the meeting, I would say I am 60% against him\nThe meeting was characterised by the usual “suspects” on both sides of the pro- and anti-Delia divide vocally getting their points across, he added.\n“Overall, I would say it was a useful meeting. It perhaps would have been better had it been held earlier to help clear the issues that arose over the Christmas period,” the MP continued.\nAnother MP, who also asked not to be identified, told Times of Malta Dr Delia was taken to task about his blaspheming in a leaked video and his “drunk appearance” at a charity event on January 1. The MP had words of praise for the Opposition leader’s candour, putting his happy appearance down to having been given access to his children after six weeks.\nRead: Delia 'must step down' or be fired after domestic violence claims\nDr Delia is going through separation procedures with his estranged wife, who levelled domestic violence accusations against him in court last month. \nThe woes facing the PN leader also involve tax issues and a police investigation on matters dating back years.\nMPs were told by Dr Delia during the meeting that videos of him in a domestic setting doing the rounds had been “professionally edited”.\nWhile the MP confirmed there were no direct calls for his resignation, he pointed out there was no statement by the parliamentary group reaffirming its confidence in the leader as had happened after a meeting of the party’s administrative council earlier this month.\nAsked whether questions were raised about Dr Delia’s financial situation, the MP said there had only been reference to how a news website retracted a report claiming the Opposition leader was walking around with €500 notes in his pocket.", "comment_count": 113, "id": 2075}, {"keywords": "", "author": "", "article_body": "Gżira residents have urged the government to insist on reductions to Midi's Manoel Island mega-development, with the project on the cusp of final approval.\nAt the end of a heated town-hall meeting organised by new pressure group Inħobbu l-Gżira on Tuesday night, some 60 residents agreed on an open letter to be sent to the government and opposition.\nThe letter calls for the government to acquire the land on Manoel Island closest to the mainland, where Midi plans to build the most controversial of its proposed apartment blocks, and retain it for public enjoyment.\nIt also calls for height reductions to protect long-range views of Valletta from Gżira, the elimination of land-reclamation plans, and a new slipway with adequate facilities to replace the one that will be removed as part of the development.\n\"Speak to your MPs and to everyone you know; tell them that this project frightens us,\" a group spokesman said at the end of the meeting.\nThe group, set up in recent weeks, has warned that the development plan would in its current form transform a large part of the Gżira promenade into an access road or bridge to Manoel Island. It has also said that views across Marsamxett Harbour would be lost as two “enormous” apartment blocks would be built on reclaimed land right opposite Triq ix-Xatt.\nDuring the meeting, which largely took the form of a presentation of the development plans, residents and business owners expressed their frustrations that the project would not give anything back to the local community. Concerns were raised over the height of the proposed buildings, the lack of open spaces, changes to the promenade, and the influx of new residents.\nThe Planning Authority board put off a decision on the development on December 20, citing a lack of information on building heights and other aspects of the project.\nThe plans - including an extensive residential and commercial complex on Manoel Island, including a hotel and casino at the historic Lazaretto, apartment blocks, retail outlets, yacht marina, streets and plazas - are recommended for approval, with a final decision expected in the coming weeks.\nPlans for the Manoel Island mega-development.\nThe project - which dates back to a concession agreement signed with government in 1999 - has in recent years been marked by controversy and public protests over foreshore access and a widely-slated first draft master plan.\nHowever, the Gżira local council and NGOs leading the opposition dropped their objections after the signing in March of a guardianship agreement with Midi, guaranteeing protection and public access to the island’s heritage buildings, foreshore and green areas.", "comment_count": 9, "id": 2076}, {"keywords": "", "author": "", "article_body": "Malta and Israel have signed a collaboration agreement for the health sector.\nThe agreement was signed in Jerusalem, where Health Minister Chris Fearne is part of a delegation led by President Marie-Louise Coleiro Preca.\nThe agreement provides for collaboration in health services and a sharing of information in international fora and sharing of information about chemical incidents.\nHealth Minister Yakov Litzman signed for Israel.", "comment_count": 5, "id": 2077}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The infrastructure at the airport arrivals lounge is the most worrying aspect of Brexit for the director general of the Customs Department, with most of the other bases already well covered.\nThe department has been slowly but surely building up its resources over the past few years, with the priority being the creation of an IT system that could handle the extra workload at the ports.\nBut with 12 flights arriving and 12 leaving every day from the UK on average – each with 160 people on board – that will put considerable pressure on the red and green Customs gates, as they will no longer be entitled to use the blue channel and will have to indicate whether they have anything to declare.\n“And that is the average over the whole year. There are periods in summer when there might be three times that amount!” director-general Joseph Chetcuti said.\nThe Budget allocation was always based on a workforce of 400\nNegotiations are already underway with Malta International Airport on ways to avoid the fear of queues that are giving Mr Chetcuti headaches. \n“This is a commercial entity, which has to consider every centimetre to generate revenue,” he admitted. \n“But I envisage that we would need another red and another green channel.”\nThere are other aspects to do with the shift of all the passengers onto a ‘third country’ status – including the huge amount of additional VAT refund applications this will entail, currently mostly received from Maltese emigrants living in Australia, Russians and Japanese, Africans and Swiss.\nA new luggage scanner van is also being purchased, with European Union funding, which will be in place by around September, screening bags before they are even put onto the conveyor belts – which will take pressure off the red and green Customs gates.\n“But we would still need to be vigilant for hand luggage and things concealed in people’s clothing. In fact, we are considering introducing a full body scanner in the future, which would check for arms, narcotics and cash,” he said.\nMr Chetcuti took over the department three years ago after having worked his way up the ranks for three decades. When he took over, there were 200 operational staff. This has now gone up to nearly 400, with a 25 per cent increase at the airport which will be boosted by a further 15 per cent in the coming weeks, and a 10 per cent increase at the cargo ports, which may not be enough.\nThe increase may pale into in-significance compared to the 900 officers added in France and 700 in the Netherlands, but it is none-theless a considerable leap.\n“The Budget allocation was always based on a workforce of 400 but until now half of that money was returned. Now, we will be using it all,” he said, noting that the department had not recruited significantly for 25 years.\nWith British MPs scheduled to vote tonight on amendments to Prime Minister Theresa May’s plan, the department has had to operate on the assumption that there will be no deal. \n\nOne thing that many overlook, he said, was that even if the eventual deal is for the UK to join a Customs union, the department will have to deal with all the additional declaration documentation, data management and processing that a third country consignment would entail – but without the revenue that would come in from import tariffs.\n“If there is no deal, we get the extra work but at least we get extra revenue. If there is a deal, we will get the extra work but with no revenue. \n“As we say in Maltese, we get the bone but with no meat on it,” he said, pointing out that Malta only retains 20 per cent of the revenue as the rest goes to the European Commission.\nPassengers are just one aspect. The department also handles 25 groupage trailers a week from the UK – each of which would have some 10 consignees. When all the consignments come from within the EU – including those that arrive via Italy – then the trailers would be released. \nNow, if even one of them is from the UK, they will need to be processed at Ħal-Far.\nThere are also 30 full loads a week via the sea ports, not to mention the 100 that come by airfreight, and 5,500 consignments a week that come by express mail and the as-yet unquantified amount that come via parcel post (although the majority are worth under €22 and would not fall under Customs scrutiny).\n“We would have to handle some 6,000 to 7,000 declarations a week more,” Mr Chetcuti said. \nAt the moment, although everything is in limbo, high-level meetings will be held in Brussels next week and the Customs Department is ready to roll out roadshows for the business community explaining things as they stand.\n“Fortunately, some 90 per cent of the business community already deals with third countries so they know what this entails. For the rest, we are organising training,” he said.\n“We are as ready as we can be in the circumstances. My only concern is that there might be queues at the airport as that would be a major inconvenience for tourists. If we do not prepare from now, we won’t be ready by the end of March.”", "comment_count": 51, "id": 2078}, {"keywords": "", "author": "", "article_body": "Cannon Road in Sta Venera is to be linked to the Marsa Ħamrun bypass to facilitate the flow of traffic from Birkirkara, Sta Venera and Ħamrun to the south of Malta, Infrastructure Minister Ian Borg announced on Tuesday afternoon.\nHe said in a Facebook post, that the plans, prepared by Infrastructure Malta, continue to build on the project carried out last year to improve the bypass.\nHe said that traffic flow towards Ħamrun and Qormi will also be improved thanks to the addition of another lane on the sliproad linking the bypass to the roundabout near the Maltapost depot.\nAnother lane will be added to the bypass by utilising space created in the project launched last year. ", "comment_count": 8, "id": 2079}, {"keywords": "", "author": "", "article_body": "An Italian motorcyclist was seriously injured in a traffic accident in Żabbar Road Fgura, late on Tuesday morning.\nThe police said the 28-year-old was driving a Piaggio X7 that was involved in a collision with a Suzuki Alto driven by a 76-year-old man from Żabbar. \nPolice are investigating. ", "comment_count": 0, "id": 2080}, {"keywords": "", "author": "", "article_body": "Three men and a woman are being questioned by the police after being seen fleeing the scene as the police responded to a report of a car on fire.\nThe incident happened at about 11pm on Monday.\nThe police said on Tuesday that officers responded to a call that a Mitsubishi car was on fire in Triq Selmun in Mellieħa.\nWhen officers from the local police station and the Rapid Intervention Unit arrived, they spotted a Mercedes being driven away at high speed.\nThe Mercedes was reported stolen a few days ago.\nThe RIU officers chased and eventually stopped the Mercedes and arrested the people inside. They were three men aged between 20 and 29 and a 22-year-old woman. \nA magisterial inquiry is under way.  ", "comment_count": 6, "id": 2081}, {"keywords": "", "author": "", "article_body": "A woman was granted bail on Tuesday after pleading not guilty to stealing a cash-filled pouch from the Nationalist Party's Żabbar club earlier this month.\nElaine Spiteri, 36, was accused of stealing between €232 and €2,329 in cash on  January 20.\nSources said the pouch had been snatched from the bar counter and was later found empty in the bathroom within the same premises. The woman was allegedly spotted by other people leaving the bathroom.\nMs Spiteri was granted bail against a personal guarantee of €10,000.\nMagistrate Yana Micallef Stafrace also ordered the woman to sign the bail book once a week and to abide by a curfew between 10pm and 5.30am, warning her not to approach the alleged victim or members of his family.\nInspector Eman Hayman prosecuted.\nLawyer Michael Sciriha was defence counsel.", "comment_count": 0, "id": 2082}, {"keywords": "", "author": "", "article_body": "A man suspected of forming part of a pickpocketing gang was remanded in custody after his arraignment on Tuesday.\nDaniel Maftei, 47, who works as a mechanic back home, was arrested at the airport after his return to Malta on Monday.\nHe stands accused of several thefts on New Year’s Eve and New Year’s Day at Valletta.\nHe pleaded not guilty to stealing a wallet containing cash and credit cards, the unlawful use of one of the cards to withdraw some €1,450 from an ATM, the misuse of an electronic password as well as the theft of another wallet and two separate instances of attempted theft from an ATM.\nPolice sources explained how Mr Maftei was suspected to form part of a pickpocketing gang that travelled between Romania and Malta.\nIn a brief hearing, Mr Maftei pleaded not guilty and was remanded in custody. No request for bail was made at this stage.\nInspector Jeffrey Scicluna prosecuted.\nLawyer Lennox Vella was defence counsel.", "comment_count": 1, "id": 2083}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man currently held at Corradino under preventive arrest was arraigned on Tuesday, a year and three months after his alleged involvement in the violent armed hold-up at Diamonds International at Tignè Point.\nAlbanian Begtash Muka, 27, was taken to court from Corradino Prisons to face fresh charges linking him to the massive haul of some €333,000 worth of jewellery, none of which has been recovered. He is also accused of attempted murder.\nThe arraignment came about after DNA test results pointed in his direction, the prosecution explained.\nThe suspect’s brother, 23-year old Daniel Muka, had been arraigned in relation to the same armed robbery at the Tignè shopping mall back in October 2017, when two people were injured before the thieves fled the scene.\nLawyer Franco Debono contested the validity of Tuesday’s arrest, pointing out that the prosecution could have arraigned the suspect under writ of summons or by urgent summons.\nHowever, prosecuting Inspector James Grech rebutted that the man had been arraigned now only because after the coup he had been in hiding and had been arraigned subsequently in relation to a separate offence.\nIn view of circumstances of case, the court, presided over by magistrate Yana Micallef Stafrace, declared the arrest valid.\nThe man pleaded not guilty to a string of charges including knowingly placing the life of one victim in danger, aggravated theft and holding two persons against their will while carrying a weapon without a police licence.\nHe was remanded in custody.\nLawyer Amadeus Cachia was also defence counsel.", "comment_count": 0, "id": 2084}, {"keywords": "", "author": "", "article_body": "A legal bid by Simon Busuttil and David Casa to reignite a bid for an inquiry into Minister Konrad Mizzi and OPM chief of staff Keith Schembri has been flatly denied by the courts.\n“Contrary to what the two applicants seem to think, there is no ‘legal and judicial limbo, neither dead nor alive’” Magistrate Francesco Depasquale concluded when assessing n application filed by the two Nationalist Party politicians.\n\n\n\nMagistrate Ian Farrugia had ruled that there were grounds to investigate the two PEPs, as well as several others including the Prime Minister, over their connections to Panama Papers revelations.\nBut earlier this month an appeals court reversed that decision and said there was no legal basis to launch such an inquiry.\nWith Mr Justice Giovanni Grixti having slammed the door shut in that case, Dr Busuttil and Mr Casa filed an application to revisit Magistrate Depasquale’s original decision and to have the magistrate in charge selected by lot.\nThey were unsuccessful on both counts, with the court saying that the two applicants had already had their request turned down and had not appealed the decision.\nIn a statement, the government said that the decision was further evidence that Dr Busuttil’s 2017 trips to the courts were not backed by any proof.", "comment_count": 0, "id": 2085}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Economy Minister Chris Cardona has lost his legal attempt to stop the Data Protection Commissioner from accessing details of his consultants’ contracts and was ordered to submit all the documentation requested.\nChris Cardona (left) and his former chief of staff Mario Azzopardi.\nIn a decision handed down by the Information and Data Protection Appeals Tribunal, chaired by Anna Mallia, it was decided that the Data Protection Commissioner has every right to issue enforcement orders when a government ministry does not comply.\nThe tribunal rejected all the arguments made by Dr Cardona’s lawyer, Nadine Lia, herself a consultant at the ministry, reiterating that it is up to the Data Protection Commissioner to decide whether a contract should be published or not.\nAmong her objections, Dr Lia had argued that the people employed by the minister as consultants, paid by taxpayers, should not have their contracts published as their terms were “private and confidential”.\nThe issue goes back to over a year ago when Times of Malta had submitted a request under the Freedom of Information Act to obtain the contracts of the minister’s advisors after it was discovered that Dr Cardona’s former chief of staff, Mario Azzopardi, was removed from his post and instead given an advisory role.\nMr Azzopardi, had hit the headlines in 2015 when he took the blame after the discovery by the National Audit Office that during a Dubai trip, Dr Cardona’s party ran a bill of €750 worth of alcoholic beverages consumed from the hotel’s mini-bar during a three-day visit.\nFollowing the revelations, Dr Cardona said that the bill was not his but was Mr Azzopardi’s, who was accompanying him during the ministerial trip in the United Arab Emirates. \nFollowing the last election, Mr Azzopardi was not reappointed as Dr Cardona’s chief of staff. \nInstead, Dr Cardona appointed his chief canvasser in Birkirkara as adviser “to monitor all works of the ministry and update Dr Cardona on a regular basis”.\nThe conditions tied to this new post, including the financial package, were never disclosed as Dr Cardona repeatedly refused to give details to the newspaper.\nFollowing a request for an investigation by Times of Malta, as it argued that since Mr Azzopardi was paid through public funds, his conditions should be made public in view of transparency and good governance, the Data Protection Commissioner asked the Economy Ministry to supply the information to his office  acceto decide whether the publication of such information was necessary.\nHowever, parting from usual procedure adopted by the government, the ministry refused to hand over the documents to the regulatory authorities and instead challenged the commissioner’s decision and his authority.\nThe tribunal has now turned down the ministry’s attempts to block the process. \nApart from Mr Azzopardi, Dr Cardona also employed as his advisers, Dr Lia, Mario Borg Sillato, Alexander Farrugia and Joseph Sammut.\nThe contracts of all these consultants are now expected to be handed to the Data Protection Commissioner.\nIvan.Camilleri@timesofmalta.com", "comment_count": 54, "id": 2086}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "“All politicians are of the people, but I will remain among the people,” says Camilla Appelgren, making her pitch to a question about what makes her different from other politicians contesting the European Parliament elections this May.\n“That’s how you can be a leader, when you fight with the people – it’s who I am as a person, who I will be as a politician.”\nThere’s much else that is different about the 34-year-old Swede who is standing for the Democratic Party. She points out that her relocation to Malta eight years ago “was very natural” and that Malta is a place “where I felt at home as much as I felt at home in Sweden”. \nHer private and public personas are different in other ways too, so is her style of campaigning. She will not be posting out flyers, nor doing any home visits. “My campaign will be what I am,” she says pointedly. “I will do what I have been doing all along: organising clean-ups and being out there.”\nMs Appelgren first came to Malta in 1999 to study English, and she became enamoured of the island and her host family – “an amazing family who became like a second family”. Afterwards she took to visiting Malta every summer for several weeks.\n“In a way I see myself as having grown up in Malta,” she elaborates. “Then in Sweden I felt a bit stuck in the routines, and in dark winters, so I decided to take the leap and move to Malta before my children started school.\n“At the time I had a dream of being a diving instructor because I love the sea,” she recounts. “So I took a trainee course and became an instructor, but that job only lasted for half a year because as a single parent I had to generate the salary of two persons, and that was not possible from diving.”\nShe got into a corporate job – as a money-laundering reporting officer with a gaming company – and now she lives in a flat in Rabat with her two children, a girl of 11 and a boy of 13, as well as their Airedale terrier, a Yorkshire breed of terrier that’s uncommon in Malta.\nMs Appelgren has become known for her regular cleanups around the Maltese Islands, something that she started in 2014. She coordinates the activities through a Facebook group – called Malta Clean Up – that boasts 7,300 members. She mounts a cleanup at least every month, which attracts between 10 and 70 participants, and she organises an annual national multi-site cleanup held in collaboration with local councils in which participants number between 1,000 to 2,000 people.\nAbortion is a question for the Maltese people, not for the EU to impose on Malta\n“During the cleanups we educate people at the sites,” Ms Appelgren says. “We report anything illegal we see – the group is not just about cleanup – this is more a holistic effort that I am leading.”\nHer estimation is that the amount of litter around the country remains as prevalent as it was when she started out in 2014. “But the population has increased. And taking into account the increase in population, the litter per capita has decreased. That means things are getting better, and we need to keep on doing what we are doing.”\nShe will maintain the momentum in her political campaign: maintain the tempo of cleanups, getting out there with her children and dog and mingling with people, delivering talks to companies on invitation about the environment and the green movement.\n“I shall trust the people,” she said. “I trust my followers to spread the message.”\nAt the same time, despite the non-politician imagery, in the few weeks since she has announced her candidacy Ms Appelgren has grown into the role. Her Facebook comments have become more measured and she has started to communicate to the media in rhetorical flourishes. She is setting herself up for success.\nYet her foreignness and womanhood has made her more susceptible to controversies. For example, an erstwhile comment on abortion has been dug out and made the rounds on social media last week, forcing her to spend a week reiterating that the personal choice she made – when she got pregnant at a relatively young age, and had her son – “should explain my personal view.”\nAsked to elaborate, she says that her MEP platform is solely on the environment in a holistic manner, and abortion is an issue that is beyond the bounds of her MEP candidacy.\n“I raised two children as a single mother, so my personal choice was clearly for motherhood,” she says, adding that in any case she believes that abortion is “a question for the Maltese people, not for the EU to impose it on Malta”.\nShe has also been criticised for not speaking Maltese, impertinent criticism when considering that she is bidding for the European Parliament in Brussels, where Maltese proficiency would hold no advantage.\n“My children go to State schools,” she points out, “and I have been helping them with their Maltese homework. I know the basics, and can follow discussions in Maltese, but my time constraints as a single parent have not enabled me to pick up the language faster. I am now going to be making a bigger effort to learn the language quicker. It’s a beautiful language. But at the same time I have to prioritise: I would rather dedicate more of my time to the Maltese environment.”\nAs an MEP candidate, her main political plank is “the environment, and what’s connected to it – infrastructure, public health, and transport – all areas where Malta is having some challenges at the moment.”\nMs Appelgren likes cycling and walking in her free time. She has a car, but she takes the bus to work. “It makes me part of the solution,” she says about taking the bus. “I also get the time to read, think and work [on the bus].”\nPart of her pitch is that fresh blood is needed in politics in Malta, and parties like the PD – “a party made up of liberals and democrats” – are essential to break the mould of the two large parties.\nShe sees her role as “attempting to bring about change faster through politics. At the moment, in Malta we always seem to be playing catch-up with sustainability targets set by the EU. I would like to see Malta perform above EU targets and standards. It is possible as a small country. I think we should set the pace, and I am interested in empowerment of Malta for greater achievements.”  ", "comment_count": 123, "id": 2087}, {"keywords": "", "author": "", "article_body": "The Democratic Party is requesting a ministerial statement on Malta’s security to clarify any threats which were being addressed or ignored.\nIn a statement on Wednesday, PD noted that the US on Monday unveiled criminal charges against Chinese tech giant Huawei, two of its subsidiaries and a senior executive, accused of misleading banks about the company’s business and violating US sanctions.\nThe company has been blacklisted on allegations of corruption and espionage in many parts of the world.\nPD said 5G mobile connectivity was introduced in Malta in October, following the signing of a memorandum of understanding between Huawei and the government, with the aim to motivate research and development in the sector.\n\"Is our security, and that of Europe, under threat, considering that this global technology powerhouse has been repeatedly caught out as having different intentions from its stated objectives? Does Malta have the means to check on this and keep Huawei in check,\" MEP candidate Martin Cauchi Inglott asked.\nMP Marlene Farrugia added:\"We had everything going well for us in this sector, having sailed through two financial crises. Why have we been pushed by our government into business entanglements with companies which other Western countries are expelling for security reasons? Our government has sold us lock, stock and barrel in the name of its shady crony deals.\" \nPD said it was concerned because the security and interests of the Maltese people were not being guarded. Moreover, Transparency International downgraded Malta to its lowest level ever on the Corruption Perception index.\nThe party said it recently tabled in parliament two Private Members’ Bills, one proposing scrutiny of the Malta Financial Services Authority, eGaming and the Financial Intelligence Analysis Unit, and the other to combat international organised crime in Maltese waters.", "comment_count": 7, "id": 2088}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Lands Authority’s website remains offline two months after a data breach was exposed by Times of Malta, with clients forced to visit the regulator’s offices to settle even the smallest of issues.\nThis newspaper reported in November that a massive security flaw had led to a large amount of personal data being dumped online. The flaw made data easily searchable through a search on engines such as Google.\nTimes of Malta accessed more than 10 gigabytes of data, which included personal information such as scans of ID cards and e-mail correspondence. The website went offline within hours of the Times of Malta flagging the breach to the Information and Data Protection Commissioner who launched an investigation.\nA spokesman for the commissioner said the investigation into the data breach was “in its final stages”. \n“The commissioner will be issuing his decision, together with a press statement, in due course,” the spokesman said without elaborating.\nA spokesman for the Lands Authority reiterated that the watchdog was taking the “alleged incident very seriously, leaving no stone unturned, having engaged local and foreign experts in the field, subjecting the website and its applications to robust, in-depth testing and risk assessments”.\n“Tests are still ongoing. The Lands Authority is still very much actively communicating with the Information and Data Protection Commissioner and is taking on board forthcoming suggestions, direction and/or instructions,” he added.\nRead: Website developers point fingers at the Lands Authority for data breach\nThe breach was discovered just months after the general data protection regulation, a new EU-wide data protection law, came into force. It sets out a number of procedures and penalties in case of breaches, including fines of up to €20 million.\nClients who made use of the Lands Authority website on a regular basis complained to this newspaper they must now go to the regulator’s offices to handle even the smallest of issues, including payment of outstanding rent bills.\nOne client who spoke to Times of Malta on the condition of anonymity said he had an outstanding rent bill of a few euros to settle and was forced to go personally to the regulator’s offices in Valletta instead of simply paying it online.\n ", "comment_count": 7, "id": 2089}, {"keywords": "", "author": "", "article_body": "The Malta Employers’ Association is calling on the government for a reassurance that the state would fund any increase in labour costs related to a new directive on work-life balance.\nA provisional agreement on the European Commission's proposal for the directive was reached a few days ago.\nRead: 10 days of paternity leave are ‘just the beginning’\nOnce the agreement is formally adopted by the European Parliament and the Council, states would provide added benefits to parents and carers to balance work and family responsibilities.\nFathers would benefit from 10 days paternity leave, there would be four months parental leave and an annual five days carer’s leave.\nThe association said that while it is not against family-friendly measures in principle, these benefits should not be added to the financial burden employers are already carrying through the payment of maternity leave and increased annual leave.\nNew 10-day paternity leave plan shot down\nThis additional leave placed Malta among the countries with the highest number of annual leave days in the world, it said.\nEmployers - micro-businesses in particular - would already be faced with increased disruption and loss of productivity from increased absence from work due to these measures.\nThey could not be expected to also carry the cost of paying the salaries during those absences if Maltese enterprise was expected to remain competitive, the MEA said.", "comment_count": 25, "id": 2090}, {"keywords": "", "author": "", "article_body": "An 18-year-old woman was grievously injured in a traffic accident in Naxxar early on Tuesday.\nThe police said the accident happened in Triq il-Balal at 12.15am.\nThe woman, from Ħamrun, was a passenger in a Toyota that was being driven by a 20-year-old man from Fgura. The Toyota was involved in a collision with a Peugeot Partner that was being driven by a 20-year-old man from San Ġwann.\nThe woman was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2091}, {"keywords": "", "author": "Ivan Martin", "article_body": "Xarabank host Peppi Azzopardi was the first Maltese personality to share snippets of the hate speech he regularly receives as part of a new Times of Malta #stophate campaign.\nThe campaign is aimed at tackling the proliferation of hate speech and the dangerous discourse that has swamped social media.\nThe project also seeks to raise awareness on the impact hate speech can have on its recipients, and the responsibilities that come with freedom of speech.\nMr Azzopardi, who is well-known for his pro-integration views, said his inbox was regularly flooded with hateful messages, particularly when his popular discussion programme features migrants and multiculturalism.\n“You like these migrants, until a couple of them get their hands on your wife – unless they’ve already started,” Mr Azzopardi read from a message he had recently seen through social media.  \nRead: Online hate speech growing fast, but many Maltese don't know they are breaking the law\nHate speech in Malta is a major issue. Research shows that hate speech is widespread and that under-reporting is a contributing factor to its proliferation.\nIt is also clear that hate speech laws are often misinterpreted and underused.\nThe Times of Malta campaign will feature other personalities reading out the hate messages leveled out at them on social media.\nRead: #Stophate project aims to clamp down on Malta's online hate speech\nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com", "comment_count": 0, "id": 2092}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A Malta-based online gambling firm that employs more than 80 employees is being subjected to rigorous scrutiny for its operations in Belgium following an investigation connected to the Panama Papers. \nThe Belgian Gaming Commission a few days ago announced it had started a sanction procedure against Betway because of its “cumulative licence and the lack of transparency of its ownership”.\nA spokeswoman for the Belgian regulator, Marjolein De Pape, said the commission’s findings were now sent to the public prosecutor, the anti-money laundering unit and the Special Tax Inspectorate for further information and possible action.\nA probe on Betway was launched in 2017 after the company’s mentioning in the Panama Papers, which detailed an opaque corporate structure of companies looking to minimise their tax obligations in various countries.\nLicensed by the Malta Gaming Authority, Betway, registered in Malta and operating from offices in Gżira, is owned by Betway Group Ltd, registered in the British Virgin Islands and Cybergaming Consultants, a Ta’ Xbiex company, which only holds a nominal share.\nThe identity of the real shareholders of the company, registered in the tax haven of the British Virgin Islands, is not known. When contacted, a spokesman for Betway confirmed that the company was collaborating with the Belgian authorities while insisting that, so far, no proper sanctioning initiative has been started but only a “review”.\nNo sanctions has been decided on\n“All information requested by the Gaming Commission in Belgium has been provided to them, and they have informed us that a review of that information is now underway by the board. At this stage no sanction has been decided on,” the spokesman said.\nAsked who owns Betway, the spokesman did not reveal names. \n“Betway is owned and funded by a group of private shareholders who have been highly successful in both the gaming and technology sectors,” he told Times of Malta.\n“As with any private company, the shareholders very reasonably choose not to publicise their investment in Betway or other companies, but provide all the information necessary to the relevant official bodies as required.”\nThe Maltese regulatory authorities said they are monitoring the situation. Acknowledging this was a matter for the Belgian authorities, an MGA spokesman said that, “as a matter of procedure, the MGA follows up on all adverse media remarks with the operator, or as necessary, with the concerned regulator”.\nThe reference to Betway in the Panama Papers was immediately picked by the Belgian press, particularly as the company sponsors the country’s most known football club – RSC Anderlecht.\nAmong the Panama Papers documents, some appear to show that Betway received a €28 million investment in December 2014 from the unknown shareholders in the British Virgin Islands.\nAccording to the Belgian gambling regulator, it had attempted to identify the sources of these payments, particularly in reference to the funding of sponsorship deals with Anderlecht football club, but was unable to do so.\n ", "comment_count": 30, "id": 2093}, {"keywords": "", "author": "", "article_body": "These are the main stories in Tuesday’s newspapers.\nTimes of Malta says Malta has plummeted eight spots on Transparency International’s annual corruption perception index, placing at a record low of 54th on the annual graft indicator. In another story, the newspaper says the infrastructure at the airport arrivals lounge is the most worrying aspect of Brexit for the director general of the Customs Department, with most of the other bases already well covered.\nThe Malta Independent says Malta had the second highest number of psychiatric hospital beds per capita in EU in 2015.\nIn-Nazzjon says it is not just prisoners who are complaining about the bad situation at the facility, their wardens also say they are badly treated.\nL-Orizzont says health authorities insist there is no cause for alarm after an eight-month-old baby is admitted to hospital with septicaemia.", "comment_count": 0, "id": 2094}, {"keywords": "", "author": "", "article_body": "A 56-year-old motorcyclist from Tarxien was grievously injured early on Tuesday in a traffic accident in Marsa.\nThe motorcyclist was riding a Kymco Venox that was involved in a collision with a vehicle that left the site of the accident.\nThe police said the accident happened in Triq il-Ħaddiem at 12.30am.\nMembers of the Civil Protection Department assisted the victim who was then taken to Mater Dei Hospital by ambulance.\nPolice investigations are ongoing.", "comment_count": 0, "id": 2095}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 7.45pm with PN reaction - Malta has plummeted five spots on Transparency International’s annual corruption perception index, placing at a record low of 51st on the annual graft indicator. \nThis year’s ranking, to be released on Tuesday, means the country has gradually slid 26 positions since its first ever inclusion in 25th place.\nTransparency International’s regional advisor for Western Europe Nacho Espinosa told the Times of Malta that the worsening score came as no shock. \n“More than one year after the assassination of journalist Daphne Caruana Galizia, who was killed while reporting on corruption, it comes as no surprise that the expert assessments and business executive surveys used to compile the corruption perception index would continue to agree on a worsening situation in the country,” Mr Espinosa said. \nHe said Malta’s score, on which the global rankings were calculated, has decreased by six points over the past three years, from 60/100 in 2015 to 54/100 in 2018.\n\nThis score puts Malta under the 66/100 average for EU and Western European countries. \nDenmark, Finland and Sweden were the best performers in Europe, with scores of 88, 85 and 85 respectively. \nDenmark, Finland and Sweden are the best performers in Europe\nSeven EU countries, namely Italy, Slovakia, Croatia, Romania, Hungary, Greece and Bulgaria, ranked lower than Malta on the corruption perception index. \nMr Espinosa said that in recent years, Malta had been embroiled in scandals connected to the Panama and Paradise papers, the collapse of Pilatus Bank as well as controversy surrounding the golden visas scheme, which had all impacted its ranking. \nHe said the Venice Commission’s report in December 2018 found serious issues in the judiciary in Malta, indicating problems with upholding the rule of law. \n“This is the critical area that the government of Malta needs to address to reverse the negative trend, rule of law at all levels,” Mr Espinosa said. \nThe Council of Europe’s Venice Commission, a body of world-respected constitutional experts, said that the Prime Minister’s office was at the centre of power in Malta, and better checks and balances were needed. \nOther important bodies, such as the President, Parliament, Cabinet, the Judiciary and the Ombudsman, had too weak an institutional position to provide sufficient checks and balances, the commission warned.\nPrime Minister Joseph Muscat has vowed to implement the Venice Commission’s key proposals, but the government has yet to offer any firm deadlines for such reforms. \nAmong the commission’s recommendations are the setting up of a prosecutor’s office independent of the Attorney General, a strengthening of the President’s role and more independence for the judiciary.\nPN reaction - Government condemned according to its own yardstick\nIn a reaction, Opposition leader Adrian Delia said that while it was in opposition, the Labour Party had adopted the Transparency International yardstick for corruption in Malta.\n\"By its own yardstick, it has now emerged that the Labour government is the most corrupt government which Malta has ever had,\" he said.\nThe Muscat government was being seen as more corrupt than the governments of countries which lacked democracy and were led by regimes. \nThe outcome of the Transparency International survey, Dr Delia said, was the result of a whole series of scandals involving corruption and money laundering which had been condemned by many European institutions, the most recent being the European Commission's criticism of the sale of passports. \nDr Delia said the government needed to shoulder its political responsibilities and stop further harm to Malta's reputation. Corruption had a price which people ended up paying.  \nDo you know of any corruption taking place? \nContact us securely using via e-mail, Securedrop or post using the instructions found here: https://www.timesofmalta.com/services/secure_news_tips", "comment_count": 168, "id": 2096}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Did you know that court can carry out proceedings in the Maltese sign language, that the Housing Authority provides financial aid to adapt one’s home because of a disability or that a trust can look after a disabled child when the parents die?\nThese are just three of the 87 questions addressed on a new online platform aimed at empowering people with a disability and their carers by knowing their rights and where to seek access to such rights.\nThe online site forms part of the Know Your Rights project, aimed at people with a physical disability, mental health issues and learning difficulties. It seeks to make information easily accessible, including through audiovisual features and leaflets.\nThe launch of the online platform followed a comprehensive research study into the main issues, interests and obstacles faced by people with a disability.\nInterviews were held with people with a disability and their carers, focusing on several areas including employment, estate planning and guardianship, leisure and sport, access to goods and services, abuse and hate crimes as well as access to justice.\nA set of Frequently Asked Questions was then compiled based on the information about the challenges the interviewees face.\nThe FAQs do not provide legal, medical or professional advice but offer general information and often link to the entity that could provide professional guidance and information.\nKnow Your Rights, a project by Inspire (The Eden and Razzett Foundation) with Richmond Foundation as a partner, is co-financed by the Voluntary Organisations Project Scheme 2018.\nLog onto www.know-ur-rights.com for more information.\nSome of the interviewees’ challenges\nA 28-year old man, who encountered physical accessibility obstacles when attending a job interview to fulfil the role of a teacher, was told: “You should have informed us that you are a person with a disability.”\nA deaf woman, who has to be accompanied by a relative on hospital appointments as she would otherwise spend hours waiting even though she would have informed the staff about her hearing impairment, said: “With the interpreter we should be served sooner… but how long can the interpreter wait? And what if she has another appointment with other clients?”\nA woman who uses a wheelchair but has to share the road with cars in her hometown remarked: “Cars honking… they don’t wait because no one understands that you cannot go on the pavement. Lack of thought, lack of planning.”", "comment_count": 1, "id": 2097}, {"keywords": "", "author": "", "article_body": "Petrol station owners have formally approved a deal negotiated by the GRTU with the Energy Ministry following their call for an increase in profit margins to help them improve their facilities in line with new standards.\nThe deal was announced last Saturday after a meeting which GRTU officials had with Energy Minister Joe Mizzi.  \nPrior to the conclusion of the talks the petrol station owners had switched off automatic vending machines to press their case. That action was called off on Friday.\nNo details of the agreement have been given, other than that prices will not rise for motorists.\nThe GRTU said it would now insist that members complete their upgrading within the deadlines.\nOperators must refurbish their stations by next year to ensure they are in line with requirements set by the environment and energy regulators, ERA and REWS.\nThey say the upgrades could cost as much as €500,000 per station and that they cannot afford to undertake the works without a helping hand from the government. ", "comment_count": 11, "id": 2098}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "When one speaks of ‘tokens’ or ‘landa’ in Maltese, Strait Street in Valletta instantly springs to mind. \nTony and Jeanette Stivala recently published a book about their collection of Maltese tokens. Photos: Mark Zammit Cordina\nBut the history of these mostly brass or copper pieces goes further back in time and their scope was much wider than that of getting a drink or dancing with the barmaid during the heyday of the infamous night spot.\nTony Stivala and his Scottish wife Jeanette, née McLarty, have been collecting tokens, as well as many other Maltese artefacts, for about 20 years and have recently published a book on their endeavour. \nThey became interested in these items quite by chance.\n“One day, an English collector came to our bar and asked me if I had any tokens,” said Mr Stivala, who runs Times Gone By in Gżira. \n“I was instantly intrigued and being an avid collector of Maltese memorabilia, I thought ‘why don’t I start collecting them myself’?”\nHis wife helped him with the research and found, among other things, that tokens were first used in Malta during the time of the Order of St John but became especially popular during the British period. The book, published by Horizons, in fact focuses on the late Victorian era to the 1960s.\n\n“Tokens were used quite profusely at the time. There was a lack of coinage owing to the increase in the number of visitors to the island, especially navy and army personnel, who frequented entertainment spots across the island,” noted Ms Stivala, who is from Northfield in Aberdeen.\n“However, everyone assumes that these tokens were used only in Strait Street but far from it,” she exclaims. \nAs Emmanuel Magro Conti, senior curator at Heritage Malta, explains in the book’s foreword, the use of tokens instead of the official legal tender issued by the government forms part of ‘exonumia’, a term that incorporates all numismatic items made of various materials, sizes and shapes other than official coins and paper money. \nThe book features illustrations by George Apap.\nA token from the dance hall Palais des Dances in Strait Street.\nHe mentions three examples of tokens: some that were purely used as money substitutes for trade purposes; others that were considered the equivalent of cheques and that had a variety of uses, including advertising; and others that replaced medals, coins and today’s credit cards and were issued by companies for clients who had accounts with them. \nLeafing through the publication, which features over 500 tokens, one can learn about Malta’s social and economic history. Old photos and illustrations by George Apap give readers a better idea of the context in which tokens were used.\nTwo tokens used at Salinos Cinema in Strada Reale, Valletta\nMaltese Tokens mentions bars, restaurants, hotels and establishments, many of which are no more or have changed use. These include Redoubt Bar in Birżebbuġa, a popular place among navy personnel and which still exists; Chez Charlie’s, Chez Vency and Gardenia Bar in Floriana; Granada Bar in Gżira, which was very popular among sailors stationed on naval vessels docked at Manoel Island, then a submarine base; Cairo Bar in Sliema and Tiger Bar in Marsa, then a well-known meeting place among British servicemen in the area.\nThe couple managed to find tokens of innumerable bars in Strait Street, such as the Blue Heaven, British Crown Rest Bar, Dirty Dick’s Bar, which was popular among the gay community, King George VI Bar, Queen Elizabeth Bar, Sussex Bar, Matador Jazz Bar, Piccadilly Bar, Retainer Bar, Roy Bar and The Splendid Bar & Hotel, which is sometimes used as an exhibition space nowadays.\n\nOthers include Tico Tico Bar, Carmen Bar, Larry’s Bar, Loop Bar and Silver Horse Bar, all of which have recently reopened. Tokens were also used in clubs such as the Australia Hall in Pembroke and the Vernon Club, a social club for British servicemen which occupied the premises of what is now the Central Bank of Malta in Valletta.\nDuring the 1930s, churchgoers in Żejtun also had to use tokens to pay for the use of a chair in their parish church, while worshippers at St Paul’s Anglican Cathedral in Valletta made tokens in memory of deceased loved ones and the money collected went towards the cathedral.\nThe couple is proud of their feat but mostly of the contribution they are making to Maltese melitensia. \n“These tokens form part and parcel of Maltese identity,” said Ms Stivala, who settled in Malta 41 years ago. \n“We would like to be able to help retain this identity and get youths interested in Malta’s history through our book.”\nTop: These tokens were used in various canteens in Malta. Bottom: Three tokens made to commemorate the dead at St Paul’s Co-Cathedral in Valletta.\nMr Stivala is an avid collector of Maltese memorabilia. He is seen here holding the first passport of former Maltese prime minister George Borg Olivier.", "comment_count": 3, "id": 2099}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Some 20,000 children in Malta and Sicily will participate in a project seeking a less invasive screening method for coeliac diseases that leads to an earlier diagnosis.\nA Health Ministry spokeswoman told the Times of Malta that the children who will be screened for coeliac disease were aged between four and 11 and the project would be launched this week.\nFinanced by the cross-border programme Interreg Italy-Malta, which uses European regional funds to enhance cooperation, innovation and research between European countries, research for the project will be on computer-assisted diagnosis of the disease.\nSo far, a suspected case of coeliac disease is investigated through blood tests and an endoscopy. It had been shown that this is both expensive and invasive, the spokeswoman noted.This procedure is expected to yield an earlier diagnosis and management of the condition with reduced morbidity for the patient, as well as significant cost saving to the country\nThe project would be looking into a different approach, involving the use of what is known as a point-of-care test, as a screening tool to detect potential coeliac cases. These are then investigated further to arrive at a diagnosis.\nIn modern medicine, point-of-care tests are done close to the patient, such as at home or at a healthcare practitioner’s office, and are often carried out through hand-held devices, like glucose meters.\nThe spokeswoman said the aim was to combine the result of the point-of-care test, a validated questionnaire and a laboratory investigation to generate a computer-based tool that could be used to arrive at a coeliac disease diagnosis without the need for an endoscopy, therefore avoiding an invasive procedure.\n“This procedure is expected to yield an earlier diagnosis and management of the condition with reduced morbidity for the patient, as well as significant cost saving to the country,” she added.\nThe University of Palermo and the Maltese Health Ministry are leading the project.\nAn estimated one in 100 people suffers from coeliac disease in Europe but only a quarter of them receive an accurate diagnosis. \nIn fact, coeliac disease is the most common food-related chronic disease among children in Europe with the prevalence rising in recent decades.", "comment_count": 0, "id": 2100}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "Marriage separation proceedings kickstarted last year outnumbered the number of weddings at the altar, information given in parliament shows.\nAnd the number of civil weddings also continued to gain in popularity over church weddings.\nThere were 1,423 civil weddings last year compared to 1,129 Church weddings, Prime Minister Joseph Muscat told Labour MP Byron Camilleri.\nNo breakdown was given on the number of weddings involving foreign couples. \nLabour MP Etienne Grech then asked Justice Minister Owen Bonnici on the average number of marriage separations registered every day last year.\n \nIn his reply, the minister said there were 290 notes of amicable separation, 907 letters of mediation in contentious separations and 114 applications for separation cases. This, the minister said, gave a total of 1,311 separations, which meant that the average number of marriage separation cases started every day last year in Malta was 3.6. \n\nIn Gozo, proceedings were started for 47 marriage separation cases during last year, or four every month.\nThe number of civil weddings has been exceeding the number of church weddings since at least 2016.\n\n\n\nYear\nChurch weddings\nCivil weddings\n\n\n2010\n1,547\n740\n\n\n2017\n1,208\n1,394\n\n\n2018\n1,129\n1,423\n\n\n\nAnd while some of the increase in civil weddings can be explained by the number of foreigners choosing to marry in Malta, the number of church weddings has been in decline. \n ", "comment_count": 57, "id": 2101}, {"keywords": "", "author": "Edwina Brincat      ", "article_body": "Maximilian Ciantar, who in 2010 ran over twin girls at a zebra crossing at Attard, has landed another jail term after being found guilty of crashing into a woman’s car and threatening to run over the driver.\nMr Ciantar, 28, of Marsa, stood accused of multiple charges related to the July 2014 incident, when he crashed into a Toyota while driving his mother’s Renault just a few metres away from his house.\nWhen the female driver got out and confronted him, Mr Ciantar had allegedly threatened to smash her car once again - which he then did – and threatened to run her over. He then fled the scene.\nThe whole episode, relayed to the police by eyewitnesses, had sparked off a manhunt. Mr Ciantar was eventually tracked down at his grandmother’s house at Qormi, evidently under the influence of drugs.\nThe court, presided over by magistrate Claire Stafrace Zammit, declared him guilty and condemned him to a nine-month jail term and banned him from driving for two years.\nInspector Robert Vella prosecuted.Lawyer Joseph Brincat was defence counsel.", "comment_count": 0, "id": 2102}, {"keywords": "", "author": "Ivan Martin", "article_body": "Speaker Anġlu Farrugia on Monday weighed in on a procedural matter that last week saw the Public Accounts Committee descend into a screaming match between Government and Opposition MPS.\nThe PAC descended into farce last week as Nationalist and Labour MPs sparred for a full hour over whether Opposition MP Jason Azzopardi should deliver a statement verbally or in writing.\nCommittee chairman Beppe Fenech Adami had argued that previous witnesses before the committee had all been allowed to read out their statements, while Labour MP Robert Abela insisted this was at the discretion of the committee and demanded a vote.\nAs shouting ensued, Dr Fenech Adami eventually requested a ruling from the Speaker and suspended the meeting.\nIn his lengthy ruling, delivered on Monday, Dr Farrugia found that in the absence of an agreement in the committee, the witness should be given a period of time – ideally not longer than 10 minutes – to explain the salient points of their written statement.\nShortly after the ruling was issued, Dr Azzopardi took to Twitter to claim vindication.\n\n\n\nThe PAC proceedings revolve around the controversial Fekruna Bay expropriation deal and a National Audit Office report into the 2013 land deal by the previous Nationalist administration.", "comment_count": 7, "id": 2103}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who accidentally killed a friend and work colleague in a traffic accident  just over two years ago has been ordered by a court to do 450-hours of community service after a magistrate heard how the family of the deceased were not seeking a custodial sentence, and the victim had been crossing the road in a poorly-lit section when a zebra crossing was close by.\nVladimirs Puzanovs, a 27-year old Latvian national, had been behind the wheel of a Hyundai i10, on the night of December 16,2016 after a staff party at Bahar iċ-Cagħaq when he hit Dutch national Luc Clous, 20, who was crossing St Andrew’s Road, St Julian’s.\nMr Clous, had been returning from the same party but with a different group of friends, inside another car when he was asked to get out after an argument that was about to boil over.\nThe young man, with a blood alcohol concentration that was “twice that of the drink/drive limit and consistent with it producing a state of drunkenness in a normal social drinker”, was hit by the accused’s car which drove on and was found later parked at Birzebbuga.\nThe victim was pronounced dead on site by paramedics who rushed to the scene shortly after 4am.\nMr Puzanovs, who was accused over the hit and run incident, pleaded guilty and explained to the court how he had not realised he hit anyone, and he had been bearing the burden of guilt while facing proceedings over the involuntary homicide.\nWhen delivering judgment, Magistrate Donatella Frendo Dimech took into account a number of factors surrounding the dynamics of the incident, termed as “tragic and unfortunate.”\nA number of eyewitnesses testified that they never saw the victim crossing the road at the time of the accident, nor had they even realized that a pedestrian had been run over.\nSignificant weight was given to the findings of a court-appointed expert who reported that the street had been poorly lit and that visibility had been made worse by the position of trees as well as adverse weather conditions at the time.\nAll this was compounded further by the fact that the victim had been wearing black whilst crossing the road at a point, some 9.2 metres away from a pedestrian crossing.\nMoreover, toxicological tests had shown that the victim had been under the influence of alcohol and was probably labouring under the effect of cannabis consumed shortly before he met his fate.\nWhen meting out punishment the court also took into consideration the accused’s admission of guilt, his clean criminal record, the nature of the offences as well as the circumstances of the case, lending particular attention to recommendations made by the Officer for Probation and Parole who deemed that “the interests of society are better served through the imposition of a community service order instead of a custodial sentence.”\nEven the victim’s family had not insisted upon a custodial sentence upon the accused who, reportedly had been traumatized by the unfortunate episode, the court observed.\n“Sight cannot be lost of the fact that a human life was lost; a loss which could have been averted had the accused exercised due prudence and caution,” the court said, declaring the accused guilty and placing him under a community service order of 450 hours as well as a treatment order for two years “so that he may be afforded the necessary psychological help needed.”\nThe court also banned him from driving for 2 years and to fork out court expert expenses.\nSenior Inspector Trevor Micallef prosecuted.\nLawyer Joseph Giglio was defence counsel.", "comment_count": 2, "id": 2104}, {"keywords": "", "author": "Edwina Brincat      ", "article_body": "A man accused of handling stolen car parts was cleared of all charges after a court ruled that a solitary palm print on the car was not unequivocal proof.\nMarjohn Desira, 23, was accused of stealing parts of a BMW which had been reported stolen in October 2013 from Fgura, where it had been parked opposite its owner’s home.\nTwo months later, the car had turned up in Żejtun, abandoned and missing its bonnet, front bumper, number plates, mirrors, battery and other personal items which had been left inside it by its owner.\nInvestigators found Mr Desira’s palm print on the car’s metal work, between its bonnet and right front wheel.\nHe was arrested and confessed under interrogation to having taken parts from the stolen car and transferred them to another BMW registered under his brother’s name.\nThree weeks later, that vehicle was sold for €600 to an old car enthusiast from Tarxien, who confirmed in court that he had bought the car from a buyer who went by the surname ‘Desira.’\nHowever, he could not remember the seller’s name or nickname and was unable to identify the accused or his brother in court.\nTwo third parties had confessed to stealing the car and declared that Mr Desira had nothing to do with the theft.\nMoreover, Mr Desira had spoken to police without the help of a lawyer, meaning his statement could not be used as evidence against him.\nThe court, presided over by magistrate Aaron Bugeja, observed that the solitary palm print, uncorroborated by the accused’s statement, did not amount to unequivocal evidence linking him to the theft of the car parts.\nThe print was “circumstantial and not direct” evidence which alone could not prove the prosecution’s case beyond reasonable doubt, the court observed, especially since the BMW had been abandoned in a place accessible to the public.\nMoreover, the accused could have merely touched the car but not dismantled its parts.\nThe court cleared the man of all accusations.\nLawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 2105}, {"keywords": "", "author": "Ivan Martin", "article_body": "A dilapidated Birkirkara townhouse is being transformed into State accommodation for Gozitan students and relatives of patients who will be able to spend the night when the need arises, Gozo Minister Justyne Caruana announced on Monday.\nAddressing a press conference, Dr Caruana said the building, Villa Lauri on Birkirkara’s busy Mannarino Road, would house some 33 beds in a series of self-contained studio apartments.\nThese would be available for Gozitan students or Gozitan relatives of patients in  hospital who require a bed to spend the night in.\nA system was being worked out with the University of Malta administration on the way students would be allocated apartments and what criteria would be needed.\n\n“What is certain is that we want to avoid any type of stigma,” she said.\nRead: For Gozitan patients treated in Malta, home is a long way away. \nVilla Lauri was passed on to Church in the mid-1970s and had served as free accommodation for refugees for several years.\nIt has, however, been closed for some time, slowly falling into disrepair. An agreement was reached between the Government and the Church last year for the use of the building.\nDr Caruana said tenders had just been issued for contractors to renovate the building, which is expected to be open by the end of the year.", "comment_count": 10, "id": 2106}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The LGBTIQ community is mourning the death of “trailblazer and icon” Katya, a pioneering Maltese transgender model and performer.Katya, who died aged 63, was well known as a cabaret performer in clubs around Malta and London in the 1970s, and appeared as a model for Vogue magazine and several international agencies. The rights group Allied Rainbow Communities described her as a “trailblazer and icon” who “dared crossing very dangerous waters in a time where the island was still very conservative.”She dared crossing very dangerous waters in a time where the island was still very conservative.“Katie was a good soul who battled her demons by living the life of a star, well as well as she could, anyway,” close friend Anthony Sultana told Times of Malta, recalling a glamorous youth that included modelling with Karl Lagerfeld and partying with David Bowie and Mick Jagger. Photo: Albert Buhagiar\nBut Mr Sultana also recalled his friend’s kindness and generosity: “I personally will be forever grateful to dear Katya for taking me in when I had no place to stay,” he said. “She was, for a while, the Mother Teresa to a group of us homeless, young, gay men.“She was also very witty, forever quoting lines from Bette Davis Gloria Swanson and Joan Crawford movies, like she studied the parts and played them herself.“I will always remember her as the beautiful woman who brought a smile wherever she sashayed.”“She was, for a while, the Mother Teresa to a group of us homeless, young, gay men.Among those paying tribute on Monday were the lobby group MGRM, fashion designer Charles Van Maarschalkerweerd Borg and transgender model Karly Naudi, who hailed Katya for pushing boundaries for other transgender people and for “the courage to be her true self in a dangerous time for anyone within the LGBTIQ Spectrum.”“Even though we only met a couple of times, I want to thank you for helping me understand who I truly am and inspiring me with your style, poise and incredible strength,” Ms Naudi wrote on Facebook. Allied Rainbow Communities has encourage friends, loved ones and others who knew Katya to email with their memories as part of a tribute “to keep her alive as one of Malta's historic LGBTQ icons”", "comment_count": 20, "id": 2107}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 4.58pm with UĦM reaction\nThe current one-day paternity leave is a huge injustice, according to the Association for Equality, welcoming an EU directive increasing the entitlement to 10 days and noting it is “the least fathers should be granted”.\nThough, by Maltese law, mothers can benefit from up to 18 weeks leave, fathers only enjoy a single day of birth leave.\nThe new Work-Life Balance Directive, agreed upon by the European Parliament and the Council of Ministers, will, among others, introduce a 10-day paternity leave remunerated at not less than the national sick pay level.\nA4E chairwoman Anna Borg told the Times of Malta the entitlement at present was, firstly, an injustice to fathers who also needed to get to know and bond with the child while sharing the caring roles. Equality for all went both ways, she added.\nIt was also an injustice to mothers because, with such a disparity, in the employers’ eyes men will remain the ideal employees as they were not obliged to take on caring roles and, therefore, parental leave on the birth of a child.With the economy doing well, cannot the country afford to invest in the upcoming generation of workers, tax payers and social security contributors?\n“Ten days of paid birth leave is just the beginning, especially in a context of falling birth rates, which are below the replacement rate.\n“With the economy doing well, cannot the country afford to invest in the upcoming generation of workers, tax payers and social security contributors?” she asked. \nStudies clearly showed that the long-term benefits of paid paternity and parental leave outweighed the initial outlay cost and had a direct positive impact on the economy, the family and demographics, Dr Borg noted.\nIn comments to Times of Malta last week, the Chamber for Small and Medium Enterprises (GRTU) shot down the directive proposal and the Malta Employers’ Association said it resisted any further financial burdens on employers.\nDr Borg said it should be up to the State to provide remuneration for paternity leave. In all probability, she added, if fathers had longer birth leave, mothers would go back to work earlier.\nAs things stood, it seemed that while women had shifted into the world of work, fathers had not made the move into the caring role at the same pace, meaning the changes added stress on mothers.\nWhile all harped on equality at an education level and securing a high rate of female graduates as a consequence, it had also to be made clear that caring roles should be shouldered jointly and that the matter should be facilitated by the State, Dr Borg remarked.\nApart from paternity leave, the new directive, for which Nationalist MEP David Casa was the European Parliament’s rapporteur, will introduce new rights such as flexible working arrangements, four months parental leave, of which two months will be paid and are non-transferable, and a five-day carers’ leave for those who need to look after relatives.\nA4E noted the positive step in ensuring that two of the four months parental leave granted would now be paid. This should encourage more fathers to share their parental leave with the mothers, especially if the levels of compensation were equal to one’s own salary level.\n“These work-life balance measures are a step in the right direction for the much needed reforms to meet the emerging needs of modern families,” the NGO said.\n“In Malta today, the majority of young mothers and fathers are in paid work and have to struggle daily to cope with the caring responsibilities of their children and the demands of work.”\nA4E urged the government to move towards the swift transposition of the directive and expressed hope that payment levels would be high.\nForum Unions Maltin calls on government to discuss with social partners\nForum Unions Maltin welcomed the proposed EU work-life balance directive, saying it has supported the directive from its initial stages.\n\"The confederation believes that since this directive sets out the minimum entitlement, it is now up to Government to, in discussion with social partners, seek the implementation of the best model, which will see improved parental leave and measures supporting the family.\"\nUĦM welcomes directive\nThe UĦM Voice of the Workers also welcomed the directive. Sharing responsibilities between the parents would not only benefit women who wanted to enter the labour market and children themselves, but also encouraged fathers to take up a more active role.Nowadays, several employees sought jobs with work-life balance incentives, and would even consider resigning their post if their workplace lacked such benefits.\nThe union urged the government to implement these measures immediately.", "comment_count": 6, "id": 2108}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A total of €2.5 million are being made available in grants to those opting for cleaner and more sustainable transport.\nLast year’s €1.8 million scrappage scheme, through which commuters swapped their car for a less polluting vehicle, will return this year.\nIn 2018, some 1,670 people benefited from this scheme through which they received a grant ranging from €800 to €2,000, and this year, the government has allocated €1.5 million for the initiative.\nIf there is enough take-up, the Transport Ministry is willing to ask for more funds to go towards this initiative.\nMeanwhile, another €100,000 have been allocated for those purchasing pedelecs or small electric motorcycles, with last year’s funds being almost used up by more than 250 applicants. Commuters can get up to €400 each.\nTransport Minister Ian Borg, who briefed the media about the figures, commended the keen interest in clean and alternative means of transport.\nHe meanwhile noted that these grants were also available for those who needed wheelchair-accessible vehicles or a chauffeur-driven one. A total of €100,000 are being made available to commuters who scrap their car. They can receive up to €10,000 each.\nMr Borg said that last year more than 1,860 people benefited from such schemes. This, he said, was the beginning of a culture shift, “which we would like to continue seeing so that together we can help our country benefit from improved air quality and less traffic on our roads.”\nHe also referred to the 24,000 youths aged between 16 and 20 who in 2018 benefited from the free public transport scheme, which this year was being extended to all youths aged14 to 20 and full-time students aged 21 or more.\nDiscussions are ongoing to make public transport free for people with a disability.\nHighlights\nThe sum of €800 will be given to those registering new M1 Category Vehicles with CO2 emissions between 101 and 130g/km while M1 Vehicles with CO2 emissions up to 100g/km are eligible for €900 or the sum equivalent to the amount paid for registration tax (up to a maximum of €1,500).\nApplicants registering an M1 Hybrid Vehicle with CO2 emissions between 40 and 65g/km are eligible for a grant up to €2,000.\nWhen registering a new M1 or N1 electric vehicle while de-registering and scrapping another M1 or N1 Internal Combustion Engine vehicle at least 10 years old from the year of manufacture, commuters are eligible for a €7,000 grant. When registering an electric vehicle of the same categories without scrapping another vehicle, they are eligible for up to €6,000.\nA €2,000 grant is available for applicants registering an imported second-hand M1 or N1 vehicle that is not older than 36 months and with less than 15,000 kilometres.\nWhen registering a new electric quadricycle or a new electric motorcycle in the category L6e, L7e or L3e-A3, commuters will be eligible for €3,500.\nCommercial companies are eligible for a maximum of €200,000 should they change their fleet from ICE to Electric Vehicles.\nA €200 grant will be given to those who convert an M1 or N1 vehicle to Autogas or LPG.", "comment_count": 7, "id": 2109}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A local bank employee, targeted by police investigations over the past three months, was granted bail after pleading not guilty to misappropriating confidential data of the bank.\nThe 36-year old formerly high-ranking official was arraigned under arrest on Monday, pleading not guilty to having allegedly unlawfully accessed computer data, making unauthorized copies and misappropriating reserved and confidential documents, in breach of corporate liability laws.\nSuch a breach rendered the accused liable, if found guilty, to a fine of between €20,000 and €2 million in terms of the Criminal Code.\nA two-fold ban, on the publication of the accused’s name as well as that of the bank, was upheld by the court after hearing defence lawyer Roberto Montalto explain how his client had been on police bail and had been cooperating with investigators over the past months.\nDisclosing the man’s identity as well as his former place of work could potentially frustrate further investigations which could lead to the possible incrimination of other officials, even higher up, Dr Montalto argued.\nA request for bail was not objected to by the prosecution as long as adequate conditions were imposed.\nDr Montalto pointed out that his client had released three police statements in the presence of his lawyer, which meant that such statements would stand.\nIn the light of such submissions, duty magistrate Doreen Clarke upheld the request for bail against a deposit of €4,000, a personal guarantee of €5,000 and a duty to sign the bail book once a week.\nThe court also ordered the man not to approach the prosecution witnesses in any manner.\nInspector Shaun Friggieri prosecuted.", "comment_count": 0, "id": 2110}, {"keywords": "", "author": "Sarah Carabott", "article_body": "An eight-month girl has been admitted to Mater Dei Hospital with septicaemia, the third child with a bacterial infection in two weeks.\nHealth authorities, who alerted the media about the case, reassured the public that there was no epidemic in the community or at hospitals in Malta.\nMedical Director Walter Busuttil said that two of the three cases – which have already been reported by the media – had unrelated bacterial meningitis.\nOne of the two, a four-year-old boy, had passed away, while the condition of a three-week-old baby who was admitted to hospital last week, is improving.\nThe two cases were caused by two different types of bacterial meningitis.\nOn average, around 11 people of all ages are admitted to Mater Dei Hospital with bacterial meningitis every year.\nThe third child, admitted on Sunday night, is suffering from a totally different infection, known as septicaemia.\n“They are all unrelated, there is no pandemic at Mater Dei Hospital or in the community. All three children had no contact with other children and all precautions have been taken by the health authorities,” Mr Busuttil said.\n“There is no cause for alarm, and we want to put the public’s mind at rest. At the hospital we see these bacterial infections every year, and they are very rare.”\nHe urged parents to contact their GP immediately in case of symptoms such as a rash, high fever, or a change in their child’s behaviour.\nConsultant paediatrician Paul Soler noted that parents would immediately notice any change in attitude in newborns, such as new spots on their skin, refusing to drink, being lethargic or suddenly altering their sleeping patterns.\nSuch infections, he reiterated, were very rare in children.\nRead: What you can do to prevent meningitis\nAsked to explain three bacterial infections in two weeks, Superintendent of Public Health Charmaine Gauci said this was a matter of coincidence and they were not related in any manner.\nShe reiterated that bacterial meningitis spread only through very close contact.\nThe authorities had taken all the necessary precautions, and apart from carrying out a risk assessment of each case, if a patient attended school or a nursery, health representatives contacted parents of the other children to reassure them that the disease did not spread.\nProf. Gauci is not aware of any case where the infection was transmitted from one child to another.\nRead: Meningitis – everything you need to know\nShe urged people to wash their hands whenever they could, while those who feel unwell should avoid crowded places.\nAlthough the four-year-old who had passed away was vaccinated against meningitis, vaccination was the best prevention against such diseases, she added.", "comment_count": 7, "id": 2111}, {"keywords": "", "author": "Ivan Martin", "article_body": "Former Gozo minister Anton Refalo is expected to be charged in court with assaulting his son after learning he had allegedly been spreading revenge porn, police sources said.  Anton Refalo.\nSources said the incident happened in Dr Refalo’s family home, after he was informed that his son had allegedly been sharing images of his ex-girlfriend without her consent.\nDr Refalo was informed about the alleged revenge porn by the outraged father of his son’s ex-girlfriend, the sources said.\nIt is not clear when Dr Refalo will be charged.\nDr Refalo is one of parliament’s longest-serving MPs, having first been elected in 1987. He served as Gozo Minister between 2013 and 2017, but despite having obtained the highest number of votes of any candidate in Gozo in the 2017 general election, was frozen out of cabinet.Last year, he was made chairman of national heritage agency Heritage Malta.\n ", "comment_count": 0, "id": 2112}, {"keywords": "", "author": "Edwina Brincat", "article_body": "One of three men arrested on Saturday during a police raid at a Gżira residence, was handed a three-year prison sentence after pleading guilty to drug trafficking and possession upon his arraignment on Monday.\nGodwin Gatt, a 48-year old unemployed Gżira resident, admitted to cocaine trafficking as well as the possession of cocaine and heroin in circumstances indicating that the drugs were not for his own personal use. He was further accused of recidivism.\nThe arraignment followed a raid by the Special Intervention Unit and the Traffic Section, acting on a tip-off about alleged drug trafficking and abuse taking place at a residence in Triq tas-Sliema. \nUpon the accused’s own admission, the court, presided over by magistrate Doreen Clarke, declared him guilty and condemned him to a three-year jail term and a €1,000 fine, further ordering him to fork out court expert expenses.\nThe court also ordered the destruction of the drugs found at the man’s residence.\nUpon a request by the accused’s defence lawyer, the court directed the Director of CCF to provide the man with all necessary help to address his addiction.\nInspectors Justine Grech and Mark Mercieca prosecuted. Lawyer Benjamin Valenzia was legal aid counsel.", "comment_count": 0, "id": 2113}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 12.45pm with MP's comment\nPN MPs have been summoned on \"short notice\" to a parliamentary group meeting on Monday evening for the first time since domestic violence allegations emerged against Opposition leader Adrian Delia, Times of Malta is informed.A PN source said no agenda was provided to MPs for the evening meeting.\nOne MP who spoke to Times of Malta expressed his anger at the rushed way the meeting was called.The parliamentary group was only informed on Monday morning about the meeting at 5.30pm.“What I am supposed to do, cancel my appointments”, the exasperated MP said. PN deputy leader for parliamentary affairs David Agius did not respond to a request for comment.\nIn a telephone call to the Times of Malta, PN MP Mario Galea argued that it was not the first time that a parliamentary group meeting had been called on short notice under different leaders.\n“Under Simon Busuttil’s leadership we were never given an agenda prior to meetings”, Mr Galea said.Dr Delia has been facing renewed rumblings of discontent from numerous MPs, though none of them have publically called for his resignation.Apart from the domestic violence allegations levelled against him by his estranged wife, Dr Delia is also facing numerous questions about his personal finances and past dealings as a lawyer.An FIAU report into a Soho prostitution ring linked to the Opposition leader was sent to the police for a money-laundering investigation last year.Leaked documents show Dr Delia is facing loan, spousal maintenance payments and other monthly commitments, including the lease of a Jaguar, of over €9,000.While his salary as Opposition leader leaves him with around €2,700 in hand per month, Dr Delia insisted during a meeting with Times of Malta earlier this month that he was keeping up with his monthly commitments.", "comment_count": 83, "id": 2114}, {"keywords": "", "author": "", "article_body": "MEP candidates will for the first time be allowed to buy radio adverts, after the Broadcasting Authority announced a rule change to give candidates more opportunities to get their message across.The authority said in a statement on Monday that, under a trial scheme throughout February, nationwide radio stations would be authorised to provide airtime by receiving paid ad requests for information meetings organised by candidates in May's European Parliament elections. “If the scheme works well, with everyone’s cooperation, there is a greater possibility that it would be renewed for the following months,” the authority said. “Abuse and strategic manoeuvring, amongst other things that undermine the scope and spirit of this initiative, certainly do not help.”A directive sent to radio stations indicates that adverts have to be limited to information meetings and must be oriented towards the candidates, rather than their parties. Stations are not allowed to discriminate between candidates, and cannot use their editorial policy to justify any discrimination. Moreover, they are required to establish a fair and transparent procedure regarding the order of broadcast.Adverts, which must be no longer than 30 seconds, can only run in two one-hour time slots and no candidate can have more than one advert per time slot.", "comment_count": 12, "id": 2115}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "Opposition leader Adrian Delia's legal bid to be given a fully copy of the Egrant inquiry is nearing an end.\nWhen the case was called on Monday morning, Dr Delia's lawyer Vincent Galea, informed the court that the applicant had no further evidence to put forward.\nLikewise, AG lawyer Victoria Buttigieg said that the respondent had no further witnesses to summon.\nIn the light of this information, Mr Justice Robert Mangion, presiding over the constitutional proceedings, granted the applicant two weeks within which to file his written submissions and a further two weeks for the AG to file his note of reply.\nFinal oral submissions will then be made during the next sitting, scheduled for March.\nDr Delia had filed a legal challenge to the Attorney General's decision to deny him a copy of the magisterial inquiry into the mystery Panama company, which was conducted by magistrate Aaron Bugeja.\nRather than the full 1,500-page report, Dr Delia was only given access to the 50-odd pages from the its conclusions which were made public. This, he said, violated his rights as Opposition Leader.\nRead: 'I did not give anyone a copy', Owen Bonnici says of Egrant inquiry", "comment_count": 0, "id": 2116}, {"keywords": "", "author": "Herman Grech", "article_body": "Acclaimed professor Joseph Buttigieg, and father of US presidential candidate Pete Buttigieg, has passed away.\nSouth Bend mayor Pete Buttigieg announced his father's passing away through a Facebook post on Sunday afternoon. He was 71.Joseph Buttigieg was an inspiration to his son.\n“We are in mourning today. With his family at his side, Dad passed away peacefully earlier this afternoon. We miss him already but his love of life, and his moral passion, will stay with us forever. As a friend, colleague, thinker, and educator, he touched countless lives, and we hope to find a way to honor his impact later on in the spring.\"\n\"The last thing he said to us was, 'it’s been a good trip.' So it has. We love you, Dad,\" wrote Mayor Buttigieg.\nRead: Mayor of Maltese descent enters 2020 US Presidential race\nEducation Minister Evarist Bartolo described Prof. Buttigieg as a mentor who drove a group of university students 47 years ago.He was an intellectual and a moral giant- Evarist Bartolo\n\"He was an intellectual and a moral giant imbued with such a sense of humour. He really was a beacon of hope for all of us those days in the early 1970s,\" Mr Bartolo told Times of Malta. \n\"He believed in the values of social justice and democracy and he campaigned against the 'money can buy you anything' belief. Our country should honour people like him.\"\nProf. Buttigieg was a professor and translator and served as William R. Kenan Professor of English at the University of Notre Dame until 2017, when he became professor emeritus.\nAmong other works, he translated and edited the English edition of Antonio Gramsci's Prison Notebooks.\nHe was raised and began his education in Malta, completing his undergraduate work and a master's degree at the University of Malta. He earned a second undergraduate degree Heythrop College in London, then a doctorate from the State University of New York at Binghamton in New York.\n\n\n\nUniversity of Malta professor Peter Mayo said the academic world was poorer without Prof. Buttigieg.\n\"I lost a great friend, mentor and collaborator. He was also a great commentator on current American politics. The Left is also poorer without Joe.\"\nAuthor and professor David Ruccio described him as a \"left-wing intellectual, critical thinker, rigorous scholar, prolific essayist and frequent speaker around the world.\"\nHis son, Pete, only announced last week, that he is jumping into the burgeoning 2020 Democratic field challenging Donald Trump, aiming to become the first openly gay presidential nominee.\nRead: In Memoriam: Joseph Buttigieg, Kenan Professor Emeritus of English", "comment_count": 20, "id": 2117}, {"keywords": "", "author": "Keith Micallef", "article_body": "Before: One of the tents at the Qalet Marku ‘shanty town’. Photos: Keith Micallef\nMakeshift tents in what looked like a shanty town that mushroomed recently at Qalet Marku in Baħar iċ-Ċagħaq disappeared mysteriously, just a day after Times of Malta flagged the matter to the authorities.\nHowever, parts of this popular spot formerly occupied by the tents are still littered with debris and rubbish and, in some cases, pose a safety hazard.\nThe issue was flagged to the authorities last Thursday when Times of Malta received complaints that at least five large tents had been erected at strategic points on the Qalet Marku peninsula.Onsite inspection showed the tents were being used as dormitories\nIt was also pointed out that the makeshift structures had remained there for weeks despite persistent complaints and reports to the authorities.\nAn onsite inspection by this newspaper confirmed that the tents were being used as dormitories, with rugs and mattresses all over the place. However, bar one case, all appeared to be uninhabited. \nWaste littered the site where the unsightly structures, which lacked any sanitary facilities, stood and the surrounding trees had evidently fallen victim to the ‘shanty town’ residents.\n“These tents were frequented over weekends by a number of Syrian families who would be especially visible at night due to bonfires next to their tents,” a Baħar iċ-Ċagħaq resident said. \nAfter: the site after the tents were cleared.\nHe complained the place was fast becoming a no-go area as people were becoming increasingly apprehensive of venturing there.\nThis newspaper enquired with the police, the Planning Authority and the Lands Authority on the matter. Though none them had replied at the time of writing, barely 24 hours after the questions were sent the Times of Malta was informed by passers-by that the tents had been removed.\nThe complete silence from the authorities meant it could not be established whether the tents has been removed on the strength of an enforcement action or otherwise. However, a closer inspection of the site showed the site had been left in a complete mess.\nRead: From informal camp site to dumping ground\nIn some places, concrete or gravel had been laid on virgin land to level the ground and, elsewhere, one could see rugs, old furniture and mattresses. \nThere was also a metre-deep hole with a rusty metal tank immersed in it, posing a serious hazard to passers-by.\nThe removal of the tents was welcomed by at least one Baħar iċ-Ċagħaq resident. \n“The authorities have finally woken up because all our previous complaints seemed to have fallen on deaf ears,” the man remarked when this newspaper visited the site over the weekend to confirm that it had indeed been cleared of the structures.\nHowever, he wondered who would be clearing up the mess left behind and if somebody would be prosecuted for the disfigurement of the place.", "comment_count": 26, "id": 2118}]