[{"keywords": "Society, Housing", "author": "Jacob Borg", "article_body": "A lupus sufferer lives in a van. A single mother of four sleeps with her children on a tiny bed. A woman is simply fed up of living after spending years in homeless shelters. \nThese are just some of the harrowing cases bought to Parliament’s attention by Opposition housing spokesman Ivan Bartolo. \nIvan Bartolo\nMr Bartolo published letters he has received from people with the humble aspiration of having a roof they can call their own over their heads. \n“I have been living in a van for seven months. I am bipolar and suffer from lupus. Can you imagine how I feel without a roof over my head? I have been waiting for housing for 17 years. Apparently my case does not appear that serious in the [housing] authority’s eyes,” one letter read. \nThe man pleaded with the MP to help him find accommodation so he can finally begin to lead a normal life. With skyrocketing rents and a dearth of social housing, entire families have found themselves out on the street in recent years. \nThose on the margins of society lucky enough to find a place within their budget to rent often have to live in inhumane conditions. \nOne letter reveals how a mother of seven, fresh out of Mount Carmel Hospital, rented an “abandoned” flat in Valletta which reeks of drainage and has no running water. \n“I had to fetch water from my neighbour around the corner for a while… why should I have to suffer this humiliation, while judging by what’s on television, everyone is moving ahead in life except me,” the woman questioned. \nI do not earn enough to get by in life. Not even the government subsidy suffices\nSeveral of the letter writers complained about spending years on the waiting list for housing, without any sign of hope that they will one day be given their own home. \n“No one [at the authority] has ever taken any notice of me. All we want is a decent place to live…There are five of us sleeping in a bed,” a single mother of four, wrote to the Nationalist MP. \n“I cannot afford to rent. With four children, I cannot possibly work. If I have to rent then I will be left with no money to live. I am pleading for your help,” the woman, who lives with her elderly parents, implored. \nRELATED STORIESOver 11,000 living in overcrowded housingDismantling the poverty trap - John Cassar White\nFor another woman, moving from one homeless shelter to another has taken her to the limit. \n“I work, but I do not earn enough to get by in life. Not even the government subsidy suffices. You need to be in such a situation to be able to understand it. \n“I have been in a downward spiral ever since my 10-month-old baby died. I wanted to get on with life. I have been through a lot… I cannot get a break. I am fed up of living. Yet, I admire myself for constantly fighting through it.” \nHaving spent her childhood and adult life living in various shelters, the woman has only one simple wish, that of giving her daughter a better life. \nQuestions sent to the Housing Authority about these cases were not answered by the time of writing.\nRental law will not help these people enough – Bartolo \nIvan Bartolo told Times of Malta that a common theme among the letter writers was a realisation that the new rental laws proposed by the government would not help them enough. \nHe said the writers were happy to share their experiences, and their names and addresses were only withheld when tabled in Parliament for data protection purposes. \n“People living in vans and out on the street have all written to me. These are all people facing huge challenges in their lives.” \nMr Bartolo said in one case, a single mother whose elderly parents are going to be moved to a home is now facing eviction.\n“Her landlord is throwing them out, so she will now end up out on the streets. These are extremely vulnerable people whose sole income is government benefits.” \nMr Bartolo said that while the proposed rent laws are a good start, it is not true that they will offer stability to the most vulnerable in Maltese society. \nHe said landlords could easily evict their tenants after the minimum one-year rental period has expired. \n“In reality, a year passes by very quickly,” he said.", "comment_count": 0, "id": 3719}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories in the newspapers on Thursday.\nTimes of Malta reports how petitioners who had called for a no-confidence vote in PN leader Adrian Delia have cried foul over how matters are being handled by the party. The newspaper also reports how the VAT lottery was won by the same player five times in eight months. \nIn-Nazzjon quotes Adrian Delia saying the new rent law will not solve any of the problems which the current government itself created. The newspaper also features the PN reaction to the petitioners who cried foul, saying the General Council follows established and transparent rules. \nl-orizzont says the court has issued a decree in favour of the General Workers' Union in the case over use of the Workers' Memorial Building, which the union built on public land in Valletta. In another story, the newspaper also focuses on the growth of the financial services industry. \nThe Malta Independent says successful Labour candidate Josianne Cutajar declared to have spent most in the European Parliament campaign. PD candidate Cami Appelgren spent nothing.  ", "comment_count": 0, "id": 3720}, {"keywords": "Education", "author": "Ivan Camilleri", "article_body": "An old military hospital in Mtarfa is to be turned into an international school after the House of Representatives approved a concession to a private company.\nThe school will cater mostly for children of expats living and working in Malta.\nFollowing a discussion during a session of the National Audit Office Accounts Committee, both sides of the House approved a resolution allowing Haileybury Malta Ltd to run the hospital as a school for 40 years.\nThe company won a tender issued by the Education Ministry for the opening of a second international school on the island, which will be competing with the Verdala International School.\n€50,000 annual rent for the premises\nTwo companies had originally applied for the concession but the other applicant, Ellesmere College Malta, was disqualified after failing to reach the tender’s criteria. According to the Education Ministry, Haileybury, which already operates similar schools in Kazakhstan and the United Kingdom, will be investing more than €15 million in the rehabilitation of the former hospital.\nRELATED STORIESMUT concerned about proposed international school at MtarfaFormer Mtarfa hospital to become international school\nIt aims to start its operations in September 2021 and intends to have a total school population of 580 students at primary and secondary levels.\nAccording to the company, the school may eventually also offer kindergarten and sixth form facilities.\nThe company is expected to pay the government €50,000 annual rent for the premises during the first five years, increasing to €125,000 after.\nRegistered last month, Haileybury Malta Ltd is owned by two separate companies.\nStanley Logistics Ltd is a United Kingdom company which already operates similar colleges, while the Maltese partner company is Ruth Trapani Galea Ltd, owned by a businesswoman of that name who was also appointed by the government as a director of the Malta Gaming Authority.", "comment_count": 5, "id": 3721}, {"keywords": "Parliament, PN, Adrian Delia", "author": "Luke Scicluna", "article_body": "Opposition leader Adrian Delia should have at least “two to three” members of staff to help him do his parliamentary work, PN deputy leader David Agius argued in parliament on Wednesday.   \nDr Agius asked why the Speaker, the Prime Minister, and all other ministers had government staff to assist them with their parliamentary duties when the Opposition Leader did not.\nThe Speaker and the Leader of the Opposition were constitutionally “almost on the same level,” he argued, saying the government did not want to give the Opposition the necessary resources to do its job.\nMembers of parliament’s House Business Committee debated the proposal heatedly but failed to reach agreement. The Committee was discussing Parliament’s financial plan for 2019-2021.\nLeader of the House Chris Fearne pointed out that none of Dr Delia’s predecessors as Opposition Leader had parliamentary staff to help them and argued that the duties and responsibilities of Opposition Leaders had not increased.\nHowever, he appeared to be open to considering the possibility, as part of a change to give all MPs parliamentary assistance to carry out of their duties.\nDr Agius also asked whether a suggestion by Commissioner for Standards in Public Life George Hyzler to increase the honoraria MPs received would be entertained, as it was absent from the financial plan.\nDr Fearne was quick to clarify that the suggestion had not come from the government, but that the Finance Ministry’s allocation to the House of Representatives would be “topped-up” should a decision be made to increase honoraria.\nArrangements for MP Kevin Cutajar\nThe issue of providing support to Opposition MP Kevin Cutajar was also raised. Speaker Anġlu Farrugia explained that efforts were already underway to ensure that Dr Cutajar - who is blind - is assured transport to and from Parliament, and arrangements were already in place to provide scanned versions of papers laid and to implement the use of Braille.\nThe House Business Committee agreed that Parliament would rise for its summer recess following a final debate on July 17.", "comment_count": 0, "id": 3722}, {"keywords": "Parliament, Politics, Justice", "author": "Luke Scicluna", "article_body": "The Nationalist Party has voted in favour of the Minor Protection (Alternative Care) Bill but objected to the absence of measures to protect the unborn.\nDuring the House’s penultimate session before the summer recess, Opposition MP Claudio Grech explained that the government had refused to accept the Opposition’s suggestion to include the unborn in the law’s definition of a “minor”.\nThe Opposition was voting in favour because of its firm belief in the need to offer protection to minors.\nIn a statement, the Nationalist Party said the Opposition would continue to promote policy which protected the life of “those not yet born”.\nDivisions were held to grant third readings of controversial legislation such as the State Advocate Bill, which the Opposition voted against.\nJustice Minister Owen Bonnici identified three points on Dutch MP Pieter Omtzigt’s assertion that the State Advocate Bill was ‘insufficient’ in its implementation of the Venice Commission report.\nRELATED STORIESOpposition urges government to take up call for Caruana Galizia public inquiryMinister defends 'reformist' government in Council of Europe grilling\nMr Omtzigt is the Council of Europe’s rapporteur monitoring the investigation into the murder of Daphne Caruana Galizia and the rule of law on the island.\nDr Bonnici’s points were that the government did not subject the decisions of the Attorney General regarding prosecutions to judicial review; that it did not assign responsibility for inquiries to the Attorney General instead of to the duty magistrate; and that the Attorney General remained the chair of the Financial Investigation and Analysis Unit.\nDr Bonnici said Attorney General Peter Grech’s term at the helm of the FIAU would be coming to an end in 2020, and he was informed that Dr Grech would not be seeking reappointment. He disagreed with the reallocation of responsibilities formerly resting with magistrates without further examination.\nHowever, Opposition Leader Adrian Delia said that the government had missed an opportunity to send a strong message concerning its willingness to implement reforms. The law was supposed to be part of a larger reform to strengthen institutions and the Maltese justice system, which had failed to materialise.\nThere were those who considered the State Advocate Bill to be a step backwards, not forwards.\nThe State Advocate Bill was granted a third reading with 34 votes in favour, 28 against.", "comment_count": 0, "id": 3723}, {"keywords": "Accident, Police", "author": "", "article_body": "A 42-year-old man who lives in St Paul’s Bay was grievously injured on Wednesday in a traffic accident in Mellieħa.\nThe police said the accident happened in Triq ta’ Pennellu at 3.55pm.\nThe victim, who is from Bulgaria, was driving a BMW which crashed into Setra Evobus. The Setra was stationary on the side of the road at the time because of a fault.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3724}, {"keywords": "Education, Crime", "author": "Jacob Borg", "article_body": "Gangs roaming schools is a recent phenomenon affecting various localities, Malta’s Union of Teachers has said.\nThe entire country, including its education system, was not prepared for the influx of foreign students, MUT president Marco Bonnici told Times of Malta.\nHis comments come in the wake of a controversial report by Education Commissioner Charles Caruana Carabez, who said “ethnic gangs” were terrorising schools.\nThe report was heavily criticised by NGOs, who slammed the comments as “careless and misinformed”, as it was steeped in stereotypes and ignored the increased risks of bullying faced by migrant and ethnic minority students.\nOn his part, Mr Bonnici said most teachers and other educators are “bending over backwards” to address the situation, as several actions were being taken to help foreign students integrate into the education system.\nThe MUT president said state schools lack resources, particularly given that the number of counsellors and other professionals is very limited, and most of them have to cover a number of schools in different colleges.\nIt is disconcerting that his evaluation appears to be steeped in cultural stereotypes and hearsay\nOne of the more eyebrow-raising suggestions put forward by Mr Caruana Carabez was the formation of an international school to host these troubled youths.\nRELATED STORIESOne in five Maltese students unhappy about rights for foreignersSixth form could soon change drastically: here's how\nThis particular proposal raised alarm among NGOs, who slammed it as being tantamount to advocacy for separation and segregation. \nThey said the Commissioner’s overall analysis of the situation provided a “one-sided perspective” that ignored growing evidence based on the experiences of migrant and ethnic minority students.\n“It is disconcerting that his evaluation appears to be steeped in cultural stereotypes and hearsay that fail to capture the complexity of the context,” the NGOs said.\nMr Bonnici sounded a cautious tone when asked about his thought on the proposal for an international school, saying it should be “studied well”.\n“The services being offered to students who do not speak Maltese and English through hubs within schools must be strengthened in primary and extended in secondary as some situations, including conflicts, arise due to the language barriers,” he said.", "comment_count": 1, "id": 3725}, {"keywords": "Construction, Architecture", "author": "Ivan Martin", "article_body": "Around 100 contractors have already signed up to a new public registry, developers said on Wednesday.\nMalta Developers' Association president Sandro Chetcuti said contractors were flooding in to the MDA offices in Pieta' to sign up to a newly-introduced register, which he described as the \"first step\" towards properly regulating the sector.\n“To date, there was nothing stopping anyone from investing some cash and becoming a contractor and dropping down buildings and so on. Through this new register, the public will now be able to see who contractors are and that is a start,” he said.\nThe MDA’s ultimate goal, he said, is to see contractors require licenses, which they could lose – and therefore not be able to legally work on construction sites – if they do not follow the rules.\nContractors have been given until the end of September to sign up to the new register, as part of a reform of the building sector.\nThe reform came this month after a building collapse in Mellieħa and the wall of another fall apart in Guardamangia. In April, an apartment block next door to a building site had crumbled in the dead of night.\nFlanking Mr Chetcuti, Building Regulations Office chief Michael Ferry said that once the registration period had ended, the next step would be to introduce a license requirement.\nThey would follow that up by creating a disciplinary council, which will be responsible for looking into cases where a contractor may have acted outside the law.\nThis, he said, was similar to the way architects risked losing their warrant if they were brought before a disciplinary board run by their chamber.\nMr Chetcuti said the MDA would be hosting training programmes to complement the licensing period.", "comment_count": 0, "id": 3726}, {"keywords": "Court, Crime, Drugs", "author": "Edwina Brincat", "article_body": "Two protagonists in an alleged subornation attempt by suspected drug kingpin Jordan Azzopardi’s girlfriend took the witness stand on Wednesday, one of them landing a €300 fine after spitting in open court.\nWednesday's proceedings continued against the mother-of-five, who had been re-arrested at the dock last month after a witness, testifying in the case against the woman and the alleged drug lord, had claimed that she had offered him €20,000 not to take the witness stand.\nThat testimony had brought about an unexpected twist to the proceedings, with the woman, who had been formerly granted bail, ending back under preventive custody on the spot while protesting her innocence.\nA common ‘friend’ of Mr Azzopardi, his partner and the witness, allegedly tempted with the bribe, took the witness stand on Wednesday, shedding light upon the dynamics of the whole saga played outside court.\nJonathan Mangion, after being cautioned by the Court, chose to testify, explaining how he had paid a €4,800 deposit on the purchase of a car from Luke Vella, which vehicle was subsequently seized by the police.\n“Tell Jordan to give me €10,000, and I'll give you €5,000 out of that,” Mr Vella had allegedly told Mr Mangion when the latter insisted upon getting his deposit back.\nWhen testifying in the drug-trafficking compilation in June, Mr Vella had explained how he had rented premises in Pietà to set up a ‘BnB’. However, while the witness was serving time behind bars, Mr Azzopardi had allegedly taken over the premises, converting them into one of his drug stores.\nRELATED STORIESDrug kingpin hid fake money in his shower walls, court toldCocaine-hooked chef recalls beating by Jordan Azzopardi and his henchmen\nMr Vella had later upped his request to €20,000, Mr Mangion testified on Wednesday, explaining how he had contacted Jordan’s partner since he could not speak to Jordan who was currently behind bars.\n“Was it you who called the woman first?” asked defence lawyer Franco Debono.\n“Yes. I made the first step to collect the €4,800 which I had paid to Luke earlier on,” came the reply. “Obviously I couldn’t speak to Jordan, because he's in jail.”\n“Why didn’t you ask why Luke was involving third parties?” went on Dr Debono.\n“I didn’t tell him anything. All three of them were friends of mine,” said the witness, adding that Mr Vella had allegedly told him to tell Jordan to hand over €10,000 “and I won’t testify.”\nRelations had later turned sour between Mr Mangion and Mr Vella when the latter did not get the money, explained the witness, claiming to have been verbally insulted and threatened by Mr Vella.\n“I never spoke to Jordan,” the witness insisted.\nJust then, Mr Vella himself walked into the courtroom, heading towards a seat before being promptly told by the presiding Magistrate to wait for his turn to testify outside.\nThe young man turned on his heels and, in an apparently angry gesture, spat at the floor before walking out.\nThe gesture did not pass unnoticed by the Court who, shortly afterwards, addressed the matter when the man returned to testify, after necessary precautions by security guards to ensure that the two witnesses would not cross paths.\n“A while ago, when you were asked to go outside, you spat on the floor, Mr Vella,” Magistrate Doreen Clarke said.\nThe man at the witness stand mumbled incoherently in reply.\nHowever, the Court minuted that such behaviour was deplorable and not permissible in a court of law, and proceeded to fine the man €300 for contempt of Court.\nRecounting the alleged bribery, Mr Vella explained how third parties had asked him what he wanted in exchange for not testifying. \n“Tell him [I want] €100,000”, he had allegedly replied, knowing that such an exorbitant sum would not be met.\nThe witness then went on to explain how Mr Mangion had called him and how he had been spoken to by Jordan’s girlfriend.\n“I have lots of recordings. I’ll give you my mobile so you may check for yourself,” the man told prosecuting Inspector Mark Anthony Mercieca.\n“Jonathan Mangion has just testified that you owed him some €4,000,” asked Dr Debono.\n“No. He had paid the deposit and he took his money back,” came the reply.\n“What about your offer not to testify?” prodded Dr Debono further.\n“Could be. I wanted the money for the Pietà apartment and I would still have testified nonetheless,” said Mr Vella.\nWhen making submissions on bail, Dr Debono stressed that Wednesday’s testimonies by the two protagonists behind the alleged bribery, showed that the initiative had not stemmed from the accused nor her partner.\n“Each of today’s witnesses, in his own way, confirmed that it had been Vella’s initiative,” said Dr Debono, also stressing that it was inconceivable for a person to record his own attempt at bribing a witness, a fact allegedly attributed to the accused.\nInspector Mercieca objected to bail in view of the fact that civilian witnesses were still to testify.\nThe court declared that it would decree upon the bail application in chambers.\nThe case continues.\nLawyer Amadeus Cachia was also defence counsel. Lawyer Anne-Marie Cutajar from the AG’s Office also prosecuted.", "comment_count": 0, "id": 3727}, {"keywords": "Crime, Prostitution, European Union", "author": "", "article_body": "At least one suspect in a Europe-wide pimping and sex trafficking ring has been arrested in Malta, the EU's police agency said on Wednesday.\nOfficials said European police operating in four different countries arrested six suspected members of a Finnish-led gang and seized almost €3 million in assets.\nThe ring’s alleged ringleader was arrested in Marbella in Spain, with two more suspects caught in Spain and others in Malta, Romania and Finland.\nThe operation codenamed \"Webmaster\" also shut down 16 websites advertising sexual services, Europol said. \nTwo houses in Malta were raided and searched as part of the operation. It is understood the arrests happened in March, but authorities were only able to release the information on Wednesday.\n\"The suspected leader of the criminal group has carried out criminal activities in at least 15 countries,\" said the Hague-based Europol, which coordinated the operation together with EU legal agency Eurojust.\n\n\"He used intermediaries to channel criminal proceeds to international multi-currency bank accounts\" and also used small amounts of crypto currencies, it said.\nThe women were mainly Nigerian and worked as prostitutes in Finland and Sweden, Eurojust said in a separate statement.\nPolice have now frozen the suspects' bank accounts in 12 different countries including in Hong Kong, as well as seizing luxury cars, jewellery and about €30,000 in cash, Europol said.\nSpanish authorities opened their investigation three years ago into the group, which is said to have made some €40 million in criminal profits since 2010.", "comment_count": 0, "id": 3728}, {"keywords": "Fire, Mġarr", "author": "", "article_body": "A large fire broke out at Għajn Tuffieħa on Wednesday afternoon, but was quickly brought under control by firefighters.Eyewitnesses said the fire started on the lower ridge leading to Ġnejna, spreading within half an hour to the top of the hill sloping down towards the beach. The Civil Protection Department told Times of Malta the blaze appeared to have broken out at around 2pm and was brought under control within the hour, with only small pockets of fire remaining by 3pm.\nVideo: Matthew Mirabelli", "comment_count": 0, "id": 3729}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "Two men who pleaded not guilty to stealing from and causing damage to parked vehicles in Gozo, were remanded in custody.\nClive Micallef, 36, from St Paul’s Bay and Leone Zammit, 19, from Nadur, were escorted to the Gozo Courts on Wednesday morning, to face charges of stealing items from parked vehicles and of willfully damaging to third party property.\nThe alleged offences took place on July 2 and 3.\nMr Zammit was separately charged with breaching a Probation Order, while his co-accused was separately charged with another car theft earlier on in June as well as with being a relapser.\nA request for bail was turned down by the court, presided over by magistrate Bridget Sultana, who remanded both men in custody.\nInspector Bernard Charles Spiteri prosecuted. Lawyer Mario Scerri was defence counsel.", "comment_count": 0, "id": 3730}, {"keywords": "Crime, Police, Valletta", "author": "", "article_body": "The police have arrested the vandal caught on CCTV spraying graffiti in Valletta.\nThe council had release CCTV footage of the man, who was identified by the police on Wednesday as a 37-year-old Italian. He should be arraigned soon, they said.", "comment_count": 0, "id": 3731}, {"keywords": "Weather, Climate", "author": "", "article_body": "Demand for electricity reached record levels on Tuesday, as Malta sweltered in a heatwave.\nEnergy services provider Enemalta registered the highest electricity peak load ever at 510 megawatts.\nThe previous record was back in August 2017, when 488 megawatts was registered during high temperatures.\nOn Tuesday, Malta, along with Cyprus, recorded the hottest temperatures in Europe at 38˚C.\nRELATED STORIES'Abnormally high demand' causes power cuts across Malta\nThe corporation was replying to questions sent by Times of Malta asking why there had been such widespread power cuts over the past few nights.\nA spokesman said the demand for electricity supply was 15% higher than the demand registered in the same period during the past two years.\nThis was a result of temperatures which were far above average for this time of year, the company said. Extra personnel will be allocated to its emergency teams to be able to handle issues as they arise until the current weather situation persists.\nThe Met Office forecasts that the temperature should feel like 36°C by Thursday.\nHe stressed that the interruptions, which were localised, were not related to each other, and they did not originate from - or have any impact on - the generating systems.\n\"Thanks to the investment, in recent years, made by Enemalta as part of its programme to automate its substations, many of these interruptions were resolved in a relatively short time. In fact, supply was back to normal after 10 minutes in 80% of case,\" he said.\nEnemalta said the company would continue to invest in its distribution system to improve the quality of service offered to its clients.\nCustomers experiencing any difficulties have been asked to contact the company on its free phone number 8007 2224.", "comment_count": 6, "id": 3732}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A heavily pregnant woman and her partner were escorted to court on Wednesday, where they pleaded not guilty to a series of thefts ranging from clothes and gas cylinders to a vehicle.\nSonia Mahouachi, a 24-year-old unemployed expectant mother sat alongside her partner, Anthony Borg, a 36-year-old who claimed to have been “boarded out” on account of a physical condition.\nThe St Paul’s Bay couple were arrested as the suspects behind a series of thefts committed over the past months targeting a clothes store at the Baystreet Complex, another clothing store at Burmarrad, a construction site at Mellieħa from where electrical wiring was taken, three gas cylinders stolen from St Julian’s last month and the theft of a brace from a Mellieħa garage.\nThe man was separately charged over the theft of a Maruti Gypsy from Burmarrad in March, with handling stolen property and slightly injuring a male victim. He was further charged with committing the said offences during the operative term of a suspended sentence handed down in April.\nThe two co-accused pleaded not guilty, a request for bail being made on behalf of both by their defence counsel Franco Debono and Amadeus Cachia.\nProsecuting Inspector Leeroy Balzan Engerer informed the court that while he was not objecting to the request in respect of the woman, in view of the fact that she was reportedly eight-and-a-half months pregnant and needed hospital care, the same could not be said in respect of her alleged partner in crime.\nNot only were civilian witnesses still to testify but “if granted bail, he’ll likely continue in his long career of alleged thieving,” the Inspector argued.\nCountering these arguments, Dr Debono pointed out that in spite of the man’s voluminous criminal records, “ironically there appear to have been little measures of supervision, with probation having only been granted three months ago”.\n“Should there be some form of supervision, under bail or otherwise, it would help him get on the path to rehabilitation,” Dr Debono stressed.\nHowever, Inspector Godwin Scerri, also prosecuting, rebutted that the prosecution felt that for the time being the man ought to remain in custody, further pointing out that on one occasion the man had stolen a vehicle, which was not a minimal item.\nAfter hearing these submissions, the Court, presided over by magistrate Neville Camilleri, turned down the request for bail in respect of the man in view of the gravity of the offences and the fact that the accused was not deemed sufficiently trustworthy to abide by bail conditions.\nAs for the expectant mother, the Court upheld the request, granting bail against a €500 deposit, a €5,000 personal guarantee, a curfew between 7pm and 7am and an order to sign the bail book twice a week, strongly warning the woman to inform the police in case her pregnancy impeded her from abiding by those conditions.", "comment_count": 0, "id": 3733}, {"keywords": "Adrian Delia, PN", "author": "", "article_body": "Updated at 8.45pm, adds PN statement\nNationalist Party members behind a petition which is seeking a vote of confidence in PN leader Adrian Delia are concerned that the vote scheduled for July 27 will not be fair.\nThe group, led by former candidate Ivan Bartolo, expressed its concerns on Wednesday in a letter to Alex Perici Calascione, who is the new president of the PN executive.\nIn a letter, the group said that the party had \"completely changed\" the wording of the original question petitioners wanted PN councillors to vote on. \nChanged wording\nThe petition asked for a secret vote on the question: \"After the results obtained by the PN in the European and local elections of 25 May 2019, should the party leader take political responsibility and resign? Yes/No.”\n\"The question has now been changed to something along the lines of 'Do you want Adrian Delia to continue leading the PN into the next general election and undertake reforms needed?'\", a source told Times of Malta.\nMr Bartolo speaking outside PN headquarters in June.\nThe PN executive agreed last week to convene a general council meeting on July 27 in which a vote on Dr Delia's leadership would be taken. \nWednesday's letter did not say what that wording had been changed to, but said it was \"unacceptable\" that the PN executive had been misled during last week's meeting, which PN secretary general Clyde Puli was present for.\nSuch goings on continued to fuel concerns about the way the party was being run, the group said. \nThe group presented its petition for the no-confidence vote on June 25. A counter-petition expressing confidence in Dr Delia was presented to the party a few days later.\nRELATED STORIESWatch: 'It's not business as usual' - petition to oust Delia reaches PN HQWatch: Almost 5,000 sign petitions backing Delia\nMr Bartolo and other petitioners also expressed concern that Mr Puli had laid down that communication with the councils could only be made by the Electoral Commission or through the party.\nDespite having presented the petition, the group said, they had no direct access to the councillors to explain their position. \nLast but not least it appeared that the list of eligible voters had been frozen on July 4, when Dr Delia called the council meeting, and not June 25, when the petition was submitted.\nDr Delia speaking following last week's meeting.\nThe group said it had been informed that in the intervening period internal manoeuvres were made, with instructions to section committees to replace certain people who would have a right to vote in the council.   \n\"In view of the above, it is clear that the vote will not be a fair one and it will not be based on the promises of transparency and honesty. All this is unacceptable and runs counter to the fundamental principles which the Nationalist Party is supposed to hold dear\" the group said.\nDr Perici Calascione was asked to call a special meeting of the executive to remedy the situation.\nParty rejects 'insinuations', 'fact-twisting'\nIn a statement, the Nationalist Party said General Council election rules were established by the statute and by what had been decided by the executive committee.\nA fair and transparent process was being ensured through the setting up of an Electoral Commission with an independent chairperson unanimously agreed by the executive committee and by another two members chosen by petitioners from each side. This reflected the sense of transparency and accountability.\nIt rejected claims of what it called were insinuations and twisting of facts.\nThe executive, it said, had agreed with the Opposition leader’s proposal to call a General Council under a clause which permitted him to do this. He did this to resolve the doubts that had risen on the validity of the first petition which questioned whether he should remain at the helm. Dr Delia confirmed he would be proposing the question about the continuation of his leadership until the next election. \nThe list of councillors was frozen on July 4 in line with the statute when the council was called. Sectional committees chose their representatives in the council freely and democratically as they had always done and in line with the statute.\nSince the moment the council was called and an electoral commission appointed, the lists and verification obligations were passed on to the commission and no individual or official had the right to change them, the party said.", "comment_count": 38, "id": 3734}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A woman was remanded in custody on Wednesday after pleading guilty to a series of petrol station thefts.\nCharlotte Zammit, 37 of Tarxien was arrested after police investigations established that she was one of a duo who had raided petrol stations in Paola, Zabbar, Attard, Qormi, St Paul’s Bay and Mellieha between May and July 8.\nShe is the mother of driver Liam Debono, who is charged with the attempted murder of police officer Simon Schembri in May 2018.\nThe woman was further charged with wilful damage to third party property, to having breached a 3-year Probation Order handed down in September 2016 as well as to being a recidivist.\nRELATED STORIESLiam Debono gets five years in prison and 10-year driving banDebono knew policeman was under his car, and weaved to dislodge him\nProsecuting Inspector Roderick Agius explained in court that CCTV footage from the crime scenes had helped investigators track down the woman behind the alleged thefts.\nDefence lawyer Josette Sultana, entering a guilty plea on behalf of the accused, pointed out that “all she wants is to seek rehabilitation.”\nWhen making submissions on punishment, Dr Sultana observed that the woman had filed an early guilty plea and had collaborated with the police.\n“She is aware that her problems and the trouble she keeps getting into are all because of her drug addiction,” the lawyer went on, pointing out that the amounts stolen were minimal.\nMagistrate Neville Camilleri, adjourned the case for judgment to next week, meanwhile remanding the accused in custody. No request for bail was made at the arraignment.", "comment_count": 0, "id": 3735}, {"keywords": "Population, Migration", "author": "Vanessa Macdonald", "article_body": "If the island feels a lot more crowded than it used to, it is for good reason: Malta has the largest population growth of any EU country.\nStatistics released on World Population Day also show there were 493,559 people living on the islands by the end of 2018.\nAnd as a recent parliamentary question revealed that there had been 12,603 applications between January and April this year from foreigners wanting to work here, it is likely population numbers have passed the half million mark.\nThe increase in population was by far the largest in the EU.\nOf the eighteen member states that saw an increase, Malta was in first place with 36.8 per 1,000 residents.\nLuxembourg came in second place with 19.6 per 1,000 residents, and Ireland was third with 15.2.\n\nDuring 2018, the population of the EU as a whole went up by 1.1 million people, an increase of 2.1 per 1,000 residents.\nWhere has the population increase come from?\nMaltese are still emigrating, but some of those who emigrated in the past are coming home again. There were 480 more who came back than who left.EU nationals are still coming in droves, with a net gain of 7,349, but there are even more non-EU nationals now coming to the island than EU ones: a net gain of 9,209.\nOne of every seven people in Malta is a foreigner, almost double the amount in the EU as a whole. Eurostat revealed on Tuesday that 14 per cent of the people living in Malta are foreign, compared to just 7.8 per cent in the EU.\nAre we having more children?\nThe birth rate is actually going down – from 1.43 a decade ago to 1.23 – but since there are more people, the actual number of births is still going up.\nThere were 9.2 births per 1,000 residents, compared with 9.7 in the EU, with the highest rate in Ireland (12.5). However, jokes about Catholics would fall flat as the lowest rate was in Italy (7.3).\nWomen in Malta are having babies later in life too, with the average age up from 28.6 years to 30.5 years.\nThere were also 64 foreign adoptions.\nAre we living longer?\nThere were 3,688 deaths in Malta in 2018, compared with 4,400 births. Seen in the context of the whole population, this gives a rate of 7.6 - the lowest rate of the EU which had an average rate of 10.4.\n\nThere were 25 babies who did not survive to their first birth day, but the number of children who die was very low, with only six dying before they reached their twenties. The rate then starts to creep up slowly, with almost three quarters of those who died in 2018 aged 75 or over.\nAnd yes, people are living longer. If you were born in 2018, you could expect to live to 82.5, which is 2.8 years longer than for those born in 2008.\nDo women cope with stress better?\nMen do die younger. There were 325 men who died between the ages of 25 and 64, compared with just 209 women.\nThe number of men and women alive in the 60-69 age category runs fairly neck-to-neck (at around 29,500) – but after that, there is an even more noticeable shift, with women outliving men. By the time they are 80, the population of men drops to 7,033 while women are still relatively going strong at 10,924.\nAnd out of the 2,889 people aged over 90, only 879 were men.\nIt’s raining men...\nIn 2008, there were 1,712 more women than men on the island but the patterns of migration have changed this dramatically. Men now outnumber women by 10,113, having overtaken them in 2014.\n\nThe trend has been consistent since 2006, the earliest year given in the NSO report: if you had a baby then, there was a 52.5 per cent chance that it would be a boy, which dropped slightly to 51.3 per cent in 2018.\nMiddle-aged parents in the playground\nThe average age at which women give birth has crept up to 30.5, but the age of the other parent (who could be a man or woman) extends into middle age.Only seven women gave birth in the 45-49 age category, and none who were older than 49. But there were 51 ‘other’ parents in their 50s, and four in their 60s.\nThere were also 134 teenage women who gave birth, but only 22 of the partners involved were under 20.", "comment_count": 2, "id": 3736}, {"keywords": "Planning Authority, Gozo, Qala", "author": "Ivan Camilleri", "article_body": "Environment Minister José Herrera has hit out at a Planning Authority commission which is keen to approve plans to turn a rural room on virgin land in Gozo into a villa. \n\"Not on,\" Dr Herrera tweeted on Wednesday morning in reaction to news published by Times of Malta that the commission had decided to ignore the Environment and Resources Authority, which wants the Gozo villa plans blocked. \nContractor Mark Agius, known as ta’ Dirjanu, has applied to turn the 31-square- metre ruin into a residence with a footprint of some 200 square metres and install a pool overlooking landscape in the limits of Qala.\nVarious NGOs, the Environment Resources Authority and the Superintendence of Cultural Heritage, have all criticised the plans and a PA case officer has recommended that the permit be refused.\nHowever, architect Elizabeth Ellul, who chairs the Planning Commission, chastised the Planning Directorate for its refusal.\n\n“The board is very concerned that the directorate recommended a refusal to this application due to the residential status,” Ms Ellul said.\nThe board said the directorate did not analyse the submissions well, “which included the residential status, including a death certificate, which includes the whole structure”.\nThe board based its argument on a death certificate presented by architect Alexander Bigeni on behalf of the developer, to prove the room was once used as a residence a century ago.\nA room with a view. Photo: Daniel Cilia\nThe directorate, in its analyses, said the building appears to have been in disuse for a significant period, with aerial photos indicating the building has been without a roof since at least 1978.\nDespite this information, the board agreed with the developer that the room used to be a residence at least a hundred years ago.\nMs Ellul ordered the directorate to reverse its decision and prepare the necessary conditions so that the board can issue the permit next month.\nDr Herrera in a tweet said the commission's directorate of the directorate was 'not on'. The minister said he was preoccupied by Planning Commission’s decision to ignore amongst everybody else, the recommendations of the Environment Authority (ERA).\nHis tweet was retweeted by the Government of Malta. \nMinister Herrera has criticised the PA commission's decision.", "comment_count": 88, "id": 3737}, {"keywords": "Floriana, Music", "author": "", "article_body": "An 'absolute record' amount of waste was collected following the popular Isle of MTV music festival on Tuesday night. \nThe annual event sees thousands of revellers gather to watch international artistes at the Floriana Granaries. Plastic bottles, beer cans and empty food containers littered the ground following the concert.\n\"]\nCleansing Department employees did an all-nighter, clearing up a record 19 tonnes of waste, according to the department's director Ramon Deguara. \n\"It was a tough night for workers of the Cleansing Department as, after a few hours, they managed to get the Floriana and Valletta areas looking back to normal,\" he said.  \nEarlier, residents told the Times of Malta they dread the annual event, saying the party-goers relieve themselves on their front doors.\nThe 13th edition of the event, held Tuesday, saw international artists Bebe Rexha and Ava Max take the stage. ", "comment_count": 3, "id": 3738}, {"keywords": "Economy", "author": "", "article_body": "Malta's economy is expected to grow fastest among EU countries this year and next year, the European Commission said on Wednesday.\nThe economy is projected to grow by 5.3 per cent compared to a 1.2 per cent average in the euro area. Hungary and Poland come immediately after Malta with a growth forecast of 4.4%. \nMalta's growth next year is projected to be 4.8%, a full percentage point ahead of the next placed countries. \nThe eurozone forecast for 2020 has been lowered slightly to 1.4 per cent. The GDP forecast for the EU remains unchanged at 1.4 per cent in 2019 and 1.6per cent in 2020.\n\"All EU economies are still set to grow this year and next, even if the robust growth in Central and Eastern Europe contrasts with the slowdown in Germany and Italy,\" said EU vice president Valdis Dombrovskis.\n\nAccording to Brussels, those two countries will have the lowest growth levels in the eurozone in 2019: 0.1 per cent for Italy, 0.5 per cent for Germany.\nThe commission, however, expects a significant acceleration for Germany in 2020, when growth would leap to 1.4 per cent. \nMalta country report\nIn the country report on Malta, the European Commission observes that Malta’s economy grew by 6.7 per cent in 2018, making it the fifth year in a row in which real GDP has grown by over 5 per cent. The structural shift towards a fast growing, internationally-oriented services sector was the main factor behind Malta’s recent economic success.\nDomestic demand was the main growth driver in 2018, replacing net exports. In particular, strong employment growth boosted household disposable income, resulting in record-high private consumption.\nIn the first quarter of 2019, domestic demand was underpinned by public consumption and investment, while private consumption growth eased slightly. At the same time, net exports declined as a result of strong import growth.\nConsumer confidence remained above its historical average, but overall sentiment began to deteriorate in March, particularly in the services sector.\nWhile growth momentum is expected to remain solid, GDP growth is forecast to moderate in 2019 and 2020 to 5.3 per cent and 4.8 per cent, respectively as a result of private consumption growth gradually moderating, mirroring the pace of job creation.\nPublic expenditure is expected to increase faster than private consumption, as the government makes use of the fiscal space it has accumulated over recent years.\nInvestment is expected to remain robust over the forecast horizon, supported by planned infrastructure and health projects. Looking at the external sector, import growth is set to pick up in parallel with investment growth, narrowing the large current account surplus.\nAfter reaching 1.7 per cent in 2018, inflation was subdued in the first months of 2019 before accelerating in April, driven by rising food prices.\nPrices are expected to further increase during the peak tourism season and thenslightly decelerate, pushing headline inflation to 1.8 per cent in 2019 and 1.9 per cent in 2020.\n ", "comment_count": 0, "id": 3739}, {"keywords": "Construction", "author": "Ivan Camilleri", "article_body": "Plans by Fortina Hotel owners to turn a large prime area on the Sliema front into a mixed-development project including offices and apartments will be opposed by the PN Opposition.\nNationalist Party MPs Beppe Fenech Adamni and Ryan Callus said on Wednesday that the Opposition does not agree with the government’s valuation of the property, which was based on a small portion of the land and not on the whole multi-million project.Speaking during a session of parliament’s National Audit Office Accounts committee, the MPs also said the Opposition does not agree with conditions the government had reached with the Zammit Tabona family, which owns the Sliema site.The site was originally sold on the condition that it would only be used for tourism purposes, but the government has struck a deal allowing the owners to convert a portion of it into offices, apartments and shops. In exchange, owners will pay €1 million up front and €7.1 million after 10 years interest-free, when the project is completed.\nA total of 85 per cent of the buildable area is already taken up by hotel facilities, the Fortina group said.\nPN MP Beppe Fenech Adami accused the government of “acting as a bank for private businessmen, using taxpayers’ money\". With the parliamentary committee failing to agree on the deal, the government will now take the resolution to parliament’s plenary to debate and vote on the motion.\n'Special clause' \nThe developers are expected to issue a special hypothec on a number of still-to-be-constructed apartments on the Sliema front to act as a guarantee for the multimillion-euro project. \nAccording to the draft deed, each time the Zammit Tabonas would want to sell or transfer one of the luxury apartments, they will need the permission of the Lands Authority and have to pay part of their due balance of the remaining €7.1 million.\nLeading estate agents told Times of Malta that, at current market prices, a 200-square-metre apartment in Tigné is currently fetching over €1.5 million. The owners of the Fortina Hotel had acquired some 4,000 square metres of public land, through three different contracts signed in the 1990s and early 2000s for €1.4 million. \nThe public land was transferred to the Zammit Tabonas at a ‘low’ price since it was only to be used as a hotel extension and exclusively for tourism purposes.\nHowever, since 2017, the Fortina owners had been seeking to remove the government restrictions on their land so that while keeping a hotel, they could also build hundreds of square metres of offices, residential apartments and retail outlets for speculation.\n“Lifting of clauses concerned only 1,250 square metres of a landlocked plot”- Fortina Group\nFollowing negotiations, the government agreed to lift all its rights for €8.1 million, giving the Zammit Tabonas the right to develop their land according to new permits issued in 2018. The change of use on the former public land needs the approval of a specific resolution by Parliament.\nA db Group precedent?\nTimes of Malta is informed that the Fortina owners initially refused to pay the €8.1 million, as calculated by government architects, arguing that they wanted a similar deal to the one conceded by the government to the db Group over the ITS site.\nIt is understood that following further talks, the government ceded to the developers’ requests.  \nAsked to state whether they had conducted their own separate valuation of the land, Fortina CEO Edward Zammit Tabona refused to reply.\nHowever, in a statement issued on Tuesday, a Fortina spokesman admitted differences with the government over the negotiated price.\n“Although Fortina considered this premium to be far in excess of market value, especially considering similar agreements that have been approved by Parliament in the past, the group decided to meet this request.\n“The premium upon which we agreed works out at €6,480 per square metre of buildable area, which is an enormous sum of money especially when one considers that we already have full ownership of the land in question,” the spokesman said.\nFortina added that the lifting of the restrictive clauses concerned only 1,250 square metres “of a landlocked plot”. ", "comment_count": 7, "id": 3740}, {"keywords": "Accident, Construction, Environment", "author": "Claudia Calleja", "article_body": "What happens to victims of building collapses? One man whose mother died when their family home caved in calls for more support for those devastated by other people's negligence.\nPaul Vella was at a business lunch when he received the phone call that would change things forever. “Drop whatever you’re doing and head straight to hospital. Something happened to mum,” his wife told him.\nWhen he arrived at St Luke’s Hospital his sister broke the news: their childhood home in Cathedral Street, Sliema, had collapsed while his mother, brother and uncle were having lunch. The collapse was brought about by neighbouring excavation works.\nHis uncle Anthony Mifsud, an amputee, had managed to get out in time. But his 84-year-old mother Rita Vella and brother Joe were injured. His brother survived but their mother died a few hours later in hospital.\n“It was a terrible shock which we still feel to this day,” says Mr Vella.\n“Losing a mother is not easy. Our lives changed completely. From having a mother who used to watch out for us and call us, we suddenly found ourselves without her. It was a total collapse.\n“We had a very close family – seven kids with all the nephews and nieces. Our mother’s house was our meeting point for all those years. Then it was erased from our lives. When a mother who was so caring gets taken away by negligence and carelessness – it hurts.”\nThe Vella family home on 25, Cathedral Street, Sliema, and the aftermath of the collapse\nThe day everything changed\nThe home collapsed on April 12, 2000. The family had been noticing cracks in the property long before. Architects had told them there was nothing to worry about. But a few days before the accident the cracks increased drastically.\nOn the morning of the accident, Paul’s sister, Carmen, went to their mother’s house and saw that the situation was alarming. The building was shaking. Carmen headed to the neighbouring site and asked workers to immediately stop excavating and call the architect. A meeting was planned between the site architect and the family architect that day at 1pm.\n“My sister and her husband were there in the morning. Then, on my mother’s insistence, they went home for lunch to return soon after for the meeting. At 1.05pm my sister called my mother and told her they were on the way.\n“For some reason she got held up briefly. At 1.10pm she called my mother again to tell her they were leaving. No one answered. The lines had gone. Then a neighbour called my sister and told her there was a collapse,” Paul recalled.\nHe later learnt that, when the building caved in, his mother, brother and uncle were having lunch on the ground floor.\nBy the time she walked round the table and started heading out the building collapsed. My mother was buried totally except for her heel\n“My mother was sitting in her usual place, my uncle was sitting at table and my brother was going to sit next to her. My uncle noticed some fine dust falling onto the table. He looked up and told my brother. They decided to get out.\n“My uncle, who was an amputee, walked straight into the corridor all the way out. My mother’s first reaction was to check whether the cooker was switched off. So she went to the kitchen, which was a couple of metres away. By the time she walked round the table and started heading out the building collapsed,” he said.\n “My mother was buried totally except for her heel,” he said pausing to contain his emotions. “And my brother was covered up to his chest with stones,” he said adding: “When they cleared up the rubble the plates were still there. Flattened. With the food still there on the plates.”\nPaul received the phone call and left his business lunch, heading straight to hospital. At about 5pm his mother passed away. “That’s where we started our battle,” he said.\nRita Vella, pictured with three of her seven children, died when her home collapsed on April 12 2000\nPicking up the pieces\n“Thankfully my brother survived. My brother literally walked out of hospital with nothing but the clothes he had on. He still feels the trauma – he lived through it,” Mr Vella says. This, he adds, was a harsh blow for all seven siblings – Miriam, Carmen, Joe, George, Marthese (who has since passed away) Richard and himself.  \n\nAfter the incident his uncle moved to a maisonette and his brother was reunited with his wife – something good that came out of the ordeal. But the family got no support.\n“The government had mentioned a fund but in all these years I never heard of anyone getting any benefits for such cases. There’s nothing in place to support the victims. We had to keep chasing one department after the other.\n“You lose everything. Luckily enough our mother had a habit of handing out photos – they’re all we have left. Everything else is lost. That was the place where we were all born, all apart from Richard. In fact, it was a family joke, that he’s not really one of us because he was born in St Luke’s and is not a real Sliemiż.”\nApart from dealing with the loss of their mother and the property, they had to face a legal battle. “Something needs to be done to ensure justice is served,” he says adding the two contractors got away with a fine of €4,000 each for gross negligence that resulted in the death of his mother.\nPaul Vella speaking to The Times of Malta\nThe family was awarded €40,000 in damages by the Civil Court but the decision was appealed by both parties. Five years after filing the appeal, in April this year, the family got a notice from the courts giving them four days to pay €8,900 for the appeal to be heard. The family decided not to incur this expense and keep facing the courts – so they deserted the case.\n“We are the victims. We also received a paper from court to pay €25 in legal fees or face legal action,” he says, then smiles as he recalls: “As kids we would go to Valletta often. One thing our mother always told us, as we walked past the law courts was: never go past that first step.”\nHe is sceptical about the new building laws: “It’s no use having all these regulations in place then we expect the resident, be it a 20 or 90-year-old, to check whether other people have everything in line. It’s a matter of enforcement. There should be a centralised authority to ensure everything is in place. And I wouldn’t issue the permit unless everything is in line.”\nRELATED STORIES'Two people died when our home collapsed. I'd been hoping things would change'", "comment_count": 1, "id": 3741}, {"keywords": "Crime, Court", "author": "Edwina Brincat", "article_body": "A man who tricked lotto receivers using stolen cheques, prompting a nationwide warning, has been handed a six-year jail term.\nMatthew Camilleri, a 32-year old Gżira resident, was convicted of having been behind a scam whereby he swindled a number of lotto receivers by using cheques allegedly stolen in 2012.\nThe cheque book had been taken, together with a laptop, a generator, two TV sets, two printers and a keyboard, from a Mosta office.\nMr Camilleri was charged with theft, wilful damage to third party property, fraud, falsification of documents, knowingly making use of forged cheques, illegally dumping the stolen items at sea and a number of other offences linked to his arrest.\nHe was further charged as a recidivist.\nThe court heard how the accused would visit lotto outlets, request a ticket and allow some minutes to lapse before tendering payment, knowing fully well that after some 5 minutes, the ticket could not be cancelled from the system.\nHe would then come up with some excuse, offering to pay by cheque instead of cash, an offer the seller had little option but to accept. Later evidence showed that he would sometimes keep his cheque book out of sight until the ticket was issued.\nOn one occasion, when the vendor refused the cheque, the accused had promised to return with the cash, something he never did.\nA number of outlets fell prey to the scam, prompting a warning backed by a photo of the suspect fraudster, placing all lotto receivers on their guard.\nIn court it emerged that the suspect behind the Mosta robbery had never been identified. Nor was there any forensic evidence, including fingerprints, linking the accused to the crime scene.\nMr Camilleri's statements to the police, released without the assistance of a lawyer, could not be admitted as evidence against him, Magistrate Joseph Mifsud said.\nThe use of the stolen cheques did not automatically link the accused to the theft, the court observed.\nAs for the fraud, the court noted that the accused had sought to avert suspicion by going to different lotto outlets, putting ‘his’ ID number on the cheque and adding a telephone number to make his action all the more convincing.\nThe identity of the fraudster was ultimately confirmed through CCTV footage, the court observed, declaring the man guilty of fraud and recidivism whilst clearing him of theft and offences against the arresting officers.\nWhen meting out punishment, the court observed that the accused had a serious drug problem which he had not yet tackled, so much so that his latest attempt at rehabilitation had failed after he tested positive once again.\nNor could the court turn a blind eye to the fact that the man had wasted a number of opportunities to get on the path to reform.\nMagistrate Mifsud said that society deserved protection from persons like the accused who tried to take, all those offering a helping hand, for a ride.\nThe man’s unruly character, evidenced by “pages upon pages of convictions” merited the six-year effective jail term, the court concluded.\nInspectors Joseph Busuttil and Saviour Baldacchino prosecuted.", "comment_count": 0, "id": 3742}, {"keywords": "Education, Media", "author": "", "article_body": "A proposed Matsec reform which will require sixth formers to study another language apart from English and Maltese is drawing strong opposition, as Education Minister Evarist Bartolo personally found out on Wednesday morning.\nThe proposed reform, involving various aspects of the Matsec system, is open to public consultation until the end of the month. It was unveiled on Monday by Matsec examinations board chairman Frank Ventura.\nMr Bartolo uploaded a post on his Facebook wall arguing that every language that one learnt opened new doors, and apart from learning Maltese and English, it was good to learn another language. \n\nThe overwhelming reaction was that it was good to learn another language. But no one agreed that it should be made compulsory for sixth form students, as has been proposed. \nThose arguing against the Matsec proposals included former MP Deborah Schembri, who is no stranger to opposing reforms by Mr Bartolo. Two decades ago, she led a student march when she was a University student and he was minister for the first time in the 1996 legislature. The issue then was over stipends.\n\"Sorry but as much as I love languages and would urge anyone to learn them I absolutely do not agree with imposing their study on students at sixth form level. Not knowing a language at intermediate or advanced level does not mean one cannot communicate in that language. Imposing the study of a third language at that level means:\n\"1. That if you happen to dislike languages you mess up your chances to get to university where you could wish to study something which does not require the use of the said third language at all;\n\"2. You also waste your time studying something you dislike instead of studying something that interests you, which is, in my view, akin to mortal sin,\" she wrote on Facebook.\n\nMoving the goalposts\nShe said that making it a requirement from 2020 onwards meant that students who had already started studying a third language without much success now had their goalposts changed mid-game as they were stuck with the study of that language for an additional two years. \"So much for legitimate expectations!\"\nWhilst the rest of the reform sought to bring out the best in students by taking note of their interests, this imposition went diametrically opposite that ethos and put student interests aside.\n\"We cannot treat 16-year-olds like adults giving them the right to vote on one hand and then treat them like 2-year-olds expecting to know better than them by dictating what they should direct their knowledge towards,\" she added.\n\"We are a country which has given its citizens innumerable civil liberties, we cannot take away the right to choose when it comes to the most fundamental aspect of growth... education\n\"Compulsory education stops at age 16 so it is ridiculous to make any subject compulsory from then on. One's choice should be determined by university entry requirements for any given subject\"\n\"We are a country which has given its citizens innumerable civil liberties, we cannot take away the right to choose when it comes to the most fundamental aspect of growth... education.\nEvarist Bartolo. Photo: Darrin Zammit Lupi\n\"So please, if you are of the same opinion, take part in the public consultation and voice your concern. I just did,\" she said.\nAnother commenter, Geraldine Vella, said she disagreed with imposition, \"Remember those students studying sciences. They are already under huge stress, what we need to do is ease the load rather than make it heavier.\" She also argued that the level of teaching of languages in secondary schools needed to improve. Many students who got a language pass at ordinary level could still not use that language effectively, she said. \nBest time for new languages is in primary school\nDaniela Briffa said the best time for children to be introduced to foreign languages was in primary school.\nMelanie Meilak said not many students were good at languages and she feared many would drop out of sixth form. \"It would be better if courses on how to keep mentally healthy and how to handle stress are introduced,\" she said. \n\"Moreover teaching them another language doesn't necessarily make students more able to communicate. I see everyday students that have full degrees but they don't have skills to communicate with others because they spent to much time on books and less integrating with one another.\"\nMarisa Deguaraga said MEPs could speak their native language in the European Parliament but this reform was telling Maltese students that Maltese, post, secondary was not as important as other languages.\nReplying, Mr Bartolo disagreed, saying the importance of Maltese was not being reduced. If anything, it was being increased through changes in Systems of Knowledge (which will have more emphasis on communication).\nBut another user, Dona Caruana, told the minister that if he wanted to give importance to Maltese, he needed to see why foreign pupils in primary were refusing to speak Maltese and the Maltese were therefore having to speak in English and lessons, she said, were held in English.\nDoors being closed\nJeffrey Camilleri said doors were being closed to students who were not so good in languages. \nClaudia Agius also said the best time to learn a language was at primary school. Replying, Mr Bartolo said that in post-secondary, students would continue to learn a language which they would have started before. \"They will not be starting a new language,\" he wrote.\nClaudine Agius said that opportunity already existed in the current system. But she felt that 16-year-olds should be able to focus on the subjects they intended to specialise in. Not everyone was interested in languages,", "comment_count": 3, "id": 3743}, {"keywords": "Court, Leisure", "author": "Claire Caruana", "article_body": "Paceville entertainment chain Hugo's has lost an appeal before a top EU court to have its registration of a logo for its burger bar accepted.\nThe EU General Court upheld a decision by the European Union Intellectual Property Office (EUIPO) that the logo for Hugo's Burger Bar - one of the many establishments under the Hugo's brand - could not register its mark because it would infringe an earlier trademark owned by H'ugo's, a German restaurant chain specialising in Italian food.\nThe Maltese restaurant's name...\n... has been deemed to be too similar to the German one's to be trademarked.\nThe EUIPO had first turned down the request to register the burger bar's logo in 2017, arguing there was likelihood of confusion. The decision was appealed by Hugo's only to be turned down once again by the EUIPO's board of appeal.\nThe office noted that the goods covered by the signs for both establishments were \"identical\", both offering \"meat, fish, poultry, coffee, tea\" and other items.\nApart from a \"high degree of phonetic similarity\", the office also pointed to similarity between the logos of the two restaurants.\nHugo's then took the issue to the General Court to annul the EUIPO's decision. The appeal was rejected on Tuesday, with the court stating that where a trademark was composed of word elements as well as figurative ones, the word elements were more distinctive.\nWhen contacted, the Hugo's group said it is exploring its options.", "comment_count": 8, "id": 3744}, {"keywords": "Brexit, Politics", "author": "Vanessa Macdonald", "article_body": "The Maltese government has been giving unequivocal reassurances about the future of the 13,000 Britons living in Malta post-Brexit – but they clearly have many unanswered questions.\nAlmost 200 British expatriates turned up for a conference organised by Frank Salt Real Estate about Malta in a post-Brexit Europe.\nThe wide range of questions showed how much uncertainty there still is about basic things, from whether someone would need to change their UK passport or whether they could use it till it expired (answer: the latter), to whether a property-owner would need to apply for an AIP permit to cover their home, just as a third-country national would (answer: no, once it has been purchased, things will stay as they are).\nNot everyone in the audience was happy about Brexit’s implications. One man lamented that his European Health Insurance Card would no longer be valid after Brexit, while another welcomed the fact that his Turkish wife would be covered by the special ‘settled status’ being given to expats already here – whether workers, students or residents – but noted if he were not already married, then the situation for her would be that of a third country national seeking residence.\nThe conference at one point lapsed into a tax advisory session, with people asking the panel members for technical advice about fiscal benefits of various residence schemes and whether it would be beneficial for them to consider a different status.\nThe conference, at the Corinthia Palace in Attard, was addressed by the British High Commissioner Stuart Gill, who said that the new prime minister, scheduled to take over from Theresa May in a few weeks, would “likely want to renegotiate and would look for flexibility from the other EU leaders, rather than face a disorderly exit”.\nHowever, Prime Minister Joseph Muscat – while stressing Malta’s support for the UK – quickly poured cold water on this ambition, saying that after 19 months of negotiations, the November 2018 deal “was and would remain the only agreement on the table”.\nRELATED STORIES'You have nothing to worry about': Muscat's Brexit reassurance to Britons in Malta\n“We are half way through the extension [until October 31] and there is no justification for optimism,” he lamented, pointing out that once a new prime minister was appointed, there would only be 30 working days in which to agree on the way forward.\nThe situation in the UK is still very fluid. On Tuesday, the latest twist came from the Labour Party, which said it would support Britain staying in the EU if there was a second referendum on the deal negotiated by the Conservative government.\nLabour leader Jeremy Corbyn did not go as far as outlining what his party’s position would be in the event of a general election.\nThe procedure to replace Ms May has already started, and the Conservative Party's 160,000 members have until July 21 to vote. The winner should be announced on July 23.", "comment_count": 0, "id": 3745}, {"keywords": "Agriculture, Health", "author": "Ivan Martin", "article_body": "Overuse of pesticides in Malta has repeatedly hit the headlines in recent years, with EU-wide studies often flagging what appeared to be excessive spraying of fruit and vegetables by Maltese farmers. \nHowever, since the local authorities last year said they had tweaked the testing methods to make samples more representative of produce available on the local market, the results appear to be far less alarming than previous reports had indicated.  \nAccording to the latest European Food Safety Authority report on pesticide use based on locally-conducted tests, just three per cent of samples on the island were over the maximum residue levels permitted at law.\nThis was a drastic reduction from the more than 13 per cent which were found to be over the limit by local authorities in 2017. And, an even greater departure from results provided by the Maltese authorities later that year that had found nearly a fifth of samples had failed the tests.  \nAfter Times of Malta had reported on these test results, several farmers and stakeholders in the local agricultural industry had raised serious doubts over the findings published by the EFSA and Malta Competition and Consumer Affairs Authority which conducts tests on the EU’s behalf.  \n“This just can’t be – you’re telling me one in every five pieces of vegetables in Malta has too much pesticide? I’ve been active in this sector for decades and I can tell you that figure is way too high,” one veteran farmer and local lobbyist had said.  \nMalcolm Borg, a deputy director at Mcast’s Institute of Applied Sciences, had also raised an eyebrow at the findings telling this newspaper that the samples were hardly reflective of what was available on the local market.  \nSamples hardly reflective of what was available on the local market\nA closer look at the latest EFSA publications shows that around four in five Maltese samples were well below the minimum acceptable level of pesticide residue.  \nSome 15 per cent were also considered ‘safe’ as they were between the lowest and maximum thresholds. \nRELATED STORIESHow pesticides are monitoredPesticide equipment is 'not inspected'\nThe European Food Safety Authority has warned that residues resulting from the use of products intended to protect plant-based food may pose a public health risk.\nThe EU has regulations on the use of pesticides and maximum residue levels, which are meant to be followed by farmers in Malta.\nActivists campaigning for the reduction of pesticide use worldwide say pesticides have been linked to a wide variety of health hazards from headaches and nausea to cancer and endocrine disruption.\nAlso, chronic health effects may occur years after minimal exposure to pesticides ingested through food and water. ", "comment_count": 13, "id": 3746}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta leads with a #Timestalk interview in which Louis Galea says it was a mistake to let PN members vote for the leader. Dr Galea has been appointed by PN leader Adrian Delia to lead a reform of the party. Membership voting was first introduced two years ago when Dr Delia was elected.\nTimes of Malta also highlights remarks in parliament by Nationalist MP Ivan Bartolo about a man who lived in a van for seven months. \nMaltaToday quotes the Notarial Council saying the new rent law gives the Housing Authority the power to search residences. It also reports how a woman on Tuesday was accused of the attempted murder of her daughter. \nIn-Nazzjon says Adrian Delia on Tuesday listed proposals to ease the housing and rental crises when he spoke on the new rent law in parliament. \nl-orizzont leads with a call for government action over prostitution, which, an NGO expert said, leads to exploitation. It also quotes minister Michael Falzon saying the rent laws reform should not be a political football.", "comment_count": 0, "id": 3747}, {"keywords": "Climate, Weather", "author": "", "article_body": "Parts of Malta were left without power on Tuesday evening, with an Enemalta spokesman attributing problems to \"abnormally high demand\" for electricity.\nReaders in Birkirkara, Santa Venera, Qawra and Żebbuġ all reported experiencing sporadic power cuts, as Malta sweated on a balmy July evening in the midst of a heatwave.\nThe problems were separate and localised, an Enemalta spokesman told Times of Malta.\n\"The majority have been resolved,\" they added.\nTemperatures rose to 39 degrees Celsius during the day on Tuesday, with the mercury dipping to a still-sweltering 29 during the evening, the Malta International Airport weather station reported.\nElectricity demand tends to spike during periods of extreme weather: in August 2017, Enemalta had experienced a record nighttime electricity demand of 452 megawatts.", "comment_count": 62, "id": 3748}, {"keywords": "Parliament, European Union, Politics, Joseph Muscat", "author": "Luke Scicluna", "article_body": "Prime Minister Joseph Muscat was being held “hostage” to “criminals” around him to such an extent that he had lost his chance to lead the European Council, Opposition MP Jason Azzopardi said in Parliament.\nA few days ago, he said, the Council of Europe had approved its first ever “damning” report against an EU member-state - Malta. The government’s representatives had moved 42 amendments, Dr Azzopardi added, all of which were “shot down” in turn and supported only by Azeri representatives.\nDefending his decision to vote for the imposition of monitoring procedures against Malta - an amendment which ultimately failed to pass - Dr Azzopardi called untrue Justice Minister Owen Bonnici’s insistence that only Turkey had ever been subjected to such procedures.\nAlbania, Armenia, Azerbaijan, Bosnia, Georgia, Moldova, Russia, Serbia, Turkey, and Ukraine, he said, had all been monitored by the Council of Europe.\nHe justified his decision to support the amendment, arguing that he was proud to have attempted to defend democracy in Malta and that those who defended corruption were the real traitors.\nRELATED STORIESMuscat: 'I will continue as Prime Minister with more vigour'Muscat’s EU hopes ‘dented’ as horse-trading starts\nApart from the Council of Europe report, further evidence that Dr Muscat had been compromised by those whom he defended had emerged in a MaltaToday report concerning the transfer of government land to Dragonara Gaming Ltd by Economy Minister Chris Cardona.\nQuoting from the report, Dr Azzopardi said Dr Cardona had brought the multimillion euro land transfer agreement before the House without first raising it in Cabinet. A Prime Minister who was not compromised would not have hesitated to immediately demand Dr Cardona’s resignation, Dr Azzopardi said. What did Dr Cardona know about Dr Muscat?\nNo satisfactory response had been given to questions posed as to why Dr Cardona had bypassed Cabinet, Dr Azzopardi added.\nRELATED STORIESDragonara Casino deal could lead to EU action\nDr Azzopardi also asked for details of how often and to what end Dr Cardona had travelled abroad with Michael Bianchi, shareholder in a company - Toss A Coin - which owned part of Dragonara Gaming Ltd through another company, Peninsula Gaming Group Ltd.\nHe went on to say that Dr Muscat had not so much as chastised Dr Cardona and fellow ministers Konrad Mizzi and Edward Scicluna from quoting from the supposedly confidential Egrant inquiry report.\nThis was despite the fact that Magistrate Claire Stafrace Zammit stated that the ministers were “evasive” when justifying how they had managed to quote from the unpublished report.\nTwo years earlier, Dr Azzopardi said, Dr Muscat was one of those at the top of the list to succeed Donald Tusk as President of the European Council. This once-in-a-lifetime opportunity for Malta, the EU’s smallest member-state, and one which Dr Muscat was himself known to have desired, was lost due to the Prime Minister’s complicity in the criminal activities of Keith Schembri and Konrad Mizzi.\nDr Muscat was now “toxic,” and European leaders wanted nothing to do with him, Dr Azzopardi concluded.", "comment_count": 42, "id": 3749}, {"keywords": "European Union, Court", "author": "Victor Paul Borg", "article_body": "An expert in European law has expressed hope that the Maltese government will improve judicial independence following the recent European Court of Justice ruling in the case EU Commission vs Poland.\nThe court ruled that Poland was in breach of EU provisions on judicial independence when it lowered the retirement age for Supreme Court judges and gave its president the power to grant them permission to serve beyond retirement age, ostensibly on health grounds.\nMatteo Bonelli, a researcher in European and Comparative Law at the University of Milan and an expert in European Court of Justice jurisprudence on judicial independence, said he hoped the Maltese government “reads the judgment carefully and moves in the right direction”.\nDr Bonelli’s assessment on the ruling contradicts a press release by the Ministry for Justice, which argued that the Polish case has no relevance to the Maltese judiciary, particularly to an ongoing lawsuit on judicial independence in Malta’s constitutional court.\nIn April, the NGO Repubblika filed a challenge to Malta’s system of judicial appointment as well as the latest six judicial appointees. Repubblika invoked the same provisions of EU law that have been wielded in the Polish case – articles 2 and 19 of the treaty of the EU – as well as provisions in the European Convention of Human Rights and Maltese Constitution (see explanation in sidebar).\nRepubblika requested referral of the case to the European Court of Justice under the so-called ‘preliminary reference procedure’. The presiding judge, Mark Chetcuti, decreed on May 22 that he would be “inspired” by the Poland judgment before deciding on the request.\nThe judgment certainly reaffirms that EU law puts obligations relating to judicial independence on the Member States\n“The judgment certainly reaffirms that EU law puts obligations relating to judicial independence on the Member States,” Dr Bonelli said. “In other words there is a potential EU law dimension in the Maltese case.”\nPoland, and its bedfellow Hungary, had attempted to torpedo the case by arguing that the organisation of the national justice system is the exclusive competence of Member States. The European court accepted this point in principle but argued that when exercising that competence, “the Member States are required to comply with their obligations deriving from EU law”.\nThe long arm of EU law could reach Malta over the issue of judicial independence. Picture shows Lady Justice near the main entrance of the Supreme Court in Warsaw, Poland.\nThe court held that independence and impartiality require rules on the appointment and dismissal of the judiciary that “dispel any reasonable doubt in the minds of individuals as to the imperviousness of that body to external factors and its neutrality with respect to the interests before it”.\nIt also spoke of the need to have conditions and rules designed to protect judges from “potential temptations to give in to external intervention or pressure”.\nThose procedural rules must preclude not only any direct influence, in the form of instructions, but also types of influence which are more indirect and which are liable to have an effect on the decisions of the judges concerned.\nIn Malta’s situation, the Prime Minister’s untrammelled discretion in appointing and promoting the judiciary “opens the door to potential political influence”, as the Council of Europe’s Venice Commission had put it.\nA retired judge, speaking anonymously due to the sensitivity of the issue among the judiciary, also mentioned the Prime Minister’s discretion – or carrot – of appointing members of the judiciary to boards and agencies after retirement.\n“You simply do not bite the hand that feeds you,” he said.\nRepubblika have posited that Malta’s situation is worse than Poland’s. There, the lowering of the retirement age and the president’s discretion in approving service extensions beyond that only applied to supreme court judges. Here, however, the Prime Minister’s discretion in making appointments applies to all members of the judiciary. \n“The Maltese government needs to show a commitment to improve judicial independence in the country, in particular protecting the so-called ‘external’ independence of judges,” Dr Bonelli said.\n“An appointment system that offers adequate guarantees of independence is crucial in that sense, as the European Court of Justice – as well as the European Court of Human Rights and the Venice Commission – have made clear in their case law and opinion.”\nIn its press release, the government pointed out that Malta’s system of judicial appointments had been duly scrutinised and cleared in the lead-up to EU accession. This is a significant difference between Poland and Malta – experts refer to it as the “backsliding phenomenon”.\nRELATED STORIESChief Justice should abstain from judicial appointments case, NGO argues\nAsked about this, Dr Bonelli explained that “Malta is in a different situation compared to Hungary or Poland, where governments are trying to actively dismantle existing rule of law guarantees. But the absence of any progress [over the current system] can produce similar results in terms of the ultimate level of judicial independence in the country.”\nThe EU court’s jurisprudence on judicial independence and appointment\nMatteo Bonelli, who delved into European Court of Justice jurisprudence on EU constitutionalism in his recently completed PhD, said that the Polish ruling was another “innovative” judgment that “builds on the groundbreaking case of the ‘Portuguese judges’ decided in 2018.”\nA paper he co-authored last year had said that the Portuguese judgment heralded a “new sphere of EU law.”\n“In the Portuguese case,” Dr Bonelli explained, “the [European] Court brought under its purview virtually all national norms concerning the independence of the judiciary, and affirmed that Article 19 of the Treaty of the EU contains an obligation to ensure judicial independence of those courts that act as ‘European courts’.”\nThe court had now taken another step by finding “for the first time that national legislation breached Article 19”.\nOf the legal provisions invoked in the Polish case – as well as the Repubblika case in Malta’s constitutional court – Article 2 of the EU Treaty deals with the “rule of law and respect for human rights”. Article 19 obliges countries to “provide remedies sufficient to ensure effective legal protection in the fields covered by Union law”.\nThe judgment expanded on the concept of “effective legal protection” and coupled it to two provisions of the European Convention of Human Rights: the right to fair trial and the right to an effective remedy (from abuse or injustice, including injustices by a court itself).\nEvery member state “must ensure” that “courts or tribunals” as defined by EU law “meet the requirements of effective judicial protection”.\nThe court said: “The requirement that courts be independent, which is inherent in the task of adjudication, forms part of the essence of the right to effective judicial protection and the fundamental right to a fair trial, which is of cardinal importance as a guarantee that all the rights which individuals derive from EU law will be protected and that the values common to the Member States set out in Article 2 TEU, in particular the value of the rule of law, will be safeguarded.”\nThe judgment signifies an expansion and consolidation of the reach of EU law into the organisation of the judiciary in EU countries. That includes the requirements of judicial independence within the system of appointment.\n“On the basis of case law on Article 19 TEU,” Dr Bonelli said, “I agree that judicial appointment systems – not only in Malta but in any EU Member State – are a concern for the Court and the Commission.”", "comment_count": 14, "id": 3750}, {"keywords": "Environment, Gozo", "author": "Ivan Martin", "article_body": "The Environment Authority will be going to court in a bid to stop a proposed extension to a restaurant in Gozo’s prime dark sky area.\nEnvironment Minister Jose Herrera on Tuesday said that the Environment and Resources Authority would be filing an appeal in court by the end of the week following a controversial tribunal ruling to green light the development.\n\nA Planning Authority ruling to refuse embellishment works on the restaurant in Dwejra, Gozo, the Azure Window Restaurant, was overturned last week by the Environment and Planning Review Tribunal.\nWhen the proposal was first filed, astronomy experts had insisted that the introduction of lighting at the site would be “madness” and NGOs had said it threatened the entire area’s ecology.\nIn November of 2017, the PA had refused permission to install a canopy, lights and a sign, and to place tables and chairs at the site.\nIt had found that the proposal would negatively affect an important area and that it jarred with a Strategic Plan for Environment and Development meant to safeguard and enhance biodiversity.\nThe list of objectors included the Department of Physics at the University of Malta, Light Pollution Awareness Group, Birdlife Malta, Friends of the Earth Malta and Nature Trust Malta.\nShortly after last week’s decision, Environment Minister José Herrera had indicated that he disagreed with the Tribunal decision and encouraged objectors to appeal \"for the best interest of the environment\".\nWithin a matter of days, a coalition of NGOs announced that they had crowdsourced the necessary €3,000 to take the matter to court.\nThe owner of the Gozo restaurant has insisted that his proposed development plans would not increase light pollution at all.", "comment_count": 23, "id": 3751}, {"keywords": "Travel, Tourism", "author": "", "article_body": "Malta International Airport welcomed more than 3.2 million passengers in the first half of 2019. The company’s mid-year traffic results show an increase of 5.9 per cent in passenger movements over the same period last year. The airport forecasts 7.2 million passenger movements by the end of the year. While record passenger numbers were registered every month in 2019 so far, April, with a 10.5 per cent increase in traffic, was the fastest-growing month for the period. This was followed by June, which registered an upturn of 8.8 per cent. According to the analysis published last week by Airports Council International in its Airport Industry Connectivity Report 2019, MIA connectivity doubled between 2009 and 2019, putting it in the lead in a group of 26 airports in the European Union. Addressing a press conference on Tuesday, CEO Alan Borg said the solid results stemmed from Malta International Airport’s constant efforts, made together with government and the main tourism stakeholders, to make sure that the islands were served by the most convenient connections all year round.\nThe launch of three new routes this October, the extension of 17 routes from summer into the upcoming winter season, and increased flight frequencies on several routes, allowed the airport to look ahead with confidence and to keep working to secure sustainable traffic, Mr Borg said.\nHe said Brexit affected passenger movements during the first quarter. The UK remained the largest market, despite Brexit causing some ‘consumer confidence” in travelling.\nSpeaking at a press conference on the results, Tourism Minister Konrad Mizzi said the airport planned on attracting more business-class and leisure travel.\n“We want to attract tourists who will spend more money,” Dr Mizzi said.\nIn the coming months, we will be sitting down with Ryanair to discuss where MaltaAir will be travelling to. The agreement will ensure that the low-cost airline will have a more permanent stay in Malta, he said.", "comment_count": 1, "id": 3752}, {"keywords": "Police, Court", "author": "Edwina Brincat", "article_body": "An argument between roommates resulted in one of the men being stabbed while the other ended up in preventive custody on Tuesday.\nKingsley Oikhena, a 26-year old Nigerian construction worker, was escorted to court on Tuesday afternoon, pleading not guilty to attempted grievous bodily harm, slightly injuring the victim and carrying a knife in public without the necessary police licence.\nProsecuting inspector Roderick Attard explained how on Monday evening, a man wearing blood-stained clothes turned up at the Żejtun police station, seeking medical help.\nMeanwhile, an anonymous call to the same police station reported that there was a fight taking place inside a Żejtun residence.\nThe suspected aggressor was arrested shortly afterwards, the Court was told.\nThe man pleaded not guilty and was remanded in custody. No request for bail was made at this stage.\nLawyer Mark Mifsud Cutajar was legal aid counsel.", "comment_count": 0, "id": 3753}, {"keywords": "Customs, Crime", "author": "", "article_body": "Officials carrying out cash control checks at the the airport's Departures Lounge on Tuesday found €31,390 on an Irish passenger leaving Malta for Amman, Jordan.\nCustoms said in a statement that the passenger was waiting to board the flight when he was escorted to the Customs Office. The cash was found among his belongings.\nThe legal limit of €10,000 was returned to the passenger while the rest was seized pending investigations.\nEU-wide legislation dictates that cash amounts of more than €10,000 have to be declared to Customs. Nearly all countries in the world have adopted similar legal measures. Although there is no limit as to how much cash is carried by any passenger, any amount over €10,000 has to be declared to Customs.\nSo far, 29 cash cases were detected by Customs this year, with a total €780,824 of undeclared cash being detected.", "comment_count": 2, "id": 3754}, {"keywords": "Weather, Climate, Health", "author": "Stephanie Fsadni, Kristina Abela", "article_body": "Along with Cyprus, Malta recorded the hottest temperature in Europe on Tuesday, a sweltering 38˚C.\nHeatwaves all across the continent have marked the beginning of summer, with many countries including Germany, Poland, Czechia and France recording unprecedented temperatures, with the south-east of France, reaching a whopping 45.9˚C.\nA further rise in temperature to 40˚C is expected on Wednesday. Health authorities have issued a warning advising the public to avoid the outdoors between 11am and 4pm and to drink regularly.\nAt particular risk are young children, pregnant women and the elderly, who are vulnerable to overheating, which could lead to heat exhaustion and heatstroke.\n“The body finds it difficult to adjust its temperature when it’s very hot,” Charmaine Gauci, superintendent of Public Health, told Times of Malta.\n“Very young children and the elderly are the most vulnerable as their body adjustment system is weaker. They may suffer more from overheating, leading to heat exhaustion or heatstroke, the common symptoms of which are headaches and fainting,” she added.\nAnother risk factor is dehydration, as one tends to lose more body fluids through perspiration in high temperatures. There is the danger of not drinking enough water to replenish the lost fluids and minerals.\nThe situation is only exacerbated when one drinks tea, coffee or alcohol.\n“You should avoid such drinks but if you do have them, increase your intake of water,” Dr Gauci suggested.\nShe warned that the elderly may be at a higher risk of dehydration because they may lose their thirst sensation and, therefore, do not feel the need to drink water.\nShe thus urged the public to keep a close eye on elderly relatives or neighbours.\nIt is the third heatwave to hit Malta in just a month\n“Contact them frequently, especially if they live alone, because if they suffer heat exhaustion, they might lose consciousness,” she said.\nThe Meteorological Office regularly keeps the Health Department updated on the weather forecast. “We alert hospitals and homes for the elderly when temperatures are expected to rise, so they can keep patients and clients in cooler areas, provide them with more water and give them more attention,” Dr Gauci noted.\nPeople suffering from chronic diseases, such as cardiovascular disease, and pregnant women should also drink more water and seek a doctor’s advice if they have any concerns.\n“Pregnant women have to be especially careful because if they become dehydrated, their baby will also be dehydrated,” she pointed out.\nAs for the ideal water intake, Dr Gauci said this depended on a number of factors, including the level of humidity, working conditions and a person’s body weight – the higher the body weight, the more one needs to drink.\nOne should also avoid the peak sun hours between 11am and 4pm and stay in the cooler areas indoors.\n“Choose temperature-controlled rooms and if you stay in a typical Maltese house, it’s better if you stay on the ground floor as it would be much hotter upstairs,” Dr Gauci said.\n“Also, many people like to open doors and windows to let in some breeze but in that heat, especially in the afternoons, such apertures should be kept closed so as not to let in hot air,” she continued.\nDr Gauci also suggested that if possible, those who work outdoors should try to work indoors during the peak hours of sunshine.\nThe heatwave is the third spike that Malta has experienced since last month. Temperatures rose as high as 37˚C in early June and to about 38˚C at the end of the month. On Monday, the mercury rose to a sizzling 39˚C.\nTemperatures are expected to drop by a few degrees towards the end of the week with the northwest wind providing some respite from Friday onwards.\nStay cool\n• Regularly drink cool water.• Avoid hot food like soups and choose colder options such as salads.• Avoid tea, coffee and alcohol.• Wash frequently.• Stay in cooler areas of the house and at work.• Draw curtains to keep out the sun’s rays.• Avoid the outdoors between 11am and 4pm.• Seek advice if you have any concerns.", "comment_count": 9, "id": 3755}, {"keywords": "Population, Migration", "author": "", "article_body": "One of every seven people in Malta is a foreigner, almost double the amount in the EU as a whole.\nEurostat revealed on Tuesday that 14 per cent of the people living in Malta are foreign, compared to just 7.8 per cent in the EU.\nThe situation in Luxembourg is the most extreme, with 47.8 per cent – almost half the population – being made up of foreigners, followed by Cyprus (17.3%), Austria (15.8%) and Estonia (14.9%). Malta is in fifth place.\n\nThe report gives the population in 2018 as 475,701, of which 67,145 were foreign. This represents an increase in population of 15,404 since 2017, 12,824 of whom were foreign.\nEurostat reported that half a billion people living in the EU do not have the nationality of their country of residence. Also, 1.3 million Europeans live in one country, but work in another, and 1.7 million EU students study abroad.\n\nIt also reported that the number of acquisitions of citizenship granted to people living in the EU member states increased during the period 2008 to 2017.\nFluctuating at around 800,000 between 2008 and 2012, it increased in 2013 to reach 980,000. After that it decreased again in 2014 and 2015 to reach a peak of 995,000 in 2016. In 2017, the number was down to 825,000.\nMalta granted 1,973 citizenships in 2017, the bulk of them to Russians (464), followed by Saudis (342) and Britons (195).\nDiscover the latest figures on the mobility of people in Europe in the new digital publication \"People on the move - statistics on mobility in Europe\".", "comment_count": 23, "id": 3756}, {"keywords": "Accident", "author": "", "article_body": "A 49-year-old man from Pembroke was injured on Tuesday morning when he fell off scaffolding at a private residence in Triq is-Salini, Salina.\nThe accident happened at about 8am as the man was starting to work on a  balcony.\nThe police described his condition as grievous.", "comment_count": 2, "id": 3757}, {"keywords": "Crime, Court", "author": "", "article_body": "A mother who allegedly tried to strangle her 9-year old daughter with a shoelace has been remanded in custody after pleading not guilty of attempted murder.\nJordanos Gabrhiwet, a 30-year old Eritrean migrant, currently residing at the Hal Far Open Centre, was charged with attempted murder and causing slight injuries to her daughter in the incident which allegedly took place on Monday.\nProsecuting Senior Inspector Trevor Micallef explained how staff at the Open Centre had been alerted and had rushed to the site where the woman was attempting to strangle the child with a shoelace\nLuckily the girl suffered only slight injuries, the court was told.\nLegal aid counsel Mark Mifsud Cutajar said that bail was not being requested at the arraignment stage.\nThe mother was remanded in custody.\nThe daughter was reportedly entrusted into foster care.", "comment_count": 0, "id": 3758}, {"keywords": "Gozo, Planning Authority", "author": "Ivan Camilleri, Philip Leone Ganado ", "article_body": "Updated 12.30pm with PA hearing outcome\nThe Planning Authority is preparing to approve a controversial application by a Gozitan developer to turn a small, dilapidated room in the idyllic outskirts of Qala into a residence on more than five times the footprint.\nThe plans, in an area known as Tal-Muxi, had been recommended for refusal by the planning directorate and faced objections from Flimkien għal Ambjent Aħjar, Nature Trust, Din l-Art Ħelwa, the Superintendence of Cultural Heritage and the Environment and Resources Authority.\nBut in a hearing on Tuesday, the three-person Planning Commission board said it was \"very concerned\" that the plans had been recommended for refusal and accused the directorate of having failed to \"analyse well the submissions\". \nIt requested the case officer to draw up conditions for a permit, which is now expected to be approved in a hearing in August. \nMark Agius, a developer known as Ta’ Dirjanu, is a partner of Gozo’s foremost developer Joseph Portelli of Mercury Towers fame.\nHe wants to restore a 31-square metre room in the middle of some fields and turn it into a 200-square metre residence complete with a swimming pool and other facilities. The site lies outside the development zone in a rural location mostly used for farming.\n“It is difficult to believe how someone can even think of turning this area into a residence. It’s a non-starter and we hope that the Planning Authority, which is resisting this application, sticks to its guns and does not allow any pressure to give in,” a member of Din l-Art Ħelwa told Times of Malta.\nInsisting on a formal objection, the ERA said the site is in a very sensitive rural location of high scenic value which should remain untouched.\nSite is in a very sensitive rural location of high scenic value which should remain untouched\n“There are significant environmental concerns regarding the proposal in view of the replacement of an existing traditional rural structure with a new modern building with the resultant visual impacts that significantly intrude into the pleasant panoramic view,” the ERA said.\nThe Superintendence of Cultural Heritage also shot down the proposal as breaching planning rules.\nRecommending a refusal, the planning directorate also expressed doubts over the applicant’s insistence that the building was used for residential purposes many years ago.\n“Although architect Alexander Bigeni has submitted documentation linking residential use to this property in 1921, aerial photos indicate that the building has been without a roof since at least 1978, hence the residential use is not considered as ‘legally established’.\nIn the hearing on Tuesday, the Planning Commission board said the submissions showed the residential status of the property - despite the directorate's doubts - and that the existing building would be rehabilitated, addressing the concerns of the SCH. \nIt said the project architect should add 60 indigenous trees around the site. \nRELATED STORIESOpinion - How mega development will change the face of Naxxar", "comment_count": 168, "id": 3759}, {"keywords": "Planning Authority", "author": "Matthew Xuereb", "article_body": "The Planning Authority has received an application to turn a large garden in the heart of Lija into an apartment block with underground parking.\nIf the application by Bugeja & Desira Ltd goes through, it would spell the end of the 800-square metre garden with its 43 trees, located between Triq id-Dejqa and Triq il-Forn in Lija’s Urban Conservation Area.\nInstead, a block of 10 apartments will be erected, with five at ground floor level and five above, as well as washrooms at roof level and four levels of underlying parking holding a complex of 49 garages.\nThe garden’s boundary wall, an existing garage and storerooms will be demolished although two houses adjacent to the garden, built in the 1800s, will have their facades retained.\nThe Planning Authority is considering a similar application to develop a 400-year-old garden at the crossroads of the Three Villages, Lija, Balzan and Attard.\nThe request is to demolish the 920-square metre garden and the adjacent baroque residence to replace it with townhouses and swimming pools.  \nObjectors to the latest proposed development say traffic would be expected to increase and the development would adversely affect the skyline and streetscape\nThe apartment block would be close to historically important structures such as the Lija parish church, small chapels and Villa Guorgion, a protected site. \nObjectors also say that one of the houses lying within the development used to be a police station during World War II and a pillar postal box at this site is afforded protection.\nThey also expressed concern about the extent of the excavation, saying all the affected properties are old houses of character including a small chapel, constructed using traditional architecture features including stone slabs, timber beams, arches and double leaf masonry walls. The works, they claim, would probably cause structural problems to various surrounding structures.\nIn a representation filed with the Planning Authority, one resident said: “The chase for development while paying absolutely no attention to the character of what is being destroyed leads to a permanent loss of the identity of each village, and a lower quality of life for those living in the vicinity.\n“The policies that are being adopted to permit such development can only lead to the complete loss of all our fabric if such developments are permitted to proceed, as the loss of one property leads to a knock-on effect on the remainder of the surrounding properties. Furthermore the roads and infrastructure are not designed to support such large developments.”", "comment_count": 0, "id": 3760}, {"keywords": "European Union", "author": "Ivan Martin", "article_body": "A controversial agreement on the Dragonara Casino could expose Malta to action from Brussels, the government’s legal advisers have warned.\nSenior government officials received legal advice in relation to a motion that was approved in Parliament last week to extend a 10-year lease on the prime Paceville real estate housing the casino for a further 64 years, sources told Times of Malta.\nThe casino concession was first granted to Dragonara Gaming Limited in 2010, for a decade-long lease.\nHowever, a motion, put forward last Tuesday by Economy Minister Chris Cardona, for the extension of the casino land rights for another 64-years was approved by both sides of the House.\nRival casino operators who spoke to Times of Malta have described the deal as “scandalous”.\n“This deal is not only shocking, but probably illegal, and we are not ruling out legal action,” one angry operator said yesterday.\nDragonara was first awarded the 10-year lease following a public tender, and operators on Monday insisted that the extension agreement should have been once again opened for public bids.\n“This extension is just mind-boggling. There should most definitely have been a call for public bids on this. It wouldn’t have just been casino operators who would have been interested in bidding, I’m sure gaming companies, and even other businessmen – including possible consortia – would have bid for this,” one industry leader said.\nAlthough the land housing the casino is not government-owned, the government does have title to it for a fixed period of another 64 years.\nSources said that the Dragonara operators had first sought to extend the lease for the remaining period as far back as 2017.\nA government source, privy to internal discussions on the matter, said the legal advice handed to them indicated that the extension of the deal should indeed have been done through a public tendering process.\nAnd, although the law permitted for such agreements to be “modified” in certain circumstances, extending the contract for such a long period of time was not considered an acceptable modification.\nFor such alteration of a contract to be compliant, a new award procedure would be required, the lawyers told the government officials.\nEven worse, the legal advice warned the government that the extension of the agreement could constitute a violation of public procurement obligations, and could effectively lead to infringement procedures by the European Commission.\nThe Economy Ministry said the deed entered into by Casma Ltd with Dragonara Casino Ltd involves the grant of a title of temporary sub-emphyteusis over private land managed and administered by Casma Ltd under title of temporary emphyteusis.\nThe deed does not grant any rights or provide any guarantees to Dragonara Casino Ltd that it may continue to enjoy a concession to operate a casino from the premises in question. Nor does the transaction involve the grant of any concession in terms of the Concessions Directive and the Concessions Contracts Regulations, the ministry explained.\n“The transaction does not involve any public procurement. Before tabling the motion (including a draft  of the relative deed regulating the transaction) for scrutiny by the House of Representatives, legal advice was sought and obtained to ensure the transaction is fully compliant with applicable Maltese and EU laws and regulations.”\nIn reaction, Dragonara Casino director Franco Degabriele said the extension was granted in full compliance with the law, backed up with all the necessary legal advice.\n“We are also happy to note that such extension found the approval of both sides of the House of Representatives.”", "comment_count": 8, "id": 3761}, {"keywords": "Crime, Police", "author": "", "article_body": "Updated at 3.05pm, adds arraignment\nA man, arrested by armed policemen in San Ġwann on Monday after 23 kilograms of cannabis and some €45,000 in cash were found in his car, was remanded in custody after pleading not guilty on Tuesday.\nJustin Farrugia, the 28-year-old Valletta resident, was taken to court on Tuesday afternoon where he pleaded not guilty to aggravated possession of cannabis and cocaine, dangerous driving, disobeying police orders and resisting arrest.\nThe man was further charged with driving without a licence and without a valid insurance cover, damaging third party vehicles and ignoring a ‘no entry’ sign. He was also charged with relapsing.\nProsecuting Inspector Jonathan Cassar explained how members of the Drug Squad had been on the suspect’s trail as he drove his vehicle out of an underground garage.\n“He contravened a one way sign and crashed into a car,” Inspector Cassar told the court.\nA search of the vehicle and the garage yielded the drugs and cash, the Inspector said.\nThe arrested man sat silent at the dock, choosing not to answer any questions put to him by the court.\nDefence lawyer Arthur Azzopardi entered a not guilty plea on behalf of his client but did not request bail at this stage.\nThe court, presided over by magistrate Simone Grech, upheld a request by the prosecution, issuing a freezing order upon all the man’s assets, save for the €13,976 yearly allowance according to law.\nThe man had been targeted by a drugs operation and was arrested by armed officers, some of them hooded, on Monday close to Mater Dei Hospital. He tried to dodge arrest by driving off, ramming a police vehicle and crashing into a number of other vehicles, prompting the officers to fire warning shots.", "comment_count": 0, "id": 3762}, {"keywords": "Court, Crime, Traffic", "author": "Edwina Brincat", "article_body": "A motorist allegedly involved in a hit-and-run incident in Luqa last Sunday evening, was granted bail on Tuesday after pleading not guilty to attempting to grievously injure a pedestrian.\nHagen Azzopardi, a 25-year old Msida resident, was driving his VW Golf along Triq Misraħ iz-Zgħazagħ, Luqa at around 9pm when he allegedly ran over and grievously injured a 27-year old man from Sta Venera.\nHe then drove off the scene, hitting a number of cars during the getaway.\nPolice tracked him down to Msida following eyewitness accounts of the alleged incident.\nThe young driver, alongside his 19-year old girlfriend, was arrested after being stopped close to the Junior College.\nMr Azzopardi pleaded not guilty to attempted grievous bodily harm, seriously injuring the pedestrian and wilful damage to third party property, including a Mercedes Benz, a Skoda Fabia Combi and a Peugeot 307.\nHe was further charged with dangerous and reckless driving.\nProsecuting Inspector Paul Camilleri explained that the alleged victim, a former boyfriend of the accused’s girlfriend, had repeatedly phoned the girl and her current boyfriend, making contact even when the girl had reportedly changed her mobile number.\nThe latest calls dated to Sunday when the alleged victim had asked the accused to go to Luqa where the whole incident eventually took place.\nMagistrate Simone Grech, after hearing submissions by both parties, upheld a request for bail against a deposit of €500, a personal guarantee of €2500 and other conditions including  a curfew between 7.30pm and 6.00am.\nThe court also issued a Protection Order in favour of the alleged victim.\nInspector Paul Camilleri prosecuted.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 5, "id": 3763}, {"keywords": "Migration", "author": "", "article_body": "Updated at 4.40pm, adds migrants' arrival\nForty-four people including four women and three children have been brought to Malta after being rescued by the NGO ship Alan Kurdi.\nA Tunisian fisherman and the civil search plane Colibri alerted the Maltese maritime rescue centre on Sunday that the migrants were in distress on a boat south of Malta.\nThe alert was raised just hours after 65 rescued persons were handed over to Malta by the Alan Kurdi.\nThe Alan Kurdi reached the boat after intercepting the radio calls.  The rescued people are from Syria, Libya, Pakistan, Bangladesh and Guinea, Sea-Eye said. The youngest on board is 15 months old.\nPhoto: Jonathan Borg\nThe migrants were transferred to a Maltese patrol boat at sea.\nThe same procedure was followed on Sunday when the ship was refused permission to enter Maltese waters after picking up the 65 migrants off Lampedusa. That group of migrants is to be distributed by Malta among other EU countries. \n\n\"We are incredibly happy that we could be in the right place again at the right time and that we now know 44 more people are in safety,\" a spokeswoman for the Sea-Eye said. \"A 15-month-old baby should never have to be in such a life-threatening situation,\" she added.\nThe two other children are three and five, the NGO said. The Alan Kurdi plans to continue its mission in the search and rescue area off Libya after the handover.", "comment_count": 0, "id": 3764}, {"keywords": "Traffic", "author": "", "article_body": "A footbridge is to link the Mcast campus and residences in Corradino with Paola by spanning Dom Mintoff Street, which goes up Corradino Hill.\nInfrastructure Malta said the development will open up a new pedestrian and cycling route through Mediterranean Gardens to provide a quicker and safer route for thousands of students who walk, cycle or use public transport to get to Mcast and the Mariam Al Batool School further up the hill.\nThe bridge will also improve access to the Corradino Industrial Zone as well as the mosque and the church in the same area.\nCurrently, to reach these locations, pedestrians need to cross several arterial roads, including the Corradino roundabout.\nThe Corradino end of the proposed overpass will rise from a small plot of disused land wedged between Dom Mintoff Road and the service road leading to the main entrance of the Mcast Campus and to the Corradino residential area.\nThe four-metre wide bridge will extend 20 metres across the road, to the Mediterranean Gardens, which stand at an elevated position several metres above the same thoroughfare. The steel bridge will have gently-sloping ramps for cyclists and pedestrians at both ends. The design of these ramps meets applicable National Commission for Persons with Disability guidelines, so that they can be accessible to all. At the Mcast end, the overpass will also have an elevator.\nInfrastructure Malta plans to embellish the areas at the two ends of the bridge. The agency will replace a derelict area within this garden to open up a new pedestrian and cycling pathway that links the overpass with the existing bus laybys in Paola Hill, the road leading to the centre of this locality. It will also include adequate lighting systems and CCTV surveillance on the bridge deck and the rest of the new pathway, to improve its safety at all times.  \nThe Planning Authority process to launch public consultation and obtain the necessary development permits is already in progress. This month, Infrastructure Malta also issued a call for offers for construction and steel engineering services, so that it can start works on site as soon as possible later this year.\n\nThis project is the third pedestrian overpass the agency will be developing in 2019. This summer, it is starting construction of an overpass for cyclists and pedestrians in Aviation Avenue, close to the Institute of Tourism Studies and Malta International Airport, between Luqa and Gudja. Works to build another pedestrian and cycling overpass connecting Hamrun, Blata l-Bajda and the Floriana Park and Ride facilities will commence soon.\nInfrastructure Malta is also investing in other new infrastructure for alternative, more sustainable modes of travel as part of the ongoing Marsa Junction Project and the reconstruction of Buqana Road, between Mtarfa and Mosta, Luqa Road, Santa Lucija and Qormi Road, between Qormi and Luqa.\nSimilar infrastructure is included in the upcoming Central Link Project, Pembroke-St Julian’s Connections project, the new Santa Lucija roundabout tunnels project and the Msida Creek Project. These major arterial road upgrades will include other pedestrian bridges, new bus laybys and kilometres of new cycle lanes and footpath, including Malta’s longest segregated bi-directional cycle track, connecting Mriehel, Birkirkara, Balzan, Attard and Ta’ Qali. ", "comment_count": 0, "id": 3765}, {"keywords": "Media", "author": "", "article_body": "Ramona Depares has been appointed head of news and Diana Cacciottolo will assume the new role of digital content manager in an editorial revamp at Times of Malta.\nRamona joined Times of Malta editorial staff on a full-time basis in 2011, but has formed part of the media house’s team of freelance writers since the mid-1990s.\nShe was awarded the national journalism award twice, in 2015 for her contribution to cultural journalism and in 2014 for her opinion column.\nFor the past years she has occupied the role of assistant editor with The Sunday Times of Malta and editor of the monthly Sunday Circle magazine. The magazine has been consistently named Malta’s favourite lifestyle publication in independent surveys.\nRamona, a graduate in law from the University of Malta, is also passionate about creative writing and will be releasing her debut publication, Beltin, in November.\nDiana is a former BBC News journalist who moved to Malta from London last year. She was deputy editor of Social News for the BBC News, overseeing some of the largest social media accounts in the world and managing a global team with hubs in London, Washington and Singapore.\nShe was involved in the corporation’s strategy to attract younger and female audiences to the BBC and also worked with the digital video and online teams.Prior to that she was a political correspondent with the Irish News in Belfast.\nDiana, who is from Co Fermanagh in Northern Ireland, said: “I’m delighted to join the Times of Malta at this exciting time and look forward to helping to shape its digital content to attract new audiences.\"\nMatthew Xuereb, who previously served as head of news, will take on the role of assistant editor.\nTimes of Malta editor in chief Herman Grech said: \"It is not enough to sit back knowing Times of Malta remains, by far, Malta’s biggest news organisation. We are lucky to have a team of talented individuals, and I’m optimistic our new appointments will help elevate Times of Malta to the next step, especially in the ever-growing digital field.”", "comment_count": 2, "id": 3766}, {"keywords": "Education, Weather", "author": "Claudia Calleja", "article_body": "Nearly 5,000 people have signed a petition calling on the government to instal air-conditioners in classrooms, as children return from summer school exhausted from the heat and soaked in sweat.\nParent, relatives and teachers who signed the online petition have described the situation in classrooms as “a horror”, likening the conditions to “a sauna”. \n“Heat is unbearable in classes especially during the summer season,” says the petition.\n“Things have changed a lot since parents are both employed, thus sending children to SkolaSajf.\n“The government can resolve the problem by installing solar panels on school rooftops thus generating its own energy.”\nThe petition, which was set up by a mother several months ago, has been gaining traction in the past few days as temperatures soar to heatwave levels. It is now close to reaching its 5,000-signature target.\nAmong the hundreds of comments posted, a teacher who works at the government-run summer programme SkolaSajf wrote: “As soon as they arrive in class many children immediately comment about the heat.\nBy 10am, the children are all covered in sweat to the extent that it starts dripping off their face\n“By 10am, most of the children are all covered in sweat to the extent that it starts dripping off their face.”\nAnother teacher said: “I understand the children. They sometimes cry about the heat and I wouldn’t know what to do since there’s nothing I can do.”\nSome petitioners added that the situation was not limited to government schools but applied to any school that did not provide air conditioning in summer.\nMany commented about the fact that children struggled to concentrate in the heat – including during exam period.\n“When June starts, it’s becoming very hot in the classrooms… Everybody starts sweating. My concern is that during exam week, it won’t help children to concentrate enough.\n“Another suggestion is to start annual exams at the beginning of June after benchmarks, to avoid heatwaves,” one woman wrote.\nParents and relatives also shared their concerns.\n“My nephews are getting home after a morning at summer school completely soaked in sweat and this is so unfair. This is an urgent issue which should be tackled asap,” one woman wrote.\nA grandmother sharing her views added: “My grandchildren need an aircon at school considering they only have a ceiling fan which barely makes a difference in the classroom – they come home sweating from the heat in the classroom.”\nQuestions were sent to the government but no replies were received by the time of writing.", "comment_count": 27, "id": 3767}, {"keywords": "Crime, Gaming", "author": "", "article_body": "A manager at a gaming company has been handed a suspended jail term after being convicted of misappropriating several thousand euros.\nA court heard how Pokeridol Limited, an online gaming company, had reported to the police that its operational manager, Daniel Paul Micallef (the accused) had reactivated a number of unused players' accounts by changing the passwords, thus gaining access to them.\nWith his own access to the Ongame Admin Tool - the access tool for the gaming network which provided Pokeridol with the poker software and a player backend - the accused was able to create tournament tickets on these player accounts.\nHe used those tickets to play in these accounts and his own. He then transferred funds to his own poker account and tried to withdraw the money.  \nThe company claimed that the accused had undercut the total amount of $34,000 (€27,500). \nDuring the proceedings, the accused’s lawyer exhibited a settlement agreemententered into by the accused and the company.\nIt was agreed that $34,000 had been misappropriated and the accused would refund the amount subject to a payment plan. There was a set-off due to the accused and the parties agreed that the amount which was certain, liquid and due was €26,200. On the day, the agreement, the accused paid €5,500 and the rest had to paid by instalments.\nOn the basis of this agreement together with other evidence, the court concluded that the prosecution has proven the case.\nIn handing down judgement, the court noted the nature of the offence, the clean criminal record of the accused and the fact that he had recognized his mistake and has started to repay the amount due.\nBut the court noted that he had not always been consistent with the payment plan. It said the company could proceed at law on the basis of the agreement entered into for the outstanding balance. Since the misappropriated amount was not negligible the court said it was proper to impose a suspended sentence.\nDaniel Paul Micallef was therefore condemned to two years imprisonment suspended for three years. ", "comment_count": 4, "id": 3768}, {"keywords": "Properties", "author": "Ivan Camilleri", "article_body": "Updated at 2.50pm, adds Fortina statement\nThe owners of Sliema’s Fortina Hotel are about to have restrictions on former public land lifted by the government, allowing them to build shops and apartments potentially worth tens of millions on land currently reserved exclusively for tourism.\nDuring negotiations between the Lands Authority and the hotel owners, the Zammit Tabona family, it was agreed that the restrictions could be lifted against a payment of €8.1 million at current market prices.\nThis valuation followed reports submitted by government architects.\nHowever, instead of paying the agreed sum all at once, as would normally be the case, the government has agreed to take a payment of just €1 million upon the signing of the contract.\nThe rest – more than €7 million – will be paid interest free at the end of a 10-year period from when the deed is signed.\nNo call for tenders has been issued for the land in question, which was originally intended exclusively for tourism purposes but will now also be developed into office, retail and residential units.\nIndustry sources have complained about the “simply ridiculous” terms agreed, saying the €8.1 million valuation is already on the low side.\n“€1 million won’t even buy you a small plot in the area let alone the space to build a massive commercial development.”\nThe land on which the Fortina Hotel is built had been acquired by the Zammit Tabonas in bits and pieces since the 1960s, from both private owners and government.\nThree separate public deeds were then signed in 1991, 1996 and 2000 through which the owners managed to acquire another 4,000 square metres of public land to extend the hotel, paying the government €1.4 million for it.\nOne condition, however, was that this land could only be used for tourism-related purposes.\nUnder the new deal, this restriction has now been lifted and the government has agreed to a request by the Fortina owners to be granted ‘freehold’ over the land.\nThe government still needs the approval of Parliament and a resolution is expected to be presented shortly. \nLast year, Edward Zammit Tabona, CEO of Fortina Developments Company, acquired a permit from the Planning Authority to demolish one of the hotel blocks and instead build a 15-storey office block on its existing land. At the time, there was no approval yet from the Lands Authority for this development.\nApproval was also granted to raise the height of the hotel by a number of storeys and to build residential units for sale together with a retail complex.\nTimes of Malta is informed that if Parliament approves the resolution, the government will be signing the new deal with Edward Zammit Tabona and Antoine Portelli on behalf of Fortina Developments Ltd and with Julian Zammit Tabona and Adrian Zammit Tabona on behalf of Fortel Services Ltd.\nTimes of Malta has reported that the office block, still to be built, has already been sold to a gaming company for over €65 million.\nAsked to say whether the company had carried out its own valuation for the concession and whether the development could take place without Parliament’s approval, Mr Zammit Tabona did not reply.\nJames Piscopo, a former Labour Party CEO who was appointed CEO of the Lands Authority last year, was a business partner in commercial companies with members of the Zammit Tabona family, including the Fortina CEO.\nWhile he had failed to declare his interest to the Lands Authority board on time, as he was obliged to do, Mr Piscopo had declared he was not going to participate in negotiations over this deal to avoid a conflict of interest.\nHe had also declared that he was going to sell his shares in various companies to avoid potential conflicts of interest.\nFortina's reaction\nIn a statement on Tuesday, Fortina said the group has long been in negotiations with the authorities to lift a restriction on development, other than for touristic purposes, on part of its site, which concerns a circa 1,250sqm landlocked plot that has been owned by Fortina for 30 years.\nFortina considered the €8.1 million premium requested by the Land Authority to be far in excess of market value, but it still decided to meet this request.\nA spokesperson said that the premium worked out at around €6,480 per square metre of buildable area, which was an enormous sum especially when one considered that Fortina already owned the land in question.\nMoreover, 85% of the plot would still be occupied by a newly refurbished 5-star hotel and associated amenities.\n“The biggest travesty is that the plot was not offered by tender, when we have fully owned the land since the 1990s. It’s truly a shame that such a major investment on our part is being portrayed in a negative manner,” Fortina said.", "comment_count": 66, "id": 3769}, {"keywords": "Health, Climate", "author": "", "article_body": "President George Vella has had a meeting in London with Commonwealth Secretary-General Baroness Scotland.\nShe suggested that he should head the new Commonwealth Centre of Excellence for small countries. \nThe centre, being set up in Malta, will serve as a focal point for assistance to 31 Commonwealth small states and jurisdictions.\nIt is an initiative between Malta and the Commonwealth Secretariat. Malta will be contributing €100,000 to it as seed capital.\nDr Vella said he will consider the offer and consult the prime minister about it, the Office of the President said.\nRelations between Malta and the Commonwealth as well as issues such as sustainable development, migration and climate change were discussed during the meeting, with Baroness Scotland praising Malta for the way it had hosted Commonwealth Heads of Government Meetings. \nPresident and Mrs Vella are also visiting Maltese patients in London hospitals. ", "comment_count": 0, "id": 3770}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers.\nTimes of Malta reports that the owners of Sliema’s Fortina Hotel are about to have restrictions on former public land lifted by the government, allowing them to build shops and apartments potentially worth tens of millions on land currently reserved exclusively for tourism.\nThe newspaper also features a petition for classroom air conditioners as heat soars. \nThe Malta Independent observes that the prime minister has now said that Neville Gafa' works as a coordinator in the Office of the Prime Minister. He had previously said he works for the government but does not know where. Mr Gafa' has raised controversy through his involvement in Malta delegations in Libya.\nl-orizzont says the government is planning a footbridge linking Mcast, Corradino and Paola.  The newspaper also reports how a Down's Syndrome girl has excelled in a modelling contest. \nIn-Nazzjon quotes PN leader Adrian Delia appealing to the government to send a 'positive signal' of the separation of duties in the Attorney General's Office.\nThe newspaper also reports how the government surplus turned to a deficit in the first quarter of the year. ", "comment_count": 0, "id": 3771}, {"keywords": "Accident, Police, Żejtun", "author": "", "article_body": "Updated Tuesday 7.52am\nA three-year-old girl and a woman thought to be her mother, were seriously injured in a car crash in Triq Anton Buttigieg, Żejtun, on Monday evening.\nThe police said the crash involved a Toyota Hilux driven by a 22-year-old man from Marsaskala and a Toyota Aygo driven by a 36-year-old man.\nThe woman, 37, and the girl were in the Aygo, as well as another girl, 10. All are from Poland. The driver and the 10-year-old were unhurt.\nRescuers from the Civil Protection Department were called on the scene to help extract the injured from the vehicles. \nA magisterial inquiry is underway.\nTriq Anton Buttigieg has gained a notorious reputation for traffic accidents, with one of the most serious having taken place in August 2009 when a mother, father and their three-year-old girl lost their life.\n ", "comment_count": 0, "id": 3772}, {"keywords": "Construction, Properties, Parliament", "author": "Luke Scicluna", "article_body": "Although the Opposition will be voting in favour of a new Bill to regulate the rental sector, various Opposition MPs criticised the “short-term vision” of the new regulations and argued that the government was not going far enough.\nOpposition MP Edwin Vassallo said that instead of reducing uncertainty the Bill had embedded the current “chaos” into law.\nMr Vassallo said “extraordinary measures” were the only possible response for the “extraordinary rises” in rental prices.\nThe Bill currently before the House was drawn up in haste as the government reacted to the possibility of a “potential macrofinancial imbalance”, he added. He quoted liberally from an EU report, particularly the part which referred to an imbalance resulting from the rapid pace at which development permits were being issued as part of the government’s strategy for economic growth.\nHowever, government MP Robert Abela questioned why Mr Vassallo had criticised the increase in the number of development permits when this was what would lead to lower prices. It was easy to take such “populist” tack, Dr Abela said.\nHe explained that the Bill seeks a balance between those who wished to maximise the income from property which they owned and sought to rent, and the interest of lessees, avoiding the extremes of an unregulated market and price controls.\nHe pointed out that price controls would have been contested by lessors - even though they would have been allowed under European rules.\nDr Abela implored those renting out their properties to “take care” of the sector that provided their livelihoods, arguing that by raising rental prices too much they would be “shooting themselves in the foot”, in the same way as developers who had been careless on construction sites.\nOpposition MP Godfrey Farrugia drew attention to the present generation’s dependence on their parents. Many were now finding it difficult to leave the family home, Dr Farrugia said, and those who managed to find a place to rent were being forced back in order to save money. Having to rent should be a “transitory” arrangement, but the reality was that people had to rent because they could not save up the deposit needed to take out a loan.", "comment_count": 0, "id": 3773}, {"keywords": "Politics, Joseph Muscat", "author": "Jacob Borg", "article_body": "A government employee whose exact job Prime Minister Joseph Muscat claimed not to know has actually been working for the Prime Minister’s office for the past seven months.\nDr Muscat admitted in a PQ that Neville Gafà has been working for his office since January 2019.\nMr Gafà hit the headlines several years ago after facing accusations of facilitating a Libyan medical visa racket. \nWhen asked about Mr Gafà’s latest foray to Libya last month, Dr Muscat claimed not to known which ministry he works for.\n“I do not know what his contract says and I don't have it on me at the moment,” the Prime Minister had said in replies to questions by the Times of Malta.\n\nHe was employed by the Prime Minister’s office just one month after the government denied that Mr Gafà had acted as a special representative for Dr Muscat during a December Libya trip, which also featured a meeting with a warlord.\nHaithem Tajouri had been singled out in a 2016 UN Security Council report as being at the helm of one of Libya’s most powerful paramilitary groups, believed to be involved in a series of human rights violations. According to the report, Mr Tajouri set up a private detention centre, where former regime officials and sympathisers were held.\nHe extorted large sums of money from visitors and the facility was linked to several disappearances and cases of alleged torture, the UN said.\nA follow-up security report had delved into allegations of “Mafia-style extortion rackets” run by the armed groups of Tripoli, including that led by Mr Tajouri.\n \n ", "comment_count": 126, "id": 3774}, {"keywords": "Politics, Parliament, Government", "author": "", "article_body": "The head of the civil service, Mario Cutajar, has been asked to coordinate an analysis of a report which criticised the appointment of backbench MPs.\nThe Commissioner for Standards in Public Life, George Hyzler, said this weekend that the practice of giving government jobs and consultancies to backbench MPs is “fundamentally wrong” and should end.\nDr Hyzler concluded that the practice dilutes Parliament’s role of scrutinising the government and goes against the Code of Ethics of Public Employees and Board Members and the underlying principles of the Constitution.\nRELATED STORIESGovernment jobs for MPs 'fundamentally wrong' - Standards Commissioner\nThe Office of the Prime Minister said that the analysis would look at both legal and administrative implications and that, once complete, it would be made public.", "comment_count": 0, "id": 3775}, {"keywords": "Accident, Police, Mosta", "author": "", "article_body": "A one-year-old girl hurt in a crash on Sunday night was only slightly injured, the police said in an update on Monday.\nThe collision, on Triq Ta' Żejfa in Mosta at 7.10pm, resulted in five people being hospitalised: a 34-year-old woman who was a passenger in a Toyota Rav 4, a 31-year-old woman who was driving a Toyota Yaris, and three children. \nThe children included a four-month-old baby from the Rav 4 and a five-year-old boy in the Yaris, as well as the one-year-old girl who was also in the Yaris. The boy was the only one whose injuries were described by the police as serious.\nThe driver of the Rav 4 - a 33-year-old man - was not injured.\nPolice investigations are still under way.\n ", "comment_count": 0, "id": 3776}, {"keywords": "Construction, Swieqi", "author": "", "article_body": "Police were called out to a residential parking garage in Swieqi on Monday over structural concerns.An area of the car park for the Forum Residences on St Andrews Road, which shares a building with Green’s Supermarket, was cordoned off. Cracks were visible in part of the ceiling and a support jack is in place.\nThe area cordoned off is not normally used by customers at the supermarket. \nPolice cordoned off an area of a car park at the Forum Residences on St Andrews Road, which shares a building with Green’s Supermarket\nA police spokesman confirmed that officers were on site but could not provide any further information, including on the nature of any danger. Efforts to contact the site owner, J Portelli Projects, were unsuccessful, with an employee saying nobody was available to comment.\nConcerns over structural issues have increased in recent weeks after a string of building collapses, which prompted the government to speed through a sweeping reform of construction regulations. ", "comment_count": 4, "id": 3777}, {"keywords": "Court, Politics, Civil society", "author": "Edwina Brincat", "article_body": "An NGO has urged the Chief Justice to abstain from a case in which it is contesting a decision to appoint new members to the bench. \nCivil society group Repubblika is arguing that it would be \"judicial schizophrenia\" for the Chief Justice to preside over the appeal, given that the country's top judge is also responsible for making recommendations about potential judges and magistrates to the Prime Minister. \nThe NGO is keen to nullify judicial appointments until the government implements recommendations by the Venice Commission on the rule of law, with Repubblika saying that no new members should have been added to the bench until a revised system of appointments is in place.\nRELATED STORIES Judicial appointments: ECJ referral request to be decided later, court rulesCourt asked to stop judicial appointments\nRoad to the appeal\nIn a judgment handed down in May, the First Hall, Civil Court in its constitutional jurisdiction had declared that Repubblika did not have juridical interest in the issue under Maltese law, but postponed a decision about a reference to the European Court, saying it would rule on that matter at a later stage.\nMeanwhile, the Court had upheld both parties’ request to appeal, declaring that such a “sensitive” issue merited direction from a superior Court, namely the Constitutional Court.\nWhy the legal challenge to the Chief Justice?\nOn Monday afternoon, Repubblika’s lawyers – Jason Azzopardi and Simon Busuttil – put forward a legal move that lent an unexpected twist to the proceedings.\n“Before we start, I wish to address your honour. Will you abstain?” asked Dr Azzopardi, directing his question at Chief Justice Joseph Azzopardi.\n“Frankly I don’t see any reason for this,” came the reply, “Unless of course you explain further.”\nStarting off by stressing that the challenge in no way stemmed from any doubt about the Chief Justice's integrity, Dr Azzopardi went on to explain that in terms of the Constitution it was the Chief Justice who made recommendations to the Prime Minister about the suitability of prospective candidates to the bench.\nNot only did the Chief Justice evaluate candidates, but it was also his sole prerogative to assign duties to newly appointed Magistrates and Judges, Dr Azzopardi continued.\nRefuting the challenge would give rise to “judicial schizophrenia,” since the Chief Justice had, on the one hand, recommended the appointments and assigned duties to the appointees, while on the other hand, he was now being asked to nullify those appointments, Dr Azzopardi argued.\nThe Chief Justice had already expressed himself on the issue by assigning duties to the three newly appointed magistrates and judges, in spite of Repubblika’s call for an interim measure by means of a judicial protest and subsequently by a court case instituted “hours before” the judicial members were sworn in, Dr Azzopardi continued.\nFour reasons given\nThe grounds for the challenge were fourfold, said Dr Azzopardi. No-one should be a judge in one’s own cause (nemo iudex in causa propria). Secondly, judges’ code of ethics contemplated abstention in case of “a manifest danger or prejudice to fair hearing.” Thirdly, the Constitution declared that every party had a right to appear before an impartial judge. Furthermore, even if there were no statutory grounds for abstaining, there have been cases where a judge or magistrate abstained since “justice must not only be done but must be seen to be done.”\nAttorney General Peter Grech rebutted these arguments since “the reasons given were not relevant to the case.”\nJudicial appointments were effected through the intervention of the Prime Minister, Dr Grech said, pointing out that the Chief Justice only made recommendations as to the suitability or otherwise of prospective candidates.\nWhen assigning duties, the Chief Justice did not impinge upon the merits of the case and did not in any way express himself thereupon, said Dr Grech, stressing that there was no issue which could “legitimately” be raised under the sole dispositions regulating such challenge.\nAfter hearing arguments by both parties, Chief Justice Azzopardi, flanked by Mr Justices Giannino Caruana Demajo and Noel Cuschieri, adjourned the case to next week for a decision on the challenge.\nShould the challenge be rejected, the Court, as currently composed, would proceed to hear the appeal.\nDeputy AG Victoria Buttigieg also assisted the respondents.", "comment_count": 1, "id": 3778}, {"keywords": "Construction, Gżira", "author": "Philip Leone Ganado", "article_body": "The Gżira local council stepped in on Monday to clear a road closed by construction works without a permit after a resident's viral post about the regular breach of the law – and the rigmarole of finding an authority that could take action.Gżira resident Thomas Camilleri said, in a post that drew wide attention on Facebook group The Salott, that Triq ir-Rebħa was regularly being closed because of construction at the former Adelphi Hotel site being undertaken by Grands Property Services.Mr Camilleri said that upon finding the street blocked by a large truck on Monday he challenged workers over their permit – only to be shunted round from one entity to another. “I stopped my car behind the truck, asked to see their permit and they said that Grands take care of everything. I pointed out that they are legally obliged to display their permit on the vehicle in question,” Mr Camilleri said. “I also called Grands but was told by their employee to call later as nobody who could help me was there.”Mr Camilleri said he then called the local council, who confirmed that the company did not have a permit for the truck or to close the street, but said there was nothing they could do.\nTurning next to the Sliema police, he was told they were too busy but would send an officer down later in the day.\nHe also contacted the Occupational Health and Safety Authority (OHSA), which said it would send someone to investigate but that most of the issues raised were outside its remit. “It seems like there are a lot of different authorities and very few teeth,” Mr Camilleri told Times of Malta. Gżira mayor Conrad Borg Manché said he had spoken to the developer immediately upon becoming aware of the issue and asked him to stop the works. The mayor confirmed that the works did not have the necessary permits, particularly as no works had been authorised this week due to preparations for the upcoming festa. When contacted, Grands Property Services director Marvin Spiteri insisted the company had a permit to issue no-parking notices on the street (which was confirmed by the mayor). He said the issue had been caused by a clamped car on the street corner, which had forced the truck to block the road, and that the situation had lasted no more than 10 minutes. Turning the tables back on the authorities, he added: “What about all the people who park their cars there after we have paid for our permits? We call the police and council and they say they can’t do anything about it.”", "comment_count": 31, "id": 3779}, {"keywords": "Crime, Court, Police, Drugs", "author": "Edwina Brincat", "article_body": "A man who managed to beat his drug addiction found himself back behind bars after unpaid debts allegedly forced him back to a life of crime.\nLeslie Farrugia, a 27-year old Cospicua resident, is looking for a job but his bail was turned down, much to the dismay of his defence counsel Peter Paul Zammit, who argued to the court that the situation would only get worse if the man was not able to find work.\nThe man stands charged with stealing a Yamaha Sigma motorcycle, that was parked in Żabbar Road, Fgura, shortly after midnight on June 20.\nInvestigators allegedly zoomed in on the suspect both on the strength of CCTV footage as well as an anonymous tip-off that the bike might have been in Mr Farrugia’s possession.\nProsecuting inspector Paul Camilleri explained that the suspect had told investigators where they could find the motorcycle and had actually led them to it.\nThe man was arrested and arraigned on Monday, pleading not guilty to the aggravated theft and requesting bail.\nThe request was objected to by the prosecution in view of the fact that the man allegedly kept bad company and could easily go into hiding to escape those who chased him over unsettled dues.\nAfter hearing submissions by both parties, the Court, presided over by magistrate Rachel Montebello, turned down the request for bail, declaring that it was not convinced that the man would abide by bail conditions.", "comment_count": 0, "id": 3780}, {"keywords": "Police, Crime", "author": "Claudia Calleja", "article_body": "Burglaries increase at the beginning of summer as people go on holiday and “advertise to the world” there is nobody at home by posting photos and updates of their fantastic vacation on social media, a police inspector notes.\n“Each year, there is a spike in domestic burglaries in the beginning of summer when people go on holiday – in line with international trends. One of the biggest problems is that people advertise on social media that they’re heading out. They tell the world via Facebook there is no one home… If you really want to share photos of your holiday, do so on your return,” police inspector Fabian Fleri, from the Violent Crime Unit within the Criminal Investigation Department, advises.\nThe prevailing pattern has led the police from EU countries to launch an awareness campaign aimed at preventing domestic burglaries in the beginning of summer. Malta is one of the members of the European Crime Prevention Network (EUCPN).\nThis year, the Malta police force, along with other law enforcement agencies in Belgium, Bulgaria, the Czech Republic, Estonia, Latvia, Lithuania, Luxembourg, The Netherlands, Poland and Romania, joined forces to prevent domestic burglary in the EU through campaigns aimed at informing EU citizens on what they can do to prevent ending up being victims.\nThieves are always on the lookout for opportunities and social media platforms, like Facebook, is where they go to “shop around”. Creating a fake profile is very easy and statistics show that if you start sending out friend requests randomly, you will have a 10 to 25 per cent success rate, that is, people you don’t know giving you access to information, he says.\n“We also advise people not to share photos taken inside their home, especially if they show their belongings or valuables and give clues to where they live. Social media can generate so much information for those with bad intentions,” Mr Fleri points out.\nHe cautions people to be careful about the information they share both on social media and through word of mouth. In a recent case, he recounts, a man was burgled after he had been saying he had inherited a substantial sum of money.\nAnother thing to be aware of is not to display the packaging of expensive items when taking out the trash.\n“If you bought a large TV, cut up the box and put it in a garbage bag to avoid showcasing your most recent purchase,” he says.\nIncrease in burglaries\nTheft from residences increased by 31 cases, or five per cent, compared to 2017 – reaching 623 cases in 2018, according to the Crime Malta Observatory Annual Crime Review for 2018.\nInspector Fabian Fleri. Photo: Chris Sant Fournier\nFigures obtained from the police show that, so far this year, there have been 275 cases of theft from inside (non-vacant) residences.\nThree minutes. That’s the time it takes for a thief to break into your home, pick what he wants and head off with your valuables.\n“People think burglars dress in black spend hours rummaging through their home. It’s usually a man dressed like any other man, who just kicked in a door and headed straight to the bedroom where most people keep valuables. After that it’s usually the study or the kitchen. All it takes is a few minutes,” Mr Fleri said.\nThe good news is there are certain precautions that can be taken to minimise the risk of being burgled.\n“Your job is to make the first two to five minutes difficult for the thief. Why? Premeditated theft makes up a small percentage of burglaries. In the majority of cases, it’s about opportunity,” Mr Fleri said, adding that most thieves were Maltese who simply kicked in the door in search of gold, jewellery and cash.\nThieves no longer take mobile phones and laptops since they are traceable. And stealing large objects, like TV sets, is rare because that requires premeditation, which is also very rare.\nRELATED STORIESSleeping family locked in as burglars ransack their villaThieves coming to Malta as a working holiday\nIf burgled\nIf you arrive home and realise the front door’s lock has been tampered with, remain outside, call the police immediately and keep an eye on the door, the officer advises.\nThe thief could be inside and you might taint important evidence by going in.\nIf you are inside your home when the burglar breaks in – something which is extremely rare – it’s important to try to stay calm and give the person what he asks for.\nIf you can, try to notice details that will come in handy during the investigations, Mr Fleri said.\nBefore you go on holiday\n▪ Do not announce your vacation plans on social media before or during your holiday.\n▪ Make sure everything is in working condition: locks, bulbs, security cameras, alarms and doors.\n▪ Inform neighbours so they can keep an eye on your property and pick up your mail.\n▪ Set a timer for lights to go on and off at times you’re normally home and at night.\n▪ Make sure all windows are locked. Double lock the main door and garage door.\n▪ Set your security alarm and notify your alarm company to let them know you will be away.\n▪ Make sure your alarms, CCTV and lights are tamper-proof and well-maintained.\n▪ Keep all valuables locked up in a stationed safe. Make sure the safe is secured in place.\nAdvice to the elderly\nA quarter of the victims of home burglaries reported so far this year were elderly people, police data shows. The 275 reported domestic burglaries involved 445 victims – 120 of whom were over 60.\n“Routine is the biggest problem when it comes to the elderly,” Fabian Fleri remarks.\n“We’re always telling them to break with routine. Think about it, all a thief needs to do is sit outside the church and notice the patterns of the elderly going to Mass every day, then follow one person home to know where s/he lives and strike the next day during Mass,” he says, adding that elderly were often targeted in the beginning of the month when thieves knew they’d find their pension at home – in cash.\nHe called on people to support their elderly relatives to make use of ATMs and internet banking or, at least, accompany them when they withdrew large sums of money. PIN numbers should never be kept near a debit or credit card.\nThe elderly should also be very careful when welcoming strangers – like deliverymen and workmen – into their homes.\n“Prepare the money to pay the workman before he arrives so he doesn’t hear you count money in another room. Always ask for identification and inform a relative if you are expecting a workman or delivery. If not, don’t open the door,” Mr Fleri warns, recalling a case when thieves passed themselves off as workmen from a telecommunications company.\n“In another case, thieves knocked at the house of an elderly woman at 1am and told her the parish priest wanted to speak to her. So be careful and stop and think. Always ask for documentation and if you don’t have an intercom use the spyhole or look out the window,” he said.\n“The delivery person might not have bad intentions but he could say something over a beer with friends and you never know who’s listening. You’d be surprised at how fast the word spreads,” Mr Fleri said.", "comment_count": 25, "id": 3781}, {"keywords": "Health", "author": "Kristina Abela", "article_body": "Almost one new case of breast cancer daily signals the need for more to be done to prevent women getting this disease, according to the chairperson of Action for Breast Cancer Foundation.\nEsther Sant was reacting to the announcement by the Health Ministry that more than four of every five women treated for breast cancer in Malta survive for more than five years, which is the highest percentage in Europe. \nHowever, figures show there is almost one new cancer case a day in Malta. \n“I am extremely happy about these statistics, and I cannot but praise the ministry for their work in this regard,” Ms Sant said. \nHowever, as a breast cancer survivor herself, she is determined to build awareness on the factors that are thought to be linked to the disease.\nWhile studies aren’t conclusive, plastics, the use of microwaves, preservatives and an unhealthy lifestyle are likely causes of the cancer, she said. \n“You don’t have to turn your life upside down to improve your health,” she explained. \nSmall changes like avoiding preservatives and preparing more home-cooked food are a very good start, in her view.\nBreast cancer is the most common cancer affecting women worldwide, according to the World Cancer Research Fund, and was the second leading cause of cancer-related deaths among women in Malta in 2017. It mostly affects women aged between 50 and 69 and the screening programme currently covers women aged between 50 and 67. \nAnother positive development announced by the ministry was that it would be increasing the screening of women to every two years rather than three, in order to boost the rate of early detection. Since 2009, over 80,000 mammograms were carried out.\nMs Sant was told she had breast cancer in 2000 and since then the disease has recurred twice. \nMost women who visit the foundation have just been diagnosed and her organisation supports them through counselling and other initiatives such as giving them a free bra especially constructed for breast cancer survivors. \n“It hasn’t been plain sailing for me. This is why I want to emphasise that while I am happy about the recent statistics, we need to continue working towards lowering the rate of breast cancer diagnoses,” she said.", "comment_count": 1, "id": 3782}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A man who shattered glass panes at Mater Dei Hospital's casualty department after having been kept waiting, was taken to court on Monday and denied bail.\nTripoli-born Adnan Saed, 26 had injured his hand in Paceville and was taken to hospital in an ambulance early on Friday, the court was told. He appeared to have been drunk at the time.\nMr Saed was bleeding profusely and began to complain angrily after being told he would have to wait to be treated, prosecuting Inspector Jonathan Ransley told the court.\nThe incident might not have escalated further had some temporary measure been taken immediately to stop the blood loss, the Inspector added. \nHe said the man refusing to calm down even when two police officers intervened. He ultimately smashed his fist against a window and door pane at the reception area, shattering the glass.\nOn Monday, Mr Saed pleaded not guilty to willful damage to hospital property, threats to two police constables, uttering obscene language in public, disturbing the public peace and having been drunk in public.\n“He was literally out of his mind with the great amount of blood flowing from his wound. He hardly knew what he was doing,” defence lawyer Martha Mifsud said, requesting bail.\n“He was literally fighting for his life. He had a perfectly clean criminal record. This was an unfortunate incident,” Dr Mifsud went on.\nHowever, the prosecution objected to the request on the grounds that the accused appeared to have no fixed address, telling the police that he lived at ‘Bugibba’ while during the hearing he presented an address of a female friend at Valletta.\nMagistrate Rachel Montebello, denied bail since it was not convinced that the man did have a fixed address where he could be notified pending the proceedings.", "comment_count": 0, "id": 3783}, {"keywords": "Crime, Police, San Ġwann", "author": "", "article_body": "A man rammed a police car and damaged four other vehicles as he tried to drive away from policemen who were trying to arrest him on Monday morning.\nEyewitnesses say they heard what sounded like warning shots fired by police to stop the suspect.\nHe was wanted as part of a drug trafficking investigation. \nThe man was intercepted by officers from the Rapid Intervention Unit and the Drug Squad in San Ġwann close to Mater Dei Hospital. Some of the officers wore hoods to hide their identity.\nOfficers searched the man's car and found wrapped packets suspected to be drugs. No further information about the yield was available at the time of writing.\nThe incident happened at about 11.30am.\nNo one was injured. \n\nHooded police were seen removing this red bag from the suspect's car", "comment_count": 57, "id": 3784}, {"keywords": "Accident, Construction", "author": "Claudia Calleja", "article_body": "On June 3, 2004, Marie Diane Mulè Stagno’s mother – 60-year-old Maria Dolores Zarb – was giving a Maltese language lesson to Russian girl Nadya Vavilova, 24, in her apartment in St Paul’s Bay. The block, adjacent to a construction site, collapsed when a worker cut through the bearing concrete surface of the building, killing them both. The recent building collapses have rekindled painful memories for Diane. This is her account:\n“Hearing about the recent buildings collapsing caused a lot of inner turmoil. It’s taken me back to what happened to my mother. Amongst the feelings that reemerged there’s anger: my mother is dead. No one can bring her back. Expecting that is unrealistic. But two people died and I had been hoping things would change.\nThese years have been difficult for us on so many levels. I think about that day every single day. The fact that my mother could not see my daughter, her only grandchild, grow up – that’s very difficult. The fact that I can’t call my mother when I need advice.\nPeople say time heals – it makes you stronger but also more sensitive. Sometimes I think: What if? What if she remained alive? What if this never happened? Why did it happen?\nMy daughter Miriana was two and a half at the time. That morning she was at my mother’s house. I picked her up at 1.30pm after work. A couple of hours later, the building gave way.\nMiriana is now 17. Losing her nanna was very difficult. Unfortunately, she grew up around talk about accidents, precautions and court proceedings. So I think she grew up being very cautious.\nDiane (right) with her 17-year-old daughter Miriana, who was a toddler when her grandmother was killed\nNothing much has changed\n“So yes, these situations bring up all types of emotions. In the beginning, just after my mother’s accident, and after the court decision, there was more awareness and people were being more careful. In 2009 the owner of the plot was convicted for three years and a construction worker sentenced to 18 months for the involuntary homicide of the two women. The case was appealed.\nBut things then started going back to how they were. These last few months, things just got worse. This is what I had been afraid of. Over the last few years every time I’ve walked past a construction site I’ve felt the need to stop and look. Unfortunately, it became part of me. It’s a need I feel – to see if things have become any safer. The court had made several recommendations. They should have been implemented and enforced immediately after my mother’s judgment for everyone’s safety. What made me angry is that nothing much happened.\nMaria Dolores Zarb (left, inset) was giving a Maltese language lesson to Nadya Vavilova (right, inset) in her apartment when the building collapsed, killing them both.\nHopefully, with the new regulations, there will be change. But it’s useless having things on paper – laws and regulations not being adhered to. We need enforcement. I can’t have peace of mind knowing that laws are being ignored.\nI believe that it’s not just the architect who should be responsible. It’s the owner, the site manager, the builder, contractor and sub-contractor. Each and every role I mentioned must be clear and they should all be trained professionals in their own way. And by professionals I mean they have to be ethical and have a sense of moral values.\nStill waiting for appeal\n“The anger I have is because we are putting morality aside. I do understand that these are business people and they want to profit. But this should not come at the expense of protecting others – lives, property and possessions alike. Before these accidents there are sometimes warning signs that the residents would have flagged up. Let’s listen to one another, especially in these circumstances. My heart goes out to the victims of the recent collapses. Thankfully, no one died but they suffered great losses. They lost their homes and their memories. Like us they were living a normal life then everything changed.\nWhen these things happen the government should immediately provide psychological support to all involved. Because it is very, very, very tough. Who knows how much these people have sacrificed to own a property – then suddenly you don’t have anything. They don’t know what’s going to happen, where they’ll live. They can’t access their own belongings.\nThe government should also provide support for people to get back their possessions – not allow them to get buried under rubble or stolen. Even if they can retrieve a single photo or token – it would mean the world to them.\nMary Zarb, her brother, Fr Elias Vella, her daughter Diane, and grand-daughter Miriana\nVictims should be given a point of contact to access during nearby construction and afterwards in case of such tragedies. They need to know their rights, where to seek professional help – whether it’s legal or architectural. I think we’re lacking over there.\nWe’re still waiting for the appeal to be decided. But the outcome of the appeal is not really relevant for me. What I always wanted is that whoever was involved becomes more responsible. And peace of mind. I would not want anyone to have to go through this. It’s something which marks you for life.\nOver the last few years every time I’ve walked past a construction site I’ve felt the need to stop and look. Unfortunately, it became part of me. It’s a need I feel – to see if things have become any safer.- Marie Diane Mule Stagno\nI want to make people understand that being responsible is of the utmost importance. Residents need to be responsible by avoiding a laissez-faire attitude and seeking guidance and support. The relevant authorities need to take these matters seriously without fear or favour.\nThose in the industry need to be responsible for other people’s lives. Yes, business is important. But not to the detriment of others. I can’t accept that.”\nSupport for victims?\nVictims of construction-related accidents have been calling for more support when such tragedies occur. Some people who lost their homes during the three recent incidents even suggested having a point of contact to guide them on the way forward and inform them about their rights. \nThey spoke about the need for psychological support and for a system in place to safeguard their belongings from being buried or stolen from the rubble.\nTimes of Malta asked the Infrastructure Ministry if there were plans to introduce any such measures. A spokesperson for the ministry said: “Please note that the new legislation is related to building and construction only.”", "comment_count": 22, "id": 3785}, {"keywords": "Education", "author": "", "article_body": "Half of students sitting for the end of primary benchmark exams scored 69 or higher in Maltese and 72 or higher in English, according to official results. The median mark for Maths was 71.The results, published by the education ministry on Monday, show that the median mark for English has improved slightly over 2018 but remains lower than in any of the five years before that. Maltese and Maths results were equal to or lower than those registered last year, but higher than in 2017.The ministry said a total of 3,273 Year 6 students sat for the exams at the end of May, coming from 62 state schools, 20 church schools and four independent schools. In Maltese and English, candidates were assessed in speaking, listening comprehension, reading comprehension and writing. In both subjects, students fared worst at reading and writing.\n\nEnd of Primary benchmark median marks\n\n\n\n \n2016\n2017\n2018\n2019\n\n\nEnglish\n73\n76\n70\n72\n\n\nMaltese\n73\n67\n69\n69\n\n\nMaths\n78\n69\n75\n71\n\n\n\n\nMaths candidates were assessed on mental and written components. The ministry said each benchmark script was blind marked by two markers.\nResults - including the national medians for each component of the exam - were sent to schools in the first week of July and to candidates on July 5.\nThe benchmark exams, introduced in 2011, are set to be phased out within the next two years, to be replaced with what will be called 'informal college exams' or 'informal national exams'.\nThe government has said the reform will include the introduction of more informal assessment, the shift of weighting of assessment, increased use of digital technology and the introduction of different levels of assessment for students with different abilities.", "comment_count": 0, "id": 3786}, {"keywords": "Education", "author": "Ivan Martin", "article_body": "Sixth formers will be required to learn at least one foreign language and will be rewarded for taking part in drama and other co-curricular activities if a proposed reform to the post-secondary matriculation certificate system is implemented.\nThe proposed reform is open to public consultation until the end of the month and was unveiled on Monday morning by Matsec examinations board chairman Frank Ventura.\nMatsec director Dario Pirotta\nIn-school assessments\nUnder the proposals, assessment of all subjects at intermediate and advanced level would now feature an assessment by teachers which will contribute to 20 per cent of the final grade. School assessments will be marked by the school, but moderated by Matsec. This would be introduced by the academic year beginning 2020.\nTalented Athlete Scheme\nMatsec wants to encourage “promising athletes” to continue practicing their sport on a regular basis during their two-year post-secondary schooling. The reform proposes giving these students the option to practice their sport instead of one intermediate subject (10 matriculation points) from 2020.\nProf. Ventura said that these athletes would ideally have competed in national and/or international competitions to qualify. They will have to practice for at least 10 hours a week. They would have to present an annual report on their activities to a panel of experts.\nCriteria for eligibility will be set by experts from the Malta Olympic Committee and Sport Malta.\nThe reform is open for public consultation until the end of July.\nSystems of Knowledge overhaul\nThe existing Systems of Knowledge course will be restructured to better reflect “21st century skills”.\nProf. Ventura said the compulsory project will be removed and replaced by class discussions and debates.\nThe course will focus more on critical thinking, leadership and other important skills, and will be taught in both Maltese an English.\nProf. Ventura said that the course had evolved since its introduction. While students sitting through the subject often described it as “boring”, he said that those who completed it mostly acknowledged its value.\nCompulsory foreign language\nStarting in 2020, students starting their post-secondary schooling will have to choose one of four foreign languages (Spanish, French, German or Italian) at either A-level, Intermediary, or a new proficiency level which will focus on the four core language skills of reading, writing, listening, and speaking. The four areas will be given equal weighting.\nThis will be introduced by academic year beginning 2020.\nProf. Ventura said this followed a European Commission proposal for students to consolidate their European identity.\nCo-curricular activities\nThe proposed reform will see co-curricular initiatives, such as participation in on-campus drama activities, or student fora, included in students’ assessment as of 2020.\nVoluntary involvement in these activities will contribute up to 3 additional grade points as part of the Matriculation certificate. It will involve a minimum of 80 hours of participation, and be supervised by a tutor.\nThe public is invited to send their feedback through this form:\nhttps://forms.gle/1wcCho4UXd6GqEJQ6", "comment_count": 40, "id": 3787}, {"keywords": "Health, Environment", "author": "Ivan Martin", "article_body": "Products containing controversial weed killer glyphosate will be banned from public spaces as Malta continues to oppose its use.\nThe herbicide, considered a probable carcinogen by the World Health Organisation’s cancer agency, will not be allowed to be used at roundabouts, central strips, near schools or hospitals and a list of other public areas.\nA legal notice amending the sustainable use of pesticides regulations will be published in the coming days.\nThe move is an initiative of Environment Minister José Herrera, who has long made his position against the chemical public.\nThe safety of glyphosate in normal environmental conditions has been hotly disputed over the last few years.\nA report by the European Food and Safety Agency in 2015 concluded it was “unlikely” to cause cancer. However, a study published last year was the first to show a causal link between glyphosate consumption at a real-world environmental dose and a serious condition, with findings showing that the popular glyphosate-based herbicide Roundup caused liver disease in rats.\nBetween 2016 and 2017, Malta went from supporting the continued use of the controversial chemical to forming part of a group of 10 EU countries seeking a ban across the union.\nWill not be allowed to be used at roundabouts, central strips\nDespite opposition from some member states and MEPs, the product’s licence was eventually extended across the EU.\nThe government announced two years ago it was in the process of implementing a total ban on glyphosate. However, shortly afterwards it made a U-turn and said it could not implement a unilateral ban due to European single market rules.\nThe government’s insistence that Malta cannot ban glyphosate was contradicted by prominent environmentalists, who stress it is member states – and not the EU – that authorise pesticides to be placed on the market.\nRELATED STORIESMEP soul searching over glyphosate\nIn Malta, glyphosate is used in agriculture and in limited quantities by the Environmental Landscaping Consortium (ELC) which sows and maintains plants in public spaces.\nFigures published by the National Statistics Office show that the chemical is popular with farmers in the growing and cultivation of potatoes, vines, fodder, vegetables and orchard fruit.\nNGO welcomes decision\nFriends of the Earth Malta welcomed the government's decision to ban the weed killer from public areas.\n“This is a positive step since tests carried out by Friends of the Earth Malta in 2013 showed that traces of the weed killer glyphosate were found in 9 out of 10 people tested,” Martin Galea De Giovanni, director of the NGO, said.  \"This announcement shows responsibility from government’s side as it chose to listen to the concerns of experts and individuals who have demanded that our fields, streets and gardens would be free from this risky weed killer.\n\"Friends of the Earth Malta now hopes that government will take the next step and implement a total ban of glyphosate in Malta since national states have the right to decide on which pesticides can be removed from the market nationally.\"\n ", "comment_count": 18, "id": 3788}, {"keywords": "Migration", "author": "Ivan Martin", "article_body": "When Karim* escaped from Mater Dei Hospital, he ran as far as his tired legs could take him.  \nHe could not be certain that his pursuers, a pair of detention centre officials, weren’t right behind him, so he ran until the sharp pain in his side finally overcame him.\nKarim, a Tunisian national, and his family were all facing deportation from the island after their asylum request was turned down back in 2018. They had also blown the whistle on an alleged documentation racket involving a Palestinian businessman and a number of Maltese officials.\nThey had first travelled to the island six years ago, legally, fleeing the Arab Spring in Tunisia.\nAfter years of living in Malta, their position suddenly became irregular when the Libyan-Maltese company that had employed Karim’s father closed down.\nAfter being taken into custody, he and his father told officials at a dusty detention centre that they were unwell and required urgent medical assistance. \nToday, after fleeing the authorities, the two are living “somewhere” in Europe as ‘illegal’ migrants, far from the rest of their family and with little hope of leading any semblance of a normal life.\nIt is sad to think that living without documentation is someone’s only hope\nKarim and his family’s story, however, did not start there.\nThey first hit the headlines last year after The Sunday Times of Malta reported details of an alleged racket that saw migrants pay up to €10,000 to obtain documentation to live on the island. \nTheir claims had been made before the Immigration Appeals Board - a small nondescript government office which hears last-ditch appeals from those facing deportation.\nAccording to their lawyer, Leslie Cuschieri, the family scraped together every penny they could to try to come up the hefty sum of €10,000: the price, they were told, of getting an audience with the right people and their hands on the right documents to live and work in Malta.\nShortly after the claims were reported by the family, Dr Cuschieri filed a case in court on their behalf.\nThey insisted that Mustafa Abusaada, a Palestinian who lives in Malta, had offered his services to act as a go-between with authorities at Identity Malta, the Immigration Police, and even officials in the Office of the Prime Minister.\n“We were told this was our best option if we wanted to continue living here, if we wanted to give our baby girl a life in Europe,” Fadyaa* told The Sunday Times of Malta. \nThey were put in touch with Mr Abusaada after reaching out to the local Muslim community in a desperate attempt to find anyone who could help them stay in Malta. \n“Going back to Tunisia was not an option for us, we built a life here. We had nothing to go back to there and want the best for our family,” Fadyaa said. \nThe family claim to have given Mr Abusaada nearly everything they had, but when they could not come up with the full sum, they were never given their promised documents, leaving them in the lurch and with barely enough money to buy food.  Mr Abusaada vehemently denied the charges.\nLast month, their court case against Mr Abusaada was cancelled by Mr Justice Robert Mangion after the family repeatedly failed to show up in court.\nAnd while Mr Abusaada insists that this proves his innocence, Dr Cuschieri says his clients had fled for fear that they would be arrested and shipped back to Tunisia.\n“The family is split up now. Some are living here illegally, others elsewhere in Europe. They feared that if they showed up to court, they would all end up in detention, like their brother and father.\n“So, I suppose that this seemed like their only hope. It is sad to think that living without documentation is someone’s only hope,” he said. \nMr Abusaada last week contacted The Sunday Times of Malta insisting that he was no longer facing any court proceedings and had never broken any laws. He also said that he had been vindicated and his reputation unduly tarnished.\nShortly after the family’s allegations were reported, sources at Identity Malta had said that the Palestinian had been “blacklisted” for around three years. \nHe had been reported to the police after he was involved in an altercation with staff, and had been flagged for suspicious behaviour at the authority premises.    \nSources at the Visa Unit had also said that Mr Abusaada was “well known”, referring to him as “the guy in the brown suit”, adding that in the past he had been known to show up at their offices accompanying people he claimed to be representing as a “consultant”.\nHe has vehemently denied any knowledge of the being blacklisted by authority and insists he has never done anything untoward.\n*Names have been changed.", "comment_count": 0, "id": 3789}, {"keywords": "Accident, Construction", "author": "", "article_body": "The Chamber of Architects (Kamra tal-Periti) is proposing further changes to a hastily-issued legal notice on the avoidance of damage to third parties on construction sites, an extraordinary general meeting of the Chamber was told.\nThe meeting was the second in three weeks.\nThe legal notice was issued after a number of buildings collapsed into building sites as a result of excavation works.\nChamber president Simone Vella Lenicker said that a lot of progress had been made since an extraordinary general meeting held two weeks ago. The legal notice as published featured a number of changes from the original draft and addressed some of the Chamber's concerns. \nA major milestone was reached on Friday morning, when Infrastructure Minister Ian Borg and Parliamentary Secretary Chris Agius, together with the chamber and the Malta Developers Association, announced the setting up of a register of contractors, which will be followed up by the establishment of a system of licensing and classification. This announcement was in no small way due to the Kamra’s insistence that registration, licensing and classification were long overdue, and were one of the reasons why safety and quality on construction sites was often lacking.\nArchitect André Pizzuto, vice president of the Chamber, outlined the proposed system, which will be based on registers on building construction, excavation and demolition contractors. These would then be further classified on the basis of risk, as defined by European standard Euronorm 1990, namely high, medium and low risk. When undertaking a project, the architect in charge would commission or carry out a risk assessment and would indicate the type of contractors required to carry out the envisaged works.\nThe well attended meeting of the Chamber of Architects.\nThe chamber's proposals retain the figure of the Site Technical Officer introduced by legal notice in 2019, however the minimum qualifications held by such a person would depend on the risk category in which the contractor is registered.\nThe Chamber said these proposals are expected to address the current slowdown being experienced by the industry following the overly hasty introduction of the new regulations on June 25, particularly on sites where demolition and excavation works cannot proceed without the appointment of a Site Technical Officer.\nThe EGM also unanimously agreed that other issues also needed to be tackled, including the role, responsibilities and competences of the Site Technical Officer; a clear division between the Works Specifications that must be prepared by an architec, and the Method Statement which must be prepared by the contractor in order to state how the Specifications are to be implemented and achieved; a clearer distinction between temporary and permanent works; and also the removal of various inconsistencies between the Maltese and English versions of the Legal Notice.  ", "comment_count": 4, "id": 3790}, {"keywords": "Education", "author": "", "article_body": "Students are being urged to attend a ‘press briefing’ today during which details on proposed reforms that could drastically change the sixth form syllabus will be given.\nThe Matriculation and Secondary Education Certificate office recommended on Thursday that sixth form students take up a foreign language besides Maltese and English as part of a new reform.\nThe full list of proposals will be made available within the framework of a public consultation exercise in the morning.\nThe reform would enrich students’ European identity and intercultural skills, the Matsec office said.\nStudent representatives said they would attend the briefing today to raise their concerns. They encouraged other students to be there too. The meeting takes place at Matsec’s office, at the University of Malta, at 10 am.\nStudenti Demokristjani Maltin said the proposal “might be seen as a positive implementation as it will help future generations enrich their European identity and intercultural skills”. However, it insisted, students’ opinions should be given their utmost importance.\nStudents’ opinions should be given their utmost importance\n“Furthermore, we believe that for a student to enrich his/her European culture, it is not necessary for them to learn a different language, as seen in the Erasmus programme,” it added.\nStudent organisation Pulse president, Owen Grech, said they were happy to hear that voluntary work might finally be taken seriously as part of the new reforms.\n“We have already contacted Matsec with some of our concerns and were asked to be present for today’s meeting,” he said, adding the organisation would wait until after the meeting to give its full reaction to the assessment.\nBoth organisations encouraged students to be present at the meeting to air any concerns they might have.\nDiscussions to restructure the matriculation certificate examination had been ongoing for the past few years, Matsec said in a statement last week.\nThe reform also seeks to attribute greater importance and value to school assessment and offer “unprecedented support and recognition” of talented athletes, it said.\nThis year marks the 25th anniversary of the original publication of the matriculation certificate examination regulations.\n“By way of concluding these discussions, an improved and more student-centred matriculation programme is being proposed to meet the needs of 21st century learners, for whom the future holds major transformations,” it added.\nThe proposals also seek to “give merit” to students’ voluntary involvement in non-academic activities, including social engagement and enterprise. The activities can take place both during and after school hours, Matsec said.\nA University of Malta spokesman said Matsec would be giving further details during today’s press briefing.", "comment_count": 19, "id": 3791}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports about concerns over a spike in burglaries during the summer. It also says that a ban on weed killer in public areas is being imposed. \nThe Malta Independent gives prominence to a call by the CEO of the GRTU for tourists to be attracted to Ta' Qali crafts village. \nIn-Nazzjon leads with the arrival of two groups of migrants on Sunday. It also highlights the PN's call for measures to safeguard Parliament and the independence of MPs after the Commissioner of Standards hit out at the employment of backbencher MPs by the government. \nl-orizzont says 72 tickets for littering were issued in six days in St Paul's Bay in an offensive by the authorities to clean up the area. It also says that there are doubts as to whether Louis Galea can unify the Nationalist Party ", "comment_count": 0, "id": 3792}, {"keywords": "Politics, Marsa", "author": "Ivan Camilleri", "article_body": "A group of businessmen about to strike a deal with the government to take over the development and operation of the Marsa horse-racing track facilities are estimated to start raking in some €2 million a year from a commercial shopping complex and offices to be built on public land.\nThe revenue will be generated mainly through rents (in current prices) by the developers from some 12,000 square metres of space.\nWhile the government is pushing the deal through parliament, to obtain the necessary green light, horse owners and polo enthusiasts are objecting to the deal on grounds that it is just another speculation project of public land.\nAfter years of negotiations between the government’s Privatisation Unit and Marsa Race Track Limited, a draft concession agreement was presented last week to parliament to approve the deal.\nThe company, formed in 2017, is controlled by Hugh Morshead,  one of the shareholders in Henley & Partners – the company involved in Malta’s controversial cash-for-passports scheme. Maltese contractors F. Schembri Holdings, known as Tad-Dobbu, and lawyer Pio Valletta are among the minority shareholders.\nThis is pure speculation as public land is once again being given away for free\nAccording to the draft agreement, which is being questioned by the Opposition, the company will take over the entire race track from the Malta Racing Club for the next 65 years.\nApart from obligations to build a new racecourse with state-of-the-art facilities, including new spectator stands, the government is also granting the businessmen the right to use a large area of dilapidated public land in the racecourse confines and build a fully-fledged commercial complex.\nAccording to architect Valerio Schembri, who was engaged by the government to make a valuation of the public land, the company is estimating to invest €14 million to develop a nine-storey commercial complex. He estimated that some €2 million a year in rents, in current prices, will be raked in by the developers from some 12,000 square metres of space available.\nIn return, the government will receive €650,000 a year in ground rent from this area, or some €50 per square metre.\nA leading estate agent who preferred to remain anonymous said: “This is pure speculation as public land is once again being given away for free.”\n“Commercial real estate, even in Marsa, fetches much higher rates than the pitiful €50 per square metre negotiated by the government.”\nThe government has also conceded to the private businessmen another large portion of public land, currently used as a park and ride facility together with a bus terminus, to be turned into a separate 1,200-space private car park.\nThis public land did not form part of the original request for proposals and was added by government negotiators after the call closed.\nOn this land, the race track concessionaires will have to build the current bus terminus, at their expense, to be used by the public transport operator. Since the land had already been allocated to Enemalta to install a solar farm, a new agreement was reached so that the utility company can keep its rights using the roof of the commercial car park.\nWhat about horse enthusiasts?\nHorse owners claim the government has not consulted them and the deal does not benefit their interests.\n“We have been sold”, one horse owner said.\n“There should be better facilities but there are no guarantees about our future,” he said.\nWhile according to the draft agreement, the prize money – the money paid to race winners – will be increased by 10 per cent upon the signing of the concession, horse owners said no further guarantees have been given that this will continue to increase.\n They are also contesting the future of the signing fee, which has already increased in the past years. The signing fee is the charge horse owners have to pay to participate in a race.\nHorse owners also questioned the role of the Malta Racing Club – which has managed Marsa for the past 150 years.\nPolo players, who have also been using the race track for many years, claimed they had been given a “raw deal”.\nA member of the Polo Club committee said: “At first we started negotiations but then they gave us a ‘take it or leave it’ deal which leaves much to be desired. The agreement is full of ambiguous clauses and gives the private company the power to eradicate our sport whenever they feel like.”\nDuring the parliamentary committee meeting, Parliamentary Secretary Clifton Grima said the government was still open to striking an agreement with the Polo Club. However, he insisted negotiations could not derail the whole deal.\nTimeline:\nJune 2015: Government issues Request for Proposals (RFP) for privatisation of racecourse\nOctober 2015: On closure of submissions, only one offer is received from an unknown group of businessmen. Government says it will still conduct negotiations.\nMarch 2017: After a long period of negotiations and reports that the bidder wanted to change the terms of the RFP, Prime Minister Joseph Muscat announces a preliminary agreement (MOU) with Marsa Race Track Ltd. Their representative, lawyer and shareholder Pio Valletta categorically excludes any type of real estate in the deal.\nSeptember 2017: Government decides to extend MOU to continue negotiations as company reputedly makes fresh demands for real estate.\nApril 2018: Times of Malta reveals that during negotiations government conceded to allow a commercial complex as part of the deal. This was not allowed in the RFP. Government does not react.\nJune 2019: Government presents motion in parliament to approve the transfer of land and sign a concession on the race track with Marsa Race Track Limited. The concession includes the possibility of building a nine-storey commercial complex as part of the deal and to develop land which was not in the original call for proposals. Parliament is asked to approve the deal.\nMain highlights of the deal:\nTerm: 65 years\nIncludes: Race track and stands, large undeveloped area to be turned into a 9-storey commercial complex and the area of the current bus terminus to be turned into a commercial car park for 1,200 cars.\nRFP: The area of the commercial car park was not on offer in the Request for Proposals but inserted later by the government.\nEstimated cost of project: €28 million\nEstimated cost of commercial complex: €14 million\nOne-time concession payment: €200,000 for 65 years\nGround rent on track and facilities: €100,000 a year\nGround rent on Commercial Complex: €650,000 a year (€130,000 for first five years)\nBus terminus ground rent: €50,000 a year (€10,000 first five years)\nEmployees: Nine race track employees to be employed by new owners at cost of €130,000 a year", "comment_count": 66, "id": 3793}, {"keywords": "Accident, Traffic", "author": "", "article_body": "A 25-year-old motorist from Msida was arrested on Sunday evening after having allegedly failed to stop when he hit a pedestrian in Luqa.\nEyewitnesses noted the registration number of the VW Golf involved in the incident, and the motorist was stopped by police and arrested as he drove near the Junior College in Msida. He was accompanied by his girlfriend.\nThe pedestrian, a 27-year-old man from Sta Venera was hospitalised.  ", "comment_count": 1, "id": 3794}, {"keywords": "Education", "author": "", "article_body": "A commissioner’s warning of ‘ethnic gangs’ forming in schools has been branded as “careless and misinformed” by a group of 19 human rights and social justice NGOs.\nThe Education Commissioner’s analysis provided a “one-sided perspective” that ignored growing evidence based on the experiences of migrant and ethnic minority students. \nThe NGOs were responding Charles Caruana Carabez’s con­troversial report published by the Ombudsman’s office, which among others, suggested setting up a centrally-located international school where students were taught in their own language and their “particular cultures”.\nThe organisations, which in­clude three faculties of the University of Malta, Catholic Voices Malta, Integra Foundation and the Malta Emigrants’ Commission, acknowledged that the transition to multicultural classrooms had been “marked by tension and struggle” and insisted the challenges faced by educators, administrators and students could not be ignored. \nCommissioner seems to be advocating segregation\nHowever, the NGOs said it was disconcerting that the com­missioner’s evaluation ap­pears to be steeped in cultural stereotypes and hearsay that fails to capture the complexity of the context. \n“We also note that the Commissioner ignores the demonstrated strengths and benefits of the pluricultural and plurilingual classroom. We believe that a classroom environment embracing different worldviews and cultural practices, encourages students to absorb knowledge and skills necessary to navigate an increasingly globalised world.\n“Instead, the Commissioner seems to be advocating for separation and segregation.”\nThe NGOs highlighted the fact that the 2014 national policy on bullying had identified migrant and ethnic minority children as vulnerable and more susceptible to bullying, and lamented that the Commissioner had not as­sessed whether this policy was achieving its aims in safeguarding victims of bullying. \nThey also questioned why no mention had been made of the fundamental human right to education, in light of the Commissioner’s core duty to improve the educational services for all members of the community, especially the most vulnerable.\n“The undersigned non-governmental organisations therefore flag the Commissioner’s report as inappropriate. We invite the Office of the Ombudsman and the House of Representatives not to take note of his key findings and recommendations.\n“Our children deserve better. Our students deserve better.”", "comment_count": 19, "id": 3795}, {"keywords": "Accident, Buġibba, Fire", "author": "", "article_body": "A car was extensively damaged by fire in a garage in Qawra on Sunday afternoon.\nThe blaze, at Triq il-Baħħara was reported at about 3.45pm and was quickly put out by firefighters.\nTenants in overlying apartments were briefly evacuated. No one was injured.\nVideo - Holger Klemt\n\n ", "comment_count": 0, "id": 3796}, {"keywords": "Accident", "author": "", "article_body": "A young Egyptian was seriously injured in a fall on a docked trawler on Sunday.\nThe police said the 21-year-old worker fell off a ladder while working on the vessel in Dock 7 in Marsa.\nThe accident happened at about 10.15am.\nThe worker fell a height of four metres. \nThe police are investigating. ", "comment_count": 0, "id": 3797}, {"keywords": "Politics, PN, Adrian Delia", "author": "Denise Grech ", "article_body": "Nationalist Party stalwart Louis Galea has been tasked with helping to reform the PN in a time of crisis. He tells Denise Grech he will not be spending his time compiling reports.\nWhat will the reform you are leading aim to achieve? Do you believe it will heal the internal rifts within the party?\nWe will be intensifying our efforts to evolve the present-day PN into a credible electable political party once again ready to govern effectively when and if the people so mandate it.\nThe reform will address on one level a number of national issues as well as internal issues referable to the party machinery and the people who man it.  Healing is a process which takes time, care, and patience.\nIt also presumes a number of conditions. The most important of these is the ability to adopt a balanced perspective of the reality the party is experiencing. Healing demands a strong dose of goodwill, of fraternal reciprocal respect, a flexibility to consider moving to other points from which to view different assessments, judgements, potential solutions and changes. Bringing the people involved together in a different ambiance ought to be therapeutic in itself. My job is to facilitate this process.\nYour final report is due to be presented within a year. Will the party have enough time to implement the proposals effectively until the next general election?\nI will not be spending my time writing reports. I will be working hands-on with our people at the different levels of the party, from local to national levels constructing bit by bit the way forward together. The idea is to realise marked progress within 12 months. There is no guarantee we will succeed but in the meantime, I will give it my all.\nHow are the challenges faced by the party today different than the challenges faced by the party when you were general secretary?\nOn two levels. Today we are dealing with a completely different society and a different Labour Party. When the PN was then in government (1987-1996; 1998-2013) we empowered society to liberate itself and take its rightful place in Europe. This changed society rapidly and dramatically, generally for the better. The Labour Party itself under Joseph Muscat changed radically. These confront the PN with a reality which needs to be recognised.\nHow will you ensure the party will remain relevant to voters?\nA party which receives the support of 37 per cent of the electorate cannot but by definition be a most relevant party in any country. Thousands of young modern voters voted for us and are active in the party. But we need to do much more and to rethink our political stance on a variety of issues that are close to the culture and mentality of today’s society, especially the younger generation to ensure we can speak credibly and with authority on issues that impact the common good and future generations.\nRELATED STORIESOpinion - The many ironies of Louis Galea's appointmentPN veteran Louis Galea set to lead party reform process\nThere is no sense in belonging to a broad political church which allows a rainbow of opinions and ideas to coexist and then one refuses to compromise to achieve agreement on a set of common goals essential for the progress, peace and prosperity of a nation.\nIs the internal fighting within the PN caused by different personalities or different ideologies? How will you seek to bridge the divide?\nI would say there is a mix of both ingredients and of other aspects as well. For me, unity is not some kind of rigid homogenous framework. In such a scenario, a siege mentality takes over which renounces to any bridging efforts of differences.\nI believe in unity in diversity, but a diversity which needs to be harmonised through a genuine process of dialogue in order to achieve common goals for the common good.\nAs a relative outsider for the past years, where do you think the party went wrong?\nI would rather look forward than backwards.", "comment_count": 14, "id": 3798}, {"keywords": "Fire, Gżira", "author": "", "article_body": "Updated Sunday 1pm -\nFirefighters were called to Manoel Island on Saturday night after stray fireworks sparked three fires on the island.\nPhotos sent to Times of Malta revealed swathes of the northern part of the island – one of the last remaining green lungs in the densely populated north harbour area – in flames.A Civil Protection Department spokesman told Times of Malta that they had dispatched three units to the area after receiving reports of a fire at some time after 10.30pm. The fire was caused by stray fireworks, the spokesman said.\nOn Sunday, the Environment Authority said the fire did not cause major damage to the area’s vegetation. Experts noted that acacia trees that were scorched along with seasonal vegetation that does not classify as protected flora.\nThe flames broke out in three places, spread across three hectares of land. They did not cause considerable damage to the biodiversity of the site, the authority said. \nOne of the areas scorched on Manoel Island. .\nIt appears to be the second time in two days that vegetation on Manoel Island has caught fire: a Facebook post uploaded on July 4 to a local Facebook group showed a similar blaze burning on the island. \nA Facebook post uploaded on Thursday night also complained about a fire in the area.\nManoel Island is poised to be transformed by a mega-development featuring hundreds of apartments, retail outlets, a yacht marina, hotel and 80,000 square metres of parks and family areas, after authorities approved plans for the area earlier this year.\nBusy summer for firefighters\nSaturday's Manoel Island blaze caps a busy day for the CPD’s firefighting division: a fire inside an Qawra storeroom was still being put out at the time of writing, around 14 hours after it was first noticed at 9.30am. Late last month, the CPD was also involved in another large-scale outdoor firefighting operation, when a grass fire in Miżieb engulfed around a third of the northern woodland, destroying an estimated 4,600 trees.\nDo you have photos, video or information about this story which you'd like to share? Get in touch on mynews@timesofmalta.com\nFrom fireworks to fire%3A a Times of Malta reader shared these before-and-after images of the incident.A wider angle of the affected area.", "comment_count": 0, "id": 3799}, {"keywords": "Migration, Maritime", "author": "Denise Grech ", "article_body": "A group of 58 migrants was rescued by the Armed Forces of Malta on Sunday after their boat was seen to be in distress.\nThe boat was taking in water just north of the Maltese search and rescue zone. The migrants then contacted NGO Alarmphone for help, a spokesman for the NGO said.\nThe migrants were brought to Malta by an AFM patrol boat.  \nThe government said an agreement was reached whereby as a sign of recognition to the goodwill of the Maltese government, European Union member states will also take at least half of the migrants.\nPope calls for 'humanitarian corridors' for migrant rescues Meanwhile, Pope Francis on Sunday called for \"humanitarian corridors\" to help rescue migrants in response to an air strike last week that killed dozens in a Libya detention centre.\n\"The international community cannot accept such grave incidents,\" the pope said at St. Peter's square.\n\"I hope that humanitarian corridors will be organised in a concerted way for those migrants most in need.\"\nAt least 53 migrants were killed Tuesday night in the air raid on the detention centre in the Tripoli suburb of Tajoura, held by forces loyal to the UN-recognised government.\nTripoli has blamed the strike on forces loyal to Libya commander Khalifa Haftar who controls eastern Libya and who in April launched an offensive to capture the capital.\nUN agencies and humanitarian groups have repeatedly voiced concern over the plight of thousands of migrants and refugees held in detention centres near combat zones in the Libyan capital.\n ", "comment_count": 0, "id": 3800}, {"keywords": "Valletta, Accident, Traffic", "author": "", "article_body": "A horse bolted with its karozzin on Sunday morning after a bus hit its shelter near Fort St Elmo in Valletta.\nThe incident happened at about 10.30am.\nEyewitnesses said the korozzin driver was thrown off as the horse bolted. He was slightly injured.\nFour cars were damaged.\nThe frightened horse was later reined in near the fishmarket on Valletta seafront.\nPhotos: Jonathan Borg.\n\nPhoto - Jonathan Borg.", "comment_count": 35, "id": 3801}, {"keywords": "Migration, Maritime, Italy", "author": "", "article_body": "Updated Sunday 10pm\nA potential stand-off involving 65 migrants - 39 of them children - rescued by the NGO rescue ship Alan Kurdi was averted on Sunday afternoon when Malta agreed with the European Commission and Germany to take the migrants and transfer them to other EU countries.\nHalf of a group of 58 migrants rescued separately by a Maltese patrol boat in Malta's search and rescue zone on Sunday will also be moved to other countries.\nThe agreements were announced by Prime Minister Joseph Muscat and government statements.\nSome of the migrants disembarking in Malta on Sunday night. Photo: Jonathan Borg\nThe deal involving the Alan Kurdi, was welcomed by German NGO Sea Eye, which operates the ship, although it regretted that its vessel would not be allowed into harbour.\nThe ship arrived off Malta on Sunday afternoon after having been refused permission to enter Italian waters off Lampedusa.\n \nA Rome-Valletta deal?\nOn Friday, the Maltese government had said that it would take in people aboard the Alex, provided Italy took an equal number of asylum seekers currently in Malta.\nItalian news outlet La Repubblica reported that as part of that deal, Rome also wanted Maltese authorities to arrest the crew of the Alex as soon as they docked in Malta.\nA Maltese government spokesman told Times of Malta that the only agreement struck between Malta and Italy was that announced in Friday's press release.\nMalta's offer was however declined by the ship's captain, who said sailing to Malta would be too arduous given conditions aboard the Alex.\nVideo: AFP\n\"In these conditions it is impossible to face 15 hours of sailing [to Malta]. We are waiting for Italian or Maltese naval arrangements to take these people on board,\" Mediterranea's Alessandra Sciurba said on Twitter.\nShe said that while Italy had taken families and pregnant women from the small vessel, \"all non-accompanied minors remain on board, including an 11-year-old.\" \nOn Sunday the Maltese and Italian foreign ministers issued a joint statement again calling for a permanent EU mechanism to deal with migration. Thy also confirmed their 'firm will' to cooperate with each other. \nItalian Interior Minister Matteo Salvini, whose hard line against NGO ships has caused his support to soar,  on Saturday repeated his call for reform of the European Union's Dublin rules, which stipulate that asylum requests be handled by the country where they first arrive.\n\"It doesn't seem that the majority of European countries want to do it,\" said Salvini, vowing to change rules he says place an unfair burden on Italy.\n\"We want to overcome rules that don't work,\" he told journalists in Milan.\nDespite Salvini's apparent firmness about closing Italian ports to migrants, dozens of migrants and asylum-seekers continue to arrive in Italy by other means, some rescued by Italian authorities.\nInterior ministry figures showed 191 had arrived by sea over the last week.\nLibya unsafe \nA makeshift vessel carrying 86 people across the Mediterranean from Libya sank off the Tunisian coast on Wednesday, with all but three of them missing or dead. \nLibya, which has been wracked by chaos since the 2011 uprising that killed veteran dictator Muammar Gaddafi, has long been a major transit route for migrants, especially from sub-Saharan Africa, desperate to reach Europe.\nOn Tuesday night, 53 migrants were killed in an air strike on their detention centre in a Tripoli suburb.", "comment_count": 0, "id": 3802}, {"keywords": "Politics, Joseph Muscat", "author": "Ivan Martin", "article_body": "Prime Minister Joseph Muscat said on Sunday that he was “content” to still be at the helm of the Maltese government.\nSpeaking during an interview on the Labour Party’s ONE Radio, Dr Muscat said that he was looking forward to continue his work as prime minister with more energy than ever, adding that he was glad to do so.\nHis first focus, he said, was to deliver a Budget that followed in the footsteps of the previous ones delivered.\n\n“We want people to see the sort of Budget that they have got used to. And to talk about what they got in this Budget and not what was taken from them,” he said.\nThere was very little time to work on the Budget and Finance Minister Edward Scicluna was already hard at it.\nJuly and August would be heavily dedicated to finalising the next Budget, which he said would be concluded in September.\n“Although October and November sound far off, they are close on the political calendar,” he said.\nDr Muscat also weighing on speculation that he had hoped to clinch a top post in the EU during a summit of European leaders last week.\n“I won’t comment on who was and wasn’t mentioned [as potential nominees] during last week’s meeting as that is not right or ethical. What I can say is that these were productive meetings – complicated, very intensive, and in the end we came out with good names for the positions,” he said.\nDr Muscat said he had spoken on the phone with German Defence Minister Ursula Van Der Leyen, who is nominated to become the next European Commission president.\nHe said the Maltese government could work with Ms Der Leyen, and looked forward to doing so.\nShe had, during her ministerial work in Germany, been in touch with Malta on a number of occasions via her counterpart Home Affairs Minister Carmelo Abela.\nDr Muscat said Ms Der Leyen’s nomination, and that of former French Finance Minister Christine Lagarde to the helm of the European Central Bank, sent out a strong political message about gender parity in European politics.\nAside from the names being proposed, however, it was important to have a strong programme for the future of the European Union.\nAir Malta and 'realistic' requests\nDr Muscat also weighed in on the situation facing Air Malta.\nThe airline and pilots’ union are currently locked in a court dispute over industrial action ALPA ordered last week, and which the airline filed an injunction to block.\nDr Muscat said the government would only entertain “realistic” demands. It was the government’s duty, he said, not to consider requests which were out of this world.\nHe was referring to reports that pilots were after a €700,000 retirement package.\nUN report: 'Poverty still exists'\nReferring to a recent UN index that found Malta was doing well in the fight against poverty, Dr Muscat said more needed to be done.\n“On this I want to start by saying that despite all we have done, today we still have poverty in this country,” he said.\nDr Muscat said his administration had inherited a situation where poverty was increasing, and previous administration that said poverty was just a perception. “We do not see it that way, and we have worked hard to reduce poverty,” he said.\nDr Muscat said the government wanted to focus its efforts towards pensioners, single mothers, and families that were struggling to make ends meet.\n ", "comment_count": 4, "id": 3803}, {"keywords": "Adrian Delia, PN, Politics", "author": "", "article_body": "A petition expressing confidence in PN leader Adrian Delia, calling for party reform and seeking action against those within the PN who oppose Dr Delia and harm the party has been approved for discussion within the party executive.\nThe petition was signed by 536 people who said they were members of the PN general council and were calling for the council to meet. It was addressed to council president Kristy Debono along with another, identical petition, signed by 4,333 party members.\nIn a statement on Sunday, Ms Debono said that that 24 of the signatures on the councillors' petition were not valid. Six signatures were unacceptable because the signatories had not renewed their party membership and were no longer considered members.\nSeven of the signatories last paid their membership dues in 2017 and 70 last paid in 2018.\nHowever, since 429 signatures were valid the petition was being referred to the executive committee for discussion.\nThe petition, and that by the members, countered another petition presented earlier, which called for a confidence vote in Dr Delia. That petition was discussed by the executive council last Thursday \nDr Delia subsequently announced that a vote on his leadership would be taken in the General Council on July 27, but was non-committal about resigning if the result was not in his favour.\n“The decision to remove the party leader is in the hands of the paid-up members,” he told journalists following the six-hour meeting at PN headquarters.\n“This doesn’t mean all items or petitions cannot be discussed,” he added.\nDr Delia also announced he was appointing former PN general secretary Louis Galea to spearhead the party reform process. \n ", "comment_count": 4, "id": 3804}, {"keywords": "Politics, Parliament", "author": "Ivan Martin, Claire Caruana", "article_body": "Updated 11.27pm -\nThe government is studying the Standards Commissioner's report which lashed out against government jobs for MPs, but Prime Minister Joseph Muscat said on Sunday that one also needed to consider counter-arguments. \nThe Commissioner, George Hyzler, on Saturday hit out at the practice of granting government jobs to backbench MPs, saying it undermined their independence and that of parliament.\nIt also went against the Code of Ethics of Public Employees and Board Members and the underlying principles of the Constitution.\nDr Muscat, speaking in a radio interview, did not mention the counter-arguments he was referring to, but said there could be room for further study. This, he said, was a situation which had started under previous governments. \nBut in a reaction, Opposition leader Adrian Delia said it was the Labour government which, since 2013 had changed the law to enable more backbench MPs to hold government positions including consultancies and positions of trust. The PN had voted against.\nIn a statement, he also observed that the remarks by the Commissioner of Standards were similar to recommendations by the Venice Commission.  \nHe therefore appealed to the government to take actions which would safeguard  the independence of MPs and parliament itself.\nHe said the time had come for MPs to be offered the option to work full-time  while distancing themselves from conflicts of interest. \nPM urged to act\nFollowing the publication of the report, Partit Demokratiku MP Godfrey Farrugia had called for  “immediate action” to address issues it flagged.\nDr Farrugia said the report confirmed that the parliamentary system and its capability to enforce checks and balances had been weakened. So much so that the scrutiny by backbench MPs of the Executive had been “severely compromised, especially in recent years”.\nDr Farrugia said he now expected the Prime Minister not to procrastinate withthe excuse that the report is being studied, as has become common practice,since the problems were clearly highlighted by Dr Hyzler.\nOn his part, the Speaker, as chair of the Standing Committee for Standards in Public Life, should call a meeting at once to discuss and give a conclusivedirection on the matter, Dr Farrugia said.\nThe report, he went on, also confirmed “without a doubt” both the Greco reportand that by the Venice Commission, which referred to the appointment of backbenchers to paid posts with government entities and the conflict of interest of MPs.\n“Parliament’s credibility needs to be restored. This situation is unacceptablein a democracy,” he said.\nOn whether he believed the report will result in any changes being implemented,Dr Farrugia said: “God forbid if no effective and conclusive action is taken”.\n“The Commissioner was clear in his report that if the action taken does notyield the necessary results, he is ready to take up the task of remedying the situation himself,” he said.\nWhen asked whether he would be taking the matter to the Constitutional Court if no action is taken, Dr Farrugia stated that he is \"open to all possible measures being taken.\n“It is high time that we take the bull by the horns and set things right,” he said.", "comment_count": 17, "id": 3805}, {"keywords": "Banking", "author": "Jacob Borg", "article_body": "Satabank has been slapped with a record €3 million fine for widespread breaches of money laundering laws.\nThe bank has been on regulators’ radar ever since a joint inspection by the Malta Financial Services Authority and FIAU last year found extremely weak structures in place to prevent its clients from using it to launder potential proceeds of criminal activity.\nThis led regulators to come down hard on the bank, freezing all its funds and appointing EY to administer its assets. Police and financial regulators have since been combing through suspicious transactions with potential links to fuel smuggling, drug trafficking and trade with sanctioned countries.\nOne source familiar with Satabank’s operations said the bank felt hard done by the multi-million euro fine, particularly given the way Pilatus Bank had escaped any sanction by the FIAU.\nContacted about the FIAU fine, a bank representative said Satabank continues to operate under close supervision, and is focused on returning funds to customers under the controlled release procedure instructed by the MFSA.\nRELATED STORIESBillions of euros in Satabank transactions deemed 'highly suspicious'Satabank ordered not to take further deposits into customers' accounts\n“The bank is taking all appropriate action in respect of investigations by the authorities,” the bank representative said.\nSatabank poor risk management structures had already attracted a €60,500 fine from the MFSA in July 2018.\nFines levied on banks and other entities regulated by the FIAU usually show up on the unit’s website, yet in this case, the record fine imposed on Satabank is nowhere to been seen.\nRELATED STORIESSatabank clients living ‘on bread and cheese’Satabank's corporate customers being contacted for return of funds to be initiated\n‘Naming and shaming’ on the FIAU’s website is often seen within the financial industry as being an even bigger penalty than the actual fine, as it could have a knock-on effect on the fined entities’ business.\nAsked why recent FIAU fines are not showing up on online, a spokesman for the unit said changes to the law in December 2017 opened up the option of appealing fines in court.\nSince the introduction of these amendments, €4.6 million in fines imposed by the FIAU have been appealed, the spokesman said.\nA request by The Sunday Times of Malta for the list of entities that had been fined was refused by the FIAU on legal grounds due to the pending appeals.\nThe spokesman said the FIAU is currently reviewing the effectiveness of the legal framework and considering whether this may be amended to improve the overall sanctioning regime, including the publication process.\nWhen fines are appealed\nA search of civil cases filed against the anti-money laundering unit since December 2017 reveals how a bank and other financial institutions that have hit the headlines in recent years are appealing fines for money-laundering breaches.\nBank of Valletta is one of those appealing an FIAU fine.\nQuestioned about the fine, a BOV spokesman said the judicial process for appealing FIAU fines is not public in order to protect the confidentiality of its consumers.\n“The bank is therefore not in a position to make further comments in reply to your query. The bank continues to maintain a good working relationship with the FIAU and remains committed to complying with its anti-money laundering and combatting the financing of terrorism obligations.”\nAnother familiar name on the list of appellants against the FIAU is Baltimore Fiduciary, a local company investigated for its role in a money-laundering scheme.\nMaltaToday had revealed how a money-laundering probe by the police in early 2013 was placed on the back-burner once MP Beppe Fenech Adami’s name cropped up as a director of Baltimore Finance.\nPrime Minister Joseph Muscat had promptly appointed a board of inquiry to investigate the claims, and had sent the inquiry’s findings to the FIAU for further investigation.\nContacted about the FIAU fine which is being appealed by Baltimore Finance, Dr Beppe Fenech Adami said he is no longer involved in the company, having resigned as a director many years back.\n“I am not aware of the fine you mention. I am not aware of the appeal you mention. I have never been contacted or spoken to by any agency including the FIAU on any of the matters you mention. May I remind you that a public inquiry held way back in 2017 has cleared me from all allegations made against me by the Labour Party in particular,” Dr Fenech Adami said.\nAnother name on the appeal list is that of Portmann Capital Management, a Maltese company allegedly involved in money-laundering linked to Venezualan President Nicolas Maduro.\nThe Sunday Times of Malta has previously reported how the company was slapped with a €350,000 fine, which at the time, was a record for an FIAU sanction.", "comment_count": 13, "id": 3806}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's Sunday newspapers.\nThe Sunday Times of Malta reports that a record €3m fine has been imposed on Satabank for breaches of the law on money laundering. It also highlights a report by the Standards Commissioner who warned that MPs who accept government jobs could be losing their independence and undermining parliament. \nMaltaToday says casino rivals are considering action over an alleged state aid rules breach following the granting of public land to the company which operates the Dragonara casino. \nThe Malta Independent leads with comments by Louis Galea on the state of the PN and his contribution to 'save it from itself.' It also highlights the report by the Standards Commissioner.\nIl-Mument quotes Adrian Delia saying that the party over the past week showed unity, which was a good augury for reform.\nIt-Torċa says Ambjent Malta is investigating water sources in Miżieb. It also points to an increase in property prices in Cottonera, saying that according to a survey, this could be driving some people out. \nIllum says Joseph Muscat is not planning major changes to the Cabinet, except to replace Helena Dalli if she is appointed European Commissioner. ", "comment_count": 0, "id": 3807}, {"keywords": "Court, Daphne Caruana Galizia", "author": "Jacob Borg", "article_body": "Three men accused of carrying out the car bombing that killed journalist Daphne Caruana Galizia could be automatically entitled to bail in just one month’s time.\nBrothers Alfred and George Degiorgio, along with Vince Muscat, have spent the last 19 months in and out of court hearing the body of evidence accumulated against them by both local and foreign investigators.\nThe three men have pleaded not guilty to planting the car bomb that murdered the journalist and rattled the country.\nWithout an indictment, the presumption of innocence prevents any person from being held against their will for more than 20 months. \nMagistrate Claire Stafrace Zammit ruled there was sufficient evidence for a bill of indictment to be issued within three weeks of the men being charged in December 2017.\nEurope’s top human rights watchdog has raised the alarm about the narrowing time window for the Attorney General to indict the three men prior to them being automatically entitled to bail.\nA report by the Council of Europe into the murder investigation flagged how the compilation of evidence against the three men has been dragging on for a year and a half without any sign of an indictment that would see the suspects formally put on trial for the murder.\nOne source briefed on the process assured that the drafting of the indictment was well under way.\nThe source would not be drawn into specifying by when the process was expected to be completed.\nA legal expert, who preferred to remain unnamed due to the high-profile nature of the case, distinguished between the suspects’ automatic right to bail if the indictment is not filed in time, and them actually being able to roam the streets.\n“Sure, a court would automatically have to grant them bail, but it would still be able to stipulate the conditions [for that bail]. The court could easily impose financial conditions that are so restrictive that it would make it impossible for any of the three men to meet them and be able to walk the streets.\n“Technically in such a scenario they still would have been granted bail, yet they would be held in custody,” the legal expert said. Even if the indictment is filed with­in the 20-month window, there would be nothing stopping the suspects from requesting bail again, though their various attempts have been rejected.\nMs Caruana Galizia’s son Matthew said the way the case was proceeding showed how broken Malta’s criminal justice system was. He pointed to three fundamental problems: the police leading the prosecution instead of an independent criminal prosecutor; under-resourced and inefficient courts; and the Attorney General’s “massive conflict of interest”.\nOn the question of bail, he said the prosecution had taken the 20 months as their deadline, following Parkinson’s law on bureaucracy: work expands to take up the time available.", "comment_count": 36, "id": 3808}, {"keywords": "Gozo, Planning Authority", "author": "Ivan Martin", "article_body": "The owner of a Gozo restaurant in a designated ‘dark sky’ area in Dwejra is insisting that his proposed development plans will not increase light pollution.  \nThe establishment in question, Azure Window Restaurant, had applied to install a canopy on an outdoor terrace to provide a few more tables and chairs outdoors.\nAnd, although the original application had included the phrase “installation of lights”, the applicant, Godwin Cassar, told Times of Malta that this had been amended and that no new light fittings would be added.\n“All of this negative publicity has really taken a toll on me and my business,” he lamented.  \nHe insisted that an engineer’s report, submitted as part of his appeal, had concluded that not only would light pollution not be increased by the installation of a canopy, but it would actually be reduced.\nHis detractors, on the other hand, charge that the existing light fittings do not conform to the original permit for the site, and that the light was negatively impacting the site.\nNGOs crowdfund to appeal decision\nOn Friday, a coalition of NGOs fighting to save Dwejra from further lighting announced that they had raised the necessary funds to try and overturn the decision granting the restaurant an extension permit.\nIn a statement, the 15 NGOs said that following the “scandalous” decision by the Environment and Planning Review Tribunal to overturn the Planning Authority’s refusal for further development in Dwejra, the public had donated more than €3,000 for a court appeal to be filed.\nNot only does this successful fundraising campaign pave the way for the court appeal but it also sends a clear message\nThe funds were raised through crowdfunding in just two days. \nWhy are NGOs appealing the decision?\nDwejra, in Gozo, is a Natura 2000 site and is also designated a Dark Sky Heritage Area.\n“At night this place can give spectacular views of the dark sky and stars while the iconic Scopoli’s Shearwater use the cliffs as their breeding habitat,” the NGOs said, adding that light pollution and increased development would damage the area.\nAstronomers use Dwejra to observe the night sky. Photo: Physics Department and the Institute for Astronomy and Space Sciences\nBoth Birdlife Malta and the Institute of Space Sciences and Astronomy had officially objected to the development proposed and hence have the right to now appeal it in court.\n“Not only does this successful fundraising campaign pave the way for the court appeal, but it also sends a clear message that civil society is strong and a force to be reckoned with,” the group said.\n“The NGOs would like to thank the people for their support which motivates them further to fight for this cause, while promising to remain fighting to safeguard the natural and cultural heritage of our islands for the benefit of all,” they added.\nEnvironment Minister José Herrera has also indicated he disagreed with the tribunal decision and encouraged objectors to appeal “for the best interest of the environment”.\nThe 15 NGOs are Bicycle Advocacy Group; Birdlife Malta; Din l-Art Ħelwa; Flimkien għal Ambjent Aħjar; Friends of the Earth Malta; Isles of the Left; Light Pollution Awareness Group; Moviment Graffitti; Nature Trust Malta; Ramblers Association; The Archaeological Society Malta; The Astronomical Society of Malta; The Institute of Space Sciences and Astronomy. Wirt Għawdex; and Żminijietna – Leħen ix-Xellug.", "comment_count": 26, "id": 3809}, {"keywords": "Migration, Football, European Union", "author": "Kristina Abela", "article_body": "The sun setting behind the football pitch at Birżebbuġa FC casts tall moving shadows as 14 men run across the synthetic turf during their twice-weekly friendly.\nThey hail from different African countries and for some of them the beautiful game is everything – they even dream of playing professionally one day. \nFor Nurudgen Mohammed, a refugee from Ghana, it is a way of “keeping strong” and getting a good night’s sleep. “When I’m playing I forget everything,” he confides.\nMr Mohammed’s team participates in inclusion sessions taking place in football clubs around the island. It is an initiative of ‘All in – All for Football’, a project on refugee inclusion launched by the Malta Football Association earlier this year which has so far involved 400 adult and 60 child participants. \nThe project carries on from last year’s ‘Include Me and I Will Understand’, through which the MFA sought to promote the integration of refugees, locals and disadvantaged groups in society by involving them in football-related sessions as well as offering them courses in first aid, nutrition, literacy and culture. \nThe sessions are also an opportunity for the men to mingle with people outside of work. On a couple of weekends when they weren’t able to play, Maria Ellul, the coordinator of the team, invited them to the beach with some of her friends. \n“I don’t swim but Maria helped me. I was very happy because I got to speak to others,” said Mr Mohammed. “I learned a lot about Malta and saw many beautiful places.”  \nTo begin with, he was wary. “I thought maybe… you know with this racism… but they didn’t apply these kinds of things. I was happy because it seemed like we were all equal.”\nFrom backpack to volunteering\nMs Ellul became a volunteer with the MFA after returning from her travels in South America. Regularly heading to Jobsplus in search of a job, she witnessed a lot of racism and decided to do something about it. \nShe has been running these sessions for a month now, along with coach Carmel Farrugia. \nA challenge that the project has faced is mobility of its participants, says Peter Busuttil, the campaign project coordinator. Due to financial pressure and work commitments, many found it difficult to make their way to football clubs around the island. So this year the project has been given support from Transport Malta to improve accessibility. \nI like the Maltese and the country a lot… I would like it if we could do more of this\nAnother development is the introduction of football games at the Initial Reception Centre (IRC) in Marsa, where irregular migrants are detained immediately upon their arrival to Malta. \n“Two, three days ago they [the participants] were on a boat and their first impact from Maltese culture and society is with the Maltese Football Association,” says Mr Busuttil. \nThe sessions have served to bring people together to combat the divisiveness which exists within society, as evidenced in a 2017 study by Johann Caruana on racism in Maltese football. Of the 10 athletes interviewed for the study, nine called racism in Malta “something disturbing”.\nThe mother of retired professional footballer Jamie Pace MacDonald, who represented the Maltese national team, described remarks hurled at her son on the pitch as “disgusting.” She once witnessed a spectator yell at Jamie, who is of Maltese and Jamaican nationality, “to go back home” and “that he doesn’t know who his father is”. \n‘All in – All for football’ is a project funded by the EU and the Union of European Football Association (UEFA), which in recent years have launched a vigorous campaign to combat racism, discrimination and intolerance in the game. One of the requirements it has set football clubs for participating in European competitions is that they must actively tackle racism. \nIn April 2019, the Human-Rights NGO Aditus teamed up with the MFA to hold a session with football clubs on the topic of racism. Many prominent teams turned up and while they expressed deep concern about the level of racism in football, they also remarked that “it is simply a reflection of a wider sentiment present in today’s society,” according to Aditus. \nThe discussion highlighted the need for relevant stakeholders to continue tackling this issue into the future. \nIn Italy, Mr Mohammed experienced “not one, not two, not three…” incidents of racism but many.\nHowever, since he arrived in Malta six months ago things have been different and his life has changed for the better.\n“I like the Maltese and the country a lot… I would like it if we could do more of this,” he nods towards Ms Ellul and his teammates who are having a chat while they cool down. ", "comment_count": 0, "id": 3810}, {"keywords": "Qawra, Fire", "author": "", "article_body": "Updated July 7 \nA fire that broke out in a three-storey storeroom in Qawra on Saturday morning continued to rage throughout the day and into the night, with firefighters still on site 14 hours later. Police had initially said the fire had been extinguished, only to say at around 6.30pm that firefighters were still at the scene. \nA Civil Protection Department spokesman told Times of Malta that the fire was likely to keep them busy for some time yet. \n“Everything is under control, but it will take time to extinguish completely,” the spokesman said at around 7pm.“There is a large amount of highly combustible material inside the building and we are working meticulously to ensure every last spark has been extinguished”.\nNobody was injured in the incident, he added.  \nLarge plumes of smoke were still rising out of the building at 8.20pm. \nSmoke continued to rise out of the building throughout the day. Video: Desiree Dimech\nAn eyewitness described firefighters having to enter the building on Garcia de Toledo street from its roof after answering an emergency call placed at around 9.30am. Smoke emerged from both sides of the shuttered building and Civil Protection Department firefighting units quickly began working to extinguish the flames. Residents of an apartment block next door were evacuated as a precautionary measure. As the day progressed, additional fire trucks joined the effort and police squad cars were spotted at the scene. Sources said the fire is believed to have been sparked by a malfunctioning fuse box, but a CPD spokesman said it was too early to say how it had started. Magistrate Caroline Frendo Dimech is leading an inquiry into the incident.\nWere you affected by this fire or do you have information you would like to share with us? Get in touch at mynews@timesofmalta.com\nMultiple CPD units were deployed. Photos: Desiree Dimech\nSmoke can be seen rising in this video taken just after 8pm. Video: Desiree Dimech", "comment_count": 0, "id": 3811}, {"keywords": "Birkirkara, Accident", "author": "", "article_body": "A seven-year-old girl is in hospital with serious injuries after she was hit by a car on Saturday afternoon, the police said in a statement.\nThe young girl was walking on Triq FS Caruana in Birkirkara when she was hit by a Nissan March being driven by a 47-year-old Birkirkara woman.\nParamedics rushed to the scene the moment the incident was reported at 12.30pm. They took the girl to Mater Dei Hospital by ambulance, where she is now receiving treatment.\nThe police said they are investigating further.", "comment_count": 0, "id": 3812}, {"keywords": "Climate, Weather", "author": "", "article_body": "Malta is set to swelter under another heatwave in the coming days, with temperatures feeling as high as 40 degrees Celsius. \nAccording to forecasts from the Malta International Airport weather station, temperatures on Saturday will reach 34 degrees, feeling like 37 degrees, and will continue to rise to a peak on Tuesday and Wednesday of 37 degrees, feeling like 40, before starting to drop off. \nThere may not be much respite provided by the wind either: breezes of up to Force 4 on the weekend are forecast to drop off to between Force 2 and Force 3 as the weather heats up further in mid-week.\nThe UV index is forecast to be as high as 11. \nIn such conditions, health authorities typically advise the public to stay out of the sun in the hottest times of the day, and to stay cool and hydrated to avoid the risk of heat exhaustion or heatstroke. \nExtra care should be taken with children and elderly people, who are at the highest risk of suffering negative effects of the heat and sun exposure. \nEurope sweats it out\nThe expected spike in temperatures is not the first one of the summer: June saw two such heatwaves, with temperatures rising to 38 degrees over several days. \nThe early weeks of summer have been marked by extreme heat all across Europe, with all-time temperature records broken in Germany, Poland, Czechia and France, where the mercury topped out at a searing 45.9 degrees in Gallargues-le-Montueux, in the south-east. ", "comment_count": 22, "id": 3813}, {"keywords": "Adrian Delia, PN, Politics", "author": "Philip Leone Ganado", "article_body": "Nationalist Party leader Adrian Delia sought to look beyond the current challenges to his leadership on Saturday, presenting a forthcoming vote of confidence as an opportunity to unify and refresh the party.\n“My job is not to preserve Adrian Delia; it is to preserve the party,” Dr Delia said during an interview on party media. “The party cannot have a situation where the leadership is challenged every few months. The leadership must have a set term to work, just as the government has a term.”The PN held a six-hour meeting of the executive committee on Thursday night, during which Dr Delia invoked a clause in the party statute for a vote of confidence in his leadership to be taken by the general council on July 27, following a petition for the vote signed by more than 150 councillors.\nDr Delia said he was keen for the discussion to go ahead, but reiterated that the general council could not, in terms of the statute, make or reverse decisions on the appointment of the leader, who was elected by the party membership.\n“It would be pointless to have the members decide on a leader only to tell them than 1,200 people [in the general council] can scrap their decision. We’d be turning democracy on its head,” he said.\n“Let’s discuss, let’s debate; but then we have to move forward.”\n\nReferring to the appointment, during Thursday’s executive committee meeting, of party grandee and former minister Louis Galea to lead a wide-ranging reform process, Dr Delia said Dr Galea’s remit would be to meet with all organs of the party, as well as with the grassroots, the media and academia, and to report back within a year with a “mosaic of ideas and reforms that can be carried out”.\n“We want people to come back to the party and for the party to go back to the people,” Dr Delia said. “It is pointless pointing fingers at the administration, or the executive, or the council. We should all be asking: what have we done for the party?”Acknowledging that the party was currently at a “low point”, he said there were many who were silent but willing to come forward and help the party improve itself, and that the current process would give them the space to do that.", "comment_count": 26, "id": 3814}, {"keywords": "Joseph Muscat, Politics", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat should order three of his ministers to declare the origins of a quote from an unseen section of the Egrant inquiry, as failure to do so would fuel suspicions he lied under oath, NGO Repubblika insisted on Saturday.\nA magistrate this week said she was unable to force ministers Konrad Mizzi, Chris Cardona and Edward Scicluna to declare the source of a quote found in the secret Egrant report.\nThese three top government officials quoted from this report in legal filings against a request by Repubblika for an inquiry into the Vitals Global Healthcare scandal.\nThe court sternly noted how the ministers potentially having access to unpublished sections of the report could be a very serious matter.\nIt, however, conceded that the ministers had a right to remain silent, and the court could not force them to reveal where they got this information from.\nIn a statement, Repubblika highlighted how the fact that the ministers had quoted excerpts from a report that was supposed to be secret pointed to serious breaches of the law.\n“Until the ministers concerned declare the source of the quotes in question, there will be a strong suspicion that the Prime Minister lied under oath on the witness stand when he said he did not pass the Egrant report on to anyone except those people he himself had indicated – and these did not include Edward Scicluna, Konrad Mizzi and Chris Cardona”, the NGO said.\nThe NGO said Dr Muscat needs to remove this cloud of suspicion around him by immediately demanding that his ministers disclose the source of the quote.\n“Those people who breached this very confidential aspect of the criminal process need to face the appropriate consequences.\n“Otherwise, the impression that in Malta criminal law does not apply to Joseph Muscat and his cronies will continue to linger”, the NGO continued.\nRepubblika said failure to clarify where the quote came from would only lead to the logical conclusion that Dr Muscat lied under oath.\n“We do not have strong enough words to condemn this outrage and hope that the Prime Minister ascertains that he will never go so far as to lie even when giving testimony under oath”.", "comment_count": 69, "id": 3815}, {"keywords": "Tourism, Transport", "author": "", "article_body": "Updated at 6pm\nAir Malta and pilots' union ALPA continued their war of words on Saturday, with the airline accusing the union of trying to 'cover up' demands about €700,000 retirement packages and ALPA saying Air Malta was out to undermine its public standing. \nThe airline and union are currently locked in a court dispute over industrial action ALPA ordered last week, and which the airline filed an injunction to block. \nALPA insists it ordered the action following various collective agreement breaches.\nThe airline, on the other hand, says pilots went on the warpath because they want assurances that an early retirement scheme which grants pilots a €700,000 golden handshake will be guaranteed, even if the company goes bust. \nIn a court hearing on Friday - part of the ongoing industrial dispute between the pilots' union ALPA and Air Malta - union representatives said they had faced unfounded threats of disciplinary action, on one occasion after after being ordered “illegally” to fly to St Petersburg.\nBut in a statement on Saturday, Air Malta dismissed the allegations as a diversion. \n\"Air Malta affirms that this is a cover up, concocted by ALPA, after itrealised the unacceptability of its demands in the form of governmentguarantees,\" the airline said.\n\"The company received various communications from an ALPA official insisting on the government to agree on guaranteeing €700,000 to all pilots currently employed by Air Malta at retirement age or if the company becomes insolvent.\n\"This is the real issue with ALPA. The rest is only a pretext.\"\n'Shocking' - ALPA\nThe union hit back later on Saturday with a statement of its own in which accused the airline's senior management of trying to aggravate matters further.\nIt was shocking, ALPA said, that Air Malta would try to influence public opinion and paint a distorted picture of the matter when it was still before the courts. \n\"Such allegations represent yet another clear attempt at undermining the Union’s operation, as well as its standing,\" ALPA's executive committee said. \nAir Malta kept its reaction to that statement brief. \n\"Air Malta is pleased that the union is no longer demanding guarantees for a €700,000 early retirement package for every pilot from the Government of Malta,\" it said.\n\"Thus the airline looks forward to finalise discussions with the unionwhich were at a very advanced stage of conclusion\". ", "comment_count": 33, "id": 3816}, {"keywords": "Msida, Accident", "author": "", "article_body": "A 71-year old man was seriously injured in a two-storey fall early on Saturday morning, police said in a statement. According to police, the man was feeding his animals at his home in Triq il-Kunċizzjoni, Msida, at around 2am when the incident occurred.The man was taken to Mater Dei Hospital for treatment. A magisterial inquiry has been appointed and police investigations are ongoing.", "comment_count": 0, "id": 3817}, {"keywords": "Police", "author": "", "article_body": "The police have asked for the public's assistance in tracking down two men, Tuahli Abdullah, 37, and Wafi Josef, 31, both Moroccan nationals.\nNo further information has been provided. \nAnyone with information relating to the two has been asked to contact the police, which can be done anonymously, on 2122 4001 or 119.", "comment_count": 0, "id": 3818}]