[{"keywords": "", "author": "", "article_body": "Have you ever wondered whether the party you have always voted for actually embraces your own values and beliefs?\n\nA new voting advice application could give you an idea of your actual political leanings ahead of the May 25 European elections. \nTimes of Malta has teamed up with EUI to provide a free application which invites users to react to 22 statements covering a wide range of contemporary policy issues and political values in European politics. It will link them to the three parties currently represented in the Maltese parliament - Labour, the Nationalist Party and the Democratic Party.\nOther parties and independent candidates are also contesting the MEP elections. \nMost of the questions are tailored to Malta's political, economic and social realities.\nThe results show which parties stand closest to citizens’ preferences, both in their country and all across Europe.\n ", "comment_count": 49, "id": 3319}, {"keywords": "", "author": "", "article_body": "A motorcyclist was grievously injured on Thursday in a collision with a truck in Qormi.\nThe police said the accident happened in Triq il-Ħammieri at 7.20am.\nThe biker, a 22-year-old man from Qormi, was riding a Honda that crashed with an ERF truck, driven by a 32-year-old man, also from Qormi.\nThe motorcyclist was taken to Mater Dei Hospital by ambulance.\n ", "comment_count": 0, "id": 3320}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers. All lead with a report on the televised debate between Prime Minister Joseph Muscat and Opposition leader Adrian Delia.\nTimes of Malta quotes Dr Muscat admitting that the government had not been as environmentally “sensitive” as it should have been. \nThe Malta Independent says the leaders’ debate focused on central themes of the campaign.\nL-Orizzont leads with the Prime Minister’s call to the people to make their judgement on Saturday.\nIn-Nazzjon says the Prime Minister did not reply to questions on the tax wanted being sought by European socialists.\nIn another main story, Times of Malta says no new patients will be treated at the physiotherapy department at St Luke’s Hospital as union directives come into force after Steward Health Care failed to provide upgraded timelines.", "comment_count": 0, "id": 3321}, {"keywords": "", "author": "", "article_body": "The following ships are expected in Malta:\nThe CMA CGM Rio Grande from Algiers to Genoa, the CMA CGM Cassiopeia from Genoa to Beirut, the APL Minnesota from Suez Canal to La Spezia (all CMA CGM Malta Agency Ltd) today.\nThe Oued Ziz from Skikda to Tunis, the CMA CGM Alaska from Suez Canal to Valencia, the CMA CGM Racine from Genoa to Damietta (all CMA CGM Malta Agency Ltd) and the Santa Regula to Caucedo (Bianchi & Co Ltd) tomorrow.\nThe CMA CGM Nerval from Antwerp to Piraeus, the Contship Fun from Sfax to Benghazi (both CMA CGM Malta Agency Ltd), the MV Eurocargo Sicilia from Catania to Catania (SMS Shipping), the Al Hilal to Le Harve (Bianchi & Co Ltd) on Saturday.\nThe Nicola from Benghazi to Al Khums, the Hansa Rotenburg from Tripoli to Misurata, the Corona J from Bari to Skikda (all CMA CGM Malta Agency Ltd) on Sunday.\nThe MV Maria Grazia Onorato from Livorno to Catania, the MV Pauline Russ from Genoa to Catania (both SMS Shipping), the Maersk Kobe from Izmir to Valencia (Thomas Smith & Co Ltd), the MV Euroferry Olympia from Salerno to Salerno, the MV Eurocargo Malta from Genoa to Livorno (both Sullivan Maritime Ltd), the Louisa Schulte from Dekhelia to Algiers, the Lion from Benghazi to Mersin (both CMA CGM Malta Agency Ltd) on Monday.", "comment_count": 2, "id": 3322}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 2.15pm, adds statement by Żminijietna \nNo new patients will be treated at the physiotherapy department at St Luke’s Hospital as union directives come into force after Steward Health Care failed to provide upgraded timelines, Times of Malta has learnt.\nTimes of Malta is informed that, under the directives, which come into effect on Thursday, physiotherapists working at the outpatients’ department are not to see new patients while those who undergo elective orthopaedic surgery will not be seen as from next week. \nUnfixed light fittings at St Luke’s Hospital.\nThe physiotherapists will also not assist in clinics outside the St Luke’s Hospital premises while exercise classes at the amputee rehab unit will not be held.\nOnly new patients referred from the wards with fractures and those referred to the neuro rehab unit will be treated as usual.\nThe directives, which are expected to affect about 300 patients every day, come just weeks after Times of Malta reported that the department was in such a bad state that the physiotherapists were struggling to treat patients.\nSituated at St Luke’s Hospital and run by Steward Health Care, the US company that took over the 30-year government concession to manage three hospitals, the outpatient physiotherapy department is the only one of its kind on the island.\nRead: Physio equipment, service very good, Fearne claims\nThe department had not seen an upgrade in years, with physiotherapists being forced to make the best of what was available, including having to use a corridor riddled with broken tiles during sessions with patients learning to walk again, Times of Malta was told. \nThe only treadmill available in the department had been out of order for months.\nIn comments to this newspaper on Wednesday, the president of the Malta Union of Midwives and Nurses, Paul Pace, said timelines had been sought a number of times.\n“Time stood still from the day the public-private partnership (PPP) was launched, with the consequence that the physiotherapy department looks more like a museum than a modern functioning facility,” he noted.\nHe said that about 75,000 patients were treated at the department every year but the clinic lacked space and equipment to cater for the needs and challenges of a modern rehabilitation facility.\nMost services meant to be offered at the department were “pending” due to lack poor infrastructure, Mr Pace said, adding that the department was in such a run-down state that water seeped in whenever it rained. \nSources who spoke to Times of Malta on condition of anonymity said that, especially during bad storms, the department often flooded, with staff and patients shuffling around trying not to slip. Staff had often also been forced to use buckets to capture some of the water seeping in from the ceiling, the sources said.\n“With the commencement of the PPP, the whole service provided by the physiotherapy department deteriorated to a point where patients are seen in the main corridors of St Luke’s, exposed to all sorts of temperatures.\n“Most of the equipment is literally obsolete and no new additional machinery was bought, putting more strain on the clinicians. The place is debilitated in all spheres,” Mr Pace commented.\nAcknowledging that timelines outlining the promised works had yet to be provided by Steward, Mr Pace noted that while his union, through its members, had provided “alternative areas” that could be used within the department, the hospital operator still did not have “any definite plans or timelines for the refurbishment and expansion of said department”.\nBoth the physiotherapists and patients “deserve better”, he insisted.\nContacted for a reaction following the directives, a spokeswoman said Steward had been in “constant contact” with the nursing union.\nShe noted that this was the case on an ongoing basis with the view of “finding a mutually agreeable way forward”. \nŻminijietna – Voice of the Left reacts\nIn a reaction on Thursday, Żminijietna – Voice of the Left, said that the government should revise the health policy \"with regard to the PPP\". \n\"What is happening at St Luke's Hospital, managed by Steward Health Care, the American company that took over the management of the hospital for 30 years, is a confirmation that public-private partnerships are not the ideal model to improve the quality of the services provided.\"\nWith regards to working conditions, the leftist organisation Żminijietna expressed solidarity with the physiotherapy department, where workers were subject to inferior working conditions, and a work environment that lacked healthcare facilities. \nThe group valled on the government to address the issues, arguing that the health care system should remain \"under public control\". \n \n ", "comment_count": 10, "id": 3323}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat and Opposition leader Adrian Delia debated abortion, the environment, and migration, among a myriad of other issues in a final TV showdown on Wednesday ahead of the European elections.\nThe two leaders largely stuck to their respective campaign messages but Dr Muscat appeared to be more confrontational than he had been in previous debates with Dr Delia. \nModerator Mario Xuereb rang in the first round with a toughly worded question on abortion for Dr Delia.\nThe PN, Mr Xuereb said, appeared to be approaching the election as one it knew it would lose. Dr Delia was raising the spectre of abortion, but this could not be imposed by the EU, could it? And, by framing the election as a referendum on abortion, surely he had just played into the pro-choice camp’s hands, since it was an open secret he would not be winning this poll?\nReplying, Dr Delia said the PN had clear proposals for both the EP and the local council elections, giving a brief overview.\nTurning to abortion, he said the PN was adamantly “in favour of life”.\nOn the other hand, the European socialists were calling for the introduction of a “right to abortion”. The Labour Party, having endorsed this European manifesto, might tell Maltese it was pro-life, but it was also backing the introduction of this right.\nLabour, he said, was being inconsistent.\nDr Muscat retorted that the PN was waging a campaign without any sense and it had resorted to the issue of abortion because its back was against the wall.\nThe EU, he insisted, could not make Malta introduce abortion, and Dr Delia knew this.\nThe PN had “lost itself”, going from the party that had taken Malta into the EU, to the party that tried to spread fear about ‘too many foreigners’, and now that the EU would bring in abortion. \nMr Xuereb asked Dr Muscat why he had framed this weekend’s election as a choice between him and the Opposition leader.\nDr Muscat said he was in the middle of his second term as Prime Minister and it was only natural that the electorate would judge his performance. This was also Dr Delia’s first test and the electorate would be judging him, he added.\nAsked about social inequality, Dr Muscat gave a resume' of government initiatives.\nThen came a question for Dr Delia: Love it or hate it the Individual Investor Programme (passports for cash) is here, does the PN back it?\nHis answer was: “no”.  As a result of the damage done to its reputation, Malta was losing out on genuine investment opportunities that would outstrip the IIP, he said. \nDr Muscat might think the PN was counting sheep, but it certainly wouldn’t pull the wool over anyone’s eyes.\nAnd as for a ‘campaign of hate’ that some had criticised the PN on, Dr Delia said he had nothing to be ashamed of when it came to his party.\nDr Delia then raised the issue of long term planning – something he insisted the government was not doing.\nLabour was widening roads, but this will not have solved the problem of traffic, and air will be even dirtier.\nAnother question for Dr Delia concerned foreigners in Malta. Was the PN turning to the far right?\nHere too the Opposition leader responded with a quick “no”.\nThe argument, he insisted, was about the impact which a rapidly expanding population had on the country. “Sure there are more jobs today, but what do they pay?” he asked\nIt was not a matter of race. The PN had zero tolerance to racism.\n“We need to see where the issue of racism is coming from. Perhaps Joseph Muscat can tell us about pushback?” he said, adding that he had been among the lawyers to sign an anti-pushback petition.\nOn the murder of migrant Lassana Cisse, several issues needed to be looked at.  Had standards dropped in the AFM? And would the AFM or the Prime Minister say what was the mystery crime one of the two soldiers accused of the murder had already committed when he joined the army?   \nDropping in some statistics from a recent economic impact study on the road works projects, Dr Muscat asked whether Dr Delia thought the government should have left the roads with potholes to stop people from buying cars.\nHe also warned against thinking Malta could control flows of people, saying the last European party to do this had been the UK conservatives, and now they had Brexit to deal with.\nA follow-up question for Dr Muscat asked about concerns on over-development.\nHere, Dr Muscat admitted, perhaps in the clearest way to date, that the environment had been a failing for his government.\nThe government, he said, had not been as “sensitive” as it should have been. \nIn his closing remarks, Dr Delia implored voters to ask what they expected from their MEPs.\nDr Muscat on other hand asked viewers who they trusted to get things done.", "comment_count": 62, "id": 3324}, {"keywords": "", "author": "Keith Micallef", "article_body": "A Labour victory in Saturday’s European Parliament elections is being taken as a foregone conclusion by bookmakers, despite the Prime Minister insisting his party is the “underdog”.\nThis pronounced trend emerged when the Times of Malta analysed the odds given by various online betting companies of the Labour Party obtaining four out of the six seats up for grabs.\nBetting company Smarkets is giving very low returns if such outcome materialises to the point that punters would only win 2c for every €1 gambled.\nOn the other hand, should the Nationalist Party make a surprise comeback, this would spell bad news for bookmakers and would translate into winnings to the order of €23 for every €1 waged.\nBetting company Betway is offering similar odds, though, in this case, a PN victory will bring €10 in winnings.\nHowever, there is the possibility the two main parties share the spoils, each winning three seats. Still, according to betting company Yobetit, such a result – which would be a repeat of 2014, when the PN had managed to win the third seat due to the transfer of votes despite garnering 34,000 first-count preferences less than Labour – is rather unlikely. \nThe odds are 4.5, meaning that for every €1 gambled the winner would take home €4.50.\nApart from the outright winner, Yobetit is also predicting that the first candidate to be elected will be Miriam Dalli, for the Labour Party, followed by Nationalist Roberta Metsola.\nIt is an open secret that large sums of money are gambled in illegal bets during an electoral campaign. \nSources told this newspaper yesterday such ‘bookmakers’ were predicting a Labour victory by a margin equal to or even bigger than the 2017 general election.\nIn view of this, only bets of a Labour victory with a majority larger than 40,000 votes are being accepted. Nonetheless, the likely probability of such outcome means that for every €1,000 gambled, the winner would only take €500.\nPrime Minister Joseph Muscat reiterated on Sunday that this election was an uphill battle for his party.", "comment_count": 15, "id": 3325}, {"keywords": "", "author": "", "article_body": "Maltese residents are being squeezed out of the property market and the situation will not be resolved by building more social housing units, environment NGO Flimkien Għal Ambjent Aħjar has said. \nIt said the recent court decision belatedly recognised landlords' rights on pre-1995 rental property rented at below current market values would increase pressure for low-cost housing and lead to more building congestion.\n\"Besides causing great hardship, the eviction of tenants who are unable to pay higher rents, increases housing demand exponentially. It is now undeniable that homelessness is on the rise in Malta. And yet, mainly because of the total absence of property tax levied on hoarders of multiple properties, there are still too many properties being purposely left vacant by owners waiting for the 'right' offer, \" the NGO said.\n\"It is clear that the situation is now such that average Maltese residents are being squeezed out of the property market both as regards sale and rental costs. If the government fails to provide specific solutions to these two situations then it would have shown reluctance at coming out in favour of the common good, which is not the same as economic benefit,\" the NGO said. \n\"The fact remains that the authorities stubbornly refuse to relate the increasing demand for social housing to the unregulated building industry being allowed to freely continue with unabated speculation. The end result is that we have two trends pulling in opposite directions, exacerbating the present situation to a point where government may find itself forced to put ever more resources into its own housing projects, but at the expense of other badly needed spending such as education, public health, pensions, child care and roads.\"\nFAA said permits for speculative building of blocks of apartments should be accompanied by the allocation of a number of low-rent apartments in any new project.\n\"Even in the bastion of capitalism, the United States, many states oblige developers of mega-projects to offer some of their apartments at a low cost,\" it said. \nTurning to recent announcements of social housing projects, the FAA said solving the housing problems through building more units created various issues.\nThese include the take-up of open areas, increased congestion, demolition of heritage buildings, more construction waste for our over-full landfills and more pollution caused by construction, the FAA said.\nIt also suggested that the state offsets the burden placed on some landlords who may also be shouldering part of the housing provision problem, by allowing them deductions of taxes on their incomes. ", "comment_count": 4, "id": 3326}, {"keywords": "", "author": "", "article_body": "Chameleon, Malta's Eurovision entry by Michela, had climbed to third on the Spotify viral 50 chart on Wednesday, despite its disappointing placing at last week's contest.\nSpotify's viral charts track how often a song is shared. \nChameleon trailed Duncan Lawrence's Arcade and Otro Trago by Sech on the global chart. \nImproved Eurovision ranking\nThe result was the second piece of heartening news for the teenage Gozitan singer on Wednesday, who also saw her final Eurovision song ranking rise from 16th to 14th place.\nThe revised ranking, coming four days after the curtain came down on the contest, was announced by the European Broadcasting Union after it discovered an error in the computation of the jury vote in Belarus.\nThe revision did not affect the top four songs. \n\"The EBU can confirm, following standard review practices, we have discovered that due to a human error an incorrect aggregated result was used. This had no impact on the calculation of points derived from televoting across the 41 participating countries and the overall winner and Top 4 songs of the contest remain unchanged,\" the EBU said.  ", "comment_count": 6, "id": 3327}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young mother who stands accused of involvement in money-laundering, misappropriation and fraud, was granted bail on Wednesday after having been held in detention awaiting trial for the past month.\nMarianna Petropoliac, a Russian national with a Maltese passport, was arraigned on April 25 alongside her husband, Vladimir Petropoliac.\nAn application for bail had been objected to by the Attorney General, citing the absence of tangible ties to Malta, the risk of absconding, the seriousness of the alleged offences and the fact that a number of civilian witnesses were still to testify.\nHowever, Madam Justice Consuelo Scerri Herrera rejected  those objections, saying that pre-trial detention should be the exception and that the “reasonableness” of a person’s continued detention was to be assessed in each case according to its special features. \nThe judge noted that contrary to what the AG had argued, this accused was a Maltese citizen as were her parents, who owned property in Malta. Even her child has a Maltese passport, the court observed, saying that, therefore, that it was not correct to allege that the woman had no ties in Malta.\nAs for the fear of absconding, the AG had made no reference to any “real or effective reason” as to why it was held that the woman could abscond “more than any other individual facing a criminal charge.”\nThe court also rejected the objection on the grounds of this being a serious offence since it involved €150,000, “a very large sum of money” according to the AG, stating that this factor alone could not justify a long period of pre-trial detention.\nAs for the risk of tampering with evidence, “although such a risk is genuine at the outset of the detention, it may gradually diminish, or even disappear altogether,” the court said, thereby granting the woman bail against a deposit of €10,000, a personal guarantee of €10,000 and a number of other conditions.\nLawyers Stephen Tonna Lowell, Stefano Filletti and Arthur Azzopardi were defence counsel.", "comment_count": 0, "id": 3328}, {"keywords": "", "author": "", "article_body": "The new electronic vote-counting system due to be introduced this weekend for the European Parliament elections in Malta, will reduce to just three minutes a process that normally takes more than three days.\nThe parties’ projections on the majority vote is expected at around 8am, an hour after the manual vote checking starts. However, the entire process would only be just starting.\nElectoral Commissioner Louis Fsadni explained during a walk-around for the media at the Naxxar counting hall Wednesday afternoon that ballot boxes will start arriving at the counting hall soon after the voting finishes at 10pm. Boxes will be opened upon arrival and the ballot papers placed in cardboard boxes ready for the next process, which will see the individual ballot sheets scanned.\nAt 7am, the manual checking will be done in the presence of party agents behind the Perspex, where they will be taking samples to be able to extrapolate the result and come up with a projection. Each and every of the 360,000 ballot sheets will be checked for any marks that may indicate vote-buying.\nThe ballot sheets will each be given a unique number by the scanning machine so as to avoid double counting.\nOnce the scanning process is completed, the system will start the counting process, from the first preference vote to the last count. This is expected to take only a few minutes.\nOnce the counting process is over, the parties have a maximum of four hours in which to file complaints. \nREAD: Test runs of vote-counting machines still a cause for concern - Fenech Adami\nThe Electoral Commission cannot issue the official result before 11pm on Sunday, which is a deadline imposed by the European Union since voting in most EU countries will take place on Sunday till 11pm.\nChief Electoral Commissioner Joe Church said there are some 360,000 people eligible to vote in European Parliament elections, and 423,000 for local councils.\nHe said that until Tuesday evening, almost 43,000 MEP voting documents had not been collected, along with 96,600 for the council elections.\nThe votes of the local council elections will be counted in three batches on Wednesday, Thursday and Friday, starting at 2pm.\nAll set for the vote counting process", "comment_count": 6, "id": 3329}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Democratic Party has proposed “medically accelerating” unwanted pregnancies as an alternative to abortion, following confusion over a pledge seeking to enshrine the abortion ban in the Constitution.\n“Our position as a party is to support a broad interpretation to the right to life while recognising that there are rare situations that need to be addressed with respect and humanity. I am referring to medical emergencies where the life of the mother or the unborn may be at stake,” PD leader Godfrey Farrugia said.\n“There are also situations of unwanted pregnancies. We deal with these situations by offering an alternative where delivery is medically accelerated to limit the negative psychological impact on the mother,” he remarked.\nDr Farrugia, a medical doctor, said that under this proposal, the psychological state of a woman wishing to abort could be taken as a medical indicator for a pre-term delivery, allowing the child to be born as soon as it was viable and given up for adoption.\nThis alternative solution would reduce the number of women seeking abortions abroad and help prevent the “life-long regret” of many of those who opted for abortion, he added.\n'Strange and poorly thought out' \nHowever, the proposal raised eyebrows among some who questioned the safety and desirability of such an approach.\n“Induction of pregnancies [delivery] at the cusp of viability is a strange and poorly thought-out alternative to comprehensive reproductive healthcare,” Alexander Clayman, from the new lobby group Doctors for Choice, told the Times of Malta.\n“Pre-term deliveries are stressful for all parties involved and after-care [neonatal intensive care] is hugely costly both in terms of human and financial resources.\"\nDr Clayman noted that the survival rate of a fetus born at 24 weeks was only 36 per cent, and survival without disability just 22 per cent, and warned against advocating for women with unwanted pregnancies to deliver early and face such risks \"while still forcing a woman to remain pregnant until 6 months of gestation\".\nPre-term deliveries are stressful for all parties involved\n“This does not strike me as a serious, evidence-based proposal. Politicians and medical professionals have a duty to be responsible when discussing health issues and, where possible, follow the best available evidence,” he said.\nPD courted controversy earlier this week after signing a pledge spearheaded by the conservative Alleanza Bidla party to bring forward constitutional amendments aimed at protecting life “from conception”. \nThe Nationalist Party and Moviment Patrijotti Maltin also signed the pledge but Labour and Alternattiva Demokratika did not.\nDr Farrugia later said his support for the pledge had been “conditional” and meant as “a commitment to engage with all sectors of society”, adding he did not see a constitutional amendment in the form proposed as possible.\nOne of the PD’s candidates for the European elections, Cami Appelgren, announced after news of the pledge broke that she was not personally in favour of the declaration, which, she insisted, had been drafted by “patriarchal fundamentalists”.\nDescribing herself as “pro-prevention”, she said she would work to prevent women from ever being put in a situation where they felt they needed an abortion. However, she was not in favour of blanket bans on abortions.\nPD founder Marlene Farrugia distanced herself “from the extremists and fundamentalists who came up with this senseless pledge”, which had “nothing to do with regard for human life but has everything to do with subordination of females”.", "comment_count": 56, "id": 3330}, {"keywords": "", "author": "", "article_body": "Stronger measures need to be taken against those who spread hatred, AD leader Carmel Cacopardo insisted on Wednesday, saying that the cold-blooded murder of Lassane Cisse in April was the result of the growing culture of racism.\nHe said that hatred had even been encouraged by certain politicians, with a number of incidents over the past years whose importance had unfortunately been played down.\nAcknowledging that the influx of foreigners had had a negative impact on rentals, he said this was no excuse for people to turn against “people with dark skins”.\nMr Cacopardo said the EU’s policies were based on solidarity for those who were vulnerable, adding that AD would continue to insist on appropriate levels of burden-sharing.\nHis statement comes days after two soldiers were arrested and charged with the racially-motivated murder of 42-year-old Mr Cisse. ", "comment_count": 7, "id": 3331}, {"keywords": "", "author": "Denise Grech ", "article_body": "A €20 million project that will see 13,000 square metres dedicated as a green area will be completed within three to four years, Environment Minister Jose Herrera announced on Wednesday. \nThe project will see the roofing over of a stretch of Regional Road beginning from just after the Santa Venera tunnels and leading up to Triq Misraħ il-Barrieri. The second phase of the project will see the area from the tunnels to Triq il-Blata il-Kaħla also roofed over. \nPreliminary studies into the project have been completed and development applications should be submitted by year's end. \n\"Once the project is completed, we will be joining the urban landscape and the residential area - which had been separated because of the Regional Road project - together,\" the Environment Minister added.\nA parking area accommodating around 150 cars will also be built in the area, he said. \nAir filters will also be included in the Sta Venera tunnels to mitigate the levels of vehicle emissions, Dr Herrera said.\nThe project will be undertaken by the Environment and Transport Ministry.\nPitching the project's benefits, Dr Herrera said property prices in the area would rise once the area had been greened. \n\nNoise pollution in the area is also set to decrease, he said. \nThe Environment Minister said the project could also serve as a blueprint for other areas that required greening. \nAlternattiva Demokratika had welcomed the proposal when it was first announced, however, they warned that adding a roof over Regional Road would not in itself solve problems of excessive car use. \nThe government should instead focus on a holistic strategy to reduce the number of cars on roads, it had said.  \nPart of the project will roof over the area at Triq Brighella level", "comment_count": 43, "id": 3332}, {"keywords": "", "author": "", "article_body": "The hunting lobby has urged its members not to abstain from Saturday’s European Parliament election but to vote for candidates who had shown themselves to be in favour of hunting and trapping.FKNK, the hunters’ federation, said in a statement that anyone who opted not to vote could not expect the six elected members to work in their interests. “The problems Malta's EU membership has caused, is causing and will continue to cause to the socio-cultural tradition of hunting and for Maltese and Gozitan citizens, hunters, trappers and their families will not be solved by anyone abstaining from voting,” the federation said.“Hunters and trappers should vote for those candidates who, if elected, will work to safeguard this socio-cultural tradition in Malta and Gozo.”The federation also provided a copy of the answers it received from a questionnaire sent out to all candidates, asking - among a list of six questions - about their support for turtle dove hunting and live finch trapping, both currently under renewed pressure from the EU.The document also includes a list of candidates who indicated their support for a manifesto by the European Federation for Hunting and Conservation (FACE), which includes calls for \"regional and traditional hunting methods\" to be respected under the Birds Directive. “This document shows who has always work in favour of hunters' and trappers' interests, who understandings what hunting and trapping means to them, and who is willing to help the FKNK if elected to the European Parliament,” the FKNK said.\nMEP candidates who responded to questions and signed a manifesto sent by FKNK, and who asked for a meeting with the federation.", "comment_count": 21, "id": 3333}, {"keywords": "", "author": "", "article_body": "A 17-year-old youth was the latest to be seriously injured in a string of construction site accidents over the past few weeks.\nThe police said that the man, from Qormi, fell three storeys at the site in Triq il-Ħafur, Attard.\nThe accident occurred at 10am.\nHe is currently being treated at Mater Dei Hospital while the police continue with their investigations.\nThe spate of injuries has prompted various entities to comment on about how they could be avoided, with the Kamra tal-Periti proposing an overhaul of the laws to try to improve regulation.\n ", "comment_count": 0, "id": 3334}, {"keywords": "", "author": "", "article_body": "The Interdiocesan Environment Commission (KA) has invited the Maltese MEPS elected on Saturday to ensure that all citizens, both in Malta and in all other member states of the European Union, are given the opportunity to express their views on EU-funded projects.\nLast November, on the occasion of World Town planning Day, the KA had submitted a proposal to the European Commission and to the President of the European Parliament, highlighting the need for public participation in the preparation of a Cost-Benefit Analysis for eligible projects.\nRead:'Public should have say in EU-funded projects that impact communities'\nThe president of the European Parliament, Antonio Tajani, had replied saying that the European Parliament shared the KA’s views about the importance of consultation with local communities at an early stage of projects financed by the EU.\nThe proposal was forwarded to the rapporteurs in the committee on Regional Development which was working on the regulations for the financial programme of the EU for the years 2021–2027.", "comment_count": 14, "id": 3335}, {"keywords": "", "author": "", "article_body": "Hotels are not benefitting from the increase in tourist arrivals, with the number of nights spent there by tourists down by 8.2 per cent in the first three months of the year, in spite of an increase of 4.2 per cent in the overall number of guest nights spent on the island.\nThe National Statistics Office said on Wednesday that the number of guests staying in hotels went down by 6.4 per cent, while the number of tourist arrivals for that period had increased by 2.8 per cent.\nIt was even worse on the other side of the Gozo channel. Split by regions, Malta saw a decrease of 7.9 per cent in the number of nights spent, while Gozo and Comino saw a decrease of 19.3 per cent.\nHoteliers have long been lamenting the switch by tourists to alternative accommodation like AirBnB.\nThe occupancy rate was 47.7 per cent, down by 4.9 percentage points when compared to the corresponding quarter of the previous year.\nDuring March 2019, there were 190 active collective accommodation establishments with a net capacity of 17,723 bedrooms and 40,520 bed-places.\n ", "comment_count": 105, "id": 3336}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat’s aides are telling Labour officials to go slow on a succession plan because he had to decide whether or not to step down, the Times of Malta is informed.\nThe officials were told decisions were most likely to be made according to the outcome of Saturday’s European election, sources close to the party said.\nInsiders told the Times of Malta that, apart from the Malta election results which are expected to be another personal triumph for Dr Muscat, he would be keeping a close eye on the results elsewhere in the EU and the composition of the new European Parliament.\n“It is an open secret Dr Muscat has been lobbying within EU circles for a top post. Saturday’s results Europe-wide will be crucial for him to determine his next move,” a senior Labour official said.\nSignals were sent to the Cabinet ministers and MEPs who made it obvious they were interested in succeeding Dr Muscat to take it easy, an insider said.\n“He may leave come November or, alternatively, he could also announce he will be staying on. After all, many party insiders do not want him to go,” an official said, insisting on anonymity.\nCommissioner option\nOne of the most plausible avenues Dr Muscat could be seriously exploring is his own nomination as Malta’s next member of the European Commission.\nFive years ago, when Labour in government named its first European commissioner, Dr Muscat acted quickly, using the occasion to carry out a mini-reshuffle in his Cabinet, announcing Karmenu Vella’s nomination in April 2014, months before the European election.\nObservers noted this had not happened this time round, fuelling speculation that Dr Muscat might be “keeping the option open for himself”.\nThe Office of the Prime Minister was asked why the government had not yet announced who would be nominated to sit on the European Commission and if the Prime Minister was interested in the job but no replies were forthcoming at the time of writing.\nWhen asked the same question a few days ago and what would happen after May 25, Dr Muscat only replied that “May 26 will follow May 25”.\nOther openings\nAll major EU jobs will be up for grabs this November. The European Parliament election will start the process to renew the EU institutions, culminating in a new European Commission, headed by a new president, a new EU Council president, a new European Parliament president and a new foreign policy chief.\nRead: Muscat knows an EU post is a long-shot, but he won't rule it out\nThe media is rife with speculation that Dr Muscat is mostly interested in replacing Italian Federica Mogherini as the EU’s de facto foreign minister. However, it is unlikely he would refuse the post of European Council president, currently occupied by Polish Donald Tusk, if it were offered to him.\nPolitical observers noted that Dr Muscat’s nomination to, and possible endorsement by the European Parliament of, one of these top jobs in Brussels would be his “perfect exit point” from Maltese politics.\nCrucial MEP elections\nSaturday’s elections will determine which political groupings and parties in the EU’s political sphere are most relevant.\nApart from the composition of the new Parliament, which will have a determining role in approving the next European Commission, EU leaders will most probably decide on who will take the other top jobs according to the election results.\nThe parties that fare well, and the respective heads of state and prime ministers sitting on the EU Council, will align their ambitions according to the results.\nThus, it would be crucial for Dr Muscat that the Socialists and their allies, including French President Emanuel Macron’s La République En Marche and the Liberals fare well. It will be even better if the European People’s Party gets a drubbing.\nMost likely scenario\nSo far, it seems the EPP will remain the largest party in the European Parliament, followed by the Socialists, although their numbers will be drastically chipped by populist parties and the Liberals.\nIn this scenario, the Socialists will most probably be able to secure only one of the EU top posts and this will most likely be either that of the foreign policy chief or president of the European Parliament.\nEP role\nTechnically, the European Parliament can vote against Dr Muscat’s nomination and, had it been the present Parliament, that would be the most likely scenario given the negative image both he and his government have in Brussels. However, the new Parliament could adopt a different view.\nRead: Top jobs on the line in the EU's own 'game of thrones'\nAlso, in the case of the foreign policy chief, which Dr Muscat seems to be eyeing, it is the heads of state and government who make the selection and MEPs normally ‘rubber-stamp’ the decision. The other senior posts also need the approval of MEPs.\n“This scenario will be favourable to Dr Muscat as he would have to face Parliament in a pre-determined scenario, which includes the approval of the other positions occupied by members of other political alliances,” the insiders said.\nIf he fails\nDr Muscat will know by November if he can secure a top EU job or not. If, by testing the waters, he thinks a Brussels job is possible, he would very likely take the plunge and go for it, observers say.\nIf not, he would most probably make “a major announcement” saying he had decided to stay as Prime Minister for another term “in the interests of Malta”.\nA petition launched by Labour activists for him to remain was launched recently.\nPrime minister’s chances\nEU observers in Brussels do not rule out anything at this stage. Describing Dr Muscat’s possibilities as “ambitious and remote”, they conceded it was still rather early to say.\n“Horse-trading between political alliances will take place in late summer and it will be a long, hot one for Dr Muscat if he decided to go for one of the top posts,” an observer noted.\nIf the Socialists lobby for a top position, their most probable candidates could be either Spanish Prime Minister Pedro Sanchez or his Foreign Minister, a former European Parliament president Josep Borrell.\nFrans Timmermans, the current Socialist candidate for the Commission presidency, could not be ruled out either, the observers said.\n“However, Joseph Muscat could also be the compromise candidate if the heavyweights do not agree,” they said.", "comment_count": 143, "id": 3337}, {"keywords": "", "author": "Denise Grech ", "article_body": "Democratic party MEP candidate Camilla Appelgren shut down her Facebook page after receiving death threats, PD deputy leader Timothy Alden has claimed.\nJust a few days before the European Parliament elections, Ms Appelgren shut down her social media page in the wake of controversy around an abortion pledge her party had signed.\n\"She has shown me some of the many messages she received - which are outright graphic death threats,\" Mr Alden said. \nThe messages Ms Appelgren received were not made public, but he wrote that she was told to \"watch out, threatening her family and saying she should never feel safe\".\nMs Appelgren refused to share what the threats said. \n\"At this point of time I will not disclose what the threats contained, this for the safety of my family,\" she told the Times of Malta. \"I can assure you that taking down my social media page and profile is not something I would do if I didn’t feel the urgent need for it,\" she said.\nMs Appelgren said she would be taking the appropriate action once she felt it was safe to. \nThe PD MEP candidate would be filing a police report \"once her children are safe\", the deputy leader added. \nThere was an online frenzy after Ms Appelgren wrote she was not in favour of a \"blanket ban\" on abortion. \nHer comments came after Times of Malta reported PD signed a pledge to bring forward amendments to entrench Malta's abortion ban into the Constitution. \nThe move exposed internal rifts within the party, as the officials took to social media to express their different positions on abortion. \nPD leader Godfrey Farrugia had later said he had signed the pledge \"conditionally\", in order to engage with all sectors of society. ", "comment_count": 102, "id": 3338}, {"keywords": "", "author": "", "article_body": "Updated 11.34am\nA court decision concerning contentious judicial appointments was on Wednesday depicted as a victory by both the government and a civil society group seeking to nullify the appointments. \nIn a ruling passed on Wednesday morning, a civil court found that Repubblika did not have a juridical interest in the issue under Maltese law but deferred a decision about whether the case should be referred to the European Court of Justice, reserving that decision to a later date.    Repubblika is seeking to nullify the appointment of six new members of the judiciary, saying no new members should have been added to the bench until a revised system of appointments was in place.    In a judgment handed out on Wednesday morning, Mr Justice Mark Chetcuti found that the group did not have interest under Maltese law.  As a result, its request to block the introduction of the six new judicial members could not be acceded to.\nThe court however postponed a decision about whether to refer the group's complaint to the ECJ, saying it would rule on that matter at a later stage once it heard evidence. It noted that the ECJ was hearing a case concerning similar matters against Poland. The outcome of that case would provide \"redeeming guidance\" for the court's decision, it said. Repubblika can now choose to appeal the court’s decision that it has no juridical interest in the case under local law. \nEach party will have its own interpretation... but that does not give the government the right to lie about facts. - RepubblikaThe Attorney General, on the other hand, can choose to appeal the court's rejection of other pleas in the case.   \nThe case will now proceed next week. \nBoth sides declare victory Both sides of the case quickly pounced on the judgment and declared it a victory for their respective sides. In a statement, the government said that the court had denied the group's application, signed by lawyers Simon Busuttil and Jason Azzopardi, to freeze judicial appointments.  \"The same court did not accede to a request to refer the case to European courts,\" the statement added.  \nThat claim was slammed as an outright \"lie\" by Repubblika. \n\"Each party will have its own interpretation of what the court has ruled,\" the group said. \"But that does not give the government the right to lie about facts\". The government's head of communications, Kurt Farrugia, wrote on Twitter \"reforms will continue. Political games should stay out of courts\".    \n\n\n\nIn a statement, Repubblika said that the court had \"rejected the government’s claim that Repubblika has no legal standing\" in its argument that judicial appointments should only happen once the current system was overhauled. \n\"The Court found that Repubblika was eligible to make this claim under the Charter of Fundamental Rights of the European Union that was one of three legal bases Repubblika cited to claim its right to make this complaint,\" it said. \nVenice Commission\nRepubblika's court case is based on a Council of Europe assessment that Malta's current system of appointing judges and magistrates “falls short of ensuring judicial independence”. \nThe government had chosen to appoint six new members to the bench despite that critique.\nPrime Minister Joseph Muscat had slammed Repubblika's attempts to block the process as “absurd” and argued that the Venice Commission’s recommendations were not binding.  \nThe legal tussle had been described as one of Malta’s foremost legal scholars as “the worst constitutional mess” since independence. ", "comment_count": 0, "id": 3339}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg  ", "article_body": "Updated 1pm\nFBI witnesses who flew to Malta from the US to testify in the Daphne Caruana Galizia murder case will return back home without having set foot inside a courtroom. \nThe expert witnesses were due to testify under cross-examination in Wednesday's sitting, but ended up standing in the corridors of Valletta’s law courts after defence lawyers withdrew their original request to cross-examine them.\nDefence lawyers withdrew the request two days ago, the court heard. By that point, arrangements for the FBI experts to be present in Malta for Wednesday's sitting had already been made. \nThe experts will fly back to the US on Thursday\nOne of the FBI experts arrived in Malta two days ago, with the other following on Tuesday, inspector Keith Arnaud told the court.\nDegiorgio brothers George and Alfred as well as Vincent Muscat stand accused of having blown up Ms Caruana Galizia using a car bomb that went off as she was driving away from her Bidnija home in October 2017.\nThey were arrested and charged with that crime in December of that year, and have been held in custody since then.\nEmpty-handed\nHaving crossed the Atlantic to testify in Wednesday's sitting, the FBI experts will now return to the US having done absolutely nothing at all. \nFaced with the defence's arguments, magistrate Claire Stafrace Zammit said that she could not force any party to cross examine witnesses. \nShe gave defence lawyers five days to make up their mind and decide whether they wanted to cross-examine the experts and set a new court date for June 6. \nSources told Times of Malta that the experts will fly back to the USA on Thursday, and will be flown back to Malta should defence lawyers change their mind and decide to proceed with a cross-examination. \n'Delaying tactic'\nProsecutors as well as lawyers appearing on the Caruana Galizia family’s behalf slammed their defence counsel counterparts, saying their decision to withdraw a cross-examination request was in bad faith and intended to delay proceedings.\n“This is truly embarrassing,” prosecutor Philip Galea Farrugia told the court.\nAlfred and George Degiorgio.\nInspector Arnaud insisted that the witnesses should be cross-examined on Wednesday.\n\"We're not summoning a witness from Mellieħa,\" he fumed. \nLawyer Jason Azzopardi, appearing parte civile, echoed that request and accused the defence of playing for time.\nDefence blames prosecution\nDefence lawyer William Cuschieri insisted that was not the case. \nThe FBI experts had still been in the USA when the defence had withdrawn its cross-examination request, Dr Cuschieri argued. If the experts had come over to Malta, it was the prosecution’s fault, he said.\nRather than being in bad faith, Dr Cuschieri said, the prosecution was trying to deny his client, Mr Degiorgio, the right to consult with his lawyer before the FBI witnesses were cross examined.\nHe added that the request for the FBI witnesses to testify had only been made on behalf of one of the accused – Alfred Degiorgio – and not all of them.\nVincent Muscat (left) exits court some years back.\nEarlier in the sitting, the court heard from a car rental company owner, who told the court that Alfred Degiorgio had leased a car from him in the months prior to the murder.  \nMr Degiorgio had initially leased a larger vehicle and then asked to have a smaller replacement.\nThe company owner had no documents related to that transaction, though, he told the court, because he tended to burn paperwork \"to erase data and prevent bank fraud\". \nMinute-by-minute updates\n12.58pm That concludes today's court session. Prosecutors will be fuming and the FBI experts are probably wondering if the transatlantic jet lag was worth their while, given that they did not even set foot inside the courtroom. \n12.51pm The next sitting will take place on June 6. \nThat's more than two weeks from today - which suggests the FBI experts will be heading back home, having crossed the Atlantic for nothing.\n12.48pm Will the FBI experts wait in Malta until that decision has been taken? The answer to that question remains unclear at this stage. Meanwhile, lawyers are discussing a date for the next sitting.  \n12.43pm It seems the FBI experts will not be cross examined today. The magistrate has given defence lawyers five days to state whether or not they want to cross examine the FBI experts during the compilation of evidence. \nThe court cannot force any party to effect cross examination,\" the magistrate said. \n12.35pm The court is back in session. Decree will be coming up shortly.\n12.30pm Another issue that cropped up right at the start of Wednesday's court session: who should comb through Ms Caruana Galizia's popular blog, Running Commentary, to look for threatening messages.\nEarlier this year, the court had asked judge Michael Mallia to go through the murdered journalist's WhatsApp messages, to find any threatening messages.\nOn Wednesday, defence lawyers asked the court if judge Mallia could do the same for Ms Caruana Galizia's blog. \nThat prompted lawyer Jason Azzopardi to raise an eyebrow. The blog, he noted, ran to thousands of pages and was all public. Couldn't the defence look for any threatening messages itself? \n12.20pm It's now been 18 months since the compilation of evidence against the three suspects began. \nThe court has heard from forensic experts, officers who arrested the suspects, pathologists, Ms Caruana Galizia's husband Peter and son Matthew, and countless other people - from IT experts who analysed data to landlords or garage owners who interacted with the suspects or Ms Caruana Galizia in the weeks leading up to the murder. \nInspector Arnaud had presented the prosecution's case fairly comprehensively in a three-hour testimony right at the start of the case, back in December 2017. \n12.08pm We're still waiting for the case to resume. \n12pm The legal arguments for and against FBI witnesses testifying got rather heated at one point earlier on. \n\"We're not summoning a witness from Mellieħa!\" inspector Arnaud had exclaimed. \n11.55am Some more detail about that testimony concerning Alfred Degiorgio's car rental. \nThe garage owner said Mr Degiorgio had \"definitely\" received at least one traffic contravention while leasing the car, and told the court the police had combed his house looking for paperwork related to the lease. \n\"If we didn't find it, I most likely burnt it, hux!\" he said. \n11.50am Let's catch up on some of the key events from the first part of the sitting: \n\nLawyers are arguing over whether FBI witnesses brought to Malta for today's sitting will actually be heard. The problem stems from the defence's decision to withdraw a cross-examination request two days ago - prosecutors say that's just a delaying tactic, while the defence says it just wants to ensure defendants have time to consult with their lawyer before that happens \nAlfred Degiorgio leased a car in the months before the assassination, a car rental company owner told the court. He had first leased a larger vehicle and then asked to have a smaller replacement.There's no chance of documentation, though: the owner of the garage, Paradise and Lionheart, said that he always burnt lease documents \"to erase all data and avoid possible bank fraud\".He knows for a fact, though, that the car was back in his possession by October 22, 2017, since he had rented it other people. \nAn IT expert told the court that three files concerning a completely unrelated case had mistakenly ended up in the Caruana Galizia murder inquiry file. He was given permission by magistrate Claire Stafrace Zammit to remove the files in open court. \n\n11.46am Some major technical trouble meant we weren't able to keep you updated as the first part of this court session happened - apologies for that. \nThe problems should be resolved now. \n11.40am The court session has been suspended while it decides whether or not FBI witnesses will testify today.  It should resume in around 10 minutes, we're told. ", "comment_count": 0, "id": 3340}, {"keywords": "", "author": "Keith Micallef", "article_body": "A dispute over the ownership of a plot of land earmarked for an aparthotel in Mellieħa looms as objectors claim it belongs to them and not to former magistrate Carol Peralta, who applied for a development permit.\nLocated next to the cemetery dedicated to Our Lady of Mercy, in Marfa Road, this tract of agricultural land, having a footprint of 5,500 square metres, lies at the bottom of a valley and is outside the development zone.\nDr Peralta wants to build a nine-storey, three-star aparthotel of 118 rooms, an underground parking for 38 cars and some shops.\nPublished earlier this month, the proposal attracted a barrage of objections, mostly because of its ODZ location. However, the controversy took a different twist when an objection was filed recently on behalf of six individuals who claim the land is leased to them and that Dr Peralta had no title on it.\nThe objection was filed by Saviour and Alberta Caruana, from Għargħur, Andrew Vella, Mary Vella, Christian Vella and Joseph Valletta from Mellieħa. \nThey argued that, together with their heirs, they had been in possession of the lease of the agricultural land for decades and were not aware of any other owner.\nThe granting of the permit would impinge on their property and result in the destruction of agricultural land on which their livelihood depended, the objectors said in their submission.\nThey also noted that, in 2008, they had objected to a similar application that had been later withdrawn by the applicant – Mark Gaffarena.\nMr Gaffarena subsequently made headlines in 2015 over a controversial deal involving a palazzo in Valletta, where it transpired that he had made a profit of €685,000 on the sale of half of this property to the government a few weeks after acquiring it. \nThe objectors asked the Planning Authority to “investigate” why specific information on the 2008 application had been altered so it was no longer listed on behalf of Mr Gaffarena but on Dr Peralta. \nExpressing concern that this was done to conceal the identity of the original applicant, they requested that the original file – including their previous objection – be attached to the new application.\nMeanwhile, an online petition against the proposed aparthotel, launched by the Nationalist Party Mellieħa electoral candidates, has attracted close to 2,000 signatures in a matter of weeks. \nThe PN candidates are also behind another petition against the government’s plan to sell the historic Selmun Palace.", "comment_count": 13, "id": 3341}, {"keywords": "", "author": "Denise Grech ", "article_body": "Birkirkara residents have submitted objections to a development that will see the building of an old people's home in the heart of the town. \nAccording to the Planning Authority website, the development is still at the vetting stage, awaiting the submission of additional information from the architect in charge.\n“I feel like they are trying to buy us off,” he said, adding that the project in Triq Ganu did not make sense because the road was already heavily congested.\n“This is the only open space left in the area and the impact of the project on our lifestyle will be significant, not to mention its effect on the financial value of our residences,” another resident commented in written submissions to the planning watchdog. \nThis is the last remaining fielding Birkirkara\n“This is not only my opinion but also that of the majority of the people who live in the surrounding area. This is the last remaining field in Birkirkara and it should be left as an open space.”\nHe complained that the building on the site in question was completely out of line since most houses in the area were three storeys high.\nAsked about the residents’ concerns, Tourism Minister Konrad Mizzi said Birkirkara was an ageing locality and the authorities wanted to offer elderly residents the possibility of continuing to live in their hometown.\n“It is normal that the government announces projects even when applications are still not approved,” he commented. \nOtherwise, he added, the media would be critical of projects not being announced in advance as soon as these appeared on the PA website.\nCorrection 10.29am: The article incorrectly referred to a ministerial announcement concerning a different project in Birkirkara.", "comment_count": 57, "id": 3342}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Human rights NGOs have taken issue with Prime Minister Joseph Muscat’s claim that public sentiment towards migrants was shifting in the wake of Lassana Cisse’s murder, insisting far more needs to be done.\nDr Muscat said at a campaign event in Ħamrun on Monday, after two Armed Forces of Malta soldiers were charged with the racially-motivated murder of the Ivorian migrant on April 6, he “sensed a shift in the public mood” after the attack.\n“If it were acceptable last week to tolerate people venting far-right comments on the media, it is not acceptable anymore. Jokes or perceived jokes that would have made people laugh until last week are no longer acceptable,” Dr Muscat said.\n'This didn't happen in a vacuum'\nBut speaking to the Times of Malta, Aditus director Neil Falzon said he saw no evidence of such a shift.\n“There was a widespread sentiment of shock and condemnation but, at the same time, we still have people commenting negatively about migrants and saying horrible things about the incident itself,” he said.\nHe criticised the institutional response in the immediate aftermath of the murder, including the Prime Minister’s reluctance to ascribe a racist motivation to the attack.\n\n“Like all similar incidents, this didn’t happen in a vacuum: it was the build-up of years and years of our institutions criminalising and dehumanising migrants. They have to understand that their words and actions have a trickle-down effect on every person in the country,” Dr Falzon said.\nReferring to policies of successive governments, including detention and the closing of ports to migrant rescue vessels, as well as xenophobic discourse in the current election campaign, he said: “That all has an impact on how the rest of the country treats and deals with migrants. We hope this is a wake-up call but we all need to sit down to plan what we’re going to do to deal with racism in the country.”  \nSOS Malta head Claudia Taylor-East said that, while the murder had indeed prompted an outcry and a response in the form of support for the victims – two others were injured in the shooting – and their families, it was too soon for any pronouncements on a shift in public sentiment. Lassana Cisse.\n“We need to see more action on the ground,” she said. \n“Too little has been done in terms of racial integration: much more has to be done for us to accept the reality that we are living in a multicultural society.”\nInsisting Malta’s population was not racist, Ms Taylor-East said more had to be done to support those working in the field and to tackle xenophobic discourse, including by making it easier to report and prosecute hate speech.\n“It should not take a murder for us to start talking about racism. It’s true we are a caring society; we’ve shown that in our country over and over again,” she said. \n“We need to build on the positive.”", "comment_count": 121, "id": 3343}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Wednesday's newspapers:\nThe Times of Malta sought reactions to the Prime Minister's statement that the cold-blooded murder of a migrant had affected perceptions, with most saying that nothing had changed. It also reports on a looming battle over another controversial application, this time for an aparthotel.\nMaltaToday reports MEP candidate David Stellini saying he would never vote against Malta in a resolution unless it mentioned all the other member states guilty of banking fraud and crime. It also reports on the possibility of a second referendum on Brexit.\nThe Malta Independent leads with the Council of Europe report saying that the lack of checks and balances was undermining the rule of law. It also quotes the Chamber of Architects (sic) saying that the Strategic Plan for the Environment and Development had failed.\nIn-Nazzjon reports on Opposition leader Adrian Delia's speech, in which he lamented the negative press being levelled at Malta because of the government's actions.\nL-Orizzont carries a European Commission statement that legalising abortion cannot be imposed on Malta. It also carries the speech made by Prime Minister Joseph Muscat in which he urged people to stick with him in the coming elections.\n \n ", "comment_count": 1, "id": 3344}, {"keywords": "", "author": "Ivan Martin", "article_body": "Gozo is little more than an afterthought for the government, Opposition leader Adrian Delia said on Tuesday.\nSpeaking during a political gathering in Nadur, Dr Delia said 25 years of Nationalist administrations had turned the sister isle into the envy of many.\nFor the present administration, however, Gozo was clearly not a priority.\nIn the last Budget, Gozitans had been relegated to second class citizens, given just a few lines in the entire document.\nDr Delia said he had recently been to Munxar, where projects that had been pledged by the government had still not been delivered.\nGozitans, he said, could not be expected to wait around on governments to deliver.\nDr Delia asked why the government had taken away the cargo ferry service, which had worked so well in the past, only to clog up passenger ferries with large cargo trucks.\nThe new ferry, which had been needed for many months, had suddenly showed up a week before the election and it was older than those currently in service.\nGozitans, he said, were starting to realise - if there was any doubt - that the government simply did not care for them.\nThe PN on the other hand wanted Gozo to be its own region, a total regeneration that would save it from an ageing population, and attract new investment.\nGozitans, he said, still got paid on average €1,200 less annually for the same work being done by Maltese.\nCouncil of Europe report: Another condemnation for Muscat\nDr Delia also reacted to a draft Council of Europe report about Daphne Caruana Galizia’s assassination and the rule of law in Malta.\nQuoting sections of the report published by Times of Malta, Dr Delia said the imbalance of power and the abuse of power by this administration, was having negative effects on the country.\nMalta was now in a situation where international bodies were keeping an eye on it.\nWorst of all, Malta was being viewed as a threat to Europe.\nThe Labour Party that had been against joining the rest of Europe, was now viewed as a threat by Europe.\nIf Prime Minister Joseph Muscat wanted this upcoming election to be about his leadership, then this terrible report had already condemned him, he said.", "comment_count": 13, "id": 3345}, {"keywords": "", "author": "Claire Caruana", "article_body": "People would rather hear about proposals aimed at improving their quality of life than be barraged with \"negativity\", Prime Minister Joseph Muscat insisted on Tuesday evening.\nAddressing Labour Party followers in Żejtun ahead of Saturday's elections, Dr Muscat chastised the Nationalist Party for resorting to what he said was a negative campaign. Despite losing two elections and Opposition leader Adrian Delia promising \"a new way\" of doing politics, the PN had resorted to its old ways, he said. \n\"One would think that if they did not get the message in 2013, they would have in 2017. Genuine Nationalists admitted that they were too negative.And what happens? They elected someone who acknowledged this but then when it came to his first test next Saturday, we have heard nothing but negativity. Hopefully, it will be a case of third time lucky,\" Dr Muscat said. \nPeople, he argued, do not want negativity but rather a clear indication of where the country is heading, pointing to good quality of life as one of the main priorities of today's society.\nTo do so, he went on, the government was using the surplus to improve people's lives, making changes that reduced pollution and increased open spaces, improved health services and even introducing new policies such as the national sports strategy unveiled earlier on in the day. \n\"Yesterday we unveiled our plans for the health centres. Earlier today, we unveiled the national sports strategy. We have become used to being first in everything and we want to be first in sports too,\" the Prime Minister said. \nHe also referred to statistics issued by the European Commission on Tuesday which he said confirmed Malta had the fourth-lowest electricity bills in Europe, something which the Labour government had worked extremely hard to achieve. \nAnd while the government strived to achieve such a result, the PN continuously opposed this, Dr Muscat said, saying that he felt as though he was \"still at school going through an obstacle race\" anytime changes were implemented. \n\"We had to go through an obstacle race to slash electricity prices because of the hurdles by the Opposition. We found no help from the Opposition,\" Dr Muscat lamented. \nHe then ended his speech by urging followers to, come Saturday, vote for all of the party's candidates to send a message to the PN who he again said wanted to discourage people from voting by not fielding enough candidates.  ", "comment_count": 27, "id": 3346}, {"keywords": "", "author": "", "article_body": "An undefined group of public sector workers with complaints about “anomalous or unfavourable situations” are to receive a one-time payment, even if their claims are legally baseless.\nThe announcement, made in a Tuesday afternoon press release issued jointly by the Finance and Family Ministries, was thin on details and did not specify which workers would be eligible for the payment, although they include former members of the labour corps who, after January 1979, were transferred to government corporations or other entities.\nThe statement did not explain on what basis their claims would be accepted or how much money would be handed out, but it would cover the period until the workers retired or left the public service. \nDetails will be published in the Government Gazette on Friday, May 24 – one day before the European Parliament and local council elections.\nThe payment was agreed upon by ministers during a cabinet meeting on Tuesday and will follow a similar scheme for aggrieved members of the labour corps who were transferred to government departments in the late 1970s. \nIt concerns claims made by other workers with “particular circumstances” which were “to a certain point similar” to those of labour corps who benefited from that initial scheme.  \n“Cabinet felt that although these all don’t have a legal basis for their claims, nevertheless certain circumstances they experienced at the time deserve compensation”.\nEven heirs will be eligible\nSpeaking last Sunday, Dr Muscat had hinted that a compensation scheme for former Telemalta workers was on the card, saying the government could afford to do so because \"quoting [former Prime Minister] Mintoff, we have a cow that we can milk\".\nThe mystery scheme, which will apply to workers who joined the public sector from January 16, 1979, will also be extended to the heirs of workers who would have been eligible had they still been alive.\nApplicants must agree to renounce any further claims to qualify for payment, with the initial disbursements to be made later this year, the ministries said.\nDr Muscat also referred to the scheme when he spoke in Zejtun later on Tuesday.\nThe Labour Party quoted him as explaining how the Cabinet had approved a scheme to ensure justice for more workers.   \nHe said that over the past two years, payment had been made to thousands of workers including former port workers and labour corps workers. Other workers had then raised issues and while they may not have legal grounds, the government felt they were morally right.\nAmong them were former corps workers transferred to the then Telemalta and others formerly employed at the Gas Board. \nHe said the process has been underway for a year and was only being concluded thanks to the country's surplus.  ", "comment_count": 62, "id": 3347}, {"keywords": "", "author": "", "article_body": "Shalon Abela, 24 of Valletta, was jailed for three years on Tuesday after admitting to having burgled a house in Mosta in April last year, stealing jewellery worth not more than €2,329.37.\nIn handing down sentence, Magistrate Yana Micallef Stafrace observed that the accused has a colourful criminal record and had failed to take up opportunities for him to reform.\nThe court also noted that the burglary took place during the term of a suspended sentence. It therefore also ordered the forfeiture of a personal guarantee and a deposit, totalling €2,300.\n ", "comment_count": 0, "id": 3348}, {"keywords": "", "author": "Ivan Martin", "article_body": "Foreign workers have flooded into Malta in recent years, but according to a new study they are also quick to leave. \nAccording to the Central Bank, a quarter of foreigners working in Malta leave the island within the first year of arriving here. \nThis figure climbs up to nearly half by the second year they are on the island. And by the sixth year, only one in three foreigners remain here. \nThe study sheds light on the contentious issue of the influx of foreign labour. \nWhile arrivals were climbing, Malta’s outward-migration rate was more pronounced than that observed in other advanced econo­mies.\nAccording to the Organisation for Economic Co-operation and Development, less than a third of migrants either return to their home country or move elsewhere five years after their arrival.\nBy contrast, around half of the foreign workers in Malta exit the Maltese labour market within just two years of their arrival.\nWhere do they come from?\nDue to country’s access to the European single market, around 70 per cent of foreign work­ers originate from the European Union, while just 30 per cent are third country nationals.\nEU nationals generally tend to stay for slightly shorter periods than others. Skill seems to be positively correlated with length of stay, the Central Bank found. \nThe lowest skilled workers have the shortest duration of stay, while highly-skilled workers have the lowest exit rate – staying here far longer.\nHowever, those considered medium-skilled also have pretty high exit rates.\nForeign workers employed in services and sales have the highest exit rates at the shortest duration, which the bank says was probably because they are engaged in the accommodation sector, which is seasonal and volatile.\nManagers maintain the lowest exit rates, while those employed as plant and machine operators have the highest exit rates.\nMaltese firms are predominantly small- and medium-sized enterprises, but micro firms employing less than 10 workers, have the lowest exit rates across the different durations.\nOne would expect, the study says, the length of stay for foreign workers in Malta would fluctuate depending on the economy.\nThe relatively short length of stay of foreign workers in Malta, however, limits the scope for them to experience “economic assimilation” into the broader workforce – in other words their wages do not come into line with those of the Maltese.\n“It is likely that since foreign workers tend to be relatively young and stay for a short period of time, the rate of economic assimilation in Malta is rather low,” the study says.\nThe process of constantly selecting and hiring workers, as a result of the high level of labour turnover, also puts significant pressure on the human resource departments in local firms.\nREAD: Malta will need another 13,000 foreign workers this year\nFurthermore, firms were often unable to hire foreign workers who had already obtained experi­ence in the Maltese job market, and were instead constrained to consistently hire workers who did not already live here. Since foreign workers tended to exit the labour market very rapidly, it also posed limitations on learning-by-doing, which in turn could negatively impact the island’s economy.\nThe relatively short length of stay by migrants, however, could also have its advantages.\nDespite the costs related to hiring and training, new employees were more likely to bring new ideas to the table. In fact, they were linked to increased innovation and productivity.\nMoreover, a relatively short length of stay could also have a positive impact on public finances.\nThey were contributing more towards government coffers in taxes than they were taking out in the use of public services.", "comment_count": 42, "id": 3349}, {"keywords": "", "author": "", "article_body": "Mater Dei Hospital staff held a show of solidarity on Tuesday in the wake of the shocking murder of a black migrant. \nStaff members wore T-shirts with the slogans #Bettertogether and #Stophate in an act of solidarity after two Armed Forces of Malta soldiers were arraigned with shooting dead an Ivorian migrant. \nRead: Two soldiers plead not guilty to murdering Ivorian man\n\"As a multi-national, multi-faith, multi-cultural organization MDH is living proof of the benefits that arise when individuals from across the globe, with different backgrounds come together with one aim; to deliver top quality care to whoever needs it,\" a statement from Mater Dei's administration uploaded on Facebook said. \n\"From the invisible maintenance guy on the roof, the cleaner in the lobby, the carer beside your bed, the nurse delivering care in your ward, the pharmacists and allied professionals across the hospital, the surgeon leading interventions, the silent anaesthesiologist delivering essential care, these individuals enrich us, make us better, help us break down the natural barriers and limitations we as a country are born with.\"\nThe administration said the only language that matters is patient care, because the only important culture is patient safety.\n\"This is who we are and why we stand here today. We stand in silence against prejudice and hatred.\"\nStaff gathered outside Mater Dei's hospital entrance.", "comment_count": 8, "id": 3350}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young mother with a serious drug problem has been cleared of stealing funds from her grandmother’s bank account for lack of evidence. \nThe 21-year old was accused of theft after relatives had reported that her grandmother that only €5 remained out of €800 credited to her account some three days previously.\nThe grandmother suspected that her granddaughter had pinched her credit card, along with the account PIN number, from her handbag, while the two were out shopping.\nThe young woman's mother had also suspected her daughter’s hand in the theft, telling police that her suspicion was roused when told by the bank that the funds had been withdrawn in Hamrun, the locality where the accused was staying at the time.\nThe €800 had been deposited on October 2 and by October 5 had been withdrawn in ten transactions, leaving a balance of €5. \nThe court, after analyzing the evidence, including the testimony by the accused’s grandmother and mother, said it was “not at all convinced” of the woman’s guilt.\nThe accused’s mother had stated that her suspicions were based on the fact that her daughter was living at Hamrun, the place where the bank withdrawals were effected, while the grandmother had told the court that she suspected that her granddaughter stole the money, but she did not know exactly what she did.\nThe court said these were mere assumptions and suppositions which had not been corroborated and confirmed.\nNo CCTV footage from the ATM sites had been produced as evidence, nor any proof that the accused had actually been living in the locality at the time of the suspect withdrawals. \nThe allegations had likely stemmed from an “unhappy and precarious” family situation resulting in an attempt to make the young drug-addict seek help, the court observed, given that the relative social agencies could only intervene when the person voluntarily sought help, unless they were called in by the courts in the course of judicial proceedings.\nMagistrate Gabriella Vella concluded that the allegations had not been proven beyond reasonable doubt, thereby clearing the accused.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 3351}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A foreign passenger who landed in hot water after two unlicensed weapons were discovered in his luggage by officials at the Malta International Airport has been given a suspended sentence.\nBriton John Michael Doyle, 54, from Bristol, was on his way to board an outbound flight when an unlicensed Beretta shotgun and a .22 pistol were found in his possession.\nProsecuting Inspector Silvio Magro informed the court that the man had been attempting to export the weapons to the UK, albeit without knowing that a licence was necessary to do so.\n“He was not aware of what the law stipulates. He was attempting to send the weapons to his brother who has a licence for them,” the Inspector explained.\nLegal aid lawyer Noel Bartolo likewise explained that the man had no idea that he needed a permit to carry such weapons, stressing that his client had, in fact, declared the firearms and had not tried to hide them.\n“This is a very unfortunate case because my client’s brother does have a license for these weapons. The firearms were simply going to be sent back to my client’s brother,” Dr Bartolo argued.\nThe prosecution added that the accused had cooperated fully and did not cause a breach of security.\n“Had the brother himself been here to transfer the weapons, this problem would not have emerged. It’s a question of technicality,” Dr Bartolo argued.\nThe court, presided over by magistrate Neville Camilleri, upon the accused’s own admission condemned him to a seven-month jail term suspended for one year, observing that in spite of the accused’s early guilty plea and cooperation with the police, “ignorance of the law was no excuse”.\nThe court further ordered the confiscation of both weapons.", "comment_count": 6, "id": 3352}, {"keywords": "", "author": "", "article_body": "A man was grievously injured after falling from a height of around three storeys when the ceiling he was working on collapsed.\nThe police said the accident happened in Triq Spinola, St Julian’s at 11.30am.\nThe man, a 37-year-old Italian who lives in Lija, was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3353}, {"keywords": "", "author": "", "article_body": "Enemed has dug boreholes at its plant in Birżebbuġa, which will trap oil and prevent it from seeping into the sea, preventing pollution.\nThe company said it planned to stop using its current storage facilities by the end of the year, following a move to Ħas-Saptan, after which the tanks would be dismantled, followed by a project to decontaminate the site.\nIt pointed out that seepage was not coming from the tanks but from fuel that had been lying in the rocks for many years. It had accumulated there following many incidents over the years, including the placing of a bomb. Shell had at one point taken temporary measures to address the problem.\nAfter seeking expert advice, Enemalta had built a plant to collect the oil in strategic areas, making its collection easy. This had been finished in 2001 and the plant was still being used - although the liquid being collected now only contained minor traces of oil, if any at all.\nEnemed said that although the problem had been mitigated, fuel was once again seeping from different areas, just as the experts had predicted. It had had to dig new bore holes to catch this oil, and the amount of seepage dropped drastically as a result, so much so that only water was collected for long periods.\nThis, the company said, proved that the problem was not created recently but was the result of incidents in the past which had always been addressed by temporary solutions.", "comment_count": 4, "id": 3354}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who after a night out in Paceville allegedly smashed a beer bottle on his girlfriend’s head was remanded in custody upon his arraignment on Tuesday.\nJohan Tommy Noren, a 29-year-old Swede, was involved in the violent episode after a night out last Saturday.\nAfter parting company with her boyfriend, the woman had apparently gone to sleep at a friend’s house in Paceville, prosecuting Inspector Bernardette Valletta explained during the arraignment.\nThat was where the accused had found her, lying asleep in a single bed, when he turned up at the place later.\nThe woman was forcefully and rudely woken up to the threats and insults of her boyfriend who appeared to have been under the influence of drugs at the time.\nThe situation escalated when the man allegedly smashed a beer bottle on her head, forcing her to seek treatment at Mater Dei Hospital.\nThe alleged aggressor was arrested over the violent episode, and charged with causing slight injuries as well as threatening and insulting his girlfriend.\nNo request for bail was made and the accused was remanded in custody.\nUpholding a request by the prosecution, the court, presided over by magistrate Neville Camilleri, issued a protection order in favour of the alleged victim.", "comment_count": 0, "id": 3355}, {"keywords": "", "author": "", "article_body": "It is “incomprehensible” that Home Affairs Minister Michael Farrugia has not offered to resign after two soldiers were charged with a racially-motivated murder, Nationalist Party MP Mario de Marco has argued.\n“The Prime Minister should have been given the option to consider the offer, by ensuring that the army is not guilty of any grave errors in this tragic affair,” Dr de Marco wrote in a Talking Point published by Times of Malta on Tuesday. “It was the right thing to do in the circumstances”.\nTwo young soldiers face charges of having murdered Lassana Cisse, a 42-year-old Ivorian, in a drive-by shooting in Birżebbuġa last April. They deny the charges.\nInvestigators say that the suspects, Francesco Fenech, 22, and Lorin Scicluna, 21, killed Mr Cisse purely because of his ethnicity. Both men had been recruited by the Armed Forces of Malta, which falls under the political responsibility of minister Farrugia, during the 2017 general election campaign.\nOne of the suspects, Mr Scicluna, had in the past received a conditional discharge for an unrelated offence. This did not impact his AFM employment because the case was “not serious”, the minister told the press on Monday.\nDr Farrugia has shrugged off responsibility for the case. According to Lovin Malta, a ministerial spokesman said that “The minister would only be responsible if the soldiers were on the radar. He is also politically responsible for the police force, which solved the case.”\nIn his Talking Point, Dr de Marco noted that there were several unanswered questions about the AFM’s recruitment procedures.\nEarlier this year, an Ombudsman report found that authorities had manipulated army promotions procedures to ensure selected officers were promoted to high-ranking positions.\nMichael Farrugia. Photo: Darrin Zammit Lupi\nDr de Marco drew on that report in arguing that the army had become an extension of the government's political arm.\n“Therefore, by definition, responsibility for any shortcoming by these State institutions needs to be carried by the politician. This is what would have happened in any other democracy,” he wrote.\n'We have become immune'\nDr de Marco said he did not hold out too much hope for Mr Cisse's murder to serve as the wake-up call the country needed, drawing on Franz Kafka's bleak novella Metamorphosis for inspiration. \n\"Just like Gregor Samsa,\" he wrote, \"we think that if we sleep a little bit longer we can forget all this nonsense. We can forget who we became while we were asleep\".\n\"The sad truth is that we have become immune to what is happening around us\". \nRead Dr de Marco’s Talking Point in full.", "comment_count": 118, "id": 3356}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The man currently facing proceedings for allegedly abducting his estranged wife and subjecting her to a three-day ordeal in an underground chamber beneath Fort Ricasoli has been jailed nine months besides and had €63,000 forfeited for breaching bail.\nSeychelles-born Roddie Swinton Williams, 38, had been granted bail pending compilation proceedings for attempted murder, placing his victim’s life in manifest danger, violently engaging in sexual acts and a number of other charges related to the episode which took place in October 2017.\nHe was also accused of abducting his ex-wife and holding her against her will, regaining his personal freedom against an original bail bond of €80,000 which was later reduced, in line with case-law on the subject, to €63,000.\nYet the man soon landed once again on the wrong side of the law after failing to keep his daily appointment with the bail book, last turning up to sign on February 19.\nHe was tracked down earlier in May and arrested in a Qormi garage that was targeted during a drug raid. He was taken to court and charged with repeatedly breaching bail conditions.\nREAD: 'I felt trapped like a mouse'\nDelivering judgement, the court, presided over by magistrate Donatella Frendo Dimech, observed it was “readily evident” from his criminal record “that the accused, besides not being a first-time offender, appears to have difficulty observing and abiding by court orders”.\nUpon the accused’s own admission relatively early in the proceedings, the court declared him guilty and observed that the conviction made forfeiture of the bail bond a mandatory consequence.\nFor this reason, besides condemning the accused to a nine-month jail term, the court also ordered forfeiture of the €3,000 deposit and €60,000 personal guarantee as well as the accused’s “immediate re-arrest”.\nSuperintendent Josric Mifsud prosecuted.", "comment_count": 0, "id": 3357}, {"keywords": "", "author": "", "article_body": "Foundations have been laid down for a \"massive\" social housing project in Birkirkara, the Parliamentary Secretary for Housing Roderick Galdes said.\nMr Galdes was speaking at a site visit for the project, which will see 73 apartments being built in Triq il-Qanpiena. \nOver 80% of the apartments will have access to balconies, internal gardens or terraces, Mr Galdes said. Four hundred square metres of the 11,000 square metre project will be dedicated to open spaces.\nIf authorities wanted to cut out the waiting list for social housing, it was clear more housing stock was needed, he said.\nThe problem of housing has been there for over 20 years, and almost 3,000 people had been on the waiting list when he took helm of the housing secretariat, Mr Galdes added.\nVisiting the site on behalf of Projects Malta, Tourism Minister Konrad Mizzi said people had a right to decent housing and social mobility.\n“These projects address specific needs, but are not permanent solutions,” Dr Mizzi said.", "comment_count": 31, "id": 3358}, {"keywords": "", "author": "", "article_body": "A man was seriously injured when he fell at a construction site on Tuesday morning.\nThe accident happened in Triq l-Imdina, Qormi at 7.40am. He fell after losing his balance.\nThe police said the man was a foreigner but his name has not yet been established.\nHe was taken to Mater Dei Hospital by ambulance.\nAn inquiry is being held and the police are investigating.", "comment_count": 0, "id": 3359}, {"keywords": "", "author": "Jacob Borg", "article_body": "Masterminds behind Caruana Galizia assassination still at large, Council of Europe report notes\nScathing report highlights serious damage that can be done by Malta's dysfunctional system \nWeaknesses a 'source of vulnerability' for all of Europe\n\nUpdated 7pm with PN, PL reactions - \nA draft Council of Europe report about Daphne Caruana Galizia’s assassination and the rule of law in Malta points a finger at Prime Minister Joseph Muscat for offering his chief of staff Keith Schembri, Tourism Minister Konrad Mizzi and Nexia BT managing partner Brian Tonna total impunity under his “personal protection\", despite their involvement in a raft of scandals. \nThe report, seen by the Times of Malta, concludes that the rule of law in Malta is seriously undermined by the extreme weakness of its system of checks and balances.\n\nThe report says the Council of Europe’s assembly considers that recent events in Malta illustrate the serious damage that can result from its “dysfunctional system”.\n“Despite certain recent steps, Malta still needs fundamental, holistic reform, including subjecting the office of Prime Minister to effective checks and balances, ensuring judicial independence and strengthening law enforcement and other rule of law bodies”, the report says.\nWeaknesses a source of vulnerability for all Europe\nIt warns that Malta’s weaknesses are a source of vulnerability for all of Europe. “Maltese citizenship is European Union citizenship, a Maltese visa is a Schengen visa, and a Maltese bank gives access to the European banking system.”\nIf Malta cannot or will not correct its weaknesses, European institutions must intervene, the scathing report says.\nMalta's problems are Europe's problems, the Council of Europe says\nThe Council of Europe urges the Maltese law enforcement bodies to end the prevailing climate of impunity by robustly investigating and prosecuting those suspected of being involved in or benefitting from the scandals exposed by Daphne Caruana Galizia and her colleagues.\nThe report reminds the relevant authorities that evidence is not a pre-condition for launching a criminal investigation, but its possible result.\nTo prevent impunity, investigations shall be launched as soon as credible information, such as the Panama Papers, indicates that a crime could have been committed, the report continues.\nLast month, a court acknowledged that evidence of a crime could exist in the Panama Papers. The decree paved the way for the first comprehensive probe into the involvement of top government officials in the Panama scandal.\nNo one arrested for masterminding assassination\nThe report links rule of law weaknesses in general and the criminal justice system in particular to its analysis to the assassination of Ms Caruana Galizia. Ms Caruana Galizia was blown up by a car bomb in October 2017.\nThe report highlights how the three men suspected of carrying out the bomb plot have still not been put on trial, with their custody limit expiring in two months.\n“No one has been arrested for ordering the assassination. A magisterial inquiry is still ongoing, with no news on its progress”, the report states.\nThe report demands the setting up of a public inquiry into Daphne Caruana Galizia's murder\nThe Council of Europe’s report notes a series of concerns about the murder investigation, including the Prime Minister’s promotion of the original magistrate leading the inquiry, the failure of the police to interrogate Economy Minister Chris Cardona over possible contacts with the suspects and “false claims” by the Home Affairs Minister about the progress of the investigations.\nIt also calls out the “inflammatory and misleading statements” by persons close to the Prime Minister and questions the possibility that the Maltese security services may have had prior intelligence about the bomb plot.\nCriminal proceedings against the three men have showed that one of the suspect’s phones was being tapped prior to the murder.\nThe security services have categorically denied having any prior knowledge about the plot. \nThis report, which is expected to be put to the Council of Europe's assembly next month, calls on Malta to set up an independent public inquiry within three months.\nPN reaction - Malta's reputation tarnished again\nIn a reaction, the shadow minister for foreign affairs, Carm Mifsud Bonnici, told a press conference that the Council of Europe report was another condemnation of the Maltese government which also undermined Malta's international reputation.\nDr Mifsud Bonnici said it was a shame that it had to be the European institutions to intervene following the government's failure to ensure that the rule of law prevailed.\nThis stage should never have been reached, and the least one could now expect was that the government implemented recommendations made in this report and others in the past few months, including Greco and the Venice Commission.  \nPL: Reality is different\nThe Labour Party said the report which the PN was rejoicing about was written by a member of its own political family, and the reality on the ground was very different from what was described. \nThe people on Saturday had a right to send a signal to those who were working abroad against Malta's interests, the PL said. ", "comment_count": 223, "id": 3360}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 11.45am with Ms Appelgren's comments\nDemocratic Party member and MEP candidate Camilla Appelgren's Facebook account and page went offline on Tuesday, one day after a social media frenzy exposed internal rifts within the PD.\nSearches for Ms Appelgren's pages drew blanks, with the candidate declining to comment when approached by Times of Malta for comment. Her Instagram account was still online at the time of writing. \nIn a comment later in the morning, Ms Appelgren quoted Daphne Caruana Galizia. \n\"'There are crooks everywhere you look now. The situation is desperate.\" This will summarise the end of my journey online for now,\" she told Times of Malta.\n\"My fight continues. I’m still on the ballot as an MEP candidate\".\nMs Appelgren has been one of the campaign's most active candidates on social media, having built up a following on Facebook by actively promoting litter clean-ups. She has eschewed advertising, instead focusing on social media posts to disseminate her message. \nThe sudden disappearance of her pages follows controversy over the PD's position on abortion. \nOn Tuesday, Times of Malta reported that both the PN and the PD had signed a pledge to bring forward amendments to entrench an abortion ban in the Constitution by the end of the year.\nMs Appelgren's Facebook page was taken offline.\nMs Appelgren subsequently wrote on Facebook that she had not agreed with the declaration, saying it had been drafted by “patriarchal fundamentalists\". She said she was “pro-prevention” of abortion and disagreed with a blanket ban.\nMultiple members of the party later took to social media to announce they were not in agreement with the pledge, which had been signed \"conditionally\" by party leader Godfrey Farrugia.\nOver the ensuing hours, party founder Marlene Farrugia, party deputy leader Timothy Alden and the party's former leader Anthony Buttigieg all had their say on the issue. \nAll emphasised that the party did not require its members to fall into line and welcomed a variety of perspectives. \nSocial media attacks\nMs Appelgren bore the brunt of many social media attacks following her comments, which appeared to upset people on both sides of the issue.\nAnti-abortion activists criticised her reluctance to agree with a blanket ban on abortion, while some pro-choice supporters questioned why she was part of a party that was willing to sign such a pledge.\nHer Facebook silence comes days before Malta goes to the polls for the upcoming European Parliament and local council elections.\nPD MP and founder Marlene Farrugia also took down a Facebook post she had uploaded about the matter. ", "comment_count": 51, "id": 3361}, {"keywords": "", "author": "", "article_body": "Three men were injured, two of them grievously, as a flagpole came crashing on them while they were taking it down in Fgura.\nThe police said the accident happened on Monday on the roof of a residence in Triq Mahatma Gandhi at 6pm.\nTwo men, aged 49 and 41, were grievously injured, while a 77-year-old was slightly injured.\nThey were all taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3362}, {"keywords": "", "author": "", "article_body": "These are the main stories in Tuesday’s newspapers.\nTimes of Malta says the two soldiers facing criminal charges over the racially-motivated murder of a migrant were suspended from their duties following a special order by President George Vella. In another story, the newspaper says the Nationalist and Democratic parties have pledged to bring forward amendments to entrench Malta’s abortion ban into the Constitution by the end of the year.\nThe Malta Independent quotes Prime Minister Joseph Muscat saying that the Equity Sharing Scheme that had just been introduced was not a silver bullet that would remove all forms of housing issues but part of a sequence of measures to addressing people’s different realities.\nL-Orizzont speaks to Parliamentary Secretary Silvio Schembri who says that the financial sector in Malta has remained stable.\nIn-Nazzjon quotes PN leader Adrian Delia saying that an independent commission should be set up to study and recommend recruitment in the army.", "comment_count": 0, "id": 3363}, {"keywords": "", "author": "", "article_body": "Political billboards belonging to Malta's two largest parties have been defaced with graffiti by a group calling itself Billboard Guerillas.\nAs another election approached, the country has yet again been plastered with stupid and meaningless political messages of all shapes and sizes, the group said.\nThey had already taken similar action in 2017.\n\n“PLPN are trying hard to convince us that they love Malta and are willing to fight for it. Had it not been for the damage wrought by these two political parties, their silly propaganda would almost sound funny,\" it said in a statement. \n“Tragically, their track record shows that they have consistently ignored the common good and turned Malta and its population into material to be exploited by their rich and greedy friends.\"\nScores of billboards, some unsightly, were erected around the island by the two main parties ahead of the MEP elections on Saturday.", "comment_count": 111, "id": 3364}, {"keywords": "", "author": "", "article_body": "A call for proposals for a helicopter service between Malta and Gozo has been issued.\nThe call was launched by state company Malta Air Travel Ltd (Malta Medair) on Monday.\nRead: Time for a Malta-Gozo air link?\nTourism Minister Konrad Mizzi said officials from his ministry together with Malta Medair had concluded the preparatory and consultative work - technical, legal and financial, on the basis of which the call was being issued.\nDue to this, the government could proceed to the tangible step of finding an operator for a helicopter service which could take at least 15 passengers.\nRead: Could Gozo get its own airport?\n“Our vision is to bring Malta and Gozo closer and this alternative connection service would take one from the Gozo heliport to Malta International Airport in a few minutes,” the minister said.\nThe service would provide between international connectivity for Gozitans and foreigners, better connectivity for tourism purposes and ensure a service between Malta and Gozo in case of an emergency.\nGozo Minister Justyne Caruana said that discussions for the re-launch of the service started at the beginning of the legislature when the responsibility was transferred to the Gozo Ministry.\nMinister Konrad Mizzi. Video: Tourism Ministry\nThe necessary studies were held to identify the most suitable economic model and the service would be given according to a schedule.\nShe said she and her government’s vision was for better connectivity between the two islands to maximise Gozo’s potential. Connectivity, she pointed out, would also improved with Gozo Channel’s fourth vessel.\nThe proposals document can be requested by e-mail from enquires.gozoairlink@maltamedair.com.\nProposals will be accepted until June 18, electronically on proposals.gozoairlink@maltamedair.com or personally at Malta Med Air offices Administration Block A – Aviation park, Aviation Avenue Luqa 9023 between 9am and 2pm.\nProposals should be titled “Requeset for Proposal for the Provision of Passenger and Baggage Air Transport Services between Malta and Gozo”.", "comment_count": 22, "id": 3365}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 4.55pm\nEvidence against two soldiers charged with the racially motivated murder of a man will be detailed in court on Friday, Times of Malta is informed.\nFrancesco Fenech, 21, and Lorin Scicluna, 22, stand accused of having shot Lassana Cisse dead in Birżebbuġa last April. They deny the charges. Sources said the compilation of evidence, which will include witness testimony, will be carried out before magistrate Ian Farrugia. The sources said the police have a solid case against the two soldiers, which includes a detailed confession and the alleged murder weapon along with the vehicle that was used in the crime. A team of officers worked around the clock to track down the two soldiers, the sources said.\nSuspended from duty\nThe two soldiers were suspended from their duties following a special order by President George Vella.\nThe Armed Forces on Monday said that while it normally followed the principle of innocent until proven guilty, in this case it had decided to break with traditional practice and turn to the Office of the President for an order to immediately suspend the two soldiers.\nOne of the soldiers, Francesco Fenech, 21, was part of the Armed Forces’ C Company, a division within the first infantry regiment which is meant to be constantly combat ready, to be deployed in Malta or abroad, sources close to the murder investigation told the Times of Malta.\nMr Fenech is believed to have pulled the trigger on Lassana Cisse, a 42-year-old man from Ivory Coast. Two other migrants were also injured in the drive-by shooting incident.\nThese soldiers, who are considered the army’s elite, undertake special tactical and assault training and are usually deployed in peacekeeping or anti-piracy missions such as those off the coast of Somalia.\nThe other soldier involved in the case, Lorin Scicluna, 22, formed part of the AFM’s engineering division.\nThe two are believed to have been friends prior to joining the army and sources said they did not have any contact with each other while on official duties.\nThey both joined the AFM in October 2017.\nMr Cisse was killed on April 6 after he was fired upon by people inside a moving car. Two other men, also migrants – Ibrahim Bah, 27, from Guinea and Mohammed Jallow, 28, from Gambia – were also shot at from a white Toyota Starlet.\nThis is shocking for the Force\nOn Sunday, the two soldiers were accused of committing a racially-motivated murder, inciting hatred on the basis of race, firing shots in a public place with an unlicensed weapon, and making use of a car without registration plates as well as committing crimes they were supposed to prevent. Both men have pleaded not guilty.\nMeanwhile, in a statement, the AFM said an internal board of inquiry was looking into previous reports of racially motivated infringements and irregularities involving soldiers to try and identify any possible correlations.\n“The idea is to establish whether there is a group of soldiers harbouring anti-migrant sentiments or if these two were lone wolves,” a senior AFM source said.\nThe AFM said it was shocked by the alleged involvement of two of its soldiers in the murder and expressed its condolences to the victim’s family and the migrant community in Malta. \n“This is shocking for the Force, especially considering the sacrifices, commitment and dedication of its members who work incessantly, day and night, to save lives at sea, and not end them. This is done without distinction to nationality, colour and sex.\n“This sense of shock is evident in all other members of the Force, who besides their grief for such loss of life, also feel that their own hard work is being tarnished by such actions of a condemnable nature. Certainly, this occurrence does not reflect the beliefs and values ​​of the members of the Force,” the AFM said.\nIt said the two soldiers had no criminal record at the time they joined the AFM and their service was not connected to migrants.\nWhile serving in the Force, both individuals had a clean military discipline record.\nRegarding a court case which one of the accused already had, the AFM said this case was decided some time after the individual had joined the Force. The offence had occurred prior to his enlistment in the AFM.\nThe case was not considered to be of a sufficiently serious nature to merit discharge from the service, especially as the court had decided on a conditional discharge, having taken also into account that the soldier was a minor when he committed the offence.\n“The AFM would also like to point out that, as an organisation, it has remit over military and not criminal offences. When it comes to criminal offences, the AFM leaves it up to the competent authorities, including the Malta Police Force and the Maltese courts, to see that its members undergo due process at law like any other Maltese citizen,” the AFM said. \nThe AFM also confirmed that it has appointed an internal inquiry which, among other things, is tasked to ascertain whether the migrant’s murder was an isolated event by two individuals or if there may be other groups or xenophobic concerns within the AFM.\nThe board is composed of senior officers who have also been asked to make recommendations on the basis of what results from the inquiry.", "comment_count": 0, "id": 3366}, {"keywords": "", "author": "", "article_body": "PN leader Adrian Delia on Monday reiterated his call for an independent and transparent inquiry into whether the murder of Ivorian migrant Lassana Cisse on April 6 could have been avoided.\nTwo soldiers who joined the AFM in 2017 were accused of the murder on Sunday.\nDr Delia said when speaking at San Ġwann that an independent commission should also study and make recommendations on the way the army was taking on recruits.   \nThe Opposition leader said most of the members of the AFM were serious, brave people who risked their life to save others.\nThe people, however, expected answers with regard to the migrant's murder, he said. \nHe recalled that the Ombudsman in a report had described the promotions process in the AFM as vitiated and based on political decisions.\nWhile the army should be respected, the way how promotions had been awarded had hurt many serious officers of different political views. \nThe way the socialist government was taking over national institutions was undermining the country, Dr Delia said. This could also be seen at the office of the Attorney General, the police, the FIAU, the MFSA and the courts.\nThe forthcoming elections were a chance for the people to tell the government to change its ways, Dr Delia said. ", "comment_count": 8, "id": 3367}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Democratic Party was split down the middle on Monday as officials took to social media to announce their differing positions on abortion.\nThe Nationalist and Democratic parties earlier on Monday said they had both signed a pledge to bring forward amendments to entrench Malta’s abortion ban into the Constitution by the end of the year.\nThe two parties bound themselves to a written declaration by pro-life activists against any legislation that could lead to the introduction of abortion.\nPD leader Godfrey Farrugia told Times of Malta on Monday that the party had signed the pledge \"conditionally\" as a commitment to engage with all sectors of society.\nShortly after news of the pledge broke, one of the PD’s MEP candidates, Cami Appelgren, announced that she was not personally in favour of the declaration which she insisted had been drafted by \"patriarchal fundamentalists”. (See post below)\nDescribing herself as “pro-prevention” she said she would work to prevent women from ever being put in a situation where they felt they needed an abortion. However, she was not in favour of blanket bans on abortions.\nThen, PD founder Marlene Farrugia took to Facebook to announce that she fully supported Ms Appelgren’s position.\n\"As founder of PD I wish to distance myself from the extremists and fundamentalists who came up with this senseless pledge which has nothing to do with regard for human life but has everything to do with subordination of females,” she wrote.\nHowever, rather than saying she was against a blanket ban, she called for a legal framework which would allow a woman to terminate an unwanted pregnancy as soon as the fetus was viable and could live outside the womb.\n\"That way the mother lives her life and continues with her choices, while the child’s right to life and to make his/her own choices is fully respected,” she said.\nThen it was the turn of PD deputy leader Timothy Alden to chime in, saying his leader had signed in his own name, under the understanding that PD had a clause in its statute that allowed for freedom of conscience.\nHe urged voters to see the pledge \"in context”.\n\"Like all other mainstream parties, we have both conservatives and liberals in our ranks. Just because our party leader signed this pledge does not mean all candidates have instantly been radicalised one way or another,” he wrote.\n...fed up of the European Parliament elections being hijacked by the topic of abortion- Anthony Buttigieg\n'A bit of a mess', former leader admits\nSpeaking with Times of Malta, former PD leader and current MEP candidate Anthony Buttigieg admitted the party had \"made a bit of a mess of the issue”.\nHe said he was personally against abortion, but was for an open discussion on the subject.\n\"Only the Maltese government and people can decide on this,\" he said. \"I also believe that the issue has to be addressed. It's pointless banning abortion here if we do not acknowledge that women are going abroad to do it\".\nHe later added that he was fed up of the European Parliament elections being hijacked by the topic of abortion.\nWhat did the pledge state?\nThrough the controversial pledge, party leaders commit to amendments to the Constitution that would add the words “from conception” to article 33. According to the pledge, such a motion should be moved before the end of the year.\nThe article currently states: “No person shall be intentionally deprived of his life save in execution of the sentence of a court in respect of a criminal offence under the law of Malta of which he has been convicted”.\nNo reference is made in the declaration to the fact that article 33 leaves the door open to capital punishment - banned in all circumstances under the European Convention on Human Rights.\nThe party leaders also pledge to oppose any attempts to amend article six – which outlines how the Constitution overrides inconsistent laws - and to use the party whip to oppose any other abortion legislation.\n ", "comment_count": 39, "id": 3368}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Cyclists have raised safety concerns over a bicycle lane on the new Aldo Moro Road, in Marsa, which they say is constantly being intruded upon by cars driving at high speed and putting their lives at risk.\nThe new six-lane northbound road was completed late last year as part of the broader €70-million upgrade of the Marsa junction and includes an unsegregated bicycle lane.\nVehicles have been frequently observed using the cycle lane as an additional lane.\nHowever, cyclists from the Bicycle Advocacy Group (BAG) told the Times of Malta the lane was regularly used by motor vehicles –often driving at significant speed along the arterial road – both as an additional lane and as a hard shoulder, with enforcement “nowhere to be seen”.\nPhotographs and videos taken by the lobby group show the cycle lane being freely used by private vehicles and public buses.\n“The Marsa road is an important link between south and north and the authorities have a responsibility to providing safe access for all road users,” BAG policy officer Matthew Farrugia said.\n“The current designs leave much to be desired. For cyclists from the north to access the cycle lane, they have to ride over the bridge and then go to the opposite direction of traffic. If there is no segregation and cars freely use it, we are going to have accidents,” he warned.\nMr Farrugia called for effective enforcement and for the lane to be segregated to ensure cyclists’ safety.\n“The people designing these lanes are clearly not cyclists. We have said that if they are confident in their designs they should use the lanes themselves; if it’s not safe for them, it’s not safe for others,” he said.\nInfrastructure Malta, the government agency handling the works, did not respond to a request for comment.\nWorks on the Marsa junction, which sees 100,000 vehicles pass through every day, are in their third phase. The first two of seven planned flyovers are expected to be up and running by the summer, with the entire project scheduled for completion in 2020.\nThe final stage of the project will include the addition of 1.6 kilometres of new footpaths and cycle lanes as well as three pedestrian bridges, four new bus laybys and new bus lanes, according to the authorities.", "comment_count": 22, "id": 3369}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Rural pathways leading to Lunzjata Valley, in the limits of Santa Katerina, a hamlet in Rabat, are being given a concrete surface and the Planning Authority says no permits are required.\nLaw experts: ‘PA is ‘stretching the new rules to the limit’.\nRabat residents who frequently go for walks along these secluded rural passageways tipped off Times of Malta about the works in progress. \nA visit revealed heavy machinery on site. These included milling and rock-cutting equipment as well as ready-mix trucks laying fresh concrete on a wire mesh.\n“This area is completely unspoilt and is only used by farmers and some ramblers who frequently visit the 17th century chapel and retreat house there,” a shocked resident said.\n“We could not believe what we were seeing when trucks fully loaded with concrete kept coming and going as machinery chipped off the rocks to widen the passageways,” another resident said.\nWhen it went on site following the tip-off, the Times of Malta saw a group of employees from a local contractor working on a two-kilometre-long stretch of rural roads in the middle of the valley.\nThe works are being done not far from the controversial residence of Transport Minister Ian Borg, who is politically responsible for both road building and the PA.\nA Planning Authority spokesman indicated this was a public project funded by the Exchequer. PA officials visited the site and decided there was no need for a permit, he noted.\nTrucks loaded with concrete kept coming and going as machinery chipped off the rocks to widen the passageways\n“The compliance and enforcement directorate within the Planning Authority has investigated this complaint and it transpired that the works being undertaken do not require notification according to Class 3 of the development notification order,” he said.\nWhen asked to be more specific, the spokesman indicated “Class 3 (ii)”, within the framework of a 2016 legal notice.\nThis clause lays down that the “formation, laying out, alteration or improvement of roads by government agencies, local councils and other entities appointed thereby” do not require a permit in case of “the widening, improvement or maintenance of an existing road within the highway boundary”.\nPlanning law experts deemed such justification “stretching the new rules to the limit”, fearing the PA’s “subjective” interpretation of the law could be “flawed”.", "comment_count": 22, "id": 3370}, {"keywords": "", "author": "Ivan Martin", "article_body": "A Maltese black teenager addressed a Labour Party political activity on Monday to appeal for integration in the wake of a brutal murder of an Ivorian migrant.\nDescribing herself as “ethnically Ethiopian, but Maltese”, 14-year-old Thea Mizzi addressed a gathering in Ħamrun and said, in Maltese: “I came here to show you I am Maltese just like you.”\nShe said that she had been hurt by the cold-blooded murder of Ivorian national Lassana Cisse.\n“He came to Malta for shelter, for protection. He did not come here to die,” she said, thanking Malta for having accepted her and her sister with open arms.\n\nThea said that while she could remember some people making fun of her when she was younger, and the times she decided not to tell her mother, not to worry her, she was proud to be Maltese.\nShe would still meet the odd person who would be surprised to hear a black person speak in Maltese, but she was proud of not only speaking in Maltese but of speaking the language as they do in Zebbuġ.\nTaking to the podium after her, Prime Minister Joseph Muscat said Thea had sprung to mind after news had first broken of Mr Cisse’s murder.\n“Thea is as Maltese as you and I,” he told the crowd.\nPressing on the need for integration, Dr Muscat said some might try to use the term to scare voters – but to him, integration was something to be proud of.\nSome, he said, had advised him against raising the issue of migration in Ħamrun for fears that residents would not take it well.\nIntegration might not be the most popular issue, “especially in areas like this”. This is why I come here, to these types of areas to speak about this – to you,” he said.\nTurning back to Mr Cisse’s murder, Dr Muscat said he hoped his life was not lost in vain. \n“From this seed of hatred, a tree of hope and love can grow,” he said.\nDr Muscat said the country had an opportunity to make a difference.\nSome might say, ‘but what can I do?’\n“Let’s do what we Maltese do naturally - open our arms and our hearts,” he said.", "comment_count": 167, "id": 3371}, {"keywords": "", "author": "", "article_body": "British planemaker Britten-Norman is to set up a training base in Malta. \nA heads of agreement was signed on Monday between Malta Industrial Parks and the company\nThe company is to invest €1 million over a three-year period and create 14 new  jobs.\nIt has been allocated airside land at Safi Aviation Park. The company has applied for certificates to use its base to train pilots and engineers.\nIt will also be looking at registering a number of aircraft on the Malta registry.\nIt recently also entered a new three-year agreement for training of the AFM pilots. The AFM operates Britten-Norman patrol aircraft.  ", "comment_count": 18, "id": 3372}, {"keywords": "", "author": "Sarah Carabott", "article_body": "One in every 10 students in Malta has dyslexia but there are only 19 teachers specialised in teaching people with the condition, Nationalist Party MP Francis Zammit Dimech said on Monday.\nHe was speaking at a conference during which the party launched a series of proposals in support of people with dyslexia.\nThe proposals were drafted following consultation at European Parliament level and locally with the Malta Dyslexia Association, students with dyslexia and their parents, and those working at the Specific Learning Difficulties offices.\nPN proposals\nAmong others, the PN is calling for financial assistance that would fund assessment when deemed necessary, as several parents were still unaware that their children had dyslexia.\nThey also flagged the shortage of teachers specialised in dyslexia, while recommending that the Malta Dyslexia Association should have its own offices in order to be better able to support people with dyslexia.\nDr Zammit Dimech noted he would continue working towards strengthening the European Dyslexia Charter, which he launched at the European Parliament.\nMeanwhile, fellow candidate for the European elections Roselyn Borg Knight said PN MEPs would support the re-introduction of the Disability Parliamentary Group that also dealt with issues of dyslexia.\nShe appealed for assistance and better monitoring of students with dyslexia throughout the whole year, and not just during exams. Each student with dyslexia had their own specific needs and assistance should be tailored specifically for them, she said.\nThe proposals also appeal for a holistic commitment towards the Marrakesh Treaty in order to facilitate access to published works for people who are, among others, dyslexic.\nOther proposals include:\nFinancial help to independent and church schools to fund inclusion-friendly books and resources;\nTraining for teachers, Learning Support Educators and employers;\nAssistance to children with dyslexia even during continuous assessment that have replaced exams;\nInvestment in research about language technology, not just to ensure that the Maltese language does not become extinct, but also to help people with dyslexia in their everyday life;\nThe use of reader pens and laptops should not be limited to exams, but should also be allowed during exams and assessment exercises.", "comment_count": 2, "id": 3373}, {"keywords": "", "author": "", "article_body": "A French woman was seriously injured on Monday afternoon when she was hit by a car driven by a Briton in Gozo.\nThe police said the accident happened in Republic Street, Victoria, at about 2.30pm.\nThe Briton, a 46-year-old resident in Għarb, was driving a Lexus when he hit the 62-year-old French woman, who is resident in Buġibba. \nThe woman was hospitalised. ", "comment_count": 0, "id": 3374}, {"keywords": "", "author": "Ivan Martin", "article_body": "Health centres across the island will undergo a facelift thanks to €10million from passport sales have been handed over to the health authorities, the government announced on Monday.\nDuring a signing ceremony, the €10million were handed over to the Primary Healthcare Department from the government’s National Social Development Fund, which is made up of funds from the Individual Investor Programme.\nPrime Minister Joseph Muscat said the health sector was tied to people’s quality of life – something the government was committed to improving.\nThe €10million will be used to upgrade eight health centres and 54 community clinics.\nHe said the event had purposely been held in front of Gzira health centre, where significant work was needed. \nImproving healthcare centres, he said, would also help ease some of the load off the state hospital.\nAn audit by the Auditor General, Dr Muscat said, had found that a significant portion of patients at Mater Dei could have been treated at community centres instead.\nThe prime minister said the government was also busy developing healthcare hubs – one in the north and another in the south. These two “regional hospitals” represented an investment of more than €75million and would also help take some of the pressure off MDH.\nDr Muscat said that despite the efforts of those who had tried to undermine the controversial passport-for-cash scheme, the government was putting the money generated to good use. \nHealth Minister Chris Fearne said the extensive refurbishment was part of the government’s efforts to improve the service offered to citizens and the conditions in which healthcare workers spend their working day.", "comment_count": 29, "id": 3375}, {"keywords": "", "author": "", "article_body": "The government has announced a scheme to help people aged over 40, notably separating couples, buy a property.\nPrime Minister Joseph Muscat said the scheme, first announced in the Budget speech, is addressed particularly at separating couples who would need to move into another property but would not be easily able to access bank loans for the purpose.\nHow the scheme will work\nThe scheme is capped at properties worth up to €200,000.\nApplicants must cover 10 per cent of the property value at the outset. They must make APS Bank loan arrangements to cover at least half the value of the property.\nThe Housing Authority will acquire the other half.\nThe applicant will then have 20 years to buy back the remaining half from the Authority, with the cost fixed at the original purchase price.\nIf the applicant cannot pay the authority back, his or her heirs will have the opportunity to do so. \nA fresh start \nDr Muscat said this scheme would help separating couples start afresh. \nParliamentary Secretary Roderick Galdes said that to date, separating couples had no option other than to rent a property, since they could not afford to buy one. This new scheme gave them a choice. \nFamily Minister Michael Falzon said measures such as this helped ease pressure from families going through difficulties.\nFinance Minister Edward Scicluna said this was a new financial instrument which needs to be studied in detail before being implemented.  \nThe scheme will be operated by APS Bank under criteria it will establish.  www.socialaccommodation.gov.mt.", "comment_count": 5, "id": 3376}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A new valuation of large stretches of public land which the Corinthia Group wants to use for speculation purposes, is in its final stages but will only be presented to Parliament after next Saturday’s elections.\nWhile Tourism Minister Konrad Mizzi continues to refuse to give information about the ongoing valuation, industry sources said that preliminary reports by Colliers International – the global real estate company engaged by the government – shows that the deal will be very controversial.\n“Preliminary reports on the new valuation of what is considered to be Malta’s most priced land are already making the rounds in government offices but will be kept under wraps at least until when the island goes to the polls,” sources familiar with the valuation said.\n“Following the controversy over the cheap price with which the government sold the former ITS site to the DB Group – just €15 million – the government is aware that this will be an even bigger controversy and wants to keep the waters calm for now, for political expediency.”\nREAD: Corinthia to pay just €17m for peninsula\nOfficially, Dr Mizzi, entrusted by the prime minister to lead the negotiations with Corinthia over this public land, is refusing to reply to any questions.\nAsked in Parliament by Nationalist MP Karol Aquilina to give details on how Colliers International has been selected for this second valuation and how much is it being paid, Dr Mizzi said that he cannot publish such information.\n“The documents related to this company are commercially sensitive and confidential,” Dr Mizzi told Parliament in a curt reply.\nDr Mizzi had already ignored questions about who had selected Colliers International, whether the government will be publishing the valuation once ready and if the first valuation exercise, produced by Deloitte, has been scrapped.\nA preliminary deal with the Corinthia Group had already been concluded last year.\nREAD: 'Grossly undervalued' Pembroke site could trigger industry collapse - agents\nApart from keeping the whole of the St George’s Bay peninsula for touristic purposes, mainly hotels, the government had agreed with the hotel chain to be given permission to build up to 100,000 square metres of apartments and offices for sale.\nThe public land involved, considered to be the best touristic location on the island, was passed on to the Corinthia Group through various contracts on a temporary basis and on condition that it was only to be used for their hotels.\nHowever, while embarking on a project to modernise their existing hotels on the peninsula, the Pisani family, who controls the Corinthia Group, wanted to finance their new investment through the sale of apartments and offices which the government agreed to allow them to construct on prime public land.\nAccording to the first negotiated plan, presented to Parliament last December by Dr Mizzi, Corinthia were only to pay a premium of €17 million over a long number of years for the concession.\nReal estate agents had said that the current market price for the public land involved can fetch up to €700 million.", "comment_count": 1, "id": 3377}, {"keywords": "", "author": "", "article_body": "A young Spaniard has been ordered to pay damages of €236 he caused to a parked motorcycle.\nBittor Barandiaran Fernande, a 25-year-old student was walking home with friends after a boat party when he jokingly sat on the motorcycle, taking photos and a video.\nAt some stage, he took the motorcycle off its stand, causing it to topple over.\nHe was identified by police using CCTV footage and admitted his wrongdoing, stating that he was deeply sorry for his actions.\nThe young man confirmed his admission in court, and also admitted to being drunk in public.\nMagistrate Charmaine Galea conditionally discharged the man for six months and ordered him to pay the €236 bill, warning him to steer clear of any other offence over the next six months.", "comment_count": 5, "id": 3378}, {"keywords": "", "author": "Keith Micallef", "article_body": "Malta is safer now compared to a few years ago as crime in hotspots such as Paceville was on a downward trend, Police Commissioner Laurence Cutajar said on Monday.\n“We have solved murders which up to some years ago we thought we would never solve, and I feel proud that despite economic growth and a huge influx of tourists, in 2018 crime fell by 7 per cent – the largest drop since 2009,” he said.\nThe current crime rate translates to 34 per 1,000 inhabitants which makes Malta one of the safest countries in the world, Mr Cutajar added.\nThe police commissioner was speaking during a news conference marking the signing of a memorandum of understanding for closer collaboration between the police and the Malta Gaming Authority.\nAppointed in August 2016, after serving as acting commissioner for the previous three months, Mr Cutajar’s tenure has been controversial from the very beginning.\nA day after having been appointed as acting commissioner, journalist Daphne Caruana Galizia had published partisan political Facebook comments he had made in support of Prime Minister Joseph Muscat in August 2013.\nMr Cutajar has been repeatedly criticised for the way the police have handled, or not handled, claims of financial impropriety especially those involving the Prime Minister’s chief of staff Keith Schembri. \nThe police also came under fire following the murder of Ms Caruana Galizia. The alleged killers were arrested and arraigned in less than three months but the masterminds have not been identified.\nIn his address on Monday, Mr Cutajar heaped praise on Assistant Commissioner Ian Abdilla, who heads the Economic Crimes Unit, which handles money laundering investigations.\nIn the last three years, he said, this section had been beefed up to step up the fight against new forms of crime including money laundering and illegal online gaming.\n“This unit has a difficult job and many times is mentioned by the media not for positive reasons,” he said.\nThis MOU signed on Monday will result in close collaboration in the fight against economic crimes and illegal online gaming, through the sharing of information and expertise. Other benefits will be the provision of technical training both for police officers and MGA employees.\nHome Affairs Minister Michael Farrugia said this initiative was part of efforts to provide more resources to the police force. He noted that the force had managed to secure EU funds to acquire new software, by the name of Hercules III, which make it possible to have a single centralised information database. This project will make it possible to access external information to make it easier to trace suspicious activity.\nPN: Malta has a worsening crime problem\nMeanwhile, the shadow minister for home affairs, Beppe Fenech Adami, told a PN press conference that Malta has a major crime problem.\nWhile the prime minister was saying that Malta was a safe country, ordinary people were increasingly concerned about their safety, the security of their homes and impunity in some quarters. \nIt was evident, he said, that there was organised crime in Malta.\nMalta also had a situation where a man was murdered simply because of the colour of his skin, a journalist had been killed, and where the Commissioner of Police refused to investigate serious cases of corruption.\nThe government was more intent on taking over control of the courts than ensuring that justice was done. ", "comment_count": 126, "id": 3379}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 4.41 pm with AFM statement below - \nOne of the two soldiers accused of the racially-motivated murder of a migrant was a member of the army’s special duties unit, according to sources.\nFrancesco Fenech, 21, was part of the Armed Forces’ C Company, a division within the first infantry regiment which is meant to be constantly combat ready, to be deployed in Malta or abroad, sources close to the murder investigation told Times of Malta.\nThese soldiers, who are considered the army's elite, undertake special tactical and assault training and are usually deployed in peace keeping or anti-piracy missions such as those off the coast of Somalia.\nLassana Cisse was shot in cold blood last month.\nMr Fenech is believed to have pulled the trigger on Lassana Cisse, a 33-year-old man from the Ivory Coast. Two other migrants were also injured in the drive-by shooting incident.\nThe other soldier involved in the case, Lorin Scicluna, 22, formed part of the AFM’s engineering division.\nThe two are believed to have been friends prior to joining the army and sources said they did not have any contact with each other while on official duties.\nThey both joined the AFM in October 2017.\nMr Cisse was killed on April 6 after he was fired upon by people inside a moving car. Two other men, also migrants - Ibrahim Bah, 27 from Guinea and Mohammed Jallow, 28, from Gambia - were also shot at from the white Toyota Starlet.\nCriminal charges\nOn Sunday, the two soldiers were accused of committing a racially-motivated murder, inciting hatred on the basis of race, firing shots in a public place with an unlicensed weapon, and making use of a car without registration plates as well as committing crimes they were supposed to prevent.\nBoth men, who have pleaded not guilty to criminal charges, have been suspended from AFM duty. \nMeanwhile, AFM sources said an internal board of inquiry was looking into previous reports of racially motivated infringements and irregularities involving soldiers to try and identify any possible correlations.\n“The idea is to try to establish whether there is a group of soldiers harbouring anti-migrant sentiments or if these two were lone wolves,” a senior AFM source said.\nAFM expresses its shock, says the case undermines its work\nIn a statement, the AFM said it was shocked by the alleged involvement of two of its soldiers in the murder and expressed its condolences to the victim's family and the migrant community in Malta. \n\"This occurrence is shocking for the Force, especially considering the sacrifices, commitment and dedication of its members who work incessantly, day and night, to save lives at sea, and not end them. This is done without distinction to nationality, colour and sex. This sense of shock is evident in all other members of the Force, who besides their grief for such loss of life, also feel that their own hard work is being tarnished by such actions of a condemnable nature. Certainly, this occurrence does not reflect the beliefs and values ​​of the members of the Force,\" the AFM said in a statement issued in Maltese and English.\nThe AFM confirmed that the two individuals have been suspended. \nIt said they had no criminal record at the time they joined the Force and their service was not connected to migrants. Whilst serving in the Force, both individuals had a clean military discipline record.\nRegarding a court case which one of the accused already had, the AFM said this case was decided some time after the individual had joined the Force. The offence had occurred prior to his enlistment in the AFM.\nThe case was not considered to be of a sufficiently serious nature to merit discharge from the service, especially as the court had decided on a conditional discharge, having taken also into account that the soldier was a minor when he committed the offence.\n\"The AFM would also like to point out that, as an organisation, it has remit over military and not criminal offences. When it comes to criminal offences, the AFM leaves it up to the competent authorities, including the Malta Police Force and the Maltese courts, to see that its members undergo due process at law like any other Maltese citizen,\" the AFM said. \nThe AFM also confirmed that it has appointed an internal inquiry which, among other things, is tasked to ascertain whether the migrant's murder was an isolated event by two individuals or whether there may be others groups or xenophobic concerns within the AFM. The board is composed of senior officers who have also been asked to make recommendations on the basis of what result from the inquiry.\nThe AFM denied allegations by certain media sectors on discriminatory treatment between members of the Force.", "comment_count": 0, "id": 3380}, {"keywords": "", "author": "", "article_body": "Ryanair is to operate a twice-weekly new Malta-Trieste service as from October.\nIt raises to 60 the number of routes which the low-cost airline will operate from Malta in the winter.\nThat includes new, already announced services to Amman, Billund, Cardiff, Cork , Exeter, Lamezia, Luxembourg, Maastricht, Nantes, Oslo, Paphos, Perugia, Rome Fiumicino, Santiago and Thessaloniki.\nTo celebrate its new Malta route, Ryanair has launched a seat sale with fares from €33.99 for travel between October 27 and January 31, which must be booked by midnight Friday on the Ryanair.com website.\n ", "comment_count": 7, "id": 3381}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man who is suspected to have worked for alleged drug kingpin Jordan Azzopardi, was granted bail on Monday after pleading not guilty to drug-related charges.\nJordan Azzopardi.\nLuke Farrugia, 24, from Zabbar, unemployed, pleaded not guilty to procuring cocaine and heroin, as well as the possession of cocaine and cannabis in the months preceding his arrest last month. \nHe was also charged with having inflicted grievous injuries upon a former cocaine-hooked chef, who had testified in the case against Jordan Azzopardi how he was beaten up by the alleged drug lord and two of his men.\nREAD: Cocaine-hooked chef recalls beating by Jordan Azzopardi and his henchmen\nMr Farrugia was also charged with being a recidivist.\nProsecuting Inspector Mark Anthony Mercieca told the court that Mr Farrugia was arrested on April 18 and had been granted police bail pending the outcome of analysis of DNA lifted from the scenes targeted by the Drugs Squad in the anti-drug operation leading up to the arrest of Jordan Azzopardi.\nREAD: Acid tanks, white powder and fake €100 notes: court hears of drug trafficking operation\nREAD: Drug kingpin hid fake money in his shower walls, court told\nA request for bail on Monday was, however, objected to by the prosecution since a civilian witness still had to testify.\nDefence lawyer Roberto Montalto countered that there must be a real fear of tampering with evidence for bail to be refused. Mentioning a civilian witness who was still to testify, was not a sufficient ground to deny bail.\nMoreover, the accused, who was also awaiting bail in separate proceedings, had cooperated fully and had not hindered the investigations, Dr Montalto continued.\nMagistrate Charmaine Galea upheld the bail request, granting bail against a deposit of €1000, a personal guarantee of €10,000, a curfew between 11pm and 6am and an order to sign the bail book three times weekly.\n ", "comment_count": 0, "id": 3382}, {"keywords": "", "author": "", "article_body": "The Water Services Corporation has reported a net profit of €6 million in 2018, double that of the previous year. The government subvention was of €17.19 million. Revenue from sale of water was €63.1 million, 5% more than the previous year.\nWater consumption in Malta and Gozo last year was 33.4 million cubic metres of which 12 million was groundwater extraction.\nIn its annual report, published Monday, it also reports that thanks to an intensive leak detection programme, it actually reduced production last summer despite increased demand.\nThe corporation said its turnover was a record €94 million last year and the profit was the sixth in succession. The surplus is being reinvested in infrastructural projects including a massive project to link reservoirs and RO plans so as to improve water quality and distribution and further reduce groundwater extraction.\nThe corporation’s loans now stand at €68.8m compared to €106.5m in 2013.\nThe corporation said that some 2,800 individuals were notified of a possible internal water leak last year and over 3,000 home visits related to high-consumption reports or water infiltration were carried out.\nThe report is available at http://www.wsc.com.mt/annual-report-2018/ or https://www.yumpu.com/en/document/read/62664640/wsc-annual-report-2018 ", "comment_count": 3, "id": 3383}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young driver was kept behind bars on Monday after being accused of having attempted to runover a policewoman.\nThe incident happened on Sunday in Cospicua. \nKurt David Azzopardi, 18, of Qormi, unemployed, was taken to court under arrest. He pleaded not guilty to attempted grievous bodily harm, committing an offence against a police officer, failure to obey legitimate police orders, reckless and dangerous driving as well as driving without a police licence and without insurance cover.\nHe was further charged with breaching a bail decree granted last month. \nProsecuting Inspector Eman Hayman requested a temporary protection order in favour of the policewoman, pointing out that matters between the young man and his alleged victim appeared to be escalating.\nDefence lawyer Mario Mifsud pointed out that the incident, captured on CCTV, was not quite as alleged, since it was one thing to disobey a police order and another thing to attempt to run over a person.\n“We were not there but the camera was,” Dr Mifsud argued.\nMagistrate Charmaine Galea denied bail observing that the man had already benefited from this provision recently, in separate proceedings, and had allegedly once again committed other wrongdoing.\nThe court also issued a temporary protection order, warning the young man that any breach of such order could possibly land him with a maximum 2-year jail term or a €7,000 fine.", "comment_count": 0, "id": 3384}, {"keywords": "", "author": "", "article_body": "Cases of murderous racism, wherever they happen, are never isolated incidents but always connected to a context of inequality and normalised behaviour of hatred, the National Commission for the Promotion of Equality (NCPE) said on Monday.\nIt expressed its grave concern following the arraignment of two members of the Armed Forces of Malta charged with the racially-motived killing of Lassana Cisse Souleymane and the wounding of two other African migrants in Ħal Far on the April 6.\nRead: Politicians, activists and citizens unite in horror at news of migrant murder arrests\n“The NCPE considers this to be a most heinous crime, where a person was murdered because of his skin-colour; a crime that has instilled fear in communities in Malta. We should also bear in mind that the potential victims of this hatred are numerous, including Maltese citizens of a different skin colour and all those viewed as different and inferior by people harbouring such dangerous sentiments,” the commission said.\nIt called on society and institutions to embark on a soul-searching exercise to see where they failed and to take the necessary action to ensure that all social groups in Malta are considered and treated as equally valuable members of society.\nIt said the planned strengthening of the NCPE through the establishment of a Human Rights and Equality Commission would enhance its ability to address cases of racism and discrimination, including hate-speech.\nIn the meantime, the UN Refugee Agency (UNHCR) in Malta commended the work of the police force for its investigation but said it was deeply perturbed by racial motivation.\n“The Armed Forces of Malta has rescued and continues to save the lives of thousands of refugees and migrants at sea. A thorough investigation and review is required to root out any rogue elements within the AFM. We stand ready to engage with the local authorities on this issue,” it said.", "comment_count": 8, "id": 3385}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Building contractors could soon get their construction site stamped with a quality seal showing that they respected the neighbourhood, protected the environment and secured everyone’s safety.\nStakeholders have come together to sign an agreement that would kick off the drafting of a Considerate Construction Scheme, similar to that already implemented in the UK.\nThose who sign up for the scheme need to show consideration towards pedestrians and neighbours through adequate construction site hoarding, their own workers’ safety and also prevent emissions detrimental to the environment.\nAlthough signing up is voluntary, Malta Developers' Association president Sandro Chetcuti said he would push for the scheme to become law.\n“We want a situation where you walk by a building site and you cannot even tell that construction is ongoing. The days of slapdash or third world country construction sites are over.”\nAccording to Tourism Minister Konrad Mizzi, in the UK those submitting a tender for public procurement need to be part of the scheme.\nIn the UK, the non-profit-making organisation was founded in 1997 by the construction industry itself to improve its own image.\nThe Maltese authorities have spent some months in consultation with the UK’s Considerate Constructors Scheme organisation, and will implement the scheme following discussions with the Malta Hotels and Restaurants Association, the Malta Chamber for Small and Medium Enterprises, the Chamber of Commerce, Enterprise and Industry, and Kamra tal-Periti.\nRead: Building regulations overhaul needs register of contractors - architects\nA memorandum of understanding was signed on Monday between the transport and tourism ministries, the Building Industry Consultative Council, the Malta Tourism Authority and the Malta Developers' Association to start drafting the scheme.\nInfrastructure Minister Ian Borg meanwhile insisted that development would not stop in an advancing country. He referred to the promised setting up of an agency to ensure contractors and developers abide by construction regulations.Will the scheme also take into consideration safety and security of workers and neighbouring houses?\nRather than the scheme, a new agency, which will be a one-stop-shop for construction stakeholders, will ensure that old regulations are updated, Chris Agius, Parliamentary Secretary for Planning and the Property Market said.\nThese should include rules about security of workers and neighbours, ensure safe construction and monitoring during and after construction.\nMr Agius was answering questions about recent incidents where construction workers were injured while at work and a three-storey block Gwardamanġa building adjacent to construction site collapsed.\nThe government announced last year that a new authority will be set up to enforce construction rules, overhaul existing legislation and take over responsibilities currently under the remit of various entities and boards.\nThe Malta Construction and Building Authority will be set up later on this year, Mr Agius said.", "comment_count": 6, "id": 3386}, {"keywords": "", "author": "", "article_body": "Updated 12.50pm\nA quad bike rider was taken to hospital on Monday morning after hurting himself when he crashed into a wall in Attard.The incident on Valletta Road was reported at around 10.10am, the police said. An ambulance was called to the scene and took the man, who is 55 years old and lives in Birkirkara, to Mater Dei Hospital. His injuries were later confirmed as being serious.", "comment_count": 0, "id": 3387}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated 5.30pm with PD leader comments\nThe Nationalist and Democratic parties have pledged to bring forward amendments to entrench Malta’s abortion ban into the Constitution by the end of the year.The two parliamentary opposition parties bound themselves to a written declaration by pro-life activists against any legislation that could lead to the introduction of abortion.The pledge was spearheaded by co-leaders of the conservative Alleanza Bidla party Ivan Grech Mintoff and Rebecca Dalli Gonzi. It was was also signed by the right-wing Moviment Patrijotti Maltin. The Labour Party and Alternattiva Demokratika did not sign the pledge.\nMr Grech Mintoff announced the outcome of the pledge on his party's TV programme Exodus, broadcast online, describing it as a \"tremendous victory\" which would send a message throughout Europe. \n'Life from conception'Through the pledge, party leaders commit to amendments to the Constitution that would add the words “from conception” to article 33. According to the pledge, such a motion should be moved before the end of the year. The article currently states: “No person shall be intentionally deprived of his life save in execution of the sentence of a court in respect of a criminal offence under the law of Malta of which he has been convicted”.\nNo reference is made in the declaration to the fact that article 33 leaves the door open to capital punishment - banned in all circumstances under the European Convention on Human Rights. The party leaders also pledge to oppose any attempts to amend article six – which outlines how the Constitution overrides inconsistent laws - and to use the party whip to oppose any other abortion legislation.\nA 'conditional' signature from PD\nPD leader Godfrey Farrugia told Times of Malta on Monday that the party had signed the pledge \"conditionally\" as a commitment to engage with all sectors of society.PD's conditional support of the pledge is a commitment to engage with all sectors of society.\n\"We want a reasoned debate on the issue. We note that there are several elements in society in favour or against abortion. However there appears to be a majority for a broad interpretation to the right to life,\" he said.\n\"Our position as a party is to support a broad interpretation to the right to life while recognizing that there are rare situations that need to be addressed with respect and humanity,\" he added, referring to medical emergency cases where the life of mother or unborn may be at stake.PN secretary general Clyde Puli said in a response to Alleanza Bidla that his party was also ready to amend the Constitution in line with its declared anti-abortion stance. “Our electoral manifesto states this clearly and binds the elected PN MEPs to ensure that the right to life from conception is protected. All candidates have declared clearly and categorically that they are against abortion,” he said.\nBoth PN and PD said they agreed with the Constitutional amendments in principle but would need to analyse legal aspects. \nAbortion back on the agenda\nEfforts to entrench the abortion ban - one of the strictest in the world - into the Constitution were last pushed in 2005 by then justice minister Tonio Borg and continued through the pro-life lobby Gift of Life's '+9 Movement'. The proposal had the support of MPs from both major parties but never came to fruition. Malta along with just five other states in the world — El Salvador, the Vatican, Chile, the Dominican Republic, and Nicaragua — refuses abortions to women under any circumstances, even when it is a case of potential maternal life or death.The issue has returned to the agenda in recent months, with groups including the Women’s Rights Foundation and the newly-formed Doctors for Choice insisting on the need for safe and legal access to terminate a pregnancy.\nThe groups say the ban constitutes a violation of women's rights and autonomy and puts women's health at risk. PN leader Adrian Delia has made it a key part of his European Parliament election campaign, arguing that the Party of European Socialists - of which the Labour Party forms part - is seeking to declare abortion a fundamental right. Prime Minister Joseph Muscat has said there is no mandate to introduce abortion in Malta.", "comment_count": 349, "id": 3388}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man was cleared of sexually abusing his friend’s 17-year old sister while on a night out in Paceville, since the victim’s version of events - which were marked by lengthy intervals of unconsciousness - left many doubts.\nThe case dated back to one November night in 2014 when the girl had gone clubbing with her brother and two friends of his, one of them the accused, a 33-year old Cospicua man.\nAt one point, the girl had parted company with her brother - who told her that his friend, the accused, would give her a lift back home.\nAfter entering a club with the accused and two of his brothers, the girl suffered repeated blackouts and could not even recall how she had left the place.\nShe did recall, however, waking up and finding herself naked in bed, pinned down under the bare-chested accused, who was refusing to let go in spite of her protests. However, since she felt drained of all energy, she had passed out again.\nThe girl had allegedly regained her senses a second time, finding herself in the accused’s car right outside her home and remembered him telling her not to let anyone know about what had gone on between them.\nHowever, the following day, the girl had allegedly told her brother, who in turn spoke to their mother. A police report was filed and five days later, the girl was medically examined in hospital where a doctor pronounced that there were three bruises on the patient’s feet.\nFaced with allegations of violent indecent assault on a minor, the suspect aggressor protested his innocence, claiming that he had simply kissed the girl intimately but had gone no further out of respect for his friend, the girl’s brother.\nBesides, the young lady had consumed alcohol, the accused had told investigators.\nHis statements, released without the assistance of a lawyer, were subsequently discarded by the court in evidence against him.\nOn the basis of all other evidence put forward, the court, presided over by magistrate Audrey Demicoli, declared that the victim’s limited version left many unanswered doubts since, during most of that night, she had been unconscious.\nThe girl had even claimed to have experienced “illusions” and admitted that she was not certain as to what had actually happened, the Court observed.\nMoreover, even if the charges were proved, the age of consent had since been lowered to 16, which meant that the alleged victim would no longer have been classified as a minor for the purpose of the charges, said the Court, pronouncing an acquittal.\nLawyer Joseph Giglio was defence counsel.", "comment_count": 0, "id": 3389}, {"keywords": "", "author": "Keith Micallef", "article_body": "One of two soldiers charged with the racially-motivated killing of a migrant had not been suspended despite having been convicted of a crime after being engaged in the Armed Forces of Malta, Home Affairs Michael Farrugia confirmed on Monday.\nDr Farrugia said that Lorin Scicluna, 22, was only given a warning as his conviction was not deemed to be very serious.\nHowever, the minister refused to give any details about the nature Mr Scicluna's crime, saying only that the soldier in question had been given a conditional discharge.\nThe Home Affairs Minister was asked about the matter following a news conference marking the signing of a memorandum of understanding which will result in closer collaboration between the police force and the Malta Gaming Authority in the fight against economic crimes.\nQuestions raised following arraignment\nQuestions on the AFM’s procedures regarding soldiers who find themselves in hot water after being charged in court or convicted of a crime were raised on Sunday, when Mr Scicluna and another soldier - Francesco Fenech - were arraigned in connection with the murder last month.\nApart from the racially-motivated murder, Mr Scicluna was also accused of having committed a crime during the term of a condition discharge.\nThis accusation had raised eyebrows, prompting questions as to why the accused had not been suspended in the first place.\nThe Home Affairs Minister noted that the two suspects had joined the AFM with a clean criminal record. He pointed out that even those with a conviction might still be engaged - as long as it is not a serious case like “drug trafficking”. In such cases, soldiers were given a warning straight away but were allowed to join the force, he said.\nDouble standards\nThe particular case prompted fierce criticism from Godwin Schembri, a former AFM bombardier, who last year was fired on the spot by commander Jeffrey Curmi, following a rant he made regarding the installation of a gate at the Pembroke shooting range. The rant, which had been filmed by one of his colleagues on a mobile phone, was published on social media, fuelling embarrassment within the army’s top brass.\nIn a Facebook post, Mr Schembri accused the AFM commander of adopting double standards when handling cases of disciplinary nature. The aggrieved former bombardier has taken the AFM to court over unfair dismissal.\nAsked about the matter on Monday morning, Dr Farrugia declined to enter the merits of Mr Schembri’s case saying it was the subject of pending court procedures: “I urge you to have a look at the submissions filed by the AFM and make your own judgment,” the Home Affairs Minister kept insisting.", "comment_count": 75, "id": 3390}, {"keywords": "", "author": "", "article_body": "Top scientists from eight different countries are meeting in Malta this week to create the software enabling the world’s largest radio telescope to detect every single galaxy in the universe.\nEngineers and astronomers will be discussing the design of the best telescope that can deliver the requirements of the second phase of the telescope — the Square Kilometre Array (SKA).\nThe two-day event at the University of Malta Valletta campus starts on Monday and is being led by Kristian Zarb Adami, an astrophysicist with the University of Oxford and the Institute of Space Sciences and Astronomy (ISSA) at the University of Malta.\n“Malta will be playing a very important role and, thanks to funding from the Malta Council for Science and Technology and the Malta Communications Authority, our team will be developing the real-time software and system that produces images from the telescope,” Prof. Zarb Adami said.\nMaltese scientists officially joined the global team in 2015. In 2017, they announced that they had finalised a prototype radio telescope that would be used as part of the SKA. \nWhat will the telescope be used for?\nSpanning three continents and tapping the brains of over 1,000 scientists from 20 countries, the telescope seeks to discover how the first stars formed in the universe, shed light on whether intelligent life has developed on other planets and subject Einstein’s theory of relativity to its most stringent test to date.\nAs part of the project, last March scientists created the SKA Observatory, a global intergovernmental body that will oversee and operate the gigantic Square Kilometre Array.\nThey are now moving on to the second phase — SKA-2 — and the concept is inching close to reality.\nWhat will the scientists do in Malta?\nThis two-day meeting in Malta will focus on the telescope’s Mid-Frequency Aperture Array, which is the most challenging part of SKA-2 due to its sheer scale.\nAn aperture array is a large number of small, fixed antenna elements that can provide a large field of view and are capable of observing more than one part of the sky at once.\nOnce construction is completed in 2030, the telescope will be the largest aperture array ever built with approximately 100 million antennas, costing in the region of €1 billion.\n“This will be the largest data machine in the world producing more than the entire internet traffic in one day. The SKA will open a new window on our universe and revolutionise how we understand the world around us,” Prof. Zarb Adami said.", "comment_count": 24, "id": 3391}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Malta Union of Midwives and Nurses has issued directives for nurses working at the Karin Grech Rehabilitation Hospital, after Steward Health Care ignored complaints that their working conditions were not in line with those of nurses in other State hospitals.\nIn a statement, the union said that Steward had adopted \"a defensive management mechanism”, rendering the nurses totally liable on issues beyond their control.\nIt said it had given Steward enough time to implement the same practices similar to those at St Vincent De Paul and Mater Dei Hospital, but no changes in work practices materialised.\nAs a result, the union issued a set of directives for nurses, which come into force at 7am on Friday.\nWhat the directives state\nFor patient safety, all patients who have been ordered supervision for any reason such as during feeding, washing or walking are not to be ambulated unless a carer who is not part of the staff complement is added to the ward complement.\nMoreover, in the absence of a Charge Nurse or a Deputy Charge Nurse, the most senior staff nurse is not to take any patient allocation during that day.\nWith regard to the staff numbers, the union ordered nurses not to do any washing, change nappies, or ambulate/transfer patients if the staff complement is not reached. There must be five staff nurses plus one nurse in the morning and three staff nurses and one nurse in the afternoon. Even if vacation leave is cancelled due to staffing levels, the directives still count.\nWith regard to documentation, the union ordered nurses not to fill or sign care plans. All documentation that is being written on daily evaluation sheets must be stopped and such documentation has to be written only on nursing report (cardex).\nWith regard to vacation leave, the union said that nurses who book a day of leave and a half a day of leave first are to be approved automatically, without the need of a signature of the Senior Nursing Manager.\nMoreover, nurses are not to sign off any menus and those who report sick must only inform their respective ward and not anyone else.\nFurthermore, all overtime has to be confirmed within three days of booking. If such overtime is not confirmed, nurses can refuse overtime and can book overtime work at Mater Dei Hospital.\nWith regard to attendance sheets, the union ordered nurses not to sign in or out unless the attendance sheet is in the ward and should only write their name and surname without indicating the punch clock number.", "comment_count": 0, "id": 3392}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Court services, including most court sittings, ground to a halt last Friday when most magistrates were busy trying to solve clues in a treasure hunt organised for them by the Judicial Studies Committee.\nLegal practitioners told The Sunday Times of Malta they turned up at court that morning only to discover that their clients would have to return another day as members of the judiciary were on a team-building exercise.\n“When we asked the court authorities what was going on, we were informed that the magistrates would not be turning up for work on the day as they had some kind of seminar,” a veteran lawyer told this newspaper.\n“We were even more surprised when later we were informed that most of the magistrates were seen speeding off in their cars to the north of the island taking part in a treasure hunt. At first we thought it was a joke but it seems that it wasn’t,” another lawyer said.\nThe Sunday Times of Malta is informed that the treasure hunt was part of a team-building exercise devised for the magistrates in order to allow them to get to know each other better.\nApart from the magistrates, some judges also took part in the ‘extracurricular’ activity.\nA magistrate, who spoke to this newspaper on condition of anonymity, confirmed that the treasure hunt had taken place last Friday but could not understand why lawyers were making “so much fuss” about it.\n“Members of the judiciary are also normal human beings and work under constant pressure. They also need to let off some steam,” he said.\nHowever, the fact the activity took place during normal court hours did come in for some criticism.\n“We already have a part-time court where court sittings only take place in the mornings as the majority of members of the judiciary do not hold sittings in the afternoon,” one court source commented.\nThe Judicial Studies Committee is a body responsible for ongoing training of the members of the judiciary. It assists judges and magistrates in skills training and continued professional development mainly through seminars conducted by both local and foreign experts and speakers.", "comment_count": 14, "id": 3393}, {"keywords": "", "author": "", "article_body": "Updated at 12.30pm\n\nThe family of a black migrant murdered in Ħal Far last month will be getting help from the proceeds of the Archbishop’s Charity Fund Concert 2019.\nThe concert was held on Sunday at St Paul's Cathedral in Mdina, following which Archbishop Charles Scicluna announced that half the money raised would go to help Ivorian national Lassana Cisse Souleymane's widow and children.\nThe concert raised funds for the Archbishop’s Charity Fund, which helps families and persons in need. \n\n\n\nNGO launches fundraising appeal\nSOS Malta on Monday also launched an appeal for funds to assist the victims of the shooting and the family of Lassana.\nDonations may be made online at www.sosmalta.org/donate_nowSMS Donations: 50616125 - €4.66, 50619226 - €11.65\n\"Let us all show our solidarity with those who are suffering. Racially motivated crimes have no place in our country,\" the NGO said.\nMourners laying flowers at the site. File photo.", "comment_count": 59, "id": 3394}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 8.35am with video\nThe six years she spent homeless are back to haunt a 36-year-old who was given one week to vacate the place she has been renting for 10 years.\n“I don’t want to end up on the street again. When you don’t have your own home you don’t feel safe and secure, you’re all the time guarding your few possessions,” Lara* told the Times of Malta in between packing her bags and frantically looking for a place she could rent within her budget.\n“Your mind is never at peace when there’s nowhere to go to after a day at work,” she added.\nThe young woman first experienced homelessness when she left her parents’ house aged 18. \nShe had been suffering depression and anxiety for a couple of years but did not receive any understanding or support from her family. Things got so bad that apart from being prescribed medical treatment she was even advised to leave her parents’ home.\nDownward spiral\nLara eventually spent six years in shelters for the homeless, where she was helped to find a job and start renting her own place. But 12 years on, she feels as if everything is coming undone.\nIt started with the landlord doubling her monthly rent without a contract. He refused to draw up a rental agreement and asked her to vacate the premises, she said.\nWhen she asked to buy the apartment instead, the landlord gave her only one month to settle the purchase. Her other option was to leave within one week.\nLara was left with no choice but to look for a place elsewhere. However, the price was too hefty, so she has also applied to be put on the housing waiting list.\nWithout family support, the ordeal has again robbed her of her health and anxiety was back, she admitted.\n\n“I’m already picturing myself sleeping on the roads, especially considering that shelters have been full up in recent months. This is keeping me up all night,” she said.\nGrowing divide between rich and poor\nContacted for a comment, Caritas Malta director Anthony Gatt said society was experiencing a further divide between the rich and the poor.\nPeople with low income going through a personal crisis, those experiencing mental health difficulties, the elderly, exploited migrants and those who de-pended on private rent were among the most vulnerable when it came to securing a safe roof on their head, he said.\nMr Gatt referred to a figure – 80 per cent home ownership – that has been quoted to indicate that homelessness was not a widespread problem. At the same time, sights of homeless people living a vagabond life were not as obviously evident as in major European cities.\n“While the number of those without a roof over their head may indeed be contained, we are seeing a growing number of people who end up going back to live with parents, family or friends, following a divorce or separation, or because they can’t cope with rising rents and don’t afford to buy property either,” Mr Gatt noted.\nThere were also young people, still living with parents, who were being squashed out of the property market, he remarked. This was leading to reduced quality of life and psychological strain.\nMr Gatt said that housing authority plans to build more than 1,000 units, an increased rent subsidy, equity sharing schemes and the provision of emergency shelters were all effective means to address and alleviate these very difficult realities.\n“However, the residential units will take time to be built and may still not be enough to address all needs.\n“We have also come across people who don’t manage to get a regular rental contract because some owners refuse to regularise their rent. As a result, the tenant can’t apply for the subsidy. In the meantime, vulnerable people continue to suffer,” Mr Gatt pointed out.\nLara can be contacted via 2590 6600 or info@caritasmalta.org.\n*Name has been changed", "comment_count": 156, "id": 3395}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe arraignment of two soldiers charged with the drive-by shooting of a migrant was the main story in the Times of Malta, along with a story about a 36-year-old who has ended up homeless again after 12 years.\nIn-Nazzjon also featured the court arraignment, as well as a reference to its implications by Opposition leader Adrian Delia.\nL-Orizzont also leads with the court story, adding another about a €19 million investment by Playmobil.\nThe 'racially-motivated' murder was also the lead story on The Malta Independent, which also carried excerpts of an interview with Carmel Cacopardo, the head of Alternattiva Demokratika.", "comment_count": 0, "id": 3396}, {"keywords": "", "author": "Carlos Bugeja", "article_body": "In the age of Facebook, Instagram and Tinder it might be hard to believe that there was a time when people would actually assert and boast that they are married, even if they were not. This was – surprisingly – a fairly common occurrence.\n\nThis oddity had led to the creation of an action under Canon Law, commonly known as the action against the ‘jactitation of marriage’ (derived from the Latin word jactare, which means ‘to throw about or boast of in public, to the detriment of someone else’) – mostly prevalent in common law jurisdictions. \nA person could ask the ecclesiastical courts (and later, the common courts) to declare that a marriage being attributed to him or her never existed, and that the boaster be enjoined to refrain from making that claim any further in the future. This was (ironically, one could say) an action tantamount to defamation against slanderous accusations.\nA famous action against the jactitation of marriage was brought in an English court in spring of 1819 by Edward Lord Hawke against a Lady named Elizabeth Augusta Corri. He lamented that she had been falsely styling herself as his wife, and therefore unfairly assuming the title of Lady Hawke. The complaint prepared by Lord Hawke’s solicitors inadvertently reveals the precise purpose of this action:\n“That Lord Hawke is, in no way, married or united with this lady, (meaning, as the Court presumes, neither in fact nor in law); that she has falsely and maliciously boasted and reported that she is married to him, whereas, in fact, no marriage has taken place; and that, on her being desired to desist from such conduct, she paid no attention, but continued, falsely and maliciously, to boast and report such fact, to the no small prejudice and injury of the complainant.”\nLord Hawke was correct: the parties were indeed not married. But to his shock and horror, he still lost the case. It turned out that Lord Hawke was in an adulterous relationship with Corri, and had even allowed her to introduce herself as his wife, but only while they were cohabiting. That – to the court – was sufficient to dismiss Lord Hawke’s suit.\nThis is an example of many cases of the sort.\nIn time, the number of suits against the jactitation of marriage slowly dwindled, and in most jurisdictions, such an action did not survive the dawn of the 20th century; but it did inspire one similar action which forms part of Maltese laws today: the jactitation suit.\nTrue to its brother, the jactitation suit (in Maltese: jattanza or kawża ta’ millantazzjoni) is an action available to a person who is facing a claim made against him by another, which for some reason or another, is not followed by a lawsuit. It may be brought by the holder of a right attacked by a claim. The most important element in the action is that a claim is vaunted (the jactitation), in some judicial act or in writing, which runs counter to the rights of some other person. Furthermore, the claim challenged must not be in respect of an uncertain right, contingent upon any event or condition, or of a right with regard to which no action can, for the time being, be taken; it must refer to a determinate right.\nIf the person against whom the claim is made wishes to be forever liberated from such a claim, he may – within a year of such jactitation – demand that the court establishes a term (not exceeding three months) by which the claimant must institute proceedings in furtherance of his claim, or else be enjoined in perpetual silence.\nPlaintiffs had only moved to institute the action 20 months later, and therefore outside the one-year period providedby law\nIn other words, one is told to speak now or forever hold his peace. \nThe case of Philip Dimech pro et noe et vs Joseph Galea, decided by the Civil Court, First Hall on May 14 was an attempt by plaintiffs to exercise this action at law.\nThey complained that respondent had alleged some sort of right on a property which was theirs – this by means of a legal letter dated February 4, 2017. The action was instituted on October 12, 2018 – that is, more than a year later.\nIn its judgment, the court went into great detail in analysing the legal principles surrounding the ‘jactitation suit’. It explained that this institute at law satisfies both legal and social necessities; disputes are not left hanging without being resolved, and a person is not allowed to perturb another with claims and pretensions that are never brought to court for final determination.\nThis does not mean that this is an action that can be brought impetuously. Equally (if not more) important is the rule that one cannot be forced to file a court case (invitus agree nemo cogitur), and as eloquently stated by Prof. Caruana in his renowned Notes on Civil Procedure, the ‘jactitation suit’ is no less than a violation of the principle that no one may be compelled, against his will, to institute proceedings and reduce to an insignificant term the normal period for the institution of a lawsuit.\nIt is perhaps a necessary evil, that however obliges the court to apply the law strictly.\nArticle 403 of the Code of Civil Procedure (Chapter 12 of the Laws of Malta) obliges the recipient of claim to act within a year of any jactitation, that is a claim which he seeks to silence. \nThe court correctly argued that this meant that the legislator in Malta wanted to drastically limit the timeframe in which such an action may be exercised (unlike some of its foreign counterparts, which grant no timeframe).\nThe court noted that the respondent had forwarded his claim in writing on February 4, 2017, and plaintiffs had only moved to institute the action 20 months later, and therefore outside the one-year period provided by law.\nHence – the court concluded – since one of the core elements of the action was missing, there was no need to further examine the other elements. It rejected the plaintiffs’ action, and ordered them to pay the expenses.\nCarlos Bugeja is senior associate at Azzopardi, Borg & Abela Advocates.", "comment_count": 0, "id": 3397}, {"keywords": "", "author": "", "article_body": "A group of Gozitan developers, who are among the largest on the two islands, have categorically denied a claim of “antagonism” made against them by Planning Authority chairman Johann Buttigieg.\nThe developers are from the companies DTX, J. Portelli Projects and Agius Properties.\nThe case goes back to earlier this year, when Mr Buttigieg declared he was not taking part in the PA vote over a controversial application to build a new hotel in Mellieħa. He cited a conflict of interest “in view of allegations made towards him by the applicant”.\nAsked by Times of Malta to clarify his assertion, Mr Buttigieg said “there was antagonism against me personally from one of the developers involved in the project”. His move, he said, was intended to make sure none of the developers could accuse him of trying to put spokes in the wheels of their application.\nHe declined to elaborate.\nHowever, a PA source revealed that during a closed meeting of the planning board on the application, Mr Buttigieg had told the board of an allegation made by one of the developers: that he was working against them because his wife was a silent business partner in a competing Mellieħa hotel.\nThere was antagonism against me personally from one of the developers involved in the project\nMr Buttigieg, the source said, informed the board he had no private interests in any hotel.\nHis wife has in the past been a business partner of the owner of La Salita and the Maritim Antonine Hotel & Spa in Mellieħa, Adrian Buttigieg, who is also a close friend of the PA chairman.\nAsked by to confirm his disclosure to the other board members and to state whether he or his wife were in business with the hotel owner, Mr Buttigieg replied: “Neither myself, nor my wife have business interests with Adrian Buttigieg.”\nOn their part, when contacted the developers involved in the new Mellieħa project denied having been antagonistic towards the PA chairman. \n“I really don’t know where he got this from,” Daniel Refalo of DTX projects, the applicant of the Mellieħa development, told The Sunday Times of Malta.\nMr Refalo said he could not vouch for his partners in the project, Joseph Portelli of J Portelli Projects and Mark Agius of Agius Properties, but promised to check and come back. Contacted by this newspaper a few days later, Mr Refalo said both had denied the claim.\n“We have absolutely no antagonism against the PA chair or made any such allegations regarding his alleged private business interests,” Mr Refalo insisted.\nResearch conducted by the newspaper shows that neither Mr Buttigieg nor his wife appear to have any existing business connections with the owner of the Maritim Antonine or with any other businessmen.\nHis wife Lorraine used to be a business partner with Mr Buttigieg in a private company called MMB Ltd, set up in 2004 and involved in property development. Last year the company gave notice of dissolution.\nThe PA’s boss’s wife is listed as board secretary of two other property development companies, Zebbiegħ Developments Ltd and Ta’ Pinu Developments Ltd.\nIn a bid to find out if Mr Buttigieg included his wife’s interests in his declaration of assets, this newspaper asked him for a copy but the request was declined.\nTimeline\nJuly, 2011: Marine Aquatics (National Aquarium, St Paul’s Bay), owned by Adrian Buttigieg (Maritim Antonine Hotels) and Salvu Ellul (Elbros) applied to build the EU-funded aquarium and Café del Mar lido. Johann Buttigieg – then a case officer – was responsible for the application while his wife, Lorraine, was a business partner of Adrian Buttigieg\nApril, 2013: Johann Buttigieg is given a super promotion: from case officer he is appointed Mepa CEO by Prime Minister Joseph Muscat\nAugust, 2016: The Times of Malta reveals that Johann Buttigieg had his 2014 stay at London’s Royal Garden Hotel reserved by a company owned by hotelier Adrian Buttigieg. He claims he paid for the stay but fails to show invoices and says he was a travelling partner of the businessman “long before his appointment to public office”.\nSeptember, 2016: Architect Michelle Piccinino, who was Johann Buttigieg’s direct superior at the PA in 2011, declared she had not been informed of any conflict of interest when Mr Buttigieg was case officer of the aquarium project.\nSeptember, 2016: Mr Buttigieg tells this newspaper that Adrian Buttigieg is a very close friend and the godfather of one of his children.\nivan.camilleri@timesofmalta.com", "comment_count": 20, "id": 3398}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Inadequate re-homing facilities at Għammieri and an outdated ambulance have often turned the animal welfare authorities into unwitting perpetrators of cruelty, according to the Commissioner for Animal Welfare.\nWhen retired magistrate Denis Montebello took on the role in October last year, he immediately started looking into whether the two directorates he was meant to monitor were well-equipped enough to do the work expected of them by the law.\nWhile he found goodwill throughout the Animal Welfare and the Veterinary Regulation directorates, their resources are not sufficient, he said.\n“There are shortcomings that need to be tackled so that they can function properly: there cannot be surveillance without enough human resources and there cannot be proper enforcement without well-equipped ambulances that ensure animals don’t suffer more when they are taken away from their owners.\n“When an animal is rescued it needs to be taken to a place where it can be properly cared for. However, there is no adequate re-homing centre in Malta.” \nSeized animals, most often dogs, are kept at Għammieri, the government farm, while their owners are charged with animal cruelty. But lack of space at Għammieri often means that the directorates cannot even seize suffering animals as there is no safe place where to keep them.\nThe kennels had no source of heating and water seeped through the roofs when it rained. Some 100 dogs were being kept in a space that should have been hosting only 40\nWhen he visited the government farm, prompted by civil society reports about animal cruelty, Dr Montebello was shocked at the state of the pre-world war goat pens acting as dog kennels.\nThe kennels had no source of heating and water seeped through the galvanised roofs when it rained. Some 100 dogs were being kept in a space that should have been hosting only 40.\nAfter Dr Montebello flagged the issue with the Ministry for Animal Rights, work kicked off on new kennels which will ultimately be able to host some 50 dogs in adequate conditions.\nThis will still not be enough to host all the rescued animals, but it was a good start, he said.\nHe is meanwhile concerned that the lack of resources are not only detrimental to the directorates themselves but also to the Commissioner’s office, whose officers promote animal welfare at schools.\nExposing children to the current conditions at Għammieri during some school trip could unravel the work carried out by the Commissioner’s office to raise awareness about animals’ well-being.\nRaising awareness about animal cruelty and changing people’s mentality was quite challenging considering that for centuries people were taught that animals were created to serve human beings, he said.\nThis mentality also led people to pluck animals from their natural habitat and keep them in zoos, circuses or in urban environments for their own pleasure.\nEnforcement efforts undermined\nDo you agree with your predecessor that Malta is no place for dangerous animals?\nYes, dangerous animals are wild animals – they should be living in their natural habitat and not in cities with people.  \nWhat about exotic animals?\nThe name itself implies that these animals are from exotic places. As Commissioner I want every creature to live in its natural habitat.\nIf they were not born in the wild, we need to ensure that their habitat is as close as possible to their natural one. This is difficult to achieve in Malta, and the best place for them remains the wild.\nHas the Commission received reports about organised dog fights and the illegal slaughtering of horses to feed big cats?\nDespite the reports that have done the rounds in the media, and the claims made in Parliament, no one has yet brought forward any evidence, not even anonymously. So far no one has gone to the police or the directorates with proof or specific details.\nI am still following up the issues and the authorities are checking for dog bites whenever they carry out surprise visits at places hosting dogs that are usually used in organised fights, such as pit bulls.\nBetween 2015 and this year, 50 people were accused in court of animal cruelty. We don’t yet know how many have been convicted. Is this number too small?\nWhen this data was published in Parliament, I asked for details about each case on March 15. So far I have only been informed that 14 fell under the responsibility of the Veterinary Regulation Directorate, however there is no available information about how most of them proceeded.\nThis serious lack of updated and readily available records led me to conclude that the same factors compromising obligatory inspections are also undermining any efforts of enforcement and subsequent prosecutions, without which the whole structure for the ultimate protection of animal rights is doomed to collapse.\nDo you think the Commissioner should have more enforcement powers?\nMy role is to flag issues with the directorates and file a report with the Minister for Animal Rights if no action is taken.\nRather than direct enforcement, I think this office could have the right to order directorates to take action about their shortcomings, instead of reporting them to the minister.\nAccording to the law my job is like that of an Ombudsman, however, so far whenever I flagged an issue with the minister, it was followed up with an investigation.", "comment_count": 14, "id": 3399}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Ivorian community in Malta thanked the police for its investigation into the murder of Lassana Cisse and for arresting two men allegedly behind the racially-motivated crime.\nCommunity leader Ousmane Dicko also appealed to the same Police Force to continue doing its job and protect people, including African migrants. We have seen people who were supposed to be protecting us carry out such acts\n“The migrant community is very afraid at the moment as we have seen people who were supposed to be protecting us carry out such acts,” he said. \nThe comments by Mr Dicko, a friend of Mr Cisse for some years, follow the arraignment of 21-year-old Francesco Fenech and 22-year-old Lorin Scicluna on Sunday. \nThe two soldiers pleaded not guilty to the murder of Mr Cisse on Triq il-Ġebel in Birzebugia, the attempted murder of another two men and a hit-and-run incident on the same site earlier this year. Lassana Cisse was murdered in cold blood\nRead: 'My head is full of desperate thoughts' – shooting survivors open up \nThe drive-by shooting on April 6 has sent ripples of fear among black people and migrants in Malta, Mr Dicko, who has been in Malta for 15 years, said.\nMr Cisse died on the spot, metres away from two young men - a 27-year-old from Guinea and a 28-year-old from Gambia – who were injured but survived the drive-by shooting.\nAppeal by distraught mother\nA father-of-three from the Ivory Coast, Mr Cisse was himself an only child, and his distraught mother has appealed for her son’s body to be returned to Ivory Coast.\nMr Dicko said she was still coming to terms with his death, and paying farewell to his body could bring some closure to the elderly woman.\nHowever, flying Mr Cisse’s body to the Ivory Coast, once released, was going to prove quite challenging because of the costs involved.\nMr Dicko said the cost could run in the thousands, and at the moment the community is still looking for funds.\nOn Sunday, Archbishop Charles Scicluna  announced that the family would be getting help from the proceeds of the Archbishop’s Charity Fund Concert 2019,  held on Sunday at St Paul's Cathedral in Mdina.", "comment_count": 38, "id": 3400}, {"keywords": "", "author": "", "article_body": "A 58-year-old motorcyclist from Birżebbuġa was grievously injured on Sunday in a traffic accident in Mellieħa.\nThe police said the accident happened in Triq il-Marfa at 10.15am.\nThe rider lost control of his Yamaha and fell off.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3401}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Nine years ago, before anyone knew how huge it was going to be, the HBO TV series’ first season was partly filmed in Malta. Some of those involved look back at those fateful shoots ahead of the final episode out tonight.\nEvery Saturday for the last five years, Malcolm Ellul has loaded up a coach full of eager tourists and set off on a tour around the island, stopping not at temples or churches, but at the place where Ned Stark fought Jaime Lannister, where Daenerys Targaryen gave birth to three dragons, or where Queen Cersei once said: “When you play the Game of Thrones, you win or you die.”\nMalcolm Ellul on his Game of Thrones tour in Mdina\nAs the HBO mega-series comes to a close – and nine years after it filmed its first season in Malta – appetite among fans to see the real-world palaces, gardens and cliff-sides that stood in for Westeros has not yet dried up: nearly all the film tours Mr Ellul runs are now Game of Thrones tours. And all are fully booked, with American, English and German visitors making up the bulk.\n“I have a lot of people who first book the tour, then book their flights and accommodation. The reason they’re coming here is because of Game of Thrones,” said Mr Ellul, who worked as a background actor when the fantasy epic filmed in Malta, and who has himself visited filming locations in Croatia, Northern Ireland, Spain and Iceland as a fan specifically to take similar tours.\nGame of Thrones will air its globally anticipated final episode in the US this evening after an eight-season run in which it has consistently smashed viewership records, won the most awards of any drama series and become one of the most ambitious and expensive TV productions ever.\nBut none of that was certain when the show started shooting its modest-by-comparison first season in Malta and Northern Ireland in late 2010.\n“I had no idea then that it was going to be so huge,” said Alan Paris, one of a handful of Maltese actors to have had a small speaking role in that first season. “But it’s fantastic. To this day I have friends from abroad calling me because they’ve just seen the episode and can’t believe it’s me.”\nMr Paris played a guard at the capital King’s Landing, denying access to – and being put firmly in his place by – Arya Stark, played by Maisie Williams, then a 13-year old girl in her first professional role and now one of the show’s biggest stars.\nHe recalls that on the day of the shoot, the actor meant to play his fellow guard was unexpectedly unavailable so a reluctant stunt coordinator was roped in to the part at the last minute. He also remembers stumbling over a line during one of his takes – and promptly being corrected by the young Ms Williams.\n“It was a great experience,” Mr Paris said. “Compared to other productions I’ve been involved in, it was quite a tense environment at times, but extremely well organised, especially considering the scale.”\nIn all, some 900 locals took part as extras, as well as the few actors with speaking parts, alongside more than 260 local crew members working across different departments during the six-week shoot between September and November 2010.\nGame of Thrones is a good credit for the island, but so are many others\nMalta doubled for all the exteriors in King’s Landing and Essos, with several streets and squares in Mdina and Valletta, the gate at Fort Ricasoli, all the public areas at the President’s Palace in Attard and Villa Bulebin in Żebbuġ all featuring prominently, as well as Fort Manoel and Dwejra’s Azure Window.\nThe dressing at each location was so substantial that in most cases production had to close off public access four days in advance and work round the clock to lay ground cover and place in pre-fabricated sets.\n“It was one of the craziest experiences I’ve had,” said Oliver Mallia, whose film company Pellikola handled all production in Malta. “First seasons are often difficult because of limited budgets, and when you consider that the production was filming in different locations in two different countries at the same time, I think what we managed to do in Malta was quite remarkable.\n“It wasn’t the biggest, but it was very challenging because of the speed: we were shooting in autumn in Malta and the project had to be delivered in April. That had a ripple effect on everyone’s nerves. I found out from other people that in later seasons the production solved a lot of those problems with larger crews and larger budgets.”\nDoes he feel any disappointment that Game of Thrones never returned to Malta after that first season, and arguably hit its greatest peaks away from our shores?\nMr Mallia insisted that the decision not to return – most of the scenes shot in Malta were moved to Dubrovnik in Croatia for later seasons – was, despite public perception, completely unrelated to the environmental controversy at Dwejra, where construction sand was strewn over fossil-rich stones.\n“Anyone who watches the show knows they have different looks, and it was clear from the first year that Malta did not offer that variety that was required by the series,” he said.\n“If the experience had been entirely positive, perhaps some later stuff might have been filmed here, but I think it was a good lesson for authorities and service providers, and while it was unpleasant and cost the production quite a bit of money, speaking nine years later, I think it was probably blown out of proportion.”\nMr Mallia has a mixed view as to the impact Game of Thrones has had on Malta and its film servicing industry, warning that the global hype and fan culture surrounding the show does not necessarily reflect the production realities.\n“Malta has had its fair share of productions before and since,” he said. “Of course because this is one of the most-watched, it’s brought more awareness to Malta. The fact that a country has serviced a production of that scale is important; it’s a great feather to have in our cap, but it’s not the only issue.\n“Game of Thrones is a good credit for the island, but so are many others.”", "comment_count": 7, "id": 3402}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The police believe that the people behind the recent spate of burglaries belong to a gang who came to Malta on “working holidays”.\nSources close to the investigation said the police had made little progress in identifying the culprits behind the tens of burglaries of residences that have taken place in recent months, although a slowdown has been noted.\nThe sources said that different groups, each believed to be composed of between four and six men, would come here for a three to four-day stay during which they would target as many households as possible and make off with anything they could fit into their pockets.\nIn all cases, they stole jewellery, cash and watches. Larger items, such as televisions, gaming consoles, hi-fi systems, laptops and computers, were left untouched.\nThe sources said it was also likely that a mastermind was controlling the operation from abroad.\nLikely that a mastermind was controlling the operation from abroad\nThe police are also looking into the possibility that the groups kept a hiding place in Malta for stolen items they did not manage to sell on the black market.\nRather than using bump keys, as some used to in the past, the burglars gained entry by drilling through the door locks, even those generally considered to be among the more secure. \nSources said there have been dozens of burglaries in recent weeks, with the majority targeting apartments. In one case a whole apartment block was burgled. Sliema, St Julian’s, San Ġwann, Swieqi and Pembroke have been especially badly hit.\nHouses in Swieqi, Ta’ l-Ibraġ, Birguma, Rabat, Qrendi and Marsaxlokk have also been burgled. In some cases, entire rows of households were targeted, except for the odd few deemed too risky.  \nBurglar alarms in high demand\nSuppliers of domestic and commercial burglar alarms cannot keep up with demand.\nAlberta Fire and Security director Liz Barbaro Sant said their sales and requests for quotes and information had more than doubled in recent months and the company was toying with the idea of employing more installers.  \n“Before, an alarm was a commodity but now it’s needed because you cannot put a price on safety,” she told The Sunday Times of Malta.\nCommercial manager Adrian Cutajar said there was a trend of burglaries becoming increasingly organised and professional. Head of sales Reuben Germani said his staff were working till late to keep up with demand.\nThe experience was the same for G4S, with managing director Kenneth DeMartino saying that sales had “exploded” in recent months. “All of a sudden people are realising that an alarm is a deterrent and it is important to secure your property,” he said.\nThe director of another company who preferred not to be named said it was difficult for them to keep up with the number of requests they were receiving. “Nowadays, alarms are being planned at construction stage because it’s a must-have,” he said.", "comment_count": 6, "id": 3403}, {"keywords": "", "author": "", "article_body": "Ensuring equal pay for equal work, enforcing dignified standards of accommodation and educating people about Malta’s own migration history are all key in battling against racism, the Democratic Party said.\nIn a statement issued on Sunday, the PD’s four candidates for the upcoming European elections underlined their commitment to the Geneva Convention and to respecting the right to find asylum.\n“We have to nip racism in the bud, analyse why it is growing and find workable solutions that address the concerns of locals and respect those who have come to our shores to seek a better life,” they said.\nThe PD statement comes in reaction to the arrest of two men for the murder of Lassana Cisse, a 42-year-old man who was shot to death last month in what investigators say was a racially-motivated killing.\nThe two young men accused of the crime deny the charges.\nIn their statement, PD candidates Anthony Buttigieg, Camilla Appelgren, Martin Cauchi Inglott and Godfrey Farrugia asked why the Prime Minister had waited so long before speaking out strongly about the case.\n“One must also question why the Prime Minister needed to wait to discover that Maltese soldiers were behind the murder, resulting in criticism against the government, before taking as strong a stance against it,” they said.\nThe PD candidates underlined the need for six key changes:\n1. Dignified pay for migrant workers 2. European standards of accommodation at affordable rates, “not packing 10; people into a two-bedroom apartment like animals” and undercutting locals seeking a home;3. Rejecting would-be politicians who stand for hatred, racism and sexism; 4. Human rights education to teach people that everyone is equal;5. Reminders that Malta is itself a nation of migrants; and 6. Community-building and cultural programmes.", "comment_count": 11, "id": 3404}, {"keywords": "", "author": "Keith Micallef", "article_body": "A man who police originally suspected of being involved in the murder of an Ivorian migrant was charged on Sunday with drug trafficking and posseson of several illegal weapons, including a crossbow.\nThe man, whose identity cannot be revealed by court order, was charged before duty Magistrate Josette Demicoli.\nHe was arrested following a search at his home in connection with the murder of Lassana Cisse, who was shot on April 6 in Birżebbuġa.\nWhile police did not find any evidence linking the accused to that case, the operation yielded results nonetheless, as the man was found in possession of significant amounts of cannabis and cocaine which were not for personal use.\nInvestigators also found a long list of firearms, including a pistol, an air rifle, bullets and various materials used to manufacture rounds including lead and gunpowder.Lawyer Giannella de Marco, who was defence counsel, asked the court to ban publication of her client’s name. The prosecution did not object and the request was consequently accepted.\nDuring submissions for bail the court heard that the defendant had cooperated fully during the investigation, and that there was no risk of tampering of evidence or of any civilian witnesses being approached.\nMagistrate Demicoli granted him bail against a deposit of €3,500 and a guarantee of €15,000.\nPolice inspectors Kevin Pulis and Mario Xiberras prosecuted.", "comment_count": 0, "id": 3405}, {"keywords": "", "author": "Keith Micallef", "article_body": "A 36-year-old nurse has been remanded in custody after pleading not guilty to raping a woman several times in recent months.\nPrince Aftab, 36, from Pakistan and who has been living in Malta for the past 10 years, was charged on Sunday morning before duty Magistrate Josette Demicoli.\nThe court heard that the victim, a Pakistani woman, only came forward to report the case after confiding her harrowing experience to a psychologist.\nInspector Joseph Busuttil told the court that in Pakistani culture a woman having sex before marriage is considered to be disgraced, and that the victim had therefore been afraid to flag the case until she was encouraged to do so by the psychologist.\nThat claim was contested by defence lawyer Shazoo Ghaznavi, who said the inspector’s remarks about Pakistani culture described reality some 70 to 80 years ago and not the modern-day reality.\nDr Ghaznavi accused the prosecution of acting with haste, saying the police charged his client within 48 hours of the victim’s report. In a heated exchange he accused the police of “throwing mud” at his client while questioning the reason why the case was not investigated further before filing charges.\nInspector Busuttil refuted claims about the investigation having been improperly handled.\nThough no request for bail was made, the defence asked for a ban on the name of the accused. However, the court rejected this demand saying there were no grounds to uphold it.\nLawyer Helen Grech assisted Dr Ghaznavi.", "comment_count": 0, "id": 3406}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Nationalist Party leader Adrian Delia on Sunday called for an independent inquiry into whether the Armed Forces of Malta could have done anything to prevent the murder of Ivorian national Lassana Cisse, allegedly by two of its members.“We should not condemn anyone prematurely, but we cannot exonerate either,” Dr Delia said at a campaign event in Siġġiewi. “We cannot accept the government shaking off all responsibility before the facts are established.”Two soldiers were on Sunday charged over the April 6 drive-by shooting in Ħal-Far, in which two other migrants were injured, and which is believed to be the first racially-motivated murder in Malta. They deny the charges. They were also charged with a hit-and-run incident along the same road a few months ago that had left a teenaged migrant with heavy scarring.Dr Delia said on Sunday an autonomous inquiry should establish how the two suspects were recruited into the army, and whether the murder could have been prevented.Racist discourse is slowly taking root in the country\nRacist discourse 'slowly taking root'\nBut he also took aim at racist discourse which he said was “slowly taking root” and called for a united response from the country. “We cannot accept a country that has saved so many people in its history becoming associated with racism,” he said. “This is not acceptable. This is not the Malta I know and it is not the Maltese known for their heart and compassion.\n“This country needs to take a clear position. If we lose our values and morals, all our achievements will be worth nothing.”While expressing his support for the police and army - who he described as “everyday unsung heroes” - he also criticised the Prime Minister’s assertion that Malta was as safe as it had always been. “Ask yourselves, is this country as safe as it was 10 years ago? Do people still feel safe in their homes? We need to ask these questions and address the issues,” Dr Delia said.\n‘Undecided voters will decide this election’\nDr Delia referred to European Parliament and local council election polls showing a narrowing gap between the Labour Party, which still enjoys a vast lead, and the PN. He said the election would be decided by those who had not yet decided whom to vote for, and those who were planning to abstain on election day. “The decision to remain home is a decision in itself: it is saying yes to an uncaring and corrupt government,” he said. Dr Delia stressed that the election was also a choice between the parties’ European groupings, the European People’s Party (EPP) and the Party of European Socialists (PES). He said the Socialist group, with which the PL is aligned, had made clear its position in favour of tax harmonisation, a move he said would have devastating consequences on the Maltese economy.", "comment_count": 19, "id": 3407}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The only thing that three men shot at on April 6 were guilty of was being black, Joseph Muscat said on Sunday.\nAddressing party supporters in Qormi, the Labour leader dedicated most of his speech to the murder of Lassana Cisse in Triq il-Ġebel, Birżebbuġa, allegedly by two young soldiers, calling it a “national tragedy”.\nThe father-of-three from the Ivory Coast died on the spot, metres away from two young men - a 27-year-old from Guinea and a 28-year-old from Gambia – who were injured but survived the drive-by shooting.\nInvestigators have said that one of the accused admitted to targeting the migrants “just because they were black\", and sources said the two suspects had also been linked to a hit-and-run incident along the same road a few months ago.\nOn Sunday morning, the two young suspects, Lorin Scicluna and Francesco Fenech, appeared in court and pleaded not guilty to the murder, hit-and-run and other crimes. \nThe cold-blooded murder has sent ripples of fear among the black and migrant community. \nFears for adopted children\nOn Sunday, the Prime Minister said people had told him they feared their adopted children will be mistreated as they grew older because of the colour of their skin, despite being Maltese.\n“We have a historical opportunity to plant a tree of hope from a story of fear. This will be a change that each and every one of us will be part of,” he said, adding, however, that integration issues needed to be acknowledged.\n\nDr Muscat said that when faced with what Malta was facing, other countries had segregated black people into ghettos, and these communities had eventually grown into whole cities.\n“After years these countries realised they had sown a seed of hatred and recrimination in these ghettos, and people in ghettos grew hating, rather than being grateful to those who had welcomed them.\n“Whoever comes to Malta needs to understand our culture and lifestyle and we understand theirs. We should understand each other and integrate each other – no one will be cut off on his own.”\nHe reiterated that there were hundreds, if not thousands, of Maltese who had adopted black children, who were therefore as Maltese as any of us.\n“We want these children to grow with Malta, and not hate, in their hearts.”\nHe also called on people to speak up when something bothered them, giving as an example those bothered by people urinating outdoors, something that the Maltese did as well, he was quick to add.\n'They did not do anything to anyone'\nMr Cisse’s murder was a big tragedy, Dr Muscat said.\n“Violence and murder can never be justified – although sometimes one can start to understand retribution, although still wrong.\n“However, the tragedy is that these people did not do anything to anyone. The only thing they were guilty of is that they are black, and they were walking in Ħal Far at night.\n“We need to understand this national tragedy, and as a nation reflect on this moment.”\nRead: 'My head is full of desperate thoughts' – shooting survivors open up\nHe appealed for something good to come out of the tragedy and called on people to turn over a new leaf for all children's wellbeing.\nThis could be done by facing and fixing your own prejudices, stopping those who are sowing extremist ideas, and avoid repeating or smiling at such rhetoric.\nThose who wanted a good laugh should go to a comedy, and not listen to poisoned discourse that has been spreading for years in Malta, he insisted.\nHe also warned about those who had subtly sowed the narrative of us and them, such as comments like “Malta has been overrun by foreigners\" (Pajjizna mifquh bil-barranin), without making a direct reference to the Nationalist Party.\nIt was easy to box people, however, there was no us and them, Dr Muscat said, adding that people should look for that which united them, rather what divided them.Muscat warned about those who had subtly sowed the narrative of us and them\nHe also said he wanted to pass on some words of courage to all: “we are not a people who hates, our heart is in the right place and we know how to love.”\nMEP candidates call for unity\nMr Cisse’s cold-blooded murder featured prominently throughout the political event in Qormi, with MEP candidate Alex Agius Saliba calling Saturday’s news a wake-up call, especially for those who joked around about far-right extremists.\nLabour MEP Miriam Dalli called on the Maltese to unite and show that there was no place for divisiveness.\nShe referred to past warnings about those who, whether blatantly, or subtly but consciously, had introduced the idea of us and them.\n“None of us should accept hate speech on social media, at work, at school or when we come together as a family,” she said.\n“We need to have a stronger voice so that we don’t see Malta being split on the basis of colour, whether partisan, sports, belief or skin colour.”\n'We have a cow that we can milk'\nIn his concluding remarks, Dr Muscat reiterated the need for the country to move forward and continue to create wealth and employment.\nThis would help improve housing, support people in keeping up with their rent and ensure the elderly lived a decent life with their pension.\nOn Tuesday the Cabinet will approve a scheme that would ensure justice with former Telemalta employees, he said.\n“We can do this because, quoting [former Prime Minister] Mintoff, we have a cow that we can milk. For as long as I’m here I will continue feeding the cow, milk it and distribute the fruit.”", "comment_count": 49, "id": 3408}, {"keywords": "", "author": "", "article_body": "A Pieta’ man who lost control of his pick-up and smashed into a tree on Sunday morning is in hospital with serious injuries, the police said in a statement. The 26-year-old was driving a Mazda B2500 when he crashed on Triq Dicembru 13 in Marsa at around 8.40am. Civil Protection Department expertise was required to help get him out of the vehicle, with paramedics then taking him to Mater Dei Hospital by ambulance. Magistrate Josette Demicoli is leading an inquiry into the case.", "comment_count": 0, "id": 3409}, {"keywords": "", "author": "Keith Micallef", "article_body": "Updated at 4pm\nTwo soldiers have pleaded not guilty to the racially-motivated murder of a migrant and the attempted murder of two others in Ħal Far last month.Moreover, they have also been charged with a hit-and-run incident which happened in the same spot on February 1, when a migrant from Chad had sustained grievous injuries.\nFrancesco Fenech, a 21-year-old from Marsascala and Lorin Scicluna, 22 and from Paola were arraigned this morning before duty Magistrate Josette Demicoli.\nThe defendants were accused of committing a racially-motivated murder, inciting hatred on the basis of race, firing shots in a public place with an unlicensed weapon, and making use of a car without registration plates as well as committing crimes they were supposed to prevent.Lassana Cisse.\nTheir charge sheet also lists an accusation that the two killed birds and cats. \nRead: 'This is a wake-up call, not a random act' - NGOs band together\nMr Scicluna was also accused of breaching bail conditions related to a separate case.\nPolice inspector Keith Arnaud told the court that Mr Scicluna had been arrested on Friday morning, while Mr Fenech was apprehended on Saturday.\n“There was evidence that they had been on the scene of the crime, fired the shots and had been previously involved in the hit-and run incident,” Mr Arnaud told the court.\nPrior to asking them if they were pleading guilty or not, Magistrate Demicoli explained the nature of the charges to the accused and noted that in case of conviction they could be sent to jail for life.\nWhile Mr Fenech remained composed, Mr Scicluna looked very emotional especially when he saw his mother, who was present in the jam-packed hall, and who could not hold back her tears.\nLawyer Giannella de Marco appeared for Francesco Fenech while Kris Busietta and Julian Farrugia appeared for Lorin Scicluna. Inspector Arnaud and Trevor Micallef prosecuted.No request for bail was made and both were remanded in custody.\nLassana Cisse, a 33-year-old man from the Ivory Coast, was killed on April 6 after he was shot at by people inside a moving car. Two other men, also migrants - Ibrahim Bah, 27 from Guinea and Mohammed Jallow, 28, from Gambia - were also shot at from a white Toyota Starlet.\nOn Saturday, police announced that they had arrested two prime suspects in the murder. Sources told Times of Malta that one of the suspects had admitted to targeting the migrants “just because they were black\".\nThe two suspects were brought to court on Sunday morning. Video: Mark Zammit Cordina", "comment_count": 0, "id": 3410}, {"keywords": "", "author": "", "article_body": "A man’s dead body has been found off Comino by Armed Forces of Malta personnel, the police said on Sunday.\nThe body is believed to be that of a 67-year-old Mosta man who was fishing from the shore of Comino on Saturday.\nAFM personnel spent much of Saturday afternoon scouring seas around Comino in search of the man, after emergency services received a phone call from people who claimed to have seen a fisherman fall into the sea.\nThe report was filed at around 10.50am on Saturday, with patrol boat and helicophter searches beginning soon afterwards.\nSearches continued on Sunday morning, with the man’s body being found at around 11am.\nMagistrate Paul Coppini is leading an inquiry into the incident.", "comment_count": 0, "id": 3411}, {"keywords": "", "author": "", "article_body": "What appears to be Malta’s first case of racially-motivated murder should serve as a “wake-up call” about what happens when racism is allowed to fester without being addressed, a group of 60 civil society groups said on Sunday.\n“For too long we have ignored the daily experiences of the migrants in our midst and clung to the myth that racist incidents are isolated, and rare, occurrences in Malta,” they said in a statement.\n“For too long we have accepted without comment, much less condemnation, intolerant views, derogatory comments and inflammatory speeches”.\nIt was now time for politicians to go beyond words of condemnation and follow through with decisive action to address racism, they added..\n“We have seen that clear, strong and consistent political leadership can make a real difference in the way minorities in our midst are treated,” the group of NGOs said.\n“Until racism is addressed with the seriousness it deserves, and every single case is duly reported and investigated, Malta will never be a safe country for all”.\nLassana Cisse, 42, was gunned down on April 6 as he walked along a country road in Birżebbuġa. Two AFM soldiers are suspected of having killed him and injured two others in the racially-motivated attack, and are expected to appear in court on Sunday.\nLeading politicians issued statements on Saturday in which they condemned the act, spoke against racism and urged people not to associate the crime with the AFM and its work.\nNGOs on Sunday however warned against the temptation of depicting the incident as a “random act, perpetrated by one or two deranged individuals”.\n“We know that it is not, because we daily come in contact with people who are treated as less than human, by individuals and institutions, because of their religion or the colour of their skin,” they said.\nIndividuals also had a role to play, they added.\n“Our action, and our inaction, make a difference. Let us not be remembered for our inability to learn from the lessons of history, for our silence in the face of hatred and intolerance, for our unwillingness to take a stand in favour of human dignity”.\nRead the statement in full, together with a list of endorsing NGOs, in the PDF below. \n‹›-+Page:  /", "comment_count": 0, "id": 3412}, {"keywords": "", "author": "", "article_body": "Pick of our pictures\nLost migrants remembered\nArchbishop Charles Scicluna on Wednesday was among those who paid tribute to the 850 people who died in an attempt to reach Italy from Libya in 2015. A long-awaited memorial plaque was laid down at the Addolorata Cemetery, where 24 dead migrants were buried in April of that year. Despite an extensive rescue operation, only 28 people survived. Twenty-four corpses were brought to Malta and the remaining 800 drowned when their boat capsized off the Libyan coast.\nWhat made the headlines\nCourt refuses Delia’s Egrant inquiry demand: A court dismissed Opposition leader Adrian Delia’s claim that a refusal to grant him access to the findings of the Egrant inquiry breached his human rights. Dr Delia had argued before the court that the Attorney General’s refusal to grant him a copy of the full inquiry was discriminatory, seeing that Prime Minister Joseph Muscat and Labour Party officials had been given access to the same inquiry. However, Mr Justice Robert Mangion dismissed Dr Delia’s argument saying the situation would have been different had both the Prime Minister and Opposition leader been subjects of the inquiry, and only Dr Muscat had been granted a full copy of its findings. Dr Delia vowed to appeal the decision. He said the judgement confirmed that the Opposition had a role to play as a public watchdog, “contrary to the Attorney General’s argument that this was solely journalists’ role”.\nFourth Gozo ferry on its way: Gozo Channel is expected to start operating with four vessels in a few weeks’ time, as the company concluded a deal to lease an old ro-ro vessel to join its three current ships making the crossing between the two islands. Maritime industry sources told the Times of Malta that the deal was given the greenlight by Prime Minster Joseph Muscat and the Labour Party was planning to make an official announcement during a partisan activity in Gozo just a few days before the end of the European Parliament and local councils’ electoral campaign.\nClaus-Peter Reisch\nLifeline captain fined €10,000: Claus-Peter Reisch, the captain of the rescue vessel MV Lifeline was fined €10,000 after a court found that the vessel had not been properly registered when it entered Maltese waters after rescuing 200 migrants at sea last June. The court turned down a request by the authorities for the MV Lifeline to be confiscated, on the basis that the vessel was not the property of the accused. A second charge, of using the vessel for commercial purposes without a licence was also rejected.  The NGO Mission Lifeline confirmed it would be appealing, and condemned the judgement as a “disastrous verdict that ignored evidence presented”.\nSlowdown at Freeport as major clients change port: The Freeport is experiencing a significant slowdown in business activity as one of its major clients – Mearsk – decided to move most of its operations from Malta to other ports in North Africa, the Times of Malta revealed. Industry sources said the Freeport’s management informed unions and other clients that the departure of Mearsk and another associated company, MSC, is expected to reduce business at Malta’s container terminal by some 35 per cent by the end of next month.\nActivists demand VGH inquiry over ‘criminal conspiracy’: Three senior government ministers were accused by activists of being complicit in a criminal conspiracy to drain the public coffers as part of the controversial €1 billion Vitals Global Healthcare (VGH) deal. In a 150-page application demanding an inquiry into the VGH deal, activists from Repubblika singled out Finance Minister Edward Scicluna, Tourism Minister Konrad Mizzi and Economy Minister Chris Cardona as key facilitators in the “coordinated” act of modern day “piracy”. In the application, signed by Nationalist MP Jason Azzopardi, they question why the three ministers, who played differing roles in the deal, were so willing to give a “disproportionate” financial advantage to a company with no medical experience.\nValletta man accused of destroying Floriana arch: Extensive CCTV footage and mobile phone localisation placed Bjorn Grima, a 33-year-old taxi driver from Valletta, at the site of the fire that completely destroyed Floriana’s historic arch last month, a court heard. The 120-year-old arch was brought out from storage for the St Publius feast which Floriana was due to celebrate the following weekend. A father-of-two, Mr Grima was charged in court with arson, causing damage to four cars, destroying cultural heritage, defacing a public monument and being a relapser. He pleaded not guilty and was granted bail by Magistrate Audrey Demicoli.\nSliema-born priest to become bishop of city in New Mexico: Sliema-born Bishop Peter Baldacchino was appointed Bishop of Las Cruces, New Mexico, US, by Pope Francis. Mgr Baldacchino was ordained a priest in Newark, New Jersey, in 1996. He was named Auxiliary Bishop of Miami in 2014. The metropolitan area of Las Cruces has a population of 213,233 of whom a quarter are Catholics.\nWhat trended\nA workers’ government?\nThere was much reaction online to the news  that a Rabat resident, Noel Ciantar, had filed a case before the Court of Appeal against a decision by the Planning Authority to grant its own minister, Ian Borg, a planning permit to transform a field adjacent to his rural residence into an outside recreational area including a swimming pool.\nMr Ciantar is challenging the tribunal’s decision on various grounds, particularly on the lack of a fair hearing, as the tribunal denied him the right to produce witnesses to corroborate his objections.\n“The best of times for arrogance and abuse of power,” Pierre remarked.\nTo which Peter added: “A workers’ government. The Labour bigheads are all well off.”\n“That’s why it is good to be a politician which is the best job on the island,” said S.\n“Here is the wealth and power, not in people’s hands,” Victor stated.\nJoseph said that such things were happening because “people are turning a blind eye”.\nP decided to bring partisan politics into the debate and answered: “You will know who is closing a blind eye after the third and largest defeat for the Nationalist Party”, he said referring to the expected loss for the PN in the European elections.\nH was having none of this and told P: “This is not the Champions League, this is about the politicians running our country. Now go back to school; it’s Thursday”.\nJoseph was entirely pessimistic: “Malta has gone to the dogs! Shame on our politicians.” He added sarcastically: “As long as we have a surplus!”\nLetting down pastizzi makers\nNationalist MEP candidate Peter Agius’s claim that the failure to register traditional foods like the ġbejna, mqaret and pastizzi as genuine Maltese products was placing local producers at a disadvantage with their European counterparts was met with a dose of online scepticism.\n“My goodness, really?” J remarked.\n“It’s obviously a Labour plan to get us all to eat socialist foods,” George said.\nD asked for a sense of perspective:  “Well said, Dr Agius.  However, please get your priorities right – we’re facing far greater risks than losing pastizzi or ġbejniet, and I am not aware that you have addressed these – even slightly – yet.”\nJennifer, however, thought such a comment was unfair: “You need to follow him on Facebook, TV and radio. He speaks about tax harmonisation, Erasmus, business, trapping, the public sector and how we can make use of EU to benefit Malta and its people.”\nMark Anthony wasn’t impressed with the whole discussion: “How boring,” he simply said.  \nWhat they said\n\n“We deal with crises more than we anticipate them.”\nLassina Zerbo, executive secretary of the Comprehensive Nuclear-Test-Ban Treaty Organisation, warning Malta not to take its protection from earthquakes and tsunamis for granted.\n“Do not lose heart. Be convinced. I am convinced.”\nNationalist Party leader Adrian Delia addressing party supporters in Mellieħa on the need to send the Labour government a clear message at next week’s European Parliament and local councils elections.\n“We cannot wave a magic wand, but we do have a clear strategy.”\nJustice Minister Owen Bonnici speaking during the launch of the government’s Cottonera strategy.\n“Our ports are, and remain, closed to migrant rescue boats.”\nItalian Interior Minister Matteo Salvini sending a clear message in a tweet, as another migrant stand-off between Malta and Italy appeared to be shaping up.\n\n“After May 25 there will be May 26.”\nPrime Minister Joseph Muscat, replying to a question about his political future, where he first said that he was only focusing on the May 25 elections.\n“This will not go away.”\nArchbishop Charles Scicluna speaking in an interview with The Washington Post about his work as the Vatican’s leading sex crimes investigator.", "comment_count": 0, "id": 3413}, {"keywords": "", "author": "Ivan Martin", "article_body": "Before buying a second-hand car most would ask about its service history, whether it has been involved in any major accidents and how well it has been generally taken care of. Cars come with log books but a diligent car owner also keeps records.  \nAccording to architects, it is about time we are able to do the same when buying a home.  \nThe Kamra tal-Periti is proposing the introduction of what it calls “post-occupancy certifications”, similar to those currently in place for lifts, which would ensure a building’s compliance with regulations and requirements throughout its lifetime.\nThis means that when you buy a property you will know exactly what you are getting, whether it has been properly maintained and is in line with all the requirements – through one comprehensive document. This could even include the original certificates issued when the property was first built and put on the market.  \nA complete overhaul\nThe proposal is just one of a huge dossier compiled by the chamber, aimed at overhauling the mess of laws and regulations governing the construction sector today.  \nPublished on Friday, the document, which is open for public consultation, would see the functions of around two dozen different entities centralised into a one-stop-shop for the sector. \nIt is ridiculous to make the biggest investment in one’s life with limited information at hand\nThis follows the government’s announcement last year that it will be consolidating a number of different authorities involved in policing the construction sector into one comprehensive new office.\nA massive investment, made with limited information\nAccording to the KTP, there is a limit to how much people should be expected to pay for a poorly built property.\nAndre Pizzuto, who headed the chamber’s working group on these proposals, said it was ridiculous that home owners were making the biggest investment they would probably ever make in their lives with limited information at hand. They were often not sure how well the property had been maintained and to what standards it had first been built.  \nLaws that in some cases dated back to the 19th century, such as certain sanitation regulations, were compounded by a convoluted regulatory landscape and the different professionals involved in the sector had varying degrees of training and liability. \nThis, he said, could not remain unchanged as the country steamed ahead towards the development of large-scale projects and high-rise buildings.\nThe consultation document takes stock of the complex legal landscape in Malta and compares it to best practices in countries ranging from Scotland to Malaysia.\nSimplify the system\nIn a nutshell, the KTP is proposing a broad reform of the building and construction regulation regime that covers all areas of the sector in a simple but comprehensive system, catering for small and large projects. \nFor starters, a new system of certification and approved documents would be introduced, including newly written building and construction codes.\nThe role of periti and engineers would be more focused on design, setting of specifications, monitoring works and certifying compliance at completion in accordance with the new codes. Professional liabilities of a number of people involved (architects, engineers, masons, site managers, etc.) would be clearly set out in line with European norms.\nToday masons are still being taught skills in an informal setting, much of which is not compatible with modern day building techniques.\nProject managers, who are meant to monitor progress, are often the person behind the development, with little to no experience in health and safety on construction sites. \nDaily inspections\nThe KTP believes that large projects such as high-rise towers or hospitals should have their engineering works certified by an independent firm not involved in the project to ensure adherence to laws.\nAccording to the KTP, it is also time for new professionals to inspect and monitor construction sites on a day-to-day basis.\nContractors should be registered in a bid to raise quality and standards, something the Developers’ Association has also been pushing for.  \nStreamlined pre-construction processes would have to be carried out, including an independent review of civil engineering inputs such as structural analysis and design, as well as fire prevention and fire safety of major projects and some public buildings. \nAnd a register of independent professional building and construction inspectors will need to be set up. \nThe full list of proposals is available for download on the KTP website www.kamratalperiti.org.", "comment_count": 26, "id": 3414}, {"keywords": "", "author": "", "article_body": "The Sunday Times of Malta reports on the arrest of two men suspected of killing a man in a racially-motivated attack last month.\nThe newspaper also gives prominence to its second European election survey, which suggests Labour’s lead has narrowed but remains commanding.\nThe Malta Independent on Sunday leads with extracts from interviews with Joseph Muscat and Adrian Delia and reports on the arrest of two soldiers for having killed migrant Lassana Cisse.\nMalta Today also focuses on the murder of Mr Cisse, with a headline stating “In cold blood”. The newspaper also teases its own survey, which suggests Labour enjoys a 13-point lead.\nIt-Torċa reports on its own survey results, which indicate a 19.6 per cent lead for the Labour Party, one week before people go to the polls.\nIl-Mument reports that Chris Fearne appeared on Xarabank last Friday against the Prime Minister’s wishes and says tensions between the PM and his deputy are running high.\nIllum dedicates its front page to the racially motivated murder, with a front-page editorial and a large-font headline saying “They killed him because he was black”.\nThe newspaper also says that the PN parliamentary group has not met in two months.\nKullħadd also leads with news of the migrant murder, with a large headline highlighting Joseph Muscat’s call for Malta to “never again” see such a case repeat itself.", "comment_count": 0, "id": 3415}, {"keywords": "", "author": "Anthony Manduca ", "article_body": "The Labour Party still enjoys a big lead over the Nationalist Party, even though the gap has narrowed, according to a second survey commissioned by The  Sunday Times of Malta ahead of next weekend’s European Parliament elections.\nAccording to the poll conducted by Misco, 55 per cent will vote for the Labour Party compared to 40 per cent for the Nationalist Party.\nA similar poll conducted in March showed Labour with 59 per cent and the PN at 37 per cent.\nIn the 2014 European Parliament elections Labour had won 53 per cent of the popular vote to the Nationalists’ 40 per cent.\nThe minor parties can only count on very weak support: both the Democratic Party and Alternattiva Demokratika each have the backing of less than one per cent of voters. In March’s survey they were at two per cent.\nThe survey also showed that 3.4 per cent of voters will vote for the other parties.\n\nProjected 4-2 win\nWith these figures, the Labour Party is expected to win four seats, a gain of one, and the PN two, a loss of one. \nAccording to the survey, the likely four candidates to be elected on the Labour ticket are Miriam Dalli, Alfred Sant, Alex Agius Saliba and Josianne Cutajar.\nThe Nationalist frontrunner is Roberta Metsola. She is followed by Frank Psaila and David Casa – the survey results show these two will have a close battle for the PN’s second seat. Mr Casa’s standing among PN voters has grown considerably since the last poll.\nEditorial: Europe's democratic test\nThe survey also showed that six per cent of all respondents regret the way they voted in the general election of 2017. Of these, 15 per cent said they will vote Labour and 35 per cent PN.\nAs for turnout, 78 per cent of respondents intend to vote on May 25, while 11 per cent are still undecided. The projected turnout is higher than the figure seen in the March survey, likely due to a rise in the number of PN voters.\nWho leads the pack among the candidates?\nMiriam Dalli leads the pack among Labour voters, with 27 per cent of mentions. Twenty per cent said they would be voting for Alfred Sant, while six per cent backed Alex Agius Saliba and three per cent identified Josianne Cutajar. Other candidates received a minimal number of mentions.\nThirty-two per cent of those who intend voting for the Labour Party did not mention a specific candidate.\nAmong Nationalist voters, Roberta Metsola enjoys an equally commanding lead: 26 per cent. Frank Psaila was mentioned by 10 per cent and David Casa by nine per cent. Another two per cent mentioned Peter Agius and the same number named Francis Zammit Dimech.\nThirty-six per cent of those intending to vote for the PN did not mention a candidate.\nAsked about second preferences, 22 per cent of PL voters mentioned Ms Dalli and 13 per cent Dr Sant. Among PN voters, 16 per cent would give their second preference to Mr Psaila, 14 per cent to Mr Casa and 12 per cent to Ms Metsola.\nThe survey also identfied what respondents would base their vote on. Fifty-two per cent said current national issues, 33 per cent stated that it depended on the candidates, 28 per cent on the political parties, while only 22 per cent would base the vote on issues related to the EU.\nThe survey was conducted by MISCO International Limited among a random sample of 402 respondents between May 8 and 11. A sample of 400 provides a margin of error within ±5%.\nFuture leaders?\nIt was the two leading MEP candidates for Labour and the PN respectively who also topped the list of names mentioned by respondents as possible successors to Joseph Muscat and Adrian Delia as party leaders should they step down.\nAmong declared Labour Party voters, 61 per cent did not provide a name. Among those who did, 15 per cent mentioned Miriam Dalli as a possible successor, seven per cent mentioned Ian Borg, five per cent went for Chris Fearne and another five per cent for Robert Abela.\nRespondents were also asked if Dr Delia should resign if his party loses one or more seats in the EP elections. Among declared Nationalist voters, 67 per cent said no, 24 per cent said yes and nine per cent do not know.\nAmong PN voters who either said he should resign if seats are lost or who expressed no opinion, the person with the most mentions as possible successor to Dr Delia was Roberta Metsola. However, 61 per cent of PN voters did not provide a name.\nFloating voters\nNearly four in 10 of all respondents consider themselves to be floating voters. The incidence of floating voters rises as one moves up the age brackets.\nAmong those who intend voting for Labour, 26 per cent consider themselves to be floating voters compared to 37 per cent of those who intend voting for the PN. Half of those who regret the way they voted in 2017 consider themselves to be floating voters.", "comment_count": 112, "id": 3416}, {"keywords": "", "author": "", "article_body": "An elderly couple was mugged in broad daylight in Sliema on Saturday, in a violent incident which left a 91-year-old man grievously injured.\nThe mugging happened on the corner of Triq Nicolo Isouard and Triq Dun Karm and was reported to police at around 7.20pm, a police spokesman confirmed.\nWord of the crime spread on Facebook after details were posted to a Sliema residents’ group.\n“My aunt got mugged outside church today in broad daylight,” a person told the group administrator, who posted on their behalf. “My uncle got punched and fell and got injured. He is in his 90s and she in the 80s. They are still at Mater Dei being checked. Sliema really isn’t safe anymore,” the post continued.\nA police spokesman confirmed that an 87-year-old woman and 91-year-old man, both from Sliema, had been robbed in the area.\nThe mugger got away with jewellery the woman was wearing.\n“It was a Maltese guy and he stole the pearls round her neck,” the relative told the Facebook group administrator.\nThe woman’s husband was shoved as he tried to stop the thief and ended falling to the ground.\nOpinion: Sliema, I love you but I don't like you anymore - Michela Spiteri\nAn ambulance was called to the scene and took him to Mater Dei Hospital. In a statement, the police said that the man had been grievously injured. \n'No longer safe'\n\"It's becoming really scary out here,\" the person posting wrote. \"Old people who go out with their jewellery are an easy target\". \nSliema has been hit by a wave of burglaries in recent months, with police confirming a sudden spike in such thefts in the Sliema and St Julian’s area. In April, Times of Malta reported that thieves were drilling through locks to gain access to homes, in one case even locking a sleeping family in their bedroom as they ransacked their villa.", "comment_count": 0, "id": 3417}, {"keywords": "Gozo", "author": "", "article_body": "A flight of mosaic stairs, made by Għajnsielem residents, was inaugurated by Infrastructure Minister Ian Borg.\nThe project, spread over 12 months, started with the residents making 500 ceramic fish under the direction of Hermine Sammut. These were later incorporated into mosaics. Each of the 47 risers is dedicated to a particular street or voluntary group. On the initiative of Għajnsielem local council, residents joined mosaicist Mary Portelli in making the mosaics, entitled ‘Reflections and Connections’.\nIn making the design, Ms Portelli was inspired by the reflections of the colourful boats found in Mġarr. These multicoloured reflections also represent the vibrant community of this locality and the uniqueness of each person.\n“The Għajnsielem community is co-creator and owner of this artwork as much as the artists themselves. This has led to a sense of local identity and community pride and has served to stimulate the growth of a culturally engaged community,” said the council. Following the enthusiastic participation of Għajnsielem residents, the council set up ‘Team Mosaic Għajnsielem’.\nThis is a living legacy of ‘Reflections and Connections’, which is one of the six projects selected for the Art in Public Spaces programme. The stairs were blessed by Għajnsielem archpriest, Canon Frankie Bajada.", "comment_count": 0, "id": 3418}]