[{"keywords": "Health, Unions", "author": "Claire Caruana", "article_body": "Industrial action at the Mater Dei Hospital maternity department has been called off by the nurses’ union after more than a week which proved to be especially tough for new parents.\nIn a tweet on Wednesday afternoon, Health Minister Chris Fearne confirmed the directives had been suspended, saying that good will had prevailed. No details on the proposals were given by the minister.\n\nThe industrial action was sparked when the hospital management stopped a midwives’ roster that was in place for over eight years. The hospital has now reverted to the old system. \nThe union's industrial action had made it impossible for fathers to stay in the ward overnight when their partners had just given birth. This led to anger among new parents who were livid at the situation, describing it as “inhumane”.\nHospital sources said that in normal circumstances a father could only stay the night if given special permission by the charge nurse, but the facility was given to almost all fathers who wanted to stay. One father was asked to leave soon after his baby was born in the middle of the night.\nMothers also complained about midwives not washing their babies as a result of the action ordered by the union. Instead, the midwives stood nearby and gave them instructions on how to go about washing the new-borns.\nUnion president Paul Pace told Times of Malta the directives were issued after the hospital management changed midwives’ working hours without consultation.\n“There was a roster and the management all of a sudden decided it was time to stop it,\" he said, pointing out some midwives were allowed to continue being part of the old roster.\nFollowing the suspension of the industrial action, Mr Pace said this was not a victory for the union but for the midwives and the services they gave.", "comment_count": 2, "id": 619}, {"keywords": "Police, Gender", "author": "Claire Caruana", "article_body": "Only a fraction of the new recruits joining the disciplined forces are women, Home Affairs Minister Michael Farrugia has lamented. \nOf a total of 56 recruits currently undergoing police training to be able to join the force, just 11 are women. At the Civil Protection Department, only three of the 130 people in training are women. \nThis, the minister said, was in spite of the fact that a number of family-friendly measures were already in place and which should serve to encourage more women to sign up.  \n\"There is no excuse that there aren't enough family-friendly measures in place, because there are. We need to push this message forward because we want people of different sexual orientation [sic] to be part of our different sectors,\" the minister said.\nMinister Farrugia (centre) at Wednesday's press conference. Photo: Matthew Mirabelli\nDr Farrugia made the comments following a visit to the Academy for Disciplined Forces in Siġġiewi. Speaking to those receiving training at the facility, the minister insisted hands-on training was a crucial part of the programme. In-service training, offered to those who were already on the job, was also important as this helped officers with the development of their skills even after leaving the academy, he went on.  \n\"I am very happy with the training that is being given at this academy and I hope that there will be more people coming forward, especially during the upcoming recruitment drive.\" ", "comment_count": 18, "id": 620}, {"keywords": "Accident, Family, Maritime", "author": "Claudia Calleja ", "article_body": "Salvu Grima was a man of many skills and interests. He had a passion for his masonry trade, loved village feasts and fireworks, enjoyed hunting and spent his free time fishing – a hobby that cost him his life – three days after his 71st birthday. \n“My father was very much loved. He was a kind man and he was extremely hardworking. He was a builder by profession and had a passion for masonry. When we’d be driving, he’d stop the car and point out a building that was well-built. He also loved hunting and fishing. We still have fish in the fridge which he caught but didn’t get to clean yet,” said his daughter, Victianne Schembri.\nMr Grima, known as il-Palaw, passed away while fishing in Ċirkewwa on Sunday. He and his wife Josephine had three daughters – Victianne, Natasha Grima and Maria Galea – as well as five grandchildren.\nHe liked fishing in Ċirkewwa, Baħar iċ-Ċagħaq and Comino and usually went with his friend, said Ms Schembri.\n“On Sunday morning he picked up his friend at 4.30am and they went to Ċirkewwa. From what we were told, at about 9am, my father decided to change the line. When he stood up, he fell into the sea. He struggled to remain afloat. \n“His friend, who can’t swim, gave him the fishing rod to hold on to but he didn’t manage. He then managed to pull him up from the belt. My father was still alive. His friend offered him coffee but he said that he was having difficulty breathing. He died in his friend’s arms,” she said.\nShe went on to add that the family had been telling him to slow down. \n“He was hard-headed,” she chuckled, adding: “I have to talk about his negative traits also. \n“He was very disorganised and was always misplacing things at home. But when it came to work, he was always careful. Oh, and he loved Maltese food, like aljotta [fish soup],” she recalled.\n“He was not the type of person who liked kisses and hugs. But he really loved his family,” she said, adding that her father turned 71 on June 20 and attended the Holy Communion of his two grandchildren the day before he died.\nThe irony of it all is that he had a passion for fireworks and fishing. And fireworks are much more dangerous\nHelen Cassar has fond memories of Mr Grima. He was a very close friend of her late father – government explosives expert Costantino Mifsud who died in 1981 when his privately-owned fireworks factory blew up. \nApart from sharing a passion for pyrotechnics and the feast of St Helen, the two men were friends. \n“Salvu was a very reserved man with a big heart and a passion for the feast of St Helen, just like my dad. I still remember the sweet look on his face. I couldn’t believe it when I heard what happened,” Ms Cassar said. \nShe remembers Mr Grima since she was a little girl. Both families would spend the day at the beach together the day after St Helen’s feast. The families even went on holiday together. \n“My father used to like taking us on holiday abroad, in countries where they made fireworks,” she recalled, adding: “Salvu was also the person my father would call whenever something at home needed fixing.\n“I’ll never forget how Salvu and his family were always there for us after my father died.\n“The irony of it all is that he had a passion for fireworks and fishing. And fireworks are much more dangerous. But he died doing what should be a safe, relaxing hobby,” she said. \n“The thing about fireworks enthusiasts is that people ask you: how do you let him do it? It’s what really makes them happy.”\nThe St Helen Band Club and the St Helen Fireworks Factory extended their condolences to the family in separate Facebook posts in which they both recalled the days when Salvu helped out with the fireworks for the village feast.\nClaudio Sant, president of the fireworks factory, said Salvu had not been so involved in fireworks over the past years. However, he loved to help out with organising events and attending them. \nThe funeral will be held on Thursday at 8.30am at St Helen’s Basilica in Birkirkara.\nSalvu Grima had a passion for fireworks and the feast of St Helen.", "comment_count": 3, "id": 621}, {"keywords": "Traffic, Accident", "author": "", "article_body": "A woman was injured on Wednesday when the car she was driving was involved in a crash at the Għaxaq bypass.\nThe accident happened at about 9am and involved a Matiz driven by the woman and a Chevrolet driven by a man from Birzebbuġa.\nThe woman was hospitalised but her medical condition was not known at the time of writing. ", "comment_count": 0, "id": 622}, {"keywords": "Health, Environment", "author": "", "article_body": "Chemicals linked to fireworks are present in tap water but at rates within safety limits, the Water Service Corporation said.\nThe corporation was reacting to recent media reports quoting scientific research by the University of Malta into the presence of perchlorate ‒ a harmful salt used in fireworks ‒ in Malta’s tap water.  \nThe research, conducted by university rector Alfred Vella and chemist Colette Pace, attributed the presence of perchlorate in water to Malta’s use of festive fireworks.\nReacting to the findings, the WSC confirmed that it had indeed found traces of perchlorate, however, these were 50 times lower than the limit set by the World Health Organisation. The level was even lower in tap water, the corporation added, assuring the public that this posed no health risks to the public.\n“The WSC laboratory would like to outline a number of details, primarily that there is absolutely no cause for concern or alarm on this matter,” a spokesman for the corporation said. \nNo health risks to the public\nRegular samples of the island’s water supply are analysed by the WSC at its laboratory in Luqa, with results published online every month. \nThe WSC’s tests show that nearly half – 46 per cent – of Malta’s groundwater sources contained trace readings of perchlorate.\nThe highest concentration of the chemical was 2.7 micrograms per litre.\nThe World Health Organisation says anything less than 50 micrograms per litre is perfectly safe for human consumption.  \nTap water tested by the WSC had an average of 0.7 micrograms per litre.\nThe laboratory employs a team of six scientists, 10 technicians, three samplers and five support staff. \nOn a daily basis they ensure that several samples are collected and analysed from various sources such as reservoirs, pumping stations, village points and reverse osmosis plants.", "comment_count": 27, "id": 623}, {"keywords": "Planning Authority, Joseph Muscat", "author": "", "article_body": "Planning Authority board member Matthew Pace should resign, Prime Minister Joseph Muscat said on Wednesday.\n\"I agree with the minister [Ian Borg] and think he should resign,\" Dr Muscat said in response to a question by Times of Malta.\nPressed to say whether he would go beyond mere words - given that Mr Pace was nominated to the board by the government - the Prime Minister said that he had to respect existing structures.  \n\"We have the rule of law. I can’t just tell an authority what to do. That said, I gave my opinion on what I think he should do, and I think that has certain weight,\" Dr Muscat said.\nMr Pace was found to have a conflict of interest in the db Group's City Centre project in Pembroke - a project he voted in favour of. A court last week said that Mr Pace should have recused himself from that vote, given that he stood to gain from the project being approved through his ownership of a real estate franchise that was selling apartments in the proposed project.\nDespite that, Mr Pace has said he has no intention of quitting the PA board.\nHe believes the court judgment was based on “factually incorrect” information and argues that he had never been given the opportunity to make his case.\n“I always acted in good faith and in a transparent manner,” he said.\nPlanning Minister Ian Borg told Times of Malta on Monday that Mr Pace should “respect” the court decision, though he stopped short of saying that he would sack him.", "comment_count": 56, "id": 624}, {"keywords": "Housing, Joseph Muscat", "author": "Ivan Martin", "article_body": "• One-year minimum contracts for home rentals• Multi-year rental contracts to have increases capped at 5%• Tax credits for landlords who enter long-term contracts• All rental contracts to be registered online • Housing Authority to police the rental market \nMinimum one-year rental periods, caps on price hikes and tax incentives to encourage longer-term contracts, are among the main reforms to the rental market announced on Wednesday.\nThe reform was announced by Prime Minister Joseph Muscat at a press conference and does not include pre-1995 rents.\nGiving a presentation of the reform, lawyer Kurt Xerri said the new law, entitled the Private Residential Leases Act, aimed to ensure stability by introducing a one-year minimum duration on all residential contracts. Dr Xerri helped draft the legislation.\nThree months notice for tenants\nLandlords will have a three-month notice period during which they can tell tenants if their contract will be renewed or not.\nIf a landlord does not inform the tenants three-months before an existing contract ends, then the agreement will be automatically extended for another year.\nIncreases capped at five per cent\nThe government insists that the reform does not impact pricing, which will remain subject to the free market.\nNevertheless, a cap on price increases will mean landlords can only increase rent by a maximum of five per cent from one year to the next in contracts of more than one year.\nThis, Dr Xerri explained, would effectively put an end to exorbitant price increases.\nContract cancellation\nAccording to the reform, tenants will be given the chance to cancel a contract after the first two months, but will have to give one month notice before leaving.\nThis will apply for one-year contracts, with the notice period doubling for contracts of two years and over.\nTax incentives for longer contracts\nLandlords will be eligible for tax incentives when entering into longer term contracts.\nOn one bedroom apartments, landlords of two-year contracts will receive €200 in tax credits, with the figure increasing to €300 for three bedroom apartments, and four hundred for units of three bedrooms and more. These credits will all increase by a further €100 for three-year contracts.\nOn room renting and short lets, the reform seeks to target the grey area of non-resident workers, non-resident students, and non-residents who are not seeking to establish long term residence on the island. On this a set six-month contract period has been established.\nStronger regulation\nThe Housing Authority will now be beefed up to regulate this complex sector.\nIf a landlord does not register a contract online with the authority then they will be will taken to court and face a fine of up to €10,000.\nThe authority may also take landlords before a rent regulation board for administrative issues related to the deposit and rental payments.\nJoseph Muscat addressing Wednesday's press conference. Photo: Ivan Martin\nIn a bid to encourage tenants to report landlords who refuse to register contracts, the authority will force their landlord to enter into a three-year contract at 75 per cent of the market value, to offer tenants security.\nAn adjudicating panel for private residential leases, made up of legal experts, will decide on issues such as minor damages to property and appliances, on the back of written applications by landlords.\nWhen it comes to water and electricity bills, landlords will now have to include tenants on their ARMS forms.\nARMS will no longer interrupt provision of water and electricity in cases of payment disputes between tenants and landlords.\nEvictions\nOn evictions, there will be a right for landlords to demand payment for the period that tenants remain in the property during the dispute.\nTo date, landlords often have to take tenants to court to receive this payment. \nAmnesty period\nThe reform is expected to come into force by January of next year. And the government will be announcing a short amnesty period to allow landlords to come in line with the new regulations.\nHousing Parliamentary Secretary Roderick Galdes said the government did not want to maintain the status quo, nor did it want to introduce cosmetic reforms for a sector that was so desperately in need of an overhaul.\nThis new law was based on “unprecedented” research and consultation, which was why all stakeholders were now onboard, he said.\nJustice Minister Owen Bonnici said the reform not only closed loopholes, but gave both tenants and landlords new rights.\nDr Muscat on his part said the reform addressed a lot of issues facing Maltese people today. While some 80 per cent of Maltese were homeowners, there was to date a jungle when it came to the rental market.\nThe government had tried to address the disproportional impact that the unreliability of the rental market was having on some people’s lives.\nThe reform he said, could not be seen in a vacuum, and came on the back of a number of other initiatives aimed at helping people become homeowners, others on equity sharing, and efforts when it came to social housing.\nOne of the main changes he said was the clamping down on excessive price increases.\nTill today, tenants faced a situation where they feared their rental rates increasing astronomically.", "comment_count": 64, "id": 625}, {"keywords": "Tourism, Police", "author": "Claire Caruana", "article_body": "Efforts to have police officers present in certain tourism hotspots fizzled out after only a year, it has emerged, despite the government hailing the project “a success” and promising to expand to Gozo.\nReplying to a question in Parliament by Nationalist Party MP Jason Azzopardi, Home Affairs Minister Michael Farrugia said that the project’s implementation had ended in 2017. \n\nThe project, he said, had been implemented by the Tourism Ministry. \nTwo years ago, some 41 police officers had completed specialised training that enabled them to carry out rounds in Sliema and St Julian’s. The officers had at the time gone through several weeks of training at the tourism institute as well as at the Police Training Academy in Ta’ Kandja. \nDr Zammit Lewis announcing the launch back in 2016. Screenshot: Twitter\nIn 2017, Foreign Affairs Minister Carmelo Abela, who at the time served as the minister responsible for the police, had hailed the pilot project “a success” and, as a result, government officials were in the process of exploring whether it could be extended. \nThe plan, he had said at the time, was to also introduce such officials in Gozo. Edward Zammit Lewis, then Tourism Minister, had pointed to the increase in the number of people visiting Malta, saying this added burden meant more officers were required to “keep the peace and fight crime”. \nRELATED STORIESTourism police project 'a success' - minister\nNo public announcement was ever made that the project had been stopped.\nAsked why the project was dropped after a year, despite it being heralded a success, a spokesman for the Tourism Ministry said that currently, there is an “ongoing review on the results of this pilot project”. \n\n“The Ministry for Tourism and the Ministry for Home Affairs and National Security are in discussion to design a more effective scheme. \n“In this regard, all stakeholders will be consulted on the matter before the scheme is launched,” the spokesman said. \nReplies to questions by Times of Malta on how many officers were involved in the project and when it would be relaunched remained unanswered.", "comment_count": 16, "id": 626}, {"keywords": "Construction, Architecture", "author": "", "article_body": "Updated Wednesday 8.24am \nControversial revised construction site rules came into force on Tuesday amid complaints by the Chamber of Architects that they will fuel confusion and do little to improve public safety.\nBut the Malta Developers Association said the rules help to clarify many existing anomalies.\nIn a two-line statement issued by the Department of Information, the director of the Building Regulations Office said the new regulations were in force with immediate effect.\nSpeaking on Monday, Infrastructure Minister Ian Borg said architects will be responsible for ensuring excavation and demolition works followed proper procedures. He said the main change would be the creation of site technical officers who would replace site managers.\nThe Chamber of Architects voiced its disappointment: \"The Kamra tal-Periti is of the opinion that the Legal Notice does little to guarantee public safety primarily because it further confuses the responsibilities on site. This, coupled with the fact that the requirement for registration and licensing of contractors has not been brought into force, results in a situation where effectively the site technical officer is being made to bear the shortcomings of the government to regulate the sector,\" the chamber said on Wednesday. \nThe new regulations came about after a spate of buildings collapses linked to adjacent construction works. \nFollowing the last collapse in Mellieha this month, Prime Minister Joseph Muscat announced a two-week moratorium on excavation and demolition works pending the publication of new construction rules. \nA five-day consultation period followed. The short timeframe for this consultation raised the ire of the Church's environment commission. \nThe Kamra tal-Periti (Chamber of Architects) said the legal notice was published without prior consultation with the Chamber as required by law, and questions it had sent Dr Borg remained unanswered.\nThe Chamber said it had consistently insisted that responsibilities should be clearly and unambiguously defined in the interest of public safety. Any regulation that purports to contradict the Civil Code is only contributing to the confusion that has characterised the industry in the last decades.\nIn terms of the civil code, the perit is responsible to design, specify and direct the works to ensure that the building is safe. The contractor is responsible for executing the works, including following the design, specification and direction of the perit. It is up to the contractor to decide the composition and qualifications of his personnel to fulfil his responsibilities. This is the norm in developed countries.\n\"The Kamra believes there is a third responsibility that needs to be borne, and that is the responsibility to regulate. This responsibility can only be borne by Government. To date, Government has failed to fulfil its duty to regulate the industry adequately,\" the chamber said.\nThe Building Regulation Office was left severely underfunded for years, with a meagre annual capital budget of €150,000, which was barely equivalent to the salary of six of its employees, rendering it effectively powerless and ineffective.The BRO had not put in place a system for registration and licensing of contractors. This exposed the public to inordinate levels of risk. \nThe planning process was never clearly separated from the building regulation process, resulting in institutional confusion and inadequate enforcement.\nThis confusion was further exacerbated when the Planning Authority (PA) issued two circulars on Tuesday evening about the Legal Notice.\nInstead of the government investing in developing the BRO’s IT infrastructure, the PA had taken over the implementation of the new regulations from the remit of the BRO, and extended its online planning application system for this purpose.\n\"This is exacerbating further an already confusing situation. No centralised building and construction regulations in line with those of other European Member States are in place. The few that are in place are contradictory or obsolete and fall under the remit of over 22 public entities.\"\n\"The Kamra tal-Periti is of the opinion that the Legal Notice does little to guarantee public safety primarily because it further confuses the responsibilities on site. This, coupled with the fact that the requirement for registration and licensing of contractors has not been brought into force, results in a situation where effectively the site technical officer is being made to bear the shortcomings of the government to regulate the sector,\" the chamber said. \nDevelopers' reaction\nThe Malta Developers Association said the new regulations 'help to clarify many existing anomalies related to the different responsibilities in the construction industry.'\n\"Before these new regulations, owners or developers could engage anyone, competent or incompetent, to carry out works, even against the express advice and discretion of the architect responsible for the works.\n\"In this scenario, while the MDA agrees that site managers who represent the contractor on site have to be technically qualified persons, they need not necessarily be a warranted perit,\" the MDA said.\nIt added, however, that the construction industry urgently needs an immediate, more radical change that would include the setting up of a development council empowered to licence rock excavators and demolition contractors. These responsibilities are not currently regulated in any way, and anyone (whether qualified or not) can today take up contracts for such work.\nThis change would also set up a register of approved developers, something that the MDA had been suggesting to the authorities for a number of years.", "comment_count": 24, "id": 627}, {"keywords": "Planning Authority, Pembroke", "author": "Ivan Martin", "article_body": "Planning Authority board member Matthew Pace yesterday said he would not resign despite a court decision which found he had a conflict of interest in the Pembroke project.  \nSpeaking with Times of Malta, Mr Pace said the court had made it “very clear” that his business involvements did not preclude him from continuing in his role at the Planning Authority.\n“Judgements are there to be quoted in whole not in part. I therefore will not be tendering my resignation from the PA board,” he said. \nOn Monday, Infrastructure Minister Ian Borg urged Mr Pace to respect the court’s decision.  \nRELATED STORIESNull and void - Manuel DeliaFine dining for dogs - Mark Anthony Falzon\nMr Pace’s involvement in the City Centre project was first revealed shortly after the authority approved it.\nThe board member, an entrepreneur, is a franchise owner of Remax Alliance Swieqi, which shared a database and website with Remax Malta. The agency had been selling apartments that were part of the db project at a time when no planning permit had yet been granted, The Shift News had reported.  \nAs a Planning Authority board member, Mr Pace had voted in favour of the project, with the vote being approved by 10 votes to four.Matthew Pace. Photo: Facebook\nLast week, a court nullified that decision, also finding that Mr Pace should have recused himself. \nThroughout this process I always acted in good faith\nReplying to a series of questions, Mr Pace said the court judgment “appears to have been based on evidence given by third parties which in my opinion is factually incorrect”. \nHowever, he gave no further explanation on this, saying only that he would clarify further at “the opportune moment”.\n“I will therefore refrain from expressing my views on this judgment other than pointing out that I was never a party to this case, was never invited to testify and therefore it is evident I was subjected to judgment without having been given an opportunity to clarify my position,” he said.\nMr Pace said he would respect this judgment – ostensibly by not voting on this particular project.\n“On a final note, my business involvements were disclosed in full as per standard procedure.  This shows that throughout this process I always acted in good faith and in a transparent manner,” he said.  \nThe responsibility to ask for a board member’s resignation rests with the minister responsible. However, Dr Borg has said only that he expected the businessman to heed the court’s ruling when pressed on the matter.  \nAnd, as the authority grapples with the court ruling, so too was db Group’s owner Silvio Debono. The tycoon last week told Times of Malta he was considering his legal options. Sources said, one possibility could see the businessman take legal action against the authority.", "comment_count": 50, "id": 628}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers. \nTimes of Malta and Malta Today report how a petition calling for a confidence vote in PN leader Adrian Delia was signed by more than 200 party councillors and presented on Tuesday.\nTimes of Malta also quotes Matthew Pace saying he will not resign from the board of the Planning Authority. A court last week found that Mr Pace had a conflict of interest when he voted on the db project application, and the permit was therefore revoked. \nThe Malta Independent leads with comments by a recovering drug addict that he is still facing problems, but hopes to work with Caritas one day. Developments in the PN are carried as a secondary story. \nl-orizzont reports that the State Advocate will be appointed by September following enactment of the law hiving off some of the powers currently enjoyed by the Attorney General. It also reports that specifications for road tarmac are to be changed.\nIn-Nazzjon says Neville Gafa' was present for a recent meeting with a Libyan government delegation during which visas were discussed. Mr Gafa' had been at the centre of a storm over alleged visa irregularities but denied involvement. The newspaper also highlights comments by the Chamber of Advocates that new construction site regulations were drawn up hastily ", "comment_count": 0, "id": 629}, {"keywords": "European Union, Daphne Caruana Galizia, Justice, Joseph Muscat", "author": "Jacob Borg", "article_body": "A damning report into government corruption and the assassination of journalist Daphne Caruana Galizia is set to face its final hurdle at the Council of Europe on Wednesday. \nOne source in the Council of Europe said the government had been ramping up its lobbying efforts against the report ahead of Wednesday's plenary session in Strasbourg. \nThe report, compiled by Dutch MP Pieter Omtzigt, points a finger at Prime Minister Joseph Muscat for offering his chief of staff Keith Schembri and Tourism Minister Konrad Mizzi “total impunity” under his personal protection. \nIt concludes that the rule of law in Malta is seriously undermined by the extreme weakness of its system of checks and balances. \nRule of law weaknesses in general and the criminal justice system in particular were linked in the report to Ms Caruana Galizia’s assassination after a car bomb in October 2017. \nIt concludes that the rule of law in Malta is seriously undermined\nThe report highlights how the three men suspected of setting off the bomb have still not been put on trial, with their custody limit close to expiring. \nMr Omtzigt has found himself in the middle of government efforts to discredit the report and its author. According to the government, the report is “riddled with inaccurate and gratuitous statements” exposing a very biased agenda which is not based on the true picture of the matter. \nLabour MP Manuel Mallia, who represents the government in the Council of Europe, spearheaded a failed attempt last year to get Mr Omtzigt replaced as rapporteur. \nDr Mallia also saw the mini EU summit held in Malta earlier in June as “fertile ground for lobbying against Mr Omtzigt’s report”, a leaked Whatsapp chat revealed.  \nLast month, the former home affairs minister presented over 40 amendments to the report. He had sought to delete critical passages referring to the government and water down references to Mr Schembri and Dr Mizzi. \nDr Mallia’s amendments were roundly rejected by a Council of Europe committee.", "comment_count": 84, "id": 630}, {"keywords": "Parliament, Family, Gender, Crime, Police", "author": "Luke Scicluna", "article_body": "An increase in fines which could be levied from perpetrators is being proposed in amendments to the Criminal Code and the Gender-Based Violence and Domestic Violence Act.\nThe amendments would also prohibit the filming of sexual acts without the consent of the person being filmed, among other changes. \nThey would allow for the gradual payment of damages to allow the victim to get what they deserved without financially crippling perpetrators. \nThe law as amended would give the police an automatic obligation to institute proceedings against a suspect - without the need for a complaint to be made by the victim - where they were made aware of a potential offence. It was also being clarified that the sexual history of victims where this was unrelated to cases should not affect these proceedings.\nEquality Minister Helena Dalli introduced the amendments in Parliament on Tuesday, a year after Malta’s implementation of requirements arising from the Istanbul Convention had “sent the message that violence within our homes is not acceptable”.\nThe law introduced in 2018 was comprehensive, innovative, the starting point for a widespread discussion. She lamented “fearmongering” comments which had been made by members of the Opposition when the law was originally debated.\nThe amendments proposed for an evaluation of the law as it was put into practice and discussion with members of the judiciary, social workers, the police, and all who touched upon the phenomenon of domestic or gender-based violence.", "comment_count": 0, "id": 631}, {"keywords": "Construction, Parliament", "author": "Luke Scicluna", "article_body": "Many Maltese were unaware of their legal obligations relating to health and safety, Opposition MP Marthese Portelli told Parliament on Tuesday.\nSpeaking in the second reading of the debate amending the Occupational Health and Safety Authority, Dr Portelli said that often, they did not know that anybody commissioning a development project had to engage a project supervisor for health and safety, and that the buck stopped with the person commissioning this development, not with the contractor.\nShe referred to the OHSA’s registry of competent persons, and asked whether this was exhaustive and publicly accessible.\nThe amendments would extend health and safety regulations to the disciplined corps, which are currently exempt.\nMinister Helena Dalli said various discussions had been held with these bodies and the Armed Forces were already engaging project supervisors for construction projects, even though health and safety regulations did not yet apply to them.\nDr Portelli asked for information on the sort of filtering carried out when persons registered themselves as “competent”. She questioned why the government felt it necessary for a competent person to be responsible for health and safety on projects for which it issued a tender, but not for all projects including private projects.\nFollowing Tuesday’s publication of new regulations governing excavation and construction works, Dr Portelli added that it was an opportune moment to carry out a similar exercise with respect to health and safety regulations.\nShe called for the introduction of an accredited training requirement as an alternative to attendance training. Even in this sector, employers were obliged to ensure that adequate training was being provided to employees.\nThe OHSA should insist upon adequate training and resources for every employee, she said, but if the government wanted the authority to function properly, it needed to provide it with the necessary human resources.\nConsidering that 10,500 permits had been approved by the Planning Authority in 2018, the OHSA should be carrying out at least 10,500 on-site inspections, but there were insufficient personnel for this to be possible.\nWhere possible, automation should be employed to maximise resources, such as in cases where the necessary documentation was not promptly filed by developers or contractors.\nOpposition MP Beppe Fenech Adami said the country had recently regressed when it came to health and safety. He read out a list of accidents which had been reported in the media since November 2018, calling these accidents a “certificate” of the country’s failure in the sector.\nQuestioning why so many workers were suffering injuries on construction sites, he said it was obvious that the construction frenzy which had gripped the country was to blame, and that the regulations which existed were not being enforced.\nWorkers were not being sufficiently trained, and it was no excuse to blame them for refusing to use safety equipment. They needed to be encouraged to respect themselves and others by using the proper equipment without this having to be enforced, he said.\nOpposition MP Toni Bezzina said residents had almost become afraid of living in their homes, a situation resulting from the fact that the government had dragged its feet for years. The construction boom had started six years ago, but the government had failed to anticipate what would be needed on the level of regulation and enforcement.\nThe director of the Building Regulation Office had stated that he wished to do more to combat current problems, Mr Bezzina said, but there were insufficient resources for this to be possible. Officers entrusted with enforcement were “toothless”.\nMr Bezzina criticised the government for not consulting architects before publishing new regulations governing the construction industry on Tuesday. He called for a safety net to be put in place to assist those suffering damages to their homes as a result of works neighbouring their homes.", "comment_count": 9, "id": 632}, {"keywords": "Accident, Police, Żebbuġ (Malta)", "author": "", "article_body": "A 65-year-old man from Żebbuġ was grievously injured on Tuesday when he fell off a ladder while carrying out some works at a residence in his home town \nThe police said the accident happened in Triq Frans Sammut at 2pm.\nThe 65-year-old man was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 633}, {"keywords": "Society, Gender, Human rights, Employment", "author": "Sarah Carabott", "article_body": "After 20 years of suffering domestic abuse, Valerie* left home without any belongings but burdened with the belief that she was good at nothing.\n“I was unemployed and felt worthless. My former husband would often challenge me: where are you going to get the money from to survive without me?” she recounted.\nHer reality changed, however, when she stumbled across a group of women in similar circumstances to her – and who were starting a social enterprise aimed at opening the door to gainful employment.\n“I realised I was living a lie,” Valerie said. “Only now am I finding out what my strengths are,” she said ahead of the launch of the social enterprise Meraki.\nMeraki will be hosted in a hub run by domestic violence survivors at a townhouse in Tarxien which is being refurbished. The first of its kind in Malta, the hub is an initiative of the SOAR service, which is provided by the Jeanne Antide Foundation.\nValerie is one of the first women to start benefitting from the start-up. \nShe said she never really knew that she was being abused – she had been brought up in a “dysfunctional family and an abusive environment”. She felt like the scapegoat child, where her feelings were never validated, and she thought she was escaping abuse when she married her husband. He turned out to be just like her parents.\n“Since that was the only kind of love I knew, I believed that that was my cross to carry and that I didn’t deserve to be loved in any other way,” she said.\nOnly now am I finding out what my strengths are\nHis continuous psychological abuse made her feel worthless and full of shame. And as the abuse was mostly emotional, it was hard to quantify or prove, so she always felt that no one would understand her. She resorted to being submissive because she thought he sounded more credible than she did. \nHowever, over the years her mental state started leading to physical ailments. \nValerie made her move the moment she realised how much her two children were suffering. She realised that history was repeating itself and it was her responsibility to provide them with mental stability and a safer environment. \n“I had remained with him as I was brought up with the mentality that I should keep the family together and that when I seek support I would not be believed.”\nInstead, when she sought help she received validation. As the months rolled by she started to realise that the traits he used to put her down for were actually her strengths. For some time, she experienced withdrawal symptoms: she describes the abuse as a “rollercoaster addiction”.\n“You literally get trapped, it’s a vicious circle. Just like drug victims, a domestic abuse victim could suffer highs and lows, often feeling depressed and helpless. \n“The abuse continues after you leave, but I’m recovering and healing slowly and the children are flourishing as well.”\nShe has found a family in SOAR, and Meraki is slowly unravelling the damage of years of constant abuse that made her believe she was not good at much.\nShe believes that Meraki’s flexible work opportunity and her own new worldview will open doors for her personal growth. \n*name has been changed.\nSurvivors are already getting hands-on sales and marketing experience. Photo:  Soar Malta\nPutting your spirit in your work – Meraki\nGearing up for the launch of the social enterprise later this year, the women are currently receiving mentoring to prepare a robust business plan. \nCurrent training is focusing on management, with mentoring in computer literacy, marketing, administration, customer care and book-keeping in the pipeline. \nSurvivors are already getting hands-on sales and marketing experience during wedding fairs and open-air markets. So far, the women have been trained in manufacturing bath and body cosmetics, wax products and party favours. \nThe proceeds are reinvested in the enterprise and in SOAR, meaning that customers who choose Meraki for wedding favours, party souvenirs or corporate gifts are supporting the economic independence of the survivors who make them, Elaine Compagno, who leads SOAR, explained. \nChoosing to support Meraki could help companies fulfil their Corporate Social Responsibility targets. \nIt would also support the sustainability of SOAR, a service by and for female survivors, ensuring that it can continue providing support to survivors for free.\nMeraki won the ENISIE National Social Innovation Award when it was proposed as a solution for flexible and supported jobs that enable survivors to enter the labour market. \nIt was awarded with 40 hours of mentoring and access to an innovation hub.\nIt was also shortlisted for the Malta Social Impact Awards, which is offering another 12 hours of mentoring. \nLook up the Facebook page called Meraki – The Home of Kind Krafts, Instagram handle@soarsurvivorshub or call on 2180 9011, 2180 8981 or 2767 2367 for more information.", "comment_count": 0, "id": 634}, {"keywords": "PN, Elections, Politics", "author": "", "article_body": "Two nominations have been received by the Nationalist Party to fill the vacant post of administrative council president. They are from Graham Bencini and Carmelo Mifsud Bonnici.\nThe post became vacant following the resignation of David Stellini, who left Malta to resume his old job in Brussels.Another two nominations were received for the post of executive committee president. They are from Graziella Attard Previ and Alex Perici Calascione. This post used to be held by Mark Anthony Sammut, who resigned to assume responsibility for the heavy PN defeat at the European and council elections.\nCharles Selvaggi was nominated for the post of treasurer. The previous incumbent, David Camilleri, had quit after becoming embroiled in controversy over a cooption vote for the seat vacated by Mr Stellini.\nThe elections will be held on Thursday, July 4 during an executive committee meeting.", "comment_count": 0, "id": 635}, {"keywords": "Economy, Environment, Youth, France", "author": "", "article_body": "French President Emanuel Macron has vowed to drive forward projects suggested by civil society members from the north and southern shores of the Western Mediterranean, the result of an initiative he first put forward in January 2018.\nA number of projects proposed by Maltese civil society members are among the 14 major ones which were eventually chosen from a list of 270 following a three-month-long process.\nThe projects were submitted by delegations of 10 people, each chosen by the governments of the 10 countries on the north and southern shores of the Western Mediterranean – Algeria, Morocco, Mauritania, Libya, Tunisia, Malta, France, Italy, Portugal and Spain – covering five different categories, ranging from culture to youth and the environment.\nEach category was tackled at a different forum – that for youth, education and mobility was hosted in Malta in April – with the 60 shortlisted projects scrutinised further in Tunis a few weeks ago.\nThe final stage of the process was held in Marseille on Monday in the presence of foreign ministers from the 10 countries, where it was given the seal of approval by Mr Macron.\nThe 'family' photo on the steps of the Pharo Palace in Marseilles.\nPresent for the event were representatives of supporting entities which will play a major role in the financing and implementation of the projects: the World Bank, the European Investment Bank, the European Bank for Reconstruction and Development, the OECD, the European Commission and the Anna Lindh Foundation.\nThe projects will focus primarily on creating a circular economy for food and their production, smart cities with an emphasis on medinas, energy with an emphasis on climate change, and youth empowerment.\nOne example is finding uses for waste from olive oil; another is using blockchain to help solar energy connections between producer and user, rather than routing all transactions through centralised distributors.\nWhat set this initiative apart was its focus on civil society, as the head of the steering committee, Nobel Peace Prize winner Ouided Bouchamaoui, pointed out.\nThis point was also picked up by the head of the Maltese delegation, Ambassador Simone Borg, who told Mr Macron during a panel discussion that many politicians talked about empowering civil society but he had “walked the talk”.\nMr Macron said that his vision had been to recreate the joined history of the region, emphasising that the problems caused by migration stemmed from the inequality between the two shores and the way that Africa had been overtaken by the interests of “big countries”.\n“It might take a lot of time to achieve but at the end it is all about dreams,” he told the audience, which included Foreign Minister Carmelo Abela and Ambassador to France Helga Mizzi.\nIn his intervention, Mr Abela called for the need to “seize this opportunity to open up space for youth-led initiative in the region, saying: “Youths are not the leaders of tomorrow but the leaders of today”.\nMr Macron plans to convene another submit in six months time in order to evaluate the progress made on the project, which should by then have been given more structure.\nDetails of the Maltese delegation are included in the pdf link below.", "comment_count": 0, "id": 636}, {"keywords": "Adrian Delia, Politics, PN", "author": "Philip Leone Ganado", "article_body": "Updated 5pm with additional detail\nA petition signed by 200 Nationalist Party councillors calling for a vote on leader Adrian Delia's leadership was presented to the administration on Tuesday afternoon.The signatories want the General Council to convene within a week, PN councillor and former election candidate Ivan Bartolo told reporters before presenting the petition.\"We need to wake up and protect our democracy. Nobody is bigger than the country or the party.\"\nNo MP involved\nNo MP signed the petition, Mr Bartolo said, stressing that parliamentarians had other avenues to make their views known.\"In the absence of change, status quo will prevail,\" he said, adding that the current situation was a danger to the survival of the party and the democracy.“If we do nothing, there is a risk that there will shortly be no party - or democracy - left to save. We would have lost both and ended up with a one-party state.”\nMr Bartolo speaks outside PN headquarters. Video: Chris Sant Fournier\nMr Bartolo said the current leadership had burned its bridges with large swathes of the electorate, and was headed towards an even greater defeat at the next general election. He insisted that the issue was not one of factions or cliques - stressing that he had been among the first to support Dr Delia - but of safeguarding the party. \nCalls to resign\nDr Delia has been faced with calls to ask for a vote of confidence ever since the party's drubbing in the May European and local council elections. In a Talking Point on Monday, Mr Bartolo revealed that he was the first to sign the petition.\nIn the petition, PN general council president Kristy Debono is being asked to convene the general council for the vote.\nCounter-petition\nThe petition has taken the PN into uncharted territory, with supporters of the embattled leader arguing the party's statute has no clear provisions on how to unseat Dr Delia.Mark Anthony Sammut, who recently resigned as president of the executive committee and accompanied Mr Bartolo in presenting the petition, refuted these arguments. He said the statute was clear that the General Council was obliged by statute to discuss any issue once asked to do so by at least 150 councillors. “We are not here to elect a leader; we are here for the General Council to express itself on whether it has faith in the current leadership,” he said. Those opposed to a confidence vote, he said, were entitled to bring their own motion for discussion, but not to prevent a discussion from taking place. Also present were Emma Portelli Bonnici, secretary-general of the party’s youth wing; Martin Musumeci, vice-president of the professionals’ forum; and Emvin Bartolo, a local councillor and district representative.", "comment_count": 117, "id": 637}, {"keywords": "Planning Authority, Environment, Swieqi", "author": "Keith Micallef", "article_body": "Objecting to developments falling short of planning policies has become a waste of time and funds, as they are nonetheless getting approved by the Planning Authority, according to the Swieqi council.\nConsequently, it will no longer be engaging the services of two architects who had been commissioned to vet every planning application being submitted within the boundaries of the locality.\nSpeaking to Times of Malta, Swieqi mayor Noel Muscat expressed “shock” at the manner in which the Planning Authority was handling applications especially those in areas outside the development zone. \nFaced by the threat of overdevelopment, the council had engaged two architects, whose remit was to file an objection or appeal the issuance of a permit if it was felt it was not in line with planning laws. \nRELATED STORIESSwieqi council says Halland complex extends into ODZDevelopers go to court over Wied Għomor rejectionHowever, the council decided to halt this initiative after being told that it was “a waste of time”. \nTimes of Malta spoke to Anton Valentino, one of the two architects engaged by the council.\n“The Planning Commission, the board which decides on planning applications, is not forthcoming at all as its members are more often than not unwilling to consider or even listen to anything put forward from the objectors, particularly in ODZ applications,” he said. \nMr Valentino cited a recent application for the conversion of a two-room dilapidated building in Wied Għomor into a three-storey villa with swimming pool. \n“The board was not even prepared to consider objections from the Environment and Resources Authority, from the PA case officer himself, from the Superintendence of Cultural Heritage, from the Heritage Advisory Committee and from various other objectors including other local councils or eNGOs,” he remarked. \nThe architect took issue with the Commission’s attitude saying it was tantamount to that of somebody who looks down on the “save the environment nonsense”. \n“The provisions laid out in Planning Authority policies dealing with development in ODZ areas are regularly stretched and twisted in order to facilitate construction which goes beyond the spirit and letter of these policies,” he said. \nConsequently, he felt that these meetings had become a waste of time and the council’s money.\n“Attending is a futile exercise. We are getting absolutely nowhere with the commission as the decision to grant a permit in ODZ land will have normally already been taken,” he said. \nAs expected, the Planning Authority refuted such claims. \n“All decisions that are taken during public hearings, all stakeholders are given the chance to speak. \n“The commission’s members receive the DPAR (the report about each application) at least 10 days before the public hearing, giving each member enough time to understand and review the case,” a spokesman said.  \nAs for the case cited by architect Valentino, the Planning Authority said the application had been recommended for refusal by the case officer, but the board members expressed a provisional opinion to overturn the recommendation and the decision was deferred to a subsequent meeting.  \nThe spokesman noted that in both instances, all the interested parties were given the time to express their objection.  \n“This particular application was approved unanimously because it was compliant with the Rural Policy and Design Guidance,” the PA said.", "comment_count": 23, "id": 638}, {"keywords": "PN, Adrian Delia, Politics", "author": "Keith Micallef", "article_body": "Backers of Adrian Delia have launched a counter-petition seeking to prevent the Nationalist Party leader from facing a vote of confidence in the party’s highest organ, the general council.\nCiting various provisions in the party’s statute, the pro-Delia supporters are insisting that the general council may not make decisions regarding the election of the party’s leader and two deputies.  They argue that the statute only allows the leadership to be contested within three months of a general election.\n“The leader was chosen by the party members and nobody has the right to change that decision. This is not allowed by the statute and would not respect the members’ will, democracy and the rule of law,” the counter-petition says.\nThe petition calls on general council president Kristy Debono to reject a request for a no-confidence motion, which is expected to be presented in the coming hours. \nRELATED STORIESNo way for Delia to be ousted, his backers argue\nPN critics of Dr Delia began circulating a petition over the weekend calling for the leader to be subjected to a confidence vote within the general council.\nTheir calls are based on a separate statute provision, which states that the general council can “decide on any proposal put forward by no fewer than 150 members”. \nThe disagreement, which stems from the fact that the PN has no clear provisions on how to unseat a leader, further adds to the state of confusion within the PN.\n“Collective responsibility”\nApart from asking the general council president to disqualify the no-confidence motion, the pro-Delia faction is saying that responsibility for last month’s double electoral drubbing should be shouldered “collectively”.\nWhile acknowledging that a split party stands no chance of winning an election, they accuse “certain MPs” of putting spokes in the leadership’s wheels since day one of Dr Delia’s election as leader and of not accepting the democratic will of party members.\n\nThese MPs, the pro-Delia faction believes, has leaked parliamentary group proceedings to the media and rushed to take certain positions which at times conflicted the party’s official line.\nThe counter-petition states that despite Dr Delia offering a hand of friendship, these MPs have persisted in their attempt to destroy the party and foment unrest.\nFurthermore, the counter petition points fingers at “pseudo-bloggers and pseudo-NGOs”, accused of running a systematic campaign against Dr Delia, which ultimately led to the electoral setbacks.\n“The same people who were behind the 2013 electoral thrashing and who were sidelined by party members in 2017, are the hidden hand behind these manoeuvres,” they said.\n“Dr Delia was elected on the pledge to bring about change, and nobody has the right stand in the way for this to happen,” the counter-petition reads.\nIn view of this the pro-Delia faction is calling for “all necessary measures” against all MPs and party officials who do not toe the party line and refuse to work with Dr Delia, to prevent them “from causing further harm”. The conduct of this group is putting the party’s future in jeopardy, they warned.\nThey are also for an effort to reach out to those who had abandoned the party as a result of the attitude of those “who wanted to remain in control of the party at all costs”.\nMoreover, they are calling for the necessary changes so that the party becomes a winning one. This is not a case of business-as-usual, the counter petition says.\nRead a copy of the petition in the pdf below", "comment_count": 62, "id": 639}, {"keywords": "Banking, Crime", "author": "", "article_body": "Bank of Valletta warned on Tuesday that some customers are receiving fraudulent text messages in an attempt to get their banking details.\nThe SMSes inform customers that suspicious activity has been noted on their internet banking and redirects them to a false website purportedly originating from the bank.\n\"The bank advises its customers that this is a phishing SMS message that is not being sent by BOV. Customers are urged not to click on the link or input any details and to delete the message,\" BOV warned.\nIt said it never requests any personal customer information such as 24x7 login credentials, PINs, credit card details, account numbers, passwords or any other information such as email, telephone or other means of communication. \nFor further assistance, customers may contact the bank’s customer service centre on 2131 2020 or by email on customercare@bov.com.", "comment_count": 1, "id": 640}, {"keywords": "Kerċem, Environment, Planning Authority", "author": "Philip Leone Ganado", "article_body": "A decision on a proposed fireworks factory in fields outside Kerċem has been put off once again over an issue with the plans.The application, which has been recommended for approval despite staunch opposition from residents and nearby farmers, has been repeatedly postponed since February awaiting clearance from the Explosives Committee, which has since granted its go-ahead.But at a heated Planning Commission hearing on Tuesday, attended by numerous objectors, the board noted that the planned factory’s emergency exits opened onto farmers’ properties and instructed the project architect to amend the plans. Farmers argue that the factory, proposed in a designated agricultural area close to the hamlet of Santa Lucija, would limit access to their fields and prevent them from working due to the dangers associated with it. They also expressed fears over the possible contamination of their land by perchlorates from fireworks, and said the area, outside development zones, was characterised by indigenous trees and plants which would be harmed by the project. The Kerċem local council, the Environment and Resources Authority and eNGOs are also objecting to the project.", "comment_count": 1, "id": 641}, {"keywords": "Crime", "author": "Edwina Brincat", "article_body": "A former police sergeant and long-serving security officer for ambassador Richard Cachia Caruana has been handed a suspended sentence for falsifying the signature of the former representative to the EU to obtain undue overtime payments.\nMark Camilleri, 49, pleaded guilty to a number of charges linking him to fraud, whereby he falsified the signature of the high-ranking official who was to authorise his overtime payments.\nThe former policeman also admitted to making a false declaration as a public official and giving false information to a public authority.\nFollowing a plea bargaining exercise, the former sergeant entered a guilty plea and was handed a two-year jail term suspended for four years, besides being ordered to refund €5000, the defrauded sum.\nMr Cachia Caruana, who also served as personal assistant to then Prime Minister Eddie Fenech Adami, was assigned a security detail after being stabbed outside his home in 1994.\nA request for a ban on the publication of the accused’s name was turned down by the court, presided over by Magistrate Joseph Mifsud.\nLawyers Vince Micallef and Roberto Montalto were defence counsel.\nInspectors Rennie Stivala and Bernard Bunce prosecuted.", "comment_count": 0, "id": 642}, {"keywords": "Court, Crime, Drugs", "author": "Edwina Brincat        ", "article_body": "The girlfriend of alleged drug kingpin Jordan Azzopardi scribbled down a series of questions to put to a witness in an attempt to stop him from testifying, a court was told on Tuesday.\n“Do you have WhatsApp so I may contact you since it’s safer that way?” the woman had allegedly written on the paper she was to hand over to a third party, who would in turn relay them to a former customer of Mr Azzopardi.\n“What did you spend at Pieta’?” [referring to a Pieta’ property targeted in one of the drug raids in the build up to Mr Azzopardi’s arrest], she had also written, adding: “If he gives you €10,000 you will not testify.”\nThe questions were to be given to Luke Vella, a former customer of Mr Azzopardi’s, prosecuting inspector Mark Anthony Mercieca told the court on Tuesday.\nRELATED STORIESCocaine-hooked chef recalls beating by Jordan Azzopardi and his henchmenSuspected footsoldier of alleged drug kingpin taken to court\nMr Azzopardi’s girlfriend, a mother-of-five, was arrested and charged after Mr Vella had spilled the beans about the alleged bribery attempt when taking the witness stand in the drug compilation on June 13.\n“I'm speaking out because I've had enough. They've been threatening me even up until last week,” the man had said under oath.\nThe woman and Mr Azzopardi had exchanged two calls while in custody, the inspector told the court. The first was on June 6, when the two had named a person who was to be approached. The following day, the woman had informed Mr Azzopardi that the targeted party had been approached.\nRELATED STORIESMoney was hidden inside shower walls, court told'I had a fit... but nobody called for help\nAirbnb plans\nOn Tuesday, a young man arrested during one of the raids at a Marsa farmhouse and currently serving time behind bars explained how he had planned to convert a Pieta’ property formerly belonging to his grandmother into an Airbnb rental property.\nMr Vella was to be his partner in that venture, but their plans had gone up in smoke when Jordan Azzopardi walked into the picture and they all ended up arrested.\n“I was at the wrong place at the wrong time,” Lee Jonathan Borg rued at the start of his testimony.\nJust one week before his arrest, Lee Jonathan Borg had been approached by Mr Azzopardi. He wanted to rent the Pieta’ residence for a person who was “homeless.”\nThe two struck a deal for €700 a month, Mr Borg stated today under oath, explaining how he had asked his aunt to collect the payments from Mr Azzopardi.\n“I had no idea of what went on inside the place,” Mr Borg said, shedding little light when asked directly by the prosecution about calls which he had made to Jordan from prison. \nHis aunt, whose name was banned under court order, also took the witness stand on Tuesday. She identified Mr Azzopardi, who was sitting in the dock, as the man she had met in Gżira a few times, always in the evening. He would sometimes be accompanied by a woman - the co-accused – she said.\nThe aunt told the court how she had received small payments running up to around €400 and said that, after hearing on television about the raid at the Pieta’ premises, “it stopped there.”\nThe compilation continues next month.\nInspectors Mark Anthony Mercieca and Justine Grech prosecuted.\nLawyer Anne Marie Cutajar from the AG’s Office also prosecuted.\nLawyers Franco Debono and Amadeus Cachia were counsel to both accused.\n ", "comment_count": 0, "id": 643}, {"keywords": "Environment, Mellieħa", "author": "", "article_body": "2019 has seen some remarkable records for breeding birds of prey in Malta, with Gozo and Comino showing the great potential that the islands offer for the comeback of a number of species, Birdlife said on Tuesday.\nIt said the Peregrine Falcon has been noted breeding again along Malta’s southern cliffs with young birds seen in flight in mid-May.\nCommon Kestrels have also bred in two locations in Gozo, with fledgedyoung being noted during the first week of June.\nA pair of Short-eared Owl bred successfully again on Comino with the fledgedyoung seen on May 14, in what is a successful second breeding record in recent years.The Barn Swallow has this year had a record breeding success on Gozo wherebirdwatchers observed at least 32 breeding pairs in different villages, all of which are being monitored on a regular basis \nAnother important successful breeding attempt recorded this year was that ofa female Spotless Starling with a male Common Starling (Sturnell) that choseComino as their home. Spotless Starling is a rare bird on the Maltese Islandswith the last record being a bird sighted in October 1947!\nVarious birds associated with water bodies also made the most of thisyear’s abundant rainfall – Għajn Riħana and Chadwick Lakes saw a goodnumbers of Reed Warblers and Moorhens showing a dire need for protectionof these rich biodiverse areas which are still impacted by hunting.\n\"If designated as bird sanctuaries, these areas could offer further breeding successes such as Little Bittern and other crakes,\" BirdLife said. Nature takes its course if it is undisturbed\nBirdLife Malta Conservation Manager Nicholas Barbara said that wherever left undisturbed, nature took its course, and these breeding records were testimony to that.\nBirdLife Malta Nature Reserves Manager Mark Gauci said that given the right habitat and adequate protection, birds would breed in Malta and the nature reserves managed by BirdLife Malta have been proving this year in year out.  \n\"Breeding success rates can only be boosted if the government trulyunderstands what conservation values really stand for. The most logical way inwhich to ensure birds continue to breed unhindered in Malta, and to increasetheir numbers, is to safeguard their breeding habitats and to make sure thatthey are protected during the breeding season\" \nBirdLife said there will be a special open day at its reserve in Għadira on Saturday, June 29 between 7am and 10am free of charge, with no booking necessary.\nVisitors will be able to admire two pairs of Black-winged Stilts that successfully hatched four young each.\nThese elegant birds have been breeding – on and off – at the reserve for the last nine years.", "comment_count": 11, "id": 644}, {"keywords": "Crime, Traffic, Court", "author": "", "article_body": "Maximillian Ciantar has been jailed for a year for falsely claiming he was the victim of excessive force by the police.\nIt is the latest run-in with the law by the man from Marsa, who has had a string of traffic-related convictions, most notably for running over two young girls in Attard back in 2010. \nMr Ciantar is already in prison, serving a nine-month term which was confirmed on appeal last February. \nDuring Tuesday's sitting, Magistrate Joseph Mifsud said the effective jail term of one year was the maximum the court could impose.\nBut he rapped the prosecution for having put the wrong date on one of the charges, meaning that Mr Ciantar could not be found guilty of another charge that he had fabricated evidence against another person.\nMr Ciantar was however acquitted of a third charge of breaking the conditions of a previous court sentence, because the copy of the sentence handed down by the court was not accompanied by proof of identity of the accused by the prosecution. \nRELATED STORIES‘Near maximum’ sentence for running over two girlsMaximilian Ciantar to serve 9-month jail term for thwarted robbery\nThe court heard how Mr Ciantar was arrested on May 28, 2018 in Qormi for driving without a licence - his licence having been withdrawn by court order. \nWhile he was under arrest, he tried to injure himself to give the impression that he had been beaten by the police.\nWhile in the police car, he started shouting out that he was being beaten up. He started twisting his hands in handcuffs in an effort to cause a fracture and while he was at Ħamrun police station, he started banging his head against a wall, until he was stopped by officers. \nYet during a strip search, when police noticed some scratches on his body, he refused to be taken to a health centre and it was instead agreed that the injuries would be noted in the records book.\nThe court said it was satisfied that the police had only used minimum force during the arrest, and this only after Mr Ciantar refused to cooperate.  \nDespite the evidence, the court said it could not find Mr Ciantar guilty of fabricating evidence to frame other people because the prosecution in the charge sheet had given the date of the incident as  September 28, 2017 and not May 28, 2017. Nor had any request for a date change been made during the proceedings.\nRELATED STORIESMaximilian Ciantar jailed over road rage incidentMaximillian Ciantar jailed for driving without a licence\nThe court, however, found Mr Ciantar guilty of making a false report when he claimed to have been beaten up by the police while he was being arrested. Mr Ciantar was well aware that what he was claiming had not in fact taken place, so much so that he had refused to be taken to a health centre. \nThe court noted the evidence by several officers that it was actually Mr Ciantar who had strongly resisted arrest, with officers needing to struggle with him until he was handcuffed.  Medical certificates showed that Mr Ciantar only had scratches. There was no sign of the kicking which Mr Ciantar claimed he had suffered.\nIn handing down the maximum sentence in could impose for filing a false report, the court pointed out that such a false report could have given rise to criminal proceedings against innocent persons and possibly ruined their careers.\nThis country could no longer tolerate a situation where, on the pretext of free speech, people's careers were potentially destroyed.\nThe court said it also felt it should defend the police when they did their duty.", "comment_count": 0, "id": 645}, {"keywords": "Commerce, Maritime", "author": "Matthew Xuereb", "article_body": "The Baltic Container Terminal (BCT), operated by a Maltese company since the 1990s, is investing €30 million over the next three years to consolidate its position as the main recipient of goods in the region. \nSituated in Riga, the capital city of Latvia, the terminal is the only dedicated facility in the region. BCT is operated by Hili Company, whose subsidiary, Mariner, took over full shareholding in 1999 and has never looked back. \nChief executive officer Edward Hili told journalists on a recent media trip to tour the facility that the company is investing in an additional 200 metres of quay space to be able to receive larger container ships.\n \nIt had also ordered a brand new crane, to add to the four the terminal already has and which will be delivered in 2020. \nMr Hili said the BCT has the capacity to handle up to 450,000 containers a year. The facility handled 292,000 containers in 2018, slightly lower than the record 303,000 of the previous year. \nCovering an extensive area of 55 hectares, the facility has good hinterland connections by both road and rail, delivering goods mainly to neighbouring Russia.\nThe entire daily operations are monitored through the state-of-the-art control system called Navis N4. It also has a fully-automated gate security, with photographs taken of each container and truck arriving at the terminal. \nThis information is available in real-time for the clients to track their cargo.  \nThe BCT has the capacity to handle up to 450,000 containers a year\nThe company also offers its clients a warehousing facility, with an additional 11,000 square metre warehouse which is expected to be finished within a few months, bringing up the total of warehouse space to 42,000 square metres.\nThe warehouse is planned to be the distribution centre for the Baltics, Russia and Central Asian countries. \nMr Hili said the quay extension project, expected to start early next year, will increase the quay by 50 metres, bringing its total length to 500 metres. Dredging works are also planned to increase the depth to 14 metres, to be able to accommodate larger ships. These works, he said, will allow BCT to simultaneously handle two vessels of 225 metres in length. \nThe new BCT warehouse project.\n“This year, the company acquired a warehousing complex in the Riga airport territory, Elipse, which includes 4,000 metres of office space. There are three large warehouses with 12,000 pallet spaces with products ranging from pharmaceutical products to furniture, air conditioning units to alcohol,” Mr Hili said.\nHe explained that Hili Company is an international group of companies mainly rooted in the shipping industry. It, however, has subsidiary companies in energy, real estate and yacht repair, as well as a yacht marina. \nApart from the terminal in Riga, the company has also operated the Terminal Intermodale Venezia in Venice, a joint venture with MSC, since 2003.\nThe facility has good hinterland connections by both road and rail.\nThe Elipse office complex.", "comment_count": 5, "id": 646}, {"keywords": "Health, Family, Childcare", "author": "Matthew Xuereb", "article_body": "Fathers of children born at Mater Dei Hospital are livid at directives issued by a union banning them from staying overnight at the hospital with their newborns.\nThe directives, which have been in force for more than a week, were issued by the Malta Union of Midwives and Nurses after the Mater Dei management “unilaterally” put a stop to a roster which had been in place for more than eight years. \nThe directives exclude the possibility of the father staying overnight when their partners have just given birth. \nHospital sources said that in normal circumstances a father could only stay the night if given special permission by the charge nurse, but the facility was given to almost all fathers who wanted to stay.  \nUnion president Paul Pace told Times of Malta that the directives were issued after the hospital management changed midwives’ working hours without consultation.\n“There was a roster and the management all of a sudden decided it was time to stop it. I had members who ended up with a three-hour break rather than clocking off earlier. \n“The worst thing about it is that some midwives were allowed to continue being part of this roster while others were not and we wanted an explanation from the management. When we didn’t get it, we issued directives because this is unacceptable,” he said. \nNot allowing husbands to stay during the night is inhumane\nHe continued: “While MUMN is always available for any meetings, it cannot allow such injustices and such discrimination at the place of work to be the order of the day. It is clear for MUMN that midwives were not treated equally and fairly.”\nBut couples took to social media to complain about the hardship that such a directive had on them. \n“I gave birth at 12.35am. I was tired and unable to walk on my own. My husband was asked to leave. This impacted me very badly. Being in such a state and having to look after a new-born on my own. \n“While I understand the importance of directives, not allowing husbands to stay during the night is inhumane. I hope you all realise the psychological effect this is having on mothers,” the woman wrote. \nA spokeswoman for the Health Ministry confirmed that the directives were impacting husbands and partners staying the night while other relatives had the official visiting hours cut by an hour. \n“The directives are impacting relatives’ visiting hours. The ministry is engaged with the union to address the current impasse and the consequent inconvenience on hospital users,” she said without entering into the merits of the dispute.", "comment_count": 28, "id": 647}, {"keywords": "Valletta, Events", "author": "", "article_body": "The Malta International Arts Festival (MIAF) starts on Friday and continues until July 14, presenting a diverse programme of events at various locations across the island as well as on a Turkish gulet out at sea. It is produced by Festivals Malta.\nThe festival kicks off with a joint concert by the Malta Philharmonic Orchestra and the Malta Youth Orchestra under the direction of conductor Darrell Ang. The programme includes music by Borodin, Lecuona, Psaila, Shostakovich and Vaughan Williams. It will be held at Pjazza Teatru Rjal, Valletta, at 9pm.\nOn Saturday there will be a vibrant programme of percussion ensemble, string quartets and circus arts at Ta’ Liesse, Barriera Wharf (near the old fishmarket), Valletta, at 8pm.\nOn Sunday, Ilħna Mediterranji (Mediterranean Voices) – a double-bill programme from two award-winning choreographers, Jacopo Godani and Jorge Crecis – will be performed by the national dance company ŻfinMalta. It will be held on the main stage at Boat Street, Il-Fossa, Valletta, at 9pm.\nThe Malta International Arts Festival will take place between Friday and July 14. Booking is open for this Friday and Sunday’s events; the Saturday event is free. For tickets and to view the festival’s full programme, visit www.festivals.mt/miaf.", "comment_count": 0, "id": 648}, {"keywords": "Crime, St Paul’s Bay", "author": "", "article_body": "Updated 3.36pm\nA search is underway for the suspect who slightly injured a man with a knife during an argument in St Paul's Bay late on Monday.\nThe police said the search was in the Qawra/Buġibba area and urged anyone who had information to contact them.\nThe victim, a 58-year-old from Macedonia, was admitted to Mosta health centre at about 9.30pm after having been injured during an argument in Pioneers Road.\nMagistrate Gabriella Vella is holding an inquiry. \n \n ", "comment_count": 5, "id": 649}, {"keywords": "Construction, Architecture", "author": "Jacob Borg", "article_body": "Architects have requested an urgent meeting with infrastructure minister Ian Borg about new construction rules set to come into force on Tuesday.\nChamber of Architects president Simone Vella Lenicker lamented in a letter sent to Dr Borg that the updated regulations had not even been forwarded to them. \n\"On behalf of the council, I must admit that your statement and answers left us with a number of questions which we feel require an answer prior to the publication of the Legal Notice\", the letter said. \nDr Borg unveiled the new rules during a press conference on Monday. \nAmong the changes is a requirement for architects to act as site managers in certain circumstances, meaning they will be responsible for ensuring excavation and demolition works follow proper procedures.\n“The word responsibility is at the centre of everything we are trying to achieve here and everyone needs to shoulder their own responsibility in this sector\", Dr Borg said. \nIn the letter, the Chamber of Architects put a series of 26 questions to the minister about the regulations. \nAmong other things, it noted that according to the minister's statement in parliament on Monday, the architect in charge of the project is to prepare amethod statement, the site manager is to enforce it, and the contractor is to follow it.\n\"Isn’t the STO (site manager) part of the contractor’s setup? Aren’t they one and the same in terms of the Civil Code?\n\"Has the register of contractors been published? And if not, how is the owner’sobligation to employ competent persons going to be safeguarded without sucha register and classification?\"\nRead the full letter and all the questions by clicking on pdf below.\nThe new regulations came about after a spate of buildings collapses linked to adjacent construction works. \nFollowing the last collapse in Mellieha this month, Prime Minister Joseph Muscat announced a two-week moratorium on excavation and demolition works pending the publication of new construction rules. \nA five-day consultation period followed, although the short timeframe for this consultation raised the ire of the Church's environment commission. ", "comment_count": 54, "id": 650}, {"keywords": "Fire, Accident, Għargħur", "author": "", "article_body": "A horse and a ram were rescued from a fierce grass fire in fields behind the McDonalds restaurant in Għargħur late on Monday.\nThe blaze broke out at about 10.45pm in St Catherine Street.\nThe police and firefighters from the Civil Protection Department were on the scene.\nNo one was injured but the ram appeared to be in poor condition and was seen falling in the street.", "comment_count": 0, "id": 651}, {"keywords": "Police, Gżira, Drugs", "author": "", "article_body": "Three Maltese were arrested after suspected cocaine was found in a residence in Gżira, the police said on Tuesday.\nThe raid was carried out on Sunday evening, when items related to drug abuse were also found in the house in Triq il-Kubrit.\nThe three are aged between 25 and 40. \n ", "comment_count": 0, "id": 652}, {"keywords": "Government, Joseph Muscat", "author": "Ivan Camilleri", "article_body": "Updated at 6.25pm, adds PN statement\nNeville Gafà, the controversial official employed by the Office of the Prime Minister, has again refused to explain his role and presence in a government diplomatic mission to Tripoli last week.\nMr Gafà, who was sacked from his job by Deputy Prime Minister Chris Fearne, following similar unexplained visits to Libya, told Times of Malta that explaining his visit to Tripoli was “a waste of time”.\nContacted after he had failed to reply to questions sent by e-mail last week, as per his request, Mr Gafà insisted he had nothing to say.\n“I have no time to waste in explaining anything,” Mr Gafà said when reminded about his promised replies.\nThe Prime Minister’s spokes-man is also avoiding explaining Mr Gafà’s latest trip.\nAsked to explain Mr Gafà’s current role within the OPM, what he was doing on an official Maltese delegation in Libya and whether he was representing the Prime Minister, Dr Muscat’s spokesman failed to reply, des-pite various reminders.\nTimes of Malta is informed that the Maltese delegation discussed sensitive security and intelligence issues during the various meetings it had with high Libyan officials.\nApart from Malta’s Ambassador to Libya, Carmel Saliba, who led the discussions, the delegation included the Armed Forces of Malta’s Head of Operations, a director general from the Foreign Ministry and Mr Gafà. \nA Labour Party activist, Mr Gafà has been hitting the headlines since Labour was returned to power. He was put on the government’s payroll as a person of trust soon after Labour was returned to power.\nHis name had cropped up in investigations connected to the issue of medical visas to Libyan refugees though he never faced criminal charges.\nLast year, while on a €50,000 contract at the Foundation for Medical Services, given to him by Minister Konrad Mizzi, Mr Gafà made the headlines after Libyan news agencies reported that he was having talks with Libyan ministers on behalf of the government.\nHe had also claimed that a meeting with a militia leader in Libya was coincidental since he had “bumped into him on the street”.\nAt this point, the Deputy Prime Minister sacked Mr Gafà and ordered his Foundation for Medical Services contract to be rescinded.\nHowever, a few days later, Mr Gafà was seen working at the OPM, reportedly as a person of trust of Prime Minister Joseph Muscat.\n‘People have the right to know’\nPeople have a right to know the reason why Mr Gafà, who had been fired from his role in the Foundation for Medical Services following his first trip to Libya, was accompanying Mr Saliba, the Nationalist party said.\nRELATED STORIESNeville Gafà fired by Health Minister Chris Fearne\nIt called for an immediate public declaration explaining Mr Gafà’s presence, adding that the government should always be transparent.\nThe PN said it was wrong not to explain Mr Gafà’s presence in light of the importance that the country has always given to diplomatic relations with Libya. \n“Diplomatic relations with Libya should not be tainted because of this incorrect behaviour,” it said.", "comment_count": 58, "id": 653}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday.\nTimes of Malta reports that there is confusion about whether the PN statute allows a no-confidence motion to be moved against the party leader. \nThe Malta Independent says the president of the PN council has not received the petition calling for the no-confidence vote. In its main story, however, the newspaper reports how a Maltese company is expanding a container terminal in Latvia. \nIn-Nazzjon says the government has voted against a PN amendment in parliament for babies in the womb to be granted protection.\nl-orizzont gives prominence to the publication of new construction site rules. It quotes minister Ian Borg saying the purpose is to protect the people. The newspaper also reports concerns by author Trevor Zahra that many in the service industry in Malta do not speak Maltese. In another story, the newspaper also highlights concerns that women reporting abuse to the police are not finding protection.", "comment_count": 0, "id": 654}, {"keywords": "Gaming", "author": "Claire Caruana", "article_body": "More than 1,000 gamblers have asked to be banned from casinos and other gaming parlours in an attempt to break their habit. \nA spokesman for the Responsible Gaming Foundation said the self-exclusion requests have been on an upward trend in recent years. \nGamblers can ask to be barred from land-based casinos and gaming parlours for a period of six months, a year or even indefinitely. \nAccording to the spokesman, for a person to admit and accept that he or she has a gambling problem is very often not an easy feat and this process usually takes “a lot of time”.\nAlthough there were many who, year after year, continued to choose to be on the list, there were also those who managed to break the habit, no longer needing to be excluded. \nRELATED STORIESVillage gaming parlours experiencing 'stratospheric' rise in young visitorsMaltese residents spent €128 million on gambling in 2017\nThis year has seen an increase in the number of calls to the National Gambling Helpline, 1777, launched in 2015, the foundation’s spokesman said.\nOne reason could be the fact that the helpline was now manned at all times, even at night, when it seemed people tended to feel more comfortable calling, he said.\nThe majority of the callers were relatives and friends of the gamblers, though there was also a significant number of people who called the landline because they themselves had a gambling problem.\nThe majority of the callers were women, he added.\nAccording to the latest report commissioned by the Malta Gaming Authority, which analysed gaming trends in 2017 and based on the official population statistics, Maltese residents spent a total of €128 million on gambling activities. \nThese were mostly directed towards games administered by the national lotteries.\nThis amounts to nearly 200,000 individuals over 18 years who declared spending about €11.30 each per week on gaming activities.\nThe survey by the Malta Gaming Authority also showed that there are around 4,000 gamblers at risk of having severe gambling problems.", "comment_count": 6, "id": 655}, {"keywords": "Waste, Environment, St Paul’s Bay", "author": "Ivan Martin", "article_body": "Environment Minister José Herrera has requested an urgent meeting with the St Paul’s Bay local council to discuss the town’s rising tide of litter.   Minister Herrera wants to meet the town's council. Photo: Chris Sant Fournier\nIn a tweet, Dr Herrera said “serious action has to be taken on the littering problem… this has to stop!” \nThe meeting is expected to be held this week. \nHis statement came just a few hours after Times of Malta published residents’ complaints of littered streets in the St Paul’s Bay-Qawra area. \nGarbage bags and cardboard boxes of all sizes brimming with waste have been piling up in street corners and all sorts of litter, including glass and plastic bottles and cans, are being strewn along pavements. \nBulky waste, like old sofas and other pieces of furniture, were also being dumped on the streets, while open areas had been turned into makeshift scrap yards.  \n“Is this how we are expected to live?” a resident of Triq it-Tamar, Qawra, had said.\n\nYet another resident sent in a video of the doorstep dumping that surrounded her as she strolled through Triq it-Turisti, Triq l-Imsell, Triq Mazzola and Triq Halel, all residential neighbourhoods. \nWhen contacted, outgoing mayor Anne Fenech said she was fully aware of the appalling situation and that the council had been trying to tackle the problem for months.\nRELATED STORIESIs this Malta's filthiest street?\n“We’re doing our best but some of the residents here are not cooperating,” Ms Fenech told the paper. \n“Some people still take out their garbage at night while others do so after the rubbish has been collected.”\nThe local council urged residents to make an effort to comply with the recycling scheme and called for more effective enforcement. \nMeanwhile, the council is in talks to have the rubbish collected more often.", "comment_count": 52, "id": 656}, {"keywords": "Planning Authority, Court, Politics", "author": "Ivan Martin", "article_body": "Planning Authority board member Matthew Pace should “respect” a court decision which found he had a conflict of interest, Infrastructure Minister Ian Borg said on Monday.\nThe minister was asked by Times of Malta what action would be taken after a court decided that Mr Pace had a conflict of interest in the controversial db Group City Centre project in Pembroke.“Well, I haven’t received any resignations whatsoever. I always say that everyone, be it me myself, the government, the public, or anyone, should always respect any court decision, even Matthew Pace,” he said.\nThe responsibility to ask for a board member’s resignation rests with the minister responsible. However, Dr Borg said only that he expected the businessman to heed the court’s ruling when pressed on the matter.\nMr Pace is a franchise owner of Remax Alliance Swieqi, which was selling apartments in the City Centre project even before the planning permit had been granted, The Shift News had revealed. \nAs a Planning Authority board member, Mr Pace voted in favour of the project being approved, with the vote being approved by 10 votes to four.\nLast week, a court nullified that decision, finding that Mr Pace had a conflict of interest and should have recused himself. \nPA biding its time\nMeanwhile, PA head Johann Buttigieg said the authority was still deciding what course of action to take following the court's decision. There was a window of time in which the PA could decide what to do in such a scenario, and the authority intended to make full use of that window, he said. Sources in the authority told Times of Malta that the court ruling opened a Pandora’s box of problems.\nRELATED STORIESDirector of penalised company is a court expert\n“There are huge ramifications for us here. What if other applications start facing issues of conflict of interest? Then there is this particular case, involving db, what is going to happen with this project? This could have implications that effect the whole sector,” a senior source in the PA said. As the authority grapples with the court ruling, db’s Group’s owner Silvio Debono is doing much the same. The tycoon last week told Times of Malta he was considering his legal options. One possibility, sources said, was that the businessman would opt to take legal action against the authority.", "comment_count": 37, "id": 657}, {"keywords": "Planning Authority, Kerċem, Agriculture", "author": "Philip Leone Ganado", "article_body": "Farmers working the fields outside Kerċem fear their livelihoods and health could be at risk if the Planning Authority green-lights the construction of a commercial fireworks factory at a hearing on Tuesday. More than 30 farmers have written to the PA arguing that the factory, proposed in a designated agricultural area close to the hamlet of Santa Lucija, would limit access to their fields and prevent them from working due to the dangers associated with it. Farmers also expressed fears over the possible contamination of their land by perchlorates from fireworks, and said the area, outside development zones, was characterised by indigenous trees and plants.The development application had been rejected by the PA in October last year, after the Malta Air Traffic Services (MATS) lodged an objection due to the proposed vicinity to its navigational aids, which it said would create a risk to aeronautical safety. However, this objection was later withdrawn after the MATS confirmed that its concerns had been addressed, and the developers won a planning appeal forcing the case to be returned to the PA to be reassessed. The proposal has now been recommended for approval, with the Planning Commission expected to announce a decision on Tuesday morning.\nRELATED STORIES'Dangerous and undemocratic': Għarb fireworks factory approval slammedFireworks factories get public funding for safety and infrastructure\nThe factory is still facing opposition from environmental groups Din L-Art Ħelwa and Nature Trust, as well as the Kerċem local council, which presented a petition signed by 1,200 individuals objecting to the project. Objectors say the development would endanger Kerċem residents as pyrotechnic material would be transported through the centre of the village.They also argue that the factory would harm efforts by the local council to promote the area’s cultural, natural and historical value, such as the heritage trail in Santa Lucija. The tiny hamlet was awarded a European Tourist Destination Certificate of Excellence in Intangible Heritage by the European Commission in 2015. The Environment and Resources Authority (ERA) is also objecting to the project due to the take-up of rural ODZ land. The authority said construction would mean the loss of traditional terraced fields and rural characteristics, apart from the factory’s visual impact. However, the PA case officer concluded that the project was in line with relevant policies - once the air traffic safety issues were addressed - and did not lie within a scheduled or protected area. The case officer also noted that the project was some 600 metres away from the nearest buildings in Santa Lucija, and 200 metres away from an approved agro-tourism, beyond the 183 metre buffer zone set by law.", "comment_count": 4, "id": 658}, {"keywords": "Court, Crime", "author": "Edwina Brincat ", "article_body": "A man who forced open a fuel station machine in the dead of night ended up pocketing just €3.20 from his theft, a court heard on Monday.\nDennis Cremona, 43 and with no fixed residence, admitted to having using a series of screwdrivers to forcefully open a machine at a Ta’ Xbiex service station in the very early hours of Sunday morning.\nThe machine yielded just €3.20 but his actions caused much more in damages, prosecuting inspector Joseph Xerri told a court before he exhibited various screwdrivers officers had confiscated from Mr Cremona. Defence lawyer Joseph Brincat filed a guilty plea on behalf of his client, whom he had assisted in previous cases when Mr Cremona had fallen foul of the law, and who had drug and health problems.\nThe recent loss of a son in a workplace incident had “destroyed him further,” the lawyer informed the court.\nWhen making submissions on punishment, Inspector Xerri observed that, unlike previous occasions, the accused had given clear signs of willing to enter rehabilitation.\n“At 43, he’s finally on the road to get his life back on tracks,” the Inspector remarked.\nIn the light of the charges and upon the accused’s own admission, a jail term was mandatory, the Court, presided over by magistrate Gabriella Vella said.\nMr Cremona was sentenced to a nine-month prison sentence and recommended that the man be afforded all necessary help to enter rehabilitation.\nThe man’s defence counsel informed the court that there would be no appeal.", "comment_count": 0, "id": 659}, {"keywords": "Construction, Architecture", "author": "Ivan Martin", "article_body": "Updated 6.30pm with ministerial statement\nArchitects will be responsible for ensuring excavation and demolition works followed proper procedures under revisions to construction laws, Infrastructure Minister Ian Borg announced on Monday. Dr Borg announced the contentious reform of the regulations governing excavation and demolition works at a press conference, saying the changes would come into force from Tuesday. The main change, he said, would be the creation of site technical officers who would replace site managers.To date, site managers had technically been responsible for ensuring works followed approved plans. However, complaints have arisen that these were not warranted professionals, and could even be the contractors themselves with no technical expertise whatsoever.RELATED STORIESStand your ground when reporting unsafe construction sites, architects toldHow to dig ourselves out of a hole - Chris Mintoff\nTechnical officers to replace site managers\nDr Borg said the new site technical officers would replace site managers and they would have to be warranted architects. They would have to be on site when works are ongoing.\nHowever, they would not have to be the same architect that drafted the plans on the project, and could be appointed by the contractor.“The word responsibility is at the centre of everything we are trying to achieve here and everyone needs to shoulder their own responsibility in this sector,” he said. The government, Dr Borg said, was shouldering its responsibility by legislating, “even if the reform is tough”.\nThis did not mean the government could satisfy everyone. In fact some might be unhappy with this added responsibility.\nIf some do not want to meet their obligations, they know what to do\n“If an architect doesn’t want to do this, they can chose not to. But we will not allow a situation where developers are working on a site without the supervision of a warranted professional,” he said, later adding that this would not go down well with the Chamber of Architects who had already expressed concerns.If there were “some” who did not want to meet their obligations, they knew what to do, he said pointedly. Asked if he expected the Chamber of Architects to strike, as had been floated at a recent meeting of professionals, Dr Borg said the ball was in their court. The public, he said, wanted professionals to meet their responsibilities.\nWriting on Facebook, former Chamber president Chris Mintoff said the new legal role of site managers was simply a smoke-screen for contractors' legal and moral obligations, and that the law would only invite more carelessness.\n\"That architects should become complicit in the carelessness of contractors and workers that he did not engage by baby-sitting them is a level of insanity I never thought possible,\" he said. \"This law will bring only less peace of mind, security, and far more expenses.\"\n'Radical changes'\nThe minister then went on to detail the “radical changes” when it came to method statements for excavation works, insisting the reform would not allow this document to be vague and unstructured as it was at present. The new legal notice, which will be in Tuesday's Government Gazette, includes schedules that detail how the method statement should be drawn up. \nThis document was sent to the Building Regulations Office and simply filed away. “We wanted the system to be more transparent. The current situation is not transparent at all,” he said. The document will now be uploaded to the Planning Authority’s map server, meaning the public could now access this detailed document online. A 15-day window will allow any concerned parties to appeal and give input on the works to be done and the methods to be used. The reform will also map out the condition report, which is meant to detail the current state of the site and the neighbouring properties. This would also have to be drafted by a warranted architect.All construction sites, Dr Borg said, would have to comply with the new rules once the legal notice was published tomorrow. In closing, Dr Borg said the legal notice was just a small part of the reform that needed to be carried out to bring the industry up to scratch.“This is not the entire reform. And I am making this statement in view of some who said this was being rushed,” he said.Some, he added, may have preferred the government to remain silent following the incidents of building collapse.\nThe thriving construction industry has sparked a crisis.\n'We could not keep waiting for accidents to happen'\nDelivering a ministerial statement in Parliament later on Monday, Dr Borg said the changes were part of a long-term effort to reform legislation surrounding the construction industry which had started months earlier, he said, but had been sped up because the government could not stand by and watch accidents happen.\nHe clarified that project architects would not be prohibited from serving as site technical officers themselves. Rather, the new rules mandated that, were an architect to decide against taking on this responsibility himself, his delegate would have to be a warranted architect.\nOpposition Leader Adrian Delia said that safety needed to come first in the construction sector, and that Malta needed to stop reacting to accidents and to start acting to prevent them.\nThe construction industry had developed at a very fast rate in recent years, and the government should have thought about a long-term vision to the development of the sector before instead of \"waiting for accidents to happen\", he added.\n'All stakeholders must show will to change' - Chamber\nThe Chamber of Commerce said in a statement that the reform could only be successful if all stakeholders had the will to change and improve. \n“All along, the Chamber has advocated for the highest of standards in design, engineering, management and construction which must become the true objectives. This reform must be a holistic review of our regulatory and practices framework to truly modernise the industry and change the current situation” it said.\nThe Chamber also warned that the new authority that would be established to amalgamate the various fragmented agencies in the field, must strive to \"regulate and enforce, educate and motivate\" the industry and the public.“The days of complacency should be long gone. We must not stop once the new authority has been established but we should all strive to ensure that Quality and Safety Targets are met. The Chamber of Commerce is willing to contribute to this process to ensure that this change truly happens,\" it said. ", "comment_count": 76, "id": 660}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A family meal on Saturday evening ended on a sour note when an argument between two brothers left one of them critically injured while the other man landed in preventive custody.\nMatthew Vassallo, a 33-year old unemployed father from Cospicua, was escorted to court under arrest on Monday afternoon, protesting his innocence and claiming that it had all been an unfortunate accident, certainly lacking any criminal intent to wilfully injure his brother.\nThe man was charged with attempting to kill his brother, inflicting grievous injuries, bearing a weapon and breaching bail.\nDefence lawyer Benjamin Valenzia, assisting the wheelchair user, contested the validity of the arrest, claiming that it had all been an unpremeditated incident which occurred when the alleged victim, after a drink too many, had toppled onto his brother.\nA drinking glass in the latter’s hand had apparently cracked under the force of the fall, with glass shards piercing the brother’s stomach, resulting in serious injuries.\nThis sequence of events was apparently corroborated by the accused’s own brother and other relatives who had witnessed the unfortunate episode, the defence lawyer insisted, adding that a police report had been filed anonymously.\nProsecuting Inspector Eman Hayman promptly rebutted that the anonymous caller who had dialed the Cospicua police station at 21:22 on Saturday had reported a \"terrible scene\" (\"delirju sħiħ\") at a particular Senglea street, with screaming and shouting going on.\nOfficers who immediately went on site had come across one man with a gaping and bleeding wound in his abdomen, though enraged and vowing to seek revenge against his brother, the accused.\nThe injured man had finally passed out and was taken to hospital in a critical condition.\nRelatives of the two brothers later told police that the argument, allegedly sparked off by the victim’s horseplay with the accused’s minor son, had escalated to such an extent that one female relative had taken her leave, sensing that trouble was brewing.\nAfter hearing these submissions, the court, presided over by magistrate Gabriella Vella, confirmed the validity of the arrest.\nThe prosecution objected to a request for bail, arguing that there was \"no doubt\" in its case as implied by the defence.\nMoreover, the accused had an untrustworthy character and attempts to tamper with evidence had allegedly already been made, Inspector Hayman continued.\nDefence lawyer Valenzia argued that the presumption of innocence was even stronger in this case given the doubts as to the voluntary nature of the incident.\nBesides, the accused, could risk losing his social benefits, the lawyer went on.\nAfter hearing these submissions, the court turned down the request for bail in view of the nature of the offences and the fact that civilian witnesses, including the victim and other relatives, were still to testify.", "comment_count": 0, "id": 661}, {"keywords": "Justice, Government", "author": "", "article_body": "Updated 7pm with justice ministry response\nThe Polish government breached EU law when it lowered the retirement age of its Supreme Court judges, harming their independence, the EU's top court ruled on Monday in a judgement expected to have ramifications on Malta's judicial system. \nIn October, the European Commission took Warsaw to the European Court of Justice (ECJ) for cutting the age at which judges are required to retire from 70 to 65. \nThe ECJ ruled on Monday that the measures breached the principles of the irremovability of judges and judicial independence, contrary to EU law. \nMaltese rule of law campaigners hailed the decision as a landmark judgement as it laid out the level of judicial independence expected in all EU countries, and the applicability of EU law in such matters. \n\"This judgment will also shape the future of the judiciary in Malta and put a stop to the systematic capture of the last remaining pillar of our democracy,\" pressure group Repubblika said in a statement on Monday. \n\nThe NGO filed a similar case in Malta last April, asking the court to refer the matter for a Preliminary Ruling from the EU court, after the Prime Minister appointed six new members to the judiciary, despite a warning from the Venice Commission to change the system before further appointments. \n\"In a decree in this case, Mr Justice Mark Chetcuti has already stated that today’s decision will guide the Maltese courts on the question of applicability of the EU treaty in Malta. That guidance is now clear,\" Repubblika said. \n\"Today’s decision should also guide Malta’s government with regard to the independence that is expected of the judiciary in Malta. The EU treaty applies in Malta too, and the Government cannot continue to ignore it.\nRELATED STORIESJudicial appointments: ‘Worst constitutional mess since Independence’PM slams 'absurd' request to 'paralyse' courts\n\"We hope that the government will learn from this ruling, and will take the initiative to embark on an immediate reform of the judiciary, in particular the current system of judicial appointments and promotions, that encourages abuse.\"\nFormer Opposition leader Simon Busuttil tweeted: \"Our Prime Minister has full discretion to appoint, promote and reward judges and abused his power to capture the judiciary. We too deserve an independent judiciary.\"\nIn a statement, the Justice Ministry appeared to downplay the relevance of the decree to Malta, insisting the country had introduced no laws comparable to the Polish legislation criticised by the ECJ.\nRather, the ministry said, an independent body had been introduced to advise the goverment on judicial appointments.\"This further strengthened judicial appointment laws that had been in place for years and that had been subjected to EU scrutiny when Malta became a full member.\"The ministry also denied that the Venice Commission had advised the government to halt further appointments until the system was reformed.\nPoland must comply 'without delay'\nLast year, Poland's right-wing government suspended retirements in order to comply with an interim ruling from the court in Luxembourg.\nPoland is required now to comply with Monday's judgement without delay.\nIf the European Commission, the 28-nation EU's executive arm, finds Poland has failed to comply with the ruling, it may bring a further case seeking financial penalties, the court said.\nThe commission has been locked in a bitter battle over sweeping judicial changes introduced by Poland's Law and Justice (PiS) government since it took office in 2015.\nThe showdown has led the EU to trigger unprecedented proceedings against Warsaw over alleged \"systemic threats\" to the rule of law that could eventually see its EU voting rights suspended.\n(Additional reporting by AFP)", "comment_count": 34, "id": 662}, {"keywords": "Accident, Fire, Environment", "author": "Ivan Martin", "article_body": "The huge fire which engulfed the Miżieb woodland on Saturday covered an area six times the size of the Floriana Granaries. \nAccording to the hunting federation, FKNK, which manages the green space used by both hunters and nature lovers alike, the blaze could very well have scorched an area of around 55,000 square metres.  \nThe estimate was published by the federation over the weekend as emergency responders were busy battling the flames. \nEmmanuel Psaila, who heads the Civil Protection Department told Times of Malta that the inferno was one of the largest he had come across in his 20 years of firefighting. \n“It was, without a doubt, the largest I have seen in recent years after taking over the department,” he added.  \nIn all, 16 firefighters battled the flames in the Miżieb area around the clock between Saturday and Sunday morning, as little pockets of scorched earth kept reigniting under the searing heat of an intense June sun. \n“It was, without a doubt, the largest I have seen in recent years” – CPD head\nFirefighters said that had they not remained on site to ensure the fire was contained, the damage to the woodland would have been far greater. \nAt approximately 850,000 square metres, the Miżieb woodland is one of the country’s largest green areas and a major habitat for migrating and local species.  \nBy Sunday morning, large tracts of the greenspace smouldered and smoked – where once stood indigenous carob and Holm Oak trees, today there remains little more than ash. \nThe Hunters’ Federation said they suspected the fire may not have been a natural occurrence and have since reported the matter to the police for an investigation. \nThe hunters lashed out against “continuous vandalism” to the area, calling for adequate surveillance and enforcement to crack down on the abuse.\nThe fire at its peak on Saturday.\nDamage to be assessed by experts\nEnvironmental experts will assess the damage caused by the fire.\nA spokesman for Environment Minister José Herrera told Times of Malta that a team of experts from Ambjent Malta and the Environment and Resources Authority would be analysing the extent of the damage caused to the area. \nThe team would also be trying to pinpoint what caused the fire and draft an action plan to avoid future recurrences. \nIt is still unclear how many trees have been lost to the blaze. \nSources involved in the policing of the natural environment said that the fire could have been the result of one of three possible factors. \n“Yesterday farmers were burning dry grass in nearby fields so that could have caused the outbreak,\" a spokesperson said on Sunday.  \n“This could also have been the result of some trash which was abandoned in the countryside and caught fire in the blazing sun. \n“Or, this fire could have just been a natural event. It remains to be seen which of these the actual cause was,” the sources said.", "comment_count": 10, "id": 663}, {"keywords": "Court, Sliema", "author": "Edwina Brincat", "article_body": "A young man who was arrested earlier this month over theft was back in court on Monday after a Rolex watch found in his possession linked him to another burglary.\nValdas Martinaitis, a 28-year old Lithuanian, pleaded not guilty to conspiring to steal and aggravated theft from a Sliema apartment last November.\nIt was a Rolex watch found in his possession, reported stolen in that burglary, that landed the man with the fresh theft charges.\nHe was already in custody over earlier charges linking him to criminal conspiracy, money-laundering and theft.\nWhile not making any request for bail, defence lawyer Edward Gatt pointed out that the personal details listed on the charge sheet, referring to Levan Mamardsashvili, a 24-year old Georgian national, who was not his client.\nHowever, prosecuting Inspector Joseph Mercieca rebutted that the personal documents found in the man’s possession had long been out of circulation, a fact confirmed by foreign authorities.\nMoreover, a number of documents relating to financial transactions were found on the man’s mobile phone under the name Mamardashvili, with the phone number matching the one used by the accused.\nMagistrate Gabriella Vella remanded the man in custody.", "comment_count": 0, "id": 664}, {"keywords": "Society, Family, Youth", "author": "Claudia Calleja", "article_body": "Twenty-one marriages involving 16- and 17-year old brides were registered in Malta over the past decade, according to figures obtained from the National Statistics Office.\nOut of the 21 teen brides, 18 were Maltese and three were foreign, according to the NSO statistics that include marriages registered in Malta that could have occurred overseas between 2008 and 2017. Figures for 2018 are still being compiled.\nThe data was requested after the United Nations’ Committee for the Rights of the Child recommended that Malta’s marriage law should be amended not to allow teenagers under 18 to get married.\nWhen opening up the data to marriages involving spouses between 16 and 18 (including 18-year olds), the figures increase to 98 marriages registered in Malta – meaning 77 unions involving 18-year olds between 2008 and 2017. Out of the 98, 90 were females and 77 Maltese. \nAccording to the Maltese marriage law, enacted in 1995, marriage is not allowed under the age of 16. The law allows 16- and 17-year olds to marry if they have the consent of a parent or guardian. \nAmongst the various recommendations, the UN report said the Maltese government should amend the Marriage Act and the Civil Unions Act “to remove all exceptions that allow marriage and entering into a civil union under the age of 18 years.”\nMinors may not have enough maturity to make the right choice\nThis recommendation was backed by Children’s Commissioner Pauline Miceli.\n“The age of marriage should be raised from 16 to 18 as minors may not have enough maturity to make the right choice for themselves in terms of whether they should get married or to whom; they can be unduly susceptible to external pressures and the challenges of married life may be too hard for them to manage,” she said.\n“They are also likely to suffer an opportunity cost to their personal, educational and occupational development as a result of getting married before attaining the age of majority.”\nAsked if there are plans to amend the law as recommended by the United Nations, a spokeswoman for the Ministry for the Family, Children’s Rights and Social Solidarity said government is “currently reviewing the report and its recommendations. Any amendments which will improve children’s rights would be taken into consideration.”\nWere you one of these teen brides? Or, perhaps, a friend or relative of someone who got married so young? If you’d like to share your experience or thoughts, make your voice heard and contact claudia.calleja@times ofmalta.com. You can choose to remain anonymous.", "comment_count": 47, "id": 665}, {"keywords": "Adrian Delia, PN, Politics", "author": "Keith Micallef", "article_body": "A petition to move a vote of no-confidence in Nationalist Party leader Adrian Delia may be stopped in its tracks, according to sources close to the leadership who believe such a move would be “inadmissible”.\nThey are insisting that according to the PN statute, the PN leader cannot be forced to step down and must serve for at least an entire legislature, unless he or she decides to resign of their own accord.\nOn the other hand, those calling for Dr Delia to put his leadership to the test in the general council disagree completely with that interpretation.\nSpeaking on condition of anonymity they insist that any move Dr Delia makes to deny such a vote and hide behind legal arguments would only serve to dent his democratic credentials and plunge the party in a deeper crisis.\n“It is already unprecedented that such a petition has been started and any leader who has the party interest at heart would either call it day or at least call the vote himself,” they insisted.\n“Nonetheless, the general council must be convened, and if necessary a vote will be taken on whether the no-confidence motion is admissible or not,” they said.\nDr Delia’s camp argues that the PN statute only allows the party leadership to be put to the test within a restricted time window – “within three months of a general election, whereby a vote is held among all paid-up party members in a general convention to confirm the leader and the two deputies”.\nPN members who want Dr Delia to quit as party leader circulated a petition over the weekend calling for a secret vote to be taken on whether he should remain at the party’s helm.\nPeople mill outside the PN's headquarters during a late-night parliamentary group meeting last week. Photo: Matthew Mirabelli\nA proviso in the PN statute states that a general council – the party’s highest organ, made up of around 1,300 delegates – can be convened if a petition amasses at least 150 signatures. The petition calling for the secret vote surpassed that target on Sunday. Calls for Dr Delia to resign have been going on for months, but momentum has increased following last month’s disastrous MEP and council election defeats. However, the embattled PN leader has resisted these calls even when given an “ultimatum” by the majority of his own MPs.Consequently, Dr Delia’s critics have turned to calling a general council meeting to hold a vote of confidence.\nNo legal basis?\nSources close to Dr Delia argue that the attempt is destined to fail. “While the general council is the highest organ, article 25 of the statute says clearly that it has no power to change decisions regarding the election of the leader and his two deputies,” they said.“Such a restriction is meant to offer a degree of stability, as otherwise any leader could have to face a confidence vote within weeks of being democratically elected,” they pointed out.\n\nDr Delia would not be required to step down even if a majority of PN MPs declared they had no confidence in him, they believe.\n“The consequence would not be his resignation as party leader, but for the President to appoint somebody else as Opposition leader,” they told Times of Malta.\nIn terms of the constitution, the president appoints as the leader of the opposition a member of the Opposition who commands the support of the biggest number of Opposition MPs.  \nHowever, these sources acknowledged that a petition to call a vote of confidence would nonetheless pile pressure on the PN leadership.\"While procedurally such motion may not be allowed, it would still raise questions on whether Dr Delia’s position would be realistically tenable,” they said.", "comment_count": 184, "id": 666}, {"keywords": "History, Kalkara", "author": "Stephanie Fsadni", "article_body": "The news that the much-needed restoration project of Fort Ricasoli in Kalkara was given the green light by the Planning Authority earlier this month has been applauded by various entities and NGOs even though some have expressed concern as regards the interventions needed, eventual use of the premises and maintenance costs.\nThe fort has been in a dire state of deterioration for years, with sections of its outer bastions already having crashed into the sea, and heritage experts warning that further collapse was inevitable without immediate intervention. \nThe planned restoration works include cleaning and reconstruction of missing sections of the limestone fabric, restoration of deteriorated masonry and collapsed structures, and structural consolidation.\nFort Ricasoli continues to be damaged by wave action.\nThe heritage group Assoċjazzoni Wirt il-Kalkara believes this is “a very positive step” and hopes that a concrete and long-running conservation plan for this historical site will now be put into action. \n“The fort has been neglected for far too long, to the detriment not only of the structure but also the rock face below it,” the NGO’s secretary Duncan Brincat told Times of Malta.\nThe group, which last year estimated it would take €50 million worth of emergency works to ensure the fort’s survival, added that it was recently informed that preliminary works augur well for the success of the conservation process.\nMario Farrugia, chairman of Fondazzjoni Wirt Artna, was equally delighted with the news, saying “it is a step in the right direction”, however, he sounded a note of caution.\n“There are various considerations to make, especially the kind of intervention required. Are they going to place wave breakers? Because it is useless restoring the structure if it continues to be damaged by wave action,” he said.\n\nA report drawn up by the Restoration Directorate as part of the planning process noted that the deterioration had largely been caused by the rough seas as salt contamination had further attacked masonry elements and rock outcrops. \nExtensive rust damage was found on steel structural elements and further damage had been caused by algae and vegetation.\nThe fort has been neglected for far too long\nMr Farrugia also noted that it makes sense to preserve “all layers of history”, not only the structures related to the Knights of St John.\n“The fort was also important in Napoleonic and British times… all elements should be retained and valorised,” he said.\nMr Farrugia expressed concern about the fort’s use once it is restored and stressed that it would need a good management plan.\nFlimkien għal Ambjent Aħjar called the restoration plan “a major investment”.\n“The fort’s colourful history, including the Froberg Mutiny of 1870, the most serious mutiny of the Napoleonic Wars, will attract many visitors but it is unlikely that it will be enough to finance ongoing maintenance in years to come,” Astrid Vella, the NGO’s coordinator, said.\nMs Vella reminded that the FAA had lobbied for Fort Ricasoli to be restored by the American University of Malta as its campus and questioned why the Film Restoration Fun financed by productions filmed in Malta had been dropped.\n\n“Given that Gladiator, Troy and Agora were all filmed at Fort Ricasoli, plus its proximity to Malta’s film facilities, a film institute including a film archive and tours could be considered to make the site sustainable,” Ms Vella continued.\n“Such initiatives come at a cost but, in the long term, these costs will benefit the fort, its historic legacy, the film industry and the Maltese nation.”\nDesigned by Italian military engineer Antonio Maurizio Valperga, the fort was built between 1670 and 1698 on a promontory known as Gallows Point, commanding the entrance to Grand Harbour. Over the centuries, it was occupied and added to by the Knights of St John, the French and, finally, the British army and Royal Navy, before being decommissioned in the 1960s. \nSince then it has been used for industry and as a film location, including for Gladiator and Game of Thrones. \nIt is a Grade 1 scheduled national monument and has been on the tentative list of Unesco World Heritage Sites since 1998.", "comment_count": 6, "id": 667}, {"keywords": "Family, Politics, Childcare", "author": "Ivan Martin", "article_body": "The amount of time children must spend in foster care before being eligible for adoption may be cut in half, but only in special circumstances, Social Solidarity Minister Michael Falzon said on Monday.\nAddressing a press conference to launch a new National Adoption Strategy, Dr Falzon said the government was open to the possibility that children need only spend five years in foster care prior to adoption, rather than 10, but only in certain circumstances and when authorised by a Court.\nThis, he said, was one of the issues set to be discussed in the coming weeks. \nThe new strategy document, Dr Falzon said, will complement a care for minors Bill which will today begin being discussed in Parliament.\nRead: Last year was a record year for adoptions\nDr Falzon said he hoped most of the work for the draft law to be approved by the House would be finished before the summer recess.\nMatthew Vella, who heads the Social Care Standards Authority, said the strategy document was not just about reducing bureaucracy but about improving the overall performance of the adoptions process.\nThe document outlines how over the next three years, the authorities will invest in research to inform their decisions.\n“We want this sector to be truly evidence based,” he said.\nMr Vella said that the 25 measures in the document also sought to increase training and resources for those working in the sector.\nUltimately, the strategy would help the authorities instil a child-focused approach.\nDr Falzon meanwhile stressed that adoption was a “hot subject”.\n“It is not easy to legislate and draft strategies and policies which deal with such an emotional and complex subject. The laws devised in this area will ultimately have a bearing on people’s futures,” he said.", "comment_count": 0, "id": 668}, {"keywords": "Construction, Civil society", "author": "", "article_body": "New construction industry regulations proposed by the government put developers' interests before residents and are actually a throwback to a law proposed in 2013, environmental NGO Flimkien Għal Ambjent Aħjar said on Monday.\n\"Contrary to the impression being given, the revised construction regulations are not new, they date back to the 2013 ‘ Avoidance of Damage to Third Party Property during Construction’ law, and while their reform is long overdue, the present draft does not even begin to address many urgent issues; in some ways it is actually a regression on the earlier law,\" the NGO said. \nThe 2013 version of the law imposes the requirement of a geological investigation for every excavation deeper than three meters. However the amendment now states that a geotechnical design report may include a geotechnical investigation, if the architect deems it necessary. \nRELATED STORIESWant to be a contractor? Just get some equipment\nThe new regulations stipulate that any major decision taken on a building site should require the presence of both the architect and site manager, however that is undermined by the provision that in the absence of a site manager, his duties pass onto the architect.\n\"While the new regulations focus on increased supervision of works by the architect, there is less emphasis on the responsibility of contractors and no attempt to finally introduce the licensing of contractors, leaving the field open to people who have jumped on the bandwagon with no training whatsoever,\" the FAA said.\nLikewise, there is no requirement for training of demolition contractors, crane operators, steel workers, concrete pourers, foreman, scaffolding erectors and excavators, a recipe for disaster, given that these people would be unaware of the first signs of danger and press on, oblivious of the risks to themselves and others.\nThe FAA said it has long been calling for certification of heavy plant and equipment; cranes need to be inspected each time they are assembled on a site, not just when second-hand equipment is imported to Malta.\n\"Most importantly, the new regulations have not incorporated or increased the Police law re leaving a distance of 76cm when excavating alongside a neighbouring wall. This is the cause of much of the damage to neighbouring properties when developers ignore this law in order to maximise basement space – at the risk of neighbours’ lives.\"\nThe legislation, however, made no mention of increased enforcement. \n\"If there is no commitment to increase resources for enforcement by the Building Regulations Office there will be no change. Increasing insurance coverage to €750,000 is no consolation to residents of damaged blocks as it does not make up for the personal damages and trauma they experience.\" ", "comment_count": 10, "id": 669}, {"keywords": "Architecture, Construction, Unions", "author": "", "article_body": "Architects who take over jobs which a fellow architect has reported as being unsafe to authorities could end up facing disciplinary action by their own regulatory body.\nIn a directive publicised on Monday morning, the Chamber of Architects and Civil Engineers - the Kamra tal-Periti - told its members that they were authorised to refuse to sign change of architect forms in cases where developers had ignored their instructions about ensuring a site’s structural integrity.\nAny architect who took over such contracts, the Chamber added, would be considered to be in breach of the profession’s code of professional conduct and could face “appropriate action” in terms of the Periti Act.\nThe directive was unanimously approved during an extraordinary general meeting held on Friday and communicated to all architects who form part of the Chamber on Monday morning.\nRELATED STORIESHow to dig ourselves out of a hole - Chris Mintoff\nAs things stand, architects unwilling to turn a blind eye to unsafe construction practices face significant pressure to sign change of architect forms and hand over the job to another warranted profession, losing their commission in the process. \nThe Chamber wants that to change, with architects who blow the whistle on dangerous works protected and given an assurance that their commission will not be lost. \nDuring the EGM, architects discussed various courses of action if the government refused to tweak proposed changes to construction legislation.\nThe proposals to amend laws were quickly put to paper after a series of building collapses shocked authorities into action. They were opened to five days of public consultation and Prime Minister Joseph Muscat has said he expects them to become law in the coming days.\nArchitects, however, are unhappy with some of the proposed changes. They say enforcement bodies such as the BRO need significantly increased resources if they are to do their job properly and note that changes to the Periti Act first proposed 12 years ago remained in limbo. Architects have also expressed alarm about a proposal to shift site manager responsibilities onto their shoulders,  saying it should be contractors – the people responsible for temporary works and who are always on site – who should assume that role, rather than architects who only visit construction sites sporadically.", "comment_count": 5, "id": 670}, {"keywords": "Animal welfare, Court", "author": "Edwina Brincat", "article_body": "A pet-sitter has hit back at a judicial protest by neighbours, accusing them of lying and harassing her.\nOn Friday, Michael and Sylvia Hudson claimed that their next-door neighbour, Lara Marie Bezzina, had taken up “pet sitting” as a business, subjecting them to incessant barking and unpleasant odours from her Sta Venera maisonette and keeping the animals in poor conditions.\nMs Bezzina in her reply on Monday said the dogs taken into her home were greatly loved and treated as part of the family.\nRELATED STORIESBarking dogs leave Santa Venera couple growling\nAs for the nasty odours and dirt alleged by the Hudson couple, she stressed that the animals were kept in “excellent conditions,” citing comments by the Animal Welfare Directorate whose official had inspected her premises.\nIn a certificate issued in December 2018, the directorate declared that, “All dogs were found to be in very good health condition and the roof and inside where the dogs are being kept was found very clean and no smell of bad odours whatsoever,” noting further that the animals were provided with “beds and adequate bedding” as well as a “brick kennel outside on the roof.”\nMs Bezzina said her neighbours’ allegation of animal cruelty was nothing but a “blatant lie,” part of the long ongoing “systematic harassment” aimed at seriously tarnishing her reputation.\nAs for their claim that she was operating without a licence, the pet-sitter countered that the law laid down no licence requirement for such services, ending her protest by formally holding the neighbours responsible for damages whilst reserving the right to take further legal action.\nLawyers Arthur Azzopardi and Carlos Bugeja signed the protest.", "comment_count": 0, "id": 671}, {"keywords": "Construction, Accident", "author": "", "article_body": "A former president of the Chamber of Architects has given a shocking assessment of the current state of play in construction sites and warned that some of the proposed rule changes will possibly make the situation worse.\nChristopher Mintoff, writing in Times of Malta’s opinion pages, says that when clients and their architects need to find a contractor, the only legally recognised criteria they have with which to recognise a qualified individual from a foolhardy opportunist is the mason’s licence. \nBut it has been impossible to check who has a valid mason’s licence or not, “and many builders just used other people’s credentials or forged them.”\nHe was writing in the wake of three incidents where adjacent buildings to construction sites were destroyed or badly damaged.\nThe first time in decades that a list of licensed masons was published was last Friday, while 400 architects were attending an extraordinary general meeting discussing this very topic. \n“Therefore, besides the mason, no other person on a construction site – Malta’s most dangerous workplaces – needs any credentials.  These include demolition contractors, crane operators, steel workers, mason’s assistants, concrete pourers, foreman, scaffolding erectors, anyone using this scaffolding, drivers, and of course the excavators themselves.”\nIf anyone fancied offering excavation services, all he needed to do was invest in machinery (second-hand vehicles from Sicily) and start looking for a first job. That’s it.\nWith all these possible amateurs on our construction sites, the only surprise from the recent disasters is that they don’t happen more often\n“With all these possible amateurs on our construction sites, the only surprise from the recent disasters is that they don’t happen more often.”\nBut is it not the architect who should be responsible to ensure the construction is safe, many people ask.\nMr Mintoff replies that the architect is engaged to design a structure (permanent works) and to make sure that once it has been completed, it would be safe for its intended use by its users and safe for third parties. \nRELATED STORIESNeighbouring buildings around construction sites will have to be protectedPM: Construction reform this week even if some professionals unhappy\nDuring construction, his responsibility is to make his instructions clear and to carry out spot checks to make sure they are being followed. \n“The method by which the structure is constructed (temporary works) is the responsibility of the contractor who chooses people in his employ for their skills. He is responsible for safety, instructions and other site logistics.” \nA woman was injured at the beginning of June when her Mellieħa building collapsed.\nProposed new government regulations make provision for a site manager, whose job it will be to ensure that the site is operating as it should be and that any technical issues are reported accordingly. \nStrangely, Mr Mintoff observes, there has been talk that if a contractor is unable to find someone qualified enough for the role, then the role of the site manager (for temporary works) is automatically bestowed on the architect who designed the permanent works. \n“This is illogical. Here the contractor is admitting that all his workforce is incompetent for the task and is not ready to shoulder his legal responsibilities. In that case we shouldn’t be finding him a backup, we should be sending him packing. \n“Giving him a replacement to his own responsibility will make him more indifferent to the consequences of his actions. Any law that makes the design perit automatically act as the site manager, responsible for workers he didn’t employ, will instantly make all those construction sites much less safe.\n“Even the best composer in the world cannot ensure that an orchestra of monkeys will play a fine tune.”\nThe construction industry must start learning from its mistakes, Mr Mintoff concludes. “If the law passes without demanding minimum training for anyone on site, and a future register of who is qualified for what tasks, we’ll be here once again in no time and none the wiser.”", "comment_count": 38, "id": 672}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "Updated 1.30pm\nMark Anthony Sammut, the outgoing president of the PN Executive Council, has endorsed a petition calling for a vote of confidence on Adrian Delia at the General Council. \nThe petition had, on Sunday, exceeded the 150 signatures needed to spark off a secret vote.\n\"Adopting a business as usual approach or adopting superficial initiatives to tackle a profound problematic situation is never a proper solution,\" he wrote in a Facebook post on Monday. \n\"After having heard the sincere pleas and feelings of so many who have reached out to me in these weeks, I endorse, with great responsibility, the call coming from across a wide sector of the party, and I too have signed the request for the Party to convene its General Council and take a vote of confidence in Adrian Delia’s leadership. The disastrous results of the European and Local Council elections makes it imperative to do so,\" he said.\nMr Sammut resigned from the executive earlier this month, saying he wanted to assume responsibility for the party's performance in the May elections. He had said, however, that he expected others to assume their responsibilities too. \nHe said in his post on Monday that it was clear from the results that in the past almost two years the party had burnt many bridges with big chunks of its very own electorate.\n\"We have not only not convinced those who had left, but we have even lost more from among our own core.\"\nWe have not only not convinced those who had left, but we have even lost more from among our own core\nThe Nationalist Party, he said, needed to start by taking full and honest stock of the current reality. Only then could it \"rethink, rebuild and relaunch\".\n\"We could preach unity for a hundred years, but unfortunately it has become obvious that those who burned these bridges can never succeed in rebuilding them. I have taken grave personal decisions precisely because I honestly and responsibly acknowledge that the party can never do so with the current leadership. Let us not waste more time because we have no time to waste.\n\"This is not about factions, this is not about Adrian Delia; this is not about any individual, past or present, be he former leader or otherwise. This is about the very existence of the Nationalist Party and of democracy in Malta.\"\nWe could preach unity for a hundred years, but unfortunately it has become obvious that those who burned these bridges can never succeed in rebuilding them\nMr Sammut said he had respected the vote of the 7,734 party members, and have worked tirelessly over this year and a half to try to make that choice a success, but all had clearly failed.\n\"Now it’s time we respect the message of the 371,000 voters. It’s time we redirect the clear message of our own voters; a clear message sent in the manner of voting chosen by those who voted and in the equally clear message sent by those who chose not to vote.\"\nMŻPN, forum president backs petition\nJoseph Grech, president of the PN youth section, also backed the petition.\n\"We have to ask ourselves the inevitable questions. Is the party in its current state credible and electable? he said in a Facebook post. \n\"We can either choose to ignore the reality of the situation and risk destroying the PN forever, or we can choose to stand up to be counted and strive to have a credible and electable party once again. That time is now,\" he said. \nIn a separate post, the general secretary of MŻPN also echoed his position. \nThe president of the Forum for Professionals within the PN also lent his support to the vote of no-confidence.\n\"It is as clear as daylight that the party is staring down the barrel at an even bigger defeat in the next general elections, which can potentially render it an irrelevant one,\" Graham Bencini wrote in another post. ", "comment_count": 78, "id": 673}, {"keywords": "Justice, Court", "author": "Mary Rose Micallef", "article_body": "A contract creates binding chords between its contracting masters. The general presumption is that whatever is agreed to, is law to its subject parties, and breach of contract triggers liability to the party in default. Nevertheless, beyond the agreed substance, contract has its own founding principles that would always prevail over and above the said agreed substance. \nThere exist four main elements that configure the very core of an agreement. The substance of the contract relies on these elements for their existence, for neither can live while the other survives. Resultantly, the binding chords would be permanently breached if one of the following essential conditions is found to be absent or lacking. \nArticle 966 of the Civil Code provides the essential conditions to the validity of the contract, that are: the capacity of the parties to contract; the consent of the party who binds himself; a certain thing which constitutes the subject-matter of the contract; and a lawful consideration. \nThis discussion shall delve into the first essential condition – capacity, for without it, there will be no need to find the other elements. If someone is incapable to stand in contract, the contract fails right away. And indeed, ‘capacity in contract’ was the essence of the judgment Mario Bugeja vs Bernardette Brincat et, decided by the Civil Hall, First Hall earlier this month.\nSimply put, capacity entails the ability to independently (mentally) take care of one’s own affairs. \nThis case related to a dispute between siblings regarding a donation of an immovable property that had been transferred to the defendant by her parents way back in 2009. As it happens, the plaintiff contended that a half undivided share of the said property, which share represented the portion transferred by his mother to the defendant, was null and void. He alleged that his mother had lacked mental capacity at the time the said transfer occurred, and therefore she was incapable of contracting the said donation. \nThe defendant pleaded that her mother had been sane and capable, owing to the fact that subsequent to the said transfer she had performed other civil acts – acts that the plaintiff opted not to impinge. \nThe defendant also pleaded nullity of proceedings, since the plaintiff opted to call their mother into suit personally, while at the same time claiming that she lacked mental capacity. This follows the principle that persons who can be sued or sue must always have the ability to take care of their own affairs. Litigants must have contractual capacity, otherwise, they cannot sue or be sued personally.\nTo the defendant, this was a rather contradictory move, since while the plaintiff was stating that his mother was not mentally firm, he was suing her personally as one who can stand in judgment, and therefore as a person who did not suffer from mental infirmity. This plea was eventually resolved because the parties’ mother was interdicted by the Court on the same date of filing, and a curator was appointed in her stead. \nNullifying a contract on grounds of incapacity is challenging\nIn determining the parent’s contractual capacity, the Court referred to the applicable provisions of the Civil Code. These essentially provide that any contract that is entered into by a person who lacks the use of reason is null and shall be subject to rescission. Persons who are not capable of understanding owing to some mental defect or who are unable to manifestly express their will are incapable of making donations – such persons need not necessarily be formally interdicted. \nThe Court referred to a previously established judgment, which had listed the fundamental principles that had to be considered in cases that concern the impinging of contracts on the basis of mental incapacities.\nThese principles state that capacity is always presumed, and incapacity is an exception hence the legal presumption favours capacity over incapacity. Nullifying a contract on grounds of incapacity is challenging as the law presumes that everyone has the capacity to contract unless incapacity is unequivocally proven. \nThe burden of proof shall be borne by the party who alleges the exception of incapacity and that incapacity must essentially exist at the time of the contract. \nCapacity law does not entail that one has to be perfectly and rigorously sane and knowing – if that were the case, many a person would fail the test. What mattered was that at the time of contract, one possesses the ability to understand the consequences of one’s own actions.\nFurthermore, for insanity to be substantially proven, unequivocal and precise facts must exist, in the sense that any doubts would favour sanity in accordance with the above-mentioned presumption. One may dare say that our jurisprudence requires conclusive proof of insanity, something that goes beyond the balance of probability principle in civil matters. \nThe Court also considered that the objective manifestation such as signature and marks, do not guarantee the sanity and capacity of their signatory party. \nOne cannot simply regard the external features of consent, that is the markings of the signatory party since capacity is essentially connected with the inner psychological willingness of the party. Capacity, that is, the awareness of one’s wishes, and their corresponding consequences are what drives the willingness of a contracting party.\nTherefore, if a party cannot independently take care of his or her own affairs, his or her will can never be validly crystallised. Persons suffering from such incapacities would not be able to contract since they lack the critical understanding of their own actions. \nThe Court found that the mother had been diagnosed with “severe deficits in cognitive function” – years before the contract of donation. Through the trespass of time, this condition worsened to the extent that medical practitioners had suggested the relocation of the patient to a closed ward.\nThe Court disagreed with the defendant’s submissions, namely that her mother was simply suffering from mere forgetfulness. It held, that from the gathered evidence one could clearly see that such a person was suffering from a ruthless mental condition that had robbed her the capacity to contract. The condition had rendered such patient incapable to the extent that she no longer possessed the necessary use of reason required by law, to be able to contract the donation in question. \nConsequently, the Court annulled the transfer of the donated half undivided share and rescinded the donation in part.    \nMary Rose Micallef is a junior associate, Azzopardi, Borg, & Abela Advocates.", "comment_count": 2, "id": 674}, {"keywords": "Planning Authority, Environment", "author": "Keith Micallef", "article_body": "In another twist to the Magħtab fuel station saga, a court declared null all Planning Authority proceedings held after the watchdog had switched its position from against to being in favour of the controversial development.\nThe Planning Authority board will now have to meet again to reconsider the merits of this application. It will have to ensure that all documentation, on the basis of which it will be taking a decision, will be made available to the public and parties involved.\nThe issue revolves around a proposal by Paul Abela on behalf of Abel Energy to relocate an existing fuel station in Mosta to a site outside the development zone in Magħtab. Apart from the pumps, the project consists of an electric car charging station, car wash, shop, the services of a mechanic and a parking area.\nIn March 2016 the Planning Authority had rejected the proposal but the appeals tribunal subsequently ordered the application to be reconsidered.\nThe Planning Authority board will have to reconsider\nIn December 2017, the Planning Authority board provisionally pronounced itself against the development. However, a month later it had a change of heart and granted the permit.\nRELATED STORIESPA chairman storms out of meeting over Magħtab station\nAggrieved residents sought redress before the Environment and Planning Review Tribunal on the ground that a document outlining the revised conditions and reasons on which the board would be recommending the approval had not been communicated to them but only to the developer.\nThey also complained that there was no way they could have discovered these changes, as up to the day before the meeting the authority’s website still carried the old version.\nIn its decision, which was delivered last April, the tribunal concluded that this was a very serious shortcoming as the objectors had not been given the opportunity to make submissions on the updated document.\nThe tribunal annulled the PA’s decision to issue the permit and ordered that the process revert back to the stage prior to the final decision.\nHowever, the aggrieved residents were not fully satisfied with this outcome as they feared they would not be given the opportunity to make their submissions on the revised conditions.\nIn view of this they sought redress before the Court of Appeal.\nIn his decision Mr Justice Mark Chetcuti said the tribunal could have been clearer in its ruling and for this reason ordered that all proceedings held after the December 2017 Planning Authority meeting be declared null. \nFurthermore, all involved parties must be notified in advance about the board’s revised conditions and reasons, and this information must be made available on its website before the meeting.", "comment_count": 25, "id": 675}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports that PN leader Adrian Delia is to face a confidence vote in the party's general council. It also reports that over 1,000 people have requested a ban on their own gambling. They have asked to be banned from casinos and other gaming parlours in an attempt to break their habit. \nThe Malta Independent says the Church commission is updating its policies to reflect the Vatican's sex reporting law. The newspaper also quotes the new Valletta mayor saying the capital needs more funds for special projects. \nIn-Nazzjon reports that more than 760 migrants have arrived in Malta in the past few months. It also says the government is in no hurry to resolve pending issues involving midwives at Mater Dei Hospital.\nl-orizzont quotes the prime minister saying the main principle underlying the changes to the construction laws is that no one can shirk responsibility.  It also reports that the risks of suicide increase in hot weather. ", "comment_count": 0, "id": 676}, {"keywords": "Transport, Automotive, History", "author": "Keith Micallef", "article_body": "Seven of every 10 vintage-registered cars inspected in the last three years fell short of the required standards, raising the question whether the scheme is being abused to save vehicle owners hundreds of euros in licence fees.\nBy law, owners of vintage vehicles, which bear a black registration plate with silver characters, are exempt from paying the annual circulation fee, which starts at €117 for cars with small engine capacities. Instead, they pay just €8 a year for their licence.\nHowever, the few inspections being carried out on the thousands of vehicles registered as ‘vintage’ result in a 70% failure rate.\n70% of the vehicles disqualified because they did not conform to official guidelines\nTransport Malta’s policy guidelines say the scheme applies to genuine vehicles of at least 30 years of age kept “in a state which is as close as possible to its original state as produced by the manufacturer and which respects the spirit of classic and vintage vehicle preservation”.\nThe Sunday Times of Malta has been alerted to the presence of a significant number of cars on the road with black plates that look anything but vintage in preservation. Rusty body parts and flaky paint abound, as well as poor interiors and unauthorised modifications like tow bars, alloy wheels and iron bull bars. \nYet, the official eligibility criteria is very strict: even presenting a dirty car would be enough to have the application for ‘vintage’ registration rejected.\nA total of 11,457 vehicles have been listed under the scheme since it was launched in 2003.\nAsked about enforcement, a Transport Malta spokesman said the Vintage Vehicle Classification Committee carried out about 25 inspections per month and disqualified 70 per cent of vehicles because they did not conform to official guidelines.\nThe owners would then have to go through the application process again and have their vehicle undergo another inspection.\nTransport Malta did not say if it planned to beef up enforcement efforts but confirmed that some of these controls were being made in the wake of reports about vehicles bearing black plates which were “shabby, dirty or seemed to have some inconformity”.\nBy law, certified vintage vehicles can only be driven for private use, and not for hire, reward or financial gain. They must undergo the same vehicle roadworthiness test as any other car.\nCommenting on a photo of an Isuzu Gemini with rusty body parts, the spokesman acknowledged that it did not seem to “tick all the right boxes” for a vintage car.\nVintage quality\nTo be certified as vintage, cars must be 30 years old from the year of manufacture, as close as possible to the original state, kept clean, in a good state of repair and in a condition similar to the period.\nOut-of-period modifications and other changes should be avoided. Roof-racks and tow-hooks are not normally allowed as these indicate that the car is possibly being used for commercial purposes.\nThe exception here is military vehicles. Body should reflect the period: metallic blue is not allowed on a 1920s Morris, for example. The interior must look as close to standard as possible: no customisation such as bucket seats, dark tinted windows and holes in the dashboard for new instrumentation, except for minor reversible fittings.\nThe engine must be of the same series as fitted by the manufacturer. Wheels too have to reflect the period: modern alloys and low-profile tyres are not allowed.", "comment_count": 39, "id": 677}, {"keywords": "Planning Authority, Court", "author": "Ivan Camilleri", "article_body": "The Planning Authority has not yet decided to revoke Ian Borg’s swimming pool permit despite a court decision which said the permit given to the Planning Minister was issued according to a wrong policy.\nMinister Ian Borg\n“The authority is still studying the court sentence,” a PA spokesman told The Sunday Times of Malta, days after the court said the authority had applied the wrong policy to justify the minister’s permit.\nDingli resident Noel Ciantar had insisted that the minister could not turn a parcel of agricultural land in a rural settlement into a pool and recreational area. But the PA’s Environment and Planning Tribunal last April ignored Mr Ciantar’s argument and confirmed the original permit.\nHowever, following a fresh challenge, this time in front of the Court of Appeal, Mr Ciantar was vindicated.\nAccording to the court, while the PA and the tribunal used the Rural Policy and Design Guidance to issue the development permit, the applicable policy was the local plan which does not permit such a development in the area where Dr Borg lives.\nOmissions can’t be put down to human error\nSo far, the PA has not said who will be assuming responsibility for this latest error.\nThe construction of Dr Borg’s matrimonial home has been a controversy from the outset, particularly since it lies in the Santa Katerina hamlet, in the limits of Rabat, an idyllic rural settlement.\nIn 2014, soon after winning his seat in Parliament, Dr Borg was issued with a controversial permit to turn a dilapidated farmhouse into a large home in an environmentally sensitive area.\nDr Borg had already acquired a large field adjacent to his future home at the time he had applied to construct his house, but he did not apply for the development of the swimming pool area and garden. Instead, he only submitted his second application for the pool after the PA issued the first permit.\nAlso, in what later was termed by an Ombudsman investigation as a clear attempt to “deceive”, Dr Borg used a third party to submit the application on his behalf, thus concealing his identity.\nIn a damning report issued in December 2015, the Ombudsman recommended a review of Dr Borg’s first permit after having established that “policies were incorrectly applied”.\nThe Ombudsman had also chastised the then Parliamentary Secretary for choosing “a somewhat devious method to file the development application”.\nThe report found that “Mepa (now PA) had removed the one possible reason… for refusing the proposal of a similar permit, thereby facilitating the process in the case of Dr Borg’s application”.\n“The series of omissions and variations in the text of the development application (of Dr Borg) cannot be put down to human error but point to a deliberate attempt to remove the one remaining obstacle potentially blocking approval of the application.”\nAccording to the report, which had been endorsed in toto by the Commission against Corruption, “the grave error” by the PA should have been sufficient to review the process and reassess the application.\nDespite the recommendations, the PA refused to review Dr Borg’s permit and ignored the Ombudsman’s recommendation. Prime Minister Joseph Muscat, who at the time was responsible for the Planning Authority, also failed to act.", "comment_count": 27, "id": 678}, {"keywords": "Unions, Civil society", "author": "Keith Micallef", "article_body": "The steering committee tasked with paving the way for constitutional reform will be holding meetings with trade unions and constituted bodies as part of a wide consultation process, The Sunday Times of Malta has learnt.\nSources told the newspaper that the committee, which is chaired by President George Vella, is set to convene on Monday for its second meeting since he became head of State on April 4. \nProceedings appear to have been stalled for some time between February and May.\n“Originally, the committee was planned to meet at the start of March but it was cancelled after it transpired that outgoing President Marie-Louise Coleiro Preca would no longer be chairing the meetings following the end of her five-year term,” a source said.\nThe Sunday Times of Malta asked about the state of play of the ongoing talks and the committee’s terms of reference but a spokeswoman for the Office of the President said there was nothing to add to the remarks made by Dr Vella in his inauguration speech.\nEstablished last November, the steering committee is made up of representatives from the Labour and Nationalist parties only. Justice Minister Owen Bonnici, parliamentary secretary Julia Farrugia and former deputy prime minister Louis Grech are Labour’s representatives, while MP Chris Said, former European Commissioner Tonio Borg and Amy Camilleri Zahra represent the PN.\nDuring the first few months, the committee held talks with Alternattiva Demokratika, the Democratic Party, the eurosceptic movement Front Maltin Inqumu, civil society NGO Repubblika and former speaker Anton Tabone on matters related to Gozo.\nVery little information has been divulged about proceedings held so far\nWhile the Office of the President would not comment when asked on the manner in which the committee would be reaching out to the public, sources said that both Dr Vella and his predecessor had been adamant that these talks should not be confined to a handful of experts.\nHowever, the experience so far suggests there is still a long way to go as very little information has been divulged about proceedings held so far.\nMeanwhile, a Bill being debated in Parliament to split the Attorney General’s dual role of prosecutor general and State advocate has prompted criticism from the PN that the government is trying to amend the Constitution with complete disregard for the steering committee. Opposition leader Adrian Delia insisted that these changes should be part and parcel of a wider package and be debated within the constitutional convention.\nIn his inauguration speech, Dr Vella had made the point that the Constitution does not describe his own duties as Head of State.\nHe had also expressed his intention to seek the advice not only of experts and members of the political class, but civil society, voluntary organisations and interested members of the public.\nHowever, he had cautioned against rushing through with “unnecessary haste”, saying that the constitutional convention should be approached in a diligent and cautious manner.\n“Ultimately, what matters most is not what we agree upon or jot down on paper, but the will to observe and respect what has been agreed, in the interest of better serving our people,” the President had said.", "comment_count": 0, "id": 679}, {"keywords": "Terrorism, Police, Finance, Crime", "author": "Jacob Borg", "article_body": "Five cases of terrorism financing were flagged to the police for further investigation last year, far above the norm, the Financial Intelligence Analysis Unit’s (FIAU) annual report shows.\nAnalysis by the FIAU found a reasonable suspicion of terrorism financing activities involving Malta, leading to five reports being sent to the police.\nNo details about the cases were made available in the FIAU’s annual report due to secrecy restrictions.\nLast year appeared to be a record one for the unit in the fight against terrorism financing.\nIts last three annual reports prior to 2018 show one suspected case of terrorist financing was sent to the police annually since 2015.\nA memorandum of understanding was signed between the sanctions monitoring board, the FIAU, the Malta Financial Services Authority and the Malta Gaming Authority in 2018 to improve cooperation in the monitoring of financial service providers and other entities on the frontline of preventing money-laundering and terrorism financing activities.\nNo known prosecutions have been made by the police as a result of the reports sent to it by the FIAU.\nNew team focusing on money-laundering cases\nQuestions sent to the police about the progress on the suspected terrorism financing cases flagged to the Police Commissioner last year by the FIAU were not answered by the time of writing.\nPolice investigations of reports sent to it by the FIAU often result in a lengthy process, as the intelligence it receives from the unit has to be confirmed and translated into evidence that will hold up in court.\nThe European Commission has urged Malta to beef up its economic crimes unit, which is charged with investigating money-laundering and terrorism financing activities.\nPolice CEO Angelo Gafa told Times of Malta in March that the unit has been split into two, with a new team focusing solely on money-laundering cases.\nA spate of terrorist attacks across Europe over the past years has sparked renewed efforts by the EU to crackdown on terrorism financing.\nEU Security Union Commissioner Julian King in February heralded a political agreement facilitating the sharing of financial information to make it easier for law enforcement agencies to crack down on the financing of terrorism.", "comment_count": 1, "id": 680}, {"keywords": "Banking, Finance", "author": "Jacob Borg", "article_body": "■ Mario Mallia optimistic after ING’s withdrawal\nBank of Valletta’s CEO Mario Mallia is quietly confident the bank will find a replacement for ING which announced it was terminating its corresponding banking relationship in December.\nMalta’s biggest local back confirmed last week that its last remaining provider of US dollar transactions would be pulling the plug as part of a de-risking exercise.\nBOV CEO Mario Mallia\nThe Dutch bank had agreed to pay a €775 million settlement in a case where it stood accused of widespread breaches of anti-money laundering regulations.\nMalta is increasingly being viewed as a high-risk jurisdiction to do business with, at a time when large correspondent banks are seeking to reduce their exposure to such risks.\nIn an interview with The Sunday Times of Malta, Mr Mallia refuted claims of lax enforcement of Malta’s anti-money laundering laws.\nAdmitting that the jurisdiction as a whole had made mistakes in the past, the BOV CEO said these paled in comparison to recent international scandals involving global banks.\nGaddafi money accepted in different global context\nMr Mallia refused to entertain questions about specific clients when asked about some of BOV’s own recent controversies, including the handling of €90 million in Gaddafi money, the processing of a “suspicious” transaction in dollars to the company 17 Black and the on-boarding of an Iranian banker who has since been charged with money-laundering in the US.\nHe defended BOV’s track record on the Gaddafi front, saying the money was accepted in different global circumstances, at a time when the strongman was recognised as a legitimate leader and there were no money laundering concerns.\nWhen Libya was slapped with sanctions, BOV promptly froze all the accounts, which remain blocked till this very day.\nBOV to ‘put its money where its mouth is’\nMr Mallia pointed towards a general shift in the banking sector, which has become more conscious of improving anti-crime defences.\nHe vowed BOV would be putting its money where its mouth is by investing millions in upping its anti-money laundering defences.\nI am obsessed with the long-term\n“BOV is trying to set the standards for Malta when it comes to fighting money laundering. We are very much conscious of our responsibility towards the jurisdiction.\n“That is why we are investing such large amounts to make BOV and the jurisdiction a much safer place”.\nNews that ING was turning its back on Malta drew a variety of reactions, with Prime Minister Joseph Muscat putting it down to the bank’s success.\nAsked about this particular interpretation, Mr Mallia said BOV’s size had certainly drawn increased regulatory interest. BOV has grown rapidly, both “organically” and because other banks had been shrinking their business.\nMr Mallia said these factors now meant BOV had close to a 50% market share in the local banking sector. Smaller banks have so far largely maintained their correspondent bank relationship, although Malta Bankers’ Association chairman Marcel Cassar warned last week that the ING development was worrying, particularly if it was not driven by any specific problem at BOV.\nSo how come these smaller banks have maintained their US dollar correspondent banks and BOV has been dumped?\nAccording to Mr Mallia, it all boils down to a numbers game. BOV’s large size comparative to other local banks naturally meant correspondent banks viewed it as being higher risk.\nING’s withdrawal comes as ‘no surprise’\nING’s withdrawal of its correspondent banking services came as no surprise, as it was well known that it was conducting a de-risking exercise, Mr Mallia said.\nHe said efforts were under way to find alternative arrangements.\nDeutsche Bank terminated its servicing of such transactions for BOV two years ago.\nFar from viewing ING’s December withdrawal as a big doomsday clock ticking over his head, Mr Mallia calmly acknowledged the “importance” of having a US dollar correspondent bank.\n“We have reasons to be optimistic, although I cannot give any guarantees at this stage. We are seeing interest. There is also a Plan B and a Plan C.”\nAsked what these alternative plans were, Mr Mallia said the bank was working at ensuring that at a minimum, arrangements would be made to service certain important sectors that did business with BOV and traded in US dollars.\nMr Mallia said the vast majority of BOV customers would not be affected by ING’s withdrawal.\n“There is a very limited connection between the man in the street and US dollars.”\nTwo international firms are helping the bank\nBOV is now embarking on a two-year programme to bolster its anti-money laundering resources and shed the riskier elements of its business.\nMr Mallia said two international firms were helping the bank in its efforts.\nHe said the two-year programme had been embarked upon with the blessing of regulators in Malta and Frankfurt, where the ECB is based.\n“By the end of this programme, BOV will become one of the safest banks in Europe. This will make future correspondent banking relationships easier than they are today.\n“I am obsessed with the long-term. I will not be reaping the benefits myself of these programmes. I want to leave behind a strong and stable bank,” Mr Mallia said.\nThe function of a correspondent bank\nThe function of a correspondent bank is to conduct business transactions, accept deposits and gather documents on behalf of the other financial institutions, financial advisor Jesmond Mizzi explained to The Sunday Times of Malta.\nSince the European Central Bank started acting as the regulator to a number of banks in Europe, many banks have reduced their service offerings as part of their de-risking programme, Mr Mizzi said.\n“It is important to note that as far back as November 2015, the World Bank had highlighted the fact that large international banks had started to terminate their correspondent banking relationships with smaller local and regional banks.\nIn March 2017, the International Monetary Fund issued a report in which it was highlighted that restrictions in the appointment of correspondent banks and the termination of existing agreements could have an impact on the growth of such countries, Mr Mizzi said.\nHe said changes in regulations and the more rigorous prudent requirements being implemented by banks were playing an important part in who assists who in the banking sector.\n“In some way, I think that via the de-risking programme being undertaken by BOV and the more stringent checks and balances in respect of anti-money laundering and combating the financing of terrorism being implemented by all, BOV should be in a better position to find alternative providers for such services.\n“I am sure that the bank is seeking to appoint an alternative correspondent bank and given the bank’s strong profitability and balance sheet, it should be a matter of time before they solve this matter.”\nPotential implications ‘not critical’\nThe implications for local businesses were not critical given that there were global and local players offering payment services in US Dollars, Mr Mizzi said.\n“The concern that particular riskier areas of businesses like gaming companies, medical cannabis and cryptocurrency companies would not be able to operate from Malta needs to be evaluated, but I understand that most local banks do not offer services to these companies or if they do, they do not affect payments in US Dollars on behalf of these companies.”\nAs banks de-risked, they stood a better chance of engaging with other international banks, he added.\nMr Mizzi said local authorities also had an important role to play in ensuring that Malta was implementing the necessary regulations in line with other jurisdictions.", "comment_count": 25, "id": 681}, {"keywords": "Politics, Construction, Planning Authority", "author": "Ivan Camilleri", "article_body": "An architect engaged by Infrastructure Minister Ian Borg to submit a controversial development application on his behalf is now serving as a top director within his ministry.\nNadia Gatt Curmi had submitted Dr Borg’s application in 2014 to turn a dilapidated farmhouse in an outside development zone in the limits of Rabat into a 400-square metre home.\nThe 32-year-old architect is now serving as director of Project Design and Engineering at the Ministry for Infrastructure, headed by Dr Borg, The Sunday Times of Malta is informed.\nEarlier in the year, Dr Borg appointed the architect as director on the newly formed roads agency, Infrastructure Malta.\nA few years ago, when Dr Borg was defending himself in front of the Commission against Corruption over allegations of wrongdoing to obtain his home’s permit, he had cited his architect’s “inexperience” as proof that he did not wield any political influence.\nRELATED STORIESNo swimming pool for Ian Borg\n“Parliamentary Secretary (now Minister) Ian Borg said he had met his architect, Nadia Curmi, who used to work with a private company, and that she was appointed directly by him,” the commission’s report states.\nAt the time, he denied using any influence or abuse of power to obtain his permit.\n“If I had to use such influence, I would not have appointed an architect with no experience,” he told the commission. The architect was recruited in the public service when Dr Borg served as Parliamentary Secretary and a few months before his appointment as Infrastructure Minister.\n“The new director has managed to place first in the interviews made, even though many other architects who were already in the public service and had served for decades had applied for the job,” a ministry source said.\nAsked to explain his relationship with Ms Gatt Curmi and whether he was still her client, Dr Borg said it was a professional relationship “solely related to the development application of his matrimonial home”.\nHe said her appointment within his ministry was made in January 2017, a few months before he was appointed Minister.\nHe confirmed he had appointed his architect on the board of directors of Infrastructure Malta but, he said, this was “in her capacity as director” within his ministry.", "comment_count": 82, "id": 682}, {"keywords": "Statistics, University, Research, Education", "author": "Claire Caruana", "article_body": "One in every five Maltese students “gets angry” when foreign children demand the same rights as them and believe that some are inferior, a study has revealed.\nA “substantial number” of children also displayed traits of intolerance and prejudice against non-Maltese peers, with researchers suggesting this could possibly reflect fear, anxiety and mistrust resulting from lack of information, interactions and experience.\nThe data, which emerged from a study by University of Malta researchers and commissioned by the Children’s Commissioner, analysed the lives of foreign minors and their overall well-being.\nA section of the study focused on the attitudes of Maltese students towards their foreign peers, with more than 1,000 pupils from state, Church and independent schools interviewed. Data from the Maltese students was gathered between October and November last year.\nStudents still hesitant and resistant to intercultural integration\nThe researchers also found that the Maltese students’ attitudes varied according to the nationality of their peers. While they were accepting of those from the West, namely students from Western Europe, North America and Australia as well as those from Latin America, they seemed to “like” students from certain other countries much less.\nThis was mainly the case with those who hailed from the Maghreb, the Middle East and sub-Saharan Africa, with the researchers highlighting what they described as “apparent prejudice” against children from these regions.\nThere appeared to be “mixed feelings” about Eastern Europe and East Asia and ex-Soviet Union countries, the researchers concluded in their study.\nOn students who held positive views of foreign children, the researchers found those from independent schools as well as those attending primary school were most likely to have a tolerant and open approach towards their foreign peers. Those from Gozo, meanwhile, were found to have the least positive opinion of students coming from different countries.\n“Students attending culturally diverse classrooms who live in culturally diverse neighbourhoods and who have non-Maltese friends entertain more positive views about the consequences of foreigners living in Malta,” the researchers noted.\nAlthough being somewhat wary of their foreign peers, the data also suggested that the majority of Maltese students are against the segregation of foreign students in school and out of school activities, and “in favour of assimilation and integration in Maltese society”.\n“A substantial number of students are still hesitant and resistant to intercultural integration. These are likely to attend church and secondary schools and have few non-Maltese children in their community or school or as friends. Younger primary school students, female students and students in state schools are more in favour of inter-culturalism and assimilation and less pro-separation,” they added.\nThe part of the study that focused on the foreign students’ attitudes, reported by the Times of Malta earlier this week, revealed that one in every three foreign students experienced some form of bullying while at school.\nAccording to the data, the most common form of abuse was name calling, with almost 45% of students experiencing this type of bullying.\nThe figure was only slightly lower for two other forms – hitting and being “left out” – with 33% experiencing this form of bullying.\nThe research was conducted by Carmel Cefai, Noemi Keresztes, Natalie Galea, Rachel Spiteri from the University of Malta.", "comment_count": 0, "id": 683}, {"keywords": "Society, Health, Childcare", "author": "Fiona Galea Debono", "article_body": "The parents of a five-year-old boy with a rare disorder are doing their utmost to give him a leg-up in life. But they are having to deal with a double blow: the challenging condition his younger sister is also facing. They tell Fiona Galea Debono they will never stop looking for opportunities to improve their children’s future.\nAll children are special and unique – but siblings Luke and Chrissy Pitt happen to both have conditions that make them that precious one in 250,000 and one in 30,000 respectively.\nWhen Luke was born with a bowed leg, his parents Audrey and John did not think much of it – it was quite normal and was meant to straighten, or so they thought.\nAt six months, however, he was diagnosed with Neurofibromatosis type 1 (NF-1), a genetic disorder of the nervous system that afflicts one in 3,000 births, and in Luke’s case, developed from a spontaneous mutation in the genes. But it did not stop there…\nIn extremely rare cases, NF-1 can also cause limb deformities, and the cherub-like baby’s leg bone was surrounded by tumorous tissue that ate away at it. \nStrong and determined, the parents left no stone unturned to find the best possible treatment for their son. They embarked on a journey to see Luke, now five, run freely, and this summer, they are travelling back to the US for two more operations.\nAt first, their research proved disheartening. They were facing one of the most challenging orthopaedic surgeries to treat the disease effectively, as well as plenty of ensuing complications, including a high re-fracture rate and loss of union of the tibia. \nShockingly, they also discovered that, in the UK, where they sought medical advice, most parents had opted for amputation for their children. But Audrey and John simply would not accept that path for Luke and their determination and hope led them to look for other routes.\nIn Germany, expected results from the more advanced methods to treat the disease would still have posed many limitations for the then three-year-old boy, who would have had to wear a brace for the rest of his life, while spending a year with a bulky external fixator to grow the bone.\nThis also meant his parents would have to turn its screws every six hours, resulting in loss of muscle and the possibility of infection.\nWanting the best for their child, they explored the possibility of treatment by world-renowned orthopaedic surgeon Dr Dror Paley, whose name and his 100 per cent success rate had been popping up in their connections via Facebook with other parents in the same situation.\nJohn and Audrey speak.\nThey went from the bleak prospect of amputation to the promise of bone union and no refractures.\nNonetheless, Audrey admits it was the longest and toughest decision the family ever had to make.\nIn February 2017, Luke underwent a life-changing, five-and-a-half-hour surgery, which culminated in “a look of pride in Dr Paley’s eyes” when he emerged from surgery that Audrey can never forget.\nToday, despite what the family is about to go through again in the next stage of treatment, she feels serene about Luke’s condition and is raring to get it done, knowing that the right treatment has been found and taking the whole experience in her stride.\nThe Pitt family: Luke, John, Audrey and Chrissy. Both children have unrelated, rare genetic conditions. Photos: Chris Sant Fournier\nI couldn’t believe our daughter was diagnosed with a separate unrelated genetic condition just as we thought we finally had things under control with Luke\nBut she admits the second blow, dealt by Chrissy’s condition, diagnosed when she was one, was a bitter pill to swallow – she could not believe the saga had not ended with Luke’s ordeal.\n“I had accepted Luke’s situation but I couldn’t believe that our daughter was diagnosed with a separate unrelated genetic condition just as we thought we finally had things under control with Luke. What were the chances?”\nThe family had to face a barrage of new medical terms they had never heard of as Chrissy was diagnosed with an imbalance of chromosome 8, which means she is globally delayed, intellectually and physically.\nA placid baby and a godsend, it soon turned out that her quiet nature was not what it seemed and that something was not quite right with her development.\nThings came to head just before the Pitts travelled to the US for Luke to undergo his first operation. She was left behind with her grandmother for further investigations at Mater Dei.\nChrissy was diagnosed with motor-planning difficulties and the family’s focus soon shifted to her and the need to provide continuous therapy for the now three-year-old to help her overcome her challenges and be able to achieve independent walking and speech.\nIn truth, while Chrissy is a determined, hard-working child, her condition is even more complicated than Luke’s. “I wish I had the solution for her that we have for my son. We now know that by 16, once he reaches bone maturity age, Luke will remove the leg brace he wears for protection when he goes out.\n“But Chrissy’s condition is neurological, and apart from therapy and the constant input from the family and her LSE to improve her independence, there is little else we can do...\n“I worry about her needs when we are not around anymore, so now is the time to help her to be semi-independent at least by being able to make herself a piece of toast and a cup of tea in the future…”\nThe family struggled with the idea of publicising their story to protect their children’s privacy but eventually, strengthened by others’ support, they decided to go for it to raise both money and awareness about these conditions.\n“During our research, we met so many families who are in the same boat and we drew so much support and information from them. Now, it is our turn to give back to those who are wondering what direction to take.”\nLuke’s first surgery in Florida cost €115,000, which the working parents self-funded, thanks also to the support of family and friends.\n\nThe upcoming surgeries involve the removal of metal work in the leg that has done its job and the replacement of telescopic rods that grow with Luke and have reached their maximum length, as well as tackling an ankle issue. And the bill will amount to €67,000, excluding travel and accommodation expenses.\nMoreover, Chrissy’s 10 weekly therapy sessions cost them an additional €12,000 a year.\nThey are grateful to anyone who has helped them in their journey so far and have now set up a fundraising philanthropic entity and campaign through a temporary voluntary organisation, A Better Life for Luke Association, complete with a website and Facebook page that is being launched today to guide people to contribute further.\nLuke has asked to “cancel the operation”, but his parents reassure him of their support. Sometimes, he asks them why the other children are running away from him, and they explain that they are only running faster.\nDespite these concerns – and the fact that before the first operation, Luke suffered to walk – his leg has healed well and the bone has strengthened and joined. He is determined to jump and is constantly practising, but otherwise, he is doing pretty much what other children his age do…\nOnly last month, Luke participated in his school’s Sports Day. Few parents and children there would have noticed what a massive milestone that was for the boy and his family. And the fact that they didn’t is actually a good thing.\nIt is testament to the unstinting efforts of his parents to give their son a leg-up in the race of life and remove any stumbling blocks along the way. Luke could run with his friends, and although most would take that for granted, for the Pitts, the racecourse has been much longer and the hurdles higher.\n“It all feels very unreal, but we will continue to do the best for both our children. Our promise to them is that we will never stop looking for opportunities to give them a better life.”\nYou can help too\nTo contribute to Luke’s medical bills, check out www.abetterlifeforluke.com and Facebook page A better life for Luke. Donations can be made by bank transfer to the BOV account: A Better Life For Luke Association, MT65 VALL 22013000000040025883194; via SMS on 50619258 for €11.65; or using PayPal and credit cards through the website. If funds raised exceed the goal to cover the cost of the upcoming two surgeries, the money will be transferred to another voluntary organisation.", "comment_count": 2, "id": 684}, {"keywords": "Politics, PN, Adrian Delia", "author": "Herman Grech", "article_body": "Updated 6pm\nDozens of signatures have been collected from Nationalist Party councillors to force a vote on Adrian Delia’s leadership, Times of Malta is informed.\nBy Sunday afternoon, the petition had already exceeded the 150 signatures needed to spark off the secret vote, multiple sources said.\nThe petition means Dr Delia’s future at the helm of the party is expected to hinge on a vote of confidence from some 1,500 councillors at the General Council.\nIt reads: “After the results obtained by the PN in the European and local elections of 25 May 2019, should the party leader take political responsibility and resign? Yes/No.”\nIt is the latest chapter in a drama which has seen Dr Delia’s surprise election to the PN leadership in 2017 hampered by party rebellion, culminating in a humiliating defeat for the party at the European and council elections in May.\nIvan Bartolo\nIn a Talking Point to appear in Monday's print edition of Times of Malta, former PN election candidate Ivan Bartolo reveals he was the first to put his signature on the petition calling for the vote of confidence.\nStatus quo is the absence of change. We must change, otherwise we may cease to exist forever- Ivan Bartolo\nMr Bartolo writes: “My mission is clear, I want to unlock the current status quo within the Nationalist Party as it needs to start regrouping and reinventing itself to save Malta’s democracy. If Dr Delia is once again confirmed as leader of the Nationalist Party, then it is for him to continue to lead the show and all the rest must either back him up or back off. At best, his mandate would be to try and reduce the expected meltdown of the party.\nRELATED STORIESDetermined Delia soldiers on after rowdy meetingPN leader given until Tuesday to tell MPs what he intends to do\n“If Dr Delia loses the vote of confidence, we must turn the page and open a new chapter for the party in order to help it get back on its feet. Regardless of whether the party would be led by a caretaker leader for a few months or immediately by a new leader, I have no doubt that there will be people of talent and conscientiousness who will step forward and rise to the occasion.”\nHe concludes: \"Status quo is the absence of change. We must change, otherwise we may cease to exist forever.\"\nDr Delia made it clear he had no intention of resigning from the party, despite opposition from at least 10 of his own MPs.\nThe president of the PN’s executive committee Mark Anthony Sammut was the first to step down after the May defeat saying he wanted to set an example for political responsibility.\nDr Delia’s close ally Pierre Portelli also resigned last week at the end of a stormy meeting with parliamentarians.\n ", "comment_count": 192, "id": 685}, {"keywords": "Environment, Fire", "author": "Ivan Martin", "article_body": "Updated 6pm, adds FKNK statement\nEnvironmental experts will assess the damage caused by a large fire in the Miżieb woodland that broke out on Saturday and try to pinpoint the likely cause.\nA spokesman for Environment Minister José Herrera told Times of Malta that a team of experts from Ambjent Malta and the Environment and Resources Authority would be analysing the extent of the damage caused to the area.\nThe team would also be trying to pinpoint what caused the fire, and draft an action plan to avoid future recurrences.\nFirefighters battled the large grass fire in the Miżieb woodlands of northern Malta until early on Sunday.\n\nThe fire broke out on Saturday morning and firefighters reached the scene soon after receiving the first reports of smoke in the area.\nSeveral hours later, they were still working to contain the fire, with smoke which could be seen from kilometres away.\nThe day after. Video: Chris Sant Fournier\nThe Hunters’ Federation FKNK on Sunday said that they suspected that the fire may not have been a natural occurrence, and have reported it to the police.\nThe hunters lashed out against continuous vandalism to the area, and called for adequate surveillance and enforcement to crackdown on the abuse.\n\nSources involved in the policing of the natural environment told Times of Malta that the fire was most likely the result of one of three possible factors.\n“Yesterday farmers were burning dry grass in nearby fields so that could have caused the outbreak. This could also have been the result of some trash which was abandoned in the countryside and caught fire in the blazing sun. Or, this fire could have been a natural event. It remains to be seen which of these the actual cause was,” a source said.\nFKNK statement\nIn another statement in the afternoon, the FKNK said that shortly after the fire was put out on Sunday, vandals scattered rubbish all around the area.\nMembers who went on site to continue with their conservation work found a disaster and had to call the police.\nThe FKNK said that no damage, vandalism or provocation would stop its members from working on the reserve and it would continue to insist all reserves should have the necessary official surveillance and enforcement.\nIf anyone believed Saturday’s fire could have started on its own, there was no doubt that Sunday’s vandalism was a cowardly action by vandals.The FKNK warned that no confrontation would lead it to give up the reserves which it had been managing since 1986.\n ", "comment_count": 10, "id": 686}, {"keywords": "Construction, Joseph Muscat, Politics", "author": "Ivan Martin", "article_body": "A final decision on proposed legislative changes to the construction industry will be taken in the coming days, even if certain professionals were not happy with it, Prime Minister Joseph Muscat said on Sunday.\nSpeaking during an interview on the Labour Party’s ONE Radio, Dr Muscat said that by Friday the government had received 250 notes of feedback to its proposed legislative reform.\nHe would be meeting with several experts this week, and Cabinet would agree on the way forward in the coming days.\nAccording to the proposed changes, architects would have to report on the measures being taken to protect neighbouring buildings from demolition and excavation works.\nThe legal amendments were drafted by the authorities and sent to industry stakeholders earlier in June following a series of consultative meetings.\nThe recommendations came at the end of a week which saw a building collapse in Mellieħa and the wall of another fall apart in Guardamangia. In April, an apartment block next door to a building site had also crumbled in the dead of night.\nStakeholders were given a week to provide feedback on the proposals amid a temporary ban placed on all demolition and excavation works.\nArchitects attending a meeting to discuss proposed changes raised the possibility of a 'strike' on Friday evening, although the Chamber of Architects and Civil Engineers that represents them stopped short of suggesting that as a course of action.\nThe possible strike - which could involve architects refusing to take on responsibilities emerging from the new law or other duties related to construction - was among several courses of action raised by members during the meeting.\nSpeaking on Sunday, Dr Muscat said the country had a situation where if something went wrong at a construction site, all those involved would start finger pointing, with no one actually taking any responsibility.\n\nThere would be some, he said, who would be in-favour of the reform and some against. But he would not allow a situation where no one was held responsible.\nDr Muscat also lashed out at “empty talk” of some involved the sector.\n“You'll be amazed how many experts come out of the woodwork… What we don't want to do is become a filing cabinet of studies that serve no purpose. We want to have studies on sites that truly protect people’s safety,” he said.\nThe Labour leader said that he was also expecting some to complain that the reform would place added financial burden on those seeking to develop a property.\nDr Muscat said the government wanted to reach a balance between ensuring public safety, and the financial burden placed on those undertaking a project.\nThe guiding principle, however, would be “safety first and foremost”.", "comment_count": 26, "id": 687}, {"keywords": "Accident, Police", "author": "Claire Caruana", "article_body": "Updated 11.10am\nA 71-year-old man who was fishing in Ċirkewwa was found dead out at sea on Sunday morning, the police confirmed. \nA police spokesman told Times of Malta that people who were in the area called to report that the man, a Birkirkara resident, was \"in distress\" and by the time he was pulled out of the water, he had died. \nThe spokesman said it is not yet clear whether the man died as a result of the fall or whether he was unwell before falling into the sea.\nThe police are investigating.\nAn inquiry is being held.\n \n \n ", "comment_count": 0, "id": 688}, {"keywords": "Migration", "author": "", "article_body": "Updated 1.55pm\nA group of 37 migrants arrived in Malta after they were rescued by the Maltese authorities earlier on Sunday.\n\nPhoto: Jonathan Borg\nThe group were in a boat that left Libya more than a day ago. With their boat in danger, they called Alarm Phone, a service for refugees in distress at sea.\nThe NGO contacted the Maltese authorities who confirmed they would be rescuing the migrants.\nThe organisation hoped all 37 would make it to safety, claiming some were \"near death\" and needed immediate medical care.\n\"We hope there were no fatalities and we relieved they were finally found,” it said.\nA spokesman for the AFM said the condition of those on board is not yet known. \nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\n ", "comment_count": 0, "id": 689}, {"keywords": "Media", "author": "", "article_body": "BOV loses US dollar service: Bank of Valletta lost its last correspondent bank for US dollar transactions after the Dutch bank ING decided to pull the plug on its relationship with BOV as from December. In a statement BOV said it has intensified its efforts to engage alternative correspondents.\nProposals to safeguard third-party properties: Proposals aimed at protecting third-party properties from damage caused by adjacent excavation and construction works were published by the government in the wake of the recent spate of accidents which led to the collapse of entire blocks. Under these proposals architects and site managers will have to adhere to stricter regulations and fines may go up to €50,000.\ndb permit ‘null’: The developers behind the controversial db Group City Centre mega project in Pembroke will have to resubmit their proposal to the Planning Authority. The Appeals Court, presided over by Mr Justice Mark Chetcuti, ruled that a member of the PA board, Matthew Pace, had a conflict of interest when he was called to decide whether to award a permit for the project. Legal analysts told his newspaper that the court decision warns all Planning Authority board members they may need to recuse themselves from a second vote on the project as they had already expressed their position on the matter.\nDelia hangs on as MPs demand his resignation: Nationalist Party leader Adrian Delia was faced by calls to step down from several of his MPs on Tuesday night but rejected them, before telling waiting journalists that no one at the parliamentary group meeting had asked for his resignation, the Times of Malta reported. Delia also rejected a demand from his MPs to at least go before the party’s General Council and ask for a vote of confidence. Prior to the meeting of the parliamentary group PN media head Pierre Portelli, a close aide to Dr Delia, resigned.\nPA used wrong policy to approve Planning Minister’s pool: The Appeals Court decided that the Planning Authority and its appeals tribunal used the wrong policy to issue a development permit for Transport and Planning Minister Ian Borg. The permit was to transform agricultural land into a swimming pool and recreational area. Legal sources told the Times of Malta that the issue will now have to be discussed by a new appeals tribunal composed of different members.\nNeville Gafà back in Libya on government delegation: Neville Gafà, whose role with the government has never been explained, last Tuesday formed part of an official government delegation in Libya, the Times of Malta revealed. Mr Gafà is a Labour Party activist and a member of OPM chief of staff Keith Schembri’s inner circle. He was allegedly involved in a medical visas racket linked to Libyan refugees and was subsequently sacked by the Health Ministry. Neither Mr Gafà nor the government replied to questions by the Times of Malta about the Libya trip.\nWhat they said\n“I think it’s a situation where the industry has grown at a much faster rate than the capacity of the institutions governing it; that is the truth.”\nPrime Minister Joseph Muscat speaking about the state of the construction industry.\n“You demolished the country’s soul and instead covered us in concrete.”\nActivist Wayne Flask criticising developers during a protest against the construction industry in the wake of three building collapses in two months because of adjoining sites under excavation.\n\n“Today’s society is thirsty for certainty and truth.”\nMr Justice Franco Depasquale giving his inaugural speech during his first court sitting. \n“They come for a short time and they get it wrong but you have to tell them that they are wrong.”\nFinance Minister Edward Scicluna speaking at a conference where he criticised the way investigators from anti-money laundering agencies come to Malta to look into the local situation.", "comment_count": 2, "id": 690}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta says a scheme to help give unemployed people the skills to find a job, run by the General Workers’ Union, has cost the government €30 million but has only helped 44 participants move on to productive work. In another story, the newspaper says a study has revealed that one in every five Maltese students gets angry when foreign children demand the same rights as them and believe that some are inferior.\nThe Malta Independent on Sunday says there is a wall of silence surrounding the presence of Neville Gafa at diplomatic talks in Tripoli.\nMaltaToday says the church had released land tapped for a cruise port for just €200,000.\nKullħadd says the vacated posts within the Nationalist Party are increasing tensions between the party’s different factions.\nIllum says Minister Helena Dalli is aiming for the post of European Commissioner but no decision has been taken so far.\nIl-Mument says Transport Minister Ian Borg has been to the United States to prepare himself for the eventual election for the Labour leadership post.\nIt-Torċa quotes a representative of the Federation of Estate Agents saying that the proposed regulations would remove responsibility.", "comment_count": 0, "id": 691}, {"keywords": "Police, Crime", "author": "", "article_body": "A man is seriously injured after he was knifed on Saturday during an argument in Senglea.\nThe police said the argument, between a 29-year-old man from Senglea and a 33-year-old man from Cospicua, took place at an apartment in Triq il-Vitorja at 9.20pm.\nAn ambulance took the younger man to hospital while the older one is being held by the police.\nAn inquiry is being held.\nThe police are investigating.", "comment_count": 0, "id": 692}, {"keywords": "Construction, Architecture", "author": "", "article_body": "The Kamra tal-Periti has welcomed the publication of a list of licensed masons on the website of the Building Regulation Office (BRO).\nIt said it expected the BRO not to permit works to continue on any site where masons were found not to be on the list.\nThe chamber said it had been asking for the publication of such a list for many years, and each time it was told that this could not be published for reasons of data protection.\nThe law states that one cannot exercise the trade of a mason without a licence. This was required to give assurance to the owner of the site, the architect in charge of the project, and society that such person was qualified to carry out this trade and had received the appropriate training.\nThe chamber said that the responsibilities laid down in the law were very clear. This said that if any mason, through unskillfulness, imprudence or carelessness, caused any injury to a person or damaged property, a magistrate could interdict him from the exercise of his trade for any time and withdraw his licence.\nRELATED STORIES'They told us it was safe' - Residents evacuated as wall collapsesBuilding collapses in Mellieħa\nThe Civil Code, the chamber said, placed the onus for the structural integrity jointly on the architect and the contractor. The Building Regulation Act also placed the obligation on the BRO to issue the licences and register masons, fire consultants, other consultants in the building industry, building contractors and tradespersons.\nAn extraordinary general meeting of the chamber two days ago demanded that such licencing and registration was implemented.\nIt reiterated its willingness to support the government in setting up systems for the registration and licensing of contractors in accordance with the BRO’s obligations.\nThe meeting followed the issuing of proposals by the Infrastructure Ministry, which include stricter procedures and regulations for architects and contractors, and increased fines of up to €50,000. The draft legal notice is intended to safeguard properties from damage caused by adjacent excavation and construction works, as “piecemeal and ill-thought”. \nIt comes after three buildings - two in Guardamangia and another in Mellieħa - were destroyed or severely damaged by nearby works.\nIn a draft position published a few days ago, the Chamber lambasted the draft legal notice.\nThe list of registered masons can be seen in the pdf link below.", "comment_count": 40, "id": 693}, {"keywords": "Employment, Unions, Local councils", "author": "Ivan Camilleri", "article_body": "A scheme to help give unemployed people the skills to find a job, run by the General Workers’ Union, has cost the government €30 million but has only helped 44 participants move on to productive work.\nThis figure represents just 5% of the 839 long-term jobless persons who have been taken off the unemployment register since 2016 and moved into the training scheme.\nThe scheme is operated by the GWU’s Community Work Scheme Foundation under a five-year concession in return for ‘management fees’ that, according to a National Statistics Office report, amount to just under €1 million a year.\nThe purported aim of the scheme is to help people find alternative employment by giving them new skills. But according to the findings of an audit carried out by the NAO, it is not delivering results.\nThe NAO also found that while the scheme was originally intended to cater only for the long-term unemployed, hundreds more people have been added to its payroll, considerably boosting the management fees paid to the GWU foundation.\nAnd Jobsplus, the government’s employment agency, does not have the tools to monitor what is going on at the scheme, the NAO has concluded.\nThe scheme was originally introduced in 2009 and was administered by the Employment and Training Corporation (ETC), which has since been superseded by Jobsplus. It was known as the Community Workers Scheme, providing a number of hours of training per week to participants, who received 75 per cent of the minimum wage.\nAt the time, participants were kept on the unemployment register.\nHowever, in 2016, the government decided to ‘privatise’ the scheme and outsource its management to a private entity. A call for tenders was issued and won by the GWU foundation.\nAbout 600 unemployed people were put on its books on a full-time basis while receiving a full minimum wage. These people were struck off the unemployment register and, for national statistics purposes, regarded as working in the private sector.\nParticipants reluctant to seek more gainful employment\nThe NAO audit, published a few days ago, found that no adequate training had been given to participants to help them move on to alternative employment. Instead, they have been performing minor jobs at schools, local councils and NGOs.\nThe audit found that only 44 of the original participants have so far left the scheme for alternative employment. At the same time, contrary to the stated intent, the number of unemployed placed into the scheme has ballooned by about 300, reaching 839 by the end of last year.\nThis has not only raised the cost of the scheme to taxpayers but has also considerably boosted the amounts in fees payable to the GWU.\nRELATED STORIESGWU will earn €8.5m from government jobless scheme - ministry says it will earn lessJobless told there is no place for them in Community Work Scheme\nAccording to the NAO, when it was introduced the scheme was costing taxpayers nearly €7 million but that figure has since doubled, reaching €14.5 million last year. It has so far cost €30 million.\nAt the time of the 2016 agreement, the foundation was being paid €980 per participant per month, from which minimum wage and NI contributions were deducted. That amount has more recently been raised to over €1,280 to go towards an increase in salary.\nThe government has never revealed exactly how much the foundation is making off the scheme.\nHowever, the NAO has queried the management fees and their cost to government, as well as the lack of checks and balances. \n“Jobsplus is not reviewing the financial statements (of the GWU Foundation) for any significant and unusual transactions,” the office pointed out in its report.\n“A case in point relates to the management charges payable of around €822,000 and €959,000 quoted within the 2016 and 2017 financial statements respectively,” it said.\n“To date, Jobsplus has not enquired with the foundation as to what these amounts represent.”\nThe NAO said that based on its assumptions related to the productivity of its participants, the scheme may still be cost effective for the government, when considering the amount of unemployment benefits those on this scheme would be entitled to if jobless. However, Jobsplus needs to pull up its socks in its monitoring.\nThe NAO noted that the government lately decided to increase the salaries of those on the scheme by some €200 a month but this, in reality, works against the aim of the scheme.\n“Such an increase does not incentivise participants to seek alternative employment, particularly within more productive sectors,” the NAO report says.\n“Given the improved working conditions, the risk exists that the scheme becomes an end in itself as participants became increasingly reluctant to seek more gainful employment within more productive sectors.”", "comment_count": 83, "id": 694}, {"keywords": "Health, Accident", "author": "Sarah Carabott", "article_body": "Medics had to turn away around 50 potential blood donors every week last summer, because they had travelled to countries where a rare virus is present.\nNow, a new testing platform being rolled out by the National Blood Transfusion Service could drastically reduce that number.\nPeople who travelled to countries affected by the West Nile Virus cannot give blood for 28 days after they have returned from those countries, to ensure their blood is not contaminated with the virus.\nSuch countries include Italy, Romania, France, Hungary, Austria, Croatia and Serbia.\nNew equipment to be installed in July will now allow local medical laboratory scientists to screen blood for the virus, reducing the number of deferrals.\nAlex Aquilina, who heads the National Blood Transfusion Service, appealed for blood donors to come forward and said that if donation patterns persist, the supply of blood might not be enough in the event of a major accident.\nSupplies running low\nThe number of donations usually declines in summer and Dr Aquilina said that while the requirement is of 50 donations per day, there have been days where only between 20 and 30 donations were taken.\nMeanwhile, there have also been ‘spates’ of accidents that sometimes happened over a very short period of time (as last weekend), leading to a sudden surge in demand.\n“The NBTS aims to keep a stock supply of four to five days, however the stock has lately been for two, maximum three days, which is below the level where we can cover for a major accident,” Dr Aquilina said.\nBlood is essential for operations, accidents and cancer treatment among others, and with improved technology hospitals across the world are now able to use their limited blood resources in a smarter manner.\nConverting all blood to type O?\nScientists abroad have found a way to convert all blood types to the universal O type that is safe for all patients to receive, by using human gut microbes.\nDr Aquilina said that while the preliminary results were promising, one had to consider that this would only change the blood group to O, so there would still be the need for blood donations of the same amount.\nIt would certainly improve logistics and help in emergencies, however, it was still in early experimental phase, and to convert blood to ‘industrial use’ will take many years, if at all.\nThose who wish to donate blood and have returned from abroad over the past four weeks should phone 8007 4313 to check if they are eligible. Donors should take their identity card, driving licence or Maltese passport with them.\nTo keep updated, look up National Blood Transfusion Service – Malta on Facebook.", "comment_count": 8, "id": 695}, {"keywords": "Politics, PL", "author": "Ivan Camilleri", "article_body": "The Labour Party is breaching laws that regulate the use of electoral billboards, with thousands of euros being made from leasing them to commercial entities, the Times of Malta is informed.\nAccording to the rules, political parties may put up election billboards without the need of a permit on condition they are only used during an electoral campaign.\nBy law, the billboards have to be removed a week following the publication of the election result. Also, according to the law they are only meant to be used to display political messages.\nHowever, the Labour Party has not removed its billboards and many remain along the main road arteries, some even posing potential traffic hazards.\nThe same billboards are also being used to promote commercial products or services for private companies.\nBillboards posing potential traffic hazards\nMore than 60 Labour Party billboards are now displaying commercial advertising, at a cost of about €500 a month to the advertiser, an industry insider has told the Times of Malta.\n“That means that through this illegality, the party in government and their contractors are not only breaking the law but also making an extra €30,000 a month,” the source said.\nThe provider of Labour’s billboards is Aiken Services Ltd, a company which has been responsible for the party’s billboard campaigns since Joseph Muscat became leader.\nOne of the company’s owners, John Debono, was appointed Ambassador to Azerbaijan in 2014 while the other shareholders have other businesses closely connected to Labour and have been recipients of a number of government direct orders, the Times of Malta is informed.\nOne of the Labour Party’s billboards with enforcement notices attached to it. Photo: Chris Sant Fournier\nWhen asked, a Planning Authority spokesman said enforcement notices started to be issued and, unless removed by billboard owners, the PA will proceed to remove them at the owners’ expense.\nFollowing the Times of Malta’s queries, enforcement notices have been affixed to Labour’s billboards as well as to others owned by  commercial companies.\nThe PA had previously acted immediately to remove certain illegal billboards. Last year, billboards calling for justice over the murder of journalist Daphne Caruana Galizia had been re-moved within a day.\nAsked why Labour was breaching the law and had failed to remove its billboards, a spokesman said: “As per law, Partit Laburista stopped using these billboards a few days after the elections. Partit Laburista doesn’t make any profit from commercial billboards.”\nThe spokesman did not say who was profiting from the billboards, why they were not removed and who Labour’s contractor is.\nOn the other hand, the billboards used by the Nationalist Party were cleared by the party according to the provision of the law.\nWho provides Labour with its billboards?\nJohn Debono\nLabour has been using the services of Aiken Services Ltd since 2013.\nAiken’s shareholders are two separate companies.\nThe majority shareholder, Customs Brokers Agency, is owned by the Debono brothers, and chaired by John Debono known as ‘Il-Gandhi’.\nIn 2014, Mr Debono was appointed as non-resident Ambassador to Azerbaijan, Kazakhstan and Ukraine. He had no previous diplomatic experience.\nThe minority shareholder is Kap Services Ltd owned by Kenneth Abela and Alan Piscopo.\nThe two businessmen are very close to the Labour Party and own other companies, which received direct orders from the government during the past years.", "comment_count": 58, "id": 696}, {"keywords": "Accident, Sliema", "author": "", "article_body": "A man who crashed his car into a stationary concrete mixer truck in Sliema on Saturday morning is in hospital with grievous injuries, the police said in a statement.\nThe 66-year-old Sliema resident was driving a Toyota Aygo on Tower Road when he collided with the Astra concrete truck at around 11.30am.\nA medical team took the man to Mater Dei Hospital by ambulance, where he is receiving treatment.\nThe police said they are investigating further.", "comment_count": 0, "id": 697}, {"keywords": "Migration, University, Diplomacy", "author": "", "article_body": "The lack of surveillance in the Mediterranean is making it easier for criminal networks to smuggle people across the sea to Europe, Foreign Minister Carmelo Abela has said. \nMinister Abela noted that with the scaling down of the EU’s Operation Sofia, smugglers and traffickers had grown more daring.\nOn Friday, Italian media outlet Corriere della Sera published aerial footage showing purported smugglers tow an empty boat out to seas outside Lampedusa before cramming the boat with 81 migrants and leaving them there to float and continue the crossing alone.\nThe smuggler vessel was subsequently caught and seven people aboard apprehended, the Italian news outlet said.\n\nDr Abela expressed concern about the lack of coordination between EU member states when it came to migration issues, saying solutions remained ad-hoc ones.\n“It is only through solidarity, a concerted effort and responsibility sharing by all stakeholders that the issue  can be effectively addressed,” he said.\nThe minister was speaking at a closing address for a joint training programme organised by the International Institute for Justice and The Rule of Law (IIJ) and the Mediterranean Academy of Diplomatic Studies (MEDAC).\n30 professionals, among them five Maltese, completed the programme.", "comment_count": 4, "id": 698}, {"keywords": "Prostitution, Crime, Human rights", "author": "Ivan Martin", "article_body": "The first locally documented case of an underage girl trafficked into prostitution last year could be one of several, sources within the child protection sector fear. \nMaltese authorities identified and referred a child trafficking victim to care for the first time ever last year, a Trafficking in Persons report by the US State Department published on Friday noted.\nThe Maltese girl was a victim of sex trafficking, the report says, and had subsequently given comprehensive and specialised support.\nA source involved in the provision of care for the minor told the Times of Malta that the teenager had been made to work as a prostitute by a Maltese pimp.\n“This is, unfortunately, something that we fear is far more widespread than just one case,” the source said.\n“We hear stories from Maltese women involved in prostitution that paint picture of teenagers being coerced into this world, often by family member seeking to profit off their misery,” the source said. \nSomething that we fear is far more widespread\nA social worker, dedicated to trafficking victims, was employed last year, and in March 2019, the legal aid agency trained victim assistance lawyers to handle these kind of cases.\nMeanwhile, the report gives an insight into policing of human trafficking in Malta.\nThe Maltese police’s vice squad, which is responsible for investigating trafficking, conducted three probes in 2018, compared to seven in 2017.\nPolice also conducted seven investigations for illegal prostitution in massage parlours, but they found no evidence of trafficking.\nThe government prosecuted 10 people (eight for labour trafficking and two for sex trafficking) compared to two in 2017.\nThree labour trafficking prosecutions initiated in 2014 and a 2004 case involving a police official for collusion with a trafficker remained pending at the close of the reporting period.\nRELATED STORIESMalta fails to act on human trafficking, again - US State DepartmentHarsher penalties are not stopping human trafficking\nIn March 2018, the government convicted one sex trafficker from a 2008 case, however the court fully suspended the prison sentence; this was the first conviction in six years.\nThe perennial issue of slow court proceedings, the report says, continued to hamper prosecutions and convictions.\nThere were no new investigations or prosecutions of government employees complicit in trafficking offences either.\nPolice identified 23 foreign trafficking victims and one Maltese victim, compared to 30 foreign victims in the previous reporting period. Forced labour victims included 17 Filipinos (13 from a single case), three Mauritians, one Nepali, and one Pakistani. Sixteen of the forced labour victims were male and six were female.\nSex trafficking victims included one Moldovan woman and the Maltese girl – the first government-identified child victim to date. Sixteen of the 24 victims uncovered during the reporting period received care services.\nThe government also assisted one victim with return to their home country.\n ", "comment_count": 6, "id": 699}, {"keywords": "Accident, Fire, Mellieħa", "author": "", "article_body": "Updated 10.30am with FKNK statement\nFirefighters were battling until Sunday morning to put out a large grass fire in the Miżieb woodlands of northern Malta. \nFirefighters struggled to quell the flames.\nThe fire broke out on Saturday morning and firefighters reached the scene soon after receiving the first reports of smoke in the area. Several hours later, they were still working to contain the fire, whose smoke could be seen from kilometres away. \nA Civil Protection Department spokesperson said that the fire was practically under control on Sunday morning but they still had a unit on site at 6.30am on Sunday to ensure that it did not start spreading again.\nUnits had also been dispatched to Buskett on Saturday to put out a smaller grass fire there. \nA police force spokesperson told Times of Malta nobody was reported injured in the Miżieb fire. \nAs the fire raged into Saturday afternoon, a resident of nearby Manikata said they could smell smoke and see lots of ash. \n\"We're worried about the destruction it will cause the woodlands and biodiversity in the area,\" they told Times of Malta. \nThe fire last night shot from St Paul's Bay. Photo: Christopher Buttigieg\nIn a statement, BirdLife Malta said Miżieb is one of the few areas with dense trees in our country and also serves as a resting place for various birds during migration and an ideal recreational place. \nBirdLife said it has already written to the Environment Minister to offerits support in the regeneration process of this area.\n“We are hoping that the damage is not as extensive as we are expecting after seeing footage of the ordeal,” BirdLife Malta CEO Mark Sultana said.\nBirdLife said a mixture of water channels, training and education campaigns and a level of management and control is important to deal with such a problem. \nFKNK statement\nIn a statement on Sunday, the hunters’ federation, which runs the site, said members of its Miżieb sub-committee assisted firefighters and volunteers control the fire.\nIt said that around 40 tumoli of the area that caught fire had been cleaned up by volunteers in the past weeks. The volunteers had also pruned the trees on site.It said that a police report has been filed since arson was suspected.\nFKNK said it noted Birdlife’s statement and pointed out that it was the first time that the organisation was expressing sorrow at the damage at Miżieb, an area which had been subject to other fires and vandalism several times.\nIt said Birdlife’s reaction was strange and asked whether there were ulterior motives behind it.\nFKNK said that no damage, vandalism or provocation would stop its members from continuing their work at the Miżieb and l-Aħrax reserves and it would continue to insist that all reserves should receive the necessary official surveillance and enforcement.\n\nThe plume of smoke could be seen from a distance.\nAs of 7pm, the fire was still raging.", "comment_count": 3, "id": 700}, {"keywords": "Aviation, Accident", "author": "", "article_body": "Updated at 5.20pm\nAn Air Malta plane was grounded and sent for repairs on Saturday after pilots inspecting it before takeoff noticed a bird had dented one of its wings. \nThe plane, which was scheduled to take passengers from Malta to Munich on Saturday morning, was held back for further checks to its wing. \nSubsequent verifications confirmed that the damage had to be repaired before the plane could safely take off. A second aircraft was deployed to take delayed passengers to Munich, but the knock-on effect forced Air Malta to cancel a second flight to Munich scheduled for later in the day. \n\"Passengers on these flights are being given assistance and re-routed to their final destination,\" an airline spokesman said.\nAir Malta flights to London Heathrow, Paris Orly and Frankfurt were delayed by anything between 45 and 90 minutes as a result. \n\"Air Malta gives utmost importance to the safety and well-being of its customers and crew and apologises to its customers for this inconvenience caused by circumstances beyond its control,\" he said. \nBirdstrikes, as they are known in the aviation industry, can cause significant damage to aircraft engines, cockpits, wings or rudders. They most commonly occur when planes are taking off or landing.\nA total of 48 birdstrikes were recorded at MIA in 2017. The average number of bird strikes between 2014 and 2016 was 33 a year.\nRELATED STORIES'At least 10' pigeons strike aircraft at MIA\nThe airport has bird-hazard management procedures in place that include bird-presence patrols, harassment through acoustic distress calls, removal of food and water sources at the aerodrome and regular cutting of grass to eliminate shelter.\n ", "comment_count": 26, "id": 701}, {"keywords": "Construction, Architecture", "author": "Philip Leone Ganado", "article_body": "Updated at 5.10pm\nArchitects attending a meeting to discuss proposed changes to building regulations raised the possibility of a 'strike' on Friday evening, although the Chamber of Architects that represents them stopped short of suggesting that as a course of action. \nHundreds of members of the Chamber of Architects and Civil Engineers packed a Floriana hall on Friday afternoon to discuss the proposed changes, which are being fast-tracked following a series of building collapses. \nThe EGM ended with the Chamber agreeing on a series of demands - ranging from calls to introduce amendments to the Periti Act and a demand to beef up the Building Regulations Office with the necessary resources. \nMembers also want any legal amendments to empower architects to suspend works and file a report to the BRO when a developer refused to comply with instructions related to a building's structural integrity, without them relinquishing their commission. \n'Strike' suggestion\nIn the course of the meeting, some members also raised the possibility of a ‘strike’, Chamber president Simone Vella Lenicker told Times of Malta on Saturday morning.\nSuch a measure - which could involve architects refusing to take on responsibilities emerging from the new law or other duties related to construction - was among several courses of action raised by members during the meeting.“Members endorsed the council’s position that the legal notice does not guarantee public safety. Following the meeting, we sent our comments to the parliamentary secretary for planning, Chris Agius, and asked for an urgent meeting, but so far we have not heard back,” Ms Vella Lennicker said.“The outcome of any discussions is not yet known, but we discussed various possible scenarios and our courses of action in each.”\nThe Chamber subsequently issued a statement clarifying that no motions regarding strikes were proposed, discussed or approved during the EGM. The government had yet to reply to its request for an urgent meeting, the Chamber added. \nRELATED STORIES'They told us it was safe'Resident injured as building collapses in Mellieħa\nIn a draft position published earlier this week, the Chamber lambasted the government’s draft legal notice, intended to safeguard properties from damage caused by adjacent excavation and construction works, as “piecemeal and ill-thought”. The proposals issued by the Infrastructure Ministry include stricter procedures and regulations for architects and contractors, and increased fines of up to €50,000.\nArchitects attend a packed Extraordinary General Meeting held on Friday. Photo: Jonathan Borg\nThey come after three buildings - two in Guardamangia and another in Mellieħa - were destroyed or severely damaged by nearby works.\n'Give us what we need to ensure public safety'\nThe Chamber said in a statement on Saturday that architects had reaffirmed their commitment during the meeting to take full responsibility for the tasks that were within their remit.“They however demanded that Government stops dragging its feet, and immediately takes the necessary steps to ensure that the framework which allows Periti to ensure public safety is in place and effective,” it said.\nThe Chamber stressed that the role of site manager, as defined in the new law, should be within the contractor's set-up, rather than the architect's, since the contractor was \"obliged at law to understand and follow the instructions issued by the architect, and be sufficiently knowledgeable to understand the significance of such instructions\".It called on government to bring forward changes to the Periti Act which it said it had been insisting on for 12 years. It demanded immediate discussions on a Building and Construction Regulation Framework and the setting-up of the Building and Construction Authority, adding that the Building Regulation Office should first be equipped with all the necessary resources.The Chamber also called for a clear separation “between planning application and permitting processes, and the processes by which building and construction is notified, regulated and monitored”. “Nearly five years have been wasted as a result of the misguided advice given to Government that the two processes should be brought together under the remit of the Planning Authority.”", "comment_count": 59, "id": 702}, {"keywords": "Construction, Politics, PD", "author": "", "article_body": "Tweaking construction rules without increasing enforcement resources is pointless and an exercise in deceiving the public, the Democratic Party said on Saturday.\n“Prime Minister Dr Joseph Muscat has admitted that the enforcement of building regulations by the authorities is insufficient, but then made no commitment to increasing human resources to upgrade enforcement.  What is the point of tweaking the law when excavation rules are not enforced?” the party asked.\nExisting laws already included several provisions intended to ensure site safety and responsible excavation practices, the PD noted. But in many cases, those requirements were just ignored by regulatory authorities.\nThere was no indication that this would change in the future, it added.\nGovernment is in the process of fast-tracking legal changes to construction and excavation laws as a reaction to the sudden collapse of three buildings adjacent to excavation sites.\nThe revised rules, which were released on Monday for a five-day consultation period, are intended to clarify stakeholder responsibility and set significantly increased fines for law-breakers, among other things.\nA lack of emphasis on enforcement, however, has alarmed the PD.\nLegislators had introduced a law in 2011 which required the government officially recognise and authorise contractors to carry out building work, the party noted. Eight years on, authorities had yet to create a register of building contractors or list of certified masons.\n“The PM’s failure to commit the government to better enforcement sends the wrong signal that building contractors can continue to do as they please because the Government will not check on them,” said PD MP Godfrey Farrugia.\nEarlier on Saturday, the Church’s Environment Commission said that it was concerned that people who were partially to blame for the “dire straits” Malta’s construction sector found itself in were among those leading the search for solutions.", "comment_count": 8, "id": 703}, {"keywords": "Health, Unions", "author": "", "article_body": "Nurses have come out against NGO calls to shut down Mount Carmel hospital, arguing that countries which have tried to shift mental healthcare to the community have seen systems collapses and patients suffer.  \n“There is no doubt that Mount Carmel Hospital with all the structural defects [it has] has to be upgraded,” the Malta Union of Midwives and Nurses said on Saturday, in a statement which suggested NGOs were being disrespectful to nurses by saying the hospital should be shut down.\nMental health NGOs and professionals have in recent weeks upped calls for the Attard-based Mount Carmel to shut down for good, saying that the facility is not up to standard and that Malta should shift much of its mental healthcare to community-based services.\nThose calls have not gone down well with the MUMN, which said its members were “shocked by  these  irresponsible  comments given  to  the  media  by NGOs”.\n“When other countries  used  the  approach  of  closing  down  institutions  such  as  Mt.  Carmel Hospital, the patients were the ones who suffered most and the whole system of mental health care literally collapsed,” the MUMN said, without elaborating further.\nEvacuate wards 'by September'\nConcerns about the structural integrity of Mount Carmel Hospital reached parliament last month, with hospital administrators telling MPs about dire conditions inside the facility.\nHealth Minister Chris Fearne had admitted in 2018 that some ceilings at the hospital were dangerous. In April, Times of Malta reported that around three out of every four wards at the crumbling hospital have condemned ceilings.\n\nRepairs at the hospital are currently underway, and on Saturday the MUMN said that it was insisting that the worst affected wards had to be completely evacuated by the end of September.\n“It is not acceptable for either patients or staff working in these wards to have works postponed further,” the union said, adding that it would be publishing timelines which would reveal whether or not hospital management was living up to its word.", "comment_count": 2, "id": 704}, {"keywords": "Construction, St Julian’s, Planning Authority", "author": "Ivan Martin", "article_body": "The developers behind the controversial db Group City Centre project in Pembroke are “considering legal avenues” which could include court action against the authorities, the Times of Malta is informed.\nThe mega project was brought to a halt by a court decision on Wednesday which found that one of the Planning Authority’s board members had a conflict of interest in the project. \nContacted on Friday, db Group chief Silvio Debono said he was meeting with his lawyers to discuss “the way forward”. Silvio Debono is now planning his next move. Photo: db Group\nAsked if he would consider taking action against the Planning Authority, Mr Debono said that at this stage he was still weighing his options. Mr Justice Mark Chetcuti ruled that the Environment and Planning Review Tribunal decision in February, which gave the go-ahead for the project, should be revoked and he deemed the PA’s approval of the project as “null and without effect”.\nThe €300 million project, which includes a 37-storey tower and 17-storey hotel, was approved by the PA in September, despite an unprecedented 4,500 objections from the public, local councils and NGOs.\nThe project had originally been approved by 10 votes to four.\nRELATED STORIESSilvio Debono's golden green mile - Michela SpiteriThe Prime Minister's private jet - Mark Anthony Falzon\nOne of those 10 voting in favour was Matthew Pace, a board member and entrepreneur who The Shift News later revealed was involved with a branch of one of the real estate agencies seeking investors and buyers for the project.\nMr Pace is a franchise owner of Remax Alliance Swieqi.\nThe court ruled that the City Centre project was being advertised long before the Planning Board had voted on it, and that any property agent who clinched a deal would receive a commission even if they had not been directly involved in its advertising.\nMr Pace was therefore in a position to receive a commission through his estate agency for a project which had not yet been approved and which he had a say in approving, through his vote as a member of the Planning Board, the court said.\nSilence from PA and Mr Pace\nContacted on Friday, Mr Pace directed this newspaper to send questions by email. \nAttempts to contact PA executive chairman Johann Buttigieg proved unsuccessful, however the Times of Malta is informed that the authority has already started holding meetings with legal advisers to discuss the judgment. \nOne of the burning questions that the Planning Authority will have to decide on is whether db’s application will be up for a vote again, or if the developer will have to start the whole process from scratch. \nThe authority’s top brass is also concerned about potential ramifications the judgment could have on other applications.\nLawyer Claire Bonello, who filed the appeal on behalf of objectors, has already said the court decision would force developers behind the Pembroke project to go back to the drawing board.", "comment_count": 26, "id": 705}, {"keywords": "Construction, Environment", "author": "", "article_body": "The Church’s Environment Commission has hit out at the way revised construction and excavation laws are being rushed through, saying a five-day consultation period is too short and that people with clear conflicts of interest are taking a leading role in revising the law.\n“The KA sincerely hopes that the proposed regulations will not be a populist attempt to impress the general public that something is being done,” the commission said in a three-page statement which outlined its concerns about a sector which it said all too often ignored citizens’ needs.\n“Authorities and developers have become interchangeable spokespersons for each other while the rights and views of other stakeholders have been largely ignored,” the commission said, adding that it was concerned that it seemed mistakes of the past were being repeated.\n“Individuals who have been instrumental in forcing our society into these dire straits are still taking a leading role in the efforts to find a solution, irrespective of any clear conflict of interest they might harbour,” it said.\nRELATED STORIESNew rules ignore residents - Graffitti\nEchoing concerns voiced by activist group Moviment Graffitti on Friday, the commission insisted that revised regulations needed to take the rights and needs of common citizens, not just industry stakeholders, into account.\nPeople needed to be educated about the responsibilities of each person involved in the construction process and more work was needed to ensure building materials were high-quality, it said.\nThe Commission statement comes as a reaction to government proposals to revise construction and excavation rules, following a series of building collapses in the past months. All excavation and demolition works, save for a few exceptions, were brought to a halt last week by Prime Minister Joseph Muscat.\nRevised regulations were presented to the public for consulation on Monday and are expected to be passed into law next week.\nThe Church commission said that the current situation was an opportunity authorities could seize to improve building standards by making them, for instance, better able to resist earthquakes.\nRELATED STORIES'Why tweak laws if they are not enforced?'\nPeople were afraid, the Commission said, and felt utterly powerless when faced by a construction sector which wielded so much power. Warnings had been sounded for some time, the commission said: the building collapses had now opened up a Pandora’s box.\n“Irrespective of all the rhetoric about how the industry is contributing towards Malta’s development, these  events have shown its serious social (and environmental) deficit,” the commission said.\n“This deficit is an indication of the cracks that are developing in the proverbial bubble, the existence of which has been repeatedly denied by that industry (and its consultants)”.\nFive proposals the Commission is making:\n\nIntroduce a public register of all qualified and certified service providers in the construction sector\nExtend the five-day consultation period to give the public more time to give feedback on the proposed changes\nDefine mandatory minimum building standards and give seismic hazard vulnerability greater consideration\nLook beyond geotechnical aspects of excavation and consider materials used and adjacent property structural systems\nRun an extensive public information campaign to educate the public about the responsibilities of each stakeholder in the construction process and how they can report any irregularities", "comment_count": 13, "id": 706}, {"keywords": "Migration", "author": "Philip Leone Ganado", "article_body": "Migrants brought to Malta from Italy and Greece under an EU agreement received misleading information about the relocation scheme, while Maltese agencies were not sufficiently prepared for the arrivals, a new report has concluded.\nResearch by Maltese NGOs Integra, Aditus and the Jesuit Refugee Service found that the experiences of migrants who participated in the scheme were marked by “feelings of betrayed expectations” due to the discrepancy between how relocation was presented and the realities they found in Malta.\n“Without clarity as to information-delivery responsibilities in Greece and Italy, it can only be concluded that the system was characterised by a mixture of disorganisation, lack of coordination, deficiencies in information provision, and more particularly a lack of sensitivity towards the experiences of refugees and the journeys they were forced to make,” the NGOs said.\nRELATED STORIESFreezing temperatures at Ħal Far open centre\nBetween 2016 and 2017, Malta received 110 Eritrean, Syrian and Iraqi migrants from Italy and Greece under an EU relocation scheme, intended to address the disproportionate challenges faced by those two countries, and to bolster efforts at solidarity in the field of asylum.\nThe NGOs’ research was based on interviews with 16 of the migrants who participated in the programme, and was intended to understand how the participants perceived and made sense of their experience, in order to provide feedback for any future relocation.\nPromo videos and half-truths\nFrom the interviews, researchers said, it emerged that relocation had been presented as a more attractive alternative to remaining in Greece or Italy, and as “a way out of their extremely difficult present and future circumstances”.\nA series of promotional videos was used to encourage participation, with the slogan: “Choose Relocation: safe and legal!”\nResearchers questioned whether participants had been told the reality of living conditions in Maltese open centres, the fact that Malta did not grant family reunification rights to beneficiaries of subsidiary protection, or that their asylum applications could be rejected on the same grounds for which they had been accepted for relocation.\nIn Malta, migrants said they were “shocked” by the low quality of conditions at the open centres, and “upset” by the institutional attitude adopted towards them.\n“Far from welcoming them, it seems like Malta’s reception services engendered a further sense of isolation and abandonment,” researchers said.\n“They lacked the immediate support – financial, information and basic material – that was needed for them to find their feet in their new environment.”\nMaltese agencies, the researchers said, did not seem to be sufficiently informed of the particular needs of the new arrivals, and this despite the fact that (unlike with other migrant arrivals), the long period of waiting before relocation could have been used to make preparations.\n“Preliminary care-plans should be in place prior to the refugees’ arrival, service providers should be informed of the make-up of different families and individuals, including specific needs particularly related to vulnerability in order to coordinate appropriate support structures,” the researchers said.", "comment_count": 0, "id": 707}, {"keywords": "Weather, Beach", "author": "", "article_body": "Temperatures could feel as hot as 38 degrees Celsius over the next three days as the second heatwave in the space of a month hits Malta and Gozo.\nThe hot and sunny weather will be especially sweltering on Sunday and Monday, according to the Malta International Airport weather station, before cooling slightly on Tuesday and moderating to highs of 32 degrees for the rest of the week.\nHeatwave definitions vary from one country to the next, although in Malta meteorologists tend to use the term when temperatures rise five degrees or more above the monthly average. In Malta, June tends to see average temperature highs of 28 degrees Celsius.\nGentle southern breezes rising to up to force 4 in strength will offer some respite from the heat over the coming days, though anyone thinking of cooling off with a swim should slap on some sunscreen and consider staying indoors between 10am and 4pm: the UV index of 10 means unprotected sun exposure can cause serious harm.\nExtra care should be taken with children and elderly people, who are at the highest risk of suffering negative effects of sun exposure.\nSummer weather will, unsurprisingly, continue through the rest of the week, with temperature highs remaining above 30 degrees Celsius and never dipping below 22 degrees at night.\nThe forecast heatwave will be the second spike in temperature Malta has experienced this month and coincides with the start of summer, which began on Friday.\nStay out of the sun during peak daytime hours, and always put on sunscreen. Photo: Chris Sant Fournier\nEarlier in the month, temperatures rose as high as 37 degrees Celsius over a three-day period.\nHeat wave across Europe\nHigh temperatures are also expected to grip much of continental Europe this weekend, with many areas in Spain, Italy and Germany also projecting temperatures rising to the high 30s.\nAccording to AccuWeather, much of Europe “will experience at least one day of intense heat next week”, as very hot air from Africa is pulled north by high pressure building over central and eastern Europe.", "comment_count": 6, "id": 708}, {"keywords": "Swieqi, Accident", "author": "", "article_body": "An elderly man was grievously hurt on Friday afternoon when he was hit by a car as he was crossing the road in Swieqi. The 79-year-old Swieqi resident was walking on the corner of Triq il-Qasam with Triq is-Sejjiegħ at around 5.15pm when he was hit by a Toyota being driven by a 35-year-old man from Gżira. Paramedics were called to the scene and took the elderly victim to Mater Dei Hospital by ambulance, where he is being treated. In a statement, the police said that they are investigating the case.", "comment_count": 0, "id": 709}, {"keywords": "Media", "author": "", "article_body": "These are the leading stories in local newspapers this Saturday. The Times of Malta reports that the db Group is considering its legal options, after a court ripped up a permit for its €300m City Centre project. The Malta Independent reports that a US-based think-tank has cited Malta as one of 28 countries which may have breached sanctions imposed against North Korea. L-Orizzont gives top billing to a five-year prison sentence handed down to Liam Debono, a teenager who is facing attempted murder charges in a separate case. The newspaper also reports that the PN’s internal sniping against its own leader Adrian Delia continues. In-Nazzjon leads with news that the school which Elisa Buhagiar attended has cancelled a concert as staff and students mourn her loss. Elisa, 10, was killed in a car crash on Thursday.", "comment_count": 1, "id": 710}, {"keywords": "Planning Authority, Transport, Gozo, Victoria", "author": "Keith Micallef", "article_body": "Updated at 11.40am\nA proposal to reolocate a tiny kerbside fuel pump in Victoria to a massive, fully fledged petrol station on agricultural land on the outskirts of Birżebbuġa has prompted objections from the environmental watchdog.\nIn its evaluation of the application, the Environment and Resources Authority saw no justification for the development, expressing concern on the environmental impact of the growing number of such facilities.\nDetails of the proposed fuel station were published for public consultation by the Environment Ministry. Submitted by Michael Zammit on behalf of GO Fuels Limited, the application is for the relocation of a decommissioned kerbside station in Pjazza Savina, Victoria, consisting of just one pump, to a new one in Birżebbuġa spread over an area of 3,000 square metres outside the development zone.\nThe developer had previously applied to relocate his fuel pump to Xagħra but the application was turned down.\nLocated on a parcel of agricultural land along the road linking Ħal Far to Birżebbuġa, the new project would also include a snack bar, a mechanic, car wash, tyre service, vulcaniser and a valeting garage. The site is about 900 metres away from another fuel station and the facility would be up and running within two years of the start of works, according to the plans. \nRELATED STORIESExplainer: Which ODZ fuel stations could be cut down to size?\nThe developer is pledging to plant a number of trees to mitigate the visual impact on the surroundings. However, the project description statement acknowledges that the loss of land would constitute a “major adverse” impact of the development.\nAccording to the 2015 fuel station policy, which is being reviewed, such a proposal may be considered if the relocation was deemed to be beneficial for the community and have no adverse environmental impact.\nOn Saturday morning, Environment Minister José Herrera made it clear he was unhappy with the application.\n\nERA submissions\nIn its submissions, the ERA said there was no valid justification for the further loss of undeveloped rural land and associated environmental impacts to accommodate further development of petrol stations.\n“There is also concern regarding the cumulative environmental impact caused by the numerous ad hoc proposals for petrol stations currently being proposed on ODZ land,” the watchdog said. This concern would not be resolved by carrying out an environmental impact assessment on this project alone, the ERA added.\nIt made the case for postponing the evaluation of this application until the new fuel station policy comes into force.\nThe public consultation period closes on July 18.  Submissions may be sent to the ERA at eia.malta@era.org.mt. \nThe Malta Chamber of SMEs (GRTU), which represents fuel station owners, recently said no new fuel stations should be allowed once the new policy comes into force.\nEchoing the calls made by environment groups and civil society organisations, it expressed itself in favour of halting all applications in the pipeline.\nShould current applications continue to be considered, the new policy would immediately become irrelevant and pointless to carry forward, the GRTU said.", "comment_count": 39, "id": 711}, {"keywords": "Health, Childcare, Family", "author": "Claudia Calleja", "article_body": "Mothers could receive better support before, during and after pregnancy if midwives were given the opportunity to be more present in the community, according to midwifery professor Rita Borg Xuereb.\nPhoto: Matthew Mirabelli\n“Midwives have the potential to offer much more. Many maternal services that are currently centralised at Mater Dei Hospital can be extended into health centres or local councils to better support and educate mothers, many of whom work, and to alleviate the demands on the hospital,” she said.\nProf. Borg Xuereb, a university lecturer and midwife, will be participating in a roundtable discussion on maternal health organised by the Malta Trust Foundation in collaboration with Humanity 2.0 Lab, a pioneering foundation based in Rome that is supported by the Vatican’s Dicastery for Promoting Integral Human Development.\nSome 30 healthcare professionals will come together to identify the best strategies to accelerate enhanced outcomes in global maternal and infant health, in line with the United Nations sustainable development goals.\nThe discussion, led by President Emeritus Marie-Louise Colerio Preca, will end with the signing of a memorandum of understanding between the Malta Trust Foundation and Humanity 2.0 Lab – to provide a framework of cooperation and collaboration between the two sides with special focus on maternal health.\nProf. Borg Xuereb believes the key to addressing maternal health is investing in a person and family-centred approach that ensures continuity of care.\n“I don’t hesitate to say we are leaders in Europe and the Mediterranean with regard to maternal care. But, of course, there is room for improvement,” Prof. Borg Xuereb said.\nThere is more we can do. We can make a difference\n“Midwives in Malta are mainly focused in hospital. I think they should come out more into the community. We already offer successful community services, such as the discharge liaison midwife (who visits women at home after birth), but there is more we can do. We can make a difference,” she said adding that, all too often, midwives end up not practising the range of skills they were trained in.\nHow can midwives help in the community?\nProf. Borg Xuereb went on to give examples. Moving booking clinics into the community will reduce the load at Mater Dei and allow midwives more time to talk and listen to mothers who are booking the midwifery service.\nMedical investigations could be done at health centres, freeing up the hospital for high-risk cases. Opening breastfeeding clinics in the community would offer accessible support to struggling mothers and improved follow-ups would increase the breastfeeding rate.\nOther services that would work well in the community include: parentcraft classes, sexual health, reproductive health and family planning and antenatal care. By fulfilling an educational role, midwives would also help address nutrition and obesity that often lead to gestational diabetes, as well as other health issues such as smoking cessation.\nThey would also offer more support to migrant women who are often unaware of the services they are entitled to. \nMaternal mental health\nMidwives could also support more on a mental health level. “Our midwives are trained in perinatal (during and after pregnancy) mental health and we have a perinatal mental health clinic at the hospital. We now need to start an outreach service. International statistics show that antenatal depression (during pregnancy) is as high as postnatal depression. Then there are the women who experienced previous mental health issues,” she said.\nAll these services, she said, would also need to be offered during hours that make sense for working women. Prof. Borg Xuereb believes this is achievable with long-term planning: “If we don’t have the resources today, we will within a few years. At present, the midwifery course has an intake of 15 students per year, but we have many more applicants each year, so we can increase the intake of students given that we will have more services,” she said.\nShe added that having children was important for the country. Malta’s fertility rate stands at 1.42 and needs to increase to at least 2.1 to be sustainable.\n“The State needs to take care of the health of mothers and of their families, this is essential for the country. Investing in issues of community-based maternal healthcare and focusing on prevention also makes economic sense, apart from benefiting the wellbeing of the mother and the baby,” she concluded.", "comment_count": 3, "id": 712}, {"keywords": "Planning Authority, Construction, Conservation, Gozo", "author": "Sarah Carabott", "article_body": "A tribunal will next week decide on a Planning Authority ruling to refuse embellishment works on a restaurant in Dwejra, the best remaining site for astronomical observations.\nWhen the proposal was filed, astronomy experts had insisted that the introduction of lighting at the site would be “madness” and NGOs had said it threatened the area’s ecology.\nIn November of 2017 the Planning Authority had refused to grant permission for the installation of a canopy, lights, a sign and the placing of tables and chairs.\nIt argued that the proposed development would have an adverse impact on an important area and would conflict with a Strategic Plan for Environment and Development objective that aimed at safeguarding and enhancing biodiversity, cultural heritage, geology and geomorphology.\nThe applicant had appealed and the Environment and Planning Review Tribunal will take a decision on June 27.\nBack then the list of objectors included the Department of Physics at the University of Malta, Light Pollution Awareness Group, Birdlife Malta, Friends of the Earth Malta and Nature Trust Malta.\nThe Malta Tourism Authority’s product development directorate has also noted that the site was very sensitive and that no new development should be allowed.\nDwejra is designated as a dark sky heritage area according to Mepa’s Gozo and Comino Local Plan, meaning that the installation of lighting that is not related to aerial or maritime navigation should be strongly discouraged.\nBefore the decision was taken in 2017, a spokesman for the Institute for Astronomy and Space Sciences had noted that Malta was one of only five countries where the possibility of observing the Milky Way from home was precluded to all of their inhabitants. The other four countries were Singapore, San Marino, Kuwait and Qatar.\nFor the Astronomical Society of Malta, further development, particularly with regard to lighting at night, was “disastrous”.\nAccording to Front Ħarsien ODZ, the area is a very ecologically sensitive one, given it falls within a Natura 2000 site and a designated special protected area under the Wild Birds Directive.\nIt is also an important nesting site for the Scopoli’s shearwater and the Yelkouan shearwater, which are particularly sensitive to light and noise, the heritage NGO Din l-Art Ħelwa maintains.", "comment_count": 22, "id": 713}, {"keywords": "Court, Justice", "author": "Edwina Brincat", "article_body": "A birthday trip to Malta got off with a bang for two young friends who ended up spending the day under preventive arrest after entering a restricted zone at the airport and damaging an emergency gate.\nConor Richard Coffey, a 27-year-old Irishman, and Stephen James McClarty, a Briton who turned 27 on Thursday, landed at the Malta International Airport  shortly after midnight on Thursday and soon found themselves in hot water.\nThe two friends, apparently rather tipsy, stepped into a restricted access zone without permission of the airport chief security and ended up damaging an emergency gate.\nThey were promptly arrested, spending the rest of the day in preventive custody instead of celebrating the birthday as planned.\nThe two were escorted to court on Friday, pleading guilty to the charges.\nThe court, presided over by magistrate Josette Demicoli, declared them guilty upon their own admission and, in view of the early guilty plea, condemned each to a two-year jail term suspended for three years and a €1,000 fine.\nThey were also ordered to foot the bill for repairs to the gate, totaling €5,500 which were to be paid to MIA.\nInspector Silvio Magro prosecuted.", "comment_count": 0, "id": 714}, {"keywords": "Construction, Court, Planning Authority", "author": "Philip Leone Ganado", "article_body": "The surprise court decision halting the db Group City Centre project warns all Planning Authority board members they may need to recuse themselves from a second vote on the project, legal analysts told Times of Malta.\nA Court of Appeal on Wednesday nullified the PA’s approval of the 37-storey tower and 17-storey hotel in Pembroke last September, ruling that one of the board members had a conflict of interest due to a financial involvement with one of the real estate agencies marketing the project.\nBut in his verdict, judge Mark Chetcuti also said that “all board members should carefully consider whether their position is tenable in the new adjudication of the project… to prevent a repetition of this episode in view of the fact that they have already expressed their position on the matter”.\nSeveral legal experts told Times of Malta they interpreted this as a warning that, having already declared themselves for or against the project by voting on it, board members could be challenged over a lack of impartiality if the application - as is expected - comes before them for a new decision.\nRELATED STORIESAuthorities silent about Matthew Pace's PA future\n“The judge has taken them to the cliff edge and said in no uncertain terms that they have taken a decision and may very well have to recuse themselves and abstain. However, he is leaving the decision up to the individual members,” one said.\nThe judge has taken them to the cliff edge\nEvery single board member was present - itself a rare occurrence – for the hearing that approved the project by 10 votes to four last September, but two of those members – Timmy Gambin and Desiree Cassar - have since been replaced.\nOf the current board, therefore, only the two replacements – architects Duncan Mifsud and Deborah Busuttil – have not pronounced themselves on the project.\nRELATED STORIES‘db decision cannot be appealed’ - objectors’ lawyers\nLawyer Claire Bonello, who represented the local councils and residents behind the appeal against the project, described the court’s warning as “new territory” and said it was yet to be seen how it would affect an eventual future hearing.\nIt has not yet been confirmed what the path forward is for the controversial €300 million project, with the Planning Authority saying only it was still studying the court’s decision.\nOne legal source said the nature of the decision, which they described as possibly without precedent, meant the developers were now in the position they had been in immediately before the application was decided by the authority.\nAs well as the original PA decision, the verdict also cancelled a decision by a planning appeals tribunal in February that confirmed the permit, where the court said arguments for rejecting the claim of conflict of interest had been “poorly thought out and could give rise to the semblance of complacency towards a lack of impartiality”.\nHowever, the court did not call into question any other aspects of the process, specifically stating that it would not be ruling on any of the grounds of appeal other than the conflict of interest claim.\nDr Bonello said these issues would still need to be addressed at some point, adding that it was still possible the developers would need to resubmit their plans. Moreover, she said, new objections and issues could be raised in any new decision process.", "comment_count": 32, "id": 715}, {"keywords": "Court, Justice", "author": "Edwina Brincat", "article_body": "A father and son were acquitted of attempting to kill a relative, striking him with a grinder, in the course of a heated argument triggered by the victim’s irrational behaviour.\nSalvatore and Carlos Bonello, 54 and 30 respectively, stood accused of attempting to kill their relative in the incident at Għargħur nine years ago. It was sparked off by the mess that had been caused by the younger man while carrying out works on the front terrace of his mother’s home.\nThe mess set off the full-blown fight between the three men, during which Salvatore’s brother-in-law was allegedly hit with a grinder.\nIn the course of criminal proceedings against father and son, divergent versions of the incident emerged as the accused claimed that the victim had started the physical aggression as Carlos, after having said that he would clear up the mess, had gone back to his work.\nFaced with such differing accounts, the Court had to assess every piece of circumstantial evidence to make sure that it was unambiguous.\nThe Court focused upon the negligible trace of blood found on the grinder, so negligible that the scientific expert could not elicit a DNA profile.\nHad the attack truly taken place as described by the victim, there would have been more blood on the instrument, the Court concluded.\nOn the basis of all evidence put forward, the Court, presided over by magistrate Monica Vella, declared that the version given by the co-accused was more “realistic and credible,” and that the whole incident could have been avoided had the victim “not overstepped the limits of rational behaviour,” addressing his nephew within the limits of decency.\nLawyer Joseph Giglio and PL Quentin Tanti were defence counsel.", "comment_count": 0, "id": 716}, {"keywords": "Construction, Civil society, Accident", "author": "Jacob Borg", "article_body": "Proposed construction rules completely ignored the well-being of residents as well as occupational health and safety concerns, pressure group Moviment Graffitti said in a statement.\nThe draft rules, which propose an increase in the applicable fines for developers, do not address the anxieties of the public regarding the “accidents” that took place in the past weeks, and the spate of deaths on construction sites.\n“It also appears that there has been no effort in favour of real and efficient enforcement, despite the promises that have been made in the media”, the group said.\nA protest organised by the group on Tuesday saw hundreds marching and chanting against “developers’ rule”.\nProtesters marched to the main offices of the Malta Developers Association in Guardamangia.\nMoviment Graffitti has proposed a capping on the number of planning permits for residential and commercial projects, since these caused an unacceptable amount of noise, dust and traffic congestion.\nThe group’s statement comes ahead of an extraordinary general meeting being held by the chamber of architects and civil engineers on Friday afternoon.\nA formal position on the new construction proposals is expected to be approved by the chamber during the meeting.\nFollowing the collapse of a building in Mellieħa earlier this month, the Chamber sounded the alarm bell on a construction industry “in crisis”.\n“We have a complete lack of regulation of contractors, a complete lack of adequate competencies among the workforce, confusion about the various roles and responsibilities on construction sites, building regulations which date back to the 19th century, as well as a serious lack of enforcement.\nUnless we take immediate action, matters will only get worse,” the chamber said.", "comment_count": 7, "id": 717}, {"keywords": "Animal welfare, Santa Venera, Court", "author": "Edwina Brincat       ", "article_body": "Updated 5.40pm\nA Santa Venera couple driven to their wit’s end by 20 dogs barking next door have filed a judicial protest in an attempt to finally get some peace and quiet.\nMichael and Sylvia Hudson said that their next-door neighbour had taken up “pet sitting” as a business and turned their maisonette into a veritable dog pound.\nWhile the larger animals were kept on the roof, even in summer, the smaller animals were kept indoors.\nHowever, this state of things meant that the neighbours had to keep up with incessant barking, not daring to open their windows since that would mean having to put up with a strong stench of animal excrement, the judicial protest read.\nMoreover, the protesting couple told the court that they sometimes found “unfamiliar” dogs wandering in the common areas of the maisonettes which were littered with animal dirt and fur, forcing the couple to seek medical care against the risk of infection.\nIn their protest, which they filed against the Animal Welfare director, the couple said that the situation was “totally intolerable” and that the director had been “misled” into believing that the unlicensed commercial activity did not need a permit to operate as it was a “pet sitting” service.\nThe Animal Welfare director had inspected the premises and declared it “clean” but done nothing to halt the activity, even though the confined space the dogs were being restricted to amounted to animal cruelty, the couple said.\nThey included a number of photos with their judicial protest to back their claim.\nFor these reasons, the couple, by means of their lawyer Edward Gatt, who signed the protest, called upon the Animal Welfare Director to immediately put a stop to this “illegal and abusive activity” whilst reserving the right to further action.\nNeighbour objects to 'unfounded' claims\nA lawyer representing the neighbour who runs the pet-sitting service told Times of Malta that the claims made in the protest were unfounded and that his client was an animal lover who kept the dogs in “very clean conditions” as certified by animal welfare inspectors.\nThe neighbour would be filing a judicial protest against the couple on Monday, the lawyer said.", "comment_count": 0, "id": 718}]