[{"keywords": "", "author": "Anthony Manduca", "article_body": "President George Vella has expressed his grave concern at the unfolding situation in Libya where forces loyal to General Khalifa Haftar are attempting to take control of the capital Tripoli, the seat of the UN-recognised government.\nGeorge Vella\nGeneral Haftar backs a rival administration in eastern Libya.\n“I am very worried about Libya for a number of reasons. First of all the situation shows the hypocrisy of the international community which seems content to just look the other way as fighting engulfs the country. Secondly this latest conflict is certainly not in the interest of Libya, and has already led to a large number of casualties. We need to emphasise that the only way forward in Libya is a political solution.\n“And thirdly, Malta could well be flooded by refugees if the war gets out of control and leads to a humanitarian disaster,” Dr Vella told The Sunday Times of Malta.\n\n\nDr Vella said he was not surprised by General Haftar’s attempt to take the Libyan capital: “We always suspected that General Haftar wanted to seize Tripoli, which he might be able to do if he buys the loyalty of the militias supporting the government of Fayez al-Sarraj. However, Misurata, which also supports the UN-backed government in Tripoli, is a different case. Misurata has a huge standing army and if Haftar tries to take control, there is potential for a bloodbath.”\nThe President said that the military in Misurata had contributed a lot to the defeat of al-Qaeda and Isis in Libya, and had cleared Sirte of Isis. Many in Misurta identified with the Muslim Brotherhood and were moderate Sunni Muslims, he said, but General Haftar, who cleared eastern Libya of Islamists, had wrongly grouped the Brotherhood and other moderate Muslim groups together with the jihadists.\nDr Vella said the tragedy of Libya was that most countries were only concerned with their direct interests, and did not seem worried about the fact that so many innocent people were being killed.\nGeneral Haftar is openly backed by Egypt, the United Arab Emirates and Saudi Arabia, who consider him a bulwark against Islamists. On Monday US President Donald Trump praised General Haftar during a telephone conversation, signalling Washington’s support for him, and there have been a number of press reports indicating that France is secretly backing Haftar. The UN-backed government in Tripoli is supported by Turkey and Qatar.\nThe President added: “Unfortunately both the UN and the EU seem to be divided over how to respond to the Libyan crisis. Last Thursday the US and Russia opposed a British bid at the UN Security Council to demand a ceasefire in Libya.\n“EU foreign policy chief Federica Morgherini has tried hard to reach a consensus position to be able to arrive at a council conclusion on the matter, however, unless you have the approval of all member states you cannot take a major foreign policy decision in the EU.”\nDr Vella said that realistically, Malta could only “stand up and speak” about Libya and exert “moral pressure” on the international community to do something about the situation before it spirals out of control.\n“I just want Libya to be a normal country which embarks on a transition to democracy where people can enjoy a normal and peaceful life. If Tunisia can do it, why not Libya?” he said.", "comment_count": 7, "id": 3919}, {"keywords": "", "author": "Jacob Borg", "article_body": "The Council of Europe (CoE) is set to conduct a review of Malta to check whether it is honouring its democratic commitments and obligations as a member of the international organisation.\nIt is normal for the CoE to carry out such reviews on its 47 Member States. However, a new mechanism introduced in January allows for a more targeted approach to be taken in the selection of the countries to be reviewed – and Malta, along with Hungary and Romania, has been selected for this review.\nBefore, the CoE used to gradually work its way through its Member States in alphabetical order.\nA source familiar with the process told The Sunday Times of Malta that the review is intended to study if Malta is living up to the Council’s stated aims, namely upholding human rights, democracy and the rule of law.\nThe source stressed the selection of particular countries for this review “should not be viewed as a punishment”.\nAlong with Malta, both Hungary and Romania have been criticised for failures in the rule of law.\nReview ‘should not be viewed as a punishment’\nJust last week, Romania was warned by the European Commission that it should step back from the brink and consult on any legal changes that could be seen as giving impunity to corruption.\nRead: Reports galore highlighting institutional shortcomings in Malta\nThe CoE has been increasingly critical of Malta following the assassination of journalist Daphne Caruana Galizia in October 2017.\nIn the months after her death, it committed itself to drawing up a report about the murder as well as the corruption claims involving high-level officials.\nA report by the CoE’s Group of States against Corruption (Greco) in April warned that Malta’s criminal justice system risks paralysis. Greco said the lack of action against top officials facing corruption allegations conveyed a feeling in the public that senior officials are benefiting from total impunity for their actions.\nPrior to the Greco report, an analysis by the Venice Commission, a consultative body to the CoE, flagged the “serious risk for the rule of law” posed by the wide powers of appointment enjoyed by the Prime Minister.\n“Taking into account the Prime Minister’s powers, notably his or her influence on judicial appointments, crucial checks and balances are missing. This problem is accentuated by the weakness of civil society and independent media,” the Commission said.\nFurthermore, the CoE’s anti-money laundering body is also carrying out a scheduled assessment of the island’s compliance with international standards to combat financial crime. The Sunday Times of Malta reported recently that the country had “failed” the initial review.\nAn index published by Reporters Without Borders this week said press freedom in Malta continued deteriorating, with the country falling 12 places in a single year.\nMalta had already dropped 18 places in the 2018 World Press Freedom Index last year.", "comment_count": 77, "id": 3920}, {"keywords": "", "author": "Denise Grech ", "article_body": "Hardly a few weeks seem to go by without another international body highlighting institutional shortcomings in Malta. This is an overview of the latest reports and the government reaction to them.\n‘Total impunity’ flagged by Council of Europe\nThe Council of Europe’s anti-corruption monitor highlighted the lack of action against top officials facing allegations of wrongdoing. This, the Group of States Against Corruption (Greco) warned, led to the feeling that senior officials benefited from total impunity for their actions.\nThe watchdog also raised alarms of a culture of secrecy in many institutions, where reports, recommendations and conclusions are not published. Most, if not all, files against top officials in the executive and other related officials were still stuck in early stages.\nIt also warned the country’s criminal justice system risked paralysis, unless changes in responsibilities took place.\nPrime Minister Joseph Muscat has said the government will be looking at the report objectively. He said the report was partly a direct result of the “irresponsible way” the Opposition portrayed Malta internationally.\nHe also said the report was based on open sources like media reports, which were, rightly or wrongly, taken as facts.\nPrime Minister has ‘too many powers’\nThe Council of Europe’s Venice Commission criticised the extent of power in the hands of the Prime Minister, saying it far outstripped those of other important bodies. It also warned that crucial checks and balances were missing. Civil society and the independent media were also far too weak, the report said.\nThe government said it would implement the report’s recommendations. Justice Minister Owen Bonnici said the functions of Prosecutor General will be separated from those of Attorney General, among other reforms to be implemented as recommended by the Venice Commission.\nCivil society and the independent media were far too weak\nHe said the government hoped to see legislation through by the summer. However, the person taking on the Prosecutor’s role will be handpicked by the government, Dr Bonnici eventually admitted to the Times of Malta.\nPress Freedom in Malta is in a ‘problematic’ state\nPress freedom continued to deteriorate, with Malta dropping 12 places in an index published last week.\nMalta had already dropped 18 places in the 2018 World Press Freedom Index last year. This year, it fell from 65th to 77th place. The drop came after a noticeable widespread technique of threatening to exhaust journalists’ financial resources, Reporters Without Borders said in a statement. It also expressed concerns on the apparent lack of progress in the investigation of Daphne Caruana Galizia’s murder.\nThe government took issue with the ranking, saying it was committed to ensure journalists were free to work without outside forces hindering them. It also said it supported measures taken at a European level which helped to safeguard freedom of expression. However, it did not comment on whether it will take new measures, saying only that it was committed to democracy.\n‘Tax paradise’\nMalta has tax regulations that are very attractive to the rich and famous, according to a study by the European Greens.\nThe study took issue with schemes allowing people residing, but not domiciled in the country for tax purposes, to avoid paying tax on foreign-derived income.\nThose who keep their investment neatly separated in the British Virgin Islands while living comfortably in Malta can make huge profits without paying tax in the country or anywhere else, the report noted.\nBoth the government and the Opposition have repeatedly rejected criticism of Malta’s taxation system. Both parties believe taxation should remain the competence of EU Member States.\nPoor grade on action over money laundering\nAn initial Moneyval evaluation gave a poor rating to Malta’s anti-money laundering enforement.\nThe Sunday Times of Malta reported that a draft report by Moneyval, which is another of the Council of Europe’s bodies, had “failed” Malta when it evaluated the country’s actions and preparedness to combat money laundering.\nThe government, however, insisted the evaluation was far from complete, noting it would only be ready when Moneyval publishes the full report in July.\nRead: Malta’s democracy under fresh scrutiny", "comment_count": 24, "id": 3921}, {"keywords": "", "author": "", "article_body": "A man was marched to court on Easter Sunday and charged with having hurt his own father in a domestic altercation in Żurrieq on Saturday.\nPolice had arrested the young man after his frightened father showed up at a police station and told officers that his son had hurt and threatened him.\nThe father was subsequently certified as having been slightly injured in the incident.\nThe young man, who cannot be named by court order, was granted bail by magistrate Simone Grech against a personal deposit of €3,000. He must sign a bail book once a week and steer clear of his family while procedures are ongoing.\nLawyers Franco Debono and Amadeus Cachia appeared for the accused.", "comment_count": 0, "id": 3922}, {"keywords": "", "author": "", "article_body": "Updated 5.30pm \nLocals woke up to a blustery Easter Sunday this year, with winds howling across the country at speeds which at times reached gale force strengths.\nThe easterly and southeasterly winds continued throughout the day and the Malta International Airport meteorological office warned mariners that they should expect winds of up to force 8 on the Beaufort scale and very rough seas until at least 10pm on Sunday.\nGusts are expected to be especially strong on Sunday night and early on Monday morning, reaching speeds of up to 20 metres per second. \nStrong winds are expected to persist on Monday before dying down to more moderate levels on Tuesday. \n \n\nDust on the horizon\nHigh winds could lead to some dusty days: models created by meteorologists at the University of Athens predict large amounts of dust from the Sahara to be blown up across the central Mediterranean over the coming days.\nThe massive dust cloud – caused by a depression over Algeria - could reach as far north as the UK and Ireland, the models suggest.\nSand from Għadira blown to road\n\nOn Sunday afternoon, the police issued a warning on their Facebook page advising motorists to drive cautiously as sand from Għadira Bay was blown on the road leading to Mellieħa.", "comment_count": 1, "id": 3923}, {"keywords": "", "author": "Jacob Borg", "article_body": "Workers and patients at Mount Carmel Hospital are being humiliated by the government, Opposition leader Adrian Delia said on Sunday.\nSpeaking during a short telephone phone-in on Net FM, Dr Delia hit out at the conditions at the mental health hospital.\nThe Times of Malta revealed this week how three-quarters of the wards at the hospital have condemned ceilings.\nIn one ward, the foundations too gave way and cracks were so wide that rats were sneaking in, according to a technical report.\nIn their report, architects declared rooms in most wards as being unsafe and ordered their immediate closure so patients were being transferred to adjacent wards that also had structural problems in the ceiling.\nPN campaign for European elections\nIn his address, Dr Delia announced that the PN would be kicking of its campaign for the local council and European Parliament elections on Monday.\nHe said the campaign would be a continuation of a journey where the party continued to listen to people’s aspirations and problems.\nDr Delia said the PN would be presenting solutions to these problems, and would show it had the ideas and energy, as well as the moral will, to take the country in a better direction.\nThe Opposition leader vowed that the one thing that would be absent from the PN’s campaign was hate.\nDr Delia said he had met with 2,200 small businesses over the past months.\nHe said he had also met with many enthusiasts who participated in the Easter celebrations.\nCeilings in three out of every four rooms have been certified as unsafe.\nThis showed the Maltese identity was still alive, as these celebrations united families, communities and youths.\nHe said around 20,000 people actively participated in such celebrations and processions, which culminate with processions of the Risen Christ. \nDr Delia said this moment epitomised how there was always hope in the battle of good versus evil.", "comment_count": 17, "id": 3924}, {"keywords": "", "author": "", "article_body": "Washing of the feet\nArchbishop Charles Scicluna washed the feet of 16 people during the Maundy Thursday Mass at St John’s Co-Cathedral, which commemorates the Last Supper of Jesus Christ. Many of those who had their feet washed by the Archbishop had made use of the services offered by Caritas.\nWhat made the headlines\n‘Abortion must remain off the table’: Anti-abortion activists gathered in Valletta demanded constitutional amendments to ensure abortion remains off the political table. Led by the administrators of a recently set up Facebook group ‘Abortion in Malta? Not in my name!’ a modest gathering in Floriana heard the demands of the vocal pro-life lobby.   Alleanza Bidla leaders Ivan Grech Mintoff and Rebecca Dalli Gonzi said the group wants party leaders to pledge, before the upcoming MEP elections, that they would instruct their party whips to ensure no MPs on their ticket voted in favour of an abortion Bill should one ever be brought forward.\nThe two victims, Graziella Mallia, 53, left, and her daughter Fallon, 31.\nMother and daughter killed, seven injured in horrific car crash: Two Żabbar women died and seven were injured in a horrific traffic accident close to the roundabout which leads to Mġarr on Sunday night. Two cars collided in the area known as Il-Buqana at about 9pm, with one of the vehicles ending up in a ditch and another on a centre strip. The crash involved a Red Audi A1 and a blue Maruti 800. The victims, Graziella Mallia, aged 53, and her daughter Fallon, 31, were in the Maruti. The Audi ended up in the ditch where the road is being widened. It was being driven by a 31-year-old from Mosta, accompanied by a one-year-old baby and an 11-year-old child, who were seriously injured. Another child, 10, was slightly injured.  Also seriously injured were two persons, aged 77 and 12 who were in the Maruti while a 44-year-old was slightly injured. A 29-year old from Sliema was unhurt.\nOver 50 migrants found living in cramped apartment block: Around 52 migrants were found by the police to be living in decrepit conditions in a small apartment block in Triq il-Wied, Qormi. The migrants, who claimed to have come from Italy, were taken away in police vans. The apartments were unfurnished, with only bunk beds and mattresses in the rooms. A migrant who spoke to the Times of Malta said he paid €150 a month to stay there. Police sources said they would register the migrants and send them back to Italy because most did not meet the legal requirements to stay in Malta.\n‘Better roads mean more leisure time for drivers’: Maltese drivers will save five million hours of commute every year once seven major roadworks projects are completed, a government-commissioned study has found. The economic impact study, conducted by economist Gordon Cordina for Infrastructure Malta, found that this ‘saved time’ would translate to 12 more minutes of leisure time for every driver every week. The study looked at the collective impacts of the Tal-Balal, St Andrew’s, Central Link, Marsa-Ħamrun bypass, Triq Buqana, Marsa junction, and the Sta Lucija tunnel projects.\nContracts Department told to reverse tender ‘clarification’: The Department of Contracts and the Finance Ministry have been ordered to reverse a ‘clarification’ issued at the 11th hour regarding the submission for offers for a €17 million cleaning tender at St Vincent De Paul and expressed “serious concern” over what happened. In a formal decision, the Public Contracts Review Board upheld a complaint made by Servizzi Malta – a cleaning company – and ruled that the intervention by the government department on the last day of the submission of tenders was “concerning”.\nMalta plummets 12 places in press freedom league: Press freedom in Malta has continued to deteriorate, with the country falling 12 places in an index published by Reporters Without Borders. Malta already dropped 18 places in the 2018 World Press Freedom Index last year. This year, it fell from 65th to 77th place, posting the third sharpest drop in the European Union and Balkans region, following Serbia and Macedonia, which fell 14 places. The report measures the level of media freedom by looking at the level of pluralism, media independence, the environment and self-censorship, among other things.\nRussia tried to buy tear gas from Malta, cancels ship dock request: Russia withdrew a request to dock a warship in Malta, amid suspicions it was trying to purchase riot gear and gas canisters on the island, a report in Buzzfeed claimed.  The 7,570-tonne Severomorsk, with a crew of more than 400 is believed to be heading towards troubled Venezuela, the report said. The Maltese authorities did not react to the report but sources told the Times of Malta the report was correct and the government had planned to ban the vessel from docking in the island if it forged ahead with the request. The source said the Russians were planning to obtain the riot gear and gas canisters from a local supplier.\nWhat trended\nDeclining press freedom\nThe news, according to Reporters Without Borders, that press freedom in Malta has continued to deteriorate unsurprisingly led to a barrage of online comments.\n“I ask why is this happening to our democratic (sic) country?” Godwin stated.\nTo which Joe answered: “Democracy is what I believe to be the most subtle form of dictatorship! Once elected you are at the mercy of ‘democracy’.”\n“Once elected democratically tyrants destroy the democracy that allowed them to gain power and that survives only at the mercy of a corrupt foolish majority,” Francis remarked.\nJoseph was equally pessimistic: “Muscat has morphed Malta into a parody of a democratic nation, taking advantage of the structural deficits of our educational system and our colonial past. We have also perverted the notion of political consensus, transferring it to whatever is diametrically opposed to the common good.”\n“This is also the best time for the press,” Mario sarcastically commented, poking fun at Labour’s ‘Best of times’ electoral slogan. \nRay emphasised that undermining the press was tatamount to attacking democracy: “The press is the fourth pillar of democracy. A suppressed press is a suppressed democracy.”\n“This will be the true, lasting legacy of the government of Muscat and his cronies,” A said.\nLino, on the other hand, was a lone voice criticising the report: “I disagree with this report. Malta’s reporters have all the freedom to write and say what they want. It appears that the basis of this report is based on the Caruana Galizia family’s continuous false propaganda abroad. In our islands we do have and enjoy press freedom.”\nNew EU border law\nThe new law protecting the external borders of the European Union, piloted and negotiated by Maltese MEP Roberta Metsola, received its fair amount of online praise, as well as some scepticism.\n“Excellent work!” Robie remarked. “That’ll keep the Chinese and Middle East people out – oops! No it won’t because they buy their way in. One law for the rich...” Steve said, tongue in cheek.\n“Roberta is one of the few real professionals representing us,” Joseph said.\nDonald, however, was somewhat sceptical about the whole thing: “There are close to a million migrants on the Libyan shores waiting for a chance to invade Europe by any means they find. The laws our zealous MEP (kudos to her) managed to pass will mean nothing if those migrants find their way to Europe.”\nAs far as Tony was concerned, the best solution would be to end the free movement of people throughout Europe. “How about scrapping Schengen?” he asked.\nWhat they said\n“Those staying home are certifying corruption. It would be a thank you to Labour, and a thank you to Konrad Mizzi.”\nNationalist Party leader Adrian Delia addressing the party faithful at the PN club in Siġġiewi where he urged supporters to vote in next month’s MEP elections.\n“The Maltese language faces digital extinction.”\nEducation Minister Evarist Bartolo speaking on the results of a study about language use in schools carried out by the National Literacy Agency.\n\n“We have had enough of pseudo public policies which are a cover for vote grabbing or give rise to pro-shady business deals.”\nDemocratic Party leader Godfrey Farrugia writing in the Times of Malta about his opposition to the Malta-Gozo tunnel. Parliament later approved plans for a permanent link between the two islands.\n“Notre-Dame is more than just a French heritage building; it is also a symbol of Christian Europe and European heritage.”\nTony Cassar, a museum multimedia designer, writing in the Times of Malta about the fire that engulfed Notre-Dame Cathedral.\n\n“When I was tasked with drafting a new European Border and Coast Guard law, no one thought we would be here today, less than six months later, with a deal on the table.”\nNationalist MEP Roberta Metsola, who piloted and negotiated the EU law protecting the external borders of the bloc, speaking after the law in question was approved by a large majority in the European Parliament. The law, negotiated in a record time of six months, will see the addition of 10,000 European border and coast guards.", "comment_count": 0, "id": 3925}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 2.50pm, adds Air Malta statement\nThe national airline is expecting to register an operating loss in the financial year ending March 2019.\nThe airline’s board of directors is forecasting another loss-making year despite continued efforts to increase revenue and lower costs, according to the full financial statements for year ending March 2018 deposited last week with the registry of companies.\nThe airline recently declared a profit of nearly €1.2 million. This represents the operating profit before restructuring costs and non-recurring items. Tourism Minister Konrad Mizzi, whose portfolio includes Air Malta, touted this as a “success story” coming after nearly two decades of yearly losses. He did not give the financial statements to the press.\nThe figures just published, however, show that were it not for a nearly €34 million in revenue from the disposal of landing rights in 2018, the airline would have registered a loss of €17 million (after restructuring costs and non-recurring items). This would have been larger than the loss recorded in the previous year, which had reached nearly €14 million.\nCiting the most recent data available to the company up until its AGM held last month, the airline said it “will most likely register operating losses from continuing operations during the 2019 financial year”.\nAccording to the airline, the losses will be due to “start-up investment in new routes, operational disruptions emanating from industrial relations issues, market volatility in respect of fuel prices, developments in the outcome of the fleet renewal process and long outstanding technology upgrades”.\nThe one-time gain of €33.9 million in 2018 came from the selling of the so-called “summer slots” at Heathrow and Gatwick airports. The company will be using another €22.8 million gain from the sale of more landing rights – described as ‘winter slots’ – to boost its accounts in the next financial reporting period (March 2019).\nDr Mizzi did not reply to a specific question from The Sunday Times of Malta asking him to explain how Air Malta was now predicting further losses in 2019 when he had declared the airline had “turned the page” under his stewardship.\nRevenue up, but question marks remain\nThe March 2018 accounts show a marked general improvement in revenue generated by the airline, particularly through the reversal of a previous policy under which Air Malta’s operations were shrunk during the first Labour administration. The airline has instead carried more passengers, flown more routes and re-opened others.\nHowever, industry experts have pointed to a number of technical aspects from the latest set of accounts which they suspect were the result of “potentially creative accounting techniques”.\nThe company’s accounts, for example, show that it spent less on fuel and maintenance costs on its planes. But industry sources pointed out that these cost decreases included in the accounts raised eyebrows because “it is quite difficult to fly more and reduce your fuel costs”.\nIt is quite difficult to fly more and reduce your fuel costs\nThe accounts also show savings were made through favourable foreign exchange rates. However, although this is not normally considered an operational item, it was included as such in the accounts.\nAlso, despite having undergone a restructuring exercise that included shedding staff through voluntary early retirement schemes, the size of the payroll remained nearly the same as in the previous year.\nOne industry source remarked that since Air Malta’s fleet is now quite old, “logic dictates that costs on maintenance should be higher and not €6 million lower as indicated in the accounts.\n“However, some foreign exchange and playing with the window when maintenance is carried out on planes to shift costs to another year could have played a part,” the source said.\nAir Malta has been struggling for several years, particularly due to cut-throat competition from low-cost airlines which have changed the way airlines conduct their business globally. The government had injected a total of €130 million into the airline during a five-year restructuring programme between 2011 and 2016, yet more losses appear to be on the horizon.\nQuestions sent to Tourism Minster Konrad Mizzi on the financial results:\n1. Can you explain how despite the significant impact of over €18m in restructuring costs, the payroll cost to Air Malta remained practically unchanged? How has the airline’s staff decreased only by a mere 12 members?\n2. If the airline has effected more flights and opened new routes, how can you explain that it had a lower fuel bill?\n3. Can you explain why the company has spent less on aircraft maintenance, particularly in the light of the age of the fleet?\n4. You had indicated that the company was on track towards a profitable future. How come the financial statements indicate that Air Malta will once again register operational losses in the financial year ending March 2019? Doesn’t this indicate a misleading assessment from your end of the 2018 results?\n5. Can you explain why directors’ fees have doubled from €53,000 to €113,000?\nReply from Minister Mizzi:\n“As at March 2018, the restructuring process was in the initial stages and the staff turnover was expected to start in the subsequent financial year. As at March 2018 the company raised a valid expectation in employees in carrying a restructuring and recognised the non-recurring cost in the profit and loss during the reporting period.\nThe restructuring cost is a non-recurring event and will reap benefits in the subsequent years. The underlying business for the reporting period generated €1.2m profit.\nWith respect to fuel costs, for the corresponding year (FY ending 2017) the outcome of hedge contracts that were contracted in the previous year left a negative impact. For the reporting financial year, the company managed to successfully exploit the fuel market.\nFor the reporting year the company managed to leverage better contract terms with suppliers and exploited the forex market. It was thus able to save more on maintenance costs.\nDuring this year, the company pursued a growth strategy to take advantage of economies of scale, add value of the airline’s brand and support the Maltese economy. We managed to carry over 2 million passengers over the previous period, an increase of over 300k passengers. The strategy included investment in new routes that the management is confident that will reap benefits in the forthcoming years. The company is expected to continue realising profits.”\nAir Malta's reaction\nIn a statement on Sunday, Air Malta said the report ignored the external auditors report incorporated within the financial statements. The external auditors' statement stated that  during the financial year ended March 31 2018, the group reported operating profits from continuing operation prior to restructuring costs and non-recurring items amounting to €1.2 million euros (2017; operating losses from continuing operations prior to re-structuring costs and non-recurring items amounting to €10.8 million). The company expressed its appreciation at the professionalism, integrity and guidance of its external auditors and rejected in the most forceful manner the allegation that in its audited accounts it or its auditors made recourse to “potentially creative accounting techniques” or “clever book entries”.", "comment_count": 95, "id": 3926}, {"keywords": "", "author": "", "article_body": "The Sunday Times of Malta reports that Malta is one of three countries the Council of Europe has selected for a review of respect for democratic processes.\nThe newspaper also reports that Air Malta is set to make a loss this year, and that a migrant murdered earlier this month was most likely returning home after helping people at Ħal Far when he was shot.\nThe Malta Independent on Sunday leads with an account by a drug mule who says ‘I did not think twice about swallowing capsules to smuggle drugs to Malta’.\nMalta Today reports that Castille has been told to get a handle on UN envoy Alex Sciberras Trigona, who has reportedly annoyed US and Russian diplomats by ‘aggressively’ trying to broker a Trump-Putin summit in Malta.\nIt-Torċa reports that the General Workers’ Union is at work to see how to implement the EU’s Work-Life Balance directive as soon as possible.\nIl-Mument reports that not a single woman taking part in the Labour Party's LEAD programme for women leaders will be contesting next month's election, with the project in reality being a vehicle for Miriam Dalli's political career. \nIllum follows up on reports of problems at Mount Carmel Hospital, with Health Minister Chris Fearne saying 60 patients will be in new wards by the summer. \nKullħadd writes that Simon Busuttil and PD’s Godfrey and Marlene Farrugia “broke a promise to Gozitans” by missing a parliamentary vote on a permanent link between Malta and Gozo.\n ", "comment_count": 0, "id": 3927}, {"keywords": "", "author": "Sarah Carabott and Ivan Martin", "article_body": "The Ivorian man murdered earlier this month had most probably been walking home after offering food and support to migrants at the Ħal Far centre when he was shot. \nLassana Cisse, 42, often checked in on his fellow countrymen at the open centre after work, trying to ensure they were doing well in a new country.\nMembers of the migrant community told The Sunday Times of Malta that he was probably returning home on foot from one such visit when he was killed on Triq tal-Ġebel in Birżebbuġa on April 6.\nThe incident came just two months after a 17-year-old migrant from Chad was hit by a car and left unconscious by the side of the same road.\nMigrants who live in the area and elsewhere in Malta have since been living in fear, with Mr Cisse’s flatmates now barely sleeping at night.\nTwo teams investigate case\nThe “deafening silence” from the police had exacerbated the sense of helplessness among migrants, they said.\nPolice sources said they had not been vocal on the matter because they are concerned about the possibility of prompting racially motivated copycat murders. Investigations, however, are ongoing. Patrols and police surveillance around migrant hotspots had also been increased in a bid to deter any other violent acts. \nInvestigators said that while they could not say with certainty that Mr Cisse had been the victim of a racial hate crime, this was looking increasingly possible. \nOpinion: In memory of Lassana - Michela Spiteri\nThey said that the two teams of officers appointed to investigate the case were looking into a number of leads as well as into the victim’s background to try and establish any possible motives for the killing. Lassana Cisse was killed earlier this month.\nSo far, there was no indication he had been involved in any criminal or dangerous activities. The less likely a criminal or other possible explanation for the murder became, the more the police were leaning towards the racial implications of the killing, the sources said.\nThe situation could get worse – quickly\nThe possibility of the crime being racially motivated was described as being doubly worrying for police, because not only could this encourage copycats but it could also spark a violent response from the migrant community.\n“If the motive is purely racial, then this would be a very worrying escalation. We truly hope this is not the case, because if so, the situation could get worse – quickly,” a senior officer said. \nIn cold blood\nMeanwhile, those who knew Mr Cisse in Malta say killing must have come in cold blood.\n“Lassana’s murder was sudden, and just as quickly everyone seems to have forgotten about it – the police, the media and society. This has only increased fear in migrants who are scared that they could be next,” a man close to the migrant community told The Sunday Times of Malta.\nHe said asylum seekers who arrived in Malta some years ago would often drop by at the Ħal Far open centre to check on other migrants, especially during the first days of their stay there.\nSome provided fruit and vegetables that they knew their countrymen were familiar with while others lent out their mobile phones for the newly arrived to contact their relatives back home.\nMigrants have told The Sunday Times of Malta that the lack of police knowledge and action over black people being pelted with rocks, taunted and threatened or even hit by cars in the area had seen several avoid the road where Mr Cisse was shot dead.\nThe drive-by shooting left two others wounded. They have since been released from hospital.\nThe police have finally identified the pair – a 22-year-old from Guinea and a 28-year-old from Gambia. They both live in Birżebbuġa. Police had initially said they were a 22-year-old who lives in Ħal Far and a 45-year-old from Georgia.\nThe three victims were found spread out across the country lane. While Mr Cisse was heading south towards his home in Birżebbuġa the other two were walking north together towards Ħal Far.\nThe police believe the shooter was riding in a white Toyota Starlet and had said they were investigating CCTV footage.", "comment_count": 0, "id": 3928}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The gang believed to be behind the burglary of dozens of apartments in the Sliema and St Julian’s area appear to have become more daring.\nBurglars have been removing locks from front doors to gain entry as can be seen in this photo from a Sliema apartment they targeted last week.\nLast week robbers broke into a Swieqi villa at night and locked family members asleep inside their bedrooms while they ransacked the place.\nAccording to CCTV footage obtained by the police from nearby residences, two or three robbers were inside the house for at least 20 minutes while another waited for them outside.\nThe police were contacted in the morning by the family after they woke up to find themselves locked inside their bedrooms. \nLast week The Sunday Times of Malta reported that dozens of residences in the Sliema and St Julian’s area had been targeted by robbers either from the same gang or using similar methods to gain entry.\nThe thieves, often posing as workers to fool neighbours, have been drilling through front door locks, even those considered to be among the more secure, and removing them entirely from the outside.\nThe majority of burglaries have been from apartments rather than houses. In all cases, the thieves stole jewellery, cash and watches. Larger items, such as televisions, gaming consoles, hi-fi systems, laptops and computers, were left untouched. \nThe latest incident might mean that the robbers are now undeterred by residents asleep inside.\nIt is good that people become more aware\nSome residents appear to have become more vigilant, with sources close to the police saying there had been a spike in the number of calls reporting people acting suspiciously in the vicinity.\nThefts in several towns\nYet, two apartments in the same Sliema block were burgled  one day last week at about 4.30pm.\nApart from the Sliema, St Julian’s, San Ġwann, Pembroke and Swieqi area, an increase in thefts has been reported from residences in Rabat and Mtarfa, as well Marsascala, Birżebbuġa and Żabbar.\nThe police have once again urged people to team up with neighbours to be on the lookout for anything that might look abnormal. The installation of alarms, CCTV systems and security locks could also help. However, they urged a certain degree of caution.\n“One woman called to say there was a man standing right outside her residence who looked like he was observing people going in and out of their homes. But we found no one there.\n“It is good that people become more aware of what’s going on but at the same time we cannot suspect that everyone’s a thief,” one police officer said.", "comment_count": 99, "id": 3929}, {"keywords": "Gozo", "author": "", "article_body": "The Europe Direct Information Centre in Gozo organised a discussion on ‘What Europe does for me – Why should I vote?’ in Victoria. The aim of the event was for Gozitan youths to raise their concerns/issues related to the EU and to raise awareness about the role of Parliament and the EU among the younger generation.\nEuropean Parliament prospective candidates Anotine P. Borg (Independent), Arnold Cassola (Independent), Martin Cauchi Inglott (Democratic Party), Josianne Cutajar (PL) and David Stellini (PN) discussed several issues relevant to Gozo. They were interviewed by Carla Galea, former KSU president.\nTopics discussed included Gozo EU funding; whether the 10 per cent suggested by the government was sufficient for Gozo; and what kind of regionality authority would suit Gozo best. \nGozitan Association of Employees in Malta president Sean Zammit asked whether the EU has lost its touch with the citizens and praised the creation of the Gozo Regional Development Authority, while Manuel Xuereb queried whether all EU citizens should vote for the European Commission President. Almost all candidates rejected the idea of federalising the EU institutions. However, some candidates wanted to have a simpler bureaucracy.\nThe Malta-Gozo tunnel project was also discussed. Mr Stellini suggested a regional referendum, while Ms Cutajar was in favour of the project and insisted it should start soon.\nOther speakers were sceptic.", "comment_count": 1, "id": 3930}, {"keywords": "Gozo", "author": "", "article_body": "The La Stella Philarmonic Society executed a programme of sacred music at St George’s Basilica in Victoria. The band, under the baton of Mro Noel Beck, interpreted a selection of sacred music which included classical compositions and three funeral marches penned by Mro Giuseppe Giardini Vella, Prof. Joseph Vella and Dr John Galea, who were conductors of La Stella Band during the past 70 years. During the concert, the band also premiered a new composition by Dr Galea, called Elegy – In memoriam Joseph Vella.", "comment_count": 0, "id": 3931}, {"keywords": "Environment", "author": "", "article_body": "The following articles and photos were submitted by students involved in EcoSchools Committees of schools taking part in the Young Reporters for the Environment (YRE) programme.\nA greener tomorrow\nThe alarming rate at which trees are being chopped off to make way for the construction industry prompted the students at Gozo College Middle School to study in detail surface temperatures in built-up areas. The purpose of this study was to investigate the effects of trees on urban heat temperatures.\nThe ‘urban heat island’ effect indicates that urban or built-up areas are warmer than natural open space areas. This was analysed by recording the surface temperature from two different areas – built-up areas (concrete/asphalt), and grassy patches with trees planted nearby. The objective was to find out the temperature differences between these two sites.\nInforming and involving the wider community.\nTaking a holistic approach the students learnt about global warming through science lessons. Experiments were held about greenhouses gases to understand how carbon dioxide (CO2) retains more heat and thus increases temperature.\nThe Global Learning and Observations to Benefit the Environment (Globe) programme is an international science and education programme that provides students and the public worldwide with the opportunity to participate in data collection and the scientific process, and contribute meaningfully to our understanding of the earth system and global environment.\nThrough the programme, the students were directly involved in data collection and used it to investigate ways to mitigate high temperatures in built-up areas. Using an infrared thermometer the students measured surface temperatures during December. Readings were taken from two selected sites – the school ground covered in cement/asphalt and an open area in Victoria near the bus terminus, which is covered in grass and has trees planted in it.\nSurface temperature readings for December\nThe data collected showed that surface temperature varies on average by 9°C between vegetated surfaces and cemented/asphalt surfaces. Results support the statement that lack of trees contribute to the formation of ‘urban heat islands’.\nHaving discovered all this the students went a step further. They wanted to be part of the change, not just pointing fingers and complaining about the environmental degradation. The students carried out research on various local trees and shrubs including the Judas Tree, Myrtle, Aleppo Pine, Lentisk, Wild Thyme and others.  They came up with an innovative idea on how to promote the growth of local indigenous trees.\nThe students prepared over 450 seed packs using recycled materials, such as toilet paper rolls and newspapers, and gave them out to students, teachers, school staff and other people who had participated in their Climate Action Fun Walk. The aim of the walk was to raise awareness about climate change and the need for action.\nIf these seeds are sown this could lead to an increase in the number of local trees, which are used to the Maltese islands’ dry, hot climate, have less need for irrigation and therefore have a low water footprint. Such trees would lead to lower urban temperatures and less CO2 in the atmosphere.\nAn adopted turtle being released back to freedom.\nBe drastic, cut plastic\nPlastics are inexpensive and so are produced in very high quantities. However, the chemical structure of most plastics makes them long-lasting and resistant to many natural processes of degradation, meaning they take long to degrade, if ever. These two factors together have led to an excessive amount of plastic pollution in the environment.\nDuring a nature walk in one of Gozo’s valleys, members from the EcoSchools committee carried out a litter survey and were impressed at the huge amount of plastic waste they found, most of which consisted of single-use plastic such as plastic bottles, plastic cutlers, cups and bags. While on site they picked up all litter they came across and ended up collecting over 30kg of waste.\nThe students were so overwhelmed that they decided to try to bring about change and to reduce or even stop the source of this curse. Back at school they carried out research and found some facts about plastic pollution, such as:\n• Plastics take a very long time to degrade;\n• Less than 10 per cent of plastics are recycled;\n• More than 80 per cent of plastic pollution in the ocean comes from land-based sources;\n• Plastics harm marine life;\n• Microplastics end up being consumed by marine animals, which in turn are consumed by humans.\nAll of this stirred in the students an urge to curb the use of single-use plastic. In an effort to reduce the adverse effects of plastic in the natural environment the students came up with a campaign entitled ‘Be Drastic, Cut Plastic’ which involved giving out mesh bags to encourage people to reduce their use of plastic bags.\nThe students went around the streets of Victoria and distributed the posters to fruit vendors, and gave free mesh bags to customers.\nThe students also undertook another initiative aimed at raising more awareness about marine litter created by single-use plastic and to give something back to nature.\nThey adopted a loggerhead turtle named Doris that has a missing flipper after being severely entangled by marine debris.\nThere seems to be light at the end of the tunnel as the European Parliament recently voted for a complete ban on a range of single-use plastics across the European Union by 2021 in a bid to reduce the pollution of the oceans. The world is changed by action not by opinion, and these students are certainly setting the example.\nTo read other students’ YRE entries, visit www.yremalta.org.", "comment_count": 0, "id": 3932}, {"keywords": "Gozo", "author": "", "article_body": "The Saturday series of lectures hosted at Il-Ħaġar museum, St George’s Square, Victoria, featured former Sunday Times of Malta editor Laurence Grech (pictured) explaining “Why I was born”.\nMr Grech quipped that he was born “thanks to the war”. He was, in fact, born in the post-war ‘baby boom’ in 1948 to a school headmaster from Għajnsielem and a teacher from Valletta 17 years his junior, both of whom had their lives deeply traumatised by the war.\nAfter a brief introduction about the part played by Malta in the war, Mr Grech recounted the tragic circumstances which brought his parents together and the incredible story both families lived to tell.", "comment_count": 0, "id": 3933}, {"keywords": "Education", "author": "", "article_body": "Daniel Grech from Gozo College’s primary school, Victoria, is the top Year 6 winner in this year’s edition of the High 5 Junior Mathematicians Challenge. Eric Briffa from De La Salle College is the Year 5 winner.\nThe team challenge winners are Kyle Pulis from St Nicholas College’s Mġarr primary, Liam Tabone from Maria Regina College’s St Paul’s Bay primary, Luke Debono from St Ignatius College’s San Ġorġ primary, Qormi, Marcus Loporto from St Aloysius’ College primary, Balzan, and Martina Grima from Maria Regina College’s primary, Naxxar.\nA total of 83 Year 5 and 6 pupils gifted in mathematics from various primary schools took part in this year’s fourth edition of the challenge. Over 300 pupils from 73 schools had initially been nominated to take part.\nDuring the challenge the participants had to complete hands-on, enquiry-based, challenging mathematics tasks during after-school workshops held at various Heritage Malta sites.\n The winners were awarded board games sponsored by Malta Geek Paradise Ltd.  The schools of the two top scorers were presented vouchers sponsored by the HSBC Malta Foundation for the purchase of resources.\nThe challenge is organised by the Education Ministry’s Directorate for Learning and Assessment Programmes (DLAP). The next edition will be announced through an official circular issued by DLAP in October.", "comment_count": 0, "id": 3934}, {"keywords": "Gozo", "author": "", "article_body": "A Passion exhibition, entitled Ħtija Tiegħi, organised by the Għaqda Dilettanti Ġimgħa l-Kbira – Għawdex is on show at St George’s Square, Victoria. The exhibition, open today between 9am and noon, consists of various works of sacred art and Passion play vestments. Ħtija Tiegħi was inaugurated by Gozo Minister Justyne Caruana and blessed by Fr Effie Masini. Chev. Joe M. Attard introduced the exhibition and read a poem written by himself, while society president Jamie Camilleri also delivered a short address.", "comment_count": 0, "id": 3935}, {"keywords": "Education", "author": "", "article_body": "A 16-hour course entitled ‘Digital Marketing Strategy – Planning and Implementation’ is being held next month by Malta University Consulting Ltd at the University Residence in Lija.\nThe course will consist of the presentation and discussion of case studies, best examples and demonstrations. This will help participants acquire applied skills such that by the end of the course they should be able to design and implement a basic digital marketing strategy for a business or NGO.\nThe course tutor and co-ordinator is Dr Franco Curmi, an academic at the University of Malta. Dr Curmi has a Master in Creativity and Innovation from the University of Malta and Master in Digital Innovation from Lancaster University.\nFor further information call Maria Bugeja on 2124 0746 or e-mail maria.bugeja@muhc.com.mt.", "comment_count": 0, "id": 3936}, {"keywords": "Gozo", "author": "", "article_body": "An exhibition commemorating the 20th anniversary of the death of Gozitan poet and author Ġorġ Pisani was held at the National Library in Victoria. The exhibition comprised original manuscripts and printed works of the prolific author as well as photographs and other memorabilia.\nA literary soirée was also held during which excerpts from Pisani’s works were read. The poet’s son, Notary Paul George Pisani, and George Cassar, the librarian, addressed the gathering.", "comment_count": 0, "id": 3937}, {"keywords": "", "author": "", "article_body": "More than 144kg of cocaine with a street value of just under €16 million were found hidden inside containers at the Malta Freeport on Saturday, in the fourth major seizure of the illicit drug in just two weeks. The drug was hidden inside refrigeration compartments. Photo: Customs\nThe latest haul means Malta Customs have seized more than 350kg of cocaine which was being shipped to Europe via Malta in the last 14 days, and more than 750kg of cocaine in 2019 so far.\nCustoms have also made other major cocaine seizures in the past months, with two hauls in March netting €39m worth of the drug and other seven-figure catches in previous months. \nCustoms officials found Saturday’s haul hidden in refrigeration units of three containers heading to Albania and Montenegro. All three containers, which came from an undisclosed South American country, had been flagged for scanning by the Customs Container Monitoring Unit.\nTwo of the containers were en route to Durres in Albania, and were carrying a total of 40 packets of cocaine weighing 48kg.\nThe third container, which was heading for Bar in Montenegro, was carrying 80 packets of cocaine weighing 96kg.\nIn total, the 144kg of cocaine seized are estimated to have a street value of €15.7 million.\nIn a statement, the Customs department thanked the Malta Freeport, police and Armed Forces for their role in what they said was 12-hour operation.\nA magistrate is leading an inquiry into the case, which has now been handed over to the police anti-drug squad.", "comment_count": 0, "id": 3938}, {"keywords": "", "author": "", "article_body": "Former parliamentary secretary Deborah Schembri has been appointed chairwoman of the board of appeal under the Foster Care Act, the latest in a number of government jobs for the lawyer.\nAccording to a notice in The Malta Government Gazette, Dr Schembri assumed office this week and will serve for three years.\nShe succeeds Ramona Frendo who last month was appointed judge at the European Union’s general court.\nAppointed by the Minister for the Family, Children’s Rights and Social Solidarity, the board of appeal, made up of a chairman and two members, is tasked with reviewing decisions by the Fostering Board when appeals are filed. It also reviews decisions by the central authority.\nRead: Ex-junior minister gets over €160,000 a year\nQuestions sent to the Family Ministry on the matter remained unanswered at the time of writing. Times of Malta reported over the past months Dr Schembri earned about €160,000 a year through public contracts awarded to her by direct order after losing her parliamentary seat in the last election.\nDr Schembri was appointed legal consultant by both the Planning Authority and the Lands Authority, which both fell under her political wing until the last legislature.\nShe was also awarded contracts by the Office of the Prime Minister in connection with Identity Malta and legal consultant on a person-of-trust basis. She was also named data protection officer on a three-year contract.\nEarlier this year, Dr Schembri and her adviser at her ministry, Robert Musumeci, formed a new partnership to provide legal services to their clients, including government authorities.", "comment_count": 40, "id": 3939}, {"keywords": "", "author": "Sarah Carabott", "article_body": "If people with a disability were elected to Parliament, politicians would no longer do what they thought benefit disabled people as disabled people themselves would be making the decisions, according to Oliver Scicluna.\n“Policies and legislation would foresee the rights of people with a disability from inception,” the Commissioner for People with a Disability told the Times of Malta. \n“However, the most important change would be that society would be able to see that people with a disability can also be leaders. My wish is to see people with intellectual disability also working actively in politics, with the help and support of their teams,” Mr Scicluna added.\nBut is the Maltese electorate willing to elect people with a disability?\nMr Scicluna pointed out that a small number of people with a disability already occupied elected positions in local councils and, in the past, there was also a representative in Parliament.\n“So the Maltese electorate has, in fact, already elected people with a disability, although the general representation is still lacking,” he said, adding that voters needed the opportunity to recognise the abilities of people with a disability and, hence, the need for their increased participation. \nAccessibility is a major issue\n \nInaccessible apartments, patronising attitudes\nThis week, Mr Scicluna met with disabled candidates who will be running for election in their local communities. He said Malta required more politicians with a disability because they were best placed to understand the challenges faced by people like them. \nSome of the candidates spoke about obstacles they faced when running their political campaigns, including inaccessible premises and apartments, patronising attitudes and higher expenses.\nMr Scicluna suggested setting up a fund to offset some of the extra expenses, enabling electoral candidates with disabilities to compete on a more level playing field. The fund could, for example, cover the costs of a person who does sign language interpretation.\nSome disabled people might need to resort to advertising on social media, particularly if they were mobility impaired and could not do house visits while blind people needed someone to drive them around.\nAccessibility is a major issue, with most candidates who spoke to the commissioner pointing out that even local council premises were often out of bounds for them.\nMr Scicluna noted there were at least 18,000 people registered with the commission, however, this was not reflected in the country’s political representation, creating a gap in the representation of diversity at community level.", "comment_count": 18, "id": 3940}, {"keywords": "", "author": "", "article_body": "Police on Saturday turned to the public for help in tracking down a woman who has been missing since late on Wednesday.\nMary Muscat, who lives with dementia, was last seen on Wednesday night at just after 11.30pm and has been missing ever since. She was reported missing on Thursday afternoon.\nAnyone with information about Mrs Muscat or her whereabouts can contact the police on 21224001 or 119, or visit Qawra police station.", "comment_count": 0, "id": 3941}, {"keywords": "", "author": "", "article_body": "Updated at 7.25pm\nPolice officers who stopped a young driver in Ħamrun on Saturday narrowly avoided getting run over after the youth tried to flee the scene twice in quick succession.\nThe young man, a 24-year-old from Tarxien with a history of other traffic offences, was driving along St Joseph High Street when officers noticed that the windows on his Mitsubishi Shogun SUV were all darkly tinted.\nThe traffic division officers stopped the driver and ordered him to turn off the engine.\nInstead of complying, the driver hit the accelerator and made off. \nOfficers quickly caught up with him and stopped the car. Rather than comply, the young man got aggressive and again hit the accelerator.\nThis time, he drove in the direction of two officers and smashed into a police motorcycle, narrowly missing the two.\nNobody was hurt in the incident and the youth is now under arrest, the police said. ", "comment_count": 0, "id": 3942}, {"keywords": "", "author": "", "article_body": "Democratic Party leader Godfrey Farrugia will be contesting the European Parliament elections, he announced on Saturday, bringing the party’s MEP candidates to four.\nDr Farrugia submitted his nomination electronically and made his decision public on Facebook.\nHe will join PD candidates Anthony Buttigieg, Martin Cauchi Inglott and Camilla Appelgren on the ballot sheet.\nThe PD leader told Times of Malta that he had decided to contest the election to ensure the party put maximum pressure on Malta's two major parties.\n\"Big parties are shamelessly colluding at the cost of the future our country,\" he said.\n\"Our country deserves leadership that provides for transparent, accountable, sustainable governance for all its citizens.\"\n“We are at the lowest-ever point in the country’s political history,” he added. “We are a team and we have faith in the electorate and its judgement”.\n\nElectoral law\nDr Farrugia's nomination also ensures that the PD's orange colours will feature on the electoral ballot paper. \n\nAccording to the General Elections Act, only parties with at least four candidates can have their colours displayed on ballot sheets. \nArticle 49 (7) of the General Elections Act.\nThe European Parliament elections will be held across Europe next month. \nEarlier on Saturday, candidates from the Labour and Nationalist parties, including Alfred Sant and Roberta Metsola, also filed their respective nominations for the EP elections. ", "comment_count": 20, "id": 3943}, {"keywords": "", "author": "", "article_body": "Updated at 4.10pm with mayor's comments\nA cave along Malta’s southern coast collapsed over Friday and Saturday, creating a short-lived limestone arch which only held up for hours before also giving way.\nGħar Ħanex, which lay on a stretch of coastline on the outskirts of Qrendi between Għar Lapsi and Wied iż-Żurrieq, is believed to have initially collapsed on Good Friday.\nThat first collapse turned what used to be a cave into a new arch, prompting tentative comparisons with the now-defunct Azure Window, which caved in just over two years ago.\nThe short-lived natural arch which was formed when Għar Ħanex initially caved in. Video: Facebook/JP Muscat\nThose comparisons proved to be unwittingly prophetic. Within hours, the newly-formed arch also caved in, leaving a gaping hole where Għar Ħanex used to be.\n'Fierce gales took their toll'\n“The iconic Ghar Haniex on the Qrendi coastline collapses, due to rough seas and coastal erosion,” wrote Qrendi mayor David Schembri on Facebook. “Nature gives and nature takes away”.\nThe cave had already weathered some damage during last February's vicious storm, he later told Times of Malta. \"Fierce gales took their toll,\" he said. \n\"We will have to ask authorities to inspect and give us a situational report,\" he said, noting that the site, which is designated as a Special Area of Conservation, benefits from Natura 2000 protection. \nNatura 2000 is an EU-wide network of nature conservation areas which enjoy specific protection under the EU's Birds and Habitat Directives.  \nWhen Times of Malta visited the scene on Saturday afternoon, sea around the area of the collapsed cave was a murky brown, as waves lapped against the collapsed rock, washing it away. The onetime cave was a popular site among hikers and kayakers, offering them some respite from the sun during the hot summer months. \nIt formed part of a series of coastal formations in the area which are known as Nuffied, mayor Schembri explained. \n\"These include a small cove known as il-Maqluba tal-baħar, the Ras il-Miġnuna natural arch, Ħalq it-Tafal and in-Nuffied iż-Żgħir,\" he said. \nMr Schembri urged hikers to keep to well-defined tracks as they made their way across the coastal landscape, to steer clear of the edges of cliffs and to respect hunters who used the area to hunt for quail during the spring hunting season. \n\nWhat was once a cave is now a gaping hole. Photo: Jonathan Borg\nMurky brown seas wash what was once Għar Ħanex away. Photo: Jonathan Borg", "comment_count": 18, "id": 3944}, {"keywords": "", "author": "", "article_body": "A political statement in favour of an undersea tunnel between Malta and Gozo approved by parliament this week undermines the integrity of the decision-making process of the regulatory authorities, the Green Party lashed out on Saturday.\nParliament's approval is a declaration of complicity to ruin Gozo, Alternattiva Demokratika Carmel Cacopardo told a news conference on Saturday.\nThe vote on the motion approved last Wednesday was described Infrastructure Minister Ian Borg as a “historic moment” from which there was no turning back.\nBut Mr Cacopardo accused parliament of trying to condition the authorities and institutions which have to weigh and analyse the project when the application is submitted.\nIt is useless for the Nationalist and Labour parties to \"shed crocodile tears\" about the need of public authorities to do their job with integrity and neutrality and then at a critical moment try to condition the way they act, Mr Cacopardo said.\nRead: Construction of permanent link between Malta and Gozo unanimously approved\nThe purpose of facilitating mobility between Malta and Gozo can be easily achieved through a rapid ferry service from Mġarr in Gozo to various parts of Malta's coastline, without creating substantial environmental impacts.When push has come to shove their masks have fallen\nThe environmental impacts generated by the proposed tunnel between Malta and Gozo include not only construction waste and the scourge of sea reclamation being proposed by Government and powerful lobbies. The tunnel will substantially increase vehicle movement between the islands; this is contrary to the national transport plan which requires that cars on the roads decrease, not increase.\nThe AD delegation in front of parliament.\n\"We have a Parliament of hypocrites which preaches in favour of environmental protection, including in Gozo: but now when push has come to shove their masks have fallen. Shamefully the motion was approved unanimously,\" he said.\nThe projected expenditure is still not known since this depends on the outcomes on studies which have not been completed and published yet.\nAD candidate Mina Tolu said the only European Parliament that constantly and consistently votes for measures to protect the climate is the European Green Party. The other parties are constantly engaged in a series of trade-offs with economic operators.\n\"Environmental protection involves much more than the cleanups in the countryside. It also involves decision-making processes, which if not conducted responsibly can destroy the future of generations yet to come.\"", "comment_count": 84, "id": 3945}, {"keywords": "", "author": "Claire Caruana", "article_body": "Over a quarter of those booking holidays in Malta use Airbnb-style services, dealing directly with individuals instead of hotels, official data shows.\nAccording to the European Union’s statistics office, 26 per cent of those who booked accommodation in Malta last year did so via websites or mobile applications from another “private individual”, the second highest rate across Europe. The figure shot up from the previous year’s 20 per cent.\nMost of the individuals making the bookings in such a manner, the statistics office noted, used dedicated websites or applications but other sites or apps, including those of social networks, were also used.\nAmong the EU member states, the country with the highest proportion of individuals arranging accommodation online through another private individual was Luxembourg (44 per cent), followed by Ireland and Malta (both 26 per cent).\nIn contrast, the proportion was below 10 per cent in seven member states: Cyprus (three per cent), Czechia (five per cent), Latvia (seven per cent), Greece, Romania, Slovenia (all eight per cent) and Bulgaria (nine per cent).\nAs the popularity of people providing accommodation to tourists has soared in Malta in recent years, with the non-collective accommodation (such as Airbnb) sector booming, hoteliers have warned that such operators were not going through the proper channels. \nThey also claimed that enforcement in Airbnb-style accommodation was lacking, with those providing such services enjoying an unfair advantage over hoteliers.\n'Unlicensed accommodation growing at incredible rate'\nThe president of the Malta Hotels and Restaurants Association, Tony Zahra, said the fresh data did not come as a surprise as the association had “for far too long” been telling the government that private accommodation, most of which was unlicensed, had been growing at “an incredible rate”.\n“The MHRA is aware of a large number of properties that are being finished or built right now and are destined for the short-term tourism market. This is creating a number of issues.\n“Firstly, most of these are not registered and, therefore, there is no level playing field. Secondly, we are seeing short-term tourist accommodation in what are primarily residential areas if not mostly residential blocks,” Mr Zahra said.\nSuch tourists, he went on, tended to be “very boisterous and loud” and did not care much about those living in the neighbouring residences.\n“The increase in this type of accommodation is also pushing up the price of property and squeezing out the permanent residents from the rental market,” he remarked.\nOn the impact of the emerging trend, Mr Zahra warned there could be a threat to the viability of the hotel industry if the occupancy levels of the hotels dropped.\n“The consequence of a decrease in occupancy could be a lowering of hotel rates which, coupled with lower occupancy, could start hitting the profitability of the industry,” he said.", "comment_count": 25, "id": 3946}, {"keywords": "", "author": "", "article_body": "Updated 1.50pm with Zammit Dimech nomination\nFormer Prime Minister Alfred Sant submitted his nomination for the European elections on behalf of the Labour Party on Saturday saying this will be the last election he will be contesting.\n“This will be my last political campaign,” the MEP said after presenting his nomination in Naxxar.\nDr Sant said he is contesting the European elections after being convinced that everyone should be “on deck” to achieve two important targets at the European Parliament.\n“We must counter with truth the mudslinging campaign at the European Parliament. This campaign was supported with the active help of local political forces aimed at tarnishing Malta’s reputation in Europe and elsewhere. Secondly we will work incessantly to create a social conscience in Europe and to give our utmost to eradicate inequalities across the continent,\" Dr Sant said.\nDr Sant served as prime minister between 1996 and 1998, where he infamously froze Malta's EU application, before losing three successive general elections, the last in 2008 with a wafer-thin majority. \nDr Sant thanked Alison Zerafa Civelli, Helena Dalli, Christian Zammit and Joe Debono Grech for endorsing his nomination.\nPrime Minister Joseph Muscat had urged Dr Sant to contest the European elections.\n“Malta needs Alfred Sant. Alfred has the experience and the vision to represent Malta at the European Parliament. We cannot afford to lose his presence at the European Parliament... I followed his interventions at the European Parliament to defend Malta, to defend me personally, to defend the Labour Party and above all to defend Malta,” Dr Muscat had said.\nWatch: Alfred Sant ‘still doubts’ Konrad Mizzi’s statements but...\nMEP Roberta Metsola\n'Our job is not yet finished'\nMeanwhile, popular MEP Roberta Metsola also submitted her nomination on behalf of the Nationalist Party.\nSpeaking after the submission, Dr Metsola said: \"I will keep working for the Malta and Gozo we all want to see, where injustice is always fought and impunity ends. We want to make all Europeans, especially those in Malta and Gozo, to feel secure in their communities. We have to make the environment a priority and build on our EU single-use plastic ban, cleaning up our oceans and our valleys.\"\nOn immigration, the MEP said more work was needed to build on the achievements so far and ensure fairness with those in need of protection.\nNationalist MEP Francis Zammit Dimech also submitted his nomination on Saturday. \nHe said that in less than two years he had served on the European stage, he had managed to achieve important results.MEP Francis Zammit Dimech\nEarlier this week the European Parliament adopted with a strong vote a new law he negotiated to safeguard the interest of SMEs using online platforms to reach customers which will lead to better deals for consumers.\nDr Zammit Dimech has also worked on various health issues specifically to step up the fight against cancer and to increase services for diabetics and also strengthened EU wide whistleblowers legislation and worked to improve working conditions.\nHe promised that health and its digital dimension will be one of his priorities if given another mandate.\n ", "comment_count": 47, "id": 3947}, {"keywords": "", "author": "", "article_body": "Two illegally-shot turtle dove birds were recovered by Birdlife Malta this week, showing that hunters were still shooting at the species despite the fact it is now listed among the protected species. \nWith these two latest illegal hunting casualties, the total of known illegally shot protected birds for 2019 now stands at 26, BLM said in a statement.\nOn Wednesday, a turtle dove being shot was seen by a woman who was walking with her children in Madliena.\nA day later, a shot turtle dove was picked up from land at Miżieb, managed by the hunters' federation. \nBirdLife Malta said it agreed with the Committee Against Bird Slaughter that turtle doves bred in captivity should have a closed ring. Since this bird is also a huntable species in autumn, the law does not punish anyone found in possession of live turtle doves.\n\"Those trapping hundreds, if not thousands, of this vulnerable species are using this legal loophole and the only way to control this abuse is by changing the law accordingly to have breeders place closed rings on the young.\"", "comment_count": 60, "id": 3948}, {"keywords": "", "author": "", "article_body": "Turning a blind eye to the humanitarian disaster developing in the Libyan capital will cost us dear, President George Vella has warned. \nIn a tweet, the former Foreign Minister and Malta's new president gave a clear indication that he will continue speaking on foreign affairs throughout his mandate. \n\"Why are the UN and the Western world turning a blind eye?\" Dr Vella asked in a tweet posted on Friday. \n\n\n\nHis comments come as general Khalifa Haftar, seen by his allies Egypt and the United Arab Emirates as a bulwark against Islamists, declared he wants to seize the capital, now controlled by a UN-recognized government and an array of militias.\nMore than 200 people have been killed since the violence erupted, and more than 900 wounded, the World Health Organization said on Thursday. More than 25,000 have been displaced, according to the International Organization for Migration.\nLibya is the source of almost all migrants from northern Africa attempting to make the crossing to Europe. The trouble erupted as EU states have clamped down on humanitarian vessels helping migrants in the Mediterranean and amid Italy's right-wing offensive against migration. \nMalta was asked to help to assist thousands of foreign workers as Muammar Gaddafi was overthrown in 2011.", "comment_count": 56, "id": 3949}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nAll newspapers feature a main picture of the Good Friday processions held across the island. \nTimes of Malta reports that around three-quarters of the wards at Mount Carmel Psychiatric Hospital have condemned ceilings. The second story quotes official data which shows that over a quarter of those booking holidays in Malta use Airbnb-styleservices, dealing directly with individuals instead of hotels.\nL-orizzont says that 3,200 people were now employed in the aviation sector. \nIn-Nazzjon says that a compilation of official statistics shows there were now an estimated 100,000 foreigners living in Malta - a fifth of the entire population. \nThe Malta Independent says that almost 30 inspections had been carried out at the roadworks site in Mġarr which claimed two lives last week in a horrific traffic accident. \n ", "comment_count": 0, "id": 3950}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Around three-quarters of the wards at Mount Carmel Psychiatric Hospital, in Attard, have condemned ceilings, Times of Malta has learnt. \nIn one ward, the foundations too gave way and cracks were so wide that rats were sneaking in, according to a technical report.\n\nIn their report, architects declared rooms in most wards as being unsafe and ordered their immediate closure so patients were being transferred to adjacent wards that also had structural problems in the ceiling, sources close to the mental health hospital said.\nThey said most of the building, constructed in 1861, had been condemned and all 425 patients were now crammed into the few remaining wards still considered safe.\nPhotographs taken inside the hospital show scaffolding being used to support parts of the ceiling at risk of collapse. In some areas, architects instructed workers to install metal support jacks to hold old beams in place.\nWhen contacted, Malta Union of Midwives and Nurses president Paul Pace confirmed that the situation at the hospital was “dire” and had “spiralled out of control”.\n“We have nurses who do not want to continue working in such a dangerous place. As a union, we are ready to instruct our members to walk out but we have a responsibility towards our patients. The authorities are shirking their responsibility towards patients and workers. Had Mount Carmel been a private hospital, the public health authorities would have withdrawn its licence and closed it down with no questions asked,” he said.\n“There is no patient dignity because they’re crammed like sardines, which is so humiliating. The bed proximity, which according to European standards should be 1.5 metres, is down to a few centimetres, with barely enough space for nurses to reach a patient for treatment,” Mr Pace added.\n“They’re worse than animals. It’s like a pigsty,” he commented.Architects have instructed workers to install metal support jacks in some areas of the hospital in Attard.\nHe recalled a male ward was closed down about two years ago and refurbishment works started, however, after spending €1.5 million on the water and electricity systems, workers realised the ceilings were not safe, so it remained closed.\n“In a climate where direct orders are the order of the day, including for an extension of St Vincent de Paul complex, we have been waiting for something to be done about Mount Carmel for too long now. \n“It seems things which are justified do not get the same treatment. We expected the government to award direct orders to end the imminent danger patients and nurses have to face on a daily basis,” Mr Pace said. \nHe said the union had been invited to sit on a taskforce on refurbishment but when it asked for timelines, the authorities said none could be given so the union refused to participate. \nQuestions sent to the Health Ministry on Maundy Thursday remained unanswered at the time of writing yesterday.", "comment_count": 100, "id": 3951}, {"keywords": "", "author": "", "article_body": "Several Good Friday processions were held in towns and villages across Malta and Gozo.\nMany people watched and took photos with others joining in the prayers as participants in Biblical costumes, brass bands and others carried statues representing the various stages of the passion of Christ made their way past the crowds.\nVideographer Mark Zammit Cordina filmed the procession in Mosta, which has been taking place for 150 years. This was the first year, however, that women in Biblical costumes took part in this locality’s solemn celebration.", "comment_count": 5, "id": 3952}, {"keywords": "", "author": "Jacob Borg", "article_body": "A BBC Panorama documentary last week revealed how controversial Chinese telecommunications giants Huawei installed potential backdoors into a mass surveillance ‘Safe City’ project in Pakistan, to the surprise of authorities where the technology was deployed.\nThe government has been flirting with a similar project in conjunction with Huawei which is expected to be trialled in trouble spots like Paceville.\nIn 2016, the Maltese government signed a Memorandum of Understanding for the Safe City project.\nAnother agreement was signed last year to trial Huawei’s 5G technology in Malta.\nConcerns have been mounting that Huawei could be used as a proxy by the Chinese government to spy on other countries using their technology through backdoors installed in its systems.\nAccording to the BBC documentary, tiny WiFi transmitting cards were found to have been plugged in to hundreds of CCTV cabinets housing the hardware across Lahore in Pakistan.\nSources told the BBC that the explanation behind the WiFi cards installed by Huawei was that it would be easier to troubleshoot problems without opening up the cabinets, though the documentary noted that such troubleshooting could already be carried out from the centrally controlled network.\nTo avoid “potential misuse”, the Pakistani authorities ordered the removal of the WiFi cards.\nAsked to comment about the findings in light of plans for a similar project, Safe City Malta director Joe Cuschieri, who also doubles up as the MFSA’s CEO, said he could not speculate about the performance of any vendor of hardware or software products deployed for projects in other countries.\nMr Cuschieri said that when it came to security, best practice demanded a zero trust model by design, irrespective of who the vendor or vendors involved were.\nThis was done to mitigate against vulnerabilities, whether known to the vendor or not, and this meant engineering design measures were taken by the customer to mitigate even against such improbable situations, he said.\nThe project is being overseen by Tourism Minister Konrad Mizzi, whose wife Sai Mizzi was credited with bringing Huawei to Malta.\nA US senior administration official told The Sunday Times of Malta last February that in view of intelligence gathered by US agencies over the last few years on Huawei, which they see as a “national security threat”, meetings have been held with top Maltese government officials to “share the information and express our concerns”.\nAsked if the Malta Security Services and US authorities had given any advice about the country’s ties with Huawei, Mr Cuschieri said he could not comment on any security related matters.\nThe EU has resisted pressure from the US to ban Huawei equipment being used for 5G networks across Europe.\nThe European Commission said last month that EU Member States were responsible for making their own security decisions, but has asked them to complete a 5G risk assessment by June.\nApart from the security concerns linked to Huawei, European Justice Commissioner Věra Jourová has flagged potential data protection concerns about the project.\nIn response to a letter sent by MEP candidate Michael Briguglio, Ms Jourová said a project that would gather so much data from public areas using sophisticated technologies could result in a high risk for people’s freedoms.\nThe Commissioner called for a data protection impact assessment to analyse the necessity and proportionality of such a project.\n ", "comment_count": 39, "id": 3953}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A new €4 million state-of-the-art kitchen inaugurated almost a year ago at St Vincent De Paul Residence has never been used to prepare meals for residents and staff, Times of Malta is informed.\nAnthony Agius Decelis had dubbed the kitchen “the biggest project Malta has seen”.\nInstead, food is being supplied by contractor James Caterers, cooked at the company’s facilities in Fgura and Bulebel and then transported every morning to the government elderly people’s home in Luqa. The meals are then stored inside the new kitchen and distributed during the day, catering industry sources said.\n“The new kitchen is only being used as a storage facility by the contractor and also for the washing of trolleys and other related equipment before they are sent back to the private caterer to be re-used in the following days,” senior officials at the Luqa complex told the newspaper, insisting on anonymity.\nThe new kitchen was “sheer waste of money” and justifiably raised suspicion that the project was really meant to serve another purpose other than cooking food, they added.\nWhen approached, Vincent de Paul Residence CEO Josianne Cutajar admitted that “some of the food preparation and processing is being done in offsite facilities”. However, she insisted some of the food “is also being processed at St Vincent De Paul”. Pressed to give details on the cooking which is being handled by the new kitchen, Dr Cutajar did not reply.\nAt the kitchen inauguration last June, the Parliamentary Secretary for Active Ageing, Anthony Agius Decelis said the new facility would greatly improve the quality of food given to residents. He had dubbed the new kitchen as “the biggest project Malta has seen” for the benefit of the elderly.\nCompanies bidding for a multi-million-euro tender for a 10-year catering contract at the elderly people’s home had to commit themselves to build an industrial kitchen if they were awarded the contract.\nNew kitchen sheer waste of money\nTimes of Malta had reported that, following the adjudication of the tender, originally valued at about €60 million over 10 years, the government had entered into new negotiations with the winning consortium – a joint venture made up of James Caterers and a subsidiary of the db Group – morphing the contract into the building of a 500-bed extension to the hospital, outside the original scope of the call.\nIn return for this extension, for which the state would not be charged arguing it formed part of the catering contract, the government had agreed to issue an unprecedented €274-million direct order to the two successful bidders, giving them on an exclusive basis the right to manage the new extension over a 10-year period.\nThe Nationalist and Democratic parties spoke of “foul play” and the contract is now being investigated by the National Audit Office, although work on the project continued in full swing.\n ", "comment_count": 89, "id": 3954}, {"keywords": "", "author": "Jacob Borg", "article_body": "Maltese professor Joseph Mifsud's \"various Russian contacts\" included a one-time employee of a Russian troll factory which ran social media campaigns designed to sow discord in the US, the Mueller report found. \nThe report, which looked into claims of Russian interference in the US election, established that one of Prof. Mifsud's Russian contacts in London had worked for the Internet Research Agency (IRA), the Russian agency identified as carrying out the Russian interference operations identified by the investigation.\nThe report describes the IRA as running a social media campaign designed to provoke and amplify political and social discord in the United States. Joseph Mifsud fostered 'various Russian contacts', the report said.\nIt was based in St Petersburg and and received funding from Russian oligarch Yevgeniy Prigozhin and companies he controlled, the report found. \nMr Prigozhin is widely reported to have ties to Russian President Vladimir Putin, investigators added. \nIRA's 'information warfare'\nThe IRA used social media accounts and interest groups to sow discord in the US political system through what it termed \"information warfare.\"\nThe campaign evolved from a generalised programme designed in 2014 and 2015 to undermine the US electoral system, to a targeted operation that by early 2016 favoured Donald Trump and disparaged Hillary Clinton.\nThe IRA's operation also included the purchase of political advertisements on social media in the names of US persons and entities, as well as the staging of political rallies inside the United States.\nTo organise those rallies, IRA employees posed as US grassroots entities and persons and made contact with Trump supporters and Trump Campaign officials in the United States.\nDozens of IRA employees were responsible for operating accounts and personas on different US social media platforms.\nStarting as early as 2014, the IRA's US operations included social media specialists focusing on Facebook, YouTube, and Twitter\nThe IRA later added specialists who operated on Tumblr and Instagram accounts.\nInitially, the IRA created social media accounts that pretended to be the personal accounts of US persons.\nBy early 2015, the IRA began to create larger social media groups or public social media pages that falsely claimed to be affiliated with US political and grassroots organisations.\nMore commonly, the IRA created accounts in the names of fictitious US organisations and grassroots groups and used these accounts to pose as anti-immigration groups, Tea Party activists, Black Lives Matter protestors, and other US social and political activists.\nThe Mueller report also found that Prof. Mifsud gave “inaccurate statements” about the extent of his contact with former campaign advisor George Papadopoulos, who was convicted in 2018 of lying to the FBI. \nWho is Joseph Mifsud?\nProf. Mifsud worked within the Maltese civil service for several years, served as private secretary to then-foreign minister Michael Frendo and also headed the University of Malta's international office. \nTwo weeks before the 2013 election, he reappeared in Malta as a consultant for INTO-University Partnerships and held a meeting with then-Opposition leader Joseph Muscat. During the meeting,  Prof. Mifsud said the company intended to set up shop in Malta with the intention of attracting some 3,000 foreign students to study here.\nA profile by the Press Association described Prof. Mifsud as a vocal backer of Vladimir Putin.\nWhile Prof. Mifsud appeared to have extensive ties to several important institutions in Russia, the Maltese native's academic credentials in Britain were far hazier, the profile said.\nHe held a professorial teaching position in the politics department at the University of Stirling in Scotland, according to officials there who said he took up the post in May.\nHowever, he was not named on the university's list of experts and the university press office refused to say how often he was on campus. A reporter with the university's student newspaper had said he did not maintain an office there.", "comment_count": 12, "id": 3955}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A number of public and private entities have already approached the Malta Development Bank to enquire about investment initiatives, with the bank stressing that its preferred model would be one that includes commercial banks.\nThe entities proposed a variety of infrastructural projects, in the green economy, housing, education, health, sustainable industrial investment and SMEs.\n“Most consultations are still at an exploratory stage. The MDB’s preference is that such investments would be financed in conjunction with the commercial banks … to foster the promotion of a syndicated loan market in Malta, which has so far played a somewhat subdued role,” the bank said in its annual report for 2018.\nThe bank was set up with €30 million in capital from the government with a further €10 million pledged for this year.\nThe MDB, chaired by Josef Bonnici, explained that most of that year was spent in preparing the groundwork, from capacity-building and research, to consultations with stakeholders.\nAs a result, the MDB is now able to formulate its approach, having identified those areas which slip through the net, particularly when it comes to bank finance.\nThe annual report explains that one way the MDB will help is by setting up guarantee schemes for SME loans – particularly suited for riskier ventures – which will be launched this year, in collaboration with the main banks.\nMDB to provide guarantee of each project\nThe intention is for the MDB to provide a guarantee of 80 per cent of each project, capped at 25 per cent of the portfolio of loans extended by the commercial banks. These should generate portfolios of around €100 million in new loans for SME investments over a period of three years.\nThe MDB will also tap into EU structural funds, using them to be able to develop funding which would be part grant and part guarantees to back up financing.\nOne specific area mentioned in the report was the setting up of a fund which could be used to help students cover the cost of their tertiary education, “offering enhanced access to banking finance, enjoying longer moratorium periods, better collateral relief and more affordable repayment terms”.\nIn line with its determination to complement – rather than compete with – commercial banks, the MDB said it would also be looking at another hybrid scheme for SMEs, which would combine co-financing with participating banks, along with its own partial guarantee. The intention is to “support viable operations where the financial market is unable or unwilling to provide the needed funding on its own”, the report explained.\nThe MDB is not only looking at SMEs but also at major infrastructural projects – mainly due to the long repayment period required to make them feasible – where there could be significant market failures and investment gaps.\nThe focus will be on projects with a strong social dimension – especially those related to education, health, elderly care, and affordable housing – as well as those that contribute to the green economy, including renewable energy and energy efficiency, sustainable transport and water resources, as well as other environment-friendly initiatives.\nThe MDB’s annual report for 2018 is available on its website www.mdb.org.mt.", "comment_count": 0, "id": 3956}, {"keywords": "", "author": "", "article_body": "Updated at 12.45pm\nA young woman from Attard was seriously injured after she crashed her car into a parked one. Her condition later improved, however.\nThe 21-year-old was driving down Triq R. Caruana Dingli, San Ġwann, when she lost control of her car.\nPolice said the accident occurred at 1am.\nInvestigations are under way.", "comment_count": 0, "id": 3957}, {"keywords": "", "author": "", "article_body": "Thousands of people once again set off the early hours of Good Friday morning to raise money for Puttinu by walking 22 kilometres from the Mellieħa Parish square.\nParticipants were asked to donate a minimum of €10 in aid of Puttinu Cares for this 16th edition.\nThe walk was slightly shorter this year. Rather than finishing at Senglea because of the danger of walking through the Marsa roadworks, the walk ended at the Floriana Granaries, and took approximately four hours.\nLast year donations raised from this walk reached €91,000, drawing 10,000 participants.\nDid you take part in the walk? Send us your photos on mynews@timesofmalta.com", "comment_count": 8, "id": 3958}, {"keywords": "", "author": "", "article_body": "A court has dismissed a claim by Victoria local council, Gozo, that it was not liable for an electricity bill for fairy lights installed on trees in its main square. \nThe council had sued Arms Ltd to insist it was not responsible for the electricity meter the lights were connected to. To back its argument, the council secretary said the lights used to come on with the street lighting.\nArms Ltd countered that the meter had been installed at the council’s request and a bill was actually paid several years ago.\nThe court heard how Arms Ltd had billed the council for €13,663 for electricity consumption and meter rental.\nThe council sued the company and argued it had no connection with the meter at issue or the fairy lights which it supplied.\nBut in its reply, Arms Ltd said the meter connection had been requested by the council secretary herself.\nIn its considerations, the court observed that the first words uttered by the council secretary in her testimony were that the lights \"were installed by the council…\"\nDocuments presented by the council secretary also showed a call for tender issued by the council for the installation of fairy lights in Independence Square, Victoria, Gozo, July 2005.\nThe documents also showed how provision of electrical source of supply by Enemalta is to be procured by the local council.\nOther correspondence showed council instructions to an engineer to connect the fairy lights to the power supply.\nThe council had for years ignored the bills. It did not contest them and did not even seek disconnection of the meter when the lights no longer worked. The court said it was not convinced the power supply was used only for the fairy lights.\nThe court noted inconsistencies in the testimony by the council secretary, who had first claimed that the council never received any bills and never paid anything, only to then result that a payment was made in 2010.\nMention of the matter could also be found in the council minutes, where it was stated that the council was refusing to pay the bills because the lights no longer worked.\nThe court said it deplored the way the council had treated this case, having, through the secretary, started finding information about its own affairs after the points raised by Arms Ltd.\nMagistrate Joanne Vella Cuschieri rapped the council secretary for not even knowing what was in the council’s own files, causing the case to be repeatedly put off while information was dug up.\nThe court, therefore, dismissed the arguments raised by the council.", "comment_count": 0, "id": 3959}, {"keywords": "", "author": "", "article_body": "A 63-year-old was grievously injured on Thursday when he was hit by a car in Gżira.\nThe police said the accident happened in Triq il-Gżira at 5.30pm.\nThe victim was hit by a Vauxhall Astra that was bieng driven by a 40-year-old from Birkirkara. He wa taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3960}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The three migrants charged with the seizure of a merchant vessel have been refused bail.\nA joint request to this effect was turned down by Mr Justice Giovanni Grixti on a procedural point.\nThe accused, aged 15, 16 and 19, and charged with seizing control of the ship El Hiblu 1 through the use or threat of force and intimidation, remain in police custody.\nWatch: Five arrested as AFM storms hijacked ship and escorts it to Malta\nEarlier in the week, a court of magistrates ruled there was sufficient evidence for the youths to be indicted.\nIn court, the Attorney General observed that there was a missing signature on the joint bail application. It was argued that all three of the accused’s lawyers had to sign the bail application and it was not clear who was appearing for whom.\nDefence lawyers will now have to reapply for bail, filing separate applications after the Easter holidays.\n ", "comment_count": 0, "id": 3961}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Council of Europe’s Group of States against Corruption - Greco based its reports “on facts, not on impressions or perceptions”, its president, Marin Mrčela, said on Wednesday.\nThough not referring to any report in particular, Mr Mrčela insisted that “no country is immune to corruption”, adding Greco did not “look at perceptions. We look at the measures countries have taken or did not take to implement the international anti-corruption standards they have adopted.\n“Our work is objective, even-handed, impartial and expert-based and this is our strength. Our reports are based on facts, not on impressions or perceptions, and our recommendations have to be fully implemented by all our member states,” he said.\nMr Mrčela was speaking during an international conference organised by the Council of Europe and the European Studies Institute of MGIMO University in Russia.\nHe noted that the body’s reports were not aimed at being a “name-and-shame activity”.\nOur work is objective, even-handed, impartial and expert-based\n“We don’t criticise for the sake of it. We are like a group of friends advising another friend on how best to achieve a goal, how best to approach a challenge, to improve for one’s own good. That advice is based on knowledge and understanding not on political considerations,” Mr Mrčela pointed out.\nMr Mrčela’s comments come just days after Prime Minister Joseph Muscat pointed a finger at the Opposition for the criticism levelled against Malta in the latest Greco report published earlier this month. Greco warned that Malta’s criminal justice system was at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates took place.\nSpeaking in Parliament on Monday, Dr Muscat insisted that the Greco criticism was partly a direct result of the “irresponsible way” in which the Opposition had portrayed Malta in international fora over the past years.\nHe said he would be looking at the report objectively, adding it would be accepted constructively and the government would not attack or undermine those who compiled such reports.", "comment_count": 81, "id": 3962}, {"keywords": "", "author": "", "article_body": "No evidence has been found to support allegations of an administrative and operational nature at the Malta College of Arts, Science and Technology, the Education Ministry said.\nThe inquiry had started after a senior member of the Mcast staff made serious allegations of irregularities.\nIn a statement, the ministry said that after the allegations were made, it set up an inquiry board to investigate them in July. The allegations had also been referred to the police.\nThe ministry said that in spite of the conclusions, the minister still recommended that the report was immediately handed over to the police.\nIt also passed on the report to the Mcast board of governors. The inquiry, the ministry said, highlighted a number of administrative and operational shortcomings at Mcast over the years and under different administrations.\nThe ministry requested Mcast to analyse these parts of the report and take the necessary action.\nIt concluded that since the report was passed on to the police for investigations, it had been legally advised not to publish it.\nMcast was to continue to cooperate with the authorities concerned.\nTimes of Malta had reported that the allegations of a criminal nature included claims of possible sexual abuse by members of the college staff in a programme for psychologically-challenged students. The programme, called Pathway, was the main focus of the allegations.", "comment_count": 26, "id": 3963}, {"keywords": "", "author": "Keith Micallef", "article_body": "A photo of a parked car surrounded by freshly-laid tarmac has done the rounds on social media amid questions on certain work practices being adopted during road resurfacing jobs.\nThe parked car surrounded by freshly-laid tarmac in St Paul’s Bay, which fuelled controversy on Facebook and raised questions on the manner in which the works were being done.\nInfrastructure Malta, which was responsible for the job, insisted this was an exception as towing away the vehicle would have damaged it.\nThe bizarre incident happened on Monday in Isouard Street, St Paul’s Bay, during emergency work to repair 17 residential roads in the locality.\nThe images uploaded on Facebook stoked a debate and prompted questions on the reason why the vehicle had not been towed away before the work, which had been announced days in advance, started. Others poked fun at Infrastructure Malta saying it made no sense at all to forge ahead with work without ensuring the road was completely clear.\nContacted by Times of Malta, an Infrastructure Malta spokesman said this was a “unique case”. He noted that the car could not been towed away without being damaged. Though no further details were given on the matter, there were suggestions on Facebook this was due to the fact that the car had automatic transmission.\nThe spokesman said the decision to carry on with the work was made to avoid delays. “Works were reorganised to remove the existing asphalt and lay a new surface in the rest of the carriageway,” he said, pledging that the patch where the car was parked would be repaired by Thursday.\nThe patch where the car was parked would be repaired by today\nThe timing of the work a few weeks before European and council elections, coupled with the tight completion deadline set for the end of next week, raised eyebrows. Moreover, affected residents told the newspaper that, in some areas, a thin layer of tarmac, no thicker than five centimetres, was being laid and certain roads, like Triq iċ-Ċagħaq, were being resurfaced despite still being in good condition.\nAsked how long the 17 roads were expected to last, Infrastructure Malta’s spokesman failed to reply but pointed out that this was a temporary measure until they would be reconstructed from scratch under the government’s €700-million programme to rebuild all roads.\nThe spokesman blamed the St Paul’s Bay council for leaving the locality’s road in a bad state of repair and insisted that ongoing works were up to standard. The work would involve scraping off the existing tarmac layers, reinforcing deep crevices with sub-base asphalt and resurfacing the road, he said. The spokesman denied claims that asphalt was being laid over the existing surface.", "comment_count": 76, "id": 3964}, {"keywords": "", "author": "", "article_body": "School children are seeking a more diverse curriculum when it comes to their physical education classes at school as well as better facilities that can be used throughout the year and not hampered by seasonal conditions.\nThis was one of the main outcomes of a recent dissemination meeting hosted in Malta as part of the Diypes Project, a two-year Erasmus+Sport project started in 2017, with the aim to find a participative approach to increase participation and engagement of high school students in physical education and sport classes.\nThe project was jointly implemented in five partner countries - Albania, Italy, Malta, Romania and Slovakia and achieved some fruitful results based on partner national PE curriculum research and analysis, intervention activities and feedbacks on both good practices and challenges.\nFoundation for the Promotion of Social Inclusion in Malta (Fopsim) is the project partner in the country.\n“One of the most pressing challenges hindering better outcomes of the PE curriculum included the cultural and family mindset viewing PE as a ‘not so important and useful subject'.\n\"Most parents tend to put pressure on students to achieve more in the rest of the subjects diminishing the role of PE to a basic extra-curricular discipline,” said Uyen Vu, project officer of Diypes.\n“Overall, we were very pleased to see a major involvement and enthusiasm from students participating in PE lessons who then contributed their opinions for the benefit of this project.\n\"Some of the findings concluded that the initial weeks of the school year are important for the PE teacher to build good relations with the students, that overweight students should be invited to participate in more activities during PE lessons, that marking the students’ performance should not only be limited to assessments but also through the progress they make in their PE lesson.\n\"Also, very interesting was the suggestion for more diverse sport activities during lunch breaks, more sports tournaments and more involvement from the parents in physical activities at school,” added Uyen Vu.\nThe Diypes project was particularly successful because it brought students, PE teachers and stakeholders together to discuss how best to tackle the current limitations in PE delivery and how to present sports activities in the most favourable way.\nMalta was represented by three schools namely St Theresa College Secondary School in Mrieħel, St Edward's College in Birgu and St Thomas More, Middle and Secondary School in Żejtun.\nThe final meeting was also attended by policy makers, health sector practitioners, sports education persons, national athletes and local media.", "comment_count": 4, "id": 3965}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, arrested during a drugs raid on a Qormi garage on Tuesday, was remanded in custody at the Corradino Correctional Facility rather than the forensic unit at Mount Carmel Hospital which was not a Prison Ward in terms of law.\nRenald Baldacchino, 39, from Qormi, was charged with cocaine and heroin trafficking, aggravated possession of the drugs as well as with having allegedly committed such crime during the operative period of a suspended sentence.\nHe was further charged with breaching three earlier bail decrees and with being a relapser.\nOne year ago, in March 2018, the same man had been arrested following a similar raid on his garage in Qormi which had been converted into a drugs den.\nA year down the line, the man landed back in court where the prosecution explained how last Tuesday the police had raided a garage used by the accused, finding suspected heroin and crack cocaine, together with weighing scales.\nThe garage was set up “like a shop for drugs” Inspector Frank Anthony Tabone said, adding that the police also had footage of the accused exchanging drugs for money.\nDefence counsel Noel Bianco registered a not guilty plea on behalf of the accused and informed the court that no request for bail was to be made at that stage.\nHowever, the court was requested to recommend that the accused be detained at the Forensic Unit at Mount Carmel Hospital.\nThis request, however, was flatly turned down by the court, presided over by magistrate Joseph Mifsud, who, citing legislation regarding the designation of places as prisons, pointed out that the law spoke of “Ward 10 at Mount Carmel Hospital,” a ward which had been shut down since 1998.\nThe law made no mention of the “Forensic Unit”, the magistrate observed, adding that this meant that for the past twenty years recommendations by the courts for arrested persons to be sent to that unit had been erroneous in this regard. The law had not been amended to list the Forensic Unit as a prison, the court pointed out.\nFor this reason, the court turned down the request and ordered that the matter be brought to the attention of the Director General of the Law Courts, the Attorney General, the Minister for the Interior and the Justice Minister for the necessary changes to be effected accordingly.\nInspectors Frank Anthony Tabone, Alfredo Mangion and Roderick Agius prosecuted.", "comment_count": 0, "id": 3966}, {"keywords": "", "author": "", "article_body": "Russia has withdrawn a request to dock a warship in Malta, amid suspicions it was trying to purchase riot gear and gas canisters on the island, a report has claimed. \nThe 7,570-tonne Severomorsk, with a crew of more than 400 is believed to be heading towards troubled Venezuela, the report in Buzzfeed on Thursday said.\nThe Maltese authorities have not yet reacted to the report but sources told Times of Malta the report was correct and the government had planned to bar the vessel from docking in the island if it forged ahead with the request.\nMalta initially asked Russia for additional information about the ship’s operations and itinerary, but has since been told by US officials that the vessel was en route to Venezuela, Buzzfeed said.Malta initially asked Russia for additional information about the ship’s operations\n\"This new incident has raised concerns among senior US and European government officials that Moscow is looking to boost its military presence in Venezuela, and, at the same time, flex its muscles in the Mediterranean.\"\nA source told Times of Malta the Russians were planning to obtain the riot gear and gas canisters from a local supplier.\nThe claim comes just days after Times of Malta reported on April 16 that Malta had turned down a Russian request to use its airspace to fly military aircraft to Venezuela.\nAccording to unnamed sources quoted in the international media reports on the matter, the Russian embassy in Malta did not take kindly to the rejections, raising concerns of possible retaliation.\nRussia has emerged as embattled Venezuelan President Nicolás Maduro’s main backer since opposition leader Juan Guaidó proclaimed himself interim president in late January with the support of the United States and about 50 other states, including Malta and the rest of the EU.", "comment_count": 118, "id": 3967}, {"keywords": "", "author": "", "article_body": "The first ever EU regulation on CO2 emissions for trucks and lorries was approved by the European Parliament on Thursday, in an effort to curb rising road transport emissions.\nThe new legislation, informally agreed between MEPs and the Romanian Presidency of the Council in February, was adopted with 474 votes in favour, 47 against and 11 abstentions.\nIt requires CO2 emissions from heavy-duty vehicles such as trucks and large vans to be reduced by 30%, by 2030, with an intermediate reduction target of 15%, by 2025.\nAlso by 2025, manufacturers will be required to ensure that at least a 2% market share of the sales of new vehicles is made up of zero-and-low-emission vehicles, to counteract steadily increasing road traffic emissions, of which around one quarter is accountable to heavy-duty vehicles.\nIn addition to this, the European Commission will have to propose new post-2030 targets, in 2022, in line with the Paris Agreement. \nEU leaders will need to formally approve the text before it can enter into force. \nEU proposal to reduce CO2 emissions from cars signed into law\nMeanwhile, 18 months of work have culminated with the signing of a regulation that sets a 2030 target for the reduction of CO2 emissions from passenger cars by over 37%.\nThis law was negotiated by MEP Miriam Dalli and will initially come into force in January 2020.\n\n“The signing was the last step resulting in a law that reduces road transport emissions in all EU Member States, including Malta. I have no words to describe the satisfaction felt today when I know that, I departed from a situation facing a lot of resistance and today this law enjoys the strong backing of both the European Parliament and member states,” Dr Dalli said in reaction to the signing.\n“I now look forward to its implementation by the Member States. Reaching this stage was not easy but I consulted everyone - from industry players and stakeholders to trade union and consumer organisation – for a law whose objectives can be met if everyone does their part.”\nMiriam Dalli presided over the signing of the agreement that took place in Strasbourg between European Parliament President Antonio Tajani and Minister George Ciamba, President in office of the Council of the EU. This law forms part of the Clean Mobility Package and contributes to the targets agreed by leaders in the Paris Agreement against climate change.\nIt is a regulation that applies automatically and uniformly to all EU countries without needing to be transposed into national law. The aim is for the car manufacturing industry to invest in technology producing cleaner cars whilst encouraging the member states to implement policies that support this transition. ", "comment_count": 13, "id": 3968}, {"keywords": "", "author": "", "article_body": "The Transport Ministry is aiming to expand the aviation register by a further 85 aircraft by the end of the year, Transport Minister Ian Borg said on Thursday.\nMalta currently has 315 registered aircraft, with authorities seeking to have 400 aircraft registered by the end of 2019, he said. There are currently 35 companies which have their Air Operator Certificates issued by Malta, Dr Borg added, saying he hoped to increase the number to 40 by the end of the year.\nThe transport minister was speaking at the Transport Malta offices in Lija, where he presented charter airline SmartLynx with its Air Operator Certificate. \nMalta has signed aviation agreements with Japan, South Korea, Ghana and the Ivory Coast, he said, adding work was also underway towards agreements with South America. \nThe aviation sector provides over 3,200 jobs, and the government is committed to creating more, Dr Borg added.\n\"This success did not happen on its own,\" he said, thanking the Civil Aviation Directorate for their work. \n\"Today we are here witnessing the hard work being carried out to continue strengthening our connectivity.\"  \n\"We are here because we want to continue seeing growth in the aviation sector, which is another pillar of the economy that contributes to 2.5% of our country’s Gross Domestic Product,\" he added. ", "comment_count": 4, "id": 3969}, {"keywords": "", "author": "Ivan Martin", "article_body": "The police are investigating the possible return of an underground dog fighting ring.\nThe spectre of illegal dog fighting was raised in Parliament on Tuesday by Opposition MP Mario Galea who said he had been shocked to learn the heinous form of animal cruelty had made an unwelcome comeback in recent months.\nREAD: Boxer put down after dog fight\nShortly after making his statement, he passed on information to Animal Rights Parliamentary Secretary Clint Camilleri who told Times of Malta he had, in turn, handed it over to the police for further investigation.\nAnimal welfare legislation specifically lays down that “animal fights shall not be organised and nor shall animals be entered for animal fights”.\nSources close to the police said yesterday the area believed to serve as illegal dog fighting arena was likely to be the same or close to the one that had been raided a few years ago.The illegal fights are believed to happen in the early hours of Sunday morning\nThe illegal fights are believed to happen in the early hours of Sunday morning, around sunrise, and the sources said the name of the game was catching the culprits in the act. This, however, would not be so straightforward because those involved were diligent and employed methods that made it difficult to catch them by surprise.\nThe sources recalled that, a few years ago, the police had been tipped off about the criminal activity but were initially unsuccessful in catching the group red-handed. They had then conducted raids on a number residences of suspects and discovered video recordings of the dog fights.\nIllegal dog fights could generate quite a substantial amount of cash in betting and had the potential of attracting dozens of people, the sources noted.\nActing on a tip-off, the police had raided a dog fight shortly after it had started in 2002. About 200 people in around 70 cars were watching the fight and when they spotted the police, they made a quick getaway together with the dog owners who left behind some pails of water and dog collars. Water is usually used to separate the dogs during a fight.\nThe fact that no arrests were made on the spot had annoyed animal organisations.\nSources close to the Veterinary Department said the owners of dogs used for fighting would likely breed the animals themselves or else import them illegally from Sicily.\n“The dogs used will have their tails and ears clipped and they would not be chipped. Any injuries they sustain will be treated by some unscrupulous vets who would not report anything to the authorities, unless, of course, the animals are treated by the owners themselves,” they said.", "comment_count": 35, "id": 3970}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Leafing through hundreds of thousands of notarial documents is daunting for researchers and could wear out the age-old documents, so a ‘wikipedia’ of the archives is in the making.\nEventually, this online encyclopaedia could be linked to digital versions of the documents and researchers could access the deeds from home, instead of going to the archives in St Christopher Street, Valletta.\nCharlene Ellul\nCharlene Ellul, a former volunteer who developed a prototype of the ‘notarypedia’, said that, so far, research mainly focused on conservation and archiving issues rather than the content of the deeds.\nThe project is the result of a notarial archives’ sponsorship funding Ms Ellul’s MSC in artificial intelligence under the supervision of Charlie Abela and Joel Azzopardi.\nThe sponsorship could also fund further research through which Ms Ellul will make the ‘notarypedia’ more user-friendly and increase the links between one key word and another. On the present ‘notarypedia’ prototype, which is not yet online, a search for a particular notary could lead to information about a pearl necklace, for example.\nHopes other researchers would be open to crowdsourcing information\nShe hopes other researchers would be open to crowdsourcing information that would allow, among others, linking a plant mentioned in a deed for medicinal purposes to the actual site where it grows in Malta.\nJust like in Wikipedia, photos can be included and text amended by researchers.\nDuring her volunteering with the archives, Ms Ellul realised it was taking researchers a long time to look up information related to particular issues of interest such as fashion. “They would have to read through every single page and, apart from it being time-consuming, this method also increases handling of centuries-old documents,” she pointed out.\nShe said she had only come across similar research for Dutch text, so the ‘notarypedia’ could come in useful for European researchers, considering that Medieval Latin was widely used across the continent, including in Church records, among others.\nThis project could, therefore, put the notarial archives in Valletta on the map by disseminating its content online and, so, internationally, she added.\nDr Abela noted that, so far, the prototype was based on three already digitised volumes and the project had shown the potential of an approach that could be applied to any digitised document.\nMs Ellul has focused on text already transcribed by Stanley Fiorini. This consists of three of the oldest registers dating back to 1487, which include text in Medieval Latin, Maltese and Sicilian.\nInterested researchers willing to take part in crowdsourc-ing can send a message on charlie.abela@um.edu.mt or charlene.ellul@um.edu.mt", "comment_count": 2, "id": 3971}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Fino showroom in Mrieħel could be set for redevelopment into a massive office and commercial development rising to 18 floors, as the industrial area continues its transformation into a high-rise business hub.\nFino and Sons Ltd, one of the first companies to set up shop in the Mrieħel industrial area in the 1970s, has submitted plans to demolish its existing manufacturing and retail complex and build seven blocks of between nine and 15 floors each, all set on three “podium floors”.\nThe existing complex occupies a footprint of just under 20,000 square metres, about the size of three football pitches.\nDevelopers point to a green travel plan\nIn a project description statement submitted to start the process of the extensive environmental studies that will be required, the developers say the project will create high-end offices to attract international companies active in financial services, commerce, IT real estate and others.\nAccording to the planning document, the number of office workers would be in the region of 8,000 and the commercial facilities are expected to generate about 450 jobs.\n“Through the proposed development, Fino seek to diversify their business portfolio through their participation in the property development and retail sectors by taking advantage of the opportunities provided by the designation of the Mrieħel industrial area as an enterprise hub’,” the developers state.\nWork is expected to take about five years and is estimated to generate a massive 330,000 cubic metres of construction waste.\nThe planning document acknowledges that the scale of the proposed buildings will have a high impact on the character and visual amenity of the area, though it says the designation of Mrieħel as an appropriate location for high-rise buildings should be taken into consideration.\nIt also notes that the “substantial number of expatriate employees” the project is expected to host “is bound to contribute to an increase in pressure for both new development and the redevelopment of existing properties in the Birkirkara and, possibly, Balzan residential areas”.\nThe developers acknowledge that the project will contribute to a significant increase in traffic in the area, which could put pressure on the road network, and point to a green travel plan to mitigate this impact.\nThe project’s parking area will need to provide for nearly 2,500 cars, according to the document.\nThe proposed development follows the approval in 2016 of the Quad Towers project, also in Mrieħel, comprising four interlinked towers of between 14 and 19 storeys each.\nThe old Farsons Brewery site nearby is also set for redevelopment into an extensive low-rise business park.", "comment_count": 35, "id": 3972}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta reports a sharp drop in Malta's ranking in the international Press freedom index. It also reports about fears that a dogfighting ring may be back.\nThe Malta Independent reports that according to Church doctrine, cremated ashes must be laid to rest in a sacred place. It also quotes Italian Interior minister Matteo Salvini saying terrorists have infiltrated migrant boats from Libya.\nl-orizzont under a picture of Roads Minister Ian Borg, says improved roads will allow more money and time for the people. In another story it highlights the plight of parents who see their children die, an article linked to Holy Week.\nIn-Nazzjon leads with remarks in parliament by Adrian Delia that until the tunnel to Gozo is completed, shortcomings in the ferry service must be addressed. It also reports a PN statement that the government has failed in its pledge to reduce energy bills. ", "comment_count": 0, "id": 3973}, {"keywords": "", "author": "Denise Grech ", "article_body": "Press freedom in Malta continued deteriorating, with the country falling 12 places in an index being published by Reporters Without Borders on Thursday.\nMalta had already dropped 18 places in the 2018 World Press Freedom Index last year. This year, it fell from 65th to 77th place, posting the third sharpest drop in the European Union and Balkans region, following Serbia and Macedonia, which fell 14 places.\nMalta is now the third lowest ranking EU Member state for media freedom, followed by Hungary and Bulgaria.\nThe report measures the level of media freedom by looking at the level of pluralism, media independence, the environment and self-censorship, among other things.\nReporters Without Borders noted that journalists in Malta were trying to continue the work of anti-corruption writer Daphne Caruana Galizia. “They are shedding light on the island state’s rampant corruption and money-laundering despite an oppressive and worrying climate still marked by [Ms Caruana Galizia]’s murder in October 2017,” the organisation said.A widespread technique of threatening to exhaust journalists’ financial resources and threatening legal action\nIt criticised what it described as a widespread technique of threatening to exhaust journalists’ financial resources and threatening legal action. \nReporters Without Borders warned criticism of the media across the world was becoming a political weapon that weakened journalism when it became systematic. “To this end, political leaders have had no scruples about using state-owned media that have been turned into propaganda outlets or, at least, enlisted in their cause,” it commented.\nRead: Press freedom organisations reiterate 'serious concerns' about Malta's freedom of expression\nBoth the Labour and the Nationalist parties have fired missives at the media recently. Times of Malta has commented editorially that the Labour government is “evidently hell-bent” to bleed The Sunday Times of Malta and the Times of Malta to death, including by shrinking advertising spend. It also said the Nationalist Party could not be allowed to attack the free press, a prime ingredient in a democracy.\nRead: Editorial - The PN vs the free press\nFollowing a two-day mission in Malta late last year, Reporters Without Borders warned the country was failing to live up to its obligations to guarantee and safeguard freedom of expression.\nIt remarked that the apparent lack of progress on the investigation into Ms Caruana Galizia’s murder was having a chilling effect on public interest investigative reporting.\nHatred of journalists degenerating into violence\nThe number of countries where journalists can work safely is plummeting, Reporters Without Borders says.\nThe report said that hatred of journalists whipped up by populist and authoritarian leaders has degenerated into violence across the world, it warns.\nA total of 348 journalists were detained for providing news and information in 2018.\n\"If the political debate slides towards a civil war-style atmosphere, where journalists are treated as scapegoats, then democracy is in great danger,\" said Christophe Deloire, director general of RSF.\nThe period since Donald Trump's election in 2016 has been one of the \"American journalism community's darkest moments\", the report said, linking Trump's \"notorious anti-press rhetoric\" with \"terrifying harassment\" aimed particularly at women and journalists of colour.\nGovernment statement\nIn a statement, the government said it was committed to ensure that journalists in Malta could work without hindrance and in freedom, in accordance with the core values of a democratic society.\nThe Media and Defamation Act came into force in Malta, a new law regulating the freedom of the press and which among its various reforms in the sector abolished criminal libel, introduced the concept of the ‘citizen journalist’, introduced the concept of mediation, introduced various provisions which strengthened freedom of the media and prohibited the multiplicity of libel lawsuits in Malta on the same journalistic report.At the same time, the new law added no new burdens on journalists and owners of media houses in terms of civil libel damages.The government said that, in 2018, only 19 civil libel cases were filed, a third of the amount presented in 2017 (57) and a quarter of the amount presented in 2008 (77). This was indicative of the growing levels of freedom of journalistic expression.\nConcurrently, the right for any person to safeguard his or her reputation within the parameters of the judgments of the European Court of Human Rights had been kept, the government said.The report also criticises the fact that political parties in Malta own their own media outlets. The Government stresses that this situation has been unchanged since 1994. Media houses, which are privately owned, also have all the journalistic freedom to scrutinise and criticise all that they deem appropriate. The National Broadcaster also plays an important role and studies show that the news services of the national station are reliable and respected.The Government is committed to see that justice is done in the case of the barbaric homicide of Daphne Caruana Galizia. In fact, in less than 50 days from the homicide, three Maltese nationals were charged with her murder and they are facing ongoing proceedings in Court. At the same time investigators, assisted by foreign investigative authorities such as the FBI, Europol, Interpol and the Netherlands Forensic Institute amongst others, have left no stone unturned in their quest to bring to Court any other persons involved in this murder. At the same time, an independent and autonomous magisterial inquiry presided by Magistrate Neville Camilleri is ongoing.The Government contends that it has no objection for the launching of an independent public inquiry into whether the homicide of Ms Caruana Galizia could have been prevented, as is being requested, once that the current criminal inquiry and investigations are concluded. This stance is being taken on expert advice, both local and international, so that the pending criminal investigation is not adversely affected by another parallel public inquiry.The Government also refers to the issue of the possibility of having a multiplicity of libel lawsuits filed in foreign jurisdictions on media reports originating from Malta. It reiterates that it is in favour of any measure taken at European level which helps to safeguard freedom of expression in this sense.This is a reformist government with a will and commitment to continue with the ongoing reform process in the justice sector started in 2013. This process has already led to the implementation of several laws and reforms: a law deleting time-barring by prescription on claims of corruption by holders of political offices, a party financing legislation, a whistle-blower protection act, a law limiting the power of the Attorney General in drug-related cases, a new Parliamentary mechanism on appointment of chairpersons of main regulatory authorities and non-career Ambassadors, and a law establishing the Bureau for Recovery Assets. The Government has already stated that this reform will continue and has already made it public that the Government will be implementing several proposals as discussed after the Venice Commission published its opinion on this sector.This Government is committed to further strengthen freedom of speech, democracy and the rule of law.", "comment_count": 271, "id": 3974}, {"keywords": "", "author": "", "article_body": "No one was injured when a wooden gazebo within the former Funky Monkey complex on Manoel Island caught fire on Wednesday evening, the police said.\nThe fire was brought under control after the Civil Protection Department rushed to the site in Gżira at around 7.45pm.\nArson has not been ruled out.\nMeanwhile, Facebook users reportedly claimed that a group of hooded teenagers were seen running away from the music venue and soon after a plume of smoke was spotted over the establishment.\nA rubbish fire was also reported in Luqa at around the same time.", "comment_count": 15, "id": 3975}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Parliament on Wednesday granted its unanimous support to the construction of a permanent link between Malta and Gozo in what Infrastructure Minister Ian Borg described as a “historic moment” from which there was no turning back.\nThe House also approved various amendments moved by the Opposition.\nIntroducing the motion, Gozo Minister Justyne Caruana dismissed fears that Gozo’s unique character would be lost as a result of the link, stating that it was up to the Gozo Regional Development Authority to ensure that the resultant development would not have any deleterious effects.\nRead: Malta-Gozo tunnel plans should be ready within six months\nTourism and economic growth were already having effects on Gozo, and the Ministry for Gozo was working on various initiatives to combat these effects, including a de-carbonisation strategy.\nOpposition MP Chris Said, who had been a key proponent of the project, said Gozitans were extremely dependent on connectivity with the Maltese mainland, and that successive governments had done their best to develop such connectivity.\nThe permanent link had recently gained momentum, he added, having been included in the electoral manifestos of both the Labour and Nationalist parties in 2017 and following initial studies in 2011. This would be the third legislature to consider the project seriously, and the size of the project meant it merited a serious discussion.\nDr Said emphasised the burdens borne by those who were forced to commute from Gozo on a daily basis. At a minimum, he said, these Gozitans faced an additional 15 hours of travel when compared to their Maltese counterparts. The permanent link would prevent Gozo from becoming a society of pensioners, as Gozitans would be able to remain resident in Gozo while working in Malta with greater ease, and a 2018 study Dr Vincent Marmarà had found that 83% of those in Malta and Gozo - especially among the younger generations - were in favour of the project.\nRead: Tunnels, trains, and tarmac: Muscat details plans for infrastructure of the future\nDr Said enumerated various amendments which the Opposition was putting forward to ensure that the project was executed “with attention to the common good.” Among other changes to the motion, the amendments would bind the government to carry out all necessary studies with alacrity and to publish all studies which had been carried out.\n\nPrime Minister Joseph Muscat compared the project to the roads leading to Valletta and to Rabat, arguing that infrastructural projects of this nature did not necessarily lead to loss of character in places to which they led. It was up to the competent authorities, he added, to ensure that they did not.\nHe added that the motion before the House would not give the government a blank cheque, but would simply express Parliament’s will for the project to be carried out in the most general terms.\nTurning to the issue of whether to proceed with an above-ground undersea tunnel or with an underground tunnel, he stated that the exact method by which the project would be executed remained to be seen.\nHowever, attempts to minimise the production of construction waste by choosing the former of the two options would lead to massive and irreparable damage to the undersea biosphere.\nShould any excavated material be used for land reclamation, he added, it would not necessarily lead to an industrial or commercial use for the reclaimed land. He pointed out that, although the Malta Freeport was the first land reclamation project which came to mind when the subject was broached, Msida was also the result of land reclamation which, admittedly, had not been executed “brilliantly”.\nReferring to the Prime Minister’s comments on the Opposition’s insistence on short-term stopgap measures to ease Gozitans’ commute, Opposition Leader Adrian Delia denied the claim that the Opposition was expecting the government to run roughshod over the adjudication process which was holding up the tender for fast-ferry services. Instead, the Opposition was calling for interim solutions to be identified and provided.\nWinding up, Infrastructure Minister Ian Borg said Gozitans could no longer be expected to depend on good weather to get to work on time. The tunnel would better unite Malta and Gozo while also mitigating the exodus of Gozitans who uprooted themselves to seek better opportunities in Malta.\nAfter approving the motion, the House rose for the Easter recess.\nSittings will resume on May 6.", "comment_count": 174, "id": 3976}, {"keywords": "", "author": "", "article_body": "A new European regulation will ensure businesses are safeguarded when using online platforms to reach customers, and customers will now have a wider choice and better value deals, MEP Francis Zammit Dimech, who negotiated the regulation said.\nDr Zammit Dimech said businesses, especially small ones, were becoming more dependent on online platforms to reach customers, as the latter were turning online to buy products or services, such as flights or accommodation.\nIn this regard, it was crucial for platforms to be run in a fair and transparent manner in the way they deal with businesses to ensure fair competition.\nDr Zammit Dimech, who served as rapporteur in the Committee on Legal Affairs, said businesses were asking the EU to support the tourism sector.\nThis regulation would also address the matter since data collected through platforms as a result of commercial activity of business users was to be made available to the respective business.\nThis was crucial for the hospitality sector and would ensure a better service and facilitate targeted marketing.", "comment_count": 2, "id": 3977}, {"keywords": "", "author": "", "article_body": "Former President Marie-Louise Coleiro Preca has been elected to head Eurochild, a Brussels-based children’s rights advocacy network with 176 members in 34 countries.\nEurochild secretary general Jana Hainsworth said: “We are honoured and delighted to have leadership of such a committed champion of children’s rights. Her Excellency’s vision of children’s rights and insight into the political world will open many doors for Eurochild and enable the network to sail smoothly amid the upcoming changes in the European institutions and beyond.”\nEurochild is an advocacy network of organisations working with and for children throughout Europe, striving for a society that respects the rights of children. Bringing expertise from its membership, the network influences policies, builds internal capacities, facilitates mutual learning and exchanges practice and research to support the children’s rights sector.\nAhead of the next month’s European Elections, Eurochild is campaigning for a European Parliament that stands for children with the Vote for Children campaign.\nMs Coleiro Preca said she was honoured to take on the role, as uring her time as both Family and Social Solidarity Minister and as President of Malta, child participation was always at the centre of her endeavours.\n“I would like to use my time as president of this prestigious organisation to ensure that child participation really takes off on a pan-European level, bringing greater attention to the voice of children. I believe Europe can play a leading role globally here too,” she said.\n“I’d like to see Eurochild continuing to strengthen its ties to various international organisations and deepen its cooperation with the Council of Europe.”\nIn 2014, Ms Coleiro Preca had set up the President’s Foundation for the Wellbeing of Society — now the Malta Foundation for the Wellbeing of Society — where an intensified focus on child participation also led to the establishment of the Children’s Hub, the President’s Secret Garden and the Children’s Council and the Young Person’s Council.\n“I am delighted to see Eurochild adopting a similar model… Working with member states of the European Union and of the Council of Europe, together with their respective parliamentary delegations, Eurochild can bring children’s rights into the core of parliaments across the European region.", "comment_count": 6, "id": 3978}, {"keywords": "", "author": "", "article_body": "The law protecting the external borders of the European Union, piloted and negotiated by Maltese MEP Roberta Metsola, can now be implemented after getting a strong and final approval from the European Parliament.\nNegotiations on the law were completed in a record six months, with Dr Metsola working round the clock for the new measures to become law before the European elections in May.\n“It was no easy task to convince other political groups and the EU governments to stop their rhetoric on immigration and security and get down to business. Nevertheless, we convinced, and we managed.”\n“When I was tasked with drafting a new European Border and Coast Guard law, no one thought we would be here today less than six months later with a deal on the table,” Dr Metsola said.\nThe new law will see the addition of 10,000 European border and coast guards who will assist member states on a number of issues including migration, cross-border crime and the process of returns with new European fundamental right safeguards.\nAddressing a press conference in Strasbourg, European Commissioner Dimitris Avramopoulos heaped praise on Dr Metsola’s efforts to reach an agreement in such a record time.\nConcluding her work as a rapporteur of this new law, Dr Metsola said the law was her reply to the people’s concerns about security.\nIt would transform the way the EU’s agencies dealt with the migration phenomena including ensuring 10,000 new border guards and staff; boosting the fight against crime; protecting fundamental rights and aiding the efficient, safe return of those not eligible for protection.", "comment_count": 26, "id": 3979}, {"keywords": "", "author": "", "article_body": "Less than half the recommendations made by the National Audit Office were fully accepted and put into motion, according to the 2018 report on its activities, although a further 38% were partially implemented.\nThe NAO carried out 20 financial audits, six performance audits, and six special audits and investigations, the major one being an investigation into the contracts awarded to ElectroGas by Enemalta Corporation, that had been requested by the Public Accounts Committee. \n\nAuditor General, Charles Deguara, presented the annual report to Speaker Anġlu Farrugia on Wednesday. This report was compiled once again by an NAO editorial team headed by the deputy Auditor General, Noel Camilleri.\nIn the introductory part of the report, the Auditor General provides an overview of the tasks, activities, developments, and achievements by NAO for 2018. He emphasised that in the future the NAO should invariably focus on being a service-oriented organisation whose work would lead to improvements across the public sector, ultimately in the best interest of citizens.\nOn his part, the deputy Auditor General reflects on the determination of the Office to implement its five-year strategic plan, including the shifting of its focus externally, particularly with its key stakeholders, including the Public Accounts Committee, the media, auditees and society at large.\nThe Strategic Plan will provide direction to the NAO in its efforts “to contribute towards the improved governance and performance of the public sector”.", "comment_count": 2, "id": 3980}, {"keywords": "", "author": "", "article_body": "People aged 60 and over are being given the opportunity to apply for a Heritage Malta Senior Passport, with which the applicant and two accompanying youths would have free and unlimited access to all Heritage Malta sites and museums, except for the Ħal Saflieni Hypogeum.\nThe scheme is being supported by the Local Councils’ Association and a memorandum of understanding will be signed in the coming days to implement this scheme.\nOne can apply for the senior passport, which would be sent by post, at local councils.\nHeritage Malta’s Senior Passport holders can enjoy free and unlimited visits to 27 sites which include prehistoric temples and caves, historic houses and prisons, fortresses and palaces, and a selection of museums relating to nature, archaeology, maritime, war, and art. The passport is to be stamped on each visit since with every eight stamps collected, a reward will be given to the holder, to a total of three rewards.\nThis new Heritage Malta scheme, which will go live in May, is offering elders an opportunity to connect and share authentic and meaningful experiences with the younger generation.", "comment_count": 29, "id": 3981}, {"keywords": "", "author": "Claire Caruana", "article_body": "A Maltese man living in Paris on Tuesday described how people around him could be seen “gasping” as a massive fire broke out at the Notre-Dame Cathedral on Monday evening.\nSpeaking to Times of Malta, just hours after the major fire that sent flames and huge clouds of grey smoke over the French capital was controlled, Owen Farrugia said he was just 10 minutes away from the cathedral when the blaze started.\nAttending an event at the Assemblée Nationale, Mr Farrugia, who has lived in Paris for the past four years, said he immediately realised something was wrong when the sound of sirens reached an unprecedented level.\n“I was attending an event nearby, so the sirens could be heard. The blaring of sirens is normal in Paris but their frequency on Monday was out of the ordinary,” Mr Farrugia said.\nHe recounted how people there gasped as news of the fire at the cathedral spread, with many refusing to believe the landmark risked being destroyed.\n“I have visited the monument plenty of times and walk past it at least twice a week. The general mood was definitely one of sadness and shock. People were speechless,” he said.\nWhile those who lived close to the cathedral were evacuated, many people arrived to witness what was happening, he said.\n“People could be seen praying and singing; some were crying and most of them gasped in shock and disbelief,” Mr Farrugia remarked, adding he chose not to get too close to the cathedral while it was still on fire as this was not a scene he wanted to witness.\nRead: 'Like a bombing': Daylight reveals extent of Notre-Dame damage\nWhile the majority of the 850-year-old structure survived the fire and historic relics were saved, the spectacular Gothic spire collapsed during the fire. Fortunately, the iconic bell towers at the front were saved.\nMr Farrugia said people in Paris on Tuesday woke up to nothing but news of the blaze, with the fire at the cathedral being the topic of the day on all news channels.\nMany, he said, were still visibly in shock, adding that some firefighters remained on site and the roads around the cathedral remained sealed off.\nRead: Years? Decades? Uncertainty over time needed to rebuild Notre-Dame\nTransport lines had also been affected, he noted.\nVarious countries and billionaires have pledged money to help restore the iconic building.\nFoundations and crowd-sourcing sites have launched several initiatives to raise money for the cathedral in central Paris.\nRead: Macron vows to rebuild Notre-Dame within five years\n ", "comment_count": 2, "id": 3982}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Family Ministry engaged just under 90 individuals without a public call being made since 2017, Times of Malta is informed.\nDespite strict rules restricting the number of persons of trust a minister or parliamentary secretary can employ in the private secretariat, information given in Parliament shows that the Family Affairs Ministry engaged 21 new officers through a secretariat contract and another 22 on person of trust contracts.\nThe Parliamentary Secretariat for Active Aging hired 16 on secretariat contracts and 14 persons of trust.\nTen people were given a secretariat contract and another three a position of trust contract at the Housing Parliamentary Secretariat, which also falls under the Family Ministry.\nThe information was given following a question tabled by Nationalist MP Claudio Grech.\nThe difference between secretariat and person of trust contracts was not explained. Staff engaged in private secretariats from outside the civil service have so far always been considered as being persons of trust.\nVery likely rules were being ignored\nIt could not be established whether all those engaged by the three entities since 2017, most of whom would benefit from higher salaries than typical civil servants and enjoy special benefits, such as car and communications allowances, are still on the government’s books.\nIn the case of the Family Ministry, the data includes the first six months of 2017, when the office was occupied by Michael Farrugia, now responsible for home affairs. This also applied to the parliamentary secretariats.\nQuestions sent to the ministry on the number of persons of trust still on its books and whether the recruitment was in line with the ministerial code of ethics remained unanswered at the time of writing.\nSenior government sources said that, although numbers might have changed slightly, it was “very likely” the rules laid down by Principal Permanent Secretary Mario Cutajar were being ignored.\nAccording to a manual of procedures, released by Mr Cutajar, ministers are allowed 19 members in their private secretariats and 11 in the case of parliamentary secretaries.\nMinisters can only have up to four advisers on a person of trust contract, though the number can rise to six if the ministry includes a parliamentary secretariat.\nIn his list, Family Minister Michael Falzon said persons of trust were also employed with the Housing Authority, the Foundation for Social Welfare Services, the Department for Social Security and other entities within the ministry. Those employed directly on a ministerial recommendation included managers, messengers, drivers and customer care officers.\nTimes of Malta reported last October that even Prime Minister Joseph Muscat was not in line with the code of ethics with regards to the appointment of advisers. Though his office could have a maximum of eight consultants, 11 were on the books.\nThese included former deputy prime minister Louis Grech, former ministers Manuel Mallia and Alex Sceberras Trigona, former parliamentary secretaries Stefan Buontempo and Deborah Schembri, former Labour MP Maria Camilleri and Labour converts Cyrus Engerer and Marisa Micallef.\nQuestions sent to Mr Cutajar remained unanswered.\n ", "comment_count": 62, "id": 3983}, {"keywords": "", "author": "", "article_body": "Flimkien għal Ambjent Aħjar (FAA) is appealing the Planning Authority’s decision on MIDI’s development of Manoel Island, asking for donations of €7,000 to cover the cost of the appeal to the Environment and Planning Review Tribunal (EPRT) and for legal and architectural fees.\nThe Manoel Island master plan approved on March 7 includes the development of 650 luxury apartments, a five-star hotel, a new vehicle bridge and roundabout, an expanded marina for superyachts and extensive land reclamation works.FAA listed a number of reasons why the development should not go ahead, citing the ruin of iconic views across Marsamxett Harbour to Valletta; the loss of a large section of the Gżira promenade, and the narrowing of the sea channel which would increase the risk of flooding of Triq ix-Xatt, among other things.The appeal by FAA follows a campaign by the citizens’ group Inħobbu l-Gżira which launched a petition calling on Malta’s Parliament to turn Manoel Island into a national heritage park. Over 8,000 signed the petition offline and online, the highest number of signatures for an environment related parliamentary petition in this legislature. The public can help to fund the appeal by donating to the PayPal account payment@faa.org.mt or sending a cheque to Manoel Island Appeal, FAA, 23 St Anne Street, Floriana.", "comment_count": 10, "id": 3984}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A suspect thief, already in police custody, was arraigned in court once more on Wednesday to face additional charges after incriminating phone localisation data linked him to the scene of another burglary.\nMatthew Camilleri, a 32-year old Gzira estate agent, had been arraigned last month to face 19 charges of theft, the majority of which spanned a fortnight, kicking off at the end of January.\nTwo other thefts dated back to October and November. The thefts and attempted theft included a variety of shops, real estate agencies, insurance company offices and a service station.\nHe had been denied bail after pleading not guilty.\nOn Wednesday, Mr Camilleri pleaded not guilty to the theft of cash, jewellery and other items from a flat in Attard in February.\nInspector Mario Xiberras explained how CCTV from the area of the burgled residence showed the suspect alight from an SUV and look at a shop window, before entering the residence, re-emerging some 20 minutes later.\nMoreover, the victims claimed to have spotted the suspect in the area before and mobile phone localisation data had also placed him in the vicinity of the apartment at the time of the robbery.\nNo request for bail was made and the man was remanded in custody.\nLawyers Franco Debono and Marion Camilleri were defence counsel.\nInspectors Mario Xiberras and Christina Delia prosecuted.", "comment_count": 0, "id": 3985}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who walked out of jail a few months ago after 14 years was remanded in custody on Wednesday after allegedly stealing €16,000 from a parked vehicle.\nJosef Farrugia, 39, from Hamrun, was arrested and accused of stealing the cash from the van in St Joseph High Road, St Venera at around 5pm on Monday.\nHe pleaded not guilty.\nThe prosecution objected to the granting of bail in view of the fact that an accomplice is still on the run.\nDefence lawyer Jason Grima countered that evidence was already preserved through the magisterial inquiry and, moreover, his client ought not be held answerable for someone else’s wrongs.\nHe said that Mr Farrugia, who left prison a year and a half ago after serving 14 years behind bars, needed help to combat his drug problem. He suggested a treatment order if bail was to be granted.\nHowever, in view of the accused’s voluminous criminal record, which did not offer “much comfort,” Magistrate Donatella Frendo Dimech turned down the request for bail.\nInspectors Stacy Attard and Mario Xiberras prosecuted.", "comment_count": 0, "id": 3986}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The man who allegedly kept his estranged wife locked in an underground chamber beneath Fort Ricasoli is back behind bars after having been arrested in a drugs raid on a garage in Qormi, where he was reportedly living.\nSeychelles-born Roddie Swinton Williams, 38, was granted bail just over a year ago pending proceedings for attempted murder, placing his wife's life in manifest danger, violently engaging in sexual acts and a number of other charges related to the episode which took place in October 2017.\nHis bail bond was initially set at €80,000, €30,000 of which were to be immediately deposited in court to secure his release from preventive arrest.\nRoddy Williams\nHowever, it was only when that deposit was reduced to €3,000, in view of case-law on the subject, that the accused had regained his freedom pending continuation of proceedings.\nWilliams was arraigned under arrest on Wednesday accused of repeatedly breaching his bail conditions.\nProsecuting Superintendent Josric Mifsud explained that the accused had failed to keep his appointment to sign the bail book, last turning up on February 19.\nAttempts to track down the man proved difficult since he had changed address without informing the police, as bound to do in terms of his bail decree. \nHe was remanded in custody.\nThe case continues in April.\nLawyer Marion Camilleri was defence counsel. \nSeven arrested in drugs raid\nThe police said seven persons were arrested during the drugs raid in Qormi.\nThe raid was conducted by the police Drugs Squad, the Special Intervention Unit and district police.\nThe arrested persons are from Qormi, Valletta, Żejtun, Msida and St Paul's Bay and aged between 38 and 47.\nSeveral packets containing suspected cocaine and heroin were found.\n ", "comment_count": 0, "id": 3987}, {"keywords": "", "author": "", "article_body": "Illegal bird trapping equipment including a huge mist net were found over the past week as members of the Committee Against Bird Slaughter (CABS) led police officers to seven illegal trapping sites for Turtle Dove and Quail in Gozo.\nTwo illegal cage traps were found near Għasri and the outskirts of Victoria, three sets of clap nets in San Lawrenz, Zebbuġ and Għasri, one ground net for Quail-trapping in Marsalforn and a massive vertical mist net which poachers had set up in a fenced property below the Gordan lighthouse.  \nThe mist net in the back of a police car.\nCABS said that the operation revealed that poachers have adopted a new technique to trap turtle doves with so-called sputnik-traps` which are installed on top of cages containing live Turtle Doves. Sputnik-traps are normally used by pigeon fanciers to secure returning racing pigeons in the loft; but attached to an aviary they are a very effective mechanism to trap wild birds.\nWith a size of about 100 square metres the mist net found below the lighthouse was one of the biggest of its kind ever found by CABS on Malta and Gozo.\n“Its dimension and professional setup suggest that this trap was set up and operated by several poachers who intended to catch hundreds of birds with it“, CABS Press Officer Axel Hirschfeld said.\n\"We expect the police to do their utmost to identify and question the owners of the compound where the net was found.\"\nAccording to CABS the mist net was installed in direct proximity of a large aviary which contained a number of Turtle Doves and songbirds.\n\"Unfortunately these birds could not be properly inspected to determine their origin as no WBRU enforcement officer or court expert was available“ Hirschfeld said, adding that it was obvious that the birds in the cage have been caught illegally and also served as decoys to lure more birds into the mist net.\nAs the police officers on site were not trained in bird identification, the birds were left in the aviary without a detailed inspection, Hirschfeld stated.\nThe NGO said its activists counted more than 1.400 live Turtle Doves being kept alive in aviaries close to hunting hides around Malta and Gozo.\n\"As trapping of live Turtle Doves has been banned since many years we wonder where all these birds are coming from“, CABS Operations Officer Lloyd Scott said adding that it is impossible that such a huge number of birds have been bred in captivity.\nCABS criticised that the law does not require that breeders have to equip Turtle Doves with closed rings thus making it impossible for the police to differentiate between captive bred and wild-caught birds.\n\"This is a massive legal loophole which makes enforcement a mission impossible. We therefore urge the government to change the law and introduce a scheme for the registration and marking of live Turtle Doves kept in captivity“, Scott said.", "comment_count": 6, "id": 3988}, {"keywords": "", "author": "", "article_body": "DJ Martin Garrix is set to return to the Isle of MTV concert, accompanied by popular singer Bebe Rexha, who is coming for the first time.\nThe announcement was made by Isle of MTV on Wednesday morning.\nGarrix was also on the Isle of MTV stage in 2015. \nThe free concert will be held this year on July 9. Like last year, those who intend to go will need to get their tickets beforehand.", "comment_count": 1, "id": 3989}, {"keywords": "", "author": "Jacob Borg", "article_body": "Tourism Minister Konrad Mizzi this week filed a Constitutional Case against the Attorney General claiming fresh calls for an inquiry into his Panama Papers dealings breached his human rights.\nAn earlier request for such an inquiry was successfully blocked in January on appeal by Dr Mizzi, Prime Minister Joseph Muscat and his top aide Keith Schembri, among others.\nFormer Opposition leader Simon Busuttil and civil society group Repubblika took to the courts to again demand an inquiry in March due to the “institutional paralysis” over the Panama Papers scandal.\nDr Mizzi in his court application argued that no decision should be taken about whether such an inquiry is warranted until his human rights case is heard.\nThe Tourism Minister said the fresh request for an inquiry breached his right to a fair hearing as the law allowing such requests by citizens was being abused.\nIn comments to the Times of Malta, Repubblika said it was outrageous that a government minister used the institutions of the State to run away from the law.\n“Human rights laws exist to protect citizens from their government. Konrad Mizzi thinks they exist to protect the government from citizens”, Repubblika said.\nThe April 2016 Panama Papers leaked exposed how Dr Mizzi and Mr Schembri secretly conspired to receive $2 million in payments through offshore structures.Repubblika said if Dr Mizzi was not guilty of “corruption and bribery” he would look forward to an investigation that would clear his name.\nInstead, he was suing the government he is part of to stop it from investigating his crimes, the NGO continued.\nThe NGO expressed its frustration that six weeks after filing the request for an inquiry, the court had not yet decided the“simple question” of whether an inquiry should commence.\nRead: Simon Busuttil embarks on new Panama Papers battle\nIt said these legal somersaults do not absolve the police from their duty to investigate crimes, and every day that goes by while they neglect their duties, is another day where the State collaborates with and participates in a criminal conspiracy.\n“Clearly justice in this country cannot reach the untouchable Konrad Mizzi and the criminal gang he fronts for. That doesn’t mean Repubblika is going to give up trying to change that.\n“Konrad Mizzi might think that’s harassment. He ain’t seen nothin’ yet”, Repubblika declared.\nA report published this month by the Group of States against Corruption (Greco) said it was clear Malta needed to increase its capacity to deal with allegations of corruption and other offences involving government officials.\nThe lack of action against top officials facing corruption allegations conveyed a feeling in the public that senior officials benefit from a total impunity for their actions, Greco said.\nGreco warned Malta’s criminal justice system is at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates took place.\nThe government has pledged to carry out reforms based on recommendations by the Venice Commission. The prosecution function is set to be hived off from the Attorney General’s role, though the new prosecutor will be handpicked by the government.\nPrime Minister Joseph Muscat played down the Greco report in Parliament this week, saying the information contained in it was based on media reports and much of the recent international attention on Malta was brought about by the Opposition.\nDr Muscat has told the media he sees no reason to stall further judicial appointments until reforms giving less government influence over the process are pushed through.", "comment_count": 0, "id": 3990}, {"keywords": "", "author": "", "article_body": "A retired customs officer has been perpetually interdicted and sentenced to community service after he pleaded guilty to accepting a box of sugary drinks as a bribe.\nPhilip Grech, 64, from Zebbug, admitted to having accepted bribes from a Libyan man in return for allowing him access to a restricted area of the airport in 2013.\nProsecuting police Inspector Jonathan Ferris had told magistrate Donatella Frendo Dimech in 2016 how, on September 25, 2013, he had been informed that a Libyan person had been observed being granted access by customs officials to a restricted area of the airport housing a luggage conveyor belt.\nThe man, Jamal Mesdah Basher Al Gazale, was seen on CCTV in the act of taking several boxes from the conveyor belt. He was not challenged by customs officers on duty.\nThe inspector had explained that the door to the room could not be opened from the outside, but had to be opened from the inside by means of a sensor.\nThe footage showed that Al Gazale was accompanied by a customs official, who the inspector said had assisted the Libyan in loading 12 boxes on to a trolley. However, although the conveyor belt showed 12, Al Gazale is then seen leaving the customs zone with 11.\nPhilip Grech had been the customs official on duty that day, the inspector said.\nThe missing box had been found in Grech’s office, the court was told. The accused had told the police inspector that the sugary drinks tasted awful and were used during the Ramadan fast to supplement calorific intake. He had allegedly told the inspector that he had accepted them as a payment of a courtesy by Al Gazale, for allowing him to access the area.\nDespite initially denying the charges, Grech had filed an admission in February 2019.\nIn her decision, Magistrate Donatella Frendo Dimech said she was taking into consideration the nature of the charges, the late admission of the accused and the fact that the crime had occurred in 2013. His criminal record was “not worrying” said the court, adding that it had taken into consideration the circumstances of the case as well as the recommendations by the man’s Probation Officer.\nFinding him guilty on his own admission, the court sentenced Mr Grech to 65 hours of community service and perpetual general interdiction, preventing him from holding any public office or employment. He was also ordered to pay €742 in costs.\nInspector Anne Marie Xuereb prosecuted. Lawyer Stefano Filletti was defence counsel.", "comment_count": 0, "id": 3991}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Transport Minister Ian Borg has been told to redraw his plans to turn a field in a pristine rural area into a pool to get in line with policy.\nThe permit he was given has now been withdrawn until fresh plans are submitted to the Planning Authority.\nThe Environment and Planning Tribunal upheld one of the 11 reasons listed in an appeal by Mġarr resident Noel Ciantar to back his argument that the permit was ‘abusive’.\nThe tribunal noted that although only developments no bigger than 75 square metres are permissible in the area where the minister wants to build a private pool outside the development zone, the PA still accepted the application despite the proposed structure exceeding the allowed floor area.\nAccording to the tribunal, this was a subjective decision made by PA officers even though the policy did not allow such a concession.\nIt, therefore, ordered that the permit granted to Dr Borg, who is also politically responsible for planning, should be withdrawn and that a permit should be issued once new plans in line with policy were submitted.\nHowever, the minister was still given some flexibility as his house, which he had described as his only matrimonial home, was considered by the tribunal as consisting of two different dwellings, thus allowing him to have a larger outside floor area than that allowed in the case of one dwelling. The 400-square-metre house is adjacent to the area where Dr Borg is proposing to build his pool.\nWhen a permit for his original home in Santa Katerina, a rural hamlet in the limits of Rabat, was granted in 2014, Dr Borg had rejected accusations he was building two houses and insisted it was only one dwelling.\nPlanning experts said the tribunal’s decision would mean that the minister would have to reduce the size of the planned pool by between five and 10 square metres. However, he would still be allowed to turn agricultural land into an outside area, boosting the market value of his property in the process.\nDespite the objections of Noel Ciantar and various NGOs, the Planning Commission had gone ahead and given its green light to the Planning Minister.\nThe tribunal rejected all the other reasons raised by Mr Ciantar.\nAmong other things, he said the planning commission members had a conflict of interest as they were appointed by Dr Borg himself.\nMr Ciantar also recalled that the Ombudsman had found the original permit to have been “a grave error”.\nThe Ombudsman had declared that the planning permit issued to Dr Borg was abusive and recommended a review of the permit. However, Prime Minister Joseph Muscat, then politically responsible for the planning authority, did not take action.\nDr Borg had acquired the agricultural land adjacent to his home prior to 2014 for less than €12,000. However, he opted to submit two separate applications, one for the house and, then, once the permit was issued, he filed his request for the pool.\nSeveral NGOs had opposed Dr Borg’s application and commented that as the minister responsible for planning, he should set an example and not develop ODZ land.\nThe tribunal’s decision can be appealed in court.", "comment_count": 44, "id": 3992}, {"keywords": "", "author": "", "article_body": "One person was slightly injured when robbers armed with a knife stormed an outlet at Għajn Dwieli Road, Paola, late on Tuesday, demanding cash.\nThe police said the hooded persons demanded cash from the salesperson, a 21-year-old from Zabbar.\nIt appeared that a 38-year-year-old person from Paola who was in the outlet at the time was accidentally injured by the weapon and needed hospital treatment, the police said without going into detail.", "comment_count": 0, "id": 3993}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta reports that 'reverse' road works are being carried out on country roads around Rabat. It also reports from court how a comment by the man charged with the Għaxaq double murder that the victims were scared but he did not know why raised suspicion.\nMaltaToday focuses on road accidents, saying they have become 'an epidemic'. It also says that Alex Sceberras Trigona, a former foreign minister and now government adviser, met a Russian minister after Malta turned down a Russian request for overflying rights for flights to Venezuela.\nIn-Nazzjon quotes PN leader Adrian Delia saying the government is ignoring families and is intent only on power. It also reports that the health minister refused to disclose how many foreigners are working in the health sector in Malta.\nl-orizzont says the new EU Work-Life Balance Directive will be followed according to local reality.", "comment_count": 1, "id": 3994}, {"keywords": "", "author": "", "article_body": "A 44-year-old from Valletta was seriously injured when an argument with a man from Bosnia got out of hand on Tuesday afternoon.\nThe incident happened in High Street, St  Julian's.\nThe Bosnian was a 27-year-old living in Gzira. Investigations are continuing.  ", "comment_count": 17, "id": 3995}, {"keywords": "", "author": "", "article_body": "Silvio Schembri, parliamentary secretary for financial services and the digital economy, has filed a report to the police Cybercrime Unit after a so-called company using the name Nexus posted adverts in which it falsely claimed endorsement by the secretariat.\nThe advert featured a spam article posted on a site called Major News claiming Mr Schembri’s endorsement to a 'Bitcoin Revolution'.\n\"This matter has also been referred to Facebook to take action from their end\" te secretariat said.\nMr Schembri denied making the endorsement.", "comment_count": 5, "id": 3996}, {"keywords": "", "author": "Keith Micallef", "article_body": "Some of the concrete controversially laid on country roads in a Rabat valley is being pulled up again by Infrastructure Malta on orders from the environment watchdog, which wants the roads to be reinstated to their original footprint.\nThe controversy erupted last month when it transpired that a number of narrow country roads used primarily by farmers at Wied l-Isqof were being widened, as part of a government project to “reconstruct” rural roads.\nFaced by this outrage, the Environment Resources Authority ordered Infrastructure Malta to halt the works, through what it called a stop and compliance order. The measure was taken because the project was resulting in “biodiversity destruction”, ERA had said.\nInfrastructure Malta argued that the roads in question were not being widened beyond their original footprint - even though evidence on the ground suggested otherwise.\nHowever, an ERA spokeswoman confirmed that Infrastructure Malta had, in fact, encroached on adjacent land. She said that concreting beyond the original footprint was being removed by the roads agency’s contractors through the use of appropriate heavy machinery.\nSeveral truckloads of material have been removed and dispatched for appropriate disposal to enable the area’s habitat to regenerate even in the area previously concreted, she said.\nAn onsite visit confirmed that the roads had been narrowed, with a stretch of soil replacing the concrete along the perimeter.\nIn its reply, ERA said it had intervened because the roadworks were degrading the ecosystem of the area beyond the asphalted area.\nAmong other things, the interventions had altered the physical profile of the valley and the natural course of the freshwater stream to the detriment of the biodiversity and the natural characteristics of the site, the spokeswoman said.\nEnvironmentalists had denounced the works, saying vegetation was being obliterated as concrete was being poured beyond the existing footprint, damaging flora and fauna on both sides of the road.\nBiodiversity expert and former assistant director of the environment protection directorate at the now defunct Malta environment and planning authority, Alfred Baldacchino, had warned that turning these roads into “highways” could have a detrimental effect on farmers due to the increase in traffic.\nHe also criticised the project, saying the concrete was blocking the percolation of rainwater to the water table.", "comment_count": 22, "id": 3997}, {"keywords": "", "author": "", "article_body": "Activists on Tuesday held their monthly vigil to remember slain journalist Daphne Caruana Galizia, a year-and-a-half after her death.\nMs Caruana Galizia was killed by a car bomb on October 16, 2017. Three people have been charged with her murder but activists insist that the mastermind remains on the run.\nSpeeches were made during the vigil calling for justice and praising Ms Caruana Galizia's courage in exposing corruption, which eventually led to her death.\nMs Caruana Galizia had warned of the weakening of institutions and the impunity that was widespread, but she had never stopped fighting, Manuel Delia, one of the organisers said.\n \n \n \n ", "comment_count": 8, "id": 3998}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta’s new 2030 climate plan is “not ambitious and too passive”, an association of renewable energy experts and professionals has lamented, calling for bolder measures to kick-start a new green business model on the island.\nIn its comments on the draft National Energy and Climate Plan, the Malta Energy Efficiency and Renewable Energies Association (Meerea) said the new strategy did not sufficiently build on or evaluate the success of previous plans, limiting itself instead to reporting on them.\nThe association also said the time had come to address the issue of solar rights – protecting access to the sun from overshadowing by tall buildings – which it said was “negatively impacting the future of renewable energy in the built environment”.\nThe 2030 plan, published for public consultation last month, lays out the government’s strategy for the next decade under the EU’s long-term climate goals and Paris Agreement commitments.\nMalta can play a role model in showing that a green economy is financially feasible\nAmong other aspects, it lays out key objectives for Malta of a 19 per cent reduction in greenhouse gas emissions and a 13 per cent share of renewable energy in final energy consumption by 2030, primarily through vastly-increased solar generation capacity.\nHowever, Meerea – which brings together academics, entrepreneurs and technically qualified professionals in the sector – said the plan lacked ambition in failing to set progressive renewable energy targets, which would have laid the groundwork for renewables to become a new market. \nIt described the draft plan as a first step in the right direction, but said it should be made “longer and bolder” before the final submission date.\n“This is a one-off opportunity where government can turn an obligation into an opportunity for promoting new business markets in the area of energy efficiency and renewables for the next 10 years,” the association said.\n“Malta can play a role model in showing that a green economy is financially feasible, provided that it is given the right tools, ambient and policies to operate.”\nThe association also said the plan did not highlight the fact that due to a strong construction boom, homeowners were being discouraged from investing in PVs.\nAs 70 per cent of residents would soon be living in apartments, the lack of integrated renewable energy systems in new-builds, it said, was a “missed opportunity” that would heavily impact electricity generation. “Within 15 years from now, Malta will need another power station,” the association said.\nIt also warned that the plan lacked a serious approach towards addressing energy efficiency on the demand side.\n“The increase in energy demand and the resulting negative impact that this will have on energy consumption and renewable energy share seems to be taken as unavoidable and there are insufficient measures for addressing and curbing future energy consumption,” it said.  ", "comment_count": 5, "id": 3999}, {"keywords": "", "author": "Denise Grech ", "article_body": "Opposition leader Adrian Delia on Tuesday accused Transport Minister Ian Borg of trying to gain political mileage from a road accident which left seven injured and two killed. \nThe public reacted in horror as two Żabbar women died and seven were injured in a dreadful traffic accident close to Mosta on Sunday night. Dr Borg was quick to dismiss any idea the incident could be linked to ongoing road works.\nWatch: Roadworks not to blame for fatal accidents - minister\n\"Even in the face of this tragedy, he tries to gain political mileage and turn it into an advert for the leadership bid,\" Dr Delia said.\nIn doing so, the minister also threw away the procedures related to a magisterial inquiry that started into the incident, the Opposition leader said. \nHow does he have the nerve to throw away the procedures and stultify a process that just started, he asked. In doing so, the minister guaranteed no justice will be done with the victims of the tragedy, he added. \nShame on you, you don’t know what decency is- Adrian Delia\n\"Shame on you, you do not know what decency is,\" Dr Delia fired in his missive.\nTurning to the Council of Europe’s Greco report, which was debated in Parliament Monday, Dr Delia said it was shameful the government did not recognise how damning the report was.\nThe report by the Group of States against Corruption (Greco) found the country's criminal justice system was at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates took place.\nDuring the debate, Prime Minister Joseph Muscat said the Opposition was partly to blame since it had portrayed Malta in an \"irresponsible way\" internationally. \nDr Delia insisted it was shameful the government did not recognise how damning the report was. \nAs usual, the Prime Minister tried to make it out as though he was guiltless on this, he said. \"You appointed 15 out of 17 judges affiliated with the Labour party - was that the Nationalist party that did that,\" he asked. \n\"Of course we have a dysfunctional democracy,\" he told supporters in Gzira.\nThe Opposition leader also dismissed talks of any faction within the Nationalist party, saying it was united in the fight for good governance.\nThe Nationalist party has been rocked by revelations that MPs Kristy Debono and Hermann Schiavone - two of Dr Delia's closest supporters - met 17 Black owner Yorgen Fenech for a conference sponsorship. Ms Debono has subsequently apologised for the meeting, while Mr Schiavone suspended himself from the parliamentary group.\nA riled-up Nationalist party leader closed his speech by calling on people to vote in the upcoming European Parliament elections. \n\"We have six weeks to make our decision,\" Dr Delia said. Staying home and not voting meant you are signing off on the bad decisions that take place, he added. ", "comment_count": 71, "id": 4000}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Guidelines determining the validity of parliamentary petitions, some of which have garnered thousands of signatures, will be finalised in the “near future” but a date has not yet been set.\nThere are currently 10 parliamentary petitions online, seven of which have been closed for signatures, including one calling for the protection of embryos, which has attracted more than 8,780 signatories.\nIn February, a House Business Committee meeting was told that the committee had drafted a set of guidelines setting terms of reference on which the petitions filed by the public will be considered valid or not.\nRead: Guidelines for parliamentary petitions still not finalised\nAsked when these guidelines would be published, the Speaker’s Office said they were in the final stages of being drawn up and would be submitted to the Petitions Committee for its consideration.\nAn initial draft had already been submitted to the committee and it will soon be providing them with a fine-tuned version, a spokesman said.\nOnce reviewed and adopted, the guidelines will be published with immediate effect, he added.\nHowever, it would be up to the committee to decide whether to apply a retroactive effect on existing petitions.Asked repeatedly for a date, the spokesman said: “Hopefully in the near future.”\nThe guidelines that are being drawn up reflect the current provisions in the standing orders and others, such as those related to parliamentary questions which, among others, protect a person from being named.\n“These safeguards are also featured in the guidelines applicable to the petition system of the House of Commons. We are trying to tap into the vast experience of our UK colleagues but at the same time modifying them to suit our need,” the spokesman said.\nDuring a February meeting, Democratic Party MP Godfrey Farrugia questioned why the petitions committee had not processed any of the petitions presented during the current legislature.\nHe told the Times of Malta that the delay in setting guidelines for the petitions had become a stumbling block.\nWhat happens to the petitions once they close for signatures?\nEvery petition, whether presented by a member or a citizen, shall be discussed in the Standing Committee on Petitions. After the discussion, the committee decides whether the petition is referred to a Standing Committee or to a Select Committee, or whether a discussion should be held in the whole House.\nA petition could be referred to a ministry, department or authority.\nIt could also be decided that no further action is taken on the petition or that the petition is laid on the Table of the House with or without comments by the Standing Committee on Petitions.", "comment_count": 2, "id": 4001}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man’s enrollment at a residential drug rehabilitation programme proved the timely factor which saved him from being remanded in custody over theft-related charges.\nKeith Pace, a 38-year-old car dealer from Marsa, was granted bail after pleading not guilty to two separate instances of aggravated theft dating back to December and January totaling some €120,000 worth of jewellery, antiques, gold coins and other valuables.\nProsecuting inspectors Shawn Pawney and Godwin Scerri explained how investigations had sparked off from a report back in December over an alleged burglary from the Mosta home of a 70-year-old lady who claimed that some €100,000 worth of valuables, including 400 gold coins, had been taken.\nThe second theft took place from a Santa Venera residence where a further €20,000 worth of items were taken.\nAs investigations continued, police received information last week which placed them on the trace of the suspect inside whose home a number of the stolen antiques were allegedly discovered, but not before some of the valuables were destroyed by the man in the course of the arrest.\nSubsequent phone localisation data further confirmed police suspicions linking the man to the thefts.\nThe suspect was arraigned under arrest on Tuesday afternoon and charged with his involvement in the aggravated thefts, handling stolen goods, breach of bail and of probation as well as committing the crimes during the operative period of a suspended sentence.\nThe prosecution objected to the request for bail, pointing out that civilian witnesses were still to testify, although confirming that the man was due to enter a residential drug rehabilitation programme at Oasi right on Wednesday.\nThere was nothing to stop him from getting out, the prosecution argued.\nHowever, defence lawyer Franco Debono countered that it would be a pity to deny the man this long-awaited chance to enter rehabilitation, a chance which might not easily come along again soon.\nAfter hearing submissions, the court, presided over by magistrate Monica Vella, upheld the request for bail under a specific and strict condition of entering rehabilitation on Wednesday and completing the full course with success.\n“Should you be informed that he has left the programme, you are to rearrest him immediately,” the magistrate said, turning towards the prosecution while the accused declared that he had understood the condition fully.\nThe court also ordered a deposit of €1,000, a personal guarantee of €5,000 and the signing of the bail book at the Victoria police station three times a week.\nLawyer Amadeus Cachia was also defence counsel.", "comment_count": 0, "id": 4002}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two of the men charged with the murder of Daphne Caruana Galizia, under preventive arrest since December 2017, could not benefit from a pilot project which was currently testing electronic tagging.\nThis information was disclosed in open court in the course of constitutional proceedings filed by Alfred and George Degiorgio after several requests for bail were turned down by the courts.\nThe Director of Prisons, Alex Dalli, shed light upon the pilot project introduced under his direction at the Corradino Correctional Facility whereby persons serving an effective jail term could be allowed to leave the facility while being monitored via an electronic tagging device.\nA small, plastic waterproof tag was attached to the person’s foot, said Mr Dalli, explaining that this simple device allowed prison authorities to monitor those prisoners who, after appearing before the Prison Advisory Board, were granted the right to do pre-release work and community service.\nThis measure was generally adopted towards the end of their prison term and only after getting the green light from the Board, after assessing the candidate’s behaviour and rehabilitation, Mr Dalli explained, adding that the project was intended to provide for inmates’ gradual, step-by-step reintegration into society.\nHowever, the measure certainly did not apply to those under preventive arrest, such as the Degiorgio brothers, the Prison Director explained, pointing out that it was not within his remit to decide whether the facility should be extended to those granted bail.\nEarlier on in the sitting, lawyer William Cuschieri, assisting the Degiorgio brothers, argued that identical requests for bail in several instances were being heard by a limited number of judges who had already expressed their intention to deny bail.\nMadam Justice Lorraine Schembri Orland, however, said she did not feelthat the evidence showed that there “is some imputation of prejudiceon the part of the judges who heard the preceding requests”.\nLawyers Victoria Buttigieg, Thérèse Comodini Cachia, Jason Azzopardi and Eve Borg Costanzi appeared for the respondents.", "comment_count": 0, "id": 4003}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The house in Għaxaq where Joseph Bonnici murdered his mother and sister bore clear signs of habitation, sparking investigators to sense that its occupants appeared to “have left in a hurry”.\nThis sensation, together with a number of inconsistencies in the version supplied by their suspect, was recalled on Tuesday in open court as the compilation of evidence continued against Joseph Bonnici, the man accused of the double murder.\nA succession of officers from the Żurrieq and Żejtun police stations shed further light upon the investigations, which had been sparked off by a report on March 27 concerning the alleged disappearance of Maria Lourdes and Angele Bonnici. The report eventually evolved into a full-scale murder inquiry when the man who  filed the report confessed to having murdered the women.\nMr Bonnici had claimed to have last seen his mother at around 7am on March 27 when she had allegedly waved to him from her balcony.\nYet, only a few hours later, towards 2.30pm, the man had gone to the local police station to file a missing persons report, allegedly prompted by his father who had voiced concerned when his routine calls from jail went persistently unanswered.\nRead: Mother, daughter killed at home, then transported to Gudja field\nOne police sergeant who had visited the missing persons’ home, recalled on Tuesday, that as he accompanied Mr Bonnici around the house he sensed something he could not quite figure out.\nThe home had presented clear signs of habitation, with the mother’s mobile phone still switched on, left lying on a chair, a half-filled mug of coffee in the kitchen, and a plugged-in laptop inside the daughter’s room where clothes were strewn across the bed. A handbag revealed a purse with Angele Bonnici’s personal documents still inside.\nCCTV had been switched off\nThe CCTV monitor at the mother’s bedside was switched off and the four cameras of the system were unplugged, the court heard.\nA stone slab had been removed by Mr Bonnici to gain access to his mother’s adjacent residence, explaining to the visiting policemen that “he was concerned about his relatives”.\nHis mother used to place a wooden bar behind her door, as added security, “because they were scared” the man had told the officers, answering with an “I don’t know” when asked about the cause of such fear.\nThat reply, reiterated several times by the man throughout the house inspection, raised suspicions.\nOne of the prosecuting officers, Inspector Roderick Attard, also took the witness stand on Tuesday recalling how the localisation of Angele’s mobile phone had given its bearings at “Għaxaq Parish Church”.\nThat was before Mr Bonnici had admitted to the murders.\nFollowing that admission, the inspector recalled the heavy silence that  characterised the ride in the police car to the Għaxaq field, save for directions by the accused who, once there, refused to accompany the officers to the burial site.\n“Jien nurikom fejn però m’iniex se niġi maghkom ghax m’hemmx xena sabiħa,” (I will show you the location but it's not a pretty site) the man had uttered, while indicating the spot by a rural room, next to a rubble wall where the lifeless bodies of mother and daughter were eventually found.\nAnother officer recalled how shortly after the accused’s arraignment, whilst being handed over to the prison officials, the man had said he had to start from scratch, before breaking down in tears.\nA man who ran a florist’s shop, described his former employee as an exemplary, hard-working man who had never caused any trouble and had always performed his tasks “even better than” his own employer.\nThe suspect was loved by all and many had approached his former boss over the past days, expressing both shock and disbelief over the criminal allegations in his regards.\nThe case continues next week.\nInspectors Keith Arnaud, John Spiteri and Roderick Attard prosecuted. Lawyers Franco Debono and Marion Camilleri are defence counsel.", "comment_count": 0, "id": 4004}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta has turned down a Russian request to use its airspace to fly military aircraft to Venezuela, government sources said on Tuesday.\nThe sources confirmed international media reports that Malta had given the thumbs down to a request for Russian military planes to fly over Malta on route from Syria to Venezuela.\nMalta’s decision comes shortly after the island had last month approved a similar request, with Russian military planes and personnel eventually spotted in the Venezuelan capital of Caracas.\nLast month The New York Times reported how a visit to Venezuela by two Russian military planes had “set off alarms” that the pro-Venezuela Russian government was stepping up its support of embattled Venezuelan President Nicolás Maduro.\nAccording to the US publication, Russian and Venezuelan officials had pointed out that such flights would normally be sent to secluded military air bases beyond the sight of the public.\nHowever, on this occassion they landed in open view at the country’s main airstrip: Simón Bolívar International Airport.\nRussia has emerged as Mr Maduro’s main backer since opposition leader Juan Guaidó proclaimed himself interim president in late January with the support of the United States and about 50 other states, including Malta and the rest of the EU.\nSant abstains as Euro Parliament recognises Venezuela Opposition leader as interim president\nAccording to the Russian state news agency, the planes brought supplies and technical advisers to Caracas.\nMaltese government sources on Tuesday confirmed that this was in fact the second time this month that the island had rejected a request from Russia to use its airspace for flights to Venezuela.\nAccording to unnamed sources quoted in the international media reports on the matter, the Russian embassy in Malta did not take kindly to the rejections, raising concerns of possible retaliation.\nMaltese government and security sources, however, played this down telling Times of Malta that they were \"not overly concerned\" about this.   ", "comment_count": 15, "id": 4005}, {"keywords": "", "author": "Claire Caruana", "article_body": "Kindergarten teachers in state schools devote more time to the Maltese language than their counterparts in non-state schools, a study has revealed.\nPublished on Tuesday afternoon, a study by the National Literacy Agency found that while teachers in state schools devoted just over 64% of the time to Maltese, the figure went down to 35.9% for English.\nMeanwhile, in Church schools, the figure for English soared to 60.8% while going down to just over 39% for Maltese.\nOn independent schools, the teachers who participated in the study were found to use English “exclusively”.\n“Maltese was introduced as a foreign language and 15-minute sessions were held three times a week by the teacher of Maltese. Gifted children follow a third-language programme,” the researchers noted.\nTeachers in central state schools and south-eastern state schools, the researchers noted, aimed to promote both Maltese and English and they dedicated roughly an equal amount to both languages.\nOn the alphabet, this was presented in English in Church and independent schools while students in state kindergartens were taught the Maltese version. Certain topics, namely those involving mathematics and numbers, were taught in English in all schools.\nDespite this, the majority of educators were found to switch from one language to the other depending on their students’ needs, especially when these included foreign children.\nOn the reasons behind teachers’ choice of language, the researchers found that the influx of foreign students did have an impact on this decision, with many educators saying that they need to use English or to code-switch to the language because of the presence of non-Maltese students.\nAccording to one of the researchers, Lara Ann Vella, 70% of teachers believe such switching – referred to among educators as language mediation – occurs mainly because the students are very young and they have special emotional needs so this is crucial.\nSpeaking at the unveiling of the study’s results, Education Minister Evarist Bartolo insisted that ensuring students were bilingual was crucial. He added that the country needed to develop an Official Languages Act, noting that other countries had such an act to outline how two languages are used together.\nHe also called for the increase of Maltese’s digital presence, adding that if this is not stepped up, the language faced “digital extinction”.\nRead: Maltese language faces ‘digital extinction’ – MEP\n ", "comment_count": 5, "id": 4006}, {"keywords": "", "author": "", "article_body": "Maltese businesses are not making the most of potential EU funding opportunities available to them, the Nationalist Party said on Tuesday.\nAddressing a press conference, PN MEP candidate Peter Agius said that while 75 per cent of the EU’s funding budget was distributed by member states’ governments, the remaining 25 per cent was handed out by Brussels, and it was this batch of funds that Malta was not doing enough to tap.\n“Our success rate when it comes to tapping these so-called direct funds has been rather low, especially when it comes to financing projects for businesses,” he said.\nThe PN announced proposals aimed at increasing the utilisation of these funds, ranging from empowering businesses to come up with projects eligible for funding, educational campaigns, and instructing MEPs to pile pressure on EU committees to adapt funding laws to the specific needs of Malta and Maltese businesses.\nIllustrating how, in his view, Maltese businesses are not doing enough to tap funding opportunities, Mr Agius said only five Maltese projects had applied for the EU’s SME Instrument, while similarly sized European regions had applied for more than double.\nEarlier during the press conference, MP Edwin Vassallo said that it had become clear from his visits to Maltese small and medium businesses that while it may be ‘the best of times’ for some - others were finding it hard to make ends meet.\nThe Central Bank latest annual report, he said, had found that the retail sector and industry had edged down marginally.\nWhen it came to outlook, confidence was also an issue, he said. And while tourist arrivals were up, average spending in certain sectors was actually down.\n“So yes, it might be best of times for some - such as those in the construction sector, but the PN cares about those who aren’t doing so well, those who don’t fit in a pigeon hole,” he said.\nMP Robert Cutajar meanwhile, launched an appeal for the government to make the most of every cent of EU funding available to Malta.\nWhile the government had resigned itself to not getting as much in the upcoming EU funding allotment as previous administrations had done, the government should not forget about niche funding opportunities that could make all the difference, he said.", "comment_count": 1, "id": 4007}, {"keywords": "", "author": "", "article_body": "The University of Malta is embarking on ground-breaking work to find solutions designed to be secure against an attack by a quantum computer, which are being sought by the international community.\nIt is teaming up with NATO to seek what are being called ‘post-quantum solutions’.\n“Quantum technology will soon change our security landscape. While this technology could represent a ground-breaking solution to complex problems in a number of fields, its potential can also be disruptive,” NATO said on Tuesday.Its Science for Peace and Security (SPS) Programme is supporting two multi-year projects in which the university will be involved.\n“In the future, quantum technology will be necessary to protect our critical infrastructures and services,” said André Xuereb, project director from the University of Malta. “These SPS projects anticipate this trend and help Malta to prepare for future secure technology.”\nThe first project aims to establish and implement post-quantum cryptographic solutions and protocols for cryptographic computerised communications used to protect sensitive information. Experts from the University of Malta, the Slovak University of Technology, the Florida Atlantic University and King Juan Carlos University of Spain are leading this project.\nThe second project aims to establish a communication channel between Italy and Malta over underwater submarine optical fibres. The link will be developed using existing telecommunications optical fibres with the addition of two portable quantum stations to be installed, one in Italy and one in Malta. In the long run, this project will help protect Maltese critical infrastructures and will pave the way for quantum communications to be used between Malta and Italy.\n\nWhat is the technology about?\nQuantum technologies use the properties of quantum effects – the interactions of molecules, atoms, or photons – to create practical applications in many different fields. While these applications at present are limited to experimental set-ups in some specialised fields (metrology, time-frequency distribution, security, space, automation, etc.), in the future they may expand to cover a wide range of areas, such as computer science, satellite communications, automotive, medicine, etc.Quantum computers for instance can carry much more data than traditional computer systems.\nThis huge computational power theoretically makes it possible for quantum computers to break the traditional cryptographic systems on which current communications systems, such as online bank transactions or telecommunications, are based. Hence the need for post-quantum solutions.", "comment_count": 1, "id": 4008}, {"keywords": "", "author": "Denise Grech ", "article_body": "The European Parliament on Tuesday overwhelmingly voted in favour of legislation requiring EU member states to strengthen laws safeguarding whistleblowers.\nThe legislation sets out a three-tier protection mechanism to safeguard those who expose corruption.\nRead: EU one step closer to stronger whistleblower protection\nThe first tier would look at internal reporting channels, while the second would ensure that the reporting was passed to the competent authorities.\nIn the third tier, if no appropriate action was taken after reporting through these channels or in the case of an imminent or clear danger to the public, the European Parliament suggested the information be passed to the media.\nThe legislation will give greater protections for individuals who wish to come forward when they encounter corruption, Transparency International Senior Policy Officer Nick Aiossa said.\nCrucially, the legislation provides \"much-needed harmonisation\", Mr Aiossa added. Until now, EU countries have had patchwork of protection for those who expose the truth, he added.\n\nThe vote sends a clear message that the EU stands for freedom of speech and against corruption, and that it stands with assassinated journalists and their families, MEP Francis Zammit Dimech said.\n\"A year and a half since the assassination of Daphne we do not know who ordered the killing of Daphne and the family had to resort to the Courts of Justice to seek a public inquiry,\" Dr Zammit Dimech said.\nThe law will also help ensure countries continue to see their rule of law protected, Dr Zammit Dimech said.\nDr Zammit Dimech also noted the Maltese government was only supporting whistleblowers who revealed corruption that pleased it.\nAfter being granted whistleblower status, Gozitan building contractor Joseph Cauchi received a number of direct orders and tenders connected to government school projects, Dr Zammit Dimech said. \nMeanwhile, former FIAU official Jonathan Ferris had to initiate legal action against the authorities after being denied whistleblower status to reveal money laundering.\nSpeaking ahead of the vote, PN MEP David Casa said he has seen how whistleblowers and investigative journalists are vilified and attacked.\n\"Such journalists are professionals, risking their lives and their families’ lives in order to disclose massive irregularities and corruption schemes,\" he said.\n\"Journalists and whistleblowers should be adequately protected. We owe this new legislation for their courage against such adversities,” he added.", "comment_count": 7, "id": 4009}, {"keywords": "", "author": "", "article_body": "The Church in Malta has made an undisclosed donation to the fund for the restoration of Notre Dame Cathedral. The fund was launched by French President Emmanuel Macron in the wake of Monday's fire.\nThe donation was made by Archbishop Charles Scicluna at a meeting with the ambassador of France, Brigitte Curmi.\nMgr Scicluna said he had expressed his solidarity with the people of Paris.Notre Dame cathedral, he said, was an important element of Europe’s Christian culture. As the church of God was built, so too one built a community of friendship and solidarity, the archbishop said. ", "comment_count": 43, "id": 4010}, {"keywords": "", "author": "", "article_body": "A man was injured in a crash involving two cars in St Julian's early on Tuesday.\nThe police said the incident happened at 7am in Triq Mikiel Anġ Borġ.\nIt involved a Peugeot 3008 driven by a 45-year old Korean living in Żejtun and a Toyota Toyace driven by a 37-year-old from Paola.\nThe injured person was a passenger in the Peugeot. ", "comment_count": 0, "id": 4011}, {"keywords": "", "author": "Keith Micallef", "article_body": "Civil servants are being denied financial compensation for any outstanding days of vacation leave after the termination of their employment in breach of EU legislation Malta is obliged to adhere to.\nHowever, the government is resisting calls from the Ombudsman to address this discrimination, while the House of Representatives has given no feedback whatsoever on the matter, despite having been alerted over a year ago.\nThis injustice came to light when two police inspectors who left the force, sought redress after their request to receive the allowance due to them for outstanding vacation in terms of the Employment and Industrial Relations Act was refused. \nIn its reply the People and Standards Division with the Office of the Prime Minister justified the denial on the grounds that such provision was not applicable to members of disciplined forces unless through a specific legal notice.\nThough the Ombudsman acknowledged that such submission was “essentially correct” in virtue of a specific provision in the law, he said that such case alone did not justify inaction on the part of the administration.\nThis remark was made with reference to sub-section 48(1) of the Act which states that the Prime Minister had the power to prescribe the applicability of any article of the Employment Act with respect to civil servants and members of disciplined forces.\nThe Ombudsman also argued that Article 7 of the EU’s Working Time Directive stated that “the minimum period of annual leave may not be replaced by an allowance in lieu, except where the employment relationship is terminated”. This directive was applicable to Malta, as it had been transposed by legal notice 247 of 2003, the Ombudsman noted.\nFurthermore, member states cannot apply for a derogation on the matter – the term used to apply to opt out from a provision.\nIn his submissions, the Ombudsman denounced the position taken by the Division of trying “to bypass or neutralise an EU directive”. He also described as “deplorable” the attempt by the Division to find a solution by advising complainants to agree with management to postpone the termination date of their employment by an equivalent number of days to their outstanding vacation leave.\nSuch conduct amounted to an attempt to condone their breach of an EU directive, the Ombudsman said.\nIn view of this the Ombudsman recommended that Maltese law be brought in line with EU regulations so that the existing discrimination between civil servants and private sector employees would cease.\nHe warned that if no action was taken, he would be recommending to take the case before the appropriate EU institutions, including the European Ombudsman.\nDespite this strong opinion, no progress has been registered, prompting the Ombudsman to refer the case to the Prime Minister. Replying through the Principal Permanent Secretary Mario Cutajar, the Prime Minister said that they stood by their decision.\nIn view of this, the Ombudsman sought another avenue by flagging the case to Parliament.\nA copy of his opinion together with relevant correspondence was sent to the Speaker, along with a formal request to bring Maltese law in line with EU legislation. This opinion was tabled in Parliament on February 7 of last year but to date no progress has been registered.\nIn his annual case notes report, Ombudsman Anthony Mifsud last week expressed concern that this was not an isolated incident and called for this situation to be remedied.\n“One can safely conclude that this statutory procedure provided for in the Ombudsman Act, which was meant to be a final safeguard to provide redress against injustice to aggrieved citizens, is proving to be ineffective,” he said.", "comment_count": 5, "id": 4012}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Department of Contracts and the Finance Ministry have been ordered to reverse a ‘clarification’ issued at the 11th hour regarding the submission for offers for a €17 million cleaning tender at St Vincent De Paul and expressed “serious concern” over what had happened.\nIn a formal decision, the Public Contracts Review Board – the tribunal which acts as an appeals board on public procurement issues – upheld a complaint made by Servizi Malta – a cleaning company – and ruled that the intervention by the government department on the last day of the submission of tenders was “concerning”.\n“This board is somewhat concerned in that the clarification (by the Contracts Department) to reverse the conditions of submissions of offers was issued on the very last day of submission of offers, when all potential bidders were supposed to be in a possession of such (taxation clearance) certificates ready for submission,” the tribunal decided.\n“In this regard, this board will be more comfortably assured of transparency, if the clarification note is completely disregarded and the condition as stated in the tender document stays as it is.”\nIn view of this decision, the Department of Contracts withdrew its ‘clarification’ and extended the period for the submission of tenders until the end of this month.\nLast week, the Times of Malta reported that during the submission for offers for a lucrative cleaning services tender at St Vincent De Paul, the Department of Contracts issued a ‘clarification’ to change the rules of the game.\nThrough this clarification the department said potential bidders did not need to present compliance certificates showing that they were in line with the payment of taxes – income tax, VAT and social security – on the day of submission as requested in the tender.\nInstead, it said that the compliance certificates were only necessary in the case of the winning bidder upon the signing of a contract at the end of the evaluation process.\nAccording to normal rules only tax compliant companies can be awarded government tenders.\nThis unusual decision immediately raised eyebrows among economic operators fearing that this was done in the interests of a particular company.\nThis newspaper has already reported that X-Clean, the incumbent cleaning company at SVDP and which was given €9 million in direct orders by the government facility since 2015, was in the red with all tax authorities and had not paid all its due taxes for years.\nA rival company, Servizi Malta, immediately cried foul with the Public Contracts Review Board which has now upheld its complaint.\nAlthough during the hearing the Department of Contracts tried to justify the issue of its clarification as “a correction to a mistake it made in the tender”, Tribunal chairman Anthony Cassar noted that “once the certificates were originally requested it made one wonder why the requirements were changed”.\nThe PCRB noted that due to the magnitude of the SVDP cleaning tender, it was normal and appropriate to request certificates of tax compliance at tendering stage “so that potential economic operators who satisfy and can produce certificates, at this stage, can be identified and evaluated accordingly, at the evaluation stage.”\n“Such a condition will serve as a filter to the offers which are capable of delivering the tendered works and are in conformity with fiscal and labour regulations,” the PCRB said.\nIndustry sources said the last minute change was made to make a particular company, which was non-compliant with the requirements eligible, to submit its offer and then ‘arrange’ its position with the tax authorities once it was awarded the multi-million tender.\nThe ‘irregular’ cleaning contract at St Vincent De Paul has been in the news for many months.\nThe Times of Malta had reported that X-Clean, a company owned by Denis Xuereb from Naxxar, was given a direct order by the facility in 2015 without a call for tenders.\nDespite that the Department of Contracts had to issue a new tender three years ago, it kept postponing its publication, while approving renewals of the same direct order every few months, stating that the drafting of the tender was complicated and was taking long to conclude.\nIn the meantime, X-Clean started charging the facility more than double the original paid for cleaning services prior to 2015, acquiring over €9 million in taxpayer money for its services.\nIt was only last December, following a series of stories in this newspaper, that a new offer for tenders was issued by the Department of Contracts.\nivan.camilleri@timesofmalta.com", "comment_count": 26, "id": 4013}, {"keywords": "", "author": "", "article_body": "Updated 3.40pm with marina statement\nFirefighters on Tuesday morning quickly controlled a fire which broke out on a motor yacht at Msida marina, preventing the blaze from spreading.\nThe blaze was reported at about 10.15am and a fire engine was deployed within minutes. Civil Protection firefighters quickly extinguished the fire.\nA man was treated for smoke inhalation.\nCreek Developments, which operates the Msida and Ta’Xbiex Marina removed the boats on either side of the motor yacht to prevent potential spread of any fire and enable clear access for the firefighters from Civil Protection.\nIn a brief statement, berthing master George Mercieca said: “As soon as we were alerted to the fire we followed procedure, calling Civil Protection and notifying Valletta Port Control, before moving the adjacent boats to safety and to ensure that the fire was contained. We thank Civil Protection for their very swift response.”\nA major fire destroyed a yacht in Kalkara creek on April 2 and damaged others berthed nearby.\n ", "comment_count": 0, "id": 4014}, {"keywords": "", "author": "Ivan Martin", "article_body": "Pharmacies will soon have a digital register of patients on the Pharmacy of Your Choice Scheme, Health Minister Chris Fearne said on Tuesday.\nOn a visit to the POYC head office at St Luke’s Hospital, Mr Fearne said the new IT system would drastically cut down on patients’ paperwork and allow doctors to update medical information in real-time.\nThe current agreement with pharmacies for the POYC service will draw to a close in the coming weeks, and Mr Fearne said the introduction of this new IT system would be hashed out with union representatives as part of a new agreement.\nThe free distribution of medicines through the POYC scheme has been ongoing for number of years and started in just few localities before it was extended all over the archipelago.\nToday, some 143,000 people are registered on the POYC database, and have received some 250 million products. And the service is growing. Mr Fearne said around 5,000 new patient slips are issued every month, and the service now has an annual budget of €28 million.\nMr Fearne also used Tuesday's visit to announce that the five-year validity of the yellow slip - so called Schedule Five - for patients had been doubled to 10 years, in another bid to slash paperwork.\nCelia Falzon, the chief executive of the POYC service, said the new IT investment would also cover the home delivery of medications for patients over 70 years old. Within the coming year, the database system will be rolled out to nearly every pharmacy in Malta and Gozo, she said.\nTo date 221 pharmacies are registered with the POYC.", "comment_count": 5, "id": 4015}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Preliminary investigations into Sunday night’s double fatal traffic accident indicate that the tiny Maruti was packed with six people, was speeding and veered onto the wrong side of the road prior to the impact.\nSources close to the investigation said that while the exact dynamics of the accident still needed to be established, the account of an eyewitness has shed light on what could have happened on the fateful night.\nThis, along with preliminary tests on the Maruti which excluded any mechanical fault or a burst tyre which could have explained why the car had crossed lanes. \nThe accident, that claimed the life of a mother and her daughter, happened at about 9pm on Sunday as the Maruti 800 was being driven from Mġarr in the direction of Valletta when it crashed into an oncoming Audi A1.\nSources said the collision took place in Triq Temi Zammit, metres away from Triq Buqana which is currently being widened.\nThe Audi ended up in a ditch at the side of the road.\nThe tiny Maruti was packed with six people inside\nThe two victims are Żabbar women Graziella Mallia, aged 53, and her daughter Fallon, 31.\nGraziella Mallia was driving while her daughter was sitting on the back seat right behind her.\nThere were another four passengers in the Maruti which is meant to carry a total of four people, including the driver. They were all taken to hospital for treatment where two passengers, aged 77 and 12 – Fallon Mallia’s son – were seriously injured.  A 44-year-old was slightly injured while a 29-year-old from Sliema was unhurt.  \nThe Audi was being driven by a 31-year-old from Mosta, accompanied by a one-year-old baby and an 11-year-old child, who were seriously injured. Another child, 10, who was also in the car, was slightly injured. \nMeanwhile, Infrastructure Malta has denied that its roadworks had in any way contri-buted to the collision.\nIn reply to questions by the Times of Malta, a spokesman said: “Infrastructure Malta cannot comment about specific incidents subject to police investigations and magisterial inquiries.\n“However, it appears that the indicated head-on collision occurred in the southbound lane of Triq Sir Temi Zammit, where no works are currently taking place. Roadside signs warning road users about the Triq il-Buqana roadworks, and the applicable reduced speed limits, are located in the roads leading to it, at both ends.”\nHe appealed for reduced speed limits to be observed, both for the safety of drivers as well as workers on site.\nmatthew.xuereb@timesofmalta.com", "comment_count": 0, "id": 4016}, {"keywords": "", "author": "Jacob Borg", "article_body": "An appeals tribunal has upheld arguments by Projects Malta and the Data Commissioner against publishing the names of the people on the evaluation committee that judged Vitals Global Healthcare, a shell company with no healthcare experience, to be the best option for running three public hospitals.\nThe Times of Malta had filed a freedom of information request for this data in April 2018.\nProjects Malta had rejected the request on the basis that it was “personal data”, an argument upheld by the Data Commissioner after a complaint was filed by the paper.\nThe Data Commissioner’s Office noted in its decision that the Department of Contracts does not publish the names of the members on evaluation committees during or after evaluation.\nIt said if such information were disclosed, it could prejudice future calls, as potential bidders would be provided with alternative routes of communication for future tenders with possible members of evaluation committees, potentially compromising procurement procedures.\nThe contract, worth over €1 billion over a 30-year period, was not evaluated through the normal procurement channels via the Department of Contracts. Instead, the call for an expression of interest was handled by Projects Malta, an entity falling under the political control of Tourism Minister Konrad Mizzi.\nAssessment of the bids for the running of St Luke’s, Karin Grech and Gozo hospitals took place at a time when Dr Mizzi’s financial advisers Nexia BT were hunting for bank accounts for the minister to use to receive funds through secretive offshore structures set up in Panama and New Zealand.\nA freedom of information request by the Times of Malta in 2018 revealed how Nexia BT managing partner Brian Tonna and several other employees of the financial advisory firm sat on Enemalta evaluation committees for the power station bid won by Electrogas, back when Dr Mizzi was still Energy Minister.\n17 Black, one of two sources of up to $1 million in potential income, was revealed to be owned by Electrogas director and Tumas Group CEO Yorgen Fenech.\nThe owner of Macbridge, the second source of income mentioned in a leaked Panama Papers e-mail, remains a mystery.\nVitals Global Healthcare pulled out of the concession in December 2017.\nThe Shift News had later revealed that while Steward Healthcare bought the shares in Vitals Global Healthcare for €1, millions changed hands behind closed doors.\nOpposition leader Adrian Delia has taken to the courts to get the contracts rescinded.\njacob.borg@timesofmalta.com", "comment_count": 49, "id": 4017}, {"keywords": "", "author": "", "article_body": "The following are the top stories featured in Tuesday's newspapers:\nMost of the newspapers carry front-page pictures of Paris's Notre Dame cathedral on fire.\nTimes of Malta reports on an Infrastructure Malta presentation where experts said better roads will mean more leisure time for drivers. \nThe Malta Independent quotes the Mater Deo Hospital CEO saying 76 medical professionals were called in to assist after Sunday's major traffic accident. \nl-orizzont also gives prominence to the story about improvements to the roads network. It also reports that 50 drug addicts have been given a second chance to reform.\nIn-Nazzjon's main story is about the debate in parliament on Monday on the Greco report on the rule of law in Malta, saying the government is not interested in fighting corruption.", "comment_count": 0, "id": 4018}]