[{"keywords": "Politics, Parliament, Government", "author": "", "article_body": "Updated 11.15am with government reaction\nThe practice of giving government jobs and consultancies to backbench MPs is “fundamentally wrong” and should end, the Commissioner for Standards in Public Life has said.In a new report, Standards Commissioner George Hyzler concludes that the practice dilutes Parliament’s role of scrutinising the government and goes against the Code of Ethics of Public Employees and Board Members and the underlying principles of the Constitution.\nRELATED STORIESMuscat still unable to say how many MPs work for the governmentLegislators and executives: when lines are blurred\nEvery single one of the government backbenchers has been employed or engaged with the government, directly or indirectly, while several opposition MPs are regular employees of government departments or agencies, according to the report. \nInstigated by a complaint from Democratic Party MP Godfrey Farrugia, who asked the commissioner to investigate whether such appointments amount to a conflict of interest, the report concludes that such jobs place MPs in a position of financial dependence on the government, undermining their independence.\nCommissioner for Standards in Public Life George Hyzler\nGovernment MPs are also given an advantage over their Opposition counterparts, while statutory bodies are overly-politicised, and their independence from the government distorted. \nMoreover, the report says the practice exacerbates the “questionable practice of appointment of persons of trust, that possibly goes against article 110 of the Constitution”, and creates unnecessary jobs, or else fills genuine vacancies with persons who are not necessarily best suited for that job, against principles of transparency and meritocracy.\nRELATED STORIESAnother handsomely paid job for former ministerCastille job put Bedingfield's Parliamentary seat ‘at risk’\nThe Commissioner said MPs were generally employed or engaged with the government after being elected to Parliament. Such MPs hold appointments as “persons of trust” or on “contracts of service” in government ministries, or as chairpersons or members of the boards of directors of public authorities, or else they have been given consultancy contracts with ministries or public authorities.The Commissioner noted that giving backbench MPs jobs with government is widely perceived as a means of appeasing those who are not appointed as ministers or parliamentary secretaries, or as a means of compensating them for their low salaries as MPs. He called upon Parliament to address the issue of low remuneration of MPs.\n'Practice started under previous administrations' - government\nIn a statement, the government said the report itself had acknowledged that the same practice had been adopted by previous administrations and concerned MPs on both sides of the House.\nThe government said the Commissioner had also acknowledged legal advice that the practice of appointing MPs as consultants to government or related entities was not contrary to the Constitution.\nThe government also highlighted the Commissioner's remarks that ending the practice would require an increase in MPs' salaries.\nIt said it would be studying the report in further detail. ", "comment_count": 94, "id": 1919}, {"keywords": "Education", "author": "Jacob Borg", "article_body": "Updated 12.25am with NGO reaction\nA report by the Education Commissioner has sounded the alarm about the “worrying and dangerous” phenomena of group-bullying being carried out by “ethnic gangs” in an unnamed school. \nIn the report published by the Ombudsman’s office, the Education Commissioner warned that “curricular dystopia” and troubled social backgrounds was leading to the formation of these gangs. \nIn a statement, NGOs slammed the comments as \"careless and misinformed\", arguing that while the shift to multicultural classrooms had brought tensions, the Commissioner's asssessment was steeped in stereotypes and ignored the increased risks of bullying faced by migrant and ethnic minority students. \nEducation Commissioner Charles Caruana Carabez set about investigating cases of bullying within the unnamed school after noticing the high amount of reported incidents. \n“Though bullying is by no means a recent phenomenon, the Commissioner has data which indicates that there is a link between the number of cases of bullying recorded in a school and the number of students belonging to a particularly nationality in that school,” the report says. \nMr Caruana Carabez said non-Maltese students were being forced to follow curricula which are tailored for Maltese students but are not considered useful by foreign students. \nThis was complicated by the fact that some foreign students cannot even speak or understand Maltese or English with an intermediate proficiency. The language barrier instinctively leads such students into seeking the company of peers from their own country\nThe language barrier instinctively leads such students into seeking the company of peers from their own country, the report continues, and the more students from that particularly country, the larger and more powerful the gang will be. Students’ fraught social backgrounds was another factor identified by the Education Commissioner behind the formation of such gangs. \nMr Caruana Carabez said the troublesome foreign students seem to come from war-torn countries, and may have been brutalised by being exposed to violence at an early age. \nOthers may come from countries whose citizens have been rendered “soulless” by political regimes. \nThe Commissioner also noted how students coming from a family background that was “far from ideal” were also prone to trouble. \n“The latter is becoming increasingly applicable to Maltese students, who, of course, form an obviously numerically-important part of the school environment. Vast cultural differences also play an important role,” the Commissioner said in the report. \nThe Commissioner expressed his belief that the root cause aggravating the problem also lies in the fact that a school which was conceived and administered as a normal secondary school, had suddenly turned into an international school though “suddenly changed demographic circumstances”. \nHe said this happened without the school having the necessary structures, curricula or human resources suitable for it to operate as an international school. \n“Malta’s population underwent a significant change in that the number of foreign expatriates increased dramatically and within a relatively short period as a result of geo-political upheavals and economic turmoil in both Europe and Northern Africa, and a sizable proportion of these foreign expatriates who work or seek refuge in Malta have families with children who need education. \nMr Caruana Carabez expressed his belief that the setting up of a centrally-located international school where the students were taught in their own language and their particular cultures form part of the curriculum would go a long way to eliminate the “aberrant behaviour” emanating from boredom and subject irrelevance. \n“The Commissioner is aware, however, that this solution is fraught with difficulties and would offer a considerable challenge to the government,” Mr Caruana Carabez concluded. \n'Commissioner seems to be advocating for segregation' - NGOs\nIn a statement, a group of 19 human rights and social justice NGOs acknowledged that the transition to multicultural classrooms had been \"marked by tension and struggle\" and insisted the challenges faced by educators, administrators and students could not be ignored. \nHowever, the NGOs said the Commissioner's analysis provided a \"one-sided perspective\" that ignored growing evidence based on the experiences of migrant and ethnic minority students. \n\"It is disconcerting that his evaluation appears to be steeped in cultural stereotypes and hearsays that fail to capture the complexity of the context,\" the groups said. \n\"We also note that the Commissioner ignores the demonstrated strengths and benefits of the pluricultural and plurilingual classroom. We believe that a classroom environment embracing different worldviews and cultural practices, encourages students to absorb knowledge and skills necessary to navigate an increasingly globalised world.\n\"Instead, the Commissioner seems to be advocating for separation and segregation.\"\nThe NGOs highlighted the fact that the 2014 national policy on bullying had identified migrant and ethnic minority children as vulnerable and more susceptible to bullying, and lamented that the Commissioner had not assessed whether this policy was achieving its aims in safeguarding victims of bullying. \nThey also questioned why no mention had been made of the fundamental human right to education, in light of the Commissioner's core duty to improve the educational services for all members of the community, especially the most vulnerable.\n\"The undersigned non-governmental organisations therefore flag the Commissioner’s report as inappropriate. We invite the Office of the Ombudsman and the House of Representatives not to take note of his key findings and recommendations. Our children deserve better. Our students deserve better.\"\nThe statement was signed by aditus, the African Media Association, Catholic Voices Malta, The Critical Institute, the University of Malta education and social wellbeing faculties and the gender studies department, the Foundation for Shelter and Support to Migrants, the Integra Foundation, Isles of the Left, the Jesuit Refugee Service, Kopin, the Malta Emigrants Commission, Moviment Graffitti, The People for Change Foundation, Richmond Foundation, Right 2 Smile, Solidarity with Migrants Group and Spark 15", "comment_count": 90, "id": 1920}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Saturday's newspapers:\nTimes of Malta reports that a jury rejected the legal insanity plea of murder suspect Michael Emmanuel, who is accused of killing his 35-year-old partner Maria Lourdes Agius in September 2018. It also reports the announcement of an eventual licensing set-up for building contractors. \nThe Malta Independent quotes Air Malta pilots' claims of threats by the airline's flight operations chief, from a court hearing on the pilots' industrial action. It also reports that a migrant rescue ship is stranded off Lampedusa with 55 aboard after being denied entry. \nL-Orizzont reports that Nationalist MPs opposed to Adrian Delia intend to argue against the party leader continuing on if he fails to secure backing of 70 per cent in an upcoming confidence vote. \nIn-Nazzjon reports on the first official meeting between Adrian Delia and Louis Galea, who has just been appointed to lead a reform of the party.", "comment_count": 0, "id": 1921}, {"keywords": "Planning Authority, San Ġwann", "author": "Philip Leone Ganado", "article_body": "More than 250 objections have been lodged against a large residential development in Mensija, San Ġwann, before the close of public consultation, amid concerns over the impact on the area’s natural and cultural heritage. \nA planning application in Triq is-Santwarju, close to the scheduled 17th-century Mensija Chapel and the 15th-century Lanzun Tower, seeks to build a complex of 39 luxury apartments and pools over five floors. \nThe site is within development zones but is located along a ridge overlooking Wied Għomor, a scheduled area of ecological importance.\nResidents’ objections to the project, many of which were filed under a standard petition form, highlight the environmental and social impact such intensive development would have on the surrounding community.\nThey also highlight concerns over several caves that lie in a unique green sinkhole a few metres away from the edge of the proposed development.\n“The protected and fragile caves characteristic of the area and which partially form part of the Mensija Chapel, which is so special and unique, risk being damaged with the excavation works for a development of this size which includes three underlying car parks and basement residences,” residents said.\nObjectors also point out that previous applications for much smaller developments on the same site have been rejected by the Planning Authority in the past, and argue that aspects of the proposal are in breach of planning policy. \nSan Ġwann mayor Trevor Fenech told Times of Malta the newly installed local council had not yet had time to adopt a position on the proposal and was seeking advice before discussing it at a future council meeting. \nMr Fenech said the council would be taking note of residents’ objections but said its position would ultimately be determined by the project’s adherence with policy, noting that it lay within the development zone. \nThe Superintendence for Cultural Heritage has already raised concerns about the project, noting the area’s high cultural and historical value, characterised by a cluster of buildings forming a hamlet already visible in 1908, and marked by the scheduled Mensija Chapel and Lanzun Tower. The heritage watchdog also noted the presence of caves and the Mensija cart ruts nearby, and expressed concern over the scale of the project and the impact it might have on the cultural landscape, including views and vistas to and from the scheduled sanctuary.\nThe PA is expected to decide on the project in September.\nThe area of the proposed development in Mensija", "comment_count": 8, "id": 1922}, {"keywords": "Education, Government", "author": "Claire Caruana", "article_body": "The teachers’ union and the Education Ministry are set to meet to discuss the phasing out of the end-of-primary exams, days after the union said it was sceptical about the changes. \nLast week, Education Minister Evarist Bartolo announced the removal of the so-called benchmark exam, where students in their last year of primary school take formal tests before moving up to secondary school. \nInstead, the education system is to focus more on ongoing assessment and a more ‘informal’ approach that does not revolve around examinations. Yet, while the ministry insists it discussed the matter with all stakeholders, the Malta Union of Teachers claims the announced changes are being made “out of the blue”. \nContacted about the matter, MUT president Marco Bonnici told Times of Malta the union’s position remained “unchanged” but it would be meeting with the government soon.\n“This week the MUT had a number of meetings with the ministry but not on the benchmark changes. Meanwhile, the MUT was invited for a meeting on this issue, which is scheduled for the coming days,” Mr Bonnici said.\nAhead of the proposed change, 25 recommendations were put forward by the government’s Benchmark Review Board, including greater use of digital technologies and pitching the informal exams at two levels of ability. The body also outlined time frames when the different changes should be rolled out, with the phasing out of the system currently in place to be finalised by 2021.\nNumber of parents argued the issue was very subjective\nAccording to a report by the board outlining the changes, a number of focus groups consisting of parents, as educators and other stakeholders were held. \nInformed sources familiar with what went on in these groups told Times of Malta that reactions had been varied.  While some were completely in agreement with the notion of dropping formal exams and switching to a more informal approach, others insisted students needed exams to succeed. \nThe sources also pointed out, however, that a number of parents argued the issue was “very subjective”. They insisted that the effectiveness of the different methods of teaching varied from one child to another.\nSome parents, the sources added, openly stated during the focus group that while exams worked for one of their children, the same could not be said for their other child.\nMeanwhile, the Maltese Association of Parents of State School Students (MAPSSS) wants the authorities to study how the change will impact the children’s post-secondary trajectories and other high-stake exams such as SEC. The body has also called for a “thorough analysis” of the long-term impact of the removal of the end-of-primary benchmark exam.\nclaire.caruana@timesofmalta.com", "comment_count": 2, "id": 1923}, {"keywords": "Traffic, Accident", "author": "", "article_body": "A 61-year-old motorcyclist from Xewkija, Gozo, was seriously injured on Friday evening when he was hit by a car in Attard.\nThe police said the accident happened in Mosta Road at about 6pm.\nThe car, a VW Golf, was being driven by a 39-year-old woman from Attard.\n ", "comment_count": 1, "id": 1924}, {"keywords": "Luqa, Statistics", "author": "Claire Caruana", "article_body": "The biggest number of social security beneficiaries in recent years hailed from Luqa, with other localities from the Southern Harbour district also topping the list. \nIn a comprehensive publication issued by the National Statistics Office, outlining the situation regarding social protection in 2016, it emerged there were 165,815 persons who received some form of benefit.\nThis translated to about 36 per cent of the entire population, with more than half of these recipients being female. Over three-quarters of the €1.7 billion budget for social protection in 2016 was spent on old age and health benefits.\nAccording to the NSO’s report, in 2016, the locality with the largest proportion of beneficiaries was Luqa (533 persons per 1,000 inhabitants), 39 more persons than second-highest, Floriana (494 persons per 1,000 population), with Valletta (477 persons per 1,000 population) placing third. \nAt the other end of the scale, Swieqi ranked lowest among the 68 localities, with only 196 persons receiving a social benefit for every 1,000 of its inhabitants. The NSO researchers also pointed out that the presence of institutional homes for the elderly in certain localities may have had an effect on the data. \nOn year-on-year changes, the NSO data showed that between 2008 and 2016, social security beneficiaries gradually rose by 13.4 per cent. \nAll six districts registered an increase in beneficiaries with the Northern (5,000) and Northern Harbour (4,286) districts displaying the largest rises, the statistics office said. \nAccording to the publication, more than half (54.6 per cent) of Malta’s 2016 social protection outlay was made up of cash benefits which are not subject to means-testing.\nIn the year under review, beneficiaries received an average of €4,823 in social security benefits.\nThe Northern Harbour district listed the highest average social security benefits per beneficiary at €5,239, while the Northern district registered the lowest amount. Beneficiaries residing in this district received an average of €4,181 in social security benefits. \nAt a local level, social expenditure ranged from an average of €6,921 paid to Gudja recipients to €2,832 received by beneficiaries living in Għaxaq. ", "comment_count": 9, "id": 1925}, {"keywords": "Court, Murder", "author": "", "article_body": "A jury has rejected a murder suspect's plea that he was legally insane when the crime was committed.\nMichael Emmanuel, 29, is accused of murdering his 35-year-old partner Maria Lourdes Agius in September 2018. He had pleaded legal insanity when proceedings started against him, but the plea was challenged by the Attorney General. \nThe jury on Friday threw out the legal insanity plea.\nAs a result, Mr Emmanuel will now appear before the Magistrates Court, where the compilation of evidence against him will resume.\nRELATED STORIES'I love you' - Mother describes how she found her murdered daughter in bedMurder suspect suffered acute psychosis - psychiatrist\nMother-of-seven Ms Agius was found dead in her bed with heavy bruising around her neck. Mr Emmanuel had reported to police that she was not waking up.\nPolice investigators told the court that during interrogation, Mr Emmanuel said that on the night of her murder, Ms Agius told him he was not the father of her youngest child.\nLater that night, she had put a crucifix on her neck and asked him to “press a little”, Mr Emmanuel allegedly told officers.\nMr Emmanuel had filed a not guilty plea and argued that he was legally insane at the time of the murder.\nEarlier this week, a psychiatrist testified that Mr Emmanuel had some delusions of grandeur and appeared to be paranoid about his partner.\nThe psychiatrist said he appeared to be suffering from “acute psychosis and was therefore insane according to the Criminal Code”.\nThe defence gave notice of appeal.\nLawyers Matthew Xuereb and Charles Mercieca and Inspector James Grech prosecuted. ", "comment_count": 0, "id": 1926}, {"keywords": "Court, Tourism, Transport", "author": "Edwina Brincat", "article_body": "A decision by Air Malta pilots to call industrial action last Monday had nothing to do with early retirement funds, a court heard on Friday.\nRather, the union was insisting that one of the airline's representatives should withdraw from collective agreement talks because of what was viewed as a disruptive attitude.\nThe union was also calling for the restoration of a health insurance scheme for pilots.\nALPA, the pilots' union, on Monday ordered its members to delay flights by 30 minutes but a court subsequently issued a temporary warrant of prohibitory injunction until the case was heard.  \nTourism Minister Konrad Mizzi had said that the issue was over a pilots' demand for a guarantee that they would get an early retirement sum of €700,000, even if the airline folded.\nBut union representatives indicated on Friday that was not the issue.\nThey told the court that their negotiations with Air Malta were failing on account of the presence of chief flight operations officer Emvic Debono, whose withdrawal had been requested but was ignored.\nCaptain Matthew Degiorgio, representing ALPA, testified that the union had formally requested Capt Debono’s withdrawal from the talks on June 18.\nThis request, however, went unheeded and Captain Debono continued to take an active role in negotiations, attending the last two meetings right up to June 28.\nThreats to union officials\nCapt Degiorgio said the airline officer’s resignation was also being sought on account of unfounded threats of disciplinary action against members of the ALPA executive committee, including himself.\nTwo other members of the executive committee had also been threatened with disciplinary action, one of them after being ordered “illegally” to fly to St Petersburg.\nEventually, all three cases of disciplinary proceedings had been withdrawn because they lacked basis.\nCaptain Degiorgio said the decision to take industrial action had been taken “in the best interests of both parties” since Captain Debono was viewed as an “impediment and a hindrance for talks to be concluded,” and failed to enjoy the trust of both sides at the negotiating table.\n“It was only because Air Malta persisted in sending Emvic Debono as its mouthpiece in the discussions that were doomed to fail,” Captain Degiorgio stressed when asked directly by Mr Justice Toni Abela, as to why industrial action had been resorted to.\nFollowing the last meeting of June 28, the union had sent a WhatsApp message to a closed group chat putting pilots on notice to be ready to take industrial action from July 1.\nThat communication had somehow been leaked to Air Malta management, Captain Degiorgio testified.\nReference was also made during Friday’s sitting to the “guarantee” reportedly requested by ALPA concerning the early retirement scheme payment of €700,000.\nCapt Degiorgio said that the only guarantee on the negotiating table related to a permanent health insurance which had been ‘lost’ when their collective agreement was revised. The union was insisting that it be restored\n“Did you discuss any other guarantee by the state?” Dr Ronald Galea Cavallazzi, representing the airline, asked.\n“I did not,” replied Captain Degiorgio, adding that there had been no official meetings with the authorities on this issue.\nDr Galea Cavallazzi argued that an email of June 18, when the union formally requested Capt Debono’s withdrawal, was nothing but an excuse for industrial action.\nHe insisted that the union had “no divine right to take industrial action” and legal and contractual limitations had to be respected.\nAir Malta's damages as a result of industrial action\nAir Malta’s Chief Commercial Officer, Paul Sies, said the airline risked making an estimated daily loss of €160,000 if the industrial action went ahead.\nHe said that the pilots’ action had disturbed airline bookings since passengers chose not to fly with the airline or delay booking. Besides, code-sharing partners had indicated that they would re-evaluate their partnership if the situation continued.\nRebutting, Captain Degiorgio said the 30-minute delay would not have negatively impacted the airline to such an extent since Air Malta flights had an average delay of 19 minutes and thus their 11-minute extension would not have caused such impact.\nBesides, on July 1 the airline had planes stuck abroad due to inclement weather.\nUnion committee members sued by airline\n“This is a David and Goliath situation,” Dr Andre' Portelli, ALPA counsel, argued, pointing out further that the five members of the union’s executive committee had been sued in their personal capacity, exposing them to the risk of possible freezing of assets if the request for an injunction were to be upheld.\nThe court noted that the five were being sued in their capacity as representatives of ALPA.\nAt the end of the three-hour hearing, the court declared that it would issue its decision in chambers.\nMr Justice Abela pointed out that the law allowed one-month limit for the delivery of such a decree. He urged both sides to make good use of this time to seek an amicable solution.\n“This is a national airline. There are no winners or losers in a court case. Take this opportunity to seek a solution so that goodwill might prevail, he said.", "comment_count": 18, "id": 1927}, {"keywords": "Environment, Planning Authority", "author": "Ivan Martin", "article_body": "A coalition of NGOs fighting to save Dwejra from further development have raised the funds they need to fight in court a decision to grant a restaurant a permit extension.\nIn a statement, the 15 NGOs said that following the “scandalous” decision by the Environment and Planning Review Tribunal to overturn the Planning Authority's refusal for further development in Dwejra, the public had donated more than €3,000 for a court appeal to be filed.\nThe funds were raised through crowdfunding in just two days. Dwejra, in Gozo, is a Natura 2000 site and is also designated a Dark Sky Heritage Area.\n“At night this place can give spectacular views of the dark sky and stars while the iconic Scopoli’s Shearwater use the cliffs as their breeding habitat,” the NGOs said, adding that light pollution and increased development would damage the area.\nThe establishment in question, Azure Window Restaurant, had applied to install a canopy on an outdoor terrace to provide a few more tables and chairs outdoors.\nAlthough the original application had included the phrase “installation of light”, the applicant Godwin Cassar told Times of Malta that this had been amended and that no new light fittings would be added.\n\"All of this negative publicity has really taken a toll on me and my business,\" he lamented.  \nHe insisted that an engineer’s report, submitted as part of his appeal, had concluded that not only would light pollution not be increased by the installation of a canopy, but it would actually be reduced.\nHis detractors on the other hand, charge that the existing light fittings do not conform to the original permit for the site.\nBoth BirdLife Malta and the Institute of Space Sciences and Astronomy had officially objected to the development proposed and hence have the right to now appeal it in court.\n“Not only does this successful fundraising campaign pave the way for the court appeal, but it also sends a clear message that civil society is strong and a force to be reckoned with,” the group said.\n“The NGOs would like to thank the people for their support which motivates them further to fight for this cause, while promising to remain fighting to safeguard the natural and cultural heritage of our islands for the benefit of all,” they added.\nEnvironment Minister Jose Herrera has also indicated he disagreed with the Tribunal decision and encouraged objectors to appeal \"for the best interest of the environment\".\nThe 15 NGOs:\n- Bicycle Advocacy Group- BirdLife Malta- Din l-Art Ħelwa- Flimkien għal Ambjent Aħjar- Friends of the Earth Malta- Isles of the Left- Light Pollution Awareness Group- Moviment Graffitti- Nature Trust Malta- Ramblers Association- The Archaeological Society Malta- The Astronomical Society of Malta- The Institute of Space Sciences and Astronomy- Wirt Għawdex- Żminijietna - Leħen ix-Xellug", "comment_count": 6, "id": 1928}, {"keywords": "PN, Adrian Delia", "author": "", "article_body": "Nationalist Party leader Adrian Delia has appointed party stalwart Louis Galea to head AŻAD, the Academy for Development of a Democratic Environment.\nThe Nationalist Party said Dr Galea was handed the appointment during a meeting with Dr Delia on Friday morning, a few hours after the PN executive agreed to Dr Delia's suggestion for the former minister to head a reform of the party.\nAŻAD is the unofficial PN think-tank.\nPN general secretary Clyde Puli was present for the meeting with Dr Galea.\nIn subsequent comments to Net News, Dr Galea said he had several meetings with Dr Delia before Thursday's meeting of the executive and had discussed various ideas.\nHe would now lead a reform process which would include all those within the party and the country who wished to help so that the PN could stand on its own feet. This, he said, was in the interests not just of supporters, but the country as a whole.  \nAŻAD was set up by PN stalwart (later foreign minister and President) Ċensu Tabone in 1976, shortly before Louis Galea became general secretary of the PN. Simon Busuttil, later PN leader, headed it in 2010.\nDr Galea was PN general secretary between 1977 and 1987 and, under party leader Eddie Fenech Adami transformed the PN into a slick political machine.\nFollowing the PN's election in 1987 he became social policy minister. He became minister of social development and home affairs in 1992 until 1996.\nAfter the PN was re-elected in 1998 he was Minister of Education, serving until 2008, when he surprisingly failed to get re-elected.\nHe served as Speaker of the House of Representatives for two years before serving on the European Court of Auditors. \nSee Dr Delia's letter of appointment and Dr Galea's reply on pdf below. ", "comment_count": 19, "id": 1929}, {"keywords": "Accident, Traffic", "author": "", "article_body": "A Fiat Uno flipped on its side on Friday afternoon, in a jolting incident which thankfully left nobody injured.\nEyewitnesses said the car turned over after its driver hit the pavement early on Friday afternoon.\nThe accident happened on a slip road leading to the Birkirkara bypass at Tal-Qroqq.\nGot an interesting picture? Send it to mynews@timesofmalta.com or Facebook Times of Malta.", "comment_count": 0, "id": 1930}, {"keywords": "Police", "author": "", "article_body": "Two police officers were slightly injured in an incident involving another man at the main reception of Mater Dei’s emergency department on Thursday night.\nA hospital spokesman said there had been \"inappropriate behaviour\" and damage to the reception area.\nNo hospital staff were injured and police are investigating.\n ", "comment_count": 9, "id": 1931}, {"keywords": "Society", "author": "", "article_body": "A pro-life foundation has described a statement by the Commissioner of Children about the protection of children before birth as “manifestly incorrect”.\nPauline Miceli has argued that the United Nations Convention on the Rights of the Child does not outline when life is considered as having started. \nThe Pro-Life Foundation said it had “profound concern” about her comments.\n“Contrary to the Commissioner’s pronouncement, it ought to be pointed out that Article 9(h) of the Commissioner for Children Act states most clearly that one of the functions of the Commissioner is ‘to promote the highest standards of health and social services for women during pregnancy and to promote special care and protection, including adequate legal protection, for children both before and after birth’,” it said.\nThe foundation said this made it clear that Maltese law directly contradicts the Commissioner – and that the Commissioner was “either unaware of the law or has chosen to overlook it”.\n“Article 9(h) of the Act accurately reflects the content of the Preamble to the Convention, which clearly recognises the child prior to birth as a child and a recipient of rights, including, very specifically, the right to life,” it added.\nMs Miceli told Times of Malta earlier this month that she was choosing to stay out of the controversy over the protection of the unborn.\nThe Convention does not outline when life is considered as having started, she said, and despite 30 years of discussion on the issue, the matter had not yet been resolved.\n“There are those who believe the child starts enjoying rights at conception, others say at some point throughout the pregnancy and others when the baby is born. The Office believes it should not be part of this controversy and follow the Convention.”\nThe Commissioner has also said that unborn children should be better protected by introducing better antenatal health and social services and stronger family units rather than through changes to the law.\nRELATED STORIESChildren's Commissioner stays out of 'unborn' controversyInclude the unborn in the protection of minors\nThe statement came a day after PN MP Claudio Grech argued in parliament that a child protection bill which legislators are discussing should be amended to ensure that “foetus” [tarbija fil-guf] was included in the definition of “minor”.\nThis, Dr Grech argued, would send a “strong signal” that the unborn deserved equal protection as human beings.\n ", "comment_count": 0, "id": 1932}, {"keywords": "Daphne Caruana Galizia", "author": "Philip Leone Ganado", "article_body": "Dramatising the life and work of a figure as influential and divisive as Daphne Caruana Galizia is no straightforward task: how to present a fair and honest characterisation of someone who so radically split opinion?\nThe new BBC docudrama Daphne: A Fire in Malta, which ends its five-episode run on Friday, attempts just that: giving life to the journalist's investigations and the events leading up murder in a car bomb in 2017.\nThe aftermath of the car bomb that killed Daphne Caruana Galizia in October 2017\nDefining Daphne\n“What I aimed for was emotional and psychological complexity; for the character to be surprising and engaging,” playwright Lizzie Nunnery, who wrote the script for the docudrama, told Times of Malta. “We live in times when the media and online world too often polarises issues and personalities, compromising thoughtful debate. A play can offer a more subtle, humane, and measured approach that allows listeners to draw their own conclusions. Undeniably Daphne's tenacity and impressive energy are present in the storytelling.”\nStarring Game of Thrones actress Michelle Fairley in the role of Daphne, the series describes itself as an “attempt to piece together a picture of what might have happened behind the headlines” and begins each episode with an acknowledgement: “There is much we cannot know and much we had to imagine.”\nMichelle Fairley, known for playing Catelyn Stark in Game of Thrones, plays journalist Daphne Caruana Galizia\nFact and Fiction\nIn researching the drama, Ms Nunnery visited Malta and met various people who knew Ms Caruana Galizia, speaking to colleagues and acquaintances and digesting a huge amount of writing from those for and against her work. But while the series is structured around true events - threats from the far-right in 2005, Ms Caruana Galizia’s arrest before the 2013 general election, the Panama Papers and Egrant stories in recent years - conversations, relationships and moments from her investigations are all fictionalised.“Using the evidence of her journalism, I imagined the path she might have followed to get to the information she presented publicly,” Ms Nunnery said of the many meetings with sources depicted in the series.\nDaphne Caruana Galizia, pictured at Mosta Police Station in 2013 after being arrested for breaching the pre-election media blackout\nSome of these imaginings may be only slightly removed from truth: Ms Nunnery said the character of an editor whom Daphne berates for refusing to publish a story is fictionalised, but illustrates mounting frustrations which led to her starting her blog. Others are more speculative: such as a meeting with a source in the Maltese financial sector who provides information that actually emerged from the international Panama Papers leak, or a two-hour stakeout of the gaming authority for a comment on financial fraud.\nMixed legacy\nAnd while the series is clearly focused on what Ms Nunnery called the “thematic debate around freedom of speech, democracy and alleged corruption” it does not altogether shy away from criticism of Ms Caruana Galizia’s work.Her equal readiness to cover government corruption or a salacious affair is referred to in one episode, in others her husband questions her use of “bullying language” and her reliance on a single source for a major story, while a confrontation with a political opponent in the street brings up accusations of classism and unwarranted personal attacks. Nevertheless, the series - or the decision to embark on one at all - has been criticised as a form of whitewashing of her legacy: MaltaToday editor Saviour Balzan, a long-time critic of Ms Caruana Galizia, hit out at it for “portraying her as some sort of saint on earth”.\nLizzie Nunnery, who wrote BBC docudrama Daphne: A Fire in Malta\nAsked about this, Ms Nunnery suggested the criticism - which came before all episodes had aired - were less a response to the series itself than to the broader context surrounding it. “There are many moments in the series when other characters challenge or question Daphne's actions or assumptions. I tried hard to show the complex public figure she was in Malta, and what fuelled the passionately different opinions of her,” Ms Nunnery said. “The motivation in making the series was to explore a resonant and complex human story, presenting important questions about society and the individual that travel far beyond Malta. I hope we succeeded.”\nVigil calling for justice for Daphne Caruana Galizia at the site of her murder in Bidnija.", "comment_count": 0, "id": 1933}, {"keywords": "Politics, Court", "author": "Jacob Borg", "article_body": "A court has labelled ministers Konrad Mizzi, Chris Cardona and Edward Scicluna as being “extremely evasive” about the origins of a quote from an unpublished section of the Egrant report.\nThe ministers quoted this unseen passage from the report in their reply to a demand in court by activists to start an inquiry into the awarding of a lucrative contract for the running of three public hospitals to Vitals Global Healthcare (VGH).\nRELATED STORIESMinisters must be made to exhibit Egrant inquiry copies in court - Repubblika\nRuling on a request by NGO Repubblika asking that the ministers clarify where the quote from the Egrant report came from, magistrate Claire Stafrace Zammit said the ministers had been “evasive” in their reply.\nThe court sternly noted how the ministers potentially having access to unpublished sections of the report could be a very serious matter.\nIt, however, conceded that the ministers had a right to remain silent, and the court could not force them to reveal where they got this information from.\nThe full Egrant inquiry has never been made public.\nMagistrate Stafrace Zammit, who received the request for an inquiry from the NGO in May, said it was not within her mandate to take the matter any further, as her job was limited to ruling on whether there was enough evidence to merit an inquiry into the VGH affair.\nSeeing that the ministers had not indicated where the quoted passage came from, Dr Stafrace Zammit said the court would not take any notice of the passage in question when taking the final decision as to whether a VGH inquiry was merited or not.\nRELATED STORIESDelia's lawyers demand Egrant explanation from three ministersActivists file court action to force ministers to exhibit documents\nLast July, Prime Minister Joseph Muscat had promised to publish a full version of the Egrant report “within days”.\nDr Muscat has since failed to make good on this pledge, citing ongoing investigations into the case as the reason why the full version had not been published.\nAttorney General Peter Grech has only published 49 pages of the voluminous 1,500-page report.\nThe section quoted by the three ministers was nowhere to be found in these 49 pages.\nAccording to the excerpt quoted by Dr Mizzi, Dr Cardona and Prof. Scicluna, Police Commissioner Lawrence Cutajar had been ordered to investigate who had forged signatures linking the Panama shell company to the Prime Minister’s wife. The inquiry, led by Mr Justice Aaron Bugeja before he was made a judge, found no evidence linking Ms Muscat to Egrant.\nAllegations that substantial amounts of money had been transferred via Pilatus Bank to Egrant and other shell companies owned by Dr Mizzi and the Prime Minister’s chief of staff Keith Schembri proved to be false.\nDo you have confidential information you would like to leak to us? Contact us securely.", "comment_count": 0, "id": 1934}, {"keywords": "Construction", "author": "Jacob Borg", "article_body": "Infrastructure Minister Ian Borg on Friday announced the setting up of a registry of contractors that would eventually lead to a licensing process.\nSpeaking during a press conference, Dr Borg said the first step of this process was starting a registry of contractors, which he likened to a “directory” where one could find basic information about the contractor and his experience.\n\nDr Borg said the government had received a commitment from the Malta Developers’ Association (MDA) to cooperate with the setting up of this registry.\nRegistration of contractors would start from next Wednesday, the minister continued.\nDr Borg said that by the end of the year, work would begin on licensing those contractors on the registry.\nAsked by Times of Malta if contractors signing up to the registry as of next week would be vetted, Dr Borg said this would take place at the licensing stage.\n“This is not about vetting. It is about information and data sharing, which did not even exist prior to this. What you are asking about will come at the end of the year, through a licence. Without a licence, you will not be able to operate”, Dr Borg said.\nRELATED STORIESBuilding regulations overhaul needs register of contractors - architects\nQuestioned who would be running the registry, MDA president Sandro Chetcuti interjected, saying he would insist that the registration would be handled by his association.\nDr Borg in turn said the call for registration would be handled by the Building Regulation Office.\nMr Chetcuti heaped praise on the minister for taking action to regulate and improve the industry.\n“Today we will be elevating the industry another notch”, the MDA president said.\nHe said the few “incompetent” stakeholders within the industry would soon be stamped out thanks to these reforms.\nChamber of Architects and Civil Engineers president Simone Vella Lenicker welcomed the introduction of the registry and thanked the government and MDA for its cooperation.\nShe pointed out how, according to the civil code, architects and contractors shared joint responsibility in the construction process, yet contractors were not licensed.", "comment_count": 23, "id": 1935}, {"keywords": "Pembroke, Environment, Planning Authority", "author": "Denise Grech ", "article_body": "The db Group said it has 'reactivated' a Planning Authority permit for the City Centre project on the former ITS site.\nThe €300 million project, which would include a 37-storey tower, 17-storey hotel hotel and shopping complex at the St George's Bay site, had its planning permit nullified by a court last month. \nThat decision revoked planning approval granted in September, despite an unprecedented 4,500 objections from the public, local councils and NGOs.\nIn its decision, the court ruled that one of the Planning board's sitting members, Matthew Pace, stood to gain from the project being approved, as he owned a real estate agency selling properties in the project. \nMr Pace is a franchise owner of Remax Alliance Swieqi, which shared a database and website with Remax Malta.\nRELATED STORIES‘I will not resign from PA board’ – Matthew PacePA approves 38-storey db Group tower by 10 votes to four\nThe db Group had initially declined to comment on the court decision, with group chairman Silvio Debono saying he was discussing \"the way forward\" with company lawyers.\nPermit reactivated with fresh plans\nOn Friday, the company said it was reactivating the project's application for a full permit \"with some alterations and rescaling which have been in gestation since the original permit was issued last September\".\nThe application will be filed under the same Planning Authority number, but with fresh plans. \nIn its statement, the company emphasised the basis on which the court had decided to revoke the City Centre project's permit. \n\"The revocation was based exclusively on one, single point- that the court deemed a member of the adjudicating board had a conflict of interest,\" the db Group said in a statement. \"Clearly, this had absolutely nothing to do with the db Group and even less so with the project itself,\" it said.\nThe court, it insisted, steered clear of the merits of the permit itself. \"At no point did it express a view against it, how it was issued or about the db Group itself,\" it said. \nAt no point did it express a view against [the permit], how it was issued or about the db Group itself- db Group\nThe db Group said it had rigorously followed all applicable laws and procedures throughout, and would continue to do so. \n\"It is with this same approach that we shall ensure that our Group enjoys its full rights at law, the same ones enjoyed by others,\" it said. ", "comment_count": 19, "id": 1936}, {"keywords": "Accident, Naxxar", "author": "", "article_body": "One of two passengers in a car involved in an accident on the Coast Road was left seriously hurt, with the other passenger and the driver escaping injury.\nThe car was being driven by a 22-year-old man from Swieqi, who lost control of the vehicle and hit the crash barriers, police said.\nThe passengers are both from Bangladesh, with the one who was hurt aged 30.\nThe accident occurred at 5.15am on Friday.\nPolice investigations are still under way.", "comment_count": 0, "id": 1937}, {"keywords": "Construction, Government", "author": "Jacob Borg", "article_body": "Infrastructure Minister Ian Borg has vowed to continue pushing for wider reforms in the construction industry, a week after a new law was ushered through in response to a spate of building collapses linked to adjacent construction works. \nAmong other changes, the new law saw the introduction of a site technical officer to oversee construction and demolition works at critical junctures. \nThe Chamber of Architects and Civil Engineers has accused the government of placing much of the burden on them, and also failing in its duty as a regulator. \nSpeaking to Times of Malta, Dr Borg said the new laws were there to stay. \n“This is the law and everyone needs to abide by it”. \nHe said the newly introduced legal notice was part of a much wider reform. \nThe minister said the government was working on introducing a register of contractors and giving more teeth to the regulators. \nFormer Chamber of Architects president Christopher Mintoff highlighted in June how key personnel on a construction site, including demolition contractors, crane operators and concrete pourers, among others, did not need any credentials to carry out their work.\nDr Borg said works on construction sites where architects had certified there were no issues had already got under way following the introduction of the new rules.\nThis is the law and everyone needs to abide by it\n“What interests me is never having to see bedrooms dangling dangerously with people inside them. What interests me is people’s safety,” Dr Borg said. \nAn overhaul of the rules governing the construction sector was prompted by a number of near misses which saw dramatic building collapses while the residents were still inside. \nLuckily, there were no serious injuries in the recent incidents, although many of those affected are still struggling to get on with their lives. \nAsked if any sites had been certified as unsafe, Dr Borg said it was his understanding that on sites where work had not continued, developers were likely still awaiting an architect’s assessment.\nHe said the new law required a more rigorous investigation of both the construction site and neighbouring sites. \n“What is certain is that the construction works under way have been certified as safe by an architect,” Dr Borg said.", "comment_count": 34, "id": 1938}, {"keywords": "Marsa, Transport", "author": "Ivan Camilleri", "article_body": "The government has agreed to grant a large area of public land in Marsa to a group of private businessmen, and convert it into a nine-storey commercial complex as part of the privatisation of the Marsa horse racing track.\nThe draft concession agreement, seen by Times of Malta, states that the commercial complex will have more than 12,000 square metres of rental space to be used for offices, retail outlets and restaurants, among others.\nThe complex will also include a large commercial car park, while the bus park already on site should also be allocated space in the new complex.\nThe land in question, which is currently used by Malta Public Transport as a bus park, will be transferred for 65 years to the private investors. The land was not included in the original request for proposals (RFP) and a memorandum of understanding signed between the government and the private consortium in 2017 shortly before the last general election.\nThe deal, which the government is now pushing through parliament, may be illegal, according to legal sources.\nIt has been a long time since we concluded this deal and I don’t have the details here\n“It is clear from maps forming part of the RFP and the memorandum of understanding that the new public land inserted in the deal was not the same in the original offer,” the source said.\nThis means that the terms of the original RFP were changed and this may be challenged in court.\nDuring a meeting of parliament’s National Audit Office Account Committee held earlier this week, Opposition MPs Mario de Marco and Ryan Callus raised several questions on the terms of the concession presented by the government, including the area to be turned into a commercial complex. \nThe inclusion of the large area of public land, located in Marsa, bordering with Qormi, to be turned into a commercial complex will make a significant difference to the project investors. \nOriginally, the RFP said investors would have to raise profits from the management and operation of the new track and related horse-racing facilities only.\nRELATED STORIESMarsa racetrack concession will include office block\nThe government’s project to try to privatise the Marsa horse racing track goes back to 2015 when a Request for Proposals was published by the Privatisation Unit.\nOnly one offer was submitted, and just a few days before the June 2017 election, Prime Minister Joseph Muscat announced a memorandum of understanding with Marsa Race Track Ltd, to invest €18 million in a new track and facilities.\nCommercial activity concession had been excluded\nA representative of the investors, lawyer Pio Valletta, had excluded the possibility that the concession would be used for any kind of real estate, declaring that any commercial activity included in the deal was only related to equestrian sports.\nHowever, according to a draft deal, already made between the government and the private company, it results that real estate has now been included as part of the project. During the parliamentary committee meeting, a representative of the polo club, which currently also uses the race- track, told MPs there is no agreement between them and the private consortium, claiming that the government did not do anything to protect their sport. \nOn the Opposition’s request, Deputy Prime Minister Chris Fearne, who was chairing the meeting, postponed the meeting to ensure the privatisation unit and other government agencies can provide more information and clarifications. \nIn April 2018, Times of Malta had reported that the private investors were putting pressure on the government to grant them public land, outside the terms of the RFP, to turn it into a commercial office block.\nManuel Camilleri, the chairman of the government’s Privatisation Unit, which negotiated the terms of the concession agreement, could not tell parliament who were the investors behind the project.\n“It has been a long time since we concluded this deal and I don’t have the details here,” he told the parliamentary committee scrutinising the contract.\nWho are the investors?\nMarsa Horse Racing Track Ltd is formed of a group of businessmen, mostly foreign.\nThe majority shareholder is Hugh Morshead, a UK citizen who lives in Jersey and who is also one of the main directors of Henley & Partners – the company which sells Maltese passports. He holds 72 per cent of the company’s shares.\nRegistered in 2017, the company also has True to Type Limited, an Irish company with a 10 per cent shareholding.  \nThe other shareholders are Alfred Kenneth Alexander Hill,  Kusam Sharma, Pio Valletta and local construction contractors F. Schembri Holdings Ltd, known as Tad-Dobbu.", "comment_count": 56, "id": 1939}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nTimes of Malta reveals that a plot of public land in Marsa has been earmarked for a private commercial complex. The Education Commissioner also reports that 'ethnic gangs' are forming in schools.\nThe Malta Independent reports on the outcome of elections for the the top posts within the Nationalist Party executive. It also quotes the National Audit Office saying it was not clear who was entitled to free health care.\nIn-Nazzjon focuses on the outcome of the PN executive committee meeting, noting that a vote of confidence is to be taken on July 27, while veteran Louis Galea is to lead a year-long reform process.\nL-Orizzont says Malta is winning the battle against breast cancer, and also quotes a PN supporter - Alex Borg Olivier - saying divisions within the party were pushing away voters.", "comment_count": 0, "id": 1940}, {"keywords": "Politics, PN", "author": "", "article_body": "Updated Friday 11.45am with PD statement\nNationalist Party veteran Louis Galea is set to spearhead a party reform process, following a proposal made on Thursday evening by PN leader Adrian Delia.\nDr Delia announced that he had put forward Dr Galea's name towards the end of a six-hour meeting of the executive committee on Thursday night which also saw him invoke a clause in the party statute for a vote of confidence in his leadership to be taken on July 27.\nIn a statement, the PN said the proposal was unanimously approved by the executive committee. \nDr Galea has been given a year to draw up his report into the state of the PN. During that time, he will meet party members and delve into every aspect of the party and the way it is run.\nAlthough he will report directly to to the party leader, Dr Galea will be authorised to meet with the executive committee and the administrative council.\nAt 71, Dr Galea is one of the longest-serving members of the PN. He first became a member of the Nationalist Party’s general council and executive committee in 1972 and was a member of the administrative council from 1975 to 1987. He also served as the party’s general secretary from 1977 to 1987.\nDr Galea, a former minister, was first elected to Parliament in 1976, and recently served as Malta's representative at the EU's Court of Auditors.\nMidnight oil burning as the party seeks a way forward.\nPD augurs that reform will lead to renewal\nThe reform proposal was welcomed by Partu Demokratiku, which said that a “compact, credible PN-PD Opposition would rebuild trust in politics”.\n“If the PN embarks on the road of honest reform, led by a credible and wise leader, with a clear agenda that the new Nationalist Party would be everything that the Labour Movement of 2013 was supposed to be, and also be everything that the PN was in 1987, then there is hope,” MP Marlene Farrugia said.\n“We have a government that is burdened with conflicts of interest, irregularities, clientelism, corruption, lack of transparency, and, worse still, does not distinguish between government and party, and between government and state,” leader Godfrey Farrugia added.\n ", "comment_count": 52, "id": 1941}, {"keywords": "Politics, PN, Adrian Delia", "author": "Denise Grech ", "article_body": "Updated 10:30am\nNationalist Party leader Adrian Delia has confirmed a vote on his leadership will be taken in the General Council on July 27, but was non-committal about resigning if the result is not in his favour.\n“The decision to remove the party leader is in the hands of the paid-up members,” he told journalists following a six-hour meeting at PN headquarters.\n“This doesn’t mean all items or petitions cannot be discussed,” he added.\nAsked what the next step would be if the General Council voted for the leadership to carry responsibility and leave, he said he would not speculate on what steps he would take.\nHowever, the decision of the paid-up members is what counted, he insisted.\n\nWhy is Adrian Delia facing a confidence vote?\nCriticism of the party leader reached fever pitch in June following a disastrous showing at MEP and local council elections, which the PN lost by the largest margin in its history. \nDr Delia has faced internal party criticism from the beginning of his time as PN leader back in 2017. Despite those rumblings of discontent, he has steadfastly refused to consider stepping aside, insisting his mandate was to lead the party to the next general election. \nHow did this confidence vote come about? \nThe push to force a vote on Dr Delia's leadership was spearheaded by entrepreneur and former electoral candidate Ivan Bartolo, who also sits on the PN executive. \nAdrian Delia is surrounded by supporters following his election as PN leader in 2017. Photo: Mark Zammit Cordina\nMr Bartolo has argued that if Dr Delia wins a confidence vote, critics must \"back him up or back off\"; if he loses, he should quit and allow the party to \"turn the page\".\nWho supports Adrian Delia? \nDr Delia was the first PN leader to be elected directly by party members, following a change in leadership election rules introduced by his predecessor Simon Busuttil. \nHe can count on a core group of supporters among the PN grassroots, and his backers sought to drive that point home when they presented a petition expressing confidence in Dr Delia which was signed by almost 5,000 people. \nWho opposes Adrian Delia? \nDr Delia faces far more criticism within the party's official organs and parliamentary group, among what he himself has described as the PN \"establishment\".\nA number of sitting PN MPs have made no secret of their distaste for the current leader, and the feeling appears to be mutual. \nThe threat of a parliamentary rebellion against Dr Delia came and went back in January, following allegations about the party leader's private life. But a disastrous electoral showing in May brought party divisions back to the surface. \nSince then, the party's executive committee president, Mark Anthony Sammut, has resigned and official sections within the party, including its youth wing MŻPN, have made it clear they are unhappy with the way the PN is being run. \nRELATED STORIESWhy Delia must go – and why he won’t - Kevin CassarAdrian Delia to face vote of no confidence as petition hits target\nWill the July 27 vote determine Delia's future?\nDr Delia's backers insist that it will not. They have said that the party's statute does not allow the General Council to unseat a party leader, save for a three-month period following a general election. \nOn Thursday, Dr Delia himself indicated he thinks similarly, telling journalists “the decision to remove the party leader is in the hands of the paid-up members”.\nHowever, he said, he would now be taking into consideration the calls and \"pain\" of those who signed petitions calling for him to leave. \nOn the other hand, other PN members have argued that it would be unprecedented for a party leader to remain in place after losing the confidence of the party's General Council. Doing so, they say, would broaden existing rifts within the party even further. \nThe July 27 General Council meeting will not only discuss the vote of confidence but will discuss “wider issues” raised in the petitions.\nRELATED STORIESInterview: Adrian Delia sticks to 2022 election target", "comment_count": 43, "id": 1942}, {"keywords": "Energy", "author": "", "article_body": "Updated 9.30pm\nPower cuts were reported on social media across the centre of the island, with blackouts in Naxxar, Għargħur, Lija, Iklin, Mosta and Dingli - but most people are saying that they only lasted five minutes.\nEnemalta said that the problem originated in a distribution channel, and that it was doing all it can to restore the service in full as soon as possible.\nUpdates posted on its Facebook page a quarter of an hour later said that power had been restored across all the effected area.\nFacebook was on Thursday morning also flooded with reports of power cuts overnight.\n\n ", "comment_count": 39, "id": 1943}, {"keywords": "Politics", "author": "Jacob Borg", "article_body": "Details about confidential complaints submitted to the Ombudsman found their way into a report published by Mario Cutajar, the government’s top civil servant within the Prime Minister’s Office, the Ombudsman’s annual report reveals.\nThe Ombudsman said those submitting complaints to his office did so on the understanding that their identity and the nature of their grievance would be protected from “undue and unwanted publicity”.\nMinimal information about complaints was submitted to the Prime Minister’s Office by the Ombudsman for the purpose of keeping the public administration abreast of the status of investigations.\nIn some instances, information published by the Principal Permanent Secretary went beyond the information the Ombudsman had given to the Prime Minister’s Office, the Ombudsman said in his 2018 annual report.\nThe document published last November by the Principal Permanent Secretary, titled ‘Governance’, gave a breakdown on the action taken by the public administration on points raised in the Ombudsman’s 2017 annual report.\nPrivacy and strict confidentiality imposed by law are considered to be essential components\nThis ‘governance’ document contained data of a “personal nature”, with specific information on complaints and the progress of the Ombudsman’s investigations into these complaints, the Ombudsman’s latest annual report says.\n“Privacy and strict confidentiality imposed by law are considered to be essential components and requisites of the investigative process”, the Ombudsman’s report lamented in reaction to the publication of this personal data.\nThe Ombudsman’s office said information was provided to the Prime Minister’s Office within the constraints imposed by data protection and on the understanding that such investigations are carried out away from the public eye.\nQuestions sent to the Principal Permanent Secretary were unanswered by the time of writing.\nAccording to the Ombudsman, the only significant personal data not included in the report published by the country’s top civil servant are the age and address of complainants and their ID numbers.\nThe Ombudsman said in some instances, because of details that found their way into the Principal Permanent Secretary report, there is enough data to enable interested parties to identify the persons submitting the complaint.\nNo prior notice was given to the Ombudsman about the publication of this personal information, the report continues.\n“One hopes that in the future such an exercise, that marred an otherwise positive initiative, would be reviewed and also radically revised,” the Ombudsman concludes.", "comment_count": 16, "id": 1944}, {"keywords": "Health", "author": "", "article_body": "Over four of every five women treated for breast cancer survives for at least five years, the highest percentage in Europe.\nThe Health Ministry said on Thursday that the figure of 87 per cent was a message of hope for Maltese and Gozitan patients.\nHealth Minister Chris Fearne announced the percentage during a meeting with the multidisciplinary team that discusses the 40 average new cases of cancer each week.\nThere is almost one new case a day in Malta, with most occuring in women aged between 50 and 69.\nThe minister said that the screening programme – which currently covers women aged between 50 and 67 – would be extended so that mammograms would be done every two – rather than three – years.\nSince 2009, over 80,000 mammograms have been carried out.", "comment_count": 7, "id": 1945}, {"keywords": "PN, Adrian Delia, Politics", "author": "Denise Grech ", "article_body": "Updated 9.30pm\nAlex Perici Calascione has been elected president of the PN Executive committee, with Carm Mifsud Bonnici elected president of the administrative council.\nAlex Perici Calascione.\nBanging and clapping were heard from inside the PN headquarters after the votes were counted.\nMr Perici Calascione got 53 votes in favour and 24 against, uncontested for the post after Graziella Attard Previ withdrew from the race at the 11th hour.\nDr Mifsud Bonnici beat his rival - Graham Bencini - by 46 to 31 votes.\nOpposition leader Adrian Delia welcomed the outcome, saying that the executive commitee had shown that there was strength in unity.\n\"The values of unity and diversity should work within the Nationalist Party in the national interest,\" he was quoted as saying in a party statement.\nPierre Portelli, who recently resigned as head of the PN party media, did not mince his words as he went into the headquarters for Thursday evening's meeting of the executive committee, saying steps should be taken against those who do not support Adrian Delia.\nCarmelo Mifsud Bonnici.\nAsked what steps should be taken, he said: “There are structures within the party and if the petition is approved, then we can see from there.\"\nThe committee was expected to discuss a petition which called for the party leadership to go for a vote in front of the general council. Meanwhile, two further petitions in support of Dr Delia as party leader were presented on Wednesday.\nAsked whether he agreed with the petition calling for steps to be taken against MPs who disagree with Dr Delia, Pierre Portelli said: ”I signed the petition so this would happen.”\n\nMs Attard Previ had submitted her nomination for the post along with Alex Perici Calascione following the resignation of Mark Anthony Sammut. She later told the meeting that she had withdrawn her nomination to avoid further ruptures within the party, so that it could focus on its mission.\nCharles Selvaggi, who was uncontested for the post of treasurer also withdrew his nomination, telling the meeting that this had been done because of professional commitments. Since there was no other candidate for the post, a fresh call for nominations will be made, the party said.\nThe party is facing turbulent times with a petition challenging the leadership of Dr Delia in the wake of the landslide defeats at the European and council elections.\nRELATED STORIESAdrian Delia to face vote of no confidence as petition hits targetAlmost 5,000 sign petitions backing Delia\nThe executive committee met to elect the high ranking party officials following the resignations of Mr Sammut, David Camilleri as PN treasurer and David Stellini, the president of the administrative council.\nClaudette Buttigieg going into the meeting. Photo: Matthew MirabelliIvan Bartolo makes his way through the waiting journalists.Mario de Marco had no comments to make.\n \n ", "comment_count": 83, "id": 1946}, {"keywords": "European Union, Politics", "author": "", "article_body": "On Wednesday, MEPs voted on the size of Parliament’s 20 committees and two sub-committees. Their composition was confirmed by political groups later on the same day.\nThe complete list of full members is available here. Chairs will be elected at each committee’s and subcommittee’s constitutive meeting.\nThe committees of which Malta's six MEPs are Members and/or Substitute Members are as follows: AGIUS SALIBA Alex (S&D)Committee on the Internal Market and Consumer Protection (Member)Committee on Petitions (Member)Committee on Employment and Social Affairs (Substitute) CASA David (EPP)Committee on Employment and Social Affairs (Member)Committee on Economic and Monetary Affairs (Substitute)CUTAJAR Josianne (S&D)Committee for Industry, Research and Energy (Member)Committee on Transport and Tourism (Substitute)Committee on Regional Development (Substitute)DALLI Miriam (S&D)Committee on the Environment, Public Health and Food Safety (Member)Committee on Civil Liberties, Justice and Home Affairs (Substitute)METSOLA Roberta (EPP)Committee on Civil Liberties, Justice and Home Affairs (Member)Committee on the Environment, Public Health and Food Safety (Substitute)SANT Alfred (S&D)Committee on Economic and Monetary Affairs (Member)Committee on Petitions (Member)Committee on Budgets (Substitute)", "comment_count": 2, "id": 1947}, {"keywords": "Education", "author": "Denise Grech ", "article_body": "Students may have to take up a compulsory language other than Maltese and English in their sixth form syllabus, according to new proposals.\nThe reform would enrich students' European identity and intercultural skills, the Matriculation and Secondary Education Certicficate (Matsec) office said.\nDiscussions to restructure the Matriculation Certificate Examination have been ongoing for the last few years, it said.\nThe move would \"serve the changing socio-economic needs of Maltese society within a European and global context,” a statement said.\nIt also seeks to “give merit” to students’ voluntary involvement in non-academic activities, including social engagement and enterprise. The activities can take place during or after school hours, Matsec said.\nThe reform also seeks to attribute greater importance and value to school assessment and offer “unprecedented support and recognition” of talented athletes, it said.\nThis year marks the 25th anniversary of the original publication of the Matriculation Certificate examination regulations.\n“By way of concluding these discussions, an improved and more student-centred Matriculation programme is being proposed to meet the needs of 21st century learners, for whom the future holds major transformations.\"\nHow to learn, how to work and how to engage in global communication are three key strategies in a student’s learning experience, it added.\nThe office will be presenting their proposals next Monday for a public consultation.\nReforms to Matsec exams had been suggested in 2018, when the Education ministry suggested creating three exams for Maltese.", "comment_count": 38, "id": 1948}, {"keywords": "Accident, Gżira", "author": "", "article_body": "An 86-year-old woman from Gżira is being treated for serious injuries after she was hit by a car on Rue d'Argens.\nThe police said that the accident occurred at 11.30am and that the car was being driven by a 55-year-old man from St Julians.\nInvestigations are still under way.", "comment_count": 0, "id": 1949}, {"keywords": "Court, Drugs", "author": "Edwina Brincat", "article_body": "The compilation of evidence against a man has been going on for 18 years – and the prosecution had not yet concluded its evidence stage, prompting a constitutional court to declare that his right to a fair hearing within a reasonable time had been breached.\nSince 2005, there have been 136 sittings and 21 witnesses testified, while the case had been adjourned 25 times on account of the prosecution, 10 times on account of the defence and another 10 times by the Court, presided over by three different Magistrates, two of whom had since been elevated to Judges.\nAngelo Zahra was first arrested in 2001 and was granted bail while the compilation proceedings over drug-related charges continued in his regard, with his assets subjected to a freezing order.\nHowever, the compilation came to a standstill when five of the prosecution witnesses, facing separate criminal proceedings, were unable to testify on account of possible self-incrimination.\nAs the situation dragged on, defence lawyer Joseph Giglio requested a constitutional reference for the First Hall, Civil Court to determine whether the accused was effectively suffering a breach of his right to a fair hearing within a reasonable time.\nThe request for a reference was upheld by the Magistrates’ Court presiding over the compilation, landing the issue before the superior court where the Attorney General countered that the applicant could not complain about delays when his own request was a cause for further delay.\nBesides, those five witnesses had a right to refuse to testify, just as the prosecution had a right to insist upon their testimony, the court was told.\nWhen delivering judgment the Court, presided over by Mr Justice Mark Chetcuti, produced a breakdown of all the sittings held over a 14-year span, excluding the court minutes between 2001 and 2005 which went missing when the records of the case had been damaged in a fire.\nIn fact, the acts of the case had to be reconstructed from scratch, the Court observed.\nHowever, in “18 years the prosecution had not declared its evidence stage as closed,” the Court said.\n“It was unacceptable under the rule of law that 18 years after the arrest of the accused, the prosecution had still to conclude its evidence stage….no matter how indispensable its witnesses,” the Court observed.\nThere was no absolute term nor any singular determining factor to assess whether the duration of proceedings was reasonable or not, the Court explained, adding that all circumstances of the case had to be taken into consideration.\nIn this case, the principle though not sole reason for the delay was the prosecution’s insistence on the testimony of the five witnesses, the Court said.\n“The State is bound to ensure that the judiciary delivers justice within a reasonable time and that the constitutional and conventional rights of the parties are not breached.”\nIn the light of the direction requested in the reference, the Court declared that the accused’s rights had been breached and ordered the records to be sent back to the Magistrates’ Court for proceedings to continue, urging the prosecution to draw the curtain on its evidence stage.\nThe Court refrained from granting a remedy since no request for this had been included in the reference.\nLawyers Joseph Giglio and Sarah Mifsud assisted the applicant.", "comment_count": 0, "id": 1950}, {"keywords": "Animal welfare", "author": "Claudia Calleja", "article_body": "Owners of karozzini (horse-drawn carriages) will have to alternate their horses during the hot summer months and keep them out of the sun during peak hours, according to new regulations to be published over the next few days.\nThe draft regulations seek to offer better protection to the horses, a government spokesman explained, adding that further details would be revealed over the next few days.\n“We tried to strike a balance between the welfare of the animals and the business aspect for the owners,” the spokesman said.\nThe regulations follow consultations with all stakeholders including the carriage owners and vets. \nLast year, Parliamentary Secretary for Animal Welfare Clint Camilleri announced he would be revising the regulations that regulate horse-drawn carriages after two horses collapsed in the August heat. \nThe incident had spurred public outrage with people calling for the gradual ban of the horse-drawn carriages during a protest. \nBack then karozzini drivers said they welcomed more checks and enforcement but warned that banning horse-drawn carriages or limiting their hours would lead to a “massacre” of working horses. \nRELATED STORIESKarozzin drivers warn outright ban would result in ‘massacre’ of horsesKarozzin shelter full of parked cars - two days after protest\nOne driver had explained how the horses were mainly retired racehorses that cost a minimum of €200 a month to keep. \nNot being able to work would result in drivers not being able to maintain them and having to put them down – since the hottest days of the year were also the most lucrative. This concern had been echoed by several animal sanctuaries who said there would be no room to take in such a large number of animals.\nLast month, Malta’s only horse rescue NGO, RMJ’s Horse Rescue, said it may no longer be in a position to take in horses as the landlord of the stables they rent was raising the monthly fee. The Lands Authority is investigating the claim.", "comment_count": 39, "id": 1951}, {"keywords": "Disaster, Italy", "author": "Kristina Abela", "article_body": "A Maltese woman and her family were ordered to sail away from Stromboli immediately, as they witnessed Wednesday’s deadly eruption.\nPeople were injured and a 35-year-old hiker died when he was hit by a stone after two unexpected explosions on the Italian island.\nClaudine, who asked for her full name not to be published, was among the tourists fleeing the eruption.\nShe described how she was on boat moored at a marina around 3km away when it happened.\n“We were watching the explosions when, all of a sudden, the attendants ran down yelling instructions in Italian,” Claudine told Times of Malta.\n\"They said 'put your engines on, put your engines on. Leave now!'\"\nClaudine took this picture of Stromboli erupting\nShe and her family were told to go to the nearby island of Salina. \nIf the sirens went off at night, they were warned, this could signal an impending tsunami.\nThey would have two options in that event; to sail out as far as they could or to leave the boat and seek higher ground. Luckily, no sirens sounded and they are safe.\nPhotos show Stromboli being enveloped in a plume of gray cloud, and Claudia described seeing lava streaming down the slopes of the volcano.\nThe Times of Malta's Clinton Calleja was also holidaying in the area and sent in this picture of the eruption.\nPhoto: Clinton Calleja\n“It’s been a long time since we had an eruption of this magnitude,” former local councilor Gianluca Giuffre told RAI news.\nThe explosions came from the central-southern side of the volcano’s crater at around 3.45pm on Wednesday, according to Italy’s National Institute of Geophysics and Volcanology.\nForeign Minister Carmelo Abela said there were no requests for assistance from Maltese travellers.", "comment_count": 10, "id": 1952}, {"keywords": "Court, Justice", "author": "Edwina Brincat", "article_body": "A man who tried to follow a woman into a restricted area of Malta International Airport only to be stopped by airport security officers has been handed a suspended sentence. \nShaginiani Rafieli, a 27-year old Georgian national, told police that he was following a woman he had been flirting with.\nHe ended in court on Thursday after his arrest on Wednesday at around 2pm when he roamed into the airport restricted area, following a passenger through the security gate.\nThe man told police that he was walking after a woman he had been flirting with, an excuse that did not convince the airport security, who immediately stopped the man. \nThe man was arrested and taken to court, where he plead guilty to violation of private property and to the unauthorised entry into the airport’s restricted area.\n“The man is homeless. He is a possible threat to airport security and thousands of passengers. We don’t know exactly what he had in mind,” prosecuting Inspector Silvio Magro said.\nDefence lawyer Charmaine Cherret argued that the man had panicked when the police had intervened to arrest him. “He had never been arrested and didn’t cooperate, but he didn’t do any damage or harm.”\nMoreover, the man was “terrified of airplanes” and had travelled to Malta by sea. “I think he hasn’t understood the gravity of the crime with which he is charged,” she said.\nHowever, Inspector Silvio Magro told the court CCTV footage showed the man trailing after passengers into the departure lounge. “He tried to go upstairs and lied about why. He is lying to the court and his lawyer,” the inspector said.\nWhen asked by the Court whether he was confirming his plea, the man, speaking through his interpreter, said that he had discussed it with his lawyer.\n“Prison or not, do as you will,” the accused replied when told that his guilty plea could land him with a prison term.\n“Yes, yes, yes!” he confirmed when asked once again whether he fully understood the implications of his plea.\nAfter hearing submissions by both parties, the Court, presided over by magistrate Monica Vella, declared him guilty and condemned him to a two-year jail term suspended for four years.\nArticle amended on July 5 to clarify the fact that the man was stopped as he tried to enter the restricted area.", "comment_count": 0, "id": 1953}, {"keywords": "Media, Internet, Family", "author": "Claire Caruana", "article_body": "Over a quarter of those aged between 65 and 74 are active social media users, fresh data has shown, with nearly 70% of internet users on such platforms. \nYet, while last year a large majority of internet users over 65 kept themselves busy online by accessing social media platforms, close to 75% of them were also found to have used the internet to seek information on health-related matters.\nThis was notably higher than in the previous year, when only 59% of elderly users were using the internet to carry out research on issues related to their health. \nOn the other hand, in 2018 they were less likely to make use of internet banking services, with under 40% sorting out their banking needs online.  \nPublished by the European Union’s statistics office, Eurostat, the data revealed that 26% of all those in the age bracket participated in social networking on Facebook, Twitter and similar platforms. \nThe rate for Malta was significantly higher than the European average, which the statistics office said stood at only 19%. \n75% of internet users aged between 65 and 74 seek health information online\nAlthough the rate is among the highest in Europe, with Malta being in the eighth position, social media popularity was found to have dwindled slightly when compared to the previous year, when nearly 30% of those aged between 65 and 74 used social media.\nThe statistics office also found that when analysing the behaviour of those who were online at least once in three months, just under three-quarters are on social media – with 68% found to have made use of such platforms. \nThis rate was the highest in Europe, Eurostat found, despite it also going down when compared to the previous year.\nAcross all age groups, the statistics office found that 85% of internet users are active on social media, the third-highest rate in Europe, superseded only by Hungary and Romania. \nThe 2018 rate went down by two percentage points compared to the previous year.", "comment_count": 10, "id": 1954}, {"keywords": "Crime, Customs", "author": "", "article_body": "Nearly 22,000 contraband cigarettes were seized by Customs from a garage in Fgura early on Thursday, following hours of observation.The 21,620 cigarettes, in brands not legally sold in Malta, were hidden in the garage, currently being used for storage purposes by the owner of a bar in Ħamrun.\nThe endangered revenue from the cigarettes, in terms of excise duty and VAT, exceeds €5,000.\nThe cigarettes were withheld pending investigations by the department.", "comment_count": 2, "id": 1955}, {"keywords": "Planning Authority, Sannat, History", "author": "Vanessa Macdonald", "article_body": "A century-old farmhouse in Sannat will be destroyed to make way for a three-storey development of flats, unless objectors can make their voice heard.\nOver 157 objections were filed by neighbours and other residents by the May deadline, in a campaign spearheaded by Openwork Studio architect Joanna Spiteri Staines.\nShe wrote in the objection letter that the two-storey house is “a historic and aesthetically pleasing vernacular building” within the Urban Conservation Area.\n“This ridicules the very basis rule of conservation of our historic centre,” she wrote. \n“Should this be allowed it would create a very dangerous precedent that could result in destruction of 90% of our UCAs.”\nThe Sannat council has also objected to the development, with mayor Philip Vella telling Times of Malta that the point of having UCAs was precisely to impose restrictions on what could and could not be done there.\n“The house is the ideal candidate for conservation, which would save the architecture for future generations to enjoy. The Planning Authority’s own Restawra Darek scheme was set up for this very purpose.\n“The council is always in favour of houses of character. It is so sad to think that future generations will not have any chance to enjoy this type of building.\n“And there are other aspects to such developments in the core of a small village: the infrastructure simply cannot handle that increase in parking and traffic.”\nThe Environment and Resources Authority took a tepid stand on the application, related to the trees on the site, but the Superintendence of Cultural Heritage was more vocal, saying it was against the demolition of the existing property, adding that it had various features which merit preservation. \nPrecedent could result in destruction of 90 per cent of Urban Conservation Area\nCultural NGO Wirt Għawdex is also against the development.\nDeveloper J. Portelli Projects is already advertising the block – to be called Tal-Palazz Residence – on Facebook, saying a few months ago that the flats and penthouses are available “starting from €84,000 built in shell form state by end of 2020”.\nThe plans include 16 apartments which would take up the existing 400 square metre garden of the current farmhouse. \nA 20m stretch of rubble wall would also be destroyed, to be replaced by a 10m high blank party wall overlooking an alley that goes up the side of the building.\nThe area which is to be developed.\nAn inscription on the first floor of the house shows that it dates back to 1926. However, its value does not only come from its age but also from the fact that it was built from recycled blocks which appear to have come from a British semaphore tower that could have once stood in Sannat.\n“Retention of historical elements enriches the understanding of the history of the whole island,” architect Spiteri Staines pointed out.\nThe objectors have requested a meeting with the PA team allocated to this application and are expected to meet in the near future.\nThe case officer is due to submit their recommendation on August 2 but this deadline can be extended.\n ", "comment_count": 46, "id": 1956}, {"keywords": "European Union, Elections, Politics", "author": "", "article_body": "MEP David Casa will form part of the European Parliament’s leadership following an election that took place in Strasbourg on Thursday where he was elected European Parliament quaestor.\nHe is one of five MEPs elected quaestors. The others are Anne Sander, Monika Benova, Gilles Boyer and Karol Karski. \nMr Casa said he was honoured to have been entrusted with the role.\n\"This is now my fourth parliamentary term and I am ready for the increased responsibility that comes with forming part of the Parliament’s Bureau. My election is also testament to the fact that despite coming from a small member state, Maltese nationals can achieve positions of significant clout within European institutions.”\nQuaestors are elected for two-and-a-half-year terms and are responsible for different aspects of the Parliament’s administration such as the Parliament’s communication set-up.\nDavid Casa will form part of the European Parliament’s Bureau together with the President and vice-Presidents. He now holds the highest-ranking European Parliament post secured by a Maltese MEP.\nMr Casa has held a number of important roles in the EP in past legislatures. He was EPP Group coordinator for the Employment and Social Affairs Committee, as well as Parliament’s lead negotiator on the Work Life Balance Directive. ”I am determined to continue working with even more energy to achieve concrete results for Maltese and European citizen,\" he said, as he thanked fellow Nationalist MEP Roberta Metsola for her support.", "comment_count": 194, "id": 1957}, {"keywords": "Politics, Joseph Muscat, European Union, Elections", "author": "Ivan Camilleri", "article_body": "Calls for Prime Minister Joseph Muscat to remain in office have intensified following his failure to land any of the EU’s top jobs he was reportedly seeking, Times of Malta is informed.\nDr Muscat has gone on record saying he will not lead Labour into the next general election.\nLabour Party officials close to the Prime Minister on Wednesday said that once a top Brussels post for Dr Muscat was now definitely off the table, it made more sense for him to stay on for another three years and fight another election.\nThe sources played down the possibility of Dr Muscat using his last card and nominating himself as Malta’s next European Commissioner. “He is being advised by many not to do it as he will be taking a huge gamble,” a well-placed source in Castille said.\n“MEPs, including those from our side (Socialists) have repeatedly voted against Muscat’s government in the past years, particularly following the revelations of the Panama leaks. If he puts his name in, he risks being humiliated and that would be his end.”\nRELATED STORIES_'I will continue as Prime Minister with more vigour'With you as leader we're the Real Madrid of politics, Zammit Lewis tells Muscat\nDuring three days of intense meetings in Brussels, top OPM officials and Maltese diplomats lobbied their EU peers to insert Muscat’s name on the EU’s shortlist. But EU diplomats have told Times of Malta that Dr Muscat’s name was never considered for any of the vacancies available.\n“Muscat was never on the radar despite what was being spun by sections of Malta’s media close to the government. Apart from his natural handicap of coming from a small island, his political baggage, particularly due to his government’s bad record on the rule of law and corruption claims, would have never been accepted by the majority of EU leaders and the European Parliament,” one diplomat said.\nA diplomat working for the Council dismissed the claim made by Dr Muscat’s spokesman, soon after the EU decisions were taken, that the Prime Minister was somehow close to securing a post.\nHis political baggage would have never been accepted by most EU leaders\nWhile he may once have been a serious contender, all that changed with the Panama Papers and the murder of journalist Daphne Caruana Galizia.\n\nLabour officials, including those who were positioning themselves to replace him at Castille in the event of his exit, including Deputy Prime Minister Chris Fearne and MEP Miriam Dalli, on Wednesday tweeted their ‘appeals’ for Dr Muscat to stay in government.\nOther hopefuls, Transport Minister Ian Borg and Tourism Minister Konrad Mizzi, remained silent.\nTimes of Malta is also informed that top Labour officials have now given their go-ahead for a petition by ‘supporters’ calling for Dr Muscat to stay, left on the backburner for the past weeks, to be given a new impetus among party delegates and members.\nDr Muscat has repeatedly gone on record to say he will exit the local political scene before the next general election. He stuck to this position even after the last MEP elections, insisting that his “10-year plan” in government was coming to an end.\n“We obviously want Muscat to stay. His prospects of winning the next election are almost a certainty, bearing in mind that the PN is in shambles. Why change a winning horse?” one party delegate said.\nApart from staying on in his role, and making a U-turn on his past promises to leave, Dr Muscat has another option left, that of nominating himself as Malta’s next European Commissioner, replacing Karmenu Vella.\nWhile many EU Member States have already nominated their candidate, Malta has not made any announcement yet.\nAlthough technically there is nothing stopping Dr Muscat from becoming Malta’s candidate for Commissioner, what follows a nomination is certainly not plain sailing.\nThe entire Commission will have to get the green light of the European Parliament before it can take office. If one of the nominees is not accepted, he may either have to be replaced by the Member State nominating him or the whole Commission will not be approved.\nAmong MEPs, Malta’s reputation has suffered immensely over issues such as the sale of passports, the undermining of the rule of law, the corruption allegations stemming from the Panama Papers and the government’s refusal to order a public inquiry into Ms Caruana Galizia’s murder.\n“Do you think that Muscat – a shrewd politician – will be placing himself at the mercy of MEPs who might be tempted to reject his nomination?” a senior Labour official said.\n“Can you imagine the embarrassment and humiliation if the whole Commission is not approved because Muscat is not acceptable to MEPs?” he said.\nA few weeks ago, Dr Muscat’s spokesman had categorically excluded the possibility that his boss would seek a Commission seat. Asked again on Wednesday, the spokesman did not reply.\nGovernment sources said if Muscat opts to stay on, the most likely candidate for Commissioner would be European Affairs Minister Helena Dalli.\n“She is already taking private lessons in French just in case,” a member of her secretariat said.\nOne rival would be Finance Minister Edward Scicluna, who has reportedly made his intentions known to Dr Muscat.", "comment_count": 116, "id": 1958}, {"keywords": "North Africa, Conflict, Migration", "author": "", "article_body": "The Foreign Ministry on Thursday expressed shock following the airstrikes on Libya’s Tajoura, specifically on a migrant detention centre.\nThe strikes left 40 fatalities in their wake and countless injured.\nThis inhumane and insensitive attack was a stark reminder of the humanitarian situation in Libya and the need for concrete action to prevent this from deteriorating further, the ministry said.\nIt remained important that migrants at risk on the frontline and in dangerous areas were swiftly transferred to safe places under the supervision and protection of the United Nations.\nThe ministry condemned the violence perpetrated against civilians, migrants and refugees, and reiterated the need for the parties involved to refrain from violating international humanitarian law.\n“This distressing situation further heightens the need for the adoption of a ceasefire between the parties involved on the ground, in coordination with the ongoing efforts of the United Nations Special Mission in Libya,” it said.\nIt called on the United Nations to carry out an immediate investigation to ensure that those responsible were held accountable.\nThe ministry expressed condolences with the families and friends of the victims.", "comment_count": 0, "id": 1959}, {"keywords": "Beach, Swimming (sport), Health, Accident, Marsaxlokk", "author": "Kristina Abela", "article_body": "Only 15 of the 50 designated swimming zones listed on the Transport Malta website have a lifeguard service, Times of Malta is informed. \nThe information comes in the wake of the death of a 69-year-old man from Żejtun at St Peter’s Pool last Sunday afternoon.\nBeachgoers at the popular swimming spot witnessed the man being pulled out of the water and given CPR (cardiopulmonary resuscitation) by a tourist, Rory Clarke, before being taken away by paramedics, only to be later pronounced dead. \nMr Clarke, who is a trained first responder, believes the man was still alive when he was carried ashore. He has since raised concerns about the absence of life-saving services and equipment at the location of the incident and the need for over-the-phone support from the hospital in emergency situations such as these. \nLifeguard and first aid services to 15 public beaches around the island are provided by the Red Cross between 10am and 6pm every day. These zones have been earmarked and are financially supported by the MTA. \nThey include the most popular spots such as Ġnejna, Għajn Tuffieħa, Golden Bay, Mellieħa, Buġibba and Qawra, St Julian’s, Sliema, Birżebbuġa and Marsascala.\nIn addition to lifeguards, one supervisor is stationed at each of six zones around the Maltese coast. Trained in advanced first aid, they offer urgent assistance to lifeguards who need it. They are also equipped with vehicles that have visual and audio warning systems at their disposal for rapid response as well as first aid kits for medical emergencies. \nUnfortunately, not all deaths are preventable\nIn the most popular beaches in the north, further support is provided by four rescue vessels. \n“Unfortunately, not all deaths are preventable especially when they involve medical complications,” a spokesman for the Red Cross said. \nHe advised swimmers to stay hydrated when frequenting such beaches as several medical incidents occur every summer due to dehydration and heat exposure. \nHowever, many on social media have questioned the failure to offer lifeguard or at least first responder services at St Peter’s Pool, given how popular the bay is in summer. The area’s relative inaccessibility is an added cause for concern.\nQuestions sent by Times of Malta to the MTA about whether there are plans to install more lifeguards in popular swimming zones, and what other safety measures could be taken to avoid further tragedies, remained unanswered at the time of writing. ", "comment_count": 3, "id": 1960}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories on Thursday’s newspapers.\nTimes of Malta leads with a court report on the jury of Michael Emmanuel, who stands accused of having murdered mother-of-seven Maria Lourdes Agius but has pleaded legal insanity.\nThe Malta Independent says Air Malta has not yet approached pilots to resume talks.\nL-Orizzont quotes Tourism Minister Konrad Mizzi saying that the government could not throw money away and guarantee the impossible.\nIn-Nazzjon says Prime Minister Joseph Muscat’s dream of becoming European Council President has come to nothing.", "comment_count": 0, "id": 1961}, {"keywords": "PN, Politics, Conflict, Qormi", "author": "Ivan Camilleri", "article_body": "PN general secretary Clyde Puli has told senior party officials that he does not intend contesting again for the post when internal elections are held in November, Times of Malta is informed.\nSenior PN sources said that Mr Puli, a Qormi MP since 2003, has made it clear he will return to his government job to concentrate on his district.\nMr Puli was elected general secretary by the party’s executive council in November 2017. However, according to the sources, his position will surely be challenged this time around and Mr Puli is unlikely to enjoy enough support to be re-elected.\nHe struggled to retain his parliamentary seat at the last general election and his association with the current leadership, which has just emerged from two stinging electoral defeats, is not making him any more popular within the party, the sources say.\n“He will be making an exit to at least try to save his parliamentary seat,” one person close to Mr Puli said.\nWhen Mr Puli was asked whether he intended contesting in November, a spokesman for the party replied: “Mr Puli is fully focused on party matters, as his role requires him to be, and he will not abandon the party in its most difficult hour.”\nMr Puli irked many PN supporters following the party’s historical defeats at the polls in May by quoting figures from a 2017 survey by pro-Labour newspaper It-Torċa to show that it could have been worse. \nMeanwhile, the PN executive will this evening hold a crucial meeting as PN leader Adrian Delia faces a critical time in his efforts to hang on to the leadership.\nAfter he ignored repeated calls for his resignation, the executive will discuss an unprecedented petition calling for an extraordinary General Council in which a vote would be held on Dr Delia’s future.\nAccording to the PN statute, an extraordinary General Council can be called to discuss any issue if 150 councillors agree. \nThe petition gathered 200 signatures and was presented to PN General Council President Kristy Debono last week.\nIn a statement later, Ms Debono said it had resulted from a verification exercise that some of the petitioners were no longer council members but she confirmed the meeting would be held.\nThe next day the holding of the General Council was again put into question by the PN administration, with a new statement casting doubts over the petition’s validity.\nDr Delia has publicly said he will respect the democratic process but Times of Malta is informed that during a meeting of the Parliamentary Group last Monday he refused to commit himself on the extraordinary General Council holding a secret vote of confidence in his leadership. Sources said he may also use Mr Puli’s planned exit as a ‘sign’ that he will be making radical changes in the party’s administration, aiming to avoid the vote.\nAlmost 5,000 sign petitions backing Adrian Delia\nSupporters of PN leader Adrian Delia on Wednesday presented two petitions to the party expressing confidence in the party leadership, calling for reforms and demanding action against those who do not cooperate with the leader and harm the party.  \nThe petitions counter another, presented last week, which calls for a confidence vote in Dr Delia.\nThe PN executive is due to discuss the first petition today. The Delia supporters argue that the general council may not make decisions regarding the election of the party’s leader and two deputies since the statute only allows the leadership to be contested within three months of a general election. \nThe first of the petitions presented yesterday was signed by 4,333 party members and the second by 530 members of the party general council.", "comment_count": 30, "id": 1962}, {"keywords": "European Union, Politics", "author": "", "article_body": "PN MEPs Roberta Metsola and David Casa have been unanimously elected as coordinators for the EPP Group in the Civil Liberties, Justice and Home Affairs Committee and the Employment and Social Affairs Committee respectively. Both MEPs held these roles in the previous legislature.\nRoberta Metsola’s position comes after she was chosen to lead negotiations on behalf of the EPP Group for the programme of priorities for the EU for the next five years.\n“I am so pleased to have been elected and to have done so with all the support of my colleagues. It is an honour for me as someone representing Malta and Gozo to have been entrusted with this position. It means that I will be able to put a Maltese stamp on crucial European legislation over the next five years and will work hard to repay the faith shown in me by people in Malta and Gozo. We will continue to punch above our weight in Europe and continue to overcome Malta’s geographic realities,\" Dr Metsola said. \n\"The issues we deal with in this Committee are politically sensitive, emotive and are always at the top of citizens' concerns across our countries in Europe. Be it security, terrorism, migration, asylum, rule of law, citizenship, privacy, borders, civil liberties or fundamental rights, our citizens look to us for answers. It is within the ethos of the European People's Party that we can find the answers to the questions our voters are asking of us. We must be able to distinguish ourselves from the left and from the far right side of the house by providing answers that are balanced, studied and rooted in our value system,” she added. \nMr Casa will be leading the MEPs of his group on legislation regarding working conditions, social affairs and parental leave.\n“It is an honour to be entrusted once again by my colleagues to lead the EPP Group in such an important area for citizens across Europe, including Malta, Mr Casa said.\n\"This area is always treated as a priority both by the EPP Group and by Partit Nazzjonalista, and I will continue to ensure that the right balance is found between the rights of employees as well as those of businesses.”\nDavid Casa emphasised that the rights provided by the Work Life Balance Directive should be implemented as soon as possible to ensure that Maltese and Gozitan families benefit from new rights such as improved paternal and paternity leave, as well as the carer’s leave.\n“When it comes to improving the quality of life of families and workers, we cannot afford to lose more time. During this legislature, we will continue to adopt new laws which will improve working conditions as well as to ensure that families spend enough time with each other,” said Mr Casa.", "comment_count": 0, "id": 1963}, {"keywords": "Housing, Properties", "author": "", "article_body": "A rent reform announced by the prime minister last week went before Parliament on Wednesday.\nHousing Parliamentary Secretary Roderick Galdes spoke on how the reform aimed as instilling transparency and stability in the sector.\nHe said that private residential leases must last at least one year.\nWhere shorter rental periods were necessary, evidence needs to be submitted to demonstrate and justify the temporary nature of the rental agreement.\nMr Galdes said that the reform would not eradicate poverty, but it would attempt to offer stability and peace of mind to those who rented their accommodation. To this end, Prime Minister Joseph Muscat had called the law a “landmark” piece of legislation because its effects were intended to thoroughly change the mentality prevailing in the country.\nThe approach which had been taken in the drafting of the law was to address some of the consequences of the “great economic leap forward” which the country had experienced in recent years, and which had reinvigorated the rental and property markets. The “middle-of-the-road” approach adopted by the government would take into account the needs of the rental market while making the leasing of accommodation viable.\nIn terms of the new legislation, lessors would be bound to register new rental contracts within 30 days, and would be able to do so online or through the offices of the Housing Authority.\nAlthough the signing of a contract for every rental agreement had been envisaged in amendments to rental legislation introduced in 1995, many lessors were failing to live up to this obligation, leaving lessees at a loose end.\nThe law would render lessors failing to register contracts liable to pay a fine of up to €10,000. It would also allow lessees to register rental contracts themselves in cases where their respective lessor had failed to do so, at the lessor’s expense.\nThe new law would prevent rental increases from being effected more than once a year, and would restrict these increases to the annual variation registered by the national Property Price Index. It would furthermore cap these increases at a maximum of five per cent per year.\nDr Galdes elaborated new rights for lessors as well as for lessees. In cases where tenants were in default of their obligations, he said, and proceedings were brought before the courts, a decision regarding whether the tenant should be evicted or not would be taken during the first court sitting. This would avoid a long wait for the lessor, returning access to the property while allowing other matters related to the eviction to be discussed during subsequent sittings.\nTenants defaulting on their obligations would also be “blacklisted,” in order to allow other lessors relative certainty about the reliability of those with whom they were entering into rental contracts.\nMinimum notice periods\nThe law would also introduce minimum notice periods for lessees’ withdrawal from rental agreements, which would increase depending on the length of the original contract. It would also stipulate a minimum portion of the contract which would have to be honoured by the lessee.\nMr Galdes said that the changes would allow flexibility in the rental market while introducing and developing the best practices which had been adopted elsewhere. It would avoid problems faced by owners who were suddenly left to pay for unexpected damages, and of tenants whose rents were doubled at short notice. However, it was important to avoid “solving today’s problems with yesterday’s mentality.”\nOpposition MP Ivan Bartolo said the prime minister’s statement that the reform would not impact current prices meant that those who were presently in an unpleasant situation would remain where they were. However, some of the aspects of the new law were a good start for further reforms.\nApart from further amendments which the Opposition would move at committee stage, Mr Bartolo proposed incentives for longer-term contracts. He suggested the removal of the five per cent cap on annual rent increases for contracts lasting longer than five years as one possible incentive.\nFurthermore, he said that the law presently obliged the lessor to summon the lessee in cases where the lessee was in default. However, he suggested that this should be left up to the discretion of the lessor.\nThe government was obliged to intervene in the market in order to ensure social justice,", "comment_count": 0, "id": 1964}, {"keywords": "Adrian Delia, Politics, PN", "author": "", "article_body": "Supporters of PN leader Adrian Delia have presented two petitions to the party expressing confidence in the party leadership, calling for reforms and demanding action against those who do not cooperate with the leader and harm the party.  \nThe petitions counter another, presented last week, which calls for a confidence vote in Dr Delia.\nThe PN executive is due to discuss the first petition on Thursday. The Delia supporters argue that the general council may not make decisions regarding the election of the party’s leader and two deputies since the statute only allows the leadership to be contested within three months of a general election. But Delia critics cite a separate statute provision, which states that the general council can “decide on any proposal put forward by no fewer than 150 members”.\nThe first of the petitions presented on Wednesday is signed by 4,333 party members and the second by 530 members of the party general council.\n\nThe petitions, which are identical, urge the general council to reject the call for a confidence vote in the leadership and to launch a reform to restore the party to winning ways.\nThey call for the party's doors to be open for all those who genuinely wish to see change in the party.\nMPs and party officials are urged to pull the same rope and set an example to party supporters.\nThe petitions also call 'for all necessary action' against MPs and officials who show they are not prepared to work with the party leader and whose actions are detrimental to the party.\nLastly, the petitions call for a process to encourage the return of those people who left the party because of the actions of the few who 'want to keep control of the party in their own hands'. \nThe petitions were handed in by Rabat party council Karl Muscat. (Read them in full below) \nOn Monday Dr Delia said that he is not ignoring calls for him to resign, but, he said, there is a structure and there are rules which have to be respected.\n\n\n ", "comment_count": 126, "id": 1965}, {"keywords": "Migration, Health, Drugs", "author": "Denise Grech ", "article_body": "Being bullied at school because his father was foreign led a young man to a drug habit which saw him rack up 12 pending court cases against him in just six weeks.\nRichard* said his darker skin made him the target of bullying at school, and eventually saw him turn to three friends who offered him drugs when he was just 13.\nNow 45, Richard is one of the success stories of the San Blas therapeutic centre.\n“When I was younger, I was the only one who was darker, so I used to feel different,” he told Times of Malta.\n“Eventually, we’d start mixing alcohol with pills and then obviously heroin entered the picture. We were around 16 at the time. It was so easy to get hold of – all you needed was the right amount of cash.”\nHe and his three friends used to meet every day to take drugs until, one day, one of them was found dead as a result of an overdose.\n“We obviously freaked out. I vividly remember crying while carrying his coffin in the church. But that evening, my two remaining friends and I met again to take heroin.”\nJust a week later, one of them was also found dead of an overdose. And two years later, his only remaining friend from the group was arrested after taking part in a hold-up.\nWe’d start mixing alcohol with pills and then heroin entered the picture\nRichard vowed not to take drugs with anyone else but still continued taking heroin.\nEventually, he got caught multiple times stealing money or gold from pawn shops to sustain his drug habit.\nUnsatisfied by the high he got from heroin, he eventually started taking cocaine.\n“I eventually started taking coke, and nowadays I think I did because it would have taken me longer to hit rock bottom. I started stealing everything in sight – I needed money all the time to try to sustain my drug habit,” Richard said, adding he had then accumulated 12 court cases in just six weeks because of multiple robberies.\nHis relationship with his wife and son also started deteriorating rapidly. “I used to hide my coke in the bathroom, but one time, I had just taken a hit and could not find where I had placed it,” he said.\n“So I held a knife to my wife’s throat thinking she had hid the drugs from me for me to stop,” he added.\nAfter two years, fear of incarceration and his wife’s insistence led him to Caritas’ outreach centre, where he was eventually offered a place in the San Blas Therapeutic Community in late December. But he turned it down.\n“I refused – I did not want to be in San Blas for Christmas, New Year’s Day and my child’s birthday on December 27. I told myself I’ll remain clean and go in January,” Richard said.\nHe failed to keep his promises and found himself back behind bars on December 26.\n“I spent the night of my son’s 15th birthday behind bars, and I never forgave myself after that.”\nTwo years after entering the San Blas therapeutic centre, Richard now has a full-time job as a chef and is working to rebuild his relationship with his son.\n“I’m no longer afraid of becoming a drug addict – drugs just do not interest me anymore. Before, I had nothing to lose, now I am happy and busy, so my mind doesn’t turn to drugs anymore”.\n*Name has been changed to maintain anonymity.", "comment_count": 5, "id": 1966}, {"keywords": "History, Archaeology, Victoria, Gozo", "author": "", "article_body": "Works to build a new Gozo Museum in Victoria have been hit by a problem which curators are very familiar with - the discovery of archaeological remains during excavation works.\nNationalist MP Chris Said asked Gozo Minister Justyne Caruana in parliament on Wednesday to update the House about the project and when construction work would resume.\nIn a four-line reply, the minister said that in view of \"priceless archaeological discoveries\" made during excavation works, the ministry was working closely with the Superintendence for National Heritage for the site to be explored and the discoveries preserved.\nThe Sunday Times of Malta had reported on February 4 this year that an ancient quarry possibly dating back to the Punic and Roman periods was unearthed by workers on the site of the new museum.\nThe find was being viewed as a unique and extremely intriguing one for Gozo.\nThe site of the planned museum is the former Ninu Cremona Boys Secondary School in Republic Street.\nAt the time, the Ministry for Gozo told The Sunday Times of Malta that works on the museum were proceeding on schedule and the new discoveries would be incorporated with the revised designs.\nThe ministry noted also that the findings are subject to further investigations.\nThe museum is to showcase specimens related to natural history, folklore and archaeology.", "comment_count": 6, "id": 1967}, {"keywords": "Crime, Court, Murder", "author": "Edwina Brincat", "article_body": "A man accused of having strangled his partner gave a bizarre account to the police of what happened on the night of the murder last year.\nMichael Emmanuel is accused of having murdered mother-of-seven Maria Lourdes Agius but has pleaded legal insanity.\nThe claim has been contested by the attorney general, and jurors have to determine whether the accused was legally insane when he allegedly strangled his partner in their bed in the early hours of September 15.\nChief investigator Inspector James Grech said that in the initial interrogation the accused was non-cooperative, repeatedly saying “I don’t know” when questioned.\nWhen it was pointed out that there were marks around the victim’s neck, the man once insisted, “I don’t have anything to say,” adding that fingerprints would prove his innocence.\nRELATED STORIESMurder suspect suffered acute psychosis - psychiatrist'I love you' - Mother describes how she found her murdered daughter in bed\nBesides, how could he strangle the woman with a painful injury to his knuckles? he had told the police.\nHe had also made reference to an episode the previous February when he had returned home to find Maria Lourdes quarrelling with her mother. She later appeared breathless in bed, prompting the accused to nudge her for some five minutes to wake her up.\nShe finally had taken a deep breath, told him to leave her in peace and slept.\nHer three-year old daughter later told him, “mother has died,” the accused said under police interrogation.\nChange of heart\nBut some two-and-a-half hours after the first statement, Mr Emmanuel appeared to have a change of heart, telling the inspector, “I want to tell you the truth,” recounting what had allegedly taken place inside the couple’s bedroom on that September night.\nHe told the police that Maria Lourdes had woken up at about 2am, fetched a small cross and told him: “Your father (possibly referring to God) gave you a woman.”\nThen, putting the cross upon her neck, she had told him to “press a little.”\nMr Emmanuel that that kneeling beside her, he had “pressed really softly,” on the cross and “she did not wake up.”\nThe accused had insisted that he had done as she had willed.\n“I was scared. She started saying something and covered her face with the blanket. She struggled a little bit. Then she was dead….” The accused had told the police.\nHe added: “Look I have no scratches,” as though to prove that there had been no struggle.\nFaced with the fact that the victim had a bruised neck, the man had insisted, “No. I didn’t press a lot.”\nThe relationship breakdown\nMr Emmanuel told the police that his partner really loved him.\nHe had explained how on that same night, she had allegedly confessed that her youngest child, a couple of months old, had been fathered by another man.\nKnowing that he had fallen in love with another “young mother from Marsaxlokk,” Maria Lourdes had viewed herself as “an obstacle” to the man’s happiness. “Go and be happy with her,” she had allegedly told him.\nThe inspector said the couple’s relationship had begun when the victim had met Mr Emmanuel at St Julian’s and had afterwards spent a few days at his flat.\nAlthough she had at first offered him sexual favours against payment, the two had struck up a relationship.\nShortly after their first meeting, Maria Lourdes discovered that she was pregnant, bearing a child which was not the accused’s but who he had willingly accepted to raise as his own.\nTwo other children were born after that, the last a few months before the  alleged murder.\nOver the last year, the woman had changed, showing no interest in his work and life, constantly nagging him to “get money.” Mr Emmanuel had not been happy with the way his partner was caring for the kids, the court heard.\nOn September 13, two days before the alleged murder, the umpteenth violent row had broken out at the couple’s home, which escalated to the point that Maria Lourdes’ mother had stepped in, throwing a knife at Mr Emmanuel as he was allegedly punching and kicking her daughter.\nLater, the elderly lady had told the police how she had not intended to strike Mr Emmanuel but simply to make him stop. She was punched on the head for her act. The man had subsequently denied having hit her.\nAfter that incident, the man had ordered mother and daughter out of the flat. “Go away from here you crazy family. Go away,” he had allegedly shouted.\nThe elderly woman had later told the police how they had returned to their home after being treated in hospital and had changed the lock under police instructions.\nHowever, Maria Lourdes had still let him in when he turned up the next day, kicking the front door and demanding to see his child. The elderly woman later recalled that she had “not been comfortable” with Mr Emmanuel sleeping under the same roof and could barely sleep.\nShe had told the police that on the fateful night, around 2am, she had heard an argument inside the couple’s bedroom which, however, had stopped suddenly. Afterwards, she had heard Mr Emmanuel going up and down from the roof.\nWhen she bumped into him the next morning, he had told her, “Lourdes is not here. She went out,” rousing the woman’s suspicion.\nPsychiatrists testify\nTwo psychiatrists who had examined Michael Emmanuel when he was remanded in custody also gave evidence.\nJoseph Spiteri, forensic psychiatrist at Mount Carmel,who examined the patient nine days after the alleged murder, testified that he had met a young man with “delusions of grandeur” and paranoia.\nHe claimed to have constant contact with God, that his partner had killed herself, that he clearly heard God’s voice and that he spoke to his dead father.\nAll these factors were a reflection of the patient’s thought processes which showed him to be psychotic, needing anti-psychotic medication.\nClaire Axiaq, consultant psychiatrist at Mount Carmel Hospital, testified that she had noted highly religious character.\nThe man had also told the doctor that he heard God calling him, mentioning one instance when he had been cutting weeds back in his homeland, Ivory Coast.\nThe patient had been quite emotional, telling the doctor that his partner had killed herself and acting under the delusion that his father was controlling him.\nHe had admitted how he had killed the woman with a cross which he believed was transmitting shocks to her, the whole process having taken some 30 minutes, Dr Axiaq continued.\nBy the time the accused was discharged from the Forensic Unit in October 2018, on potent medication, he was not psychotic, not depressed and not suicidal, the doctor explained.\nThe man was re-admitted to Mount Carmel Hospital in April 2019 and was still on anti-psychotics.\nThe trial resumes on Thursday with the prosecution’s reply, final arguments by the defence, followed by Madam Justice Scerri Herrera’s final address to the jury.\nLawyers Charles Mercieca and Matthew Xuereb are prosecuting.\nLawyers Marc Sant and Dustin Camilleri are defence counsel.", "comment_count": 6, "id": 1968}, {"keywords": "Crime, Traffic, Health", "author": "", "article_body": "A motorist who had a black-out while driving and crashed has been acquitted of responsibility for the death a pedestrian in that incident. \nThe court found that although the driver was aware that he suffered a form of epilepsy, he had not been warned not to drive.\nGerman pedestrian Rainer Mader was killed when he was pinned between the car driven by the accused, Mario Gatt, 36 of Żurrieq, and a parked car, back in September 2015.\nIn a 39-page sentence, magistrate Neville Camilleri said the unfortunate pedestrian had been in the wrong place at the wrong time.\nThe court heard how Mr Gatt had been driving a VW Golf in Sliema when he crashed into a parked car and then hit the back of another car. The pedestrian was trapped between his car and the second car.\nThe court observed that Mr Gatt had been diagnosed as having temporal cavernoma - which is a defect in the veins of the brain.\nHe suffered a type of epilepsy that caused absence seizures and automatism.\nHe was subsequently operated on in October 2016.\nThe court made reference to notes by former Chief Justice (and President) Prof. Anthony Mamo that \"the act alone does not amount to guilt, but must be accompanied by a guilty mind\".\nLater, Prof. Mamo also wrote on acts committed during sleep-like conditions, saying: “No men can be held criminally liable for anything done by him in his sleep. Some writers, it is true, have suggested that such a man might conceivably be held accountable by reason of negligence (culpa) if, knowing himself to be subject to the somnambulistic habit and being able to foresee that this might lead him to violate the law, he did not take the necessary precautions to prevent this happening. But in any such exceptional case, any punishment which the law could inflict at all, would not be for the act done in sleep, but for the failure to take the necessary care when awake.”\nAfter also referring to case law, the court observed that in this particular case, Mr Gatt was totally unaware of what had happened and appeared surprised and very confused when he was approached immediately after the crash.\nThe motorist had also made no attempt to stop the car and, according to eye-witnesses, the vehicle did not appear to be under control immediately before the accident.\nFirst seizure while driving\nThe court observed that at the time of the accident, Mr Gatt was already seeing a neurologist and taking medication. His dosage of epilim had been increased just six days before the accident, but he never previously experienced a seizure of this nature - \"never more than a second or two\" - and never while driving.\nIt did not result that doctors had ever ordered Mr Gatt not to drive, although he had been warned not to swim in deep water and not to climb ladders.\nThe court said it found no link between the use of cannabis by the accused and his medical condition. The accident was not caused as a result of cannabis use, and a breathalyser test had also resulted negative.\nThe court, therefore, found Mr Gatt not guilty to having caused the pedestrian’s death through carelessness, negligent driving and lack of observance of regulations.\nHe was however found guilty of simple possession of 0.46 grams of cannabis and fined €75.\nA request for the court to ban Mr Gatt from driving was denied.  \nDr Joseph Giglio and Dr Quentin Tanti appeared for the accused.", "comment_count": 0, "id": 1969}, {"keywords": "Accident, Traffic", "author": "", "article_body": "An 84-year-old man from Iklin was grievously injured when he was hit by a car in Birkirkara on Wednesday morning.\nThe police said the accident happened in John Borg Street at about 10.30am.\nThe car, a Mercedes, was being driven by a 27-year-old man from Birkirkara. \nThe police are investigating.", "comment_count": 0, "id": 1970}, {"keywords": "Accident, Police", "author": "", "article_body": "A motorcyclist was hospitalised after she was injured in an accident on Wednesday.  \nThe accident happened in Triq Għajn Dwieli, Cospicua at 12.10pm.\nThe police said the 52-year-old from Kalkara had been driving a Peugeot Tweet motorcycle which was involved in a crash with a Ford Ka driven by a 36-year-old Afghan man.\nThe woman was seriously injured. \nA magisterial inquiry is under way.  ", "comment_count": 0, "id": 1971}, {"keywords": "Society, Politics", "author": "", "article_body": "Over three-quarters of the €1.7 billion budget for social protection in 2016 was spent on old age and health benefits, according to a comprehensive publication released on Wednesday by the National Statistics Office.\nThe budget increase by €70.3 million compared with 2015, with the largest rise – of €44 million – going to Social Security Contributory Benefits.\nSocial expenditure amounted to 16.5 per cent of the Gross Domestic Product, a ratio which put Malta in 24th place out of the 28 member states of the EU.\n\nAccording to the publication, more than half (54.6 per cent) of Malta’s 2016 social protection outlay was made up of cash benefits which are not subject to means-testing.\nOverall, 165,815 persons or 36 per cent of the Maltese population received at least one type of social security benefit, with 88,479 people receiving an old age type pension.\nThe average social security recipient received €4,823 in benefit income.\n\nYou can read the full publication below.", "comment_count": 3, "id": 1972}, {"keywords": "Gozo, Civil society, Court", "author": "", "article_body": "Outraged astronomers and environmentalists have launched a crowdfunding appeal in the hopes of drumming up the €2,000 needed to appeal a decision to allow a restaurant at a sensitive site in Dwejra to expand.\nFifteen organisations, ranging from the University of Malta's Institute of Space Sciences and Astronomy to Moviment Graffitti and Birdlife Malta, have put their name to the crowdfunding appeal.\nThe funds raised would be used to file a court appeal against an Environmental Planning Tribunal decision taken last week which will effectively allow the Azure Window Restaurant in Dwejra to become bigger and brighter.\n\n€2,000 would allow activists to cover the costs of filing the appeal as well as paying for any eventual fines incurred should the court appeal be unsuccessful. \nActivist Cami Appelgren indicated in a post on Facebook that the target was within reach\nThe Tribunal overturned an earlier rejection by the Planning Authority and prompted an outpouring of anger among environmentalists. Nature Trust Malta called it “a travesty of justice”. and warned Malta was \"shooting itself in the foot\" by allowing such projects to go ahead.\nAstronomers say Dwejra is one of the few remaining spots in Malta and Gozo which are dark enough to allow them to observe the Milky Way.\nWhich organisations are backing the crowdfunding appeal?\n- BirdLife Malta- Bicycle Advocacy Group- Din l-Art Helwa- FAA Flimkien Ghal Ambjent Ahjar- Friends of the Earth Malta- Isles of the Left- Light Pollution Awareness Group- Moviment Graffitti - Nature Trust - FEE Malta- Ramblers Malta- Archaeological Society Malta- The Astronomical Society of Malta - Institute of Space Sciences and Astronomy - ISSA - University of Malta- Wirt Għawdex- Żminijietna - Voice of the Left", "comment_count": 29, "id": 1973}, {"keywords": "European Union, Politics, Joseph Muscat", "author": "Vanessa Macdonald", "article_body": "Updated at 3pm\nPrime Minister Joseph Muscat has pledged to continue working as Prime Minister \"with more vigour\", one day after his hopes of making it to the European Union's top table were dashed. \nSpeaking to the press in Prague, Dr Muscat said that he would not comment on talk about him having been one of the names touted in the race to nominate new presidents for the EU's various institutions.\n\"It's not up to me to say who the candidates were,\" Dr Muscat said. \"Some people in the press mentioned my name, it's not up to me to comment about that\". \nBrussels insiders told Times of Malta that the Maltese prime minister was never a genuine contender for one of the Brussels posts, and Dr Muscat's name was also conspicuous by its absence in online discussion fora such as Twitter.\nOne person who did suggest that Dr Muscat had come \"very close\" to succeeding Donald Tusk as EU Council president was his own spokesman, Kurt Farrugia.\n\"Very close. True\", he tweeted on Tuesday night. \n\n \nSo what are Dr Muscat's options?\n1. Stay on as prime minister\nDr Muscat had said before the 2017 general election that he had no intention of contesting another election, after two terms at the helm of the country.\nHowever, he has never said at what point he would step down – a crucial matter, as his successor would need time to build up their own support.\nIt is, of course, possible that he had made the promise because he thought he would get a top job in Brussels. With that prospect no longer in the pipeline, he might well change his mind and stick around as prime minister. \nDr Muscat speaking to the press.\nDr Muscat seemed to hint at that option on Wednesday, telling the press he would continue in that job \"with more vigour\". \nRELATED STORIESMuscat unlikely to land a top jobWho is Ursula von der Leyen, the EU Commission's new leader?\nThat might delight some members of his Labour team, like MP Edward Zammit Lewis, who has said that with Dr Muscat at the helm, the party is the “Real Madrid of politics”.\nIn February 2018, Dr Muscat had reiterated his intention to step down – but this year, a group of supporters led by former Labour Party president Manwel Cuschieri, former GWU secretary general Tony Zarb and former Labour official Guza Cassar started a petition asking him to stay on.\nFl-Interess ta’ Malta managed to get 500 signatures within hours but the figure has not been recently updated.\n2. Wait for San Anton Palace to be vacant\nA long shot. President George Vella has only just finished unpacking and it will be five years until the post is vacant again.\nBut that does not mean he might not be a hopeful; after all he would not be the first prime minister who leaves one domestic limelight to take up another.\n3. Keep an eye on Brussels\nThe headline vacancies appear to be wrapped up, but there will soon be a vacancy for a European Commissioner. That comes with a salary of around €22000 a month, numerous allowances and a very good pension - useful when you want to take the family on holiday to Dubai.\nA new Commission is appointed every five years, within six months of the elections to the European Parliament (in this case, last May), and there are 28 Commissioners, shifting down to 27 once the UK exits the European Union.\nThe member states’ nominations are scrutinised by the European Parliament at a collegial – not individual - level, and the Commissioners would take up their posts in November. \nMuscat's hopes of succeeding Donald Tusk as EU Council president failed to materialise. Photo: DOI/Omar Camilleri\nAs a sitting prime minister, Dr Muscat could expect to land a significant portfolio and would also harbour expectations to be named one of the Commission's first vice-presidents: a somewhat ceremonial title, but which comes with a marginally higher wage packet. \nThe current commissioner, Karmenu Vella, had been nominated by the Labour Party in 2014, and holds the Environment, Maritime Affairs and Fisheries portfolio. However, Dr Muscat could get any portfolio the president of the Commission decides on.\n4. Retire, sort of\nHardly, at the age of 45. But he could retire from politics, taking up a career in the private sector. He holds a Doctorate of Philosophy in Management Research and before becoming prime minister, he had worked as an investment consultant.\nRELATED STORIESA journalist-turned-politician will lead the European Parliament\nBut how would that compare to what Japanese organisation guru Marie Kondo would describe as the ‘spark of joy’ that comes from posing with French President Emmanuel Macron?\n5. The world is his oyster\nThere are plenty of other posts coming up around the world, from the vacancy at the International Monetary Fund once Christine Lagarde leaves - admittedly an unlikely destination - to the Commonwealth Secretary General, who has to be replaced in 2021. It is unlikely that he would have his eye on the post of Secretary General of the United Nations, given that – according to Wikipedia – “most Secretaries-General are compromise candidates from middle powers and have little prior fame”.", "comment_count": 202, "id": 1974}, {"keywords": "Conflict, Police, Crime, Paola, Santa Venera", "author": "", "article_body": "A 21-year-old man from Santa Venera was grievously injured in a fight at a football ground in Paola on Tuesday.\nThe police said the accident took place in Triq il-Knisja, at around 9.30pm. The victim was in his car when he was approached by two men unknown to him, who he claimed attacked him.\nHe went to the Paola Health Centre for treatment.\nThe police are investigating.", "comment_count": 0, "id": 1975}, {"keywords": "Government, Parliament", "author": "Ivan Martin", "article_body": "Around 90% of the Auditor General’s recommendations to government in an annual report last year were being worked upon or had already been implemented, according to the head of the civil service. \nAddressing a press conference on Wednesday, Principal Permanent Secretary Mario Cutajar said that of 192 recommendations put forward by the NAO, 172 had been “accepted”. \nHe told reporters that 332 interventions and action plans had been drafted in reaction to the recommendations, 78% of which had already been implemented. \nThese interventions and action plans were reviewed by the government’s own internal audit office the Internal Audit Investigations Department, to ensure transparency, he said.\nDetailing the recommendations not accepted, Mr Cutajar said some included basic errors by the NAO which had been communicated and discussed. \nThe civil service on Wednesday published its fourth annual reaction to the Auditor General’s annual report for 2017.\nThe report includes reactions to several other reports released by the NAO throughout 2018, a first for the civil service. \nA parliamentary officer, the Auditor General has free reign to audit any government entity in the annual report released every year. \nMr Cutajar said that it had been the previous Labour administration’s decision to undertake this initiative. \nTrust in the civil service, he said, was 18% higher than the EU average, and this he said, was because of its transparent approach. \nThe other reports that the civil service is replying to include five own-initiative NAO investigations, and a report on government IT systems.", "comment_count": 3, "id": 1976}, {"keywords": "Accident, Police, Żabbar, Cospicua", "author": "", "article_body": "A teenager from Żabbar was grievously injured on Tuesday when he lost control of the bicycle he was riding and crashed into a bollard.\nThe accident happened in Triq Santa Tereża, Cospicua, at 10.15pm.\nThe 17-year-old victim was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1977}, {"keywords": "Court, Migration, Murder", "author": "Edwina Brincat and Philip Leone Ganado ", "article_body": "Evidence against two soldiers charged with the racially-motivated murder of a man was presented in court on Wednesday.\nFrancesco Fenech, 21, and Lorin Scicluna, 22, stand accused of having killed Lassana Cisse Souleymane, 42, in a drive-by shooting in Birżebbuġa last April. They deny the charges of what is believed to be Malta's first racially-motivated murder.\nThe two were also charged with the attempted murder of two more migrants in a separate shooting on the same day.  \nWhat emerged in Wednesday's hearing\n\nScicluna named Fenech as the shooter while in police custody, having denied firing the gun but having initially refused to provide a name.\nDylan German - Scicluna's friend and Fenech's cousin - described Scicluna a \"Nazi\" because of his comments about black people.\nScicluna and German bonded over a passion for weapons and visited the shooting range together.\nGerman said that Scicluna confessed the murder to him two weeks later, after Scicluna asked his advice on busting a gun barrel (which would prevent a bullet being traced back). According to German, Scicluna said Fenech had been with him and that he had been drinking before the murder.\nGerman said in court he had been told about the murder by Scicluna, despite having earlier said while under custody that his cousin, Fenech, had told him of his involvement. The witness insisted his statements in custody were untrue.\n\nLive Blog\n_______________________________________________________________\n12.55pm That's it for today. The next hearing will be on July 16. \n_______________________________________________________________\n‘I’m not the one who fired’ Scicluna 'told' officers\n12.50pm The officer says Lorin Scicluna had not wanted to get his friend into trouble. He says Jason Azzopardi, Scicluna's lawyer at the time, had also urged him to tell the truth: \"Remember you have a family back home. Don’t shoulder the blame if you did not shoot.”\nThe scene of the drive-by shooting.\nThe lawyer had said this in the presence of police officers, the officer testifies, but Scicluna had just insisted, weeping: \"I'm not the one who fired.\" It was only just before the return to the lock-up that Francesco Fenech was named.\n_______________________________________________________________\nNo lawyer present when Scicluna named Fenech as gunman\n12.40pm Lawyer Giannella de Marco now asks whether Lorin Scicluna named Francesco Fenech, her client, as the shooter after being prompted with the suggestion: 'Was it your friend the soldier?' Officer Gerada, testifying, says he had been instructed by the investigating inspector, Trevor Micallef, to make the suggestion. The inspector was present throughout, but stepped out of the car as they reached the depot. Gerada remained alone was Scicluna and, seemingly more comfortable, named Fenech as the shooter. \n\"I want justice to be done,\" Gerada says. \"Lorin insisted so much that he had not pulled the trigger, that I felt that it would go against justice if he were to take all the blame when he had not fired the shots.\"\n12.30pm Giannella de Marco, appearing for  Fenech, is now cross-examining the officer. She asks whether Scicluna named Fenech as the shooter in the presence of his lawyer - then Jason Azzopardi - or before a camera. No, the officer says. Was the lawyer with him on the day Scicluna made his claim about renting his car to a Libyan man? Not all the time, the officer says, adding that the lawyer was following in his own car, getting out when they stopped in Attard, and leaving later, around Paola. The lawyer was not present when Scicluna named Fenech. \n_______________________________________________________________\nScicluna weeps as police officers testify\n12.20pm As the officer testifies, Lorin Scicluna weeps silently at the dock. Francesco Fenech looks passively ahead, never making eye contact with his co-accused. \n_______________________________________________________________\nScicluna named Fenech as the shooter - police officer\n12.10pm We're back, with a number of police officers to testify next. Officer Gerada takes the stand: he accompanied Lorin Scicluna to three places where he had claimed he had lent his Toyota Starlet, the vehicle driven in the shooting, to a Libyan man. But the officer says he sensed Scicluna was making up the story. \nThe officer says Scicluna insisted he had not carried out the shooting, and when pressed, had broken down inside the police car. \"I did not shoot, I did not shoot\". The officer says he told Scicluna to tell him the name of the person who fired, as otherwise he would shoulder all the blame. Scicluna said: \"You know who fired the shots\". \nOn the way to the lock-up, the man seemed hestitant: \"I don't want to tell you his name,\" Scicluna said, according to the officer. \"I don't want to land him in jail.\"\nUnder further pressure, he finally blurted out: \"Francesco Fenech fired. Now my friend will end up in jail.\"\nA photo of Lassana Cisse left at a memorial after the murder in Ħal Far on April 6.\n_______________________________________________________________\nMagistrate warns witness against lying\n11.54am Franco Debono, appearing for Lorin Scicluna, presses the point.\n\"Do you realise that what you said during the confrontation with your cousin was very serious?\" Yes. \"Did you say it because it was true that Francesco had confessed to you his involvement in the shooting?\" No. \"So you are saying you lied at the police depot? Why didn't you tell the police? You put your cousin in a lot of trouble?\" I thought I would cause more trouble.\nA parting shot: \"Or is it because you actually said the truth then, and not now?\" \nThe witness sticks to his version. The court has paused for a break of a few minutes. \n11.45am For some time, the court has been focused on an apparent inconsistency in the witness's statements: was it Lorin Scicluna, alone, who told him about the shooting, as the witness said in court today? Or was it his cousin, Francesco Fenech, as he had allegedly said on an earlier occasion in police custody?\nThe witness insists the correct version is what he said today under oath, that Scicluna had told him everything. \"I had been under shock, and under arrest, when I said Francesco had told me about his involvement,\" he says. \"I wanted to put pressure on him. I didn't known who was telling the truth.\"\nThe magistrate warns him that his job is not to act as an investigator. \n11.40am The witness, Dylan German, is asked yet again whether he and Lorin Scicluna were alone when the accused told him about the shooting. \"Yes, I'm sure, I'm sure, I'm sure,\" he says. But Inspector Keith Arnaud now asks him about a confrontation with his cousin (the other accused, Francesco Fenech) in police custody. The inspector says the witness had said then that his cousin had himself told him about the shooting. \n\"Sorry, I forgot something,\" the witness says, now adding that his cousin had told him he had been at the pastizzeria, where Scicluna worked, before the shooting. The magistrate steps in: he senses that the witness is being evasive and inconsistent. He warns him that if he caught lying he would be \"sent downstairs\", to the lock-up.\n_______________________________________________________________\nDylan German says Fenech was ‘never racist or violent’\n11.30am Still under cross-examination, the witness - Dylan German, Francesco Fenech's cousin - repeats that his cousin had never said or done anything indicating he was racist or violent. He insists Lorin Scicluna had implicated his cousin after telling the witness about the murder, because he was worried the witness would go to the police. \nLawyer Franco Debono now asks whether German is certain has cousin wasn't there when Scicluna told him about the murder (two weeks after it happened). \"I'm sure,\" German says. \"We were alone in my garage at the time\".  Was his cousin present at any time? \"It could be\". Had he dropped by at all that day? \"I'm not sure\". \nInspector Keith Arnaud, the prosecutor officer, steps in: the defence lawyer has asked this question a million times, he says. The questioning takes a different turn. \n11.25am Franco Debono (appearing for Lorin Scicluna) now asks why the witness had been shocked to hear of his cousin Francesco Fenech's possible involvement in the shooting when he knew Fenech had already been with Scicluna when they kicked a migrant's bike. \"Perhaps because a person was killed,\" the witness replies quickly. \"I believe everyone would be shocked.\"\nHe passes comments about Dr Debono’s line of cross examination, but the magistrate intervenes, instructing him to answer the questions without any further arguments.\n_______________________________________________________________\nLassana Cisse was killed in Ħal Far on April 6.\n_________________________________________________\nScicluna's defence lawyer starts cross-examination\n11.20am Franco Debono, appearing for Lorin Scicluna, is now questioning the witness. Why did you label Scicluna a \"Nazi\" when you couldn't remember the exact words he told you or the place where it happened, he asks. The witness says Scicluna had spoken to him face-to-face and used foul language when referring to migrants. \nQuestioning turns to the visits Scicluna and the witness had made to the shooting range. Scicluna had taken more than 100 shots at a target, an A4-sized circle drawn on a board, the witness says. The distance between shooter and target was between 15 and 25 metres. \n_______________________________________________________________\nGerman says Scicluna asked for help with bust gun barrel\n11.10am The cross-examination continues. Defence lawyer Giannella de Marco asks about the time Lorin Scicluna wanted advice about busting a gun barrel. The gun's riflings, which mark the bullet and make it possible to trace it back to the gun, would be totally destroyed, the witness says.\nAsked what he had been told about the night of the murder, German says Scicluna had said he fired at several migrants and stopped because of a weapon malfunction. The witness says he was shocked and angry at hearing this, knowing \"he would lose his good job and get into trouble\". \n_______________________________________________________________\nFenech's defence lawyer starts cross-examination\n11.05am Defence lawyer Giannella de Marco (appearing for Francesco Fenech) is now starting a cross-examination. She asks about the first time the witness met Lorin Scicluna: it was just chance that Scicluna's car had stopped close to his house, the witness says, and he had helped restart it. Was Scicluna a good shot when they visited the shooting range? Very, the witness says. Scicluna's lawyers object to the question, pointing out that targets at the range were stationary. \n_______________________________________________________________\nGerman grew suspicious after reading of a Toyota \n11am Dylan German says he texted his cousin after hearing of the shooting on the news, warning him not to keep bad company. \"What made you do that,\" inspector Keith Arnaud asks. German says he knew Lorin Scicluna had a Toyota Starlet and became suspicious when media reports spoke of same type of car involved in the shooting. \n_______________________________________________________________\nDylan German says Fenech denied involvement\n10.55am The witness says his cousin, Francesco Fenech, denied having had anything to do with the shooting, breaking in tears and swearing he had only been involved in a separate incident where he and Lorin Scicluna had kicked a migrant's bike. Scicluna, meanwhile, told German he had thrown ammunition into the sea at Delimara and had removed his car's number plates before the April 6 murder. \nThe witness, Dylan German, says he had been asked by police to confront Francesco during interrogation. \"I was rather confused at that time,\" he says. \"I didn’t know whom to believe.\" German reiterates that his cousin had always denied any involvement. He says the two grew up together - Fenech is the younger by three years - and that his cousin had never shown any signs of racism and violence. \n_______________________________________________________________\n\n_________________________________________________\n‘Scicluna told me he fired shots'\n10.50am Dylan German, cousin of one of the accused, is currently testifying. He says that Lorin Scicluna opened up to him about the murder after asking his advice about busting up a gun barrel.\nGerman says Scicluna told him he had been at work at the pastizzeria before having a drink, going home and fetching his gun, driving to Ħal Far for the murder. He said he had had a drink too many, that he had shot eight or 10 rounds at several black people, and that Francesco Fenech (German's cousin) had been with him. \n_______________________________________________________________\nGerman describes co-accused Lorin Scicluna as a ‘Nazi’\n10.40am The witness says Lorin Scicluna had a semi-automatic pistol he sometimes used when they went to the shooting range together, while other times they would use weapons loaned at the facility.\nBut he says Scicluna once made a comment about a black passer-by, which made him think of Scicluna as a \"Nazi\". Another time, Scicluna asked him for advice on how to bust up a gun barrel, which the witness says he strongly advised him not to do because of the danger. The witness says Scicluna never told him his intentions, but that he realised there was something wrong. \n_______________________________________________________________\nDylan German, cousin of accused Francesco Fenech testifies\n10.35am Dylan German, Francesco Fenech's cousin, is the next to testify. He identifies the two accused - his cousin and Lorin Scicluna - in the courtroom. He says he met Scicluna for the first time on April 20, when he and his cousin helped him to restart his white Toyota Starlet, which had run out of fuel. He and Scicluna soon realised they shared a passion for weapons and kept in touch, occasionally going to a shooting range together.  \n_______________________________________________________________\nOfficer retraced suspect's steps - and filmed it \n10.30am Superintendent Josric Mifsud tells the court that investigations revealed that another person had hit in the same stretch of road and suffered grievous injuries, and that Francesco Fenech was the person in the car with Lorin Scicluna.\nThe police officer says he accompanied Scicluna to Attard, to the pastizzeria where he worked, and traced the route the accused had taken on that fateful night. The officer filmed the entire route, step by step. He hands the footage to the court. \n_______________________________________________________________\nTaxi driver first to see victim Lassana Cisse\n10.25am Police also spoke to taxi driver who first spotted the fatally-wounded man, and called emergency services, but had left the site because he did not feel comfortable. \n_______________________________________________________________\nSuperintendent Mifsud describes ‘copious’ blood at scene\n10.20am Superintendent Josric Mifsud testifies that on April 6 he had a call late in the evening about somebody dead in Triq tal-Ġebel. On site, he saw a copious amount of blood trickling down, and a walkman still playing music.\nTwo other victims, who both survived, had been taken to hospital for treatment. One, Ibrahim Bah, told police they heard petard like sounds and saw a white car, before he was hit by a bullet in his rear. The other victim, Mohammed Diallo, was struck in his pelvic area. The autopsy on Lassana Cisse revealed a bullet which fell out when the brain was removed.\n_______________________________________________________________\nDefendants Francesco Fenech and Lorin Scicluna enter court\n10.15am The two men accused of the murder, Francesco Fenech and Lorin Scicluna, are now in the courtroom, both wearing black suits. Superintendent Josric Mifsud, who was at the scene on the night of the murder, is taking the stand.\n_______________________________________________________________\nCourt opens on 3rd day of murder trial\n10am The courtroom is open and people are seated. The two suspects have yet to be brought in, however.\n_______________________________________________________________\nHighlights from the last hearing\n\nFrancesco Fenech admitted to taunting migrants but denied shooting them\nLorin Scicluna feared migrants were taking over\nShots appear to have been fired from driver's side of white Toyota\nSoldiers wanted to burst pistol's barrel\n\nLawyer Franco Debono is appearing for Scicluna, and Kris Busietta, Giannella de Marco and Stephen Tonna Lowell for Fenech. Inspector Keith Arnaud is prosecuting. Nadia Attard is appearing for the Attorney General's office. ", "comment_count": 0, "id": 1978}, {"keywords": "Education, Health", "author": "", "article_body": "Teachers need a better work-life balance as well as reduced workloads and modern working environments, a study on their mental well-being has revealed.\nThey also need more autonomy, improved overall respect for the profession, and smaller classes, the qualitative study has shown.\nThe study, which explored factors that are perceived to affect the psychological well-being of teachers in Maltese State secondary schools was conducted by Audri Mizzi, following the award of an Endeavour Scholarship to partially fund a Master of Science in Psychology.\nMost teachers start their holidays this week but a closer look at the experience of teachers in schools paints a picture that might not be as appealing.\nAmid claims that teachers have it easy, many vacancies for the job remain unfilled.\nRELATED STORIESTeachers’ work-life balance ‘non-existent’\nMs Mizzi explained that the recently-conducted study sought to identify factors that serve to enhance or diminish the quality of teachers’ well-being, with the aim of improving teacher retention, recruitment, as well as the quality of teaching and learning in Malta.\nWhile the rate of teacher shortage differs across different countries, the overall rate of resignations among qualified teachers in European countries is considered to be relatively high. Moreover, the unattractiveness of the profession as a result of increased work demands and low professional esteem has steered graduate teachers away from the profession altogether, she said.\nEfforts to dignify the teaching profession severely lacking\nMs Mizzi said that research on the organisational factors affecting teachers in Maltese schools has remained limited to quantitatively assessing causes of stress, burnout, and job dissatisfaction.\nFindings showed that teachers’ understanding of their own well-being centred on feelings of overall contentment, good mental health, and job satisfaction.\nIn Maltese public secondary schools, a state of well-being was perceived to be conditioned by students’ diversity and behaviour, school population, workload, collegiality, physical school environment, leadership practices, and organisational support.\nWhile personal resilience was useful for teachers to develop coping strategies to deal with instances of negative well-being in the workplace, participants advocated the need for more emotional awareness during teacher training.\nShe said many of the people interviewed for this study argued that university courses did not adequately prepare them for the exigencies of the job, resulting in a poor life-work balance, strained relationships, and excessive stress, specifically in the first years of teaching.\nFundamentally, participants felt that efforts to dignify the teaching profession in Malta were severely lacking, which was reflected in the lack of professional consultation, lower rates of student intakes for the job, and higher rates of teacher attrition in Malta, she said.\nTeachers also claimed that public perceptions of the profession, as well as incessant curricular changes and expectations also had a negative effect on their well-being.\nMs Mizzi said that to her surprise, only a third of the participants were aware of the employee support programme offering free counselling services to all public employees in Malta.\nSmaller classes, reduced workloads, modernised working environments, more autonomy and overall respect for the profession were among the suggested remedial action.\nFindings extracted from participants’ experiences suggest that while positive and negative workplace practices can influence teacher well-being, Malta still has a long way to go to effectively improve the well-being of teachers.\nMs Mizzi said that a student-centred approach in education should never underestimate the importance of educators.", "comment_count": 30, "id": 1979}, {"keywords": "Society, Family, Health", "author": "Claudia Calleja", "article_body": "Updated 6pm with warning by the Commissioner for Mental Health\nMalta may soon have a national suicide crisis line as mental health professionals will be coming together to discuss a way to make this happen, according to psychiatrist Mark Xuereb.\n“A lot has already been done to tackle mental health, including suicide, but we need to work together. It’s time to stop talking and take action,” said Dr Xuereb who is a member of Crisis Resolution Malta (CRM) – a private network made up of experienced professionals from various backgrounds.\nCRM is working on bringing all stakeholders together, under the patronage of the Presidency, to create a three-digit national suicide crisis line, he said.\nPeople having suicidal thoughts will be able to call 24/7 to get all the support they need from trained professionals – for free. \nCRM, which currently operates a generic support line 9933 9966, was already in touch with UK suicide prevention charity Samaritans and international charity Befrienders Worldwide for training support, he added.\nRecent figures tabled in Parliament showed there were 137 suicides between 2013 and 2017 in Malta. Various support lines are already available for people suffering from mental health problems, including those having suicidal thoughts. The problem is that there is no one centralised service dedicated specifically to suicide prevention.\nRELATED STORIESPsychiatrists warn against TMS as first-line treatment\nDr Xuereb has long been calling for a national suicide helpline and the setting up of a crisis resolution and home treatment team – made up of doctors, psychologists, psychiatrists, social workers and lawyers among others.\nDr Xuereb added that CRM was also in the process of issuing a call to bring together stakeholders to put together a National Suicide and Self Harm Database.\nThe database would include statistical data and demographics of all those who self-harm and die by suicide in Malta and Gozo. This will be put together into an annual report that will help guide policy makers and inform strategy, he said.\nHowever, Dr Xuereb added, while knowing the facts and the theory was a great start, it was not enough.\nRELATED STORIESMen make up 80% of suicides in Malta, half are marriedPlea to ‘break the silence on suicide’\n“Something needs to be done. We need to start acting,” he said.\n“Pills, therapy and electroconvulsive therapy are all effective forms of treatment – but it can take weeks to see results.\n“My team has been working behind the scenes and have been piloting a new form of treatment. With theta burst transcranial magnetic stimulation (TMS) we can reduce suicidal behaviour by between 53 and 56 per cent within 24 and 72 hours.”\nTMS uses a principle called electromagnetic induction that involves applying a pre-set changing magnetic field to a wire to induce an electromotive force or current in the conductor - the neuron. An external magnet is applied to produce theta waves close to certain parts of the brain that are known to be the brain’s portal to mood and suicidal thinking.\nIn so doing, this harmless, non-invasive and safe treatment induces the nerves deep within the brain to regrow and reconnect by a principle known as neuroplasticity, Dr Xuereb claimed.\n“Now we have a tool that allows us to send people home under supervision rather than send them to hospital,” he said, cautioning that no one should stop or change treatment without seeking advice.\nIn February, the Malta Association of Psychiatry had said that while TMS could prove useful for people with depression who were not responding well to other methods, it was not a recommended first-line treatment in line with international guidelines. \nCommissioner for Mental Health sounds warning on TMS\nThe Commissioner for Mental Health also sounded a warning, saying on Wednesday that transcranial magnetic stimulation (TMS) is currently not approved for use in reducing suicidal behaviour by leading international regulatory agencies such as the Food and Drug Administration (FDA) in the United States of America, the European Medicines Agency (EMA), and the United Kingdom National Institute for Health and Care Excellence (NICE).\n\"Evidence-based treatment and care requires thorough scientific analysis of efficacy and safety studies that have been done or still need to be conducted. Meanwhile it is incumbent upon local academia, professional organisations and national regulatory authorities to provide leadership, definitive results and direction. Our people deserve this,\" the commissioner said. \n\"Published reliable scientific data indicates that TMS is only approved for use in the treatment of refractory depression. This means TMS may be considered for use only in cases of severe depression that has not responded to other forms of standard treatment, such as medication or psychotherapy, or where such forms of treatment may not be suitable. More safety studies are needed todetermine long term effects.\"\nThe commissioner urged the authorities to urgently implement the National Emergency Psychiatric Response Service, appropriately resourced and functioning in accordance with best practice.\n\"Such a service should provide an adequate and timely response to persons and families experiencing a psychiatric emergency within the community, prevent unnecessary psychiatric hospital admissions, and provide follow-up to individuals and their families in their own homes or within their own communities,\" the commissioner said. \nIf you are thinking about suicide or need somebody to talk to, dial 179 or visit Kellimni.com", "comment_count": 2, "id": 1980}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta leads with a report by the Health Commissioner in the Ombudsman’s Office in which he accused the government of oppressing patients, denying them free and essential medicine and repeatedly breaching laws by refusing to revise discriminatory protocols.\nThe Malta Independent quotes Tourism Minister Konrad Mizzi saying there was no conflict of interest in the government holding shares in both Air Malta and Malta Air.\nMalta Today says Prime Minister Joseph Muscat’s hopes for one of two EU jobs have been dashed.\nL-Orizzont says Dr Muscat will stay put after he was not elected European Council President by a whisker.\nIn-Nazzjon leads with a report on the trial by jury in the murder of Maria Lourdes Agius, during which it was claimed on Tuesday that the accused was legally insane.", "comment_count": 0, "id": 1981}, {"keywords": "Health, Government", "author": "Ivan Camilleri", "article_body": "Updated at 11.55am\nThe Health Commissioner in the Ombudsman’s Office has accused the government of “oppressing” patients, denying them free and essential medicine they are entitled to and of repeatedly breaching laws by refusing to revise discriminatory protocols.\nIn the latest annual report for 2018, Commissioner for Health, Charles Messina, slammed the government for dragging its feet since 2013 to resolve discriminatory regulations which are denying patients their essential medicines.\nAccording to the report, the main issues between the commissioner and the Health Ministry are three.\nThese are the entitlement of free medicine in certain cases, which the government is denying due to costs; discriminatory protocols (rules) enacted by the government which determine the entitlement of certain medicines; and the provision of health services in some extraordinary cases.\n“The non-implementation of the recommendations about discriminatory and illegal protocols, recommended in 2013, is a very serious matter because they were meant to solve the discrimination and illegality created,” the commissioner said.\n“The patients are purely and simply being oppressed,” he charged.\nThe commissioner said that despite various meetings to solve the impasse, including with the Office of the Prime Minister, there seems to be no end to this problem because the Health Ministry “is very reluctant to take any action”.\nInsisting that the government was ignoring the Ombudsman’s Office – a constitutional set-up – the Commissioner for Health accused the administration of abuse.\n“The Ministry for Health seems to be taking advantage of the fact that the Office of the Ombudsman does not have executive powers,” the Commissioner said.\nIt is unacceptable that the government ignores a constitutionally-set-up body\nHealth industry sources told Times of Malta that the Health Commissioner has warned the government for many years about deficiencies in the system and has in the past even presented reports to the Office of the Prime Minister and Parliament.\n“Although most of the problems can be attributed to bureaucracy and the lack of will by the Health Ministry, it is unacceptable that the government ignores a constitutionally-set up body over a change of protocol and rules for the past six years,” the sources said.\nIn his report, the commissioner gave examples of the government’s resistance to solve the simplest of recommendations.\nOne of the 2017 cases concerns the purchase of a few pairs of elastic stockings which are used to improve blood circulation to cater for the smallest and the largest of sizes, the Commissioner said.\n“It is unbelievable that after more than two years the matter is still pending,” he added.\nBranded medicines\nThe issue of branded medicines is also another bone of contention which, according to the Ombudsman, the government seems to be resisting.\nWhile the government normally provides generic medicines to save costs, in the case of some exceptional cases, patients are ordered by their doctors to take branded (originals) products, as these are more effective.\nThe commissioner said that despite Health Minister Chris Fearne’s public commitment to revise the protocols and start providing these type of medicines for such cases, this has not happened.\nTo solve the issue, in 2017 the Health Minister set up a committee, called the Exceptional Medical Treatment Committee, to discuss and decide on pending requests by patients.\n“Unfortunately, the committee moved the goalposts with the result that the subject became the medicinal and not the patient,” the commissioner observed.\nThe commissioner said this was a matter of grave concern, because “unless given the appropriate treatment, patients will suffer the consequences”.\nCivil service waits\nAsked on Wednesday to react to the Ombudsman's findings, principal permanent secretary Mario Cutajar said the civil service would be analysing the report and taking action.\n“We always take action,” he said, adding that it was too early to comment further.", "comment_count": 23, "id": 1982}, {"keywords": "Police, Finance", "author": "Jacob Borg", "article_body": "▪ Police and Inland Revenue were meant to provide readily available expertise to the bureau \n▪ Regime to confiscate criminal assets ‘has serious shortcomings’\nMalta’s nascent Asset Recovery Bureau (ARB) was left in the lurch after both the Police Commissioner and Inland Revenue Commissioner said they were short of staff to assign full-time officers to work with the unit.\nWriting in the ARB’s first annual report, chairman Joseph Camilleri highlights how regulations setting up the bureau envisioned key roles within the bureau being occupied by experienced staff nominated by the police and Inland Revenue Department.\nMr Justice Emeritus Camilleri said the lack of staff availability from these two entities was “quite a big set-back for the setting up of a well-functioning ARB equipped with already skilled officers, as envisaged by the ARB regulations”.\nCriminal asset recovery is a vital plank in the fight against organised crime.\nThe judge said the regulations setting up the ARB had foreseen that the police nominated to work at the bureau would be pivotal for the investigative aspect of its work.\nOfficers from the Inland Revenue Department were likewise expected to provide the bureau with the necessary auditing and accounting skills.\nHe said the “unexpected development” obviously represented a significant shift away from the regulations setting up the bureau.\nInstead, they each accepted and appointed a liaison officer to assist the ARB when needed and a plan was agreed as to the way forward, the annual report says.\nThe report charts how the ARB had to move ahead without the support of this expected readily available technical expertise, by recruiting staff from elsewhere and providing them with specialised training.\nThe former judge did find some solace in the lack of trained staff made available to him by the police and Inland Revenue, saying this further ensured the bureau’s independence.\n‘Serious shortcomings in asset recovery regime’\nTimes of Malta previously reported how the bureau spent years in limbo after the Justice Ministry failed to give it the necessary legal tools to function. Judge Emeritus Camilleri confirmed as much in the annual report, stating the legal notice giving birth to the bureau was published in 2015, but the regulations were not bought into force immediately and “practically remained inoperative for about two years”.\nThe first members of the bureau’s board were appointed in November 2015, and a new board was appointed in 2017.\nRELATED STORIESBureau recovers €2,760 in criminal assetsOffice took three years to set up\n“The task of building the ARB from scratch fell on the shoulders of the current board as composed and chaired,” the annual report says.\nConfiscation of criminal assets has long been identified as a major lacuna in Malta’s arsenal against organised crime.\nThe ARB’s annual report highlights how court judgments ordering the confiscation of assets were often futile, as the confiscation regime has “some serious shortcomings which need to be addressed”.\nLast year, the bulk of assets recovered by the bureau were movable ones like bank accounts, cars and boats.\nThe remaining 17 per cent were related to immovable assets.", "comment_count": 3, "id": 1983}, {"keywords": "Technology", "author": "Philip Leone Ganado", "article_body": "Malta ranks among the bottom quarter of EU countries for broadband speeds, according to a new worldwide test. With an average speed of 18.16Mbps, Malta ranked 47th in the world, behind 21 other EU countries. \nAt average speeds, it would take around 37 minutes to download a 5GB film in Malta, compared to just eight minutes in top-rated country Taiwan and more than 30 hours in Yemen at the very bottom of the rankings. \nWhile Malta’s place in the annual ranking has remained nearly unchanged since 2017, its average internet speed has actually increased by around 78 per cent in the same time – from 10.17Mbps two years ago. \nWithin the EU, Sweden and Denmark topped the rankings with speeds around three times as fast as Malta. \nThe rankings were compiled by British comparison service Cable.co.uk, based on research carried out by M-Lab, a collaboration between Code for Science and Society, New America’s Open Technology Institute, Google and Princeton University’s PlanetLab. \nResearchers conducted 276 million broadband speed tests across 207 countries to draw up the rankings. \nSweden and Denmark topped EU rankings\nWorldwide, the study found that 37 of the top 50 fastest-performing countries were located in Europe, with 10 in Asia and the Pacific, two in North America, and just one in Africa. By contrast, 25 of the 50 slowest-performing countries are located in Africa and 12 in Arab States, with 10 in Asia and the Pacific, and three in South and Latin America.\n141 countries failed to achieve average speeds above 10Mbps, a speed deemed by UK telecoms watchdog Ofcom to be the minimum required to cope with the needs of a typical family or small business.\n“With average broadband speeds rising by 20.65 per cent in the last year the global picture looks rosy,” Dan Howdle, consumer telecoms analyst at Cable.co.uk, said on the worldwide implications of the study. \n“But the truth is faster countries are the ones lifting the average, pulling away at speed and leaving the slowest to stagnate. Last year, we measured the slowest five countries at 88 times slower than the five fastest. This year they are 125 times slower.”", "comment_count": 46, "id": 1984}, {"keywords": "Financial markets", "author": "", "article_body": "The Malta Business Registry (formerly the Registry of Companies), will be issuing certificates entirely on blockchain by the end of the year, offering features which  will be world firsts, Parliamentary Secretary Silvio Schembri told parliament on Tuesday.\nMr Schembri was piloting a Bill for the transposition of the second EU Payment Services Directive into Maltese law. The directive will standardise regulations for banks and for smaller payment service providers. The amendments affect the Banking Act and the Financial Institutions Act.\nAmong the more significant changes are new powers to the Malta Financial Services Authority which will allow it to act more quickly in cases demanding that action be taken, but not meriting the withdrawal of a licence.\nDr Schembri said that the government is taking steps to address money laundering, despite the “unjust criticism” which continued to be aimed at it. All of the proposals in the National Risk Assessment on the subject had been implemented.\nThe MFSA will be establishing a specialised team to counter crimes in the financial services sector, allocating more manpower and providing training to new and current staff.\nA consultative body will be tasked with developing a national financial services strategy to guide the sector’s development in Malta over the coming decade. Although there had been initiatives, he said, these initiatives had so far been developed piecemeal.\nThe consultative body would also allow the government to “keep its finger on the pulse” of the goings-on in the sector.\nNeed for autonomy for the regulator\nOpposition MP Kristy Debono argued that strengthening the MFSA and updating legislation was useless if the autonomy of the respective institutions could not be assured.\nThe banking sector was facing new challenges, having to deal with a diminished national reputation in a context where international regulators were insisting that banks carry out extensive due diligence on countries where they set up operations.\nThe loss of BOV’s last US dollar correspondent bank, ING Bank, had been foreshadowed by the Opposition for years, as the government’s attention had repeatedly been drawn to the fact that agreements with correspondent banks were being lost and new relationships were not being created to replace them.\nThese new challenges needed to be addressed in order to restore Malta’s reputation. However, operators in the sector were preoccupied that, if concrete steps were indeed being taken, the effects of these steps were not being felt.\nMs Debono made reference to the leaked correspondence between MFSA and Bank of Valletta. Bank of Valletta, she said, was given a week to agree to a “hefty overhaul” of its operations. She questioned whether the government should remain the largest shareholder of BoV, whether the perception of political influence in the Bank’s operations was being tackled, and what the next steps should be for the bank.", "comment_count": 0, "id": 1985}, {"keywords": "Environment, Mellieħa", "author": "", "article_body": "A fire which raged across a quarter of the Mizieb woodland late last month is estimated to have destroyed 4,600 trees Environment Minister Jose' Herrera told Parliament on Tuesday.\nAleppo Pine, Olive Trees, Gum Trees and Blue-leaved wattle - an invasive species known locally as l'Akaċja - were burned down.\nThe minister said the fire, on June 22-23, spread across 15 hectares of land.  \nRELATED STORIESMiżieb fire was three times larger than original estimateMiżieb fire finally under control\nHe was responding to a parliamentary question by Nationalist MP Robert Cutajar. \nDr Herrera had told Times of Malta on June 23 that environmental experts would assess the damage caused by a large fire in the Miżieb woodland.\nA report by Ambjent Malta and Environment and Resources Authority experts found that the fire had affected 180,000 square metres of the woodland - an area three times larger than that originally calculated. \nAuthorities have yet to say what they believe caused the fire. \n\n ", "comment_count": 18, "id": 1986}, {"keywords": "Sliema, Football", "author": "Claire Caruana", "article_body": "Fashion retailer Dizz Group is converting football pitches at Tigné into shops but it does not have permission from the sports facilities commission.\nAccording to plans unveiled last year, two Sliema Wanderers indoor football pitches situated on two levels at the Tigné complex will be converted into offices and retail outlets spread over 2,681 square metres.\nHowever, the body overseeing ventures between sports clubs and commercial entities has yet to grant permission.\nWorks are progressing at a steady pace and Dizz Group, the fashion retailer running the mall, is keen to open its doors in July. \nWhat is the delay about?\nThe football club had received “preliminary authorisation” from the Commission for the Commercialisation of Sports Facilities to transform the pitches into a mall. However, a company spokesman had said all agreements were subject to the “obtainment of full authorisation” from the commission in line with the law.\nThe project is the first of its kind, in that the football club is taking advantage of new legislation allowing sports organisations to commercialise their venues. The government hopes this will help them become financially self-sufficient. The law also specifies that the size of the sports facilities must not go down as a result of a commercialisation project.\nHowever, there are doubts over whether the project even has a development permit, as commission approval is necessary before any of the proposed ventures can be assessed by the Planning Authority. This is clearly stated in the document announcing the issue of unsecured bonds for D Shopping Malls Finance plc., which is fully owned by Dizz Group.\nWho are Dizz Group and what has their reaction been?\nDizz Group did not answer questions on the matter, despite repeated requests.\nAccording to a media report earlier this month, the mall is set to open its doors in July, with Dizz Group CEO Diane Izzo quoted as saying the retailer had been working on the project “for months”. \nThe report also included contact details for those interested in renting out offices at the complex, which Ms Izzo said would have about nine shops.\nDiane and Karl Izzo, owners of Dizz Group.\nHowever, a spokesman for the Youth, Sport and Voluntary Organisations Parliamentary Secretariat, under whose remit the commission falls, confirmed that the venture had yet to be given the green light. \nHe said the commission was dealing with the clubs and “all applications submitted by the relevant sporting entities are undergoing the established process according to the law”. But none of the applications had yet been approved.  \nThe Dizz Group’s co-owner, Karl Izzo, is a member of the commission but the spokesman for the parliamentary secretariat had insisted with Times of Malta he would not be involved in the project evaluation process and had disclosed his interests “from day one”. \nMr Izzo is Malta’s Ambassador to Montenegro and is also the coach of Malta’s national waterpolo team.\nThe fashion group has had a long-standing relationship with Sliema Wanderers FC, who secured a sponsorship deal with the retailer in 2016. \nAt the time, Sliema Wanderers FC president Keith Perry, who sits on Sports Malta’s board of directors, described the agreement with the Dizz Group as a “natural marriage”.", "comment_count": 15, "id": 1987}, {"keywords": "Accident, Ta' Xbiex", "author": "", "article_body": "Three cars were damaged in Ta' Xbiex on Tuesday afternoon, in a crash which left one of the affected cars with just three wheels.\nA Citroen C4, driven by a 34-year-old man from Ta' Xbiex, crashed into a Citroen Nemo coming from the opposite direction and a parked Peugeot 309.\nPolice were informed of the incident at around 3.45pm. Nobody was injured in the crash, they said. \n\n ", "comment_count": 10, "id": 1988}, {"keywords": "Crime, Murder", "author": "Edwina Brincat", "article_body": "Updated 6.34pm with pathologists' evidence below \nA man who stands accused of having strangled his partner suffered acute psychosis and was therefore insane in terms of the Criminal Code, psychiatrist Joseph Cassar told a jury on Tuesday.\nThe accused, Michael Emmanuel is pleading to have been legally insane when he strangled Maria Lourdes Agius. The Attorney General is contesting his claim. \nThe trial, which will determine whether that claim holds water, started on Monday when the victim's mother described how the relationship between her daughter and the accused had deteriorated, and how she found her daughter dead in bed. \nRELATED STORIES'I love you' - Mother describes how she found her murdered daughter in bedFormer partner of murdered Paola mother pleads legal insanity\nDr Cassar had been appointed by the Magistrates’ Court to examine Mr Emmanuel following his first admission to Mount Carmel Hospital in September 2018, less than a fortnight after the murder in Paola.\nDr Cassar had reported to the court that during an interview with the patient, on October 23, 2018, Mr Emmanuel was cognizant and cooperative, if anxious. Speech had been coherent and organized “in the sense that he could continue a conversation.”  \nHowever, on the basis of what the patient told him and after consulting the patient’s psychiatric file, Dr Cassar said he had concluded that Mr Emmanuel had “acute psychosis and was therefore insane according to the Criminal Code.”\nDr Cassar stood by his conclusion when he was questioned by the prosecution on Tuesday.\n“So you did not speak to the colleagues of the accused, his friends or Maltese family? Nor did you consult with other psychiatric professionals?” prosecuting lawyer Charles Mercieca asked.\n“No,” Dr Cassar replied.\n“Acute psychosis, contrary to non-acute, is not chronic but happens at a time, although it can last for up to a month. Mr Emmanuel was already being treated when I saw him.”\nDr Cassar explained how the accused, son of an Ivorian Christian pastor, had said that there was no past psychiatric history in the family.\n“This is what he told me. Obviously, I had no records from the Ivory Coast or any other country to verify. I relied on what he told me.”\n'Delusions of grandeur'\nDr Cassar said that on the basis of what the patient had recounted during that interview, coupled with his psychiatric file, including a note by another psychiatrist who had commented earlier that Mr Emmanuel had “some delusions of grandeur” and was “paranoidal towards his partner,” he had concluded that the man was acutely psychotic.\nA delusion was a “fixed, false belief,” Dr Cassar explained. In this case, Mr Emmanuel, who also claimed that God had spoken to him at a younger age when he still lived in his African village, believed that his partner Maria Lourdes had a bad omen which she asked him to remove.\nWhat he told me convinced me that he was delusional- Psychiatrist after examining the accused\nAfter “removing” the omen, the man had told the psychiatrist how he had placed a crucifix upon her as though to bless her.\n“I put the cross on her neck at 4.00am and I felt shock and again the cross shook,” the man had told Dr Cassar.\n“What he told me convinced me that he was delusional. What he said, I felt was enough,” Dr Cassar said, also making reference, under questioning, to another earlier instance when Mr Emmanuel had allegedly been drilling and the cement “came out in the form of a star.”\nAsked whether marijuana could induce such delusions, given that Mr Emmanuel appeared to have made regular use of the drug, Dr Cassar said that daily doses of marijuana “could lead to paranoidal delusions.”\nThis point was later seized upon by a juror seemed concerned with the fact that the jury was to assess the accused’s mental state at the time of the crime, when Dr Cassar had examined him over a month later.\nMarijuana effects could be picked up through a urine test up to four weeks after consumption, Dr Cassar explained. “That is the only way to determine that fact.”\n“Are you trained for people who lie?” Madam Justice Consuelo Scerri Herrera asked the doctor.\n“There is no training for that. We pick it from experience. Usually it takes experience and time. The context also makes a major difference,” Dr Cassar replied. “The way he was speaking impressed me. It was very emotional. He made me feel that he was doing something that he was called to do.”\nThe accused had been discharged from Mount Carmel Hospital on medication on October 17, 2018 and was re-admitted in April this year, while still on anti-psychotics.\n“After an hour’s meeting with the accused, based on the notes in his medical file, how sure can you be that he was telling the truth?” asked another juror.\n“With experience you feel a patient. I was seeing someone on a very high dose of psychotic drugs. Any other person, like you or me would probably have been asleep under such medication,” Dr Cassar replied. \nVictim was strangled, no sign of struggle\nPathologists Marie Therese Camilleri Podesta’ and Ali Salfraz said the victim, a mother-of-seven,  had died of asphyxia caused by pressure on the neck that was compatible with fresh bruising on her face, neck and scalp. \nThe victim had a lot of fresh bruising on the face, neck and even the scalp, with haemorrage in the underlying muscles of the neck, bruising on the pharynx and haemorrages even in the conjunctivi (white part) of the eyes.\n“These are not days. These are hours, few hours, minutes,” said Dr Salfraz when asked by defence lawyer Marc Sant about the dating of the bruises.\nThere were no struggle marks.\nA psychology graduate working at the Valletta YMCA shelter, Sarah Sciberras, recalled how on the evening of August 27, 2018, they had received a call from 179 about a man at the Birkirkara police station who needed shelter for the night.\nTwo policemen had accompanied that man to the shelter. It was Michael Emmanuel, looking very exhausted and somewhat disoriented.\nHe was about to trip on the spiral staircase while being taken to his room, but denied having drunk when asked, exhaling to prove to Ms Sciberras that there was no trace of alcohol on his breath.\nLater, while chatting to the woman in understandable English, he mentioned his two children, shutting his eyes and crying each time he referred to them. He was ‘very, very hurt’ because his partner had kicked him out.\nHe had only slept at the shelter for one night, waking up early the next morning and mingling with other residents in the yard.\nThe witness said that upon admission, the man had presented “no drug, no alcohol, no health issues.\nThe trial continues on Wednesday.\nLawyers Charles Mercieca and Matthew Xuereb are prosecuting.\nLawyers Marc Sant and Dustin Camilleri are defence counsel.", "comment_count": 0, "id": 1989}, {"keywords": "Diplomacy, PN", "author": "", "article_body": "The Nationalist Party has criticised the government for what it said is its lack of engagement regarding the situation in Libya.\nShadow minister Carm Mifsud Bonnici said several countries were actively seeking a diplomatic solution to the crisis in Libya, but Malta appeared to have abandoned the situation. \nRELATED STORIESLibyan PM tells Muscat of Tripoli fightingNeville Gafà back in Libya on government delegation\nLibyan Prime Minister Fajez Serraj was in Italy again over the past few days but Malta was no longer being considered as relevant. \nThe current situation in Libya was dangerous and could be a breeding ground for terrorist organisations, the PN said. This was a situation which Malta should not be ignoring.\nIts failure to act was a strategic mistake and a failure of its Mediterranean policy. \nThe PN statement was also signed by Roselyn Borg Knight, party international secretary.", "comment_count": 0, "id": 1990}, {"keywords": "Gozo, Żebbuġ (Gozo), Court", "author": "", "article_body": "A 28-year-old man was on Tuesday jailed two years and fined €5,000 after he pleaded guilty to slightly injuring three police officers.\nThe man, an Eritrean national who lives in Żebbuġ, Gozo, also admitted to having attacked, resisted and threatened the officers, disobeying their orders, breaching the peace and attacking and injuring a doctor while at the Gozo General Hospital.\nThe prosecution was led by Josef Gauci.", "comment_count": 0, "id": 1991}, {"keywords": "Poverty, Society, European Union", "author": "", "article_body": "Malta has moved up two places in an index of Sustainable Development Goals published on Tuesday, but while it ranks in the 28th place worldwide, it is only in the 20th place in the EU.\nMalta’s overall score was 75.8, compared to a regional average score of 70.4.\nThe report takes into account 230 indicators and 69 targets in 17 Sustainable Development Goals.\nMalta achieved one of the highest scores in the world for its progress on the No Poverty front, according to the latest report on the UN’s and EU’s Sustainable Development Goals Agenda.\nMalta’s score on Goal 1 of the Agenda - ending poverty in all its forms - was 99.9 out of 100, and on Goal 10 - reducing inequality - it was 94.6. Each country’s progress was ranked from green to red, with Malta ranking green for these two above, eight in the yellow category, showing that a less significant challenge remains; four in the orange goals where a very significant challenge remains; and three red goals (hunger, responsible consumption and production and life below water), where a major challenge remains.\nMalta progressed or remained static in all the categories, not regressing on any of the 17.\n\nElsewhere in the EU, the rich Nordic countries did best, occupying the three top places. However, the results were mixed, with progress on some goals being faster than in others while there was even a move away from the objectives in specific areas. According to the authors of the Report, Aart De Geus, Chairman and CEO of Bertelsmann Stiftung, and Jeffrey Sachs, Director Sustainable Development Solutions Network, no country in the world is on track to reach its 2030 goals.", "comment_count": 3, "id": 1992}, {"keywords": "Tourism, Sliema", "author": "Philip Leone Ganado", "article_body": "Tourism officials swooped down on Sliema’s Park Hotel on Tuesday morning after a court declared it unfit to host guests - but it seems nobody has yet thought to tell guests.\nWhen Times of Malta visited the hotel, none of the tourists exiting or entering the building had any idea of the problems facing the establishment and were shocked to hear that the hotel would be closing imminently.\n“We saw a lot of people in the lobby this morning and the staff all seemed very upset, so we realised something must be going on, but nobody has told us anything,” said one visitor from the UK, who is booked in at the hotel for the rest of the week.\nDisbelief and concern\nMost knew even less than that: by late morning, a single official from the Environmental Health Directorate could be glimpsed in the lobby but the situation at the hotel could otherwise have been mistaken for business as usual, with guests going about their days.\nOf 16 tourists from the UK, Germany, Italy and Spain who spoke to Times of Malta, not one had heard of the imminent closure, responding to the news with disbelief and concern as to how their holidays would be affected.\nThe tourism authority has said guests will be allowed to see out their bookings or move to a new hotel, while those scheduled to check in from Tuesday will immediately be put up elsewhere.\nYet despite a court saying the four-star hotel was unfit to offer services “in any category”, guests said they had not been shocked by conditions, although none had glowing reviews to offer.\n“The first room they put us in had water-marks on the wall and smelled of smoke so we asked for a new one, but the room we’re in now isn’t that bad,” one said.\nAnother guest shared a similar experience of having to change rooms, while others spoke of dirty towels, mediocre food and a generally dated and shabby appearance, with one saying photos on the booking website “must have been taken 20 years ago”.\nFilthy towels and exposed wires... guests of the hotel who posted reviews on TripAdvisor were not very complimentary. Photos: TripAdvisor\nBut overall, most said conditions were not far below par for a hotel of its price point.\n“When we booked the hotel we were quite happy, but then we went on TripAdvisor and saw the terrible reviews so we were quite worried before we arrived. We came with very low expectations,” one said.\n'Daytime Robbery'\nOn TripAdvisor, where a quarter of the 1,442 reviews are in the lowest star-rating, past guests were harsher in their assessments.\n“[T]hink blood stains on the sheets, brown stains on the towels, the dirtiest sun loungers you have ever seen, dusty carpet and walls, nothing working, staff that care more about arguing than solving the problem,” one reads.\nOther guests branded the hotel a “horror” and “daytime robbery”, with complaints including bed-bugs, broken showers and doors, and overall dirt and disrepair.\nThe hotel was first served with an enforcement notice by authorities in October 2016, followed by another in June 2017.\nThe owners have insisted the failings were “minor” and that they had spent around €500,000 on “extensive refurbishment” over the past year. A last-ditch effort to block the shutdown order was rejected by the court on Monday.", "comment_count": 28, "id": 1993}, {"keywords": "Accident, Marsaxlokk", "author": "Stephanie Fsadni", "article_body": "An Irish tourist who tried to save the life of a man found floating at St Peter’s Pool on Sunday described a dramatic scene of “screaming” and “panic” as the swimmer was pulled from the sea.\nRory Clarke’s experience has prompted him to highlight the need for guidance over the phone from the hospital in emergency situations as well as life-saving services and equipment at popular bathing sites in remote areas.\nThe 28-year-old, who is trained as a first responder, had just arrived on the rocky beach on the outskirts of Marsaxlokk when the swimmer, later identified as a 69-year-old Żejtun resident, was spotted in the water face down.\n“I had not even taken my shoes off yet when I heard lots of screaming. I rushed to see what was happening and saw young teenagers, probably locals, pulling a man from the sea. There was panic,” Mr Clarke told Times of Malta.\nMr Clarke believes the man was still alive when he was brought ashore and he tried to use CPR (cardiopulmonary resuscitation) to revive him. Other foreigners, whom Mr Clarke said were nurses on holiday, alternated with him in administering CPR. \nRory Clarke with his girlfriend Aislinn while on holiday in Malta.\nMeanwhile, a young local called the emergency services but Mr Clarke complained of a lack of assistance over the phone.\n“Our system must be different but in Ireland, when you call the emergency services, they stay online and talk you through until the ambulance arrives,” Mr Clarke said.\n“They tell you what to do, like checking the pulse and how to apply CPR.”\nAt one point, he called 112 again to see if the operator could tell him how long the ambulance was expected to take but he was not given an answer. “I don’t think they were very helpful, considering there was no lifeguard, no CPR equipment… There were about 200 people there and no medical aids,” he pointed out.\nRELATED STORIESMy father disappeared in 1978. They found his body eight years later'My son could still be alive'\nBy the time the ambulance arrived − some 25 minutes later, according to Mr Clarke – the man was unconscious. The paramedics tried to revive him using CPR before they certified him as having passed away.\n“I think that at such destinations, where lots of people are swimming, there needs to be a lifeguard or else CPR equipment such as a mask and a defribillator… St Peter’s Pool is so far away from any services; it’s too risky. Facilities need to be provided,” he said.\nThe experience has left a sour taste for Mr Clarke, who has been in Malta for about a week.\n“We really enjoyed our time here so far but yesterday [Sunday] was really scary,” he said.\nIn another fatality, a 75-year-old man died after swimming in Birżebbuġa on Monday afternoon. \nThe Qormi man was swimming at Pretty Bay when he found himself in trouble. \nHe was lifted ashore by people nearby and handed over to paramedics who were alerted to the incident at around 3.20pm, the police said.", "comment_count": 29, "id": 1994}, {"keywords": "Sliema, Tourism", "author": "", "article_body": "A four-star hotel in Sliema has been told to shut its doors after a court found that it was so run-down that it was not suitable to host guests.\nThe Park Hotel was told by the Malta Tourism Authority to refuse any further bookings and shut down.\nIn a statement, the MTA said it has taken over the hotel’s operations until its final guest packs his or her bags and leaves. Guests currently at the hotel have been offered alternative accommodation.\nHowever, when a Times of Malta journalist visited the hotel, none of the guests had heard about the closure.\nRELATED STORIES'What do you mean our hotel is shutting down?'\nA last-ditch attempt by the hotel owners to block the shutdown order failed on Monday, when a court of appeal threw out an injunction request filed by the hotel.\n“Photos exhibited by inspectors speak for themselves,” the court said. “The shortcomings are so serious that they make the hotel unsuitable to host guests and offer them hotel services, for any category”. \nThe MTA had issued an enforcement notice ordering the hotel to close down in June, highlighting a series of serious shortcomings and saying the hotel fell well short of standards expected of a four-star establishment.\nHotel owners disagreed with that assessment, said failings were “minor” and arguing that it had spent around €500,000 on “extensive refurbishment” over the past year.\nThey also contested the MTA order on legal grounds, arguing that the enforcement order could not be put into action until their appeal against it had been concluded.\nThe court dismissed those claims.\nIt is the third time the tourism regulator has told the hotel that it must close for falling short of required standards: an initial enforcement notice issued in October 2016 was followed by a second one in June 2017.\n“The hotel was allowed to continue operating despite these two enforcement notices,” the court noted, finding that the hotel owners failed to fall into line despite having almost three years to do so.  \nIn a statement, Tourism Minister Konrad Mizzi thanked the MTA for its work and said he hoped the Park Hotel property would be eventually be fixed and reopened as a luxury hotel. \nHave you stayed at the Park Hotel? Share your stories and pictures with us: email mynews@timesofmalta.com", "comment_count": 59, "id": 1995}, {"keywords": "Hunting and trapping, European Union", "author": "", "article_body": "A European Commission call for a hunting suspension on nine waterbird species in all EU states had no legal basis and was a one-size-fits-all approach that failed to pose any appropriate remedy, Kaċċaturi San Ubertu (KSU) said.\nThey said in a statement that two of the nine birds - the common pochard and the northern lapwing - were huntable in Malta.\nIt called on the Maltese authorities to conduct appropriate studies that reflected the insignificant impact of Maltese hunters on these two species and to refrain from imposing more unnecessary restrictions on Maltese hunting.\nAccording to KSU, four Common Pochard and 13 Northern Lapwing were reported shot according to official records in 2018 with 1 and 13 recorded in 2017. Similar insignificant amounts are constant throughout the years. \nKSU referred to a similar call by the European Commission for a moratorium on turtle dove hunting in all EU states during autumn. It noted that notwithstanding the International Union for the Conservation of Nature (IUCN) Red List Vulnerable status of the turtle dove this moratorium was flatly ignored by all EU states.\nIn a reaction, BirdLife Malta urged the government to adopt the recommendations.\nBirdLife Malta CEO Mark Sultana stated: \"While the hunting lobby are asking the government to brush off this request from the European Union due to the low numbers that are caught in Malta, one has to keep in mind that the figures declared by hunters are a fraction of what is really happening. On the other hand, if it is true that only a few birds are caught, then adhering to this request should not affect them much\".", "comment_count": 24, "id": 1996}, {"keywords": "St Paul’s Bay, Waste, Construction", "author": "", "article_body": "St Paul’s Bay residents have begun circulating a petition demanding action from their local council to improve life in the town, amid growing anger over waste disposal and construction sites.The petition, being hosted and circulated by Moviment Graffitti, calls on authorities to ensure proper enforcement of construction regulations, and to cap the volume of planning permits for residential and commercial projects. Among other demands, it calls for more frequent garbage collection and better enforcement to ensure that all rubbish, including from businesses, is properly disposed of and collected. “Daily, we suffer the inconvenience, physically and mentally, of living and working in an area where the pavements are blocked by piles of garbage, where rules on dust, noise and safety in demolition and construction are routinely ignored, and rats dance in the street,” Karen Tanti, one of the residents behind the petition, said in a statement.\nRELATED STORIESConstruction anarchy rules in St Paul’s BaySt Paul's Bay's rising tide of litter\nWaste disposal has caught the headlines in recent weeks, with environment minister José Herrera calling an urgent meeting with the St Paul’s Bay local council to discuss the growing problem. Residents are also calling for weekly bulky refuse collection in designated areas, as well as increased enforcement through green street wardens, use of CCTVs in hotspots, and daily street cleaning to ensure that all garbage is removed.Meanwhile, residents said, construction work was increasingly impacting their day-to-day life, with 520 permits issued in the town in the last year alone. They insisted that pavements should be left accessible to the public even during construction work and any pavements broken by construction work must be fixed by the developer within a few days, as well as calling for time limits on ongoing construction works. They are also proposing a restriction in the hours during which construction and excavations/demolitions can take place, a limit to the number of roads closed for construction works, and a limit on the number of parking places that are taken away from residents.Residents said the petition would be presented to the local council, and warned of “further actions” if their demands were not met in a reasonable time.", "comment_count": 37, "id": 1997}, {"keywords": "Aviation, Industry, Unions, Tourism", "author": "", "article_body": "Hoteliers and restaurant owners have told Air Malta pilots to stop making excessive demands on the airline or risk hurting Malta's broader economy. \nAll those who are part of Air Malta to contribute towards the survival and growth of the airline, the Malta Hotels and Restaurants Association said.\nIt was reacting to industrial action ordered by pilots on Sunday, delaying Air Malta flights by half an hour. The action was called off after a court upheld a request by the airline to temporarily stop the action.\nTourism Minister Konrad Mizzi has accused the pilots of making \"surreal\" demands that the government guarantee lucrative early retirement packages owed to pilots, even if Air Malta were to go bust. \nThe packages, Dr Mizzi said, allow pilots to retire aged 55 with a golden handshake worth up to €700,000. \nMinister Mizzi also warned the pilots that if no agreement is reached, the government was “keeping the option open” to grow through a new government-owned airline, Malta Med Air, instead of through Air Malta.\nThe pilots' union hit back by accusing the government of telling \"half-truths\". \nOn Tuesday, MHRA said the aviation industry was under severe strain internationally and Air Malta was no exception.\n2019 saw the demise of a number of European carriers and in this fiercely competitive industry, only the most efficient airlines with the lowest costs would survive.\nRELATED STORIESRyanair subsidiary Malta Air and Air Malta 'can live happily ever after'\nAir Malta was given a lifeline by the EU with an injection of €250 million on a ‘one-time last time’ basis and was continuously fighting for its life.\nIt was therefore imperative that all those who were part of Air Malta contributed towards its survival and growth.\nPilots did a fine job, but so did others at Air Malta and many others across the economy, the MHRA said. \nIn this light, Air Malta pilots had to stop making excessive demands as this was becoming a serious threat, not only to Air Malta, but also to members of the association and the wider economy as a whole. The pension guarantee of €700,000 per pilot was unreasonable, the MHRA said.It urged the pilots’ association, ALPA, to be part of what could be an aviation success story and help Air Malta grow.\nIf excessive demands continued, they might lead to Air Malta facing the same fate of many other airlines which went bankrupt, something that could be inevitable due to a wrong attitude by stakeholders.", "comment_count": 90, "id": 1998}, {"keywords": "Health, University", "author": "", "article_body": "People suffering from bone defects may soon have access to better implants, as experts from the University of Malta and Mater Dei Hospital are teaming up to address the shortcomings of current bone scaffolds on the market.\nEntitled 'Biodegradable Iron for Orthopaedic Scaffold Applications – BioSA', this collaborative project will aim to develop an improved bone regeneration scaffold design with optimised characteristics.\nIdeally scaffolds are not designed as one-size-fits-all but can also be custom-made for a specific patient\nWhat are bone scaffolds?\nEvery year millions of patients all over the world undergo surgical procedures related to bone defect repair. With an ever-increasing life expectancy and the issues that come with a decaying skeleton, the number of interventions is on the increase.\nApart from this, patients experience bone defects – like fractures and losses to the bone - following certain surgeries and traumatic experiences. This is why orthopaedic surgeons are constantly looking for improved medical implants for the treatment of bone repair, the University of Malta said.\nBone scaffolds are porous implants that are used to fill significantly large defects. While the currently available solutions are suitable when implanted in non-load bearing areas, like the face, using a stronger material could result in a more attractive option when filling defects in load-bearing areas, like the bones found in legs.\nDespite the fact that ceramic scaffolds are widely used, their tendency to break due to their brittle nature, has made them inadequate for use in bones that are subjected to sudden loading, while polymeric scaffolds lack the mechanical strength to be used in load-bearing applications. Metals, on the other hand, have the potential to exhibit the perfect balance between strength and toughness.\nWhat’s the project all about?\nThe BioSA scaffold is being designed such that it corrodes at a controlled rate within the body, to match the rate at which the bone is healing. This aspect could result in reducing the necessity of a second surgical intervention to remove the implant after the bone has healed, the University said.\n\"The BioSA team is focused on understanding the corrosion behaviour of such an implant while also studying the effect that such an implant has on cells found in the bone. Through an innovative processing technique, based on the use of metal powders, the team also aims to gain control over the shape of the final scaffold. Accidents can happen to everyone and defects can be bigger than the body can heal naturally. So ideally scaffolds are not designed as one-size-fits-all but can also be custom-made for a specific patient,\" the University added.\nThe project is being led by Joseph Buhagiar, from the Department of Metallurgy and Materials Engineering, and also involves members from the surgical team at the Department of Orthopaedic, Trauma and Sports Medicine at Mater Dei Hospital under the coordination of Ray Gatt, as well as academics from various departments at the University of Malta.\nProject BioSA is being funded by the Malta Council for Science and Technology through FUSION: R&I Technical Development Programme.", "comment_count": 1, "id": 1999}, {"keywords": "Comino, Environment", "author": "Philip Leone Ganado", "article_body": "The Environment and Resources Authority (ERA) has confirmed that permits are still being issued for camping at Comino’s Santa Marija bay “under specific conditions”. \nTimes of Malta reported on Monday that tents had reappeared at a field in the bay just months after authorities promised an end to the environmentally damaging practice and said camping would only be allowed at a new designated site at Tal-Ful, close to the Blue Lagoon.\nUnder the Comino Natura 2000 management plan, camping at Santa Marija is meant to be prohibited to allow important habitats on the site to be rehabilitated. \nIn a statement on Monday, ERA again said camping would not be allowed outside the new Tal-Ful campsite but added a new qualifier: “unless authorised by the authority”. \nApplications for permits for camping elsewhere, it said, would be “evaluated by the authority and are subject to various conditions”.\nBack in January, following an enforcement crackdown at Santa Marija, ERA had said that “such activities adversely impact on the integrity of this Special Area of Conservation” and put up notices around the area specifically banning camping. \nBut the authority insisted on Monday the statements in January referred only to “unregulated activity that was being held indiscriminately” and that “was leading to the degradation of the important habitats in the area”. \nSanta Marija is a former marshland and reed bed\nPermits for camping at Santa Marija bay, ERA said, were now issued “under specific conditions” which included precautions to prevent environmental harm and to “respect the protection status of the area”. \nFurther conditions include limits on light and noise generation, conditions for holding barbecues, as well as prohibitions of generators, liquid fuel and other combustible material, according to the authority.\nRELATED STORIESWorks on new camping site in Comino set to start\nERA did not respond to questions as to how its decision to issue such permits tallied with the Natura 2000 management plan.\nIt also declined to comment on claims by campers who told the newspaper they had met with ERA officials and environment minister José Herrera after the crackdown and received assurances that a site at Santa Marija would again be designated for camping. \nSanta Marija, part of the Comino Natura 2000 zone, is a former marshland and reed bed, scheduled for its scientific and ecological importance.\nUnder the management plan, the camping area should be cleared and the site rehabilitated, allowing for the habitat of salt-resistant trees by the beach to move into the area it now occupies, and for a dune area to be extended.\nThe field where camping is now being allowed is adjacent to the former camping area, and forms part of a designated buffer zone around the protected site.", "comment_count": 2, "id": 2000}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Tuesday’s newspapers.\nTimes of Malta leads with a story reporting PN leader Adrian Delia saying that he would respect the outcome of a democratic vote. In another story, the newspaper reports the testimony given by the mother of a murdered 35-year-old mother of seven.\nThe Malta Independent says Nationalist Party sources informed the paper Dr Delia was trying to avoid convening a general council because he feared it would only serve to hurt the party further.\nL-Orizzont says that illegally caught tuna is being sold in Malta.\nIn-Nazzjon says that following the publication of a Council of Europe report on Malta, Dr Delia has appealed to the Prime Minister to act in the national interest.", "comment_count": 0, "id": 2001}, {"keywords": "Police, Crime, St Julian’s, Swieqi", "author": "", "article_body": "A 24-year-old man was grievously injured on Tuesday during a fight at a restaurant in St Julian’s.\nThe police said the victim, who is Maltese and lives in Swieqi, was involved in an argument with a 34-year-old British man at the restaurant, in Triq San Ġorġ, at 4am.\nThe victim was taken to Mater Dei Hospital while the British man is being held by the police for further investigations.", "comment_count": 0, "id": 2002}, {"keywords": "Construction, Planning Authority", "author": "", "article_body": "The Kamra tal-Periti on Tuesday rejected the assertion that it and its legal advisers have not understood the new legal notice on excavation and demolition works.\nTheir statement came after architects and the authorities met on Monday to hash out differences on the new regulations.\nPlanning Minister Ian Borg has suggested that many of the rumblings of discontent concerning the new regulations are due to misunderstandings about them. \nStakeholders have held several meetings over the past days to hash out differences and resolve issues which have seen the vast majority of construction projects across Malta and Gozo grind to a halt. \nConstruction exemptions?\nDuring Monday's meeting, organised by the Malta Development Association, stakeholders agreed that the Building Regulations Office (BRO) would issue binding guidance to industry stakeholders on which types of works could be eligible for exemptions from the new regulations.\nRELATED STORIESConfusion and clarity - differing views on new construction site rulesDevelopers are not criminals, Borg tells packed MDA meeting\nIn its statement, the Chamber said that while it was now clear that no demolition and excavation works would be exempted from the new regulations, the same could not be said for the construction of additional floors over existing buildings.\n“It appears that the only way that construction works may proceed is by the BRO agreeing that the regulations can be circumvented altogether. This begs the questions whether public safety is being safeguarded with the coming into force of the new regulations, how further collapses of buildings will be prevented, and whether the whole confusion created was worth the effort.”\nThe new regulations follow a spate of building collapses in recent weeks.\nThe chamber said it reiterated its advice to architects to follow the requirements of the Legal Notice in its current form, until such time as the BRO issued binding guidance on the interpretation of the notice as agreed with the government on Monday.\nWhen such guidance was issued, it would verify whether this reflected what was verbally agreed upon, and would advise members of the profession accordingly.\nThe chamber said it was given assurances that it would receive the fourth version of the relative BRO forms for its review before their republication but the BRO did not follow through such assurances. It said it was still not in agreement with the forms as published on Monday evening.\nThe chamber said it was very concerned that only a few hundred building sites were currently operational and could not understand why all this chaos had been created, when it was now being told that most sites, except for excavation and demolition works, could qualify for exemption from the rules. “Will this Legal Notice make our building sites any safer,” it asked.\nIt said that its demand for a proper registration of contractors, which was forcefully echoed by the MDA’s members at Monday’s information session, had so far not been implemented by government.\nIn its view, this was the most critical step in safeguarding public safety and preventing a repeat of the accidents of the last two months.", "comment_count": 6, "id": 2003}, {"keywords": "Culture, History", "author": "", "article_body": "Updated at 10.30am\nHeritage Malta advertised Fort St Angelo's historic bastions as \"unique advertising space\" on Monday evening, only to quickly take down the Facebook post after criticism from the Culture Minister. \nThe agency on Monday posted a post on Facebook promoting the fort's bastions as ideal for advertising.\nIts post featured a screen grab of a projection used to promote the Malta International Contemporary Art Space, which is expected to open in 2021, and invited prospective advertisers to send in an email for more information. \nThe post immediately drew sharp criticism, with many people asking incredulously whether the post was a joke. \nPost deleted after minister's criticism\nOn Tuesday morning, Culture Minister Owen Bonnici wrote that he was unhappy with the idea and had let Heritage Malta know about it. \n\nMinutes later, the agency's post advertising Fort St Angelo's \"unique advertising space\" was deleted. \nDr Bonnici said that he had no problem with projections which brought out the fort's beauty for national or cultural events.\nHowever, he did not agree that the Fort should be reduced to a ‘billboard’ where those who could pay could advertise. \n'Our post was misleading'\nContacted on Tuesday morning, MP and Heritage Malta chairman Anton Refalo distanced himself from the Facebook post uploaded by the agency he chairs. “I am a non-executive chairman. I know nothing about this. Send me an e-mail please and I will get back to you once I find out,\" he said. \nHeritage Malta subsequently told Times of Malta that its post had been badly communicated and \"misleading\". \n\"There was never the intention to use Fort St Angelo as billboard space,\" the agency said. \"All projections which are shown in this space are limited to national events and to activities of a historical, cultural and artistic nature. Content is always vetted accordingly and subject to approval\". \nThe agency said that \"action has been taken\" to ensure there was no repeat of the miscommunication. ", "comment_count": 34, "id": 2004}, {"keywords": "Environment, Construction, Planning Authority, Gozo", "author": "Ivan Camilleri", "article_body": "An illegal concrete batching plant, mounted inside a quarry in Kerċem, was not given the Lands Authority’s go ahead, Times of Malta is informed.\nThe Planning Authority has already ruled that the batching plant is illegal, because its owners, construction magnate Joseph Portelli and Mark Agius, known as Ta’ Dirjanu, failed to apply for a development permit.\nIt has now transpired that the Land Authority, which owns the quarry, was not even informed on this latest development.\nA spokesman for the public land administrator confirmed it is investigating the story revealed by Times of Malta as it was not aware of what was going on at the site.\n“The Lands Authority did not give its consent for the mentioned activity. We are currently investigating the matter following the Planning Authority’s enforcement action,” the spokesman said following questions sent.\nThe Kerċem quarry, known as Ta’ Qasam San Pawl, was acquired from the government through a lease agreement many years ago by Gozitan brothers, Carmel and Michael Cauchi.\nVarious illegalities during the years, primary among them the expansion and exploitation for quarrying purposes of areas which were not included in the original lease, had led to various PA enforcement orders.\nHowever, no direct action was ever taken and the quarry is still commercialising stonework coming out of illegal parts of the quarry. \nAccording to law, the Cauchis are prohibited from entering into any sub-lease agreement of public land to third parties without the permission of the Lands Authority.\nThey are not the owners of the latest illegal batching plant inside ‘their’ quarry, as this is being built by Mr Portelli and Mr Agius on land still registered in the names of the Cauchi brothers.\nWorks on the concrete batching plant started some three months ago. The large plant was imported from Sicily, transported on Gozo Channel vessels and mounted on-site.\nMany in Gozo were aware of what was going on, but the Planning Authority said it only got wind of the illegalities following questions by Times of Malta.\nFollowing verbal and written warnings to stop the assembly of the batching plant, the developers ignored the authority and carried on with the project.\nThis led to the issue of an official enforcement order. So far, the PA has not ordered the developers to dismantle the illegal structure. It did not seal off the plant either.\nA PA spokesman said that prior to proceeding with further action, the authority still needs to take into account whether the contravener will comply with the requirements of the enforcement notice within the legal timeframe.", "comment_count": 42, "id": 2005}, {"keywords": "Aviation, Politics", "author": "Ivan Camilleri", "article_body": "A company has asked for the cancellation of a government call for tender to reintroduce a helicopter service between Malta and Gozo, claiming “discrimination” and “anti-competition” terms.\nLast week, on the eve of the closing date of the submission of proposals, Helicopter Services Malta – a private international helicopter company based in Malta – asked the Public Contracts Review Board (PCRB) to “cancel the tender and re-issue the call in order to allow a wider possibility of participation” of companies interested in providing the service.\nCivil Aviation industry sources said that following such an objection, the tender is automatically suspended until the PCRB decides on the way forward.\nThe PCRB’s decision can also be challenged in court.\nThe technical specifications are discriminatory\nAccording to the objections filed, the tender, issued on behalf of the government by Malta Air Travel Services Ltd – includes terms which restrict competition.\n“The technical specifications indicated in the call are discriminatory and are also a barrier to competition as they limit the possibility of participation in this call,” the helicopter company claimed.\nWhile complaining that the minimum requirements are restrictive due to the fact that the specifications indicated restrict the types of aircraft that may be available to provide the service, the company insisted that “the objectives of the call may be achieved by various types of aircraft” and “a wider variety of modalities of operation”.\nWhile calling for a re-design of the technical specifications, the company said that in any procurement process, “it is an established principle that technical specifications must be drawn up in a manner that allow public procurement to be open to competition, and restrictive technical specifications are to be avoided.”\nThe company also pointed out an “error” in the tender, which has called for night operations. According to the company, such operations are not allowed according to current Transport Malta rules.\nThe tender involves “subsidies” from public coffers as under normal circumstances a helicopter service between the two islands is not deemed commercially feasible.\nRELATED STORIESCould Gozo get its own airport?Gozitan business owners say an air link is vital\nA similar tender issued in 2017 aimed at increasing the connectivity between the two islands, this time through a fast ferry service, is also deadlocked following claims of a vitiated process made by catamaran company Virtu Ferries.\nA first call, which had selected Virtu Ferries to provide a fast-ferry service to Gozo Channel was cancelled and re-issued on the instructions of the Office of the Prime Minister.\nFollowing the second call and a new evaluation committee headed by MFSA CEO Joseph Cuschieri, a newly formed company – Islands Ferry Network, formed by tomato producers Magro Brothers and the owners of Captain Morgan – were classified as having the best option to partner Gozo Channel.\nThe issue ended up in court and no decision has been taken yet on the way forward.\nThe new Malta-Gozo air link tender falls under the responsibility of Tourism Minister Konrad Mizzi.", "comment_count": 17, "id": 2006}, {"keywords": "Parliament, Daphne Caruana Galizia, Adrian Delia", "author": "", "article_body": "Opposition leader Adrian Delia and MP Jason Azzopardi on Monday urged the government to implement the recommendations of a recent Council of Europe report about the murder of journalist Daphne Caruana Galizia, particularly the call for the holding of a public inquiry.\nThe report, penned by rapporteur Pieter Omtzigt, was approved by a large majority of the Parliamentary Assembly of the Council of Europe.\nBut Justice Minister Owen Bonnici reiterated criticism of Dr Omtzigt, saying he had drawn criticism for a report which had looked into the downing of Malaysia Airlines Flight 17 over the Ukraine in 2017. On Twitter, Dr Bonnici said, Dr Omtzigt had himself admitted to wrongdoing and attributed this to his desire to “get to the truth.”\nThe Opposition MPs spoke during a debate on a Bill introducing amendments to various laws for the better administration of justice.  \nDr Azzopardi said there were three reasons to call for a public inquiry separate to the ongoing magisterial inquiry. A public inquiry would investigate the motive for the assassination, whether Ms Caruana Galizia’s death was avoidable, and whether there was political responsibility to be borne for the death, three key elements which the magisterial inquiry was prevented from considering.\nDr Delia quoted from the Council of Europe report, saying that Malta’s deficiencies were exposing all of Europe to vulnerabilities. “A Maltese passport is an EU passport.”\nMalta was also suffering reputational damage, as evidenced by the departure of BOV’s last US correspondent bank.\nThe Maltese judiciary had come under fire, with the Prime Minister accused of appointing judges based on their political affiliations and encouraged to refrain from making any further appointments.\nThe report had also recommended the implementation of all of the Venice Commission’s recommendations, Dr Delia said. In contrast, changes which the government had proposed were described as 'a parody' by professors at the Faculty of Laws.\nConcluding, he added that, although many members of the public had expressed weariness at the Opposition’s continued criticism of ministers’ involvement in the Panama Papers scandal, such criticism was the Opposition’s duty as the issue had preoccupied all of Europe. He appealed to the government to consider the Council of Europe report properly.\nDr Azzopardi said that the Opposition had once again been proven right by the Council of Europe. Criticism of the State Advocate Bill, which failed to live up to the Venice Commission’s recommendations, had been ignored by the government but was endorsed by the Council of Europe’s report.\nNo EU member-state had ever been “embarrassed” in this way by a Council of Europe report. Much to the government’s dismay, the report had been approved by “a large majority” - two-thirds - of the Parliamentary Assembly of the Council of Europe. Prime Minister Joseph Muscat was the first European leader to be accused of the Council of Europe of “protecting criminals,” Dr Azzopardi said.\nThe report identified the “impunity” enjoyed by Tourism Minister Konrad Mizzi, OPM chief-of-staff Keith Schembri, and Nexia BT financial consultant Brian Tonna as a cause for concern, pointing out that there had been resignations in Mongolia but not in Malta after the Panama Papers investigation was published.\nAzeri MPs had been the only representatives present to defend Maltese amendments to the COE report. Furthermore, and as pointed out by Dr Omtzigt on Twitter, the Maltese delegation had not objected to the descriptions of various scandals which had been included in the report. https://twitter.com/PieterOmtzigt/status/1145422605152870401\nWinding up, Justice Minister Owen Bonnici expressed his dismay that the Opposition had not said “a single word” about the Bill which was being debated.\nDr Azzopardi’s credibility had been best described by the Opposition Leader himself when he had publicly stated that he didn’t “have time to waste on Jason Azzopardi.”\nHe advised Dr Azzopardi to stop using the justice system as a political football to further his political ambitions, arguing that Dr Azzopardi was no longer taken seriously except by a few outside Malta.\nDr Azzopardi had been “delighted” by the outcome of the Council of Europe’s vote last week, as he had managed to promote a report which was “unjust” and “unfair” in its criticisms of Malta. What he had failed to mention was his wish for the Council of Europe to initiate monitoring procedures against Malta, a proposal to which the vast majority of representatives had objected. These procedures had only been initiated once, against Turkey.\nFurthermore, he said, Azeri MPs had not defended Malta but their own country before the Parliamentary Assembly, objecting to what they called the report’s untrue characterisation of Azerbaijan.\nTurning to the Venice Commission recommendations, he reiterated that criticisms concerning Attorney General Peter Grech’s continued tenure as chair of the FIAU would be addressed next March. Dr Grech’s appointment to the post was due to expire, and would not be renewed.\nAs for some of the other recommendations, Dr Bonnici expressed his belief that Dr Azzopardi would be the first to vote against the implementation of the recommendation that the Attorney General become responsible for what are presently known as magisterial inquiries.\nAddressing criticisms concerning the composition of the judiciary, Dr Bonnic said the Labour government had promoted to judges, magistrates who had been appointed by the Nationalist Party. Unlike the Nationalist Party, it had not elevated the brother of a sitting Cabinet minister to the position of Chief Justice. If the present system for appointing judges was insufficient, what about the previous system, which was far worse?", "comment_count": 21, "id": 2007}, {"keywords": "Education", "author": "Claire Caruana", "article_body": "Parents of State school children have called for a “thorough analysis” of the long-term impact of the removal of the end-of-primary benchmark exam.\nThe Maltese Association of Parents of State School Students (MAPSSS) wants the authorities to study how the change will impact the children’s post-secondary trajectories and other high-stake exams such as SEC.\nThe removal of the benchmark exam has been described as part of a “greater reform” by Education Minister Evarist Bartolo.\nHis ministry announced on Thursday that the exam would be replaced by “informal national exams”, shifting the focus solely to ongoing assessment methods.\nA total of 25 recommendations were put forward by the government’s Benchmark Review Board, such greater use of digital technologies and pitching the informal exams at two levels of ability. The body also outlined time frames when the different changes should be rolled out, with the phasing out of the system currently in place to be finalised by 2021.\nMr Bartolo was adamant that all stakeholders, including educators, students and parents, had been consulted prior to the unveiling of the proposals. However, the teachers’ unions have since lamented the changes came “out of the blue”.\nWe believe that a balance can be found\nThey argue the reform does not reflect teachers’ beliefs and seems to contradict certain decisions taken by the authorities in recent years.\nThe education authorities insist the proposals stem from the feedback received from all those involved and that they reflect issues flagged by teachers, students as well as their parents.\nThe parents’ association, however, says it only found out about the development “through the media”.\nA spokesman for the association told The Sunday Times of Malta that as of the main stakeholders, “it can express its official position once it is provided with the official report prepared by the Benchmark Review Board”.\nAsked whether the association believed the move to be a positive step forward, he said the banding system in State secondary schools had fostered an exam-oriented education system.\n“MAPSSS is in favour of a system which includes part-summative and part-continuous assessment. This respects the different learning styles of students.  “MAPSSS also believes that success in the education system can be achieved only through the continuous collaboration of all the relevant stakeholders, namely the ministry, the students, the teachers’ representatives and the parents,” the spokesman said.\nHe said feedback from individual parents to the proposals had been varied. While some were in favour of the removal of the exams, others were adamant that the best way to assess children was through tests and exams.\n“We believe that a balance can be found; one that makes the educational journey a holistic one which prepares the children for various challenges, including exams,” he said.", "comment_count": 8, "id": 2008}, {"keywords": "Politics, PN, Adrian Delia", "author": "Jacob Borg", "article_body": "Dione Borg, who unsuccessfully contested for a seat in the European Parliament, on Monday called for the setting up of a commission to study the PN’s internal structure.\nIn a letter sent to PN Secretary General Clyde Puli and general council president Kristy Debono, who is also acting president of the executive committee, Mr Borg framed the “challenges” faced by the PN within the context of the election losses it has suffered since 2013.\nHe asked for his proposal to be put on the agenda of a potential general council meeting that could be called to discuss Adrian Delia’s future as PN leader.\nThe commission, he said, should study ways to reform the PN’s internal structures and the way it delivers its political message.\nMr Borg proposed the commission start its work straight away, with the aim of finalising its report by September 2019.\nThe commission’s work should start a dialogue process at district level to spark mature discussions on the necessary reforms, Mr Borg said.", "comment_count": 15, "id": 2009}, {"keywords": "Beach, Accident", "author": "", "article_body": "A 75-year-old man died after swimming in Birżebbuġa on Monday afternoon, in the second sea-related fatality in as many days.The Qormi man was swimming at Pretty Bay when he found himself in trouble, the police said. He was lifted to shore by other people nearby and handed over to paramedics who were alerted to the incident at around 3.20pm. He was taken to Mater Dei Hospital by ambulance but was certified dead a short while later. Magistrate Natasha Galea Sciberras is leading an inquiry into the death.\nOn Sunday, a 68-year-old man from Żejtun was found dead in the water at St Peter's Pool, while earlier on that day a swimmer in Sliema was rushed to hospital after getting caught in high waves. ", "comment_count": 2, "id": 2010}, {"keywords": "Gozo, Environment", "author": "", "article_body": "The government is considering a concession agreement model as part of its preparatory work for the Malta-Gozo tunnel, Infrastructure Minister Ian Borg told Frederick Azzopardi (PN) in reply to a parliamentary question on Monday.\nMr Azzopardi asked if the project would be funded by taxpayers or by private money.\nIn his reply, the minister said preparatory work for the boring of the tunnel is moving at a fast pace, but with an eye on ensuring that the country gets the best value for this major capital investment. \nThe geological model of the site has been completed and talks about it have been held with experts.\nRELATED STORIESMalta-Gozo tunnel plans should be ready within six months\nTechnical studies are under way as part of the Environment Impact Assessment needed as part of the permitting process.\nTopographical surveys have been carried out on the sites of the two portals and a conceptual design of the tunnel itself is being prepared. \nAt the same time, the minister said, documents are being prepared to support the calls for tender for the resources to carry out the project including project management as well as the eventual boring of the tunnel and provision of services.\nConcession agreement\nAuthorities are also studying various financing models for the development, operation and upkeep of the tunnel. \nOne of the options, the minister said, was entering into a concession agreement with a private firm. \nSpecific details about the project and its funding would be known once the technical, economic and permitting studies were completed and once the international calls for tender for the boring of the tunnel and the provision of the related infrastructure were assessed, the minister said. ", "comment_count": 28, "id": 2011}, {"keywords": "Construction, Properties", "author": "Ivan Martin", "article_body": "Developers are not criminals, Infrastructure Minister Ian Borg told a meeting of the Malta Developers’ Association on Monday as he discussed the new construction site rules just issued by the government.\nSpeaking to a packed hall full of developers, Dr Borg said that some might wish to portray developers as criminals who flouted the law. However, in his opinion, developers were employers, who created jobs, and helped the economy to grow.\nSeveral hundred developers flooded the main auditorium of the Dolmen Hotel in Qawra for a meeting of the MDA in which the new regulations governing the construction sector were explained by experts.\nDr Borg said that some had said that the regulations - which were introduced after a lightening consultation of just five days - were rushed through. If the consultation was longer, then the criticism facing the government would have been about longer delays to works, he said. One of the main issues of contention with the new regulations is the responsibility being placed on architects’ shoulders when it came to signing off on the way demolition and excavation is done.\nWeighing in on this, Dr Borg said that everyone knew that prior to the reform loopholes existed and it had not been clear who was responsible for what.\nMDA president Sandro Chetcuti started off by expressing solidarity with the families whose homes had collapsed due to neighbouring demolition works.\n“We here all love the industry and worked hard to get it out of Intensive Care Unit… we have to look after it,” he said.\nMr Chetcuti said that after the string of building collapses, developers could have blamed architects, or certain contractors.\n“We could have done what others did and protested,” he said.\nThanking the Kamra tal-Periti for their assistance, Mr Chetcuti said the law had been drafted to make things better.\nMeanwhile, he assured the MDA members that he was working with the government for the setting up of a development council by the end of the year, that will ensure the registration of all those involved in the sector.", "comment_count": 27, "id": 2012}, {"keywords": "Adrian Delia, PN", "author": "Jacob Borg", "article_body": "Nationalist Party leader Adrian Delia insisted on Monday that he is not ignoring calls for him to resign, but, he said, there is a structure and there are rules which have to be respected.\nSpeaking outside PN headquarters, Dr Delia said the party's executive on Thursday will discuss the petition sent to the party last week calling for a vote in his leadership. \n\nDr Delia said he would respect the outcome of a “democratic vote” held in the general council.\nDr Delia has so far resisted calls to put his leadership to the test through such a vote. Despite initially signaling the procedures for such a vote would get under way, the party has since continued to raise doubts about whether the 150 signature threshold was reached, due to their being a number of “invalid” signatures on the petition put forward.\nSpeaking to Times of Malta after a two-hour parliamentary group meeting that sources say largely ignored the current leadership crisis, Dr Delia did not reply directly when asked if he was willing to tackle a vote in the general council head on.\n“It is not a question of being willing or not. We have an executive meeting on Thursday, and the executive will be discussing according to the statute, the petition it has before it”, Dr Delia said.\nAsked if he thought the general council meeting should be held, Dr Delia said this was not about his personal opinion.\nHe said the executive was free to decide on the petition, and would proceed from there.\nDr Delia maintained he was not ignoring calls for his resignation.\n“A party has a statute. It is called a structure and a statute because a party works like that. So it is useless trying to determine myself what procedures should be adopted. We are not a totalitarian party. We are a democratic party. There are rules. There are regulations.\n“A petition could have been done. It has been done and it will be discussed in the executive”.\nThe PN leader insisted this was not a personal issue. \n“I tackle this with full responsibility as leader of a party and keep the best interests of the party before my own. On Thursday we will have a free discussion and a democratic discussion”.\nDr Delia said the best interest of the party would be determined on Thursday and further to that, the possibility of also going to the general council, which is statutory something that will also be considered.MPs discussed parliamentary matters – Arrigo\nPN deputy leader Roberto Arrigo insisted that the parliamentary group meeting was about parliamentary affairs.\nAsked if other matters were raised, Mr Arrigo said only laws proposed by the government had been raised during the meeting.\n\nA source within the group, who wished to remain unnamed, said attempts to steer the meeting to discuss the PN’s ongoing crisis were shot down.\nSpeaking to Times of Malta after the meeting, PN MP Jason Azzopardi, who has made his views on Dr Delia’s leadership amply clear, said it should be a matter of when and not if the general council convenes to discuss the motion put forward in the petition.\n“I think the uncertainty is not helping matters.”\nOther MPs approached by Times of Malta declined to comment.\n ", "comment_count": 30, "id": 2013}, {"keywords": "Construction, Accident", "author": "", "article_body": "A load of bricks being lifted by a crane crashed onto a pick-up van in Gżira on Monday.\nThe van, which was carrying cement, was considerably damaged, with the driver's cabin being smashed in.\nNo-one was injured.\nThe accident happened at about 2.30pm in Gżira Road, opposite Manoel Island bridge.\nThe Occupational Health and Safety Authority said it could not immediately comment on the circumstances of the accident. ", "comment_count": 35, "id": 2014}, {"keywords": "Construction, Properties", "author": "Ivan Martin", "article_body": "Architects will be able to use a new template to apply for exemptions from the recently-introduced building regulations, Infrastructure Minister Ian Borg said on Monday.\nDr Borg said the exemptions were part of the reform from the outset, but some architects had not been versed on how to go about applying for them. \nExemptions from the new rules can be sought in particular circumstances, such as when projects are already in an advanced stage.\nArchitects can file a declaration that the planned works do not fall under the scope of the reform, allowing the works to go-ahead without following the new requirements.\nApplications will be decided by the director of the Building Regulations Office.\nA request for the relaxation of parts of the regulations can also be filed. This can include the requirements for the submission of a method statement,  a condition report, and the increased insurance cover.\nReasons for exemptions or relaxation of the rules could be that works are already at a very advanced stage and therefore the architect might argue that insurance cover would not need to be increased by a further 50 per cent.\nA request for exemption from the need to appoint a site technical officer can also be filed, but this will only cover construction works and not demolition or excavation.\nThis will also not exempt sites from other requirements such as the drafting of condition reports.\nWhile stressing that these exemptions are part of the original reform, Dr Borg said the templates would be available on the PA website later this afternoon.\nMeeting with architects\nArchitects and the authorities also met earlier on Monday to hash out differences on the new building regulations.\nDr Borg said the Kamra tal-Periti had met with the government and that he was expecting to receive a report on what was discussed.\nIt was his understanding that some points remained on which the authorities and architects did not agree.\nRELATED STORIESConfusion and clarity - differing views on new construction site rulesControversial revised excavation laws to come into force on Tuesday\nAsked what would happen to the estimated 2,009 construction sites that were at a standstill following the shotgun reform - which was introduced after just five days of consultation - Dr Borg bluntly said “they will have to follow the new rules”.\n“Even though hundreds of sites have applied the new rules and works are continuing, some still need to understand these regulations properly,” he later said.\nDr Borg said the public was now understanding that these new regulations were needed and that they “crystallized” certain aspects of responsibility in the sector.\nEnforcement\nPlanning Authority chief executive Johann Buttigieg said the PA was helping the Building Regulations Office with enforcement in the southern part of Malta and Gozo.\nThe BRO would focus on central and northern Malta.", "comment_count": 35, "id": 2015}, {"keywords": "Food and drink, Health", "author": "", "article_body": "Packets of a particular brand of frozen chicken dippers sold in some local supermarkets could contain pieces of hard plastic, consumers have been warned. \nIceland packets of 60 crispy chicken dippers should be avoided, the Environmental Health Directorate said on Monday. All batches of the UK-origin dippers could be affected.\nFor more information, call 21337333 between 8am and 2.30pm, email the directorate on mhi@gov.mt or visit the Health Inspectorate Services Offices at Continental Business Centre, Old Railway Track, Santa Venera.", "comment_count": 0, "id": 2016}, {"keywords": "Murder, Paola", "author": "Edwina Brincat", "article_body": "Updated 6.53pm with mother's evidence below -\nA panel of jurors on Monday heard a woman describe the last hours leading to her daughter's murder as they gathered evidence before being asked to decide whether the man accused of the murder was legally insane at the time of the crime.\nMichael Emmanuel, a 28-year-old Ivorian national, is accused of murdering Maria Lourdes Agius, his 35-year-old partner and mother of seven children, two of them fathered by him. He brought about the suspension of the compilation of evidence in April after pleading legal insanity.\nThe plea was however contested by the Attorney General leading to the start of a trial on Monday morning wherein eleven ordinary citizens, seven women and four men, were empanelled to decide upon the issue.\nThe murder took place in their Paola apartment in September. \n“The prosecution is not here capriciously. We are contesting his plea of insanity. You are here to serve justice, to do justice with the people, with the lady who has no voice here,” Charles Mercieca from the Attorney General’s Office said, in his introductory address to the jury.\nYou have to determine whether he was sane at the time when he strangled his partner, not before, not after, not now.\n“We are saying that he was indeed sane at the time he took her life. You have to determine whether he was sane at the time when he strangled his partner, not before, not after, not now. When he was alone in that room, he knew what he was doing, he knew the consequences of his action. The voice of Maria Lourdes can only be heard through witnesses,” Dr Mercieca went on.\nThe victim’s lifeless body was discovered by the police in her bedroom, seemingly asleep, shortly after her partner had turned up at the local police station early on September 15 to report that the woman could not be roused from her sleep.\nRELATED STORIESOutraged activists plan rally following woman's murder\n“One can be medically but not legally insane. In a court of law, insanity is the loss of capacity of understanding and knowing the difference between right and wrong,” explained Dr Mercieca, touching upon the issues which the jury would be called upon to assess.\n“Maria Lourdes Agius was not in a relationship with a mad man, she did not bear children with a mad man. He knew the consequences of his actions. He knew that it was cold, calculated murder. At that fateful point on that night he took a decision which brought us all here today. He had time after the murder to mull over what he had done. He waited until dawn to report to the police,” argued the prosecuting lawyer, before giving way to the first witness.\nHe knew the consequences of his actions. He knew that it was cold, calculated murder.- Prosecution\nInspector Sarah Zerafa, stationed at the Paola police station at the time of the alleged murder, recalled how the woman had been lying on her right side on the bed, facing the wall, one arm covering her face and neck.\nAt first glance, a forensic doctor had said that the woman appeared to have died a natural death. However, when her arm was pulled down, the scratches around her mouth and marks on her neck indicated otherwise, the inspector explained.\nThe police officer had later been present at the autopsy where the cause of death was determined as asphyxia due to pressure on the neck.\nYet, later at the interrogation, the victim’s partner and prime suspect, repeatedly denied having killed the woman, insisting, “I don’t know,” over and over when asked about the injuries found on the victim’s body.\nVictim's mother gives evidence, describes the deteriorating relationship\nThe victim's mother, Mary Agius, who used to live with the couple in Paola, described the deteriorating relationship and various violent episodes when she gave evidence on Monday afternoon. \n“If he was unhappy with her, he ought to have taken his children and moved out. Your children are your flesh and blood, my daughter was my own flesh and blood. I forgive you but…..” said the visibly agitated woman, as she turned to face the accused, clutching Maria Lourdes’ memorial card closely to her chest, her trembling voice occasionally giving way to tears.\nThe widow recalled, sometimes pausing briefly looking down at her daughter’s picture, how the couple had at first lived at a rented Qawra flat before moving to the family apartment at Paola where the alleged murder took place.\nHer daughter “had suffered much throughout her life, always trying to find a father for her children,” the mother explained, saying that her daughter had borne seven children, fathered by five men, the accused having fathered two.\n“Mike” (the accused) was a good parent who helped with caring for the three kids who lived with the couple. He had a job as a plasterer and was intent on acquiring the Paola apartment where he was carrying out works, the mother said.\nHowever, the couple’s relationship had degenerated, particularly over the last year, when violent arguments frequently erupted mostly over money matters and the fact that Lourdes’ former partner would sometimes visit his child at the Paola flat.\n“I would advise her not to let other men into the flat. I was afraid of men fighting,” the fragile-looking witness recalled.\n“Mike” also lost his temper when her daughter would use money to do her hair and nails, the witness said. “He always insisted that we should first buy things for the children and then for the house.”\n“What are you going to give the children?” he often asked his partner’s mother whom he called “Ma’.”\nDuring an incident, when the witness had stepped in during one of the couple’s rows, the accused had punched her head and had flung a heavy chair at Lourdes’ back, she said. \nShe recalled her daughter telling her: On Friday it’s you in an ambulance, on Saturday it will be me in a hearse.” \n“I was angry. At the time I recalled when, few months earlier, my daughter had ended up at the ITU in critical condition after giving birth to her last child. How could he treat her so?” said the mother, adding that she used to advise her daughter not to bear more children.\nAfter that incident, the accused had told her, “No dress, no shoes, out, out!” kicking her out of the flat. She was taken to hospital where she had opened up to a doctor, telling him how she and her daughter were threatened.\nA police report had been filed and mother and daughter had been warned to call for help should Mr Emmanuel turn up again.\nRecalling the hours leading to the alleged murder, the witness said Michael Emmanuel did return, kicking the door of the common entrance and demanding to see his son.\nThe mother had warned her daughter not to let him in, but the latter had not taken heed and had thrown down the keys, letting him inside.\n“Nothing happened. Lourdes went shopping,” the accused had told her when she saw him early next morning.\nSlipping past him, she had gone to the bedroom where her daughter lay still under the bedsheets. Touching the woman’s thigh, she immediately sensed that she was dead. “I love you,” the mother had murmured.\nShe returned to the room when the police arrived some time after the accused had filed a report.\n“I didn’t speak to him after that. Lourdes would not be brought back to life,” the mother went on.\nShe also recalled how some three weeks before, she had spotted a burnt doll on the kitchen roof and found a lit candle in the stairwell, thinking it was for her husband who had passed away but later suspecting that it might have had Ouija board implications.\nPriest's warning\nWhen confiding in a priest, he had told her, “Tell Lourdes to come to me at once. That’s a sign that he’s going to kill her or you.”\nHowever her daughter had not heeded her advice. “Perhaps none of this would have happened had she done so.”\nUnder cross-examination the woman said that she had not told the police at first that she had already entered the bedroom alone.\nShe also said that she had discovered three of her daughter’s teeth under a bedside carpet after the police had left.\nOne juror asked her what she understood by ‘ouija board,’ to which the woman replied, “Someone is going to kill you.”\nThe victim’s brother brought Monday’s afternoon session to a close saying that he had once argued with the accused and had called the police. He had immediately “sensed,” that the man was not ideal for his sister but failed to explain why, even when asked directly by the court.\n“I didn’t want to cause trouble. So I stayed away. When I faced my sister about it, she had taken it badly,” Mr Jean Paul Agius said.\nThe trial continues on Tuesday.\nLawyer Matthew Xuereb is also prosecuting.\nLawyers Marc Sant and Dustin Camilleri are defence counsel.", "comment_count": 0, "id": 2017}, {"keywords": "Aviation, Unions", "author": "", "article_body": "Government-owned Malta MedAir could step in and take over Air Malta’s growth plan if issues between the national airline and its pilots are not resolved, Tourism Minister Konrad Mizzi said on Monday.\n“We’re keeping our options open,” Dr Mizzi said in a brief video statement he uploaded to Facebook.\nOne of those options, the minister suggested, was to use government-owned Malta MedAir to implement growth plans which would see Air Malta expand into long-haul flights to the Americas and Asia. \n“We want Air Malta to grow,” Dr Mizzi reiterated in his video message.  “But if it is not in a position [to do so]… the option is there. The government’s objective must be reached”.\n“We love Air Malta and are going to keep it alive, but our economy is more important,” he added.\nAir Malta pilots began delaying flights by 30 minutes on Monday morning as part of industrial action ordered late on Sunday.\n\nThe airline filed an injuction – which was accepted by the courts – to temporarily halt the industrial action.\n'Surreal' demands\nDr Mizzi has slammed the pilots for making “ridiculous” and “surreal” demands concerning their early retirement schemes.\nAccording to the minister, pilots are demanding guarantees that golden handshake payments reaching up to €700,000 if they choose to retire aged 55 will be honoured even if Air Malta goes bust.\n“We will not give in to any blackmail,” Dr Mizzi said.  \nThe pilots’ union has yet to comment on its industrial action decision.\nMalta MedAir was set up in January 2018 and already owns Air Malta’s most lucrative asset – landing rights at major airports valued at €58 million.\nStaff at the national airline have in the past expressed concerns that it is being positioned to take over from the long-standing national carrier.\nDr Mizzi had shot down such concerns in March, insisting there were no plans for Malta MedAir to become a fully-fledged airline or compete with Air Malta.\nThe minister had made similar assurances about yet another airline, Malta Air, which Ryanair is to set up following a deal with the Maltese government.\n \n ", "comment_count": 56, "id": 2018}]