[{"keywords": "Gozo", "author": "", "article_body": "Gozo Minister Justyne Caruana unveiled a World War II memorial by Gozitan artist Mario Cassar in Marsalforn. The memorial, commissioned by the Marsalforn Administrative Committee in the Żebbuġ local council, commemorates the air attack on the bay on March 3, 1942. In the attack, three fishermen were machine-gunned and one of them, 22-year-old Alwiġi Vella, died the following morning at Gozo Hospital. The other two fishermen were brothers Salvu (aged 52) and Anton (56) Grech of Rabat, known as Ta’ Fenka.  \nInspired by the fishermen’s boat and the symbol of the Cross, Cassar has created a contemporary sculpture that pertains to land art. In his own words, “the memorial is actually meant to break the waves or just kiss the summer breeze, not to mention the references to sundials and hence time”. The memorial is the sixth public art project entrusted to Cassar.\nHistorian Charles Bezzina delivered a commemorative talk, while the memorial was blessed by St Paul Shipwrecked church rector Canon Michael Borg.\nA poem written for the occasion was read by Darren Saliba.", "comment_count": 0, "id": 2919}, {"keywords": "Gozo", "author": "", "article_body": "On the occasion of Mother’s Day, Fr Guardian Joe Caruana, OFM, celebrated Mass at St Anthony church in Għajnsielem with the participation of St Anthony choir and singer Loredana Agius. During Mass, mothers, accompanied by their children, gathered around the altar for a moment of prayer. After Mass, Fr Caruana gave a memento to all mothers who were then entertained to a fraternity gathering on the church parvis.", "comment_count": 0, "id": 2920}, {"keywords": "Gozo", "author": "", "article_body": "Arnold Cassola recently delivered an illustrated talk, ‘Süleyman and Malta’, as part of the Saturday lectures at Il-Ħaġar Museum in Victoria. Prof. Cassola made reference to the archivial finds he made in his research, including Istanbul documents concerning the 1565 Great Siege.\nThrough ‘Süleyman and Malta’, Prof. Cassola showed a different perspective to this defining narrative of Maltese history. After the talk, Joseph Borg, one of Fondazzjoni Belt Victoria’s organisers, presented Prof. Cassola with copies of two publications available at the cultural centre. ", "comment_count": 0, "id": 2921}, {"keywords": "Gozo", "author": "", "article_body": "■ Dumbo (PG) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n■ A blood donation session will be held at Xewkija District Health Centre on Tuesday from 1pm to 5pm.\n■ Fr Marcello Ghirlando will celebrate Mass and lead a healing service at Qala parish church on Tuesday at 7.30pm. There will be adoration of the Blessed Sacrament from 6.30pm to 7.30pm. Fr Ghirlando will also celebrate Mass and a healing service at St Anthony church in Għajnsielem on Friday at 7pm. There will be adoration of the Blessed Sacrament from 6 to 7pm. All are welcome.\n■ Three art exhibitions are currently taking place at the Cittadella Cultural Centre in Victoria. My Treasure Island, by Isabella Biskupsia, Beyond the Sea by Steven Muscat and Melody by Marina Tenerelli are open daily from 9am to 5pm.\n■ A symposium on dementia care, organised by the Psychology Department, is being held at the Gozo General Hospital on May 30 between 9.30am and 11am. Presentations include ‘Understanding and Treating Dementia’ by the Malta Dementia Society’s chairman, Prof. Charles Scerri, and ‘Support Services at Dar Padova’ by  Dementia Activity Centre (Gozo) co-ordinator Daniel Grima. To book a place call 2210 6322.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 2922}, {"keywords": "", "author": "", "article_body": "A lucky punter won the €820,000 Quaterno+ jackpot on Saturday, Maltco said in a brief statement. The winning ticket was purchased in St Paul’s Bay. \nThe numbers drawn were 71 • 23 • 75 • 6 • 27 / 56 • 81 • 8.\nWith the jackpot secured this week, the next Quaterno jackpot will now reset to €250,000. ", "comment_count": 0, "id": 2923}, {"keywords": "", "author": "", "article_body": "Buying a 32-year-old ship to bolster Gozo Channel’s fleet is just not good enough for Gozitans and would just add to the country’s environmental woes, Nationalist Party MEP candidate Michael Briguglio said on Saturday.\nSpeaking alongside PN MP Chris Said, Dr Briguglio accused the Labour government of not taking Malta’s sister island seriously.\nTimes of Malta reported on Thursday that a fourth vessel would join the Gozo Channel's fleet in a few weeks' time. On Friday, Gozo Minister Justyne Caruana confirmed that when she posted Facebook photos of her 'inspecting' the vessel.\nThe fourth vessel will be dedicated to commercial vehicles and will serve as a stop-gap solution until a tender for a longer-term lease is completed. \nThe PN has however slammed the plans, noting that the ship being brought to Malta is more than three decades old.\nSpeaking in Gozo, Dr Briguglio said the ship had been built in 1987 and compared its age to the average age of ships in Italy and Greece – 20 and 11 years respectively.\nIt was the PN, Dr Briguglio said, which had invested in Gozo Channel to ensure it had three ships in its fleet, which had built terminal buildings in Cirkewwa and Mġarr and which had spent money to increase the capacity of the Ta’ Pinu in 2012.\nDr Briguglio said that PN MEPs would work to attract EU funds allowing Malta to plan to introduce a fifth ferry in the Gozo Channel fleet, increasing trip frequency and ensuring that the company could cope whenever one of its vessels needed repairs.\n“Connectivity is crucial to Gozitan competitiveness,” Dr Briguglio argued.\nMr Said noted that fast ferry plans had run aground because a suspicious tendering process had been suspended and that talk of a cruise liner terminal in Gozo had also gone quiet.", "comment_count": 13, "id": 2924}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The MV Nikolaos, a 1987 Ro-Ro passenger ship, will be crossing the Mediterranean from Greece in the coming days to join the three current Gozo Channel vessels this summer.\nConfirming a Times of Malta story published last Thursday, Gozo Minister Justyne Caruana on Friday posted pictures of her whirlwind visit to Greece to “inspect” the 32-year-old leased vessel.\nDr Caruana confirmed that the ship, which used to do crossings between various Greek islands, will be the fourth in the Gozo Channel fleet and had been leased for a short period until a tender is issued to lease another vessel for a longer duration.\n'Panic' within ministry\nThe Times of Malta story on the introduction of this old ferry boat, created some ‘panic’ within government circles, particularly at the Gozo Ministry.\nPlans for the introduction of a fourth vessel at Gozo Channel were being kept under wraps, in order to be ‘announced’ by Prime Minister Joseph Muscat during a Labour political activity in the final days of the ongoing electoral campaign this month.\n“The minister was furious at the front page of the Times of Malta and immediately instructed officials to put her on the first available flight to Greece so that she could visit the ship and get some political mileage,” informed sources said.\nShe left the island on Thursday afternoon, accompanied by Gozo Channel officials, including chairman Joe Cordina.\nOn Friday afternoon Dr Caruana posted pictures and videos of herself next to the 1987 ship in its Gozo Channel livery at the Greek port.\nThe Gozo Minister had been insisting on the need for a ‘fourth ship’ since she became minister in 2017.\nLast year, Gozo Channel had already contracted a ship, also from Greece, in order to start operating during the 2018 summer months, on the minister’s instructions.\n\nHowever, the contract to hire the vessel for €3,000-a-day was shelved following the objections of the Finance Ministry which concluded that the expense did not justify the improved service and frequency in Gozo Channel’s schedule.\nHowever, this year, with elections looming, the Finance Minister lifted his objections and Gozo Channel was allowed to make the necessary arrangements.\nThe ‘old age’ of the leased ship resulted in immediate political bickering with PN Shadow Gozo Minister Chris Said, who while acknowledging the improvement, accused Labour of insulting Gozitans by offering them a ship that was almost on its way to the scrapyard.\nHe noted that while a PN government had given Gozitans three brand new ships, all that Labour could come up with was a 32-year-old vessel.\nOn Saturday, PN MEP candidate Michael Briguglio added to the criticism, saying the vessel was simply not up to scratch. \nReplying, Labour sympathisers accused the PN of “sour grapes” insisting that “at least (minister) Justyne Caruana had kept her promise with the Gozitans to make their life better.”\nivan.camilleri@timesofmalta.com", "comment_count": 38, "id": 2925}, {"keywords": "", "author": "", "article_body": "Introducing an EU-wide digital tax would be a “quick fix” that could leave Europeans significantly worse off, Finance Minister Edward Scicluna argued at an ECOFIN Council held in Brussels on Saturday.\n“The impact on us could be serious and possibly ominous. This is because Europeans are mostly exporting countries and the significant loss in revenue would be enormous if we were to switch corporate taxation on consumers,” Prof. Scicluna told counterparts during the Council session.\nEU member states have for the past year-and-a-half been discussing how to get internet giants such as Facebook, Google and Amazon to pay their fair share of taxes.\nThe European Commission and European Parliament are both largely in favour of introducing a so-called digital tax, and earlier this year the Commission proposed an EU-wide 3 per cent levy on online advertising, e-commerce and other online intermediary activities and selling data.\nThose plans – which must be unanimously approved by member states - are however opposed by a minority group of member states, including Ireland, Sweden and Denmark. Last March, Prof. Scicluna had expressed reservations about the plans, saying introducing such a tax only made sense if it was introduced across the globe, not unilaterally.\nOn Saturday, Prof. Scicluna told ECOFIN ministers that Malta fully supports the setting up of a working group to examine the various impacts on EU member states of the various tax proposals being put to the OECD, as a result of the increasing digitisation of the economy. Prof. Scicluna also made the case for Maltese wine producers to be allowed a lower excise tax on wines.\nMalta sceptical about BICC plans\nThe Finance Minister participated also in the Eurogroup meeting which was convened on Thursday. The Eurogroup meeting focused primarily on the Budgetary Instrument for Convergence and Competitiveness (BICC) which forms part of the ongoing discussion on the deepening of the Economic and Monetary Union, through the setting up of a Eurozone budget. The discussion on the BICC centred on the revenue aspects as well as the overall features this instrument should contain.During the meeting, Minister Scicluna said that Malta would oppose the instrument if financing it would impact national tax sovereignty. Minister Scicluna added that the allocation criteria to be used for the instrument should not discriminate disproportionately amongst member states and should not be based exclusively on population. Minister Scicluna argued that member states which have converged in the past, but are experiencing an element of divergence, should also be given preference. Discussions on this instrument are expected to continue with the aim of reaching an agreement in June.", "comment_count": 5, "id": 2926}, {"keywords": "", "author": "", "article_body": "Updated May 19 with Emigrants Commission statement\nNews that two soldiers were in police custody and suspected of killing a migrant \"just because he was black\" drew shocked and dismayed reactions across Malta's political spectrum on Saturday. \nLassana Cisse was killed on a Friday evening in April as he was walking along a country road, when a car drove past and fired bullets at him and two other migrants walking separately. \nTwo young men have now been arrested and are expected to be arraigned in court on Sunday. Times of Malta has chosen to not name the suspects until they are formally charged in a court of law. \nHere is how politicians, civil society groups and other public figures reacted to news of the arrests. \nPresident George Vella: \n\"Everyone is presumed innocent unless found guilty by the law courts\". President George Vella.\n\"It is very unfortunate that the persons accused are members of a disciplined corps. The President emphasizes the fact that this should not in any way reflect on the country’s various disciplined corps, and the upright behaviour of these corps’ members, as well as the sterling work and values of loyalty and dedication to serve the community\". \n\"The President would like to convey his sincere condolences to the migrant and foreign community in the country for the henious murder of a person from amongst their community, and for the others hurt, and assures them that this act does in no way reflect the sentiments of the Maltese and Gozitan people\".\n\"An incident like this should make us reflect deeply and at length, and should steer us to hold a sincere dialogue on the future of the country as a multi-ethnic, multi-cultural, and tolerant society,\" the President said. \n\"The language of hate is to be condemned, and should not take root in Maltese culture\". \nPrime Minister Joseph Muscat:\n\"The persons who were arrested do not represent the ethos of the Armed Forces of Malta, who I am convinced are doing very important work for our society. Nevertheless, we need to reflect on what happened.\"\n\"There is an ongoing internal investigation along with other security services, to determine whether these are isolated rogue individuals, or part of something wider\".\nBLOG: This is what happens when.... - Herman Grech\n\"The conclusion of this investigation by the Police Force shows that Malta is a safe place for everyone, and it should remain so, whether for the Maltese or any other nationality. In our country everyone is required to follow the law\".\n\"Words of hatred and division have no place in our society. It is a strong signal to all those who spread hate speech that their ill-placed sentiments have serious consequences\".\nLater in the day, Dr Muscat told a crowd in Gozo that Malta should \"never again\" experience a crime like this. \n\"Now is when we have to stand up to be counted,\" he said. \"If we allow this to blow over without showing that we've turned a page, we will all be denying our true selves\". \nOpposition leader Adrian Delia:\n\"PN fully condemns hate crime, racially motivated violence and racial discrimination in all its forms. We demand an urgent, independent, transparent and thorough investigation\".\n\"This is not the Malta we want. Much work is to be done to make Malta a truly safe place. Well done to the police force for their sterling work\".\nPN Home Affairs spokesman Beppe Fenech Adami added that the vast majority of AFM members were dedicated to their work of protecting and saving people who arrived in Malta. \nArchbishop Charles Scicluna:\n\"Great sadness, shock and shame as we confront the true evil face of the xenophobia, hatred and sense of impunity that poison a number of us Maltese\". ", "comment_count": 65, "id": 2927}, {"keywords": "", "author": "", "article_body": "A young motorcyclist was seriously hurt on Saturday afternoon after he lost control of his motorbike while riding in Xewkija. \nThe 22-year-old rider, who lives in Xagħra, fell off his Suzuki motorbike while riding on Triq ix-Xħajma at around 2pm. \nAn ambulance was called to the scene and went on to take him to Gozo General Hospital, where he is being treated.\nDoctors have certified his injuries as being serious in nature. In a statement, the police said that an inquiry into the case is under way. ", "comment_count": 0, "id": 2928}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Farmers with fields in the south of the island have complained about a sudden reduction in water for irrigation, which they say is the result of concurrent work on two reservoirs.\nOver 200 full-time and many other part-time farmers have invested thousands of euros in new crops but are now risking losing the investment due to serious drop in water supply leaving many fields bone dry, right before the hot summer season.\nThey said that the situation was the result of the simultaneous closure of supply from the three reservoirs in Żabbar (San Anard), Marsascala (Tal-Bidni) and Xgħajra (Milord). This, they said, was seriously prejudicing water supply to their fields in the south-east.\nMinister allegedly blamed EU\nThey also claimed that when they spoke to Minister for Water and Resources Joe Mizzi, he told them that the simultaneous closure was the EU’s fault as they wanted the two projects to run concurrently.\nThe farmers this week met Nationalist Party MEP candidate Peter Agius who assured them that the EU would have never imposed such a request.\n“Mizzi blamed his own incompetence on EU funds on Europe, fomenting anti-European sentiment,” he said in comments to the Times of Malta.\nHe said he checked about the matter with the European Commission and found that EU funds of up to €20 million were available as from 2014.\nA clear case of using European tools incorrectly\nHe added that the government took its time to deploy the project until last year when works on the three reservoirs had to start simultaneously not to lose EU funding commitments, depriving fields from water in spring and summer, when they needed it most.\n“This is a clear case of using European tools incorrectly,” Dr Agius said.\n“We must plan better to make the best use of EU money, which can be foreseen over a seven-year period. Planning is of the essence if we want to make a success out of Europe for all sectors of society.”\nMinistry says distribution system to blame\nWhen asked about the matter, a spokeswoman for the ministry said that two large-scale projects to provide new water were being implemented in the south.\nThese involve 40 kilometres of network and trenching and the rehabilitation of five reservoirs to guarantee that water is of top quality. The projects cost €15 million.\nOpinion: Why have politicians allowed groundwater to be depleted? \nShe said that the interruption of supply to farmers was not directly due to these projects but related to the weak distribution system that was being replaced.\n“Wherever there are illegal discharges of animal waste, and new water production is interrupted, the network goes down.\n“The reservoirs under construction are bypassed and the water channelled through the old open system which has substantial damages,” she said.\nShe insisted that such infrastructure was damaged through the improper use of the urban sewer system.\n“It is therefore very important that only human toilet waste and degradable toilet paper are discharged in the system.”\nSuspected foul play or problems with the sewer can be reported to the Water Services Corporation on Freephone 80076400.", "comment_count": 15, "id": 2929}, {"keywords": "", "author": "", "article_body": "Two 175-metre long flyovers are being planned for Msida junction, Infrastructure Minister Ian Borg revealed on Saturday. The flyovers would carry traffic at the busy junction straight to and from Triq Mikiel Anton Vassalli, replacing an existing traffic light junction that often grows congested during peak hours. Dubbed the Msida Creek Project, the project will also include the construction of two pedestrian bridges to replace existing pelican crossings, 100 new parking spots and upgrades to other roads in the area, such as that between Ta’ Xbiex and Triq Marina and from Valley Road to and from the skatepark roundabout. An open area close to the Workers Memorial will be embellished, the minister added when announcing the plans.\nThe flyovers would ease the flow of more than 4,500 vehicles every hour, minister Borg claimed.“I feel that we will be giving the people a much-desired project, which will mitigate a great inconvenience for residents, businesses, which will improve the flow of public transport passing through and which will facilitate the lives of many students using this road,” he said. With plans drafted, authorities are now talking to stakeholders including Msida council in the hope of finalising plans and submitting permit applications to the Planning Authority in the coming weeks.", "comment_count": 32, "id": 2930}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A man with a criminal record that was quickly becoming \"a booklet\" was remanded in custody after being caught red handed burgling a villa in St Paul's Bay.\nPolice inspector Godwin Agius told the court that the police received a call at around 11.30pm on Thursday about a man acting suspiciously outside a villa.\nBy the time the police got there, the man had broken into the property and he was arrested on his way out with his pockets full of jewellery.\nPatrick Cassar, 39, of Qawra, was arrested immediately. Further investigations revealed that he had also been involved in an attempted burglary in the vicinity in recent weeks.\nThe man, who said he worked as a construction worker, did not answer when asked if he had a drug addiction problem but he was warned by the court of taking drugs while working as this could have serious consequences on him and people passing by.\nThe police opposed a request for bail since there were witnesses who still had to testify.\n\"He created this problem himself and there are victims who need to be protected too,\" the inspector said.\nHe added that the man was last year given a three-year conditional discharge \"which he chose to ignore\".\nMagistrate Joe Mifsud denied the request for bail and sent him to jail for \"a weekend break\".", "comment_count": 0, "id": 2931}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A Żejtun man denied slightly injuring his ex-girlfriend when he allegedly slapped her at the police station during one of their many arguments.\nMario Ellul, a 42-year-old construction worker, was granted bail after the court heard about their troubled love life.\nThe couple dated for about 10 months and have been apart for the past two months when their relationship turned extremely sour.\nDefence counsel Veronique Dalli told Magistrate Joe Mifsud that they would frequently fight and that her client was being threatened by his former partner.\nShe said the day prior to the latest incident, his ex-girlfriend sent him a photo at 10pm of her in bed with her new partner. The lawyer said that despite having a new partner, the woman was not accepting that the relationship with her client had ended and that he was not interested in her any longer.\nPolice inspector Roderick Attard told the court that investigations were ongoing and he did not exclude that criminal charges will be issued against the woman.\nHe said the police had temporarily confiscated three shotguns registered in Mr Ellul's name \"just in case\".\nMr Ellul, who has a clean criminal record, was granted bail against a €500 deposit and a €5,000 personal guarantee. He has to be home by 10pm and not leave until 5am.\nThe court also issued a protection order in favour of the woman and her new partner.\n ", "comment_count": 0, "id": 2932}, {"keywords": "", "author": "Ivan Martin, Herman Grech", "article_body": "Updated at 5.35pm with President's statement\nTwo soldiers are believed to be behind the drive-by murder of a migrant in a shooting which left two other men injured in Ħal-Far last month.\nOne of the men was detained on Friday and the other was arrested on Saturday and is being interrogated, sources said on Saturday. \nThe killing is believed to be the first racially-motivated murder in Malta, with sources close to the investigation saying that one of the accused had admitted to targeting the migrants “just because they were black\".\nTimes of Malta is not publishing the names or photos of the two young suspects, as they have yet to be charged with a crime in court. \nIvorian national Lassana Cisse was killed on April 6 in the drive-by shooting in Triq il-Ġebel in an incident that sparked shock among the migrant community.\nTwo other migrants - a 27-year-old from Guinea and a 28-year-old from Gambia - were injured in the attack, after sustaining gunshot wounds.\nRead: Scene of migrant murder is hotspot for racial attacks\nSuspects linked to hit-and-run\nIn a statement on Saturday afternoon, the police confirmed that two Maltese suspects were in custody. The vehicle used in the crime as well as the weapon used in the shooting have also been confiscated, the police said. The police said a magisterial inquiry was under way but would not divulge further information for the time being. \nSources said the two suspects behind the attack had also been linked to a hit-and-run incident along the same road a few months ago that had left a teenaged migrant with heavy scarring. The victim: Lassana Cisse\nTimes of Malta had first reported on the hit-and-run after members of the migrant community said they were feeling unsafe.\nRead: A hit-and-run went unnoticed until a murder on the same road\nCar identified through CCTV\nThe victim of last month’s shooting, who used to work in a factory near Ħal Far, did not have a troublesome background. He was known for often checking in on his fellow countrymen at the open centre after work, trying to ensure they were doing well in a new country.Investigations have been going on from day one and the police have been working hard to get to the bottom of this\nSources said that police had tracked down the two parties by identifying the white hatchback car used through CCTV.\n“Investigations have been going on from day one and the police have been working hard to get to the bottom of this,” a source said.\nPolice arrested one of the two soldiers on Friday and after a few hours of interrogation he had admitted to being in the car at the time but not to firing the shots.\nIt is still unclear what rank the two Armed Forces of Malta soldiers held and where they have been stationed.\nAFM holding its own investigation\nIn a series of tweets, Prime Minister Joseph Muscat said an ongoing internal investigation along with other security services was ongoing to determine whether these are isolated, rogue individuals, or part of something wider.\n\"The conclusion of this investigation shows that Malta is a safe place for everyone, and it should remain so.\"\nBLOG: This is what happens when.... - Herman Grech\nHe said words of hatred and division have no place in our society.\n\"It is a strong signal to all those who spread hate speech.There are consequences to spreading such ill placed sentiments. We remain steadfast in our call for unity among the Maltese and all those who live in Malta.\"\n\n\n\n\"This is not the Malta we want,\" he added in a second tweet, in which he thanked police for their work. \n\"Much work is to be done to make Malta a truly safe place\".  ", "comment_count": 0, "id": 2933}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Labour candidates vying for a seat on the Qormi local council are trying to draw political mileage after works were carried out with taxpayer money on private roads in their locality.\nQormi residents who contacted Times of Malta reported increased house visits during the past days from various Labour Party candidates, crediting themselves for their intervention with Transport Minister Ian Borg who ordered the roads to be asphalted.\n“Almost every Labour candidate and councillor contesting the election came to tell us that it was thanks to them that the private garage compound was asphalted,” a 40-year-old Qormi resident said.\nAnother resident, a woman related to one of the owners of the private garages, said that one of the candidates had even sent them a personalised letter, taking credit for the initiative and mentioning (Minister) Ian Borg.\nThe letter, seen by Times of Malta, was posted in residences around the Qormi private garage complex in the name of Renald Falzon, a councillor in office hoping for re-election.\nIn his letter, complete with his personal business card and a picture of the private area asphalted by Infrastructure Malta, Mr Falzon said it was thanks to his pressure, “and in particular through Minister Ian Borg” that action was taken to tarmac the private roads.\nReference is made, in a letter sent to residents, to Transport Minister Ian Borg’s influence in the paving of private roads in Qormi.\nThe letter, which also flags his slogan “Dejjem Magħkom. Qormi Bħalkom,” ends with his promise that he will always keep committed to “deliver” to his constituents.\nRead: Private roads tarmacked through public funds in minister’s district\nEarlier this week, the Times of Malta reported about an unprecedented use of taxpayer money when Infrastructure Malta, the roads agency under Dr Borg’s watch, decided to spend tens of thousands of euros to asphalt private streets, which form part of garage complexes in both Qormi and Żebbuġ.\nIncidentally, the two towns form part of the Transport Minister’s electoral districts.\nWhile confirming that public works were carried out on private roads, a spokesman for Infrastructure Malta justified this action saying the government agency carried the required repairs in view of the roads’ public utility, in line with applicable road works regulations.\nHowever, the same regulations clearly state that works on such private roads have to be paid by their owners and not financed through taxpayer money.\nAccording to the rules, while the government agency may perform the works, this has to be made “at the owner’s expense”.", "comment_count": 78, "id": 2934}, {"keywords": "", "author": "", "article_body": "The Malta Community Chest Fund has no issue whatsoever with its involvement in a raffle organised as part of an MEP candidate’s political campaign.\nThe Times of Malta asked if the Office of the President had endorsed an “initiative” taken by “friends” of Labour MEP candidate Joseph Sammut who organised a lottery in aid of the MCCF and Hospice Malta.\nQuestions on the matter had been raised because the MCCF falls under the direct remit of the President, who is constitutionally bound to steer away from partisan politics.\nMoreover, the raffle raised eyebrows after it emerged that the names of these two organisations ended up on political leaflets, the candidate’s website and the prize itself – a brand new Fiat Panda. The car is on show in Valletta in front of the Parliament building and tickets are being sold at €5.\nMCCF welcomes donations coming from any legal activity or initiative\nHowever, when Times of Malta asked the President’s Office if it had endorsed the MCCF’s involvement, amid concerns that such association could be perceived as blurring its political impartiality, the spokesman said they had no issue at all.\n“Like any other foundation and NGO, MCCF welcomes donations coming from any legal activity or initiative,” the office said.\nThis newspaper also spoke to Hospice Malta, an independent NGO which offers palliative care for cancer patients free of charge.\n“As with other NGOs, our benefactors come from all strata of society, individuals and organisations, including politicians and political groups. Hospice relies on the benefactors’ good intentions and acceptance of donations should not be construed as Hospice’s endorsement of the benefactors’ cause,” the NGO said in reply to questions.\nDr Sammut insisted that all relative authorisations and permits were in hand. The MEP candidate added that prior to organising the raffles his team had obtained the endorsement of both organisations.", "comment_count": 12, "id": 2935}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Remains of what appears to be a medieval church have been unearthed in a Sannat field during works related to the construction of a block of apartments.\nOver the years, historians have referred to a Santa Marija ta’ nofs Awwissu church in Sannat, which was first documented in 1545 but probably dates back to the 1300s.\nAs soon as it got to know about the discovery, Wirt Għawdex alerted the Planning Authority and the Superintendence of Cultural Heritage, which informed the NGO that the site in Sannat was being monitored by an archaeologist.\nThe NGO was told that so far the only work on site formed part of the process of the planning application and was being supervised by the superintendence.Development will see construction of 43 garages, overlying 30 units on two floors and an additional 12 apartments\nThe development, which was granted permission in March, will see the construction of 43 garages, overlying 30 units on two floors and an additional 12 apartments at set-back floor level.\nAccording to a submission by the superintendence, the site in Sannat is located in an area of archaeological sensitivity. Scheduled prehistoric cart ruts and other rock-cut features were recorded in the vicinity of the proposed development.\nThe Times of Malta has been informed that the field was cleared from topsoil except for an area where remains of old masonry walls were exposed.\nArchaeologist had confirmed presence of church in area\nA local archaeologist confirmed the presence of a church in the area, however its location has been unknown for years.\nIn his book about Sannat, historian Dr Joseph Bezzina notes that according to a 1545 reference, the church had been built by Paolo Chettut and it had been standing for many years.\nMeanwhile, Gozo historian Ġan Franġisk Agius de Soldanis hints that it was already built by 1300, basing his assumption on a register of benefices or endowments to churches.\nFollowing the siege of Gozo in 1551, when the whole population was taken into slavery, the few survivors rehabilitated the chapel, which was eventually rededicated to the Presentation of the Blessed Virgin Mary in the Temple. People from all over the island would flock to the chapel on November 21, the feast day.\nAccording to the case officer’s report on the now approved development, an archaeological evaluation was undertaken under the direction of the superintendence.\nThe evaluation, intended to inform planning decisions, involved the removal of soil down to rock surface, but no archaeological features were uncovered in the process.", "comment_count": 38, "id": 2936}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that the remains of what appears to be a medieval church have been unearthed in a Sannat field during works related to the construction of ablock of apartments. It also reports that architects who have taken it upon themselves to rewrite the rules governing the sector said construction laws were often incoherent, outdated or jarred with other regulations.\nL-Orizzont says the fourth Gozo Channel ferry would soon be introduced to service the two islands. It also reports on the development of a therapeutic centre for adolescents suffering from drug addiction. \nIn-Nazzjon says the electorate had been forbidden from following a debate between the two main political leaders on Xarabank after Joseph Muscat refused to take part. It also reports that a tax proposed by the European Socialists would threaten jobs and investment in Malta. \nThe Malta Independent quotes Birdlife Malta saying the spring hunting season had served as an \"open-season\" on the red-listed turtle dove. It also reports that the Cabinet had approved the Cottonera plan. \n ", "comment_count": 0, "id": 2937}, {"keywords": "", "author": "Keith Micallef", "article_body": "Updated 11.10am with FAA statement\nDevelopment applications will only be available for public scrutiny once they are published in the Government Gazette and a notice is affixed on site, a Planning Authority spokesman has confirmed.\nThis clarification was made in the wake of a controversy that erupted a few days ago when online access to certain pending applications was closed. Instead, when users entered the application number to enquire about it, a notification came up saying ‘No complete application’ was found. \nThis restriction came under criticism from a number of environmental non-government organisations who perceived such a move as breaching transparency and meant to discourage the public from filing submissions. \nA proposal for the construction of a batching plant in Siġġiewi, and the highly-controversial American University Campus project in Żonqor, Marsascala, are among the applications which ‘disappeared’ following the introduction of this policy. \nThe Planning Authority also came under criticism as no public announcement was made on this restriction, fuelling accusations that these were introduced by stealth. \nReplying to questions sent by the Times of Malta, an authority spokesman insisted that this procedure had been in place for a number of years, but had never been enforced. \nHe noted that pending applications would only become available for public scrutiny once they were “complete”. This stage is reached when it is fully filled, all required documentation submitted and payments made in line with a specific provision of Legal Notice 162 of 2016, he said. \nPA fails to notify the public about changes\nAccording to this provision, the screening process – the term used to describe the procedure whereby an application is preliminary assessed by the PA – shall be finalised within eight weeks from its submission in full by the applicant, and the architect shall be informed of the respective date.   \nIt is only at this point that the authority is legally bound to make public the application in the Government Gazette and by affixing a notice at the development site, the spokesman said. \n“This is the stage when an application should be made available to the public, including on eApps [the PA’s portal for development applications] for public viewing,” he added.   \nIn view of this, the authority has “updated” its information technology systems to ensure it is properly following its legal obligations, the spokesman remarked. \nHowever, no reply was given when asked why the PA had failed to notify the public about these changes and the date from which the new procedure had come into force. \nMoreover, the PA declined to give a reaction when asked about criticism that it was giving an edge to developers, or whether the public consultation period would be extended to compensate for the fact that application would be uploaded online at a later stage.   \nEroding the public's rights - FAA\nNGO Flimkien għal Ambjent Aħjar said it roundly condemned what it called the \"ongoing erosion of residents’ rights\" by the Planning Authority, which is now delaying the publication of information on applications, giving objectors less time to inform themselves of cases and prepare objections. Far from facilitating the public’s access to information and participation in decision-making, the authorities stopped publishing planning applications in mainstream media, relegating it to the Government Gazette, which cannot be easily purchased like a newspaper, nor it is easy to access online, FAA said. ", "comment_count": 26, "id": 2938}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Prime Minister said on Friday he looked forward to debate Opposition leader Adrian Delia on Wednesday.\nThe two leaders were on Friday expected to debate each other on Xarabank but according to Dr Delia Joseph Muscat declined the invitation.\nHowever, Dr Muscat claimed that Dr Delia only started referring to the debate with him on Thursday.\nBut addressing supporters during a televised address on Monday, Dr Delia had referred to Xarabank's debate between the leaders. He also referred to it on Tuesday saying it would help people see who had the \"best ideas and who cared about the little guy\".\nHe kept mentioning the debate in political events throughout the week.\nHowever, Dr Muscat told supporters the Opposition leader only mentioned the debate Thursday.\n\"Yesterday, I don’t know what came over him – he said he wanted a debate today as well,” the Prime Minister told supporters in Żurrieq.\nThe move, he said, showed the PN did not have a plan. “You start the week talking about abortion and end it talking about a debate,” he added.\nDr Muscat said it had been clear from the start of the election that the two leaders would only debate twice - at the start of the election campaign on Xtra and at the end on a televised programme organised by the Broadcasting Authority.\nEarlier on Friday, Democratic MP Godfrey Farrugia said Dr Muscat refused to accept the debate on strategic grounds.\n\"I hope that he stays calm and holds on to his argument, because next Wednesday, we can debate as much as we want. I have no problem with that,” the Prime Minister said.\nAdrian Delia and Joseph Muscat shake hands before filming the first televised debate between them. Photo: Chris Sant Fournier\nPL and PN always stood side by side on EU commissioner nomination\nDr Muscat said it was shameful that the Nationalist party MEPs refused to commit themselves to supporting the Maltese government’s nomination for EU Commissioner.\nWhen (then Prime Minister) Lawrence Gonzi phoned him (Dr Muscat) and asked for Labour to support Tonio Borg’s nomination, Labour MEPs stood side by side with the government, Dr Musat said.\n\"I voted for Tonio Borg when he was nominated for the position, it was no problem, because he is Maltese like me and I want to help him,” he said.\nInstead, the Maltese were now seeing a situation where people were not ashamed to work against their country, he added.\nThis is why we need to use May 25 to send a message to those that still think people want division,” he said.\n‘Country needs more nurses, pharmacists and doctors’\nDuring his speech, the Prime Minister encouraged young people to turn to professions that would help others.\nRight now, he said, there was a shortage of nurses and pharmacists. The country needed an additional 400 nurses and there was a shortage of 187 pharmacists, even when considering the next batch of students graduating this year, Dr Muscat said.\nA recent initiative to build a €3 million Caritas therapeutic centre for adolescents battling drug and alcohol addiction problems showed that the surplus was being used to help people, Dr Muscat said.\nHe said there were around 60 people under 18 who were victims of drug-use last year, adding that it was the government’s duty to see how it could save those lives.\n“This is a project that is in favour of the life of hundreds of teenagers. You don’t just act and talk about supporting life, Dr Muscat said, in a clear dig at the PN’s pro-life arguments. You act in the right way to safeguard it, he added.\nHe also addressed Dr Delia’s comments on the Labour party belonging to the European Socialists’ family.\n“It is an honour to be a socialist,” he said. “Socialists don’t just care about how they are doing, but about how those more disadvantaged than them are doing,” he added.\nA vote for a Labour MEP is a vote for the Prime Minister’\nDr Muscat once again reiterated his position that the upcoming European Parliament and local council elections were a choice between him and Dr Delia.\n“Each vote for a Labour MEP is for Joseph Muscat and for the future of Malta,” he told supporters.\n ", "comment_count": 55, "id": 2939}, {"keywords": "", "author": "", "article_body": "The people were on Friday denied an opportunity to listen to an important debate on the national station between party leaders, just a few days before the May 25 elections, PN leader Adrian Delia said on Friday.\nAddressing a news conference outside Public Broadcasting Services, Dr Delia said that he had been invited by the programme Xarabank for a debate with Prime Minister Joseph Muscat. Although he accepted the invitation, Dr Muscat opted to decline.\nDr Delia said all this was taking place just a few days after the rising of Parliament, a decision the government took on its own without reaching an agreement with the opposition.\nA number of Parliamentary sittings had already been fixed for a debate on embryo protection and the speakers had already been selected. \nDr Delia said the country was facing a situation where the government was controlling information, it was controlling which reports to publish and what should be broadcast on the national station. This was reducing accessibility to the people’s right to information and expression.\nIt was how the Socialist government was strangling the democratic process in Malta, Dr Delia said.", "comment_count": 24, "id": 2940}, {"keywords": "", "author": "Jacob Borg", "article_body": "The lead socialist candidate for the post of European Commission president has reiterated his aim to introduce a minimum corporate tax rate of 18 per cent across the EU.\nOutgoing European Commission vice-president Frans Timmermans, who was in Malta a few weeks ago to address Labour’s May Day rally, said on Wednesday that a minimum tax rate would create a fair playing field across the EU.\nThe Socialists and Democrats (S&D), the European party grouping to which the PL is attached, have made the introduction of a minimum tax rate one of  their key policy planks for the European Parliament elections.\nThis has put it at odds with the Labour government’s own stance against any such tax harmonisation.\nWhile Malta’s corporate tax rate on paper stands at 35%, foreign-owned companies can apply for refunds which can potentially reduce their tax burden to just 5%.\nSpeaking during a debate with candidates from other political groupings, Mr Timmermans said countries would be free to set higher rates if they wanted to.\nThis call for a minimum tax rate was supported by Greens candidate Ska Keller and liberal candidate Margrethe Vestager.\nMr Timmermans expressed his belief that big companies should start to pay their fair share of taxes.\n“It is time we introduce minimum wages in every member state. It is time we have equality of pay for men and women. It is time we put an end to violence against women in Europe,” Mr Timmermans said.\nThe socialist candidate also spoke about the need to enforce the rule of law in every EU country, ensuring that everyone abided by the rules.\nThe European People’s Party’s candidate Manfred Weber did not endorse the call for a minimum corporate tax rate of 18 per cent during Wednesday’s debate.\nThe Nationalist Party has opposed calls for tax harmonisation, which requires unanimity between all the EU member states to be introduced.", "comment_count": 23, "id": 2941}, {"keywords": "", "author": "", "article_body": "A state-of-the-art laboratory dedicated to medical cannabis research is being set up in Malta as a result of a memorandum of understanding between Malta Enterprise and the La Sapienza University of Rome.\n“This agreement is a step in the right direction for the creation of a local medical cannabis ecosystem and the necessary enabling infrastructure for the companies that have been granted a letter of intent from Malta Enterprise – for them to set up their activity, start operations, and affirm Malta’s position as a European leader in the medical cannabis sector”, Economy Minister Chris Cardona said.\nLa Sapienza University is one of the world's oldest universities and one of the largest in Europe, with more than 100,000 enrolled students.\nThrough the newly-signed MOU, its department of chemistry and pharmacological technologies will be given space for a lab that will carry out tests, validations and verifications to enable the further development of the medical cannabis industry in accordance with Maltese legislation.\nRead: Malta Enterprise approves five medical cannabis investments\nParliamentary secretary for consumer rights Deo Debattista said he was confident that Malta’s reputation and expertise would be also shown in the production of medical cannabis with hard work and dedication making Malta a centre of excellence even in this sector.\nThe Education Ministry is also exploring possible collaborations between the University of Malta and La Sapienza in research and development in this medical field. The focus will be wide-ranging but shall include product development and process improvement.\nThe agreement was signed between Malta Enterprise CEO Mario Galea and Profe Bruno Botta for La Sapienza’s Dipartimento di Chimica e Tecnologie del Farmaco.", "comment_count": 4, "id": 2942}, {"keywords": "", "author": "Ivan Martin", "article_body": "A Valletta man charged with burning down a 120-year-old festive arch in Floriana has had his bail confirmed - but only on condition he not attend any celebrations related to Valletta FC’s league victory. \nCity fans will on Friday evening be holding their customary mock ‘funeral’ to mark clinching the Premier League. The season wraps up tomorrow with the FA Trophy final between Valletta and Balzan. \nIn their red and white strip, fans take to the streets of the capital where they parade carnival float style funeral caskets, for their Premier League rivals.\nBjorn Grima, a 33-year-old taxi driver from Valletta, has pleaded not guilty to starting the blaze, in the early morning of April 27, which destroyed the arch as well as four parked cars.\nBjorn Grima outside court.\nThe fierce fire raged for 90 minutes, reducing the structure to cinders.\nTimes of Malta had reported that according to investigators, petrol was used to burn down the structure.\nBail confirmed despite AG's appeal\nAlthough Magistrate Audrey Demicoli had granted bail against a deposit of €7,000 and a personal guarantee of another €7,000, this decision was appealed by the Attorney General.\nIn a judgement handed down by Madam Justice Consuelo Scerri Herrera on Friday, Mr Grima’s bail was maintained.\nHowever, he was also ordered not to attend any celebrations related to Valletta FC’s victory and given a 10pm curfew.\nConditions for bail, she argued, were there to minimise the risk of repeat offence or any other irregularity.\nLawyers Franco Debono, Amadeus Cachia and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2943}, {"keywords": "", "author": "", "article_body": "Several citizens and seven NGOs have filed a judicial protest against the Lands Authority, calling on it to enforce contract conditions the db Group had agreed to to develop the former ITS site.\ndb Group has plans to build luxury apartments, a hotel and shopping complex at the St George's Bay site. \nThe contract, NGOs have said, required the developer to \"restore\" St George's Barracks, a Grade 2 scheduled building.\nDespite this contractual obligation, the building was being demolished with only a wall and a coat of arms being retained. This was in clear breach of the contract and constituted a loss of national architectural heritage, the NGOs said.\nMoreover, the contract stipulated that any discoveries of antiquarian or archaeological importance had to be notified to the competent authorities, and that the government should have certain rights over such discoveries.\nAlthough archival research carried out by experts showed that plans of an underground Cold War bunker existed on site, there was no record of this being notified to the authorities as stipulated by the contract. \nHeritage groups last week called on the Superintendence for Cultural Heritage to issue an Emergency Conservation Order to protect the previously undeclared bunker, which housed a sub-station in the 1950s, and a 1930s engine room  underneath the St George Barracks.\nDeveloper db Group denied that any excavation was being carried out on the bunker.\nIn their protest, the NGOs called upon the Lands Authority to enforce the contract and to preserve the country's heritage.\nThe seven organisations filing the protest are Din l-Art Ħelwa, Ramblers' Association, BirdLife, Friends of the Earth, Moviment Graffitti, Flimkien għal Ambjent Aħjar and the Bicycle Advocacy Group.", "comment_count": 6, "id": 2944}, {"keywords": "", "author": "Jacob Borg", "article_body": "Works on a €3 million Caritas therapeutic centre for adolescents battling drug and alcohol addiction problems are under way. \nPrime Minister Joseph Muscat together with Archbishop Charles Scicluna visited the works on the new Caritas centre in Ta’ Kandja on Friday. \nCaritas director Anthony Gatt said the centre should be up and running next year. \nHe said there had long been an absence of adequate places to host such youths, who would often find themselves being sent to prison or Mount Carmel. \nThe Caritas facility will provide accommodation and therapy. It will be equipped with an outside gym, a pet therapy centre and an outpatients unit. \nArchbishop Scicluna heralded the new centre as being a concrete example of social solidarity in action. \nPrime Minister Joseph Muscat said the project was one that had united different facets of society.\nIt was an example of how the State and Church, which had different functions, could work together for the common good.", "comment_count": 5, "id": 2945}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 5.35pm \nLast February's storm which rampaged across Malta cost the country €25 million, a government study found.\nThe storm, described as the worst to hit Malta since October 1982, saw record gusts of wind hit the country, damaged electricity networks and forced over a dozen people to be evacuated from their homes.\nPrime Minister Joseph Muscat had then announced that the government would seek funding from the European Union to support those affected.\nDoes the storm damage qualify for EU funding?\nDr Muscat's hopes of EU funding have however been dashed by EU rules. \nAlthough the storm was one of the most devastating in recent history, the EU Solidarity Fund - created to help communities recover from such events - can only be mobilised if damage amounts to 0.6% of gross national income.\nIn Malta's case, that would amount to €62.4m - more than twice the cost of damage caused by February's storm. \nThat information was revealed by the European Commission on Friday in response to a question asked by MEP Francis Zammit Dimech. \n\"The Commission has discussed with the Maltese authorities all possible options to use the EUSF for the damage caused by the storm of February 2019,\" it told Dr Zammit Dimech.\n\n\"After having assessed the damage, the Maltese authorities concluded that it is considerably below the threshold and informed the Commission that they would not apply for EUSF assistance\". \nDr Zammit Dimech was disappointed by the news and suggested that the EUSF needed to be reassessed to ensure it was useful for small countries such as Malta.\nWill farmers still receive assistance?\nHowever, the government said on Friday that it would not be eligible for funds, adding the damage would have had to reach €62 million (0.6% of the Gross National Income or 1.5% of the gross domestic product) for the country to be eligible.\nParliamentary secretariat for EU Funds Aaron Farrugia and parliamentary secretary for agriculture Clint Camilleri said the government would be initiating the process to assist farmers who suffered from structural damages during the storm.\nFarmers would still be helped, the two politicians said, through locally-sourced funds. \nFarmers had said they suffered a huge level of damage to their crops and structures due to the strong winds. They told Times of Malta they suffered losses amounting to tens of thousands of euros each.\nThe government said it was committed to finding an adequate solution and was considering aid for damage which affected agricultural produce, Dr Farrugia and Mr Camilleri said.\nThis would be the first time the government would be directly aiding farmers after storm damages, he said.", "comment_count": 14, "id": 2946}, {"keywords": "", "author": "", "article_body": "April’s mean air temperature stood at 15.9°C in April, slightly lower than the climate norm of 16.1°C, Malta Airport’s Meteorological Office said.\nIt said in a statement that typically, the month’s mean maximum temperature reached 19.8°C, but a cooler-than-average April saw the mean maximum temperature drop by 0.7°C. The mean minimum temperature remained relatively unchanged, warming by a fractional 0.2°C when compared to the climate norm of 12.4°C.\n\nApril showers were few with only 15.4mm of precipitation measured throughout the month. A total 39% of this was recorded on April 5, making this the wettest day of the month.\nThe first week of April put the month on course for a gloomy and wet 30-day stretch, with no sunshine at all being recorded on the Maltese Islands on April 1, 2, 4 and 5.\nSuspended Saharan dust covered the skies and there was also the odd blood rain shower. The red skies were eventually blown away by stronger-than-average winds, which maintained a mean speed of 10.3 knots throughout April, 0.8 knots stronger than the climate norm.\nAt 240.7 hours, the April sun shone over the islands eight hours less than the monthly average. There was a daily average of eight hours of sunshine, with the month’s brightest day, April 28, registering a total of 12.5 hours of sunshine.", "comment_count": 6, "id": 2947}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman found guilty of trafficking heroin while working at a bar in Gozo nine years ago, had her jail term reduced on appeal.\nDorothy Refalo had been jailed two-and-a half years and fined €1,000 after she was convicted of aggravated heroin possession and trafficking, with charges dating back to March 3, 2010 and the preceding four years.\nA third party had testified as to how he used to buy his supply of smack from the woman who worked at a bar in Victoria.\nA search at the suspect’s home had yielded a small bag with traces of a brownish substance, a pair of digital scales, and small pieces snipped off magazine pages bearing traces of the same substance, which was later certified as heroin.\nIn the course of appeal proceedings, lawyer Franco Debono had mounted a three-fold defence, arguing that the accused was facing separate criminal proceedings over the same facts and could thus not be tried twice.\nHowever, this ground was rejected since there had not yet been a conviction in the other proceedings but simply a possibility of one in the future once judgment had been delivered.\nThe second ground, claiming that the prosecution had not presented sufficient evidence to prove that the drug was not for personal use, was limitedly upheld as was the third ground that the punishment was excessive.\nThe court observed that the actual quantity of drugs found in her possession had not been determined by the court-appointed expert in his report.\nFor this reason, the Criminal Court, presided over by Mr Justice Giovanni Grixti, in the absence of any other evidence, concluded that the heroin found was just a trace which did not indicate an intention to traffic.\nIt declared the woman guilty of simple but not aggravated possession and reduced her punishment to a one-year jail term.\nThe fine, together with the expenses and an order to undergo rehabilitation, were not revoked.\nLawyers Franco Debono and Angie Muscat were defence counsel.", "comment_count": 0, "id": 2948}, {"keywords": "", "author": "Jacob Borg", "article_body": "Three government ministers have told a court they did not personally oversee a controversial concession handing over the running of three public hospitals to Vitals Global Healthcare (VGH), and therefore needed more time to respond to a request for an inquiry into the concession.\nMinisters Edward Scicluna, Chris Cardona and Konrad Mizzi are facing a formal request for an inquiry by civil society activists from Republika, who have accused them of forming part of a “criminal conspiracy” with third parties to steal or defraud millions from the Maltese public.\nIn their reply to the demand, the three ministers dismissed the 150-page application as “speculation”.\nThe ministers requested more time to rebut it, arguing the “allegations” were about processes that were directly administered by various bodies, and not by themselves personally.\nAt least another two months were needed to gather the information to reply to the request, the ministers told the court.\nThey said the subject matter was identical to that already being investigated by the National Audit Office and all the information was already being given to the Auditor General.\nThey also argued the “speculation” presented to the court happened years ago, and seeing that the activists felt no need to present these “allegations” to a court earlier, there matter was not urgent enough to be rebutted within a few days.\nMagistrate Claire Stafrace Zammit dismissed the request for a two-month extension, instead giving the three ministers until June 3 to reply.\nShe noted the ministers’ declaration that the matter was being looked into by the NAO and said this meant that a lot of the material needed for their reply was already available, and there was no need for a long extension.\nThe activists have accused the three ministers of going through the motions of a public process based on impartiality and value for money to award the contract, while in reality being part of a criminal conspiracy with the winning bidder.\nEconomy Minister Chris Cardona had signed a memorandum of understanding with the investors behind VGH several months before the request for proposals for the project was even public.", "comment_count": 0, "id": 2949}, {"keywords": "", "author": "", "article_body": "Updated at 5.33pm\nMEP David Casa has written to all European Commission Presidential candidates seeking a pledge that they would introduce a Commissioner who would be responsible for press freedom and the protection of journalists.\nA call for such a commissioner was made by Reporters without Frontiers and Mr Casa said he supported this request.\n“Press freedom is a core value of the European Union and more must be done to safeguard it. Coordinated intimidation and attacks on journalists must be dealt with more severely and legal frameworks that allow for the harassment of investigative journalists through threats of vexatious legal action, also known as SLAPP, must be eliminated,” Mr Casa, who during this legislature campaigned for the introduction of EU legislation to counter SLAPP practices, said.\nThe European Union, he said, had to devote more resources for the defence of press freedom and should have the political will to address the major threats journalists faced. It should be a pioneer in the defence of these fundamental values.\nMr Casa, who as a PN MEP forms part of the European People's Party delegation within the European Parliament, took a swipe at the rival S&D's lead candidate, Frans Timmermans. \nMr Timmermans, who in the current commission serves as vice-president for better regulation, interinstitutional relations, the rule of law and the charter of fundamental rights, had done a poor job, Mr Casa said. \nIn the past five years, the Commission was slow, complacent and unwilling to take decisive action on crucial issues press freedom issues, which fell under Mr Timmermans' remit. This, Mr Casa said, had to change.", "comment_count": 6, "id": 2950}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A controversial application to add two football pitches worth of agricultural land to the Żabbar development zone has been dropped, following a storm of environmental objections.\nThe zoning application would have opened the door for development on a massive 14,000 square metres of land off Labour Avenue, currently outside the development zone and designated as a strategic open gap and agricultural area. \nSince being published for consultation by the Planning Authority last month, it attracted some 200 objections from residents and environmental groups, which said approval would undermine planning restrictions and continue to eat up important open spaces.\nA notice on the PA server indicates that the application has now been withdrawn.\nThe PA has not shown itself amenable to such requests from private developers to extend the development boundary – two applications for the same changes in Għasri and Xlendi were unanimously rejected by the executive council just last March.\nIn an objection to the Żabbar proposal, eNGO Flimkien Għal Ambjent Aħjar pointed to the rejection of the two Gozo applications and argued that planning policy specifically ruled out such modifications to the development zone.\n“Such a request seeks to increase the development zone boundaries through fragmented applications compromising the integrity and overall protection offered to the rural area through the existing planning framework,” the NGO said.\nIt argued that the application could “under no circumstances be deemed as holistic or sustainable planning” and warned of the detrimental effect “on our environment and on the very integrity of our planning system”, calling for the PA to reject it outright.\nThe group Futur Ambjent Wieħed argued that the “chaotic piecemeal development of ODZ” would have a devastating impact on the environment and show the “total futility of the planning system”.\nThe Żabbar local council had also indicated its intention to object to the proposal.", "comment_count": 10, "id": 2951}, {"keywords": "", "author": "", "article_body": "A chartered vessel has been painted in the Gozo Channel livery and will be operating within the coming days, bringing the ferry fleet up to four.\nGozo Minister Justyne Caruana said on Friday that the charter was concluded after contacts were made with various international agencies, as the vessel had to be able to use the restrictive Gozo Channel infrastructure.\nThe need for a fourth vessel had been identified last year, but it had been blocked at the time because the Finance Ministry had not felt the benefits would justify the costs.\nRead: Fourth Gozo ferry on its way soon\nThe vessel will fill the gap until an international tender can be issued for a long-term lease.As a result of the addition, three ships will be operating the schedule, with the fourth vessel dedicated to commercial vehicles.", "comment_count": 49, "id": 2952}, {"keywords": "", "author": "Denise Grech ", "article_body": "Children asked the government in a public consultation for the Cottonera area not to become commercialised, Cottonera Rehabilitation Committee head Glenn Bedingfield said. \nSpeaking during the launch of the finalised version of the Cottonera Strategy, Mr Bedingfield said children had expressed their wish for the area to be protected from becoming \"like other places which were too commercial\". \n\"They want Cottonera to retain its characteristics,\" he said.\nThe Labour MP was made executive chairman of the the Cottonera Rehabilitation Committee in November, after being given a lucrative contract by the government. \nOver 200 submissions were made to the public consultation on the strategy. \nHe also thanked the many foreigners who moved to Cottonera, noting that 3.0 per cent of the area's population were now non-Maltese.\nSixty per cent of the area's population were inactive, and many of them were over 60, he noted.\nAmong the recommendations, people asked for more parking spaces and open areas. They also asked for the ferry service between Valletta and Vittoriosa to be expanded to other towns like Senglea and Kalkara, he said.\nThe government would be looking into restoring Fort Ricasoli, the largest fort on the island, which has long needed urgent action. NGO Wirt il-Kalkara had warned it could cost €50 million to regenerate the fort.\nSpeaking following Mr Bedingfield, Justice Minister Owen Bonnici said authorities wanted to avoid gentrification while improving the social and urban space of the area.\n\"We do not want to cause gentrification - that is our red line,\" he said. \"We cannot wave a magic wand, but we do have a clear strategy.\"", "comment_count": 6, "id": 2953}, {"keywords": "", "author": "", "article_body": "The leader of the third party in parliament, Godfrey Farrugia, is challenging the leaders of the Labour and Nationalist Parties to a debate.\nXarabank’s leaders’ debate between Joseph Muscat and Adrian Delia was going to be held today, with Dr Farrugia also taking part. However, Dr Muscat has reportedly rejected the terms of the debate and therefore the challenge, the PD leader said.\n\"He is reported to have stated that he has not accepted on strategic grounds and prefers to have such a debate if organised by BA or Xtra.\n“It's chilling how democracy is hanging by a thread. No one has moved a muscle about parliament being deferred. No debate and no discussion, no scrutiny,” he said.\nLast Monday, Parliament was unexpectedly adjourned for two weeks on Monday, a day before a debate was due on the financial estimates of the Embryo Protection Authority.\nPD general secretary and MEP candidate Martin Cauchi Inglott said the Broadcasting Authority’s campaign schedule - which is prepared by the Commission made up of the handpicked representatives of the Prime Minister and Labour Party and Nationalist Party representatives - have excluded such a scenario of such a debate.\nCandidate Anthony Buttigieg said the Prime Minister preferred to debate \"in a controlled environment, where money can buy the truth and where the narrative may also be spun”.\n ", "comment_count": 31, "id": 2954}, {"keywords": "", "author": "", "article_body": "Updated 1.30pm\nPolice and Armed Forces of Malta first responders tried to rescue a cabin cruiser that got into trouble in Sliema - but failed to save it from sinking.\n\nA spokesman for the police said the operation was currently ongoing and witnesses said that seven people on board had been safely taken onto land.\nOfficers received a distress call at around 12.15pm informing them that a boat was sinking along the coast opposite Tower Road.\n ", "comment_count": 0, "id": 2955}, {"keywords": "", "author": "", "article_body": "A 38-year-old man from Birkirkara had to be hospitalised after a fight in Cathedral Street in Sliema on Friday morning. \nThe police said that three men were involved in the fight around 8.30am, the others being a 41-year-old and a 23-year-old, both from Gżira. \nInvestigations are still under way.", "comment_count": 0, "id": 2956}, {"keywords": "", "author": "Ivan Martin", "article_body": "An overhaul of \"ridiculous, outdated, and ambiguous\" construction laws has been drafted by architects who say it is time to properly regulate the sector.  \nKamra Tal Periti president Simone Vella Lenicker said the proposals came in the wake of a number of construction site accidents in Malta which had shocked the public and led to heated public debate on issues of safety and quality of construction.\nRead: Architects' lobby reiterates calls for less fragmented construction sector\nThe chamber, she said, had been working on these proposals from as far back as 2007, when it had first highlighted the need for an overhaul of the sector which had a worryingly disorganised legal framework.\nLast year, the government announced it would be consolidating a number of different authorities involved in policing the construction sector into one comprehensive new office.\nThe chamber is proposing that these new regulations and codes would be administered by this one-stop-shop.\nThere was a limit, she said, to how much people should be expected to pay for a poorly built property.\nFramed pictures survived the apartment block collapse in Gwardamanġa in April\nAndre Pizzuto, who headed the chamber’s working group on these proposals, said architects and other professionals involved in the sector had to defer to more than two dozen state entities through the course of a building project.\nThis fragmented legal landscape was due, in part, to the piecemeal approach adopted over the years.\nLaws that in some cases dated back to the 19th century, such as certain sanitation regulations, could not remain unchanged as the country steamed ahead towards the development of large scale, and high rise projects.\nArchitects, Mr Pizzuto said, were kept up at night by the terrifying thought of being held accountable and liable for damage sustained by buildings up to 15 years after their construction due to ambiguous and broad legalese.\n\nWhat are they proposing?\nThe Kamra tal Periti consultation document takes stock of the complex legal landscape in Malta, and compares it to best practices in countries from Scotland to Malaysia.\nThe principles of the reform:\nIn a nutshell, the KTP is proposing a broad reform of the building and construction regulation regime that covers all areas of the sector in a simple but comprehensive system, catering for small and large projects. Codes: The KTP is proposing a system of certification and approved documents. These would include building codes and construction codes.\nProfessional responsibilities: The role of periti and engineers would be more focused on design, setting of specifications, monitoring works, and certifying compliance at completion in accordance with new codes. Professional liabilities of a number of people involved (Periti, engineers, masons, site managers etc) would be clearly set out in-line with European averages.\nLarge projects such as high rise towers or hospitals should have their engineering works certified by a firm not involved in the project to ensure adherence to laws.\nBuilding and construction inspectors: According to the KTP it was time for new professionals to inspect and monitor construction sites on a day-to-day basis.\nContractors should be registered in a bid to raise quality and standards.\nRead the full consultation document here. ", "comment_count": 4, "id": 2957}, {"keywords": "", "author": "", "article_body": "Despite a total of 7,570 hunters registered for the three-week spring season, the majority failed to register even catching a single quail, the only bird that could be hunted during the period.\nHowever, there had been “a massacre of protected turtle doves and practically an open hunting season on the red-listed turtle dove\", BirdLife Malta said on Friday.\nIt claimed that shifting the dates of the season to April 10-30 was a deliberate choice by the government to coincide with peak turtle dove migration, in spite of the fact that quail was supposedly the only legally huntable species.\nThe eNGO said that half of the illegally shot protected birds it recovered were turtle doves.\nIt also noted there had been an increase in hunters interested in registering for the season, with 816 more licences in spring 2019 compared to spring 2018.\n\nIn spite of this, BirdLife Malta noticed an average presence of police during just 13.8 per cent of the times its teams were in the field in hunting locations where peak activity would be expected. The requirement is set at seven police officers for every 1,000 hunters.\n“The situation was even worse on the island of Gozo, where throughout a week of operations, not a single police unit was seen actively patrolling the countryside despite the island being a popular destination with Maltese hunters for turtle dove hunting,” it said.\nA total of 92 illegal hunting incidents were recorded by the eNGO over aperiod of just two weeks during which a total of 28 volunteers in four teamscovered 58 different hunting hotspots across Malta and Gozo.\nHunting illegalities so far for 2019 are already at record levels: the total of 41 known shot protected birds recovered to date has already surpassed last year’s figures for the same period (38).\nBirdLife Malta conservation manager Nicholas Barbara said it would be reporting its findings to the European Commission’s Environment Directorate-General asking for the derogation to be revisited.", "comment_count": 8, "id": 2958}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat said on Friday he was following the Attorney General’s advice about not publishing the full Egrant inquiry for now as it could prejudice ongoing investigations.\nAsked point blank why he would not publish the Egrant inquiry report immediately, Dr Muscat said he was simply following the Attorney General’s advice but that he was still committed to publishing the full report.The Egrant inquiry pictured on a desk at the Office of the Prime Minister.\nThis is the latest in a long line of justifications Dr Muscat has given for not publishing the inquiry report. \nThe Prime Minister had promised to publish the report within days of announcing its key findings last July.\nDr Muscat had pledged to forge ahead with publication despite the Attorney General’s misgivings. \nHe later cited a court case filed by Opposition leader Adrian Delia as another reason to delay publication pending the outcome of that case.\nDr Delia’s request for a copy of the report was turned down by a Constitutional court on Tuesday.\nThe Sunday Times of Malta had revealed in September that the inquiry’s findings were being redacted by the Prime Minister’s personal lawyer Pawlu Lia.\nIn a tweet, former Nationalist Party leader Simon Busuttil hit out at the Prime Minister saying he knew very well who owned the secret company.\n\n\n\nWhat has happened so far? \nSo far, only a summary, running into just 49 of the 1,500-page report has been published.\nAccording to the summary, no evidence linking the Prime Minister's wife Michelle Muscat to the mystery Panama company was found. \nTwo other companies set up by Nexia BT at the same time as Egrant were owned by the Prime Minister's chief of staff Keith Schembri and Tourism Minister Konrad Mizzi. \nNexia BT's Karl Cini was reportedly questioned by police in relation to the Egrant findings last August. \nFormer FIAU manager Jonathan Ferris and Adrian Delia's right hand many Pierre Portelli have also been questioned. \nTimeline:\nJuly 2018 – Muscat says the full Egrant inquiry will be released 'within a few days’, notwithstanding the Attorney General’s objections.\nSeptember 2018 – The Prime Minister expresses his commitment to publishing the report, but will “not act rashly” while the Constitutional case filed by Dr Delia was ongoing.\nMay 2019 – The Constitutional Court turns down the Opposition leader’s request for a copy of the Egrant inquiry. Dr Muscat now says he will following the Attorney General’ advice about not publishing the report for now so as not to compromise ongoing investigations.", "comment_count": 136, "id": 2959}, {"keywords": "", "author": "", "article_body": "The number of Maltese taking holidays went up by 6.6 per cent in the first three months of the year, compared with the same period a year earlier.\nThe total reached 146,841, with EU destinations seeing an increase of 4.5 per cent, and non-EU seeing a rise of 25 per cent.\nAn interesting trend was the decline in those opting for low-cost airlines, with the percentage dropping from 56 per cent two years ago to 52 per cent this year.\nThe National Statistics Office said that Italy and the United Kingdom remained the most popular destinations, with a joint share of 49.9 per cent of total tourist trips. However, the number of people venturing out of the EU has grown significantly, from 9,873 trips (9.4 per cent) in the first quarter of 2017, to 17,905 (13.9 per cent) this year.\nAlthough more people travelled, they tended to stay for shorter periods – with a 20 per cent increase in short trips of 1-3 days – as a result of which the total nights spent overseas decreased by 0.6 per cent. The average length of stay went down from 6.1 nights to 5.7.\nOver half the nights were spent in rented accommodation.\nIn spite of the shorter stays, the travellers spend more, with the €112.9 million working out to an average of €769 per trip, of which €225 went towards accommodation and €152 on air or sea fares, leaving €434 spent on the rest.\nTravelling further afield makes huge difference to the expenditure, with those going to the EU spending an average per head of €660, while going outside the EU cost €1,549.\nAnd what about EU destinations? The UK cost the most, at €782 a head, with Italy the cheapest of the major destinations at €547.", "comment_count": 0, "id": 2960}, {"keywords": "", "author": "", "article_body": "Plans by Azzopardi Fisheries to double the number of tuna cages at its offshore farm off Sikka l-Bajda were greenlit by the Planning Authority this week.\nThe additional cages – increasing from 12 to 24 – will not hold any more tuna but will, according to the operator, ensure that the fish have sufficient space to allow them to reach optimal size before harvesting, after an enforced relocation from St Paul’s Bay hit the quality of its stock.\nRead: Fish farm expansion hearing postponed amid allegations against suspended fisheries director\nThe farm was one of several moved offshore on the PA’s orders in 2017 after tuna farms were identified as the source of oily slime which plagued beaches and coastal areas.\nThe relocation was intended as a temporary, two-year measure until the approval of a designated aquaculture zone on the same site, but the Fisheries Department process is still ongoing.\nThe operators said that as a result of the relocation, stocking density in the permitted cages was double that of previous years, such that the tuna did not grow to full size due to excessive competition in a relatively small area.\nThe total biomass in the farm will remain within the legal limit of 3,300 tonnes.\nThe Environment and Resources Authority (ERA) did not object to the application, which it said was unlikely to have significant residual impacts, but proposed a number of conditions to limit and contain contamination, and to protect the integrity of the surrounding Natura 2000 site.\nMove will ensure fish have sufficient space\nAn Environmental Impact Assessment for the extension had suggested a number of mitigation measures to eliminate or reduce the amount of residue. These include carefully monitoring the feeding process and stopping as soon as, or just before, the fish are satiated.\nThe report also recommends regular checks – by an independent monitor – of the seabed below the tuna pens, which can suffer negative effects due to uneaten feed settling there.\nOperators also independently announced earlier this year that they had introduced booms around their pens to collect the oily residue, alongside a variety of other mitigation measures aimed at preventing a recurrence of the slime outbreak.\nThe booms, meant to collect much of the residue at source, will work together with a skimmer-equipped boat assigned to each pen. Operators will also be setting up a call centre to receive complaints from members of the public and will be paying for two boats to patrol the coast and pick up marine litter wherever they find it.", "comment_count": 28, "id": 2961}, {"keywords": "", "author": "Keith Micallef", "article_body": "Failure to register traditional foods like the ġbejna, mqaret and pastizzi as genuine Maltese products is placing local producers at a disadvantage with their European counterparts, Nationalist Party MEP candidate Peter Agius lamented. \n“We are bringing foreigners to Malta but we are forgetting to take typical Maltese produce abroad,” the former head of the European Parliament delegation to Malta said in a Facebook post. \n“A piece of fromage de chevre in Brussels does not taste as good as the ġbejna but sells for three times as much. Imagine how we could promote Maltese products, if we are able to use available EU tools,” the candidate added in his post. \nDr Agius remarked that the matter was raised by farmers during various visits he carried out during his campaign for next week’s European Parliament election.  \nThe MEP expressed his disappointment that, 15 years after membership, Malta was yet to register a single product under an EU scheme of geographical indications and traditional species known as protected designation of origin (PDO).\n\nAfter having tapped EU funds to modernise their equipment and improve standards, Maltese authorities have failed to take the decisive step to give European recognition to its traditional products. \nImagine how we could promote Maltese products if we use available EU tools\n“While an application to register the ġbejna has been pending for three years, Italy has more than 300 varieties of cheese protected under the PDO scheme,” he pointed out. \nDr Agius added that the lack of such recognition affected consumer trust and for this reason pledged to do his utmost to address the matter.\n“Europe has to become a showcase of Maltese produce, tradition and identity,” he said. \nThe unique characteristics that make up the rounds of sheep’s milk cheese have already been studied and documented in a five-year project between the University of Malta, the University of Catania and a Sicilian dairy research centre. \nHowever, Dr Agius said that apart from the ġbejna, other types of food should be registered such as sun-dried tomatoes (tadam imqadded) and pickled onions (basal tal-pikles).", "comment_count": 26, "id": 2962}, {"keywords": "", "author": "", "article_body": "The Planning Authority is proposing standard procedures for Social Impact Assessments (SIA) to become a requirement of the planning process.\nWith the practice Malta still in its infancy, the Planning Authority is seeking to introduce a standard procedure to guide the preparation of future SIAs.\nTo date, SIAs are only obligatory if a proposed project is making use of the tall buildings policy.\nA social impact assessment (SIA) seeks to identify and manage both the positive and negative social impacts of planned projects or proposed policy-making. SIAs are used to mitigate negative impacts and identify opportunities to enhance benefits for local communities and broader society.\nThe Planning Authority is proposing that when plans or policies are being drafted, the Executive Council would assess the need for an SIA on a case-by-case basis.\nHowever, when the Strategic Environment Assessment (SEA) screening process identifies the need for an SEA on a plan or policy, this will automatically trigger the need for an SIA to be carried out. In proposed development applications, an SIA will become a requirement whenever the relevant plan or policy indicates it to be a requirement. All SIA reports shall be published.\nThe proposed procedures may be downloaded from the Planning Authority website www.pa.org.mt.\nComments and feedback may be sent to Planning Authority, SIA Procedures Consultation, Strategic and Policy Making Division, St. Francis Ravelin, Floriana, FRN 1230 or via e-mail sia@pa.org.mt. Submissions must be received by June 28.", "comment_count": 5, "id": 2963}, {"keywords": "", "author": "", "article_body": "A team from the Data Science Research Group (DSRG) at the University of Malta, in collaboration with the European Synchrotron Radiation Facility (ESRF) in France, has recently been awarded a €100,000 grant to help with research on Egyptian mummies, a process that is currently done manually by trained specialists.\nThe principal investigator on this project is Johann A. Briffa.\nThe ESRF synchrotron accelerates electrons to a velocity close to the speed of light. As the electrons pass through certain magnets, they emit X-rays which can then be used by scientists to conduct experiments in the fields as diverse as protein biochemistry, earth science, paleontology, materials science, chemistry and physics.\nMicrotomography is an X-ray imaging technique based on the same principle as the medical CT scanner. Thanks to the extremely powerful X-rays produced in a facility such as ESRF, impressive higher resolution and quality is possible. This can be used to visualise the internal structures of objectswithout destroying them. \nRecently, these were used for applications in Egyptology, through the investigation of animal mummies, a process which would typically take several weeks for a small animal.\nIn the near future, thanks to the construction of the new technology, the same process is expected to be applied to human mummies, which would take considerably longer.\nThe main objective of this work is to develop and use artificial intelligence techniques to automatically perform this laborious process.\nFollowing the principles of “Open Innovation, Open Science, Open to the World”, the developed algorithms, data sets, and results will be made available to the public.", "comment_count": 0, "id": 2964}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Air Malta employees who feel aggrieved by decisions taken before 2013, or who feel they have suffered some sort of injustice, have been given another chance to file their complaint, the Times of Malta has learnt.\nA spokesman for the Tourism Ministry confirmed that this measure applies to present and former employees who had failed to submit their complaints for review in the previous two opportunities, of which they may have been unaware.\n“We can confirm that the Tourism Ministry has re-launched a process to investigate alleged cases of injustices [grievances] with Air Malta employees,” the spokesman said.\n“This is primarily due to the fact that the ministry has been made aware, through direct correspondence with alleged aggrieved parties, that there are a number of former Air Malta employees who might have not been made aware of the possibility to submit a grievance case.\n“This extension seeks to remedy this and to ensure that all employees benefit from the same treatment,” he added.\nMay not always be fully transparent and independent\nSources said a new grievances board would be set up. The measure comes a few days before the nation goes to the polls in the elections for the European Parliament.\nThe spokesman said the new process was an extension of the first call in 2014. It can only deal with cases of alleged work-related injustices at Air Malta that have never been submitted before previous grievances or review boards. Cases already decided by past boards will not be re-examined.\nThere had been a call for alleged grievances in 2014. Then, in 2017, soon after the election that returned Labour to power, a mechanism was set up to review previous cases.\nThe ministry spokesman said the two boards examined 696 cases of alleged injustices in all.\nClaims mainly ranged from alleged discriminatory treatment stemming from lack of a collective agreement and the restructuring process, to pensions adjustments and a few ad hoc compensations.\nThe spokesman did not specify how many complaints were found to be justified and neither did he provide the total spent on settling the grievances.\nIn 2017, police officers and former officers had also been given a second chance to file a complaint before the force’s own board. It was open not only to those whose claim had been turned down but also to those who did not apply following Labour’s election win in 2013.\nSoon after that election, Labour had set up a number of ad hoc grievance boards in many of the government’s entities to address claims of injustice under the previous PN administrations. This was done despite the establishment of the Office of the Ombudsman in 1995 primarily to address such cases.\nFormer Ombudsman Joseph Said Pullicino had expressed concern over the setting up of grievance boards, insisting they “may not always be fully transparent and independent, and in many cases lack proper direction and criteria”.", "comment_count": 45, "id": 2965}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nMichela Pace's performance got her through to the Eurovision final, with a photo on the front page of the Times of Malta. It also reported on the fact that the Air Malta Injustices Board would be reconvened to deal with more cases. The newspaper also says that a taxi-driver has been charged with setting the Floriana feast arch on fire.\nIn-Nazzjon also gives the Eurovision semi-final prominence and also reports of PN leader's electoral campaign meeting, during which he reassured that the party would defend the country's right to set its own tax regime.\nThe Malta Independent focuses on the debate between MEP candidates Frank Psaila and Cyrus Engerer, as well as on the mugging of a Sliema pensioner.\nL-Orizzont leads with a promise by the Justice Commissioner to help drug-users, as well as by the regeneration of social housing in Valletta.", "comment_count": 0, "id": 2966}, {"keywords": "", "author": "Denise Grech ", "article_body": "The government's move to shut down Parliament ahead of the elections showed Malta had turned into a dictatorship, Nationalist party leader Adrian Delia said.\nParliament was unexpectedly adjourned for two weeks on Monday, with the PN protesting that it had not been informed about the decision.\n\"The Prime Minister woke up one day and decided to shut down Parliament,” Dr Delia said, adding this showed Malta was not a normal country.\nOn Thursday, the Opposition leader reiterated his criticism towards a proposal in the European Socialists’ manifesto that supports EU-wide tax harmonisation. This would be fatal for the country, Dr Delia said.\nBrandishing a copy of GWU-owned daily L-Orizzont, Dr Delia quoted a headline saying 35,000 jobs would be threatened by tax harmonisation.\nThe article, called '35,000 jobs threatened by the PN’s vote on taxes' said PN MEPs had voted in favour of amendments that support EU-wide tax harmonisation.\nHowever, Dr Delia said, the story proved the Nationalist Party's stance was right since it showed how tax harmonisation would be fatal.\nThe GWU daily also focused on abortion, an issue which Prime Minister Joseph Muscat said was being pushed by Dr Delia because he had no other arguments\n\"For once I am telling you to go buy L-Orizzont – actually, we will make photocopies,\" he told supporters in his hometown of Birkirkara.\n\"Over 80 per cent speaks about abortion,\" Dr Delia said, adding this proved the issue had become a national debate.\n\"We want to continue talking about it, so that they can hear us,\" the Nationalist party leader said. “On abortion, we want to speak about it and be clear. I want to speak for the unborn child that cannot yell, cannot speak out, cannot protest.\"\nThe Prime Minister had also encouraged civil service workers to take time off work to do a part-time job, Dr Delia said. He was referring to comments by Dr Muscat during the Labour party annual general conference, where the Prime Minister joked that Maltese government workers were so hard-working, those who skived work did not go back to sleep, but went to work a part-time job.\n'Let us fight cancer together'\nDr Delia appeared to refer to controversy regarding a PN billboard on cancer, saying this should not be turned into a partisan issue.\n“Let us fight together, instead of attacking each other. Let us fight against a common enemy: cancer,” he said, adding Malta should show other countries it was able to set partisan politics aside.\nThe PN billboard refers to comments made by European Commission candidate Manfred Weber, who came to Malta and said member states have the resources to fight cancer if enough investment were made.\n“Let us invest in our doctors, not billboards,” Dr Delia said. “Let us invest in our youth, not marketing,” he added.", "comment_count": 48, "id": 2967}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Gozo Channel is expected to start operating with four vessels in a few weeks’ time, as the company has concluded a deal to lease an old ro-ro vessel to join its three current ships making the crossing between the two islands.\nMaritime industry sources told the Times of Malta that the deal was given the greenlight by Prime Minster Joseph Muscat and the Labour Party was planning to make an official announcement during a partisan activity in Gozo just a few days before the end of the ongoing electoral campaign.\nGozo Channel sources confirmed that a lease agreement has been finalised and the ship is expected to leave a Greek port in the coming days to join the company’s fleet “at least for this summer”.\nThe ship has been leased together with its on-board crew, as is usually done for short ship leases, and will not necessitate any other additional staff on the part of Gozo Channel.\nGozo Channel would be paying thousands every day for the services of the ship, expected to carry some 250 passenger cars.\nThis is not Gozo Channel’s first attempt to increase its vessels to four in order to be able to offer a better and quicker channel crossing.\nMany Gozitan lobby groups had been putting pressure on the government to introduce a fourth ship as they complain that, with the increase in traffic, they are waiting much longer to board the ferry and reach their final destinations.\nLast year, Gozo Channel had managed to find a ship and had almost completed its lease for summer at €3,000 a day.\nHowever, the deal was vetoed by the Finance Ministry, as it was calculated that the increase in the quality of the service offered compared to the expense incurred by the company was not justified.\nThe state entity already receives millions of taxpayer funds in subsidies and the forth ship will necessitate more State aid.\nHowever, Gozo Channel sources described the government’s priorities this year as “special”.\n“As happened before the last general election, where almost every Tom, Dick and Harry in Gozo was somehow put on the government’s payroll, the fourth ship is Labour’s carrot for this month’s election,” the sources said.\n“It seems that this time around, the government has other priorities than saving money and the Finance Minister is not objecting anymore,” the sources commented.\nAlthough the leased ro-ro is expected to reduce the crossing waiting time, logistically it is posing some technical problems.\nSince there seems to be no place for the ship to berth at the Mġarr Harbour - as the port can only hold three ships at one go - one of the company’s vessels will have to be berthed in Ċirkewwa with the crew on board, around the clock, in case of inclement weather.\nThe passenger gangways at both Mġarr and Ċirkewwa, custom built for the current Gozo Channel vessels, will apparently not be used for the leased ship.\nGozo Channel officials said that although it was true that an additional ship on its fleet will come at a cost, certain savings could still be made as overtime for Gozo Channel personnel and its contractors will come to a halt if no extra trips are necessary.\nIn the meantime, plans to introduce a long-awaited fast-ferry service between the two islands are still at a standstill as a legal battle on the way the State company chose its fast-ferry partner is being contested.\nVirtu Ferries is challenging the company’s decision after its offer was rejected and an inexperienced company – Islands Ferry Network – was selected.\nWhile Gozo Channel is insisting that its decision was based on the best commercial offer, Virtu Ferries claims that this was a ‘flawed’ and ‘illegal’ selection. ", "comment_count": 47, "id": 2968}, {"keywords": "", "author": "Denise Grech ", "article_body": "The government on Thursday signed a contract to launch the first specialised support service for inmates who were involved in prostitution.\nThe service is the first of its kind supported by the State and is part of proposed reforms in prostitution that the government approved last year.\nThe €40,000 contract will match inmates with volunteers and social workers at Dar Hosea to teach them the necessary skills to get out of the vicious circle of prostitution.\nThe volunteers will provide social support and will teach inmates skills, Sister Salvina Bezzina from the St Jeanne Antide foundation said.\nSpeaking at Castille, Parliamentary Secretary for Reforms Julia Farrugia Portelli said the government saw people in prostitution as victims, not as criminals.\n\"This is the first exit programme, and we want to look at [the victims] from this aspect,\" she said.\nShe said she had been inspired by a woman who had managed to get back on her feet thanks to support from Dar Hosea.  \"I met this woman when she was still caught up in prostitution, after her husband forced her into it,\" she said.\nA year later, thanks to support from Dar Hosea, the woman found the strength and courage to leave her husband and start working. When the MP met her again, she spoke of building a normal life: buying a second-hand car and renting her own apartment, Ms Farrugia Portelli said.\nThe Jeanne Antide Foundation and the authorities signed the agreement on Thursday. Photo: Jonathan Borg\nThe exit programme will help build a bridge between victims and service providers so that they can build a strong foundation before they leave the correctional facility, the Parliamentary Secretary said.\nHome Affairs Minister Michael Farrugia said authorities wanted to ensure that the children of victims did not get caught in the cycle of prostitution. It was important to think of the families of those incarcerated and their children, he said.\nAftercare was also important because rehabilitation needed to be continuous, he said.\n“They need to find somewhere to turn to. We are working to help those most vulnerable to help them go on with their lives,\" Dr Farrugia said.\nThe government would also be looking to extend the services of Dar Hosea, so that inmates would be able to enrol in programmes that will allow them to get paid and invest in their future, Dr Farrugia added.", "comment_count": 1, "id": 2969}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Developer db Group has said no excavation is being carried out on an underground Cold War bunker at the site of its controversial Pembroke project, after NGOs sounded the alarm over rock-cutters working on the site.Heritage groups last week called on the Superintendence for Cultural Heritage to issue an Emergency Conservation Order to protect the previously undeclared bunker, which housed a sub-station in the 1950s, and a 1930s engine room which were revealed underneath the St George Barracks.“These pleas seem to have gone unnoticed as the rock cutters gouge out another part of Malta's heritage,” Moviment Graffitti said on Thursday. However, a db Group spokesman told Times of Malta it was “absolutely untrue” that the bunker was being demolished. “No works will be carried out on the bunker until the Superintendence expresses its views,” the spokesman said.Photo taken by MEP candidate Arnold Cassola of rock-cutters on site on Thursday.\nThe spokesman also insisted works on the barracks, which are Grade II scheduled, were fully in line with regulations.Moviment Graffitti had said the works were taking place before the conclusion of a court appeal by objectors to the project, a decision on which is expected in June. The db Group’s City Centre project - including a 37-storey tower and 17-storey hotel on the site of the former Institute of Tourism Studies (ITS) campus in St George’s Bay - was approved by the Planning Authority last year.Following an appeal by NGOs and local councils that had vehemently opposed the development, a review tribunal ruled in March that the project could go ahead with minor changes - including a height reduction and increase in open space - and fresh clearance from transport authorities. A further appeal was lodged in court by objectors, and is still ongoing. In April, the Superintendence for Cultural Heritage ordered a stop to works due to a lack of supervision by an archaeological monitor. This, it said, was a “serious breach of permit conditions” and might have caused damage to archaeological features, which also include the Grade 1 scheduled Ħarq Ħammiem cave.\ndb group had followed the Superintendence's requests and is now fully compliant.", "comment_count": 19, "id": 2970}, {"keywords": "", "author": "", "article_body": "Thousands of counterfeit football shoes were found by the Customs Department at the Freeport, hidden behind a consignment of plastic cups.\nThe department said that they seized 5,370 pairs of football shoes, purporting to be of a well-known brand. They were confiscated after the agent for the brand confirmed that they were fake. \nThe agents are expected to take legal action in due course.", "comment_count": 5, "id": 2971}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Three Malta-based gaming companies were on Wednesday fined by the UK’s Gambling Commission after they were found to be in breach of various rules including the prevention of money laundering and consumer safety from gambling harm.\nThe fines are part of an ongoing investigation into the online casino industry.\nOf the four companies fined this time round, three are Maltese, while another is based in England’s West Midlands.\nBetit Operations, based in Sliema, will have to pay €1.6 million as, among other failures, it inappropriately offered bonuses and raised the deposit limits of a customer who deposited more than €126,000 over a 24-hour period. \nThe VIP offers from the gambling company kept coming even though the player twice had transactions declined by his bank, the UK gambling regulator said.\nMalta-based MT Secure Trade, which operated from St Julian’s, was found to have no interactions with a player who deposited €44,000 over four of its brands, with no source of wealth queries made.\nThe player was subsequently found to have been playing using stolen funds, according to the regulator.\nThe gambling company was ordered to pay a penalty package of €802,000.\nAssessments of 123 online operators\nIn another case, BestBet, also based in Malta, breached its licence conditions by having insufficiently trained staff in key positions and by having inadequate anti-money laundering policies in place. \nThe company was fined €264,000.\nOver the last 18 months, the UK regulator has conducted assessments of, or engaged with, 123 online operators, and of the 45 told to submit an action plan to raise standards, 38 have already showed signs of improvement.\nA further 34 were compliant with standards expected by the Gambling Commission or had minor issues which have been, or are in the process of being, remedied.\nSince the investigation began, five operators have surrendered their licence and can no longer transact with consumers in Britain.\nIn November 2018, the regulator imposed nearly €16 million in penalties on three companies. Two of them, Casumo and Videoslots, are also based in Malta.\nAnother company, CZ Holdings of Birkirkara, decided to voluntarily surrender its licence in the UK soon after it got wind that its operations there were under surveillance.\nWhile the Malta Gaming Authority is the regulatory gaming agency for the Maltese Islands, the upholding of anti-money laundering rules are in the remit of the FIAU – the Financial Intelligence Analysis Unit. ", "comment_count": 5, "id": 2972}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Maltese authorities have once again turned down a request to open their ports to a humanitarian boat with rescued migrants, according to NGO Sea-Watch.\nThe NGO on Wednesday rescued 65 people 30 nautical miles off the coast of Libya. Among them are 11 women, two babies, five children and eight unaccompanied minors. A person with disabilities is also on board.\n\"Many are exhausted and dehydrated,\" crew aboard the Sea-Watch said.\nItalian and Dutch authorities have also turned down requests for help, the organisation said. The Armed Forces of Malta said it had nothing to add.\n\"Our crew is taking care of our guests, they are OK, but crammed on little space, awaiting instructions,\" the organisation said, adding it was time for the EU to show its ability to act.\n\"Tell Europe that those people are humans,\" the organisation added. \nMalta has refused entry to several rescue boats, insisting it could not continue to shoulder the burden of migrants fleeing Libya to get into Europe. The authorities have also engaged in several spats with Italy's right-wing minister Matteo Salvini over providing a safe port to the rescue vessels. \nVery few countries have offered to take in migrants rescued by Malta or Italy. \nLast January, Sea-Watch 3 picked up 47 migrants who then had to spend 12 days at sea before being allowed to disembark at Catania in Sicily after a deal was struck with several European countries to take them in.\nSix other countries had agreed to take in the 47 on board, including Malta.", "comment_count": 0, "id": 2973}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A 59-year-old man was charged on Thursday with having demanded sexual favours from a 14-year-old boy on a number of occasions.\nA court heard how the alleged cases happened earlier this month in Żurrieq, the man's home town.\nMagistrate Audrey Demicoli issued a protection order in favour of the alleged victim and his family while the aggressor was referred to Mount Carmel Hospital for medical checks.\nDr Lennox Vella was defence counsel.", "comment_count": 0, "id": 2974}, {"keywords": "", "author": "", "article_body": "A group of fire-fighters from Ghana is in Malta for fire-fighting training with the Civil Protection Department.\nTheir visit to Malta was made possible by the Malta Foreign Ministry under a €30,000 Overseas Development Assistance grant.\nForeign Minister Carmelo Abela and Home Affairs Minister Michael Farrugia met the group, the second to visit Malta in just over a year.\nThe fire-fighters are here for a week for training on the use of breathing apparatus, understanding fire behaviour and tackling industrial fires amongst other objectives.", "comment_count": 0, "id": 2975}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A Macedonian tourist was seriously injured when she resisted a man and a woman who assaulted her in Manwel Dimech Street, Sliema, last week.\nRamon Abela, 43 and Miriam Elebed, 26, were accused of having assaulted and robbed the tourist just before midnight on May 10.\nThe court was told that the two had been driving by in the car when they saw the woman, 55, walking in the street and decided to rob her.\nThey hit her with an iron bar when she resisted, seriously injuring her.\nThey then stole her handbag, which contained a mobile phone, cash and documents.  \nThe woman, who was visiting Malta to see her newborn grandson, suffered a broken arm and lacerations to her head. \nAbela and Elebed were also accused of being relapsers. They pleaded not guilty. No request for bail was made.\nInspector Fabian Fleri and Lydon Zammit proecuted.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2976}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The two survivors of a Birżebbuġa drive-by shooting have not been followed up by the police and are still dealing with traumatic flashbacks of the fatal incident that cost them their jobs, health, shelter and, possibly, legal status.\nIbrahim and Mohamed were walking back home on April 6 after watching a football match between Barcelona and Atletico Madrid in Birżebbuġa, when they heard loud bangs. Lassana Cisse (insert) was killed in cold blood on Triq il-Gebel, Birzebugia\n“We thought nothing of it, as it could be anything – partygoers, keen football supporters, fireworks… We were minding our own business, discussing football on our way to Ħal Far,” Mohamed, 28, told the Times of Malta.\nThe man from Gambia recalls the shooting pain as the bullet entered one hip and exited the other one before he collapsed to the ground.\nIn front of him, Ibrahim stretched out his arm, leaned against the wall and slid down as he called a friend to tell him they had been shot. \nA few metres away, a third man – Lassana Cisse, a 42-year-old man from the Ivory Coast who was on his way to Birżebbuġa – did not survive the shooting.\nThe two survivors were rushed to Mater Dei Hospital, where Ibrahim spent five days and Mohamed two weeks. No one was allowed to visit the two victims while at the hospital.\nStill visibly shaken, the two are appealing for some form of stability, but they are scared to have their faces photographed as the shooter is still on the run. \nThe sleepless nights\nMohamed has spent sleepless nights feeling helpless. It feels as if he is going mad as his “head is full of desperate thoughts”, he said. \nMore than a month since the shooting, they claim they have not heard back from the police, despite reaching out to officers for feedback about the investigation.\nAsks for bus money to travel to police headquarters\nAs the case is ongoing, the two cannot go to Italy to renew their documentation, which expires in the coming weeks. They are risking ending up without any legal status, they said. \nIn the meantime, they are still being treated for their injuries, meaning they cannot work and they are surviving on the generosity of their friends.\nMohamed has been kicked out of a room he shared with five others, since he could not keep up with the €100 monthly rent.\nThey have to borrow money to buy food, and Ibrahim, 27, has even had to ask for bus money to travel to the police headquarters to ask for feedback.\nThe only way he can reach his family in Guinea is having them call on a friend’s mobile phone since his own was confiscated by the police. \n“When I was rushed to hospital my friend called my family to tell them I had been shot. Worried, they tried to reach me on my phone, but of course no one answered as it was in the police’s possession.\n“They immediately thought that I had been shot dead,” Ibrahim, father of a two-year-old and four-year-old said.\nMohamed has meanwhile only told his fiancée and brother about the shooting. He has not yet told his mother about the ordeal, for fear of losing his only surviving parent.\n'You wouldn't hurt a dog on the street'\n“The shooters have taken away from me the most important and priceless thing I have at the moment: my health,” Mohamed said.\n“At times I wonder who could do this to another human being. You wouldn’t even hurt a dog, let alone shoot one minding its own business.” \nHe said that all those around him, no matter their nationality and including Maltese friends, are still questioning the motive behind the shooting. \nWatch: A hit-and-run went unnoticed until a murder on the same road\nRead: Scene of migrant murder is hotspot for racial attacks\n ", "comment_count": 0, "id": 2977}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Updated 12.06pm with arraignment \nA 33-year-old taxi driver from Valletta was taken to court on Thursday and accused of having set fire and destroyed the 120-year-old festive arch in Floriana.\nBjorn Grima pleaded not guilty.\nThe blaze, in the early morning of April 27, also destroyed four cars parked alongside the arch.\nThe accused being taken to court.\nPolice inspector Saviour Baldacchino, prosecuting, said the police had analysed footage from some 50 CCTV cameras and had noted a man of a small stature who returned to the scene two or three times.\nThe police also noted a particular car’s number plate and sought mobile phone localisation data.\nMr Grima was arrested on Wednesday evening. \nDespite objections from the prosecution which argued that investigations were still under way, Magistrate Audrey Demicoli granted bail against a deposit of €7,000 and a personal guarantee of another €7,000.\nLawyers Franco Debono, Amadeus Cachia and Marion Camilleri were defence counsel.\nTimes of Malta had reported that according to investigators, petrol was used to burn down the structure.\nThe fierce fire raged for 90 minutes, reducing the structure to cinders.\nFund-raising is underway for the arch to be rebuilt, using the original plans.\n\n\n ", "comment_count": 0, "id": 2978}, {"keywords": "", "author": "", "article_body": "A court has turned down plans for the conversion of a disused broiler farm into a residence in the Bidnija countryside after finding it had not been in disuse for 10 years prior to current policy which would have permitted it to do so.\nA development permit was originally refused by the Planning Authority but the applicant, Winston J Zahra appealed before the Environment Planning Review Tribunal, which overturned the decision.\nThe authority, in turn, took the issue to court and successfully overturned the board's decision.\nMr Zahra had applied to build a residence at Ħal-Dragu, Bidnija in place of the disused farm.\nBefore the tribunal, he successfully argued that despite the policy conditions, there was a substantive element, allow by law, that the demolition of the farm and its replacement by a landscaped house would benefit the environment. He pointed out that the site was surrounded by several residences built without a permit.\nThe court, presided by Mr Justice Mark Chetcuti, insisted that the tribunal should have strictly applied the law, which laid down that disused livestock farms must have ceased operation for at least 10 years prior to the coming into force of the current policy document.\nThe policy came into force in August 2004 while the farm was still in use up to 2008.\nIt said the tribunal was grossly mistaken in its application of the law, which, it said, gave no grounds for interpretation. Once the legislator had left no discretion, any tribunal, authority or court was bound by the law. The law had to be respected because that was the only way to ensure that there was a level playing field with no suspicion of discrimination or favouritism.\nOnce it had become clear that the farm was not in disuse for 10 years before the coming into force of the policy, the tribunal should have stopped its considerations.\nThe tribunal was wrong to have given its go-ahead on the basis of what was viewed as a wider environmental benefit. ", "comment_count": 0, "id": 2979}, {"keywords": "", "author": "", "article_body": "An operational glitch during maintenance on the wastewater plant at Iċ-Ċumnija in Mellieħa resulted in raw sewage being discharged into the sea, the Water Service Corporation (WSC) has confirmed. \nThe incident happened last Monday but no public statement was issued on the matter. \nHowever Times of Malta was alerted about the leak by a reader who sent a photo of a murky brown patch along the rock coast below the plant.\nContacted by the Times of Malta, a corporation spokesman insisted that the problem was a localised one related to preventive maintenance.\nHe added that no bypass of raw sewage into the sea was planned as it was channelled into a retention basin for the very brief period of the maintenance operation. \n“However, the flow to the plant was larger than expected, possibly due to the weather conditions on the day, with the result that some sewage leaked into the sea,” he said. \nThe maintenance work at the plant related to an improvement in the aeration grid which is crucial in the treatment process. ", "comment_count": 16, "id": 2980}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Young singer Michela will take the stage in Tel Aviv this evening for the Eurovision Song Contest semi-final in high spirits as one of the favourites to qualify for the Grand Final on Saturday. \nThe 18-year-old Gozitan, who booked her place at the Eurovision by winning the inaugural edition of X Factor Malta, will be 11th on stage for the second semi-final with her song Chameleon. \nMichela Pace will take the stage in Tel Aviv this evening. Photo: AFP\nBookmakers have given Michela strong odds of making it through: across 20 major betting companies, Malta has been given an 84 per cent chance of being among the 10 qualifiers, the sixth strongest odds on the night.\nWinning the Grand Final, however, seems a far more distant proposition. The same bookies rank Michela’s chances of victory at just three per cent, though they also give her a roughly 50-50 chance of becoming the first Maltese singer to finish in the Top 10 since Gianluca Bezzina managed eighth place in 2013. \nMalta has failed to qualify from the semi-final in three of the last four years, with Christabelle, Claudia Faniello, and Amber all falling short, while Ira Losco made it to the Grand Final in 2016 with the song Walk on Water, finishing a middling 12th despite high expectations.\nMichela, however, appears well placed to buck the dismal trend. \nChameleon – written and composed by Joacim Persson, Paula Winger, Borislav Milanov and Johan Alkanas – has impressed critics and became the most-viewed YouTube video of any of this year’s Eurovision entries, although it has fared less well on Spotify. \nPopular Eurovision review website wiwibloggs wrote: “It feels like it’s the first time in a long while that the Maltese artist has a song both modern and age-appropriate. Combined with Michela’s known great live performances, all I can say is welcome back to the final, Malta.”\n84 per cent chance of being among the 10 qualifiers, the sixth strongest odds on the night\nMichela will be accompanied on stage by four dancers as well as backing vocalist Destiny Chukunyere, herself a Junior Eurovision winner, and a rapidly-changing series of projected scenes and colours. \nAccording to reports, rehearsals in Tel Aviv have been marred by technical and production errors, even as the singer’s own confidence and stage presence earned commendation. \nThe qualifying acts in the semi-final will be chosen through a 50/50 voting system by an expert jury – who voted during a dress rehearsal yesterday – and voting by the TV audience this evening. \nThe favourites for this evening are the Netherlands with Duncan Laurence and the song Arcade, and Sweden with Too Late for Love and John Lundvik. Both countries are also the top picks to win the Eurovision outright. \nIf Michela gets through the semi-final, she will be joined on Saturday by the Top 10 from Tuesday’s first qualifier, which include front-runners Australia and Iceland, as well as the Big Five of the UK, Germany, France, Italy and Spain. \nThe Youtube rankings\nMalta is not doing well on Spotify.- https://www.casumo.com/en-gb/blog/eurovision-friends-and-foes/\n ", "comment_count": 14, "id": 2981}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta leads with the news that the Gozo Channel is expected to startoperating four vessels in a few weeks’ time.\nIn a separate story, two survivors of a Birżebbuġa drive-by shooting claim they have not been followed up by the police and are still dealing with traumatic flashbacks of the fatal incident.\nThe Malta Independent refers to a court story about police inaction on domestic violence reports, after a woman was charged with grievously injuring her husband with a kitchen knife.\nIn-Nazzjon quotes PN leader Adrian Delia saying the PN was committed to improve the quality of life and defend life, while another article quotes national data \"confirming\" that the cost of living increased in April.\nl-orizzont leads with the claim that 35,000 jobs are being threatened by what it says was the PN MEPs' vote in favour of tax harmonisation within the EU.", "comment_count": 0, "id": 2982}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A Rabat resident has filed a case before the Court of Appeal against a decision by the Planning Authority to grant its own minister a planning permit to transform a field adjacent to his rural residence into an outside recreational area including a swimming pool.\nNoel Ciantar, who has been opposing Infrastructure Minister Ian Borg’s swimming pool plans for years, has filed his latest objection,  appealing a decision made last month by the Environment and Planning Tribunal.\nIn his application, Mr Ciantar is challenging the tribunal’s decision on various grounds, particularly on the lack of a fair hearing, as the tribunal denied Mr Ciantar’s ‘right’ to produce witnesses to corroborate his objections, including the Office of the Ombudsman that had described the original PA decision regarding Dr Borg’s rural dwelling as “a grave error”.\nIn his application, Mr Ciantar is also arguing that the court should strike down the minister’s permit on the basis that it goes against existing policies and is based on an “erroneous” original permit of a development of an ODZ residence which should never have been issued.\nBack to the drawing board\nLast month, the Environment and Planning Tribunal partially upheld an appeal filed by Mr Ciantar and withdrew the minister’s permit until Dr Borg and his wife present new plans reducing the size of his swimming pool, as it was not according to policy.\nThe tribunal had agreed with Mr Ciantar that, although according to policy no developments bigger than 75 square metres were permissible, the minister was given a permit to develop a larger area.\nThe tribunal had said the concession was “a subjective decision made by PA officers even though the policy did not allow such a concession”.\nMinister Borg would like to build a pool and outdoor area on ODZ land next to his house. Photo: Chris Sant Fournier\nWhile turning down all the other objections filed by Mr Ciantar, the tribunal had ordered the temporary withdrawal of the minister’s permit until fresh plans by his architect conforming to the policy were presented to the PA.\nLatest permit will increase substantially the value of ODZ property\nThe minister has already filed the amended plans but it is not yet known whether the PA has issued a new permit.\nHow the plans have developed over the years\nDr Borg’s development in a sensitive rural area in the hamlet of Santa Katerina, limits of Rabat, has been in the news from its inception.\nIn 2014, soon after gaining his seat in Parliament, Dr Borg was given a PA permit to turn a dilapidated ODZ dwelling into a 400-metre matrimonial residence.\nFollowing an investigation by the Ombudsman and the Commission Against Corruption, the Ombudsman had recommended a review of the permit, describing the PA’s green light as “a grave error” and that the permit should not have been issued. At the same time, no proof of corruption was found.\nDespite the recommendation, Dr Borg still continued with his development after the Prime Minister, at the time responsible for the Planning Authority, ignored the recommendation.\nIn the latest development, Dr Borg was given a permit, through a fresh application, to transform an agricultural field he had acquired together with the dilapidated house into an outside dining area and a swimming pool as an extension to his residence.\nThe issue on this latest permit, which will increase substantially the value of his ODZ property, was based on a policy allowing such extensions to dwellings which were already built in rural areas.\nThe field, which has idyllic, unobstructed views of the valley, was acquired by Dr Borg from a farmer for just €12,000.", "comment_count": 65, "id": 2983}, {"keywords": "", "author": "", "article_body": "If countries in Eastern Europe continued to refuse solidarity on migration, borders would be back in Europe sooner or later where they did not belong, PES candidate for European President Frans Timmermans said during a debate between the lead hopefuls on Wednesday.\nThis, he said, would be to the detriment of every citizen in Europe. “We need to prevent that, we need solidarity.” Solidarity, he said, was not just on things one liked but also on things one did not like.\nAsked about migration, Mr Timmermans said that every time someone died in the Mediterranean Europe lost a bit of its soul.\n“We’re losing who we are by not solving this problem. Once there are people on boats in the Mediterranean we have to take care of these people and one shouldn’t put fines on fishermen or people on boats who rescue these people, like the Italian government is doing.”\nHe said people had to be prevented from getting on those boats and agreed with EPP candidate Manfred Weber, who spoke earlier and called for a Marshall plan for Africa, that a huge plan was needed for the continent.\nMr Weber (EPP) said there was no doubt that a European solution was needed.\nStates, and not smugglers, had to control who was arriving in Europe and Europe needed to win back control of its borders. He called for the immediate establishment of a Frontex Office, resettlement for Syrian refugees, and a Commissioner for migration. The commission, he said, had to prioritise on these themes.\nGreens candidate Ska Keller said her party clearly stood for European and shared responsibility. Communities that were doing a lot to welcome people in need also had to be supported.\nWhat was happening in the Mediterranean was unacceptable, she said.\n“We know were these people are…” They were calling, Italy picked up the phone and asked them to call Libya and Libya was not answering. European search and rescue efforts were needed. “We should not allow any single person to die in the Mediterranean.”\nMargrethe Vesteger (Alde) said a long term stable solution had to be treated with the same urgency as saving lives at sea as migration was here to stay.\nEuropeans wanted to protect people in need of protection. A common asylum system and common solidarity was needed.\nJan Zahradil (Acre) said the mandatory quota system had not worked and had deepened the divide between Europe’s north and south. The sovereign rights of Parliaments and governments to grant or not to grant asylum, permanent settlement or even citizenship had to be respected.\n“What we have to do is to fight human trafficking and smuggling and outsource reception centres to outside EU… conduct readmission agreements with other countries… stabilise the situation in Africa.”\nNico Cue (EL) spoke on the importance that the European Union took responsibility when it came to migration.", "comment_count": 0, "id": 2984}, {"keywords": "", "author": "", "article_body": "The Socialist government was not speaking on what affected Maltese and Gozitan families and it was now also avoiding Parliament by halting important debates, PN leader Adrian Delia said on Wednesday.\nSpeaking in Valletta, Dr Delia said his party was committed to improve families’ quality of life and to continue to defend life.\nHe said workers were not keeping up with the cost of living and the government was importing foreign workers without a plan, to the detriment of the wages of Maltese and Gozitans. He said the PN did not believe in classes and all types of work was important in society. \nDr Delia pointed out that Malta had the second highest rate of early school leavers and this was leading students not to acquire the necessary abilities to aim for high-paying jobs.\nThe human resource was the best resource and the PN would continue to invest in workers. The work life balance Labour boasted of, he said, had been acquired through the work of MEP David Casa in the European Parliament.\nHe asked if the government was willing to guarantee the new work life balance rights and promise they would start to be enjoyed as was going to happen in the rest of Europe.", "comment_count": 9, "id": 2985}, {"keywords": "", "author": "Denise Grech ", "article_body": "Media reports on applications in Outside Development Zones try to anger people and throw them off a tangent, Prime Minister Joseph Muscat told supporters on Wednesday.\nSeveral applications on ODZ sites have attracted controversy over the past years, as environmentalists become more aware of the limited land available.\nHowever, Dr Muscat said the government should not be judged by the applications submitted to the Planning Authority. “As if we can stop them,” Dr Muscat said.\nAddressing a political event in Żabbar, Dr Muscat lambasted reports that a site selection exercise had selected Xgħajra for land reclamation. The Environment Resources Authority report had not yet been concluded when it was leaked, the Prime Minister said, adding it was untrue there would be any development in the area.\n\n'Maltese disgusted by PN MEPs'\nThe Prime Minister also said Maltese people were disgusted by PN MEPs and how they were not afraid to throw Malta under the bus, Dr Muscat said.\n\"We don’t want MEPs who are a government fan club,” Dr Muscat said. The Maltese should try to send a message to those who try to undermine Malta and who should know better, he said.\nThe only way we have to fight this is not through hate, or by posting on Facebook, but by voting, Dr Muscat said.\nWe don’t want our MEPs to be a government fan club- Joseph Muscat\nHe reiterated that the move by the Nationalist Party not to field enough candidates in over 20 localities was an \"insult\". \"They are sending a message that they want to sedate those who vote Labour. But it was a far bigger insult to Nationalist voters of the south,\" he said.\nHe also said he had spoken to investors who had said they came to Malta after hearing about the country from those of Maltese descent.\nThe dean of the Barts Medical School said he had heard of the school by a Maltese doctor in London that had visited him. This person – a certain Dr Aquilina - contacted the Maltese government and this eventually led to the agreement to build a medical school in Gozo.\nAnother American investor that had come to Malta to manufacture a video game had also heard about the country from a person of Maltese descent, Dr Muscat said.\n\"I am inspired by these people,” Dr Muscat said, adding they worked to promote Malta without expecting anything in return.\nThis was vastly different to the attitude of Nationalist MEPs who were being paid by the Maltese taxpayer only to try to undermine the country, he said.\nHe said he did not mind promoting Malta and did not mind being called a salesman, since his job was to go abroad and bring investment to the country.\nPN repeating Egrant mistake - PM\nTurning to the Egrant saga, Dr Muscat said the Nationalist party had no arguments and the PN had now realised that jumping on the bandwagon of the Egrant allegations was a mistake.\nHowever, Dr Muscat said, now that another election had come around it was repeating the same mistake.\nDr Muscat blasted the negativity of the PN’s campaign, saying they were cut off from people and did not realise how one word could be insensitive and hurt others.", "comment_count": 55, "id": 2986}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A total of 112 court sentences were, so far, withdrawn by the government from the public online database of the courts and other requests are being considered in view of the ‘right’ to be forgotten, the Times of Malta is informed.\nLast year, Times of Malta had revealed that, following an unannounced decision by Justice Minister Owen Bonnici, the Court Registrar was instructed to start considering whether a court sentence could be withdrawn from online public viewing in order to protect the names of those involved in the case.\nThe removed sentences would, however, still be kept in the court’s registry and on an online database reserved exclusively for the legal profession.\nNew statistics published in Parliament, following a request by Nationalist MP Karol Aquilina, show that the Court Registrar was inundated with such requests following news of this new ‘right’.\nDr Bonnici told Parliament that while until 2017, there were only 22 requests to remove court sentences from the online public system, in 2018, soon after this new ‘right’ was revealed by this newspaper, there were 121 requests made to the Court Registrar to strike off online court sentences. \nThese were followed by another 33 in 2019, with the total requests reaching 176 so far.\nCourt Registrar inundated with requests following the news of new right\nAccording to the Justice Minister, nearly two out of every three such requests made were accepted by the court authorities.\nSo far, 121 court sentences have been withdrawn from the public online system while the registrar is also considering another 22 requests. A total 41 requests have been turned down.\nThe introduction of this new ‘right’ was only discovered by coincidence.\nIn the beginning of 2018, a controversy erupted over the granting of a law warrant to two law graduates who years before had been found guilty of theft and were given a conditional discharge.\nAlthough the examining judges ignored the court sentences in their assessment, and gave their green light for the issue of a warrant to Yanica Barbara and Thomas Sant, the Chamber of Advocates and the Chief Justice objected as the law clearly states that a warrant to practise law should only be given to persons “of good conduct and good morals”.\nHowever, despite the objections, the government still issued the two students with a warrant.\nDuring the controversy, it had also resulted that the court sentence finding one of the warranted lawyers guilty of theft was somehow removed from the court’s online public database just a few days after the Chamber of Advocates had started querying the issue.\nWhen the Justice Minister was asked about the issue, he had revealed that he had introduced the right to be forgotten through verbal instructions to the Court Registrar.\nAt the time, Dr Bonnici had also admitted that there were no written criteria about the new policy, which had been introduced without any fanfare.\nLater, Court Registrar Frank Mercieca had formulated and published written criteria about who was entitled to make such a request.", "comment_count": 69, "id": 2987}, {"keywords": "", "author": "", "article_body": "An international organisation dedicated to halting \"intersex genital mutiliation\" has said that Malta continues to tacitly endorse the practice, despite it being the first country in the world to explicitly ban the practice. \nMalta’s Gender Identity, Gender Expression and Sex Characteristics Act, which was passed in 2015, outlawed gender normalising procedures on minors which could be deferred until the child could provide informed consent. \nSuch procedures were historically used to operate on children born with multiple sexual organs. \nInternational intersex human rights NGO StopIGM.org has now said that despite having outlawed such procedures - which the organisation dubs \"intersex genital mutilation\" - on paper, the reality was somewhat different. \nA report published by the organisation noted that Malta had only introduced sanctions for IGM in 2018.  These included imprisonment not exceeding five years, or a fine of between €5,000 and €20,000.\nThese penalties were lower than their equivalent for the crime of female genital mutilation, which stipulated five to 10 years in prison. \nMoreover, while in the case of FGM, a crime carried abroad could be prosecuted in Malta, this was not the case for IGM. \nParents who wanted their children to undero such procedures, the organisation said, were bypassing local laws by sending them overseas for surgery, reportedly to the UK, Belgium and Italy. \n'Human rights for hermaphrodites too'\nStopIGM.org demanded the prohibition of forced genital surgeries on children and adolescents with variations of sex anatomy. It called for \"human rights for hermaphrodites too\".\nThe people concerned, it said, should later decide for themselves whether or not they wanted surgeries and, if yes, which ones. The statute of limitation had to be adapted in such a way that adult IGM survivors could sue.", "comment_count": 10, "id": 2988}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The €8 million Valletta Design Cluster is set to open before the end of the year, as renovation works on the Old Civil Abattoir (Il-Biċċerija) in the capital continue apace.The 17th-century building at the end of Old Mint Street, which had lain in a dilapidated state for decades, will be given a new lease of life with co-working spaces, design studios for individuals and start-ups, exhibition space and conference rooms.It will also include a makerspace - a fully-equipped workshop with digital and traditional tools that can be used either independently or with the help of qualified personnel.The roof will host a garden designed by Japanese architect Tetsuo Kondo, which will be open to the public, while the complex will also include accommodation for artist residencies. The project was first announced four years ago as part of the Valletta 2018 infrastructural programme, and was originally scheduled for completion last year. It was delayed and has now passed under the management of the new Valletta Cultural Agency, with opening planned for late 2019.\nParliamentary secretary Aaron Farrugia, culture minister Owen Bonnici, project architect Amanda Degiovanni, Valletta Cultural Agency chairman Jason Micallef and project head Caldon Mercieca visit works at the Valletta Design Cluster. Photo: Mark Zammit Cordina.\nVisiting works on Wednesday, agency chairman Jason Micallef said the project had taken one of the most dilapidated buildings in Valletta and transformed it into a cultural lung for the lower part of the city. This, he said, formed part of a wider regeneration of the area including the Auberge de Bavière and the Marsamxett harbour-front.\nFrom residents to squatters\nThe building was originally constructed as an abattoir by the Knights of St John, and was eventually taken over for residential use, which continued until the 1980s.Residents were evicted ahead of plans for the building to be demolished and converted into a housing project, but these plans were never carried out, and the complex was reinhabited by squatters. When work on the Valletta Design Cluster started, 75 per cent of the roof had collapsed and had to be dismantled and rebuilt, with the existing material reused whenever possible, project architect Amanda Degiovanni explained. A number of typical rooms with low mezzanines, from the building’s use as residences, have been retained and will be converted into working spaces. Two of the building’s original eight large incinerator ovens, from its time as an abattoir, have also been retained; one will be restored to working order while the other will be used for teleconferencing.", "comment_count": 5, "id": 2989}, {"keywords": "", "author": "Denise Grech ", "article_body": "Sixty-five people, including one person with disability, two babies and five children were rescued off the coast of Libya, Sea-Watch said on Wednesday. \nEleven women were also on-board a rubber boat found 30 nautical miles off the Libyan coast. \nMany of those rescued showed signs of dehydration, exhaustion and sea-sickness, Sea-Watch said. The rubber boat had been spotted earlier by the civilian reconnaissance aircraft Colibri.\nAuthorities in Malta, Italy, Libya and the Netherlands, which is the flag state of the Sea-Watch 3, have all been informed, the organisation said. \nThe future for the 65 rescued is still unclear, with a spokesman for the NGO saying the vessel had no clear direction for a port of safety. \nAFM declines to comment\nContacted about the incident, a spokeswoman for the Armed Forces of Malta declined to comment, saying it had nothing to add to the Sea-Watch statement. \nRead: Italy's Salvini wants fines of up to €5,500 for every rescued migrant\nThe Sea-Watch 3 is currently the only dedicated rescue ship in the Mediterranean, which has long been described as the \"deadliest strip of sea\" worldwide.\nIt set sail to return on migration patrol on Saturday with Italian Interior Minister Matteo Salvini immediately warning that Italy's ports were closed.\nWhile not a single rescue ship was around, the number of boat departures from Libya had increased dramatically. Seventy people died and 240 were forcibly pulled back by the Libyans on behalf of Europe,\" Philipp Hahn, Sea-Watch 3's head of mission said.\n\"We are now back to counter this barbarism and to defend European values instead of only repeating them over and over on election posters,\" he said.\nThe rescue comes on the day a memorial plaque was laid down to commemorate a tragic incident in 2015 that saw 850 people die in an attempt to reach Italy. \nThe Sea-Watch was at the centre of controversy after authorities controversially refused to allow the vessel to continue its operations. \nThe Maltese government had stopped migrant sea rescue ships from entering or leaving local ports early summer. The decision was prompted by investigations against the captain of another Dutch-flagged rescue ship, the MV Lifeline, due to potential issues with the ship's registration.\nIt had finally set off after 115 days in Malta late last year. ", "comment_count": 0, "id": 2990}, {"keywords": "", "author": "Ivan Martin", "article_body": "A controversial schoolbook that tackles sexual development in young students has already uncovered potential cases of abuse since it was introduced last year, according to the authorities.\nThe Voyage Continues after Childhood hit national headlines last week when a mother uploaded a video to Facebook raising the alarm about its contentious content.\nThe parent took issue with the book which she said unnecessarily “sexualised” children by exposing them to gratuitous references to explicit behaviour.\nIn her video, which has since been widely viewed and shared on social media, the concerned mother takes issue with a section of the book which includes “a conversation between a boy and a girl who look about 11 or 12”.\n\n“They discuss how the boy feels when they are near each other, how he feels when she is near him and when she is pressing on him, and the same for her. This is what is being taught in Year 6,” she says.\nOther sections in the book ask young students to write down how a child their age would feel if they received a photo of another classmate in their underwear, or if an adult were to walk into the bathroom while they were in the shower.\n'Potentially serious issues flagged'\nEducation officer Stephen Camilleri, who co-authored the workbook, told Times of Malta that these were all realities facing children today.\nLike it or not, he said, 11-year-old children were potentially being exposed to issues of a sexual nature.\n“Children that age do not live in a vacuum. And in fact since its introduction we have had potentially serious issues flagged thanks to these classes,” he said.\nSome students, Dr Camilleri said, had told their teachers that they themselves had experienced some of the ‘problem scenarios’ detailed in the workbook.\nOne of the images in the workbook which asks students to draw a circle around the parts of the body that change through sexual development.\nContent based on UN and WHO guidelines\nAsked how the course and its content were drafted, Dr Camilleri said it was based on United Nations and World Health Organisation guidelines.\nIt was also “very similar” to classroom content offered in other EU states to students of the same age.\n“These books are not something that we come up with out of the blue. The courses start much earlier than Year 6 and we introduce the subjects gradually, in-line with international best practices,” Dr Camilleri said.\nHe added that the book, which is used in Personal Social Career Development (PSCD) classes, had been co-authored by another education officer and a local expert in sexual health.\n'Diabolical filth'\nMeanwhile the irate parent who had taken exception to the book’s content has also appeared on an online political discussion hosted by fringe political group Alleanza Bidla.\nOn the program, the mother, as well as another parent, describe the book as “diabolical” and “filth”, insisting that they had wanted their children not to sit for the class but had been refused this by their children’s respective schools.\nAsked about this, a spokesman for the Education Ministry said the PSCD course was not optional and was based on the principle of inclusive education.\n“Our objective is for students from diverse backgrounds all have a sense of inclusion in the classroom,” the spokesman said.", "comment_count": 105, "id": 2991}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The mother of a physically impaired child who stabbed her husband in a domestic row which followed numerous reports of abuse has been granted bail.\nThe 27-year-old Żabbar woman ended up in court on Wednesday after the police were informed that a man had been taken to the Paola health centre for treatment after he was allegedly stabbed by his wife.\nA search for the woman ultimately tracked her down at another health centre where she too was being treated for facial injuries, allegedly caused by her husband during a violent row.\nThe woman, who appeared before the Magistrates’ Court on Wednesday with freshly sutured facial wounds, had apparently filed a number of reports in the past against her husband.\nDuring one of those violent rows, the woman had allegedly first hit the man with a small pair of scissors before stabbing him in the abdomen with a kitchen knife, inflicting grievous injuries which, however, were not life-threatening.\nNo police action, despite previous claims\nDefence lawyer Stefano Filletti, entering a not guilty plea on behalf of the woman, pointed out that police had apparently failed to act in the past, despite repeated reports filed against the alleged victim of this final incident.\nReading from a police report, the lawyer said that the man had beaten her up in Paceville in February and although spoken to by the police, no action had been taken in his regard.\nThere were other reports of stalking and threats which had also been ignored, Dr Filletti went on. “This is the protection we were giving this woman,” the lawyer said, describing the man’s injuries as “a typical self-defence wound”.\n“Yes she will have to answer for her crime,” the lawyer said, pointing out, however, that both the woman and her seven-year-old son had been “terrorised” by the alleged victim, as evidenced by her numerous reports to the police.\nProsecuting Inspector Eman Hayman observed that although the woman was “clearly not going through a happy time,” the victim “was worse off as he had a knife stuck in him”. The crime was one of great gravity and there was a good chance of another crime happening if she were to be released, he said.\nGiven the background history to this arraignment coupled with the fact that the woman had a physically impaired son, the request for bail merited being upheld, Dr Filletti argued, also showing the court an image of the woman’s blood-smeared face.\nAfter hearing submissions from both sides, the court, presided over by magistrate Gabriella Vella, upheld the request against a deposit of €300 and a personal guarantee of €3,000.\nThe court also imposed a three-year protection order prohibiting the woman from approaching her husband and warning her to inform the police in case the man ever approached her.", "comment_count": 0, "id": 2992}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta’s airport has among the worst on-time performance, a passenger rights group has found. \nThe island’s only airport placed at 128th place out of the 132 airports whose performance was analysed in the survey by the group AirHelp. The ranking took into account official flight data as well as surveys among some 40,000 travellers. \nWhile Malta’s ranking stood at 6.05 out of 10, a score that is among the lowest, it was the airport’s on-time performance that impacted the result most. At just five out of 10, the ranking for on-time performance for the Malta International Airport (MIA) is the fourth lowest, with only the airports in Kuwait, Lisbon Portela and Eindhoven faring worse.\nOn-time performance measures how likely it is for a flight to depart at its scheduled time. \nThe metric was given a 60 per cent weighting for AirHelp's ranking, with airports' services and food and shops weighted 20 per cent each. \nIn the latter two aspects, Malta’s airport scored a 7.7 out of 10 for service quality and a 7.5 out of 10 for food and shops. \nWhile notably higher than the rank for the on-time performance score, the points awarded to the MIA in the two other categories were still among the bottom 20 airports ranked. \nMost disruptions are out of our control - MIA\nA spokeswoman for MIA said the ranking was “unfortunately significantly affected by its score for on-time performance”. \n“While we acknowledge that flight disruptions do negatively affect the overall travel experience, the most common causes of disruption (including weather, strikes, technical issues, and the domino effect these create) are largely outside MIA’s control and are a frequent occurrence which every airport actively works to mitigate in its day-to-day operations,” the spokeswoman said. \nAirport investing in new infrastructure\nThe company’s key focus, she said, is on driving service quality within the terminal and on the improvement of our facilities on the ground. \n“These efforts have been consistently recognised by more than one certified airport ranking authority over the years, whose data is collected, qualified and audited by passengers who have visited Malta International Airport. \n“In fact, MIA has featured among the top five airports within its category of the Airport’s Council International’s Airport Service Quality Survey for the last ten years, having received the coveted ‘Best Airport in Europe’ award in 2018,” the spokeswoman said. \nWhen asked whether there were concerns that the on-time ranking could impact tourist numbers, the spokeswoman did not reply. \nNew airport infrastructure \nMeanwhile, a government spokesman said that the airport is investing in new infrastructure which will “improve the airport terminal experience”. \n“In addition to the above, the government allocated management responsibility of an additional space to Malta International Airport to increase parking slots for aircraft.\n“Apart from the mentioned project, the Malta Air Traffic Services has introduced new measures to increase the efficiency of airport operations. In May 2018, it introduced for the first time ever Performance Based Navigation procedures on RWY 23/05 that has resulted in a significant reduction in diversions and flight delays in adverse weather conditions.  \n“Furthermore, MATS launched a project to build a New Air Traffic Control Complex that will involve the building of a new air traffic control tower equipped with the latest technology to increase the capacity of the airport while maintaining the high safety levels it enjoys.”", "comment_count": 23, "id": 2993}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta is looking into the possibility of using blockchain technology to help keep track of refugee applications, according to a European Commission paper on the subject.\nPublished earlier in May, the paper Blockchain for Digital Government looks at first movers in the EU when it comes to implementing digital ledger technology to national governance.\nAccording to the paper, the Maltese government is currently exploring the expansion of a 2017 project that saw blockchain used to digitise educational certificates.\nThis, the paper says, could see credentials for refugees also move to this new system.\nThe emerging technology, the paper says, could be used for verification of identity and recording social aid obtained by refugees in European countries.\nThe legality of the blockchain-based issuance and verification of certificates is however considered a main barrier to deploy this solution on an international scale.\nBlockchain is a decentralised digital database that keeps records of transactions and other information. Rather than having a central administrator like a traditional database, such as the case with banks, the blockchain ledger has a network of replicated databases, synchronised via the internet and visible to anyone within the network.\nExpansion of a 2017 project\nThe government had set up a task force in the previous legislature that is reviewing the best ways to introduce virtual currencies and the use of blockchain technology in Malta.\nJust as blockchain can be used for digital transactions, experts are looking at different uses of this online technology.\nBack in 2017 Malta had announced a pilot project to explore the possibility of issuing educational certificates on the digital ledger.\nThe project would see diplomas at MCAST, training certificates at ITS, and equivalence statements, accreditation and licensure from the NCFHE, all issued on the emerging technology.\nThe Brussels paper details how the project included the issuance of academic credentials, the verification of certificates, and the storage of personal credentials in the user app.\nThe current educational certificates project, the paper says, was limited to academic credentials, however the system itself could be extended to include multiple types of citizen records, such as birth certificates, marriage certificates, and so on.", "comment_count": 3, "id": 2994}, {"keywords": "", "author": "", "article_body": "Archbishop Charles Scicluna and Lifeline captain Claus-Peter Reisch on Wednesday were among those who paid tribute to the 850 people who died in an attempt to reach Italy from Libya in 2015.\nA long-awaited memorial plaque was laid down at the Addolorata Cemetery, where 24 dead migrants had been buried in April of that year.\n\n\n\nWatch: Captain fined over Lifeline registration; magistrate decries 'frightening levels' of racism\nDespite an extensive rescue operation, only 28 people survived. Twenty-four corpses were brought to Malta and the remaining 800 were believed to have drowned when their crowded boat capsized some 30 miles off the Libyan coast.\nOn that fateful morning, Prime Minister Joseph Muscat had told party supporters in Marsa: “They are literally trying to find people alive among the dead floating in the water\".", "comment_count": 5, "id": 2995}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A male massage therapist accused of having indecently touched a female client during a full-body massage has been granted bail. \nThe 43-year-old man and long-practicing masseur, whose name was banned under court order, was targeted by criminal prosecution following a report filed by a young Chinese student whose 75-minute full-body massage turned out to be traumatic. \nTestifying in English via video conference on Wednesday, the young woman, currently on holiday in Malta, explained how she had booked the treatment from her hotel.\nShe told the court that she had decided to go ahead with the message, despite reservations about the therapist being a man, after she was told that cancellation would imply forfeiture of the pre-paid sum.\nThings “started to get weird” when the massage began, she said. \n“I have been massaged many times before and always if they touch my private area by mistake they apologise, but this man, almost every time he would touch my private area.”\n“I was shocked because his hand regularly went inside my underwear… I said ‘please no’ and he said sorry.”\nOnce the massage was over, the man had questioned whether the client feared travelling alone.\n“I said no. He shook my hand and wished me a nice stay.”\nUnder cross-examination by defence counsel Michael Sciriha, the woman, whose trip to Malta was covered by a student insurance, explained that she had not called out for help or shouted at the masseuse since there was no-one else around.\n“It would have been dangerous,” the soft-spoken woman explained, adding that the two had been alone at the time.\nWhen accompanied briefly into the courtroom to identify her alleged aggressor, the woman said she thought it was the man seated at the dock but could not say this with certainty since she had been very nervous during the massage and had tried to avoid eye contact.\n“I don’t remember the man’s face very clearly,” she said.\nThe man’s lawyer entered a “definitely not guilty” plea to charges of non-consensual sexual acts and requested bail, pointing out that the alleged victim had testified, thus minimising the risk of tampering with evidence.\nThe request was upheld against a deposit of €500 and a personal guarantee of €5,000.The court also upheld the request for a ban on the names of both accused and the alleged victim, pointing out that this ban extended to any future judgment on the case.\nInspector Oriana Spiteri prosecuted. Lawyer Rebekah Tanti-Dougall also appeared for the defence.", "comment_count": 0, "id": 2996}, {"keywords": "", "author": "Denise Grech ", "article_body": "Matsec examiners marking the Maltese 2A O-level will be more lenient with students who complained their exam had been interrupted by an ongoing hen's party. \nStudents sitting for the exam at Giovanni Curmi Higher Secondary School had to contend with chants of “take a shot if you’re single!”, as a hen’s party went on during their exam.\nMore than 100 students filled out a form uploaded by student organisation Pulse complaining to examination board Matsec after Saturday's exam, saying the noise had been a serious distraction. \n“I went in a bit panicked for the exam and five minutes before it started, there were people below our building celebrating the hen’s party, with music on full blast,” one student said.\n“The invigilator instructed us to try not to listen to anything,” he said.\nThe party went on for an hour and a half and the exam was two hours long, students said.\n“You work so hard for an exam and you lose everything because of jokes and lack of respect for other people,” the student added.\n“I personally had no idea what I was writing and I am sure I did not get half the marks I deserved,” another student said.\nOthers said that people at the party were so loud, they could hear the games being played at the hen's party. They said they were hearing phrases such as 'take one shot if you're single, take two shots if it's complicated!' as part of a drinking game.\nA spokesman for Matsec said it was aware about the issue and that they were looking into the matter.\n\"MATSEC is informed that the Examinations Department which is the entity tasked with the selection and administration of the examination venues, is actively working with the relevant authorities to avoid a repeat of such disturbances,\" the spokesman said.\nMatsec will be taking into account that students were disadvantaged when marking the exams, the spokesman confirmed. ", "comment_count": 39, "id": 2997}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated 1.30pm with hearing outcomes\nThe Planning Authority has left open the door to two development proposals in the protected Wied Għomor despite a flurry of objections from environmental authorities, local councils and NGOs. \nThe two unrelated applications ‒ one to double the size of an existing farmhouse and add a pool, the other to level an area of sloping fields and build a greenhouse ‒ had both been recommended for refusal.\nHowever, at hearings on Wednesday, the Planning Commission board requested changes to the two proposals which would address the reasons for refusal, deferring both to June 12 for a final decision. \nThe board called for a slight reduction in the size of the planned residence, as well as increased landscaping and other changes, and an overall down-scaling of the extent of changes proposed in the other application. \nWied Għomor, a scheduled site of ecological and scientific importance between Swieqi and San Ġwann, has faced increasing development pressures in recent years. \nThe residential application, just outside the development zone off Triq Josef Kalleja, has drawn the ire of the Environment and Resources Authority (ERA) which said the current existing rural structure was “solely being used as a leverage to obtain a permit for a full blown residential building ODZ”. \nThe proposed additions, it said, would engulf the existing structure and visually dominate and disrupt its rural surroundings, due to the building’s location on a valley side. \nERA also warned that the applicant had already started land clearance and excavating without the necessary permits, and was also seeking to sanction an unauthorised boundary wall and create two new access roads. \n“These unauthorised interventions have contributed to environmental disturbance and affected the ecological value of the site by committing a sizable portion of land forming part of Wied Għomor valley,” the watchdog said. \nThe San Ġwann local council, as well as those of Swieqi and St Julian’s, have argued that the proposal would have a significant visual impact, and that the creation of a swimming pool had “absolutely nothing to do with the natural context of the valley”, violating rural planning policy. \nThe PA case officer, who recommended rejection, has said the proposed extensions to the farmhouse were excessive and would overshadow the existing structure, while the access roads “would lead to further intensification of urban development and formalisation within this ODZ area”.\nThe second application, off Triq il-Bies, is facing similar objections despite seeking a more rural-style development including a greenhouse, reservoir and tools room. \nHowever, the application seeks to level ground along the Wied Għomor valley side, leading to what the ERA called a “significant change in the topography of the area”. \nThe watchdog also said there was no justification for the proposed tools room, or proof of arable farming, with neither the applicant nor the site registered with the Agriculture Directorate. \nThe surrounding towns’ local councils were also among some 60 objections to the proposal, citing the impact on the valley’s ecology and character, as well as the fact that it would regularise existing illegalities on the site.", "comment_count": 27, "id": 2998}, {"keywords": "", "author": "", "article_body": "Diabetes patients need more community-based nurses, a better supply of continuous glucose monitors and more dietitians in clinics, the Nationalist Party believes.\nTwo of the PN’s MEP candidates, Francis Zammit Dimech and Michael Mercieca, joined MP Mario Galea at a press conference on Wednesday morning in which the party unveiled a document listing 20 proposals to improve diabetes-related services.\nProposals focus on improved medical services, better provision of diabetes-related medicines and equipment, more structured screening programmes and increased investment in research around the disease.\nOpinion: Let's not sugar coat diabetes - Francis Zammit Dimech\nMr Galea said that the PN had long been calling on the government to provide continuous blood glucose monitors to diabetes patients. Although the government has pledged to give them to children living with the disease, this has yet to happen, he said.\nDr Zammit Dimech said it was crucial for Malta to create a register listing every single diabetic, which would allow medical professionals to take decisions based on comprehensive and correct information.\nMr Mercieca said the European Union could help Malta improve its healthcare standards, which is why PN MEP candidates are committed to sharing information among member states to improve healthcare across the EU.", "comment_count": 2, "id": 2999}, {"keywords": "", "author": "", "article_body": "Sliema-born Bishop Peter Baldacchino has been appointed Bishop of Las Cruces, New Mexico, by Pope Francis.\nThe announcement was made in Washington by Archbishop Christophe Pierre, Apostolic Nuncio to the United States.\nMgr Baldacchino was ordained a priest in Newark in 1996. He was named auxiliary bishop of Miami in 2014.\nThe Diocese of Las Cruces has a population of 558,454 of whom a quarter are Catholic.", "comment_count": 8, "id": 3000}, {"keywords": "", "author": "", "article_body": "Barts medical students are due to move into their purpose-built school in Gozo in September, officials said on Wednesday during a site visit by Prime Minister Joseph Muscat.\nThe project was launched just over four years ago, and the school had originally been due for completion in 2016 but construction had hardly started by that time. Two intakes of students had to make use of temporary facilities at the Gozo sixth form. \nThe project is part of the 30-year concession agreement originally granted to Vitals Global Healthcare which the latter transferred to Steward Health Care of the US.\nThe new four-storey building was described by Barts and Steward Healthcare officials as \"the perfect place to study medicine\".\nThe facility includes two laboratories, a large auditorium, several skills and simulation rooms, classrooms and a catering area at the top floor. An anatomy centre was opened some months ago.\nThe building is nearing completion and will be fitted out in the summer.\n\n€26 million investment\nSteward handled the construction of the building in just over a year, investing €26 million which, it said, was a strong signal that “we are here to stay as a committed partner to the government, Barts, patients and staff.”\nSteward said that with the completion of the building, its focus is now shifting to building and refurbishing hospitals under a masterplan prepared in the past few months.\nPrime Minister Joseph Muscat thanked all those involved and also announced that Queen Mary University of London, which is partnering Barts in Gozo, will also be expanding into new academic fields at masters level in Malta and will also collaborate in humanities and science with the University of Malta.", "comment_count": 7, "id": 3001}, {"keywords": "", "author": "", "article_body": "Sharing experiences between countries ensures peace and growth, Foreign Minister Carmelo Abela has stated, while speaking to 160 participants during a thematic forum on the Mediterranean generation.\nThe forum, organised recently, brought together participants from across the Mediterranean region to highlight the importance of civil society and youth-led initiatives. It focused on education and mobility.\nThe Union of the Mediterranean (UfM) is currently organising another regional dialogue forum under the title ‘Shared views on key issues in the Mediterranean’.\nThe Union is an intergovernmental organisation made up of 43 member states from Europe and the Mediterranean basin. It seeks to enhance cooperation and dialogue through initiatives that leave a tangible impact. \nTwo projects  were selected in Malta during the forum to be part of the Mediterranean Initiative for Jobs. The first, the Mediterranean New Chance Network, was recognised as a model approach to address the challenge of the socio-professional integration of young people. \n“The MedNC network brings together 10 members from eight Euro-Mediterranean countries (Algeria, France, Egypt, Lebanon, Morocco, Portugal, Spain and Tunisia) with the aim of integrating at least two additional countries by 2019,” Higher Education and Research senior adviser Itaf Ben Abdallah said. \n“By mobilising and strengthening cooperation between Second Chance Schools notably, the MedNC project is benefiting more than 26,000 young people,” he added. \nThe second project, HOMERe, had already helped almost 500 students by offering them the chance to complete an international internship in the Mediterranean region. \nThe MedNC project is benefiting more than 26,000 young people\nSocial and Civil Affairs expert Abdelkader El Khissassi said the objective of the project is to support youth employment, specifically that of young graduates. \n“This also helps companies, particularly small- and medium-sized enterprises and employers, identify relevant student profiles from the region, enabling both parties to find better skill-matching employments,” Mr El Khissassi said. \n“The expected results from this project is to have up to 70 per cent of beneficiaries in employment in their country of origin after the end of the internship.”\nAsked what concrete measures the forum and workshop will leave, the two members of the UfM noted that the main added value of the organisation was the creation of cooperation with respect to policies and concrete projects. \nThe forum titled ‘Shared views on key issues in the Mediterranean’ is taking place on May 22 and 23 in Barcelona. \nThis event seeks to gather valuable insights of youth and civil society representatives as well as non-State actors from across the region on current challenges in the Mediterranean. \nIts conclusions will feed the discussions of the pre-summit forum of Tunis.", "comment_count": 0, "id": 3002}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A fresh application for bail by two men accused of murdering Daphne Caruana Galizia was dismissed by the criminal court on Wednesday, citing fears of public disorder. \nBrothers George and Alfred Degiorgio have been under arrest since December 4, 2017 and the compilation of evidence against them is at an advanced stage.\nThey, together with Vincent Muscat, have pleaded not guilty to having murdered the journalist by a car bomb on October 16, 2017.\nIn their latest application for bail, the two pointed out that the compilation had reached an advanced stage and that the majority of civilian witnesses and court experts had testified, leaving no valid reason at law to justify their continued arrest.\nThey further pointed out that another court hearing separate proceedings linked to money-laundering charges had deemed them sufficiently trustworthy as to afford them bail.\nProsecution objections\nHowever, the Attorney General objected to the request, citing the gravity of the crime which carries a possible life sentence, as well as fear that the accused could abscond if granted bail.\nMoreover, since the inquiry into the journalist’s assassination was still ongoing, there was a “strong suspicion” that there could be other culprits who had not yet been identified and intercepted, the AG continued.\nREAD: 3 to 5 other potential suspects in Caruana Galizia murder probe but...\nBail is not an automatic right - court\nThe Criminal Court, presided over by Madam Justice Edwina Grima ruled that although a person was presumed innocent until proven guilty, the granting of bail was not an automatic right.\nCiting four principles evolved by the European Court of Human Rights, the court pointed out that bail was to be withheld if there was a risk that the accused would fail to appear for trial, if the accused acted in a manner to prejudice the administration of justice, if they committed further offences, or if they caused public disorder.\nStating further that “the circumstances of this case are far wider than what appears from the court records,” the court noted that the inquiry into the murder of Daphne Caruana Galizia was still actively ongoing.\nThis meant that there existed a strong suspicion that not all the people involved had been identified, intercepted and brought to justice and releasing the three applicants could seriously prejudice the administration of justice.\nCiting ‘public disorder’ as a “relevant and sufficient” grounds, in line with European jurisprudence, the court held that continued detention was legitimate since public disorder remained threatened.", "comment_count": 0, "id": 3003}, {"keywords": "", "author": "", "article_body": "The Chamber of Commerce has welcomed a court's landmark ruling declaring that the current legal regime which regulates pre-1995 leases breaches landlords’ fundamental rights and is effectively unconstitutional.\nIt said it had raised doubts on the current laws in the past, even suggesting that they were in breach of the fundamental human right to own and enjoy private property.\nIn the current situation, it said, property owners were often stuck leasing out their property for cheeky amounts which were determined decades ago, having also to foot the bill for maintenance costs out of pocket which often runs into the thousands. This situation was made more unacceptable when property leases were inherited, prolonging the unjust situation further.\nThe Chamber reiterated its view that measures that ensure fair market rental value to landlords of pre-June 1995 leased properties, such as equitable means testing mechanisms, would ensure that social justice was achieved with the landlord, while also potentially increasing the supply of affordable accommodation.\n\"Numerous tenants may be artificially holding on to properties leased under pre-June 1995 lease agreement conditions due to the insignificant annual cost. If the annual cost does not remain insignificant, such tenants would likely terminate the lease agreement, hence allowing the landlord to place the property on the private rental sector,”  it said.\nIt called for the introduction of a reliable and functioning Market Value Property Index for the scientific determination of fair market (rental) value of property depending on size, location and amenities.\nIt also called on the government to speedily introduce all the necessary means to address this situation of injustice.", "comment_count": 11, "id": 3004}, {"keywords": "", "author": "Keith Micallef", "article_body": "A proposal for the redevelopment of the derelict Grand Hotel Verdala in Rabat would be less of an eyesore on the skyline than the existing building but would generate more traffic noise emissions, a study has concluded. \nThe findings are some of the conclusions of the Environmental Impact Assessment which was published for public consultation as part of the planning process. \nInaugurated in 1971 as a 160-bedroom five-star hotel, it ceased operations in 1997 as part of a major redevelopment project led by construction magnate Angelo Xuereb. However, the project never materialised until, in February 2017, a fresh application was submitted by Mr Xuereb on behalf of Royal Hotels Limited. \nUnder this plan, it is being proposed to construct a new five-star hotel with 40 guestrooms and 17 serviced apartments, a private residential complex of 85 apartments, four shops and underground parking for 179 cars.\nThe study notes the new development will have a smaller footprint and a “lower height profile” than the existing building.  \nThe study points out that the impact on landscape character is considered to be “generally positive and of major significance” in relation to the urban character of the area. The same conclusion was reached with regards to the im-pact on visual amenity.\n“In respect of 10 of 11 viewpoints assessed, it is considered that the scheme will improve the view when compared to what it is currently, with the change ranging from minor to moderate signi-ficance,” the EIA concluded.\nSmaller footprint and a lower height profile\nHowever, there will be loss of agricultural land as unroofed terraces of the ground level residential units in one of the blocks will encroach on 726 square metres outside the development zone, the report notes.  \nThe project’s overall footprint is of 6,507 square metres. \nAnother negative impact flagged by the report has to do with the noise emission from traffic which will increase once the development is completed, especially in Inguanez and St Catherine streets. In view of this, the study calls for a green travel plan to mitigate the issue, and the adequate infrastructure to promote the use of bicycles and motorcycles. However, in terms of emissions, the impact has been evaluated as not significant. \nThe EIA states that the construction phase is expected to last 30 months, noting that most of the site had already been excavated.\nIt also remarks that the geological impact of this project will be of major significance, even to the building itself. The report says that special measures should be taken to ensure that during the drilling of pillar foundations, there would be no excessive softening of the clay, which could jeopardise the stability of the site and contaminate the water table. \nWith respect to the impact on cultural heritage, the study says this is “uncertain”. Though the site had been previously excavated and no artefacts had been found, it notes that, being an area of archaeological importance, nothing could be excluded.\nThe EIA public consultation closes on June 12 and submissions can be made by e-mail on eia.malta@era.org.mt or by post to EIA Team, Environment and Resources Authority, Hexagon House, Spencer Hill, Marsa, MRS 1441.", "comment_count": 9, "id": 3005}, {"keywords": "", "author": "", "article_body": "A 33-year-old was rushed to Mater Dei Hospital after he was involved in a traffic collision in Birkirkara on Wednesday morning. The Birkirkara man was riding his Piaggio motorcycle in his hometown on Mannarino Road at around 7am when he collided with a Honda Accord being driven by a 71-year-old man who also lives in Birkirkara.He was taken to Mater Dei Hospital by ambulance, where doctors are treating him. No information about his medical condition was available at the time of writing.", "comment_count": 0, "id": 3006}, {"keywords": "", "author": "Ivan Martin", "article_body": "Police officer Simon Schembri lost his right arm in a near fatal traffic accident a year ago today. But, looking back, he knows he could have lost so much more.  \n“My life changed a lot that day – what I used to do in the past, I just can’t do it anymore. And as for the future, I don’t know what it will be like,” he told the Times of Malta. \nSince the incident, Mr Schembri has set up the Blue Light Foundation, which provides psychological and financial support to members of disciplined forces involved in serious incidents.\nThe soft-spoken and camera-shy 48-year-old rarely gives interviews.  \nIn fact, he says he would not be doing so if he did not want to be raising awareness about the risks taken by police officers and other disciplined forces. \nHe was propelled into the national spotlight after he was dragged along several metres of tarmac under a speeding car in a hit-and-run incident in May 2018. The incident saw one of his arms amputated and he suffered extensive injuries to his other limbs, his upper body and lungs – in all, he endured some 60 per cent disability. \nMr Schembri had tried to stop 17-year-old Liam Debono who had allegedly been driving a third party’s Mercedes without a licence or a seat belt. \nThe youth today stands charged with attempted murder and is out on bail after pleading not guilty to the charges.\nAsked to describe the impact of losing a limb, Mr Schembri says it all depends on how the limb is lost. \n\nIt’s one thing, he says, if it’s a normal accident, but “it’s another…” – the unfinished sentence hangs in the interview room, the pained look in his eyes suggesting that it is another thing all together if your limb is taken away from you.  \n“Maybe one day we will be able to discuss that, but not right now,” he said. \nIn fact, throughout the interview, Mr Schembri skirts the details of the incident that led to his gruesome injuries. \nHis lawyers have urged him not to prejudice the ongoing court case by speaking publicly about it. \nI had a nice life. I didn’t want anything else\n“I had a nice life. I didn’t want anything else – I was quite happy how I was,” he said.   \nDwelling on why he “had” a nice life, Mr Schembri said he and his family were only starting to regain some semblance of normality. \n“A lot of things changed in one year.”\nThree days of the week he is at Karin Grech Hospital's amputee rehabilitation unit for physical therapy. And as for his job, Mr Schembri now spends his days behind a desk, or raising awareness about the risks taken by first responders.   \nSimon Schembri being honoured with the Midalja għall-Qadi tar-Repubblika by then President Marie-Louise Coleiro Preca.\n“This is something that I am passionate about. Everyone is going to pick up the phone at least once in their lifetime and need emergency help, first responders. These people that answer the call, they risk their lives to help us and they deserve respect,” he said.   \nSince the incident, Mr Schembri has set up the Blue Light Foundation which provides psychological and financial support to members of disciplined forces involved in serious incidents.\nIt also raises awareness on the perils the officers face while on duty. To the public, his message is simple: respect first responders. \n“You never know when you are going to need these people,” he said.  \nWhat could seem like just another ordinary day could quickly turn into quite an extraordinary one through a simple twist of fate. \nAnd, to fellow officers and other first responders, his message is: “Get home safe.” \n“From my experience, I can say that there is always someone waiting for you at home, so get home safe to them.”", "comment_count": 34, "id": 3007}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta leads with a magistrate's decision to fine the captain of the NGO rescue ship lifeline 10,000 euro over ship registration irregularities. \nIn-Nazzjon quotes PN leader Adrian Delia saying the prime minister had pressed the panic button by abruptly cancelling parliamentary sittings to avoid a debate on abortion.\nOn the same theme, MaltaToday quotes Dr Delia warning of 'imposed abortion' if the socialists win the European elections.  The newspaper also reports on Tuesday's arraignment of three men accused of gang rape. \nl-orizzont leads with a court decision denying a request by the leader of the opposition for the Attorney General to publish the Egrant inquiry report in full. That story is also taken up in The Malta Independent and Times of Malta.\n L-orizzont also says that PSCD lessons in schools have stopped sexual abuses. ", "comment_count": 1, "id": 3008}, {"keywords": "", "author": "", "article_body": "The Eurovision Song Contest kicked off in Tel Aviv on Tuesday when 10 countries qualified from the first semi-final.\nThey are Greece, Belarus, Serbia, Cyprus, Estonia, Czech Republic, Australia, Iceland, San Marino and Slovenia.\nThe second semi-final, in which Malta will feature with young singer Michela, takes place on Thursday.\nREAD: Malta could stun all at the Eurovision\nThe final is on Saturday. \nDefiant Madonna determined to perform in Eurovision final\nPop icon Madonna has insisted she will perform at the finals of the Eurovision Song Contest despite calls to boycott her for playing in Israel.\n\"I'll never stop playing music to suit someone's political agenda nor will I stop speaking out against violations of human rights wherever in the world they may be,\" the singer said, in a statement carried by US media.\nMadonna's producers said in April the star would sing the Grand Finale of the music contest in Tel Aviv, which was designated the host city after Israeli singer Netta Barzilai won in Portugal last year.\nBut Madonna's participation unleashed a storm of protests from the Boycott, Divestment and Sanctions (BDS) movement, which has for years been pushing for investors and artists to shun Israel for its decades-long occupation of Palestinian territories.\n\"My heart breaks every time I hear about the innocent lives that are lost in this region and the violence that is so often perpetuated to suit the political goals of people who benefit from this ancient conflict,\" said the legendary performer, whose string of hits in the 1980s and 90s included \"Material Girl\" and \"Like a Virgin.\"\n\"I hope and pray that we will soon break free from this terrible cycle of destruction and create a new path towards peace.\"\nHowever, the Eurovision organizers said the 60-year-old's participation was not yet signed and sealed, and that the final contract for her participation had yet to be finalized. \n\"We are in a situation now that is a bit strange,\" said Eurovision's executive supervisor, Jon Ola Sand, at a news conference in Tel Aviv. \n\"We have an artist who would like to participate in the Eurovision Song Contest, and who we would love to welcome on that stage, but for that we need to have the framework secured. If there is no signed contract this week, she will not be on the stage.\"\nIsraeli media said preparations for the star's performance were going ahead as scheduled, with a first shipment of equipment having arrived in Israel on Monday. \nMadonna and her entourage of 135 people, including the rapper KoVu, 40 backing singers, 25 dancers and a team of technicians, were expected to fly in on Wednesday, according to reports citing the Israeli-Canadian billionaire Sylvan Adams, said by the press to be footing a large part of the bill to bring Madonna to perform in Israel. \nTel Aviv eyes tourism boon with 'amazing' Eurovision week Meanwhile, Israel is cashing in on tourism associated with the contest.\nOn Monday, just a day before the first round of semi-finals began in a nearby convention centre, downtown Tel Aviv was bustling with a Eurovision vibe.\nOn the elegant Rothschild Boulevard, volunteers with purple t-shirts and matching hats were providing Eurovision tourists with booklets and information about the city and competition venues.\nA short distance away, a group was gathering for a free walking tour of the city's LGBT landmarks, operated by Sandeman which had broadened its normal Tel Aviv repertoire for Eurovision week.  \nOn the sandy beach below the Hilton hotel, Laszlo Lukacs was enjoying the afternoon sun and breeze on a recliner.\nTo Lukacs, a Zurich-based Hungarian in software sales, the Israeli venue was an interesting twist in the Eurovision plot.\n\"It's super exciting for us Europeans to come here,\" said Lukacs, who has followed Eurovision to each host country for the past six years.\n\"Is this Europe, talking about Eurovision, is it the Middle East, all these different religions mixing here,\" he said.\nWhile Tel Aviv was expensive, Lukacs said its residents were \"super helpful so far and very nice, very friendly people.\"\n\"So far it's a very positive and interesting experience,\" he added.\nStretching eastward from the Mediterranean, Israel's economic and cultural centre likes to boast of its beaches, vibrant nightlife, ancient quarters and rich culinary and cultural scene.\nTel Aviv's pluralistic nature -- it hosts the largest Gay Pride event in the region -- stands in contrast not only to neighbouring Arab states but even other Israeli cities such as Jerusalem.\nWhile Israel's 2018 Eurovision victory with Netta Barzilai's \"Toy\" meant the Jewish state would host the next year, Tel Aviv was not handed the boon on a silver platter. \nIsraeli politicians initially insisted that Jerusalem host the event, backing down only after objections by ultra-Orthodox politicians over the finals being held close to the Jewish Sabbath.\nPressures by pro-Palestinian activists and artists to boycott the Israeli event loomed in the background, and tensions with Gaza, culminating in a flareup earlier this month affecting southern Israel, threatened to disrupt the event. \n- 'Like a wedding' -Eytan Schwartz, CEO of Tel Aviv Global who was tasked with preparing the city for Eurovision tourists, said hundreds of people had been working around the clock for nine month for the event.\n\"We prepared for this like a wedding,\" he said on the backdrop of a Eurovision banner outside the municipality building, which at nights illuminates its front with the flags of countries participating in the Eurovision.\nThis year 41 nations are competing, with Dutch singer Duncan Laurence favourite to win according to a survey of bookmakers by independent fan website Eurovision World. \nPreparing for the competition included training hotel staff, taxi and bus drivers, setting up a small army of volunteers and preparing accessible information for visitors, Schwartz said.\nWhile the 10,000 tourists in town for Eurovision do not represent a large quantity for a major European city, in small Tel Aviv -- with under half a million residents -- you \"feel them all around the city.\"\nA beachside Eurovision Village has been set up for live performances, with booths selling food and merchandise, as well as the Eurovision exhibitions and installations.\nFor Tel Aviv, the Eurovision was \"a platform to examine all our challenges as a small city and take us up a level as far as our abilities to absorb tourists,\" Schwartz said.\nThe unusual international exposure could also help position Tel Aviv as a venue for conferences and even sports events, he added.\nThe heavy media presence and global attention on the city \"is a gift that Netta gave us,\" Schwartz said.\nAt the Eurovision Village, visitor Chris Walker said the competition -- wed with the city known for its party scene -- would make \"an unmissable event.\"\n\"Everyone's so friendly, everybody's willing to help you any chance they can,\" the Scotland native said over blaring speakers.\nTravelling with Walker, Daniel said he'd been following Eurovision from Chile for the past seven years.\n\"This year I decided -- why not go to Tel Aviv, which is a city I've always wanted to visit, so here I am, waiting for the show to start,\" he said, praising the warm weather and people.\n\"Everyone speaks English and everyone is nice and so far it's been really amazing,\" he said.", "comment_count": 12, "id": 3009}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat on Tuesday insisted he was determined to see the Egrant inquiry report published in full.\nSpeaking in Luqa, he said that this, however, had to be done with respect to the Attorney General’s advice that one should not be hasty and publish anything which could hinder investigations.\nA court on Tuesday denied that request and the Opposition said it would be appealing the decision. \nHe said there were those who falsified documents and his interests were not vindictive but that these persons were caught.\nReferring to the former Opposition leader’s declaration that he (the Prime Minister) should stop playing the victim, Dr Muscat said he hoped Simon Busuttil would not have to go through what he had.\n\n\n\n“My strength to tell him so comes from the serenity within me. From the honour I have to lead this nation.”\nDr Muscat said that those who appealed for votes through division were in a state of panic. Labour, on the other hand, appealed for unity. “Malta in our hearts means that one has to love all Maltese wholly and truly at all times,” he said.\nThe Prime Minister said that the most divisive matter was the way parties looked at issues. Labour looked at the country and the people from a positive lens while others panicked and made up issues which everyone knew did not exist. One had speak on the difference between those who were positive and wanted unity and those who were negative and whose only intent was to sow division.\nDr Muscat praised young people for their commitment to issues they believed in and to which they dedicated their free time. He thanked them for being the heart and soul of the country.", "comment_count": 61, "id": 3010}, {"keywords": "", "author": "Denise Grech ", "article_body": "Nothing was keeping Prime Minister Joseph Muscat from publishing the Egrant inquiry in full now, Opposition leader Adrian Delia said on Tuesday.\nSpeaking in Msida, Dr Delia claimed the Prime Minister had called for an inquiry into allegations that offshore company Egrant was owned by his wife Michelle Muscat \"only to make a political statement\".\nThe inquiry had found no evidence that Egrant belonged to Ms Muscat, noting declarations of trust given to the magistrate included false signatures. \nThe Prime Minister had said he will be deciding whether or not to publish the entire Egrant inquiry report once a court handed down a decision on whether the Opposition should have a copy. \nA court on Tuesday denied that request and the Opposition said it would be appealing the decision. \nAddressing supporters, Dr Delia said the Prime Minister should publish the report in full so that people can find out \"what he and the Labour party are afraid of\". \n\"The head of the Opposition has the duty to be a public watchdog,\" Dr Delia said. \"That right was sanctioned today,\" he added.\nPN should go to European Court of Human Rights for full Egrant inquiry\nMEP Francis Zammit Dimech, who also spoke during the event,  said the Opposition should turn to the European Court of Human Rights if the Maltese court turns down the appeal. \nDr Muscat had promised to publish the full Egrant inquiry, but he had broken that promise, he said. \nHe also said the government had captured institutions, making it crucial for everyone to vote in the European Parliament elections in May.\n\nMuscat 'trying to capture Parliament as an institution'\nTurning to other topics, the Opposition leader also accused the Prime Minister of trying \"to capture Parliament under his control\" by shutting down the institution.\nWithout the Opposition's prior knowledge, Parliament went into recess on Monday and would meet again after the European Parliament and local council elections.\nThe PN protested the move, saying it had not been informed and insisted the government was trying to put off a debate on the Embryo Protection Authority. \nThe Prime Minister said he was open to a debate about abortion, but shut down Parliament when that debate should have taken place, Dr Delia noted. \n\"We have one message for the Prime Minister,\" Dr Delia said. You can shut away inquiries but they will still see the light of day. You can shut down Parliament, but we will continue to speak out,\" he added. \n\"The Prime Minister thinks the country is not called Malta but Joseph Muscat,\" he said.\nHe invited the Prime Minister for a debate on Xarabank next Friday, saying the people would be able to see who had the \"best ideas and who cared about the little guy\". \nReiterated calls for Msida University town\nDr Delia reiterated calls for Msida to be a University town and a maritime centre. \nThe PN, he said, believed in the potential of Msida, a place that housed the Junior College and the University. Abroad, towns like this, were full of life.\nThe move could attract investment in a town with an ageing population, Dr Delia said. \nBut, alas, he said, the present government had even kept Msida primary school closed for two years.\n \n \n ", "comment_count": 50, "id": 3011}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government is carrying out various infrastructural works on private roads in Qormi and Żebbuġ using taxpayer funds despite that such works should have been carried out and paid for by private owners, Times of Malta is informed.\nThrough its new roads agency, Infrastructure Malta, works have already been done in Żebbuġ, asphalting stretches of private streets which lead to complexes of garages built years ago.\nFollowing reports reaching the newspaper, Times of Malta on Monday witnessed ongoing works on a similar private garage complex in Qormi where a company contracted by Infrastructure Malta was rebuilding the streets and installing new underground services in preparation for a final level of fresh tarmac.\nWorks are being done on the eve of another electoral campaign, with local and MEP elections slated for May 25.\nQormi and Żebbuġ form part of the sixth and seventh electoral districts which incidentally are represented in Parliament by Minister Ian Borg, responsible for the roads agency.\n“Just a few weeks ago a Labour candidate for the local council came to tell me at my garage that Ian (Minister Borg) will be doing up our road,” a garage owner in Qormi’s Bellic Street, told the newspaper.\n“We were always told that since this is a private road the government is not responsible and works have to be carried either by the owner, who sold us his garages, or by us if we didn’t pay the owner for the road when we purchased our garages,” he said.\n“However, it seems that the coming elections have at least served us for something,” the garage owner added. \nA similar situation occurred just a few weeks ago in Żebbuġ. Private streets forming part of a garage complex in Triq Dun Mikiel Xerri were dug up and new tarmac was laid after new pavements were constructed at government’s expense. \nA 55-year-old owner of a garage in the street, who said he had been lobbying with the garages’ developer for the tarmacking of the road for years, let slip that “the dentist had surely helped out”, referring to former Nationalist MP Jeffrey Pullicino Orlando who has his private dental clinic on one of the corners of the freshly surfaced private road.  \nAsked to confirm the works on private roads, an Infrastructure Malta spokesman at first avoided giving a direct reply and instead said that “these were publicly accessible” streets.\nPressed to state whether the roads in question are privately owned and to explain why the government had spent tens of thousands of euros from public funds for works which were supposed to be carried by the road owners, the spokesman admitted that these were indeed privately-owned streets.\n“The indicated roads were originally formed for private use but through the years became publicly-accessible and started being used as public roads,” the spokesman said.\n“Infrastructure Malta carried out the required repairs in view of their public utility, and in line with applicable road work regulations.”\nQuoting new road regulations, enacted only last year through subsidiary legislation, the spokesman said that the rules allow such intervention.\n“The agency may, at any time, carry out or cause or allow to be carried out in and under any private road and work whatsoever which it considers necessary or useful on grounds of public utility.”\nHowever, the government agency failed to state that the same rules clearly state that works on private roads are to be paid by private owners.\nFresh tarmac on private road in Żebbuġ, laid by Infrastructure Malta.\nThe rules Infrastructure Malta did not quote\n“The owners of any property immediately abutting on any private road or the persons holding such property on emphyteutical lease shall, for the purpose of this part, be deemed to be the persons who opened such road and the owners thereof:\nProvided that any person who is bound to carry out any work in any such road shall be entitled to bring against third parties any civil action, admissible according to law, for the recovery of any expenses incurred in the execution of the work.\nThe Agency shall be enabled to carry out, or as the case may be, to continue the carrying out of all or any of the works (in private roads) after having given the owner notice by registered letter of its decision so to do: any such works shall be carried out at the expense of the person who has opened the road.\nEvery private road, including the footway thereof, shall, on notice by registered letter given by the Authority, be asphalted or surfaced otherwise as indicated by the Authority, by the Agency, at the owner’s expense.", "comment_count": 42, "id": 3012}, {"keywords": "", "author": "", "article_body": "Two men were injured in a traffic accident in Luqa, one of them grievously on Tuesday afternoon.\nA 43-year-old man who lives in Valletta was grievously injured while a 31-year-old man who lives in Birżebbuġa was slightly injured.\nThe police said the accident happened in the limits of the industrial zone at 5.15pm.\nThey said the Valletta man was driving a BMW318D that was involved in a collision with a Citroen Jumper that was being driven by the 31-year-old, an Italian.\nBoth drivers were assisted by a medical team on site.\nThe police are investigating.", "comment_count": 0, "id": 3013}, {"keywords": "", "author": "Denise Grech ", "article_body": "An average of €1,000 per family was spent in renovating housing estates in Floriana, after it was found the buildings needed an infrastructural makeover.\nSpeaking in Triq il-Kapuċċini, Parliamentary Secretary for Housing Roderick Galdes said the buildings in Floriana required replacement of apertures, works on the drainage systems and improvements in the common areas.\nThe Floriana council benefitted from a grant of €32,000 from the Housing Authority and six blocks of housing estates in Triq il-Kappuccini, Triq Sant’Anna, Triq il-Miratur and Triq il-Fosos were embellished as part of the scheme.\nThese housing estates in Floriana required an infrastructural makeover. Photo: Google Maps\nIn total, 100 families living in the apartments had their houses improved, Mr Galdes said. \nThe government, he said, embarked on a series of projects to transform abandoned and derelict buildings into modern social housing accommodation.\nThirty-three government-owned buildings had recently been handed over to the Housing Authority for renovations.\nCritics have pointed out it has taken a Labour government seven years to build any social housing projects. The Prime Minister has recently announced that the number of units planned will balloon to 1,000, thanks to funds coming from the sale of passports.\nRead: Social housing is not something that should be inherited - Muscat", "comment_count": 3, "id": 3014}, {"keywords": "", "author": "", "article_body": "A Turkish Airlines plane heading from Istanbul to Accra was forced to divert to Gudja and land at Malta International Airport after running into technical trouble on Tuesday.\nSources said that the Boeing 737-9F2 plane developed a problem with one of its wheels as it was over northern Africa. Its captain opted to turn the aircraft around and land in Malta. \nThe aircraft landed in Malta safely some time after 3pm. \nAn MIA spokesperson confirmed that the airport had handled a “technical diversion” but said that operations were running normally.", "comment_count": 2, "id": 3015}, {"keywords": "", "author": "", "article_body": "The Malta Developers Association has welcomed government plans for new public parks in Ta’ Qali and Birżebbuġa, while calling for the setting-up of a new committee to increase open spaces in built-up areas.In a statement, the developers’ lobby said it supported the recently-announced decisions to double the size of the Ta’ Qali national park, and to undertake a large-scale afforestation project on land previously earmarked for an extension of the Freeport in Birżebbuġa.Apart from these substantial areas being converted into large parks, the association said, smaller open spaces within urban confines were also required to provide much needed \"lungs\" in developed areas.“For this possibility to become a reality, the Association of Developers feels that a concerted effort is needed, and therefore suggests the setting up of a committee in which the government, environmental NGOs and developers represented by MDA, can collaborate to find solutions for making such areas in developed localities a feasible reality,” it said in a statement.“This committee would also involve the relative local councils when making suggestions and ensure that landowners are adequately compensated for land that may need to be taken up, if this is the case.“MDA has been insisting on forward planning to improve the quality of life for everyone and strongly believes that open spaces in our urban environment would go a long way to achieve this.”", "comment_count": 33, "id": 3016}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Verbal insults by two young men, calling another youth a “pussy”, sparked off a violent scuffle on the streets of Paceville which landed the duo in custody and their victim in hospital.\nJordan Leli Brown, 27, a car valet and Josh Ronnie Edward Ahmed-Sone, 25, a paint sprayer, both holders of a British Passport, were staying at a St Julian’s hotel when a night out in Paceville lent a sour twist to their holiday.\nIt was shortly after midnight when the two allegedly got involved in a verbal spate with a young man who, after a drink too many, had reportedly been feeling sick outside a burger bar and was being assisted by his anxious sister and her friend.\nThe foul-mouthed duo first engaged in a verbal attack, trying to shame the Maltese youth for needing assistance by two women. As words gave way to push and shove, the sick man ended up suffering grievous injuries before his alleged aggressors took to their heels, the victim’s sister giving chase.\nAs the young lady caught up with the fleeing duo, one of them allegedly grabbed an ashtray and flung it, missing the woman but striking a glass panel on Baystreet Bridge, causing damages in the tune of €2,496.\nThe whole incident lasted minutes, but it resulted in grievous injuries for the Maltese man who was still being treated in hospital on Tuesday morning when his alleged aggressors were taken to court to answer to their wrongdoing a few hours earlier.\nThe two were jointly charged with slightly injuring the woman, attempted use of force, insults and threats against brother and sister, willfully disturbing the peace and the repose of inhabitants, as well as being drunk in public.\nMr Brown was separately charged with causing the male victim grievous injuries, willfully damaging property belonging to Baystreet Complex and threatening the woman with a hard object.\nHe was further separately charged with threatening three officers at the St Julian’s police station while attempting to bribe them with cash to prevent them from carrying out their duties.\nThe two pleaded not guilty and requested bail.\nProsecuting inspector Joseph Xerri objected, pointing out that the men had no ties and no fixed address in Malta where they had been on holiday, adding that they had checked out of their hotel immediately after the incident in what appeared to be an attempt to abscond.\n“Bail is a right not a condition,” rebutted legal aid counsel Simon Micallef Stafrace, arguing that their passports had been submitted to the authorities. Moreover, since one of the men had Maltese parents, the two could easily rent property on the island.\nThe lawyer continued that the incident involved four persons who had barely met for a few minutes and all four would supply four versions of the incident.\nThe court, presided over by magistrate Doreen Clarke, turned down the request on the grounds that the accused had not offered any fixed address and presented a risk of absconding.\nLawyers Jason Azzopardi, Kris Busietta and Julian Farrugia appeared parte civile.", "comment_count": 0, "id": 3017}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Mental health professionals and parents of children with attention deficit hyperactivity disorder (ADHD) are urging the authorities to provide a variety of treatment options, and reverse a decision to swap a particular medicine with a generic one.\nPlaying around with medication is not an option for us, and lack of medication can have serious repercussions, ADHD Malta is calling on the government. \nNearly 900 people have signed an online petition by the support group calling for effective medication through the Pharmacy of Your Choice scheme.\nMedication available worldwide allows 95% of children to be treated with one form of medicine or another, however, patients in Malta are struggling.\nWhile the variety available abroad was not provided here, a recent swapping of a medicine with a cheaper one resulted in regress among some sufferers, ADHD Malta said.\nAccording to the petition, it was most concerning that “due to changes imposed on the ADHD community” some have had to purchase medication to ensure that their loved ones did as well as they possibly could. \nThis was not only resulting in an extra expense but even creating an out-of-stock situation where people were being left without medication for weeks on end.\nADHD Malta president Pamela Muscat noted that while it was already difficult to give medicine to children because of stigma and swallowing difficulties among others, the emergence of fresh symptoms from the new medicine made the situation even worse. \nNearly 900 people have signed an online petition by the support group\nWhen Times of Malta reported last month that changes in medication were having a detrimental effect on children and adults, the government said it had commissioned a study to look into a number of cases.\nOn Monday, a spokeswoman for the Health Ministry said the study has been concluded and the Chief Medical Officer was now waiting for the expert report and its recommendations.\nThe Association for Child and Adolescent Mental Health has meanwhile added its voice to the call for more flexible treatment to be made available locally.\nIn comparison with other developed countries, Malta lacks some important pharmaceutical treatments.\nMaltese patients also lacked access to a medium-acting medicine that had a better side-effect profile, with less sleep disturbances and a less durable effect on appetite suppression, when compared to what was available locally, it said.\nACAMH-Malta also flagged “adverse effects” as a result of the recent switching of medicines, which included total absence of response. \nIt appealed for “caution when adopting new drugs as part of the repertoire offered by the national formulary, considering that more studies were needed to ascertain a concrete evidence-base for the use of” the one currently being provided.\nMeanwhile, ACAMH-Malta also called for better access for ADHD diagnosis because at times, patients had to wait up to four years for formal assessment and diagnosis.", "comment_count": 5, "id": 3018}]