[{"keywords": "", "author": "Vanessa Macdonald", "article_body": "Richard Bilocca wants to talk shit. He wants to explain why after six years of profits, the Water Services Corporation still needs a government subvention, and that it is going to go up yet again next year, from €17.2 million to €19.3 million, even though the corporation had a record turn-over.\nThe issue is not water production but the cost of providing drainage, for which people are not directly charged, as well as the various environmental services provided by the corporation.\n“We do not make a loss on the production of water – in spite of the fact that the tariffs are socially engineered to encourage lower usage,” the CEO told The Sunday Times of Malta.\nThe corporation, which until 2003 had only provided and distributed water, had taken over the Drainage Department pretty much lock, stock and barrel. And the costs there have been getting higher and higher, reaching about €18 million a year.\nThis is because treatment of the sewage has become much more expensive since EU accession dramatically raised the standards. Sewage treatment is also, Mr Bilocca stressed, a very energy-intensive process. Actually, the €8.2 million was what we achieved. The estimate for the year had been €1.4 million\n“If we were to add up all the services that we provide over and above tap water and sewage, you will probably find that the subvention should be even greater!”\nThe CEO took over in 2017 – the sixth appointee since Labour came to power – facing doubts over whether he would succeed in improving the situation.\nHe has overhauled the “very fragmented” hierarchy, which before consisted of seven directorates. “We have a much more logical structure now, with directorates far better defined to ensure more seamless operations and to remove the silo effect.”\nThe corporation has a headcount over 1,100 – with 222 people added before the general election in 2017. This pushed the wage bill up and it now represents 33 per cent of costs, from 29 per cent in 2015.\nHe insisted all the staff are being “fully deployed”, with some areas where resources are actually stretched.\n“We now have a much more dynamic workforce,” he said, adding that training was the key.\nVideo: Mark Zammit Cordina\nThe WSC’s annual report, recently presented to Parliament, said the estimated operational profits for 2019 were down to a €3.4 million from the €8.2 million reported for last year.\nHe smiled: “Actually, the €8.2 million was what we achieved. The estimate for the year had been €1.4 million. And next year’s should also be just a projection. We did better than forecast…\n“Having said that, we are ploughing considerably more money into improvements and we have unprecedented levels of expenses to cover not only maintenance on crucial sites but also capital expenditure.\n“We certainly do not need to review our tariffs. However, instead of passing the savings that result from better efficiency on to the consumer in a monetary way, we are doing it by passing them on as improved service.”\nFive facts about water supply\n■ The Water Services Corporation employs 1,100 people, representing 33 per cent of its costs.\n■ It made a profit of €8.2 million last year.\n■ 50 dispensers of treated sewage water have been installed in agricultural areas, with the figure set to rise to 400.\n■ Reverse osmosis water is slightly acidic, so it has to be treated with alkaline before being distributed.\n■ Some reverse osmosis water is blended with 40 per cent groundwater.\nWater production has come down drastically since 1995 because leakages – which used to account for 60 per cent of production – are now so low.\nPlugging those leaks\nThe corporation is tackling water production on various fronts. The first one – and arguably an environmental priority – is to reduce the depletion of groundwater before the situation becomes irreversible.\nOne measure is to provide farmers with an alternative, particularly since they cannot use chlorinated water: so-called ‘new’ water. Once sewage has been treated – to just short of the fully potable ‘gold’ standard – it is being made available via dispensers placed in agricultural areas: 50 so far, with the intention of increasing them to 400.\n“Rather than pumping treated water into the sea and losing it, this can be used for agriculture – even on raw crops like lettuce and strawberries!” he said, noting that seven billion litres per year were available.\nThe government is encouraging take-up by offering the first consumption band free of charge (reimbursed to the corporation by the government), followed by a progressive tariff.\n“This has been a tremendous success with very good take-up in spite of initial reluctance.”\nWith regard to potable water, one of the main thrusts over the past decade or two has been reducing leaks, which used to account for some 60 per cent of all the production. Overall production is now half what it was in 1995, in spite of the burgeoning demand, all thanks to the dramatic reductions in lost water.\nMr Bilocca said the leakages are now so low that it costs as much to tackle them as the lost water itself costs, although there was no room for complacency.\nWith a rapidly growing population, the corporation is keeping an eye on trends. It has projections on demand up till 2050.\nThe capacity of the Maltese reverse osmosis plants is increasing, but he described the new one on Gozo – which will produce six million litres a day, with a capacity of nine million – as a “game changer”. The island, he pointed out, had been left for a whole week and a half reliant on groundwater because the undersea cable that linked it to Malta was damaged by February storm.\nAnother priority is to reduce the energy required by the reverse osmosis plants, which was 10kWh per 1,000 litres in the 1990s and is now 2.8kWh.\nWhy are we still drinking bottled water?\nWSC CEO Richard Bilocca hopes that tap water will be good enough for drinking within the next two years.\nMr Bilocca caught us looking at the bottle of water on his desk and cringed.\n“It’s embarrassing, I know. I cannot drink from my tap here in Luqa! But things are changing,” he said.\nThe problems with tap water are somewhat technical. Pure reverse osmosis water is slightly acidic, so the supply to places like Pembroke and Sliema – which get it direct from the RO plant – is treated with alkaline chemicals, as it would otherwise eat away the pipes. Other areas have it blended with groundwater, in a 60-40 per cent ratio. The groundwater will be reduced to 30 per cent in the near future.\nThe corporation is tackling this in two ways: fibreglass pipes which are corrosion-resistant and a blending plant at Ta’ Qali. This is fed by tunnels from four directions, which will allow all the RO water to be blended, diluting the salt from the groundwater and meaning no alkaline chemicals are required.\nWithin two years, Mr Bilocca hopes that the bottle on his desk will no longer be needed.\n“We already provide water. Now we are focusing on making the experience more pleasurable, because people deserve it.\n“An improvement in water is an improvement in the quality of life. Just ask the mother of a young child or an elderly person who has to lug around six-packs of bottled water! Never mind the impact of the plastic on the environment. Whatever it takes we are going to do it.”", "comment_count": 10, "id": 1419}, {"keywords": "", "author": "", "article_body": "During searches in several localities, by Customs Enforcement Officials, 6,956 bottles of wine and 740 plastic bags on which excise duty had not been paid were seized by Customs.The items were found in various outlets when officials were carrying out routine searches in Sliema, San Ġwann, Tal-Ibraġ, St Paul's Bay, Buġibba, Qawra, Mosta, Balzan, Birkirkara, Mrieħel, Qormi, Ħal Far, Marsaxlokk, Marsascala, Fgura and Senglea.The Customs Department’s Enforcement Unit has been clamping down on the sale of illicit goods, in an effort to hamper contraband operations and collect the taxes owed, which is being charged to the end consumer.", "comment_count": 3, "id": 1420}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Her teenage son could have lived had adequate safety measures been implemented on the boat he was on before jumping overboard to his death two years ago, a mother argued in court.\nJulian Quatresous and five of his friends had leapt off the Fernandes II in mid-August 2017 as it cruised past Paceville on its way back from Comino, thinking they would save time and swim ashore rather than go all the way back to the boat’s berth in Sliema.\n“At a certain moment, we recognised the great tower at St Julian’s, which is very close to the night clubs. At a glance it didn’t seem that far away,” his friend, Louis, said in an affidavit presented in court.\nHis family has taken the boat owners, Captain Morgan Submarine Ltd, to court, saying the young Frenchman’s death was the result of their negligence and their failure to abide by rules and regulations, both with regard to maritime law and also to health and safety. The case is being heard by Mr Justice Lawrence Mintoff. The magisterial inquiry into the fatality has not been concluded yet.\nDocuments submitted in court give a heart-breaking account of the hour the teenagers spent in the sea after they jumped off the boat at about 1am.\nJulian Quatresous had wanted to join the merchant navy.\nIt seems the leap was not pre-planned: one of the boys, Pierre Antoine, jumped and others followed, leaving one of the others asleep on board. It was only when they were in the sea, fully dressed, that they realised the shore was much further than it had seemed and the waves much harder to deal with.\nThey started calling out but lost sight of each other several times.\n“I heard someone panicking and swam towards him. Among these cries of panic, I heard Julian asking where we were. He did not seem to be in difficulty… I found Pierre Antoine, who was drowning, in front of me. Louis joined us and we brought Pierre Antoine to his senses,” another of the boys, Hugo, said.\n“I heard Raphael shout the first name of Julian three or four times… I thought that Raphael and Julian were both swimming. I was not worried about them as they were both used to the water,” he recalled.\nAfter about a quarter of an hour, they could see rescue boats and a helicopter but realised they had not been spotted and continued trying to swim to shore.\nIt was only some 45 minutes later that three of them were picked up by rescuers and taken to the Armed Forces of Malta maritime base where they found two of the others who had been picked up from the beach.\nHugo was the first to be picked up by a patrol boat and he guided it to where he thought the others were but it was only when they were picked up that they realised Julian was not with them.\n“As he got into the boat, Raphael was sobbing and told me that they had lost Julian,” he said.\nAs the hours passed with no news of him, they realised that they had to tell Julian’s family about his disappearance.\nHis mother flew in from France with her sister and other son the following Sunday. They were still hoping for the best and set up teams, having someone at the apartment all the time in case Julian showed up.\nThe days passed and their worst fears were eventually confirmed when Julian’s body was found by divers. He was just a few months short of 20 and was due to start his studies at the National Maritime School, in Marseilles that September.\nThe friends’ affidavits gave some insight into the situation on board the boat.\nThe sea had already been choppy when they set off, with a friend saying: “The boat was rolling a lot and you had to hold on in order to move without falling over.”\nPierre Antoine said in his affidavit he had only seen one security guard on board (his friend Hugo said there were two) and that, even so, the guard was only concerned with making sure that only those with VIP tickets got into the reserved area.\nOne of the friends said there had been about 200 people on board for the event organised by Lazy Pirate. A few of them said they had not been given any safety briefing and that they could see no safety equipment.\nIn her affidavit, Julian’s mother, Christine, said she bought a ticket and went on the Fernandes II herself the Saturday following her son’s death, wanting to see for herself what kind of party it was.\nShe said that although the tickets were verified on boarding, none of the youngsters were asked about their age even though it was to be an open bar. She said she saw no headcount being taken either as they boarded the boat nor once she sailed off, nor when the boat left the swimming stop at Comino, even though a number of passengers had swum out of the area illuminated up by the boat’s floodlight.\nSome of Julian’s friends gave similar accounts in their affidavits.\nAlthough she could not recall whether there had been a safety briefing, the mother said there were no life jackets visible, nor any cabinets where they could have been stowed.\n“I believe that if the crew members were sufficiently responsible and if there had been more of them to ensure better surveillance and adequate security measures during these parties, my son could have been spared from his tragic death,” she declared in her affidavit forming part of the records of the case.\nCaptain Morgan Submarine denies all accusations.\nIt pointed out that the boat had been chartered to the party organiser, Lazy Pirate, though it had earlier declined to pass a copy of the charter agreement to the family’s lawyers.\nThe company said the incident was due to the victim’s negligence, recklessness and his failure to follow regulations.\nThe legal team representing the family is headed by lawyer Cedric Mifsud.", "comment_count": 0, "id": 1421}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta leads with a follow-up to the 2017 tragedy when a French teenager had drowned after jumping off the Fernandes II to swim to shore. It also reports on the decision to co-opt Jean Pierre Debono to fill the PN seat in parliament vacated by David Stellini, saying it was 'vitiated'.\nThe Malta Independent also leads with the PN controversy, focussing on Jason Azzopardi and asking him whether he has faith in leader Adrian Delia. It also reports on the setting up of a new eNGO called Futur Ambjent Wieħed, which is to be headed by Claire Bonello.\nL-Orizzont leads with the speech made by Prime Minister Joseph Muscat under the headline \"The 'we' is more important than the 'I'\". It also reports on the setting up of a new agency for the intergration of the disabled.\nIn-Nazzjon has PN leader Adrian Delia as its main story, with his promise that the Nationalist MEPS in the European Parliament would be a voice for all the Maltese and Gozitans.", "comment_count": 0, "id": 1422}, {"keywords": "", "author": "", "article_body": "Updated Monday 7.30am\nA motion to co-opt Jean Pierre Debono into parliament was postponed late on Sunday evening, as Nationalist Party leadership scrambled to contain fallout from a contentious vote to have Mr Debono replace outgoing MP David Stellini.\nSpeaker Anġlu Farrugia received word late in the evening that the PN would not be presenting Monday’s motion, sources told Times of Malta.\nThe party opted to put off the vote after it learned that a number of its own MPs intended to file a warrant of prohibitory injunction against the co-option on Monday morning, sources said, in a legal bid to block Mr Debono from being appointed an MP.\nThe injunction had already been drafted and would still be presented if the PN sought to go ahead with Monday’s motion, the sources said.\nDebono under pressure\nMr Debono, who won a secret ballot to replace Mr Stellini by just two votes, came under intense pressure on Sunday evening after being accused of having allowed two ineligible executive committee members to cast a vote in Saturday’s ballot, which he himself won. on Monday, he pointed the finger of blame at outgoing executive committee president Mark Anthony Sammut.\nThe PN’s Gozo regional committee was the first to flag concerns, writing party leader Adrian Delia a letter in which it noted that Mr Stellini should not have been allowed to vote, as he had already resigned his seat in parliament.\nThe committee gave the party until Sunday evening to revise the decision to co-opt Mr Debono and threatened legal action if it did not do so.\nShortly afterwards, outgoing executive committee president Mark Anthony Sammut suggested that another ineligible member, treasurer David Camilleri, had also been allowed to vote.\nRead: Sammut points finger at Debono, who hits back\nIt was Mr Debono, Mr Sammut charged, who was responsible for keeping track of executive committee attendance records and data.\n“The conflict of interest is clear,” he wrote. “Gozitans not only had a [parliamentary] seat stolen, it was stolen through deception”.\nMP Jason Azzopardi went a step further, writing on Facebook that Mr Debono had committed “fraud”. He shared a screenshot of a Word document which appeared to show a list of committee members, including Mr Stellini and Mr Camilleri, and which was last edited on the morning of May 30 by a ‘Jean Pierre Debono’.\n\nMr Debono however washed his hands of the charges, saying that he had not compiled the list of voting members and that he had told Mr Sammut so before Saturday’s meeting.\n“It should have been him who led the election and ensured the list in his hands was the correct one, up-to-date and in line with the [party] statute,” he wrote on Facebook.\nReprimand in 2017\nIt is the second time that Mr Debono has been embroiled in controversy over his handling of votes within PN structures.\nBack in 2017, he received a reprimand from the party for the way in which he handled proxy votes during the leadership election which Dr Delia won. \nHe had been accused of collecting a member’s voting document through a proxy issued without the voter’s consent. The member said that the signature on the vote was not his. \nMr Debono had denied forging signatures but admitted to having used proxies so that sectional committees could collect voting documents on behalf of members unable to do so themselves. ", "comment_count": 77, "id": 1423}, {"keywords": "", "author": "", "article_body": "Updated at 10.40pm with Jean Pierre Debono reaction\nNationalist Party operative Jean Pierre Debono allowed two people to vote in an election he was contesting despite them not being eligible to do so, the party's outgoing executive committee president has implied. \nMark Anthony Sammut said on Sunday evening that outgoing MP David Stellini and treasurer David Camilleri should both not have been allowed to vote in a Saturday ballot to decide who should replace Mr Stellini in parliament. Mark Anthony Sammut. Photo: Facebook\nThe vote was won by Jean Pierre Debono, who beat Gozitan electoral candidate Kevin Cutajar by just two votes, 42 to 40. \nIn a blistering Facebook post, Mr Sammut said that keeping track of executive committee member and attendance lists was Mr Debono's responsibility as PN political coordinator.  \nMr Camilleri had the right to attend the meeting but not to vote, Mr Sammut wrote.  Only one person could have added him to the voting list, he added. \n\"Their conflict of interest is clear. The vote result is therefore invalid.\"\n\n \n\"It seems that not only did Gozitans have a parliamentary seat stolen from them,\" Mr Sammut wrote, \"but it was stolen through deception\". \n \n'Sammut is the deceptive one' - Debono\nMr Debono hit back with a Facebook post of his own in which he argued that it was Mr Sammut who was responsible for the list of eligible voters during Saturday's executive committee meeting.\n\"He knows he asked me for the list... and I told him I had nothing to do with the list or the election, since I was going to be directly involved in it. Mark Anthony Sammut knows that he did not get the list from me and that I did not compile it\". \n\n \n'Fraud' - Jason Azzopardi\nMP Jason Azzopardi subsequently posted a screenshot of a Microsoft Word document with what appeared to be a list of PN executive committee members, including Mr Stellini and Mr Camilleri. \nThe screenshot showed that the document had last been edited on Thursday May 30 by a 'Jean Pierre Debono'. \nPN MPs had started publicly campaigning for lawyer and Gozitan candidate Kevin Cutajar to be co-opted into parliament on May 29. \n\"This is proof that the list of executive committee voting members was drawn up by Jean Pierre Debono,\" Dr Azzopardi charged. \n \nGozo committee turns on its own party leaders\nMr Sammut posted to Facebook on Sunday evening after reading that the PN's Gozo regional committee had written to the party's leadership asking them to cancel and re-run the vote. \nThe committee's arguments hinged on the fact that Mr Stellini should not have voted, given that he had resigned from parliament last week, and that the Constitution stipulated that MPs replacing outgoing ones should mirror the interests of those they replaced. \nGozitan PN members have said that Mr Stellini should be replaced by another Gozitan MP, while party leader Adrian Delia pushed for Jean Pierre Debono, arguing that the 7th district currently had no PN representative.\nMr Debono was elected on the 7th district in the 2017 general election but gave up his seat to allow Dr Delia, who assumed the party leadership after the election, to enter parliament. \nTumultuous weekend\nThe Facebook post caps a tumultuous weekend for Mr Sammut, who presided over Saturday's executive committee meeting but informed his colleagues that he was quitting the role he had assumed in November 2017. \nMark Anthony Sammut reads a statement after quitting as PN executive committee president on Saturday.\n\"I took the decision after the worst electoral loss in the PN’s history... The rest of the administration should step down,\" he told reporters after the meeting.\n\"Whatever mandate party members gave us is now irrelevant,\" he said. \n\"The reality is that there's a climate of fear inside the party. People are afraid of speaking up because they'll be branded a traitor\". ", "comment_count": 41, "id": 1424}, {"keywords": "", "author": "", "article_body": "Updated at 9.05pm with Mark Anthony Sammut comments\nThe Nationalist Party’s regional committee for Gozo has asked the party leadership to nullify the co-option vote held on Saturday to fill David Stellini’s vacated parliamentary seat.\nIn a letter to PN leader Adrian Delia, the Gozo committee said that Mr Stellini should not have been allowed to take part in the vote and threatened to take legal action against its own party if the vote was not declared null and void.\nThe letter, which was shared with the media on Sunday evening, threw the PN into further chaos and prompted a strong reaction from Mark Anthony Sammut, who quit as PN executive committee president in disgust on Saturday.\n\"It seems that not only did Gozo have a parliamentary seat stolen, but it was stolen through deception,\" he wrote on Facebook, pointing the finger at Jean Pierre Debono as the man responsible for having allowed ineligible voters to have their say in Saturday's vote.  \nSaturday's vote\nMr Stellini had announced his decision to quit parliament last Tuesday, but had nevertheless taken part in the executive committee meeting and cast a vote to nominate his replacement, the committee said in its letter.\nGiven that Mr Stellini’s membership in the executive committee stemmed from his seat in parliament, he should never have been allowed to play a part in the process, the Gozo committee argued.\nThe PN’s executive committee on Saturday voted to have Jean Pierre Debono replaced Mr Stellini in parliament, in a hotly contested meeting which was decided by just two votes, 42 to 40.\nGozitan PN supporters have been angered by the decision, saying Mr Stellini, who was elected on the 13th district, should have been replaced by another Gozitan candidate, Kevin Cutajar.\nGozitan MP Chris Said was among those who went public with his anger following the vote, saying Gozitans were \"right to be disgusted\". \n\nParty leader Adrian Delia has argued that Mr Debono – who gave up a seat in parliament to allow Dr Delia, who did not contest the 2017 election, to become an MP – was more suited to be co-opted as the 7th district had no PN representative.\nConstitutional breach\nThe Gozo committee also hinged its claim to nullify the vote to elect Mr Debono on legal provisions, arguing that Maltese law states that MPs being replaced should have their seats filled, where possible, with members with the “same interests and beliefs as the member whose seat has been vacated”.\n“The committee feels that the executive committee’s decision completely ignores the legal obligations which emerge from the Constiution,” it wrote.\nIn their letter, the committee asked party leader Dr Delia and party general secretary Clyde Puli to ask the party’s administrative committee to declare the Saturday vote null, to investigate why the list of executive committee members had not been updated to exclude Mr Stellini, and to order the vote to be retaken.\nIf this did not happen by 6pm on Sunday, the Gozo regional committee said, it would reserve the right to take legal action as needed.\n'My vote was to secure Gozo's representation' - Stellini\nShortly after news broke of the Gozo regional committee letter, Mr Stellini said that he was still president of the PN's administrative council, until it met and a replacement could be nominated.\n\"I have fulfilled my responsibilities by not commenting publicly about my intentions,\" he said, going on to say that he had flown in from Brussels \"on purpose to ensure that Gozitans' vote is not lost\". \n\"I once again call for Maltese politics to clean itself of envy, so that the PN can come together and plan for Malta and Gozo's future\". \n\n'Seat stolen from Gozitans' - Mark Anthony Sammut\nOutgoing executive committee president Mark Anthony Sammut suggested two people, not one, should have been denied a say in Saturday's vote. \nApart from Mr Stellini, he wrote, treasurer David Camilleri should also have been excluded. \nIt was Jean Pierre Debono's responsibility as political coordinator, he added, to keep track of executive members' data and attendance records. \n\"Only one person\" could have added Mr Camilleri's name to the list of voters, Mr Sammut wrote. \"And their conflict of interest is clear\". \n\nWhat is the PN's Gozo regional committee?\nThe PN's statute grants Gozo special status in that it provides for the creation of a regional committee for the sister island, made up of a president, secretary and five members. \nMembers are elected for two-year terms by a vote open to all Gozitan PN members. One of its members also sits on the PN's administrative council and executive committee. \nThe current Gozo regional committee is led by former Qala mayor Paul Buttigieg.\nThe committee works to ensure the party's principal aims are achieved in Gozo, ensures the party has direct lines of communications with grassroots activists and local stakeholders and oversees the running of party clubs in their areas.\nFurther trouble\nThe regional committee's legal threat adds yet another layer of complexity to the internal strife within the PN. \nParty insiders said Saturday's executive committee meeting was heated and ill-tempered, and shortly after it ended, committee president Mark Anthony Sammut said he would be resigning. \nRead: Seven experts have their say on the PN and its troubles\nLater that day, Dr Delia sought to downplay differences within the party but made it clear he would not be engaging with Jason Azzopardi, a leading MP who has openly criticised his own party's leadership on Facebook. \nOn Sunday, Dr Delia appeared to pin the blame for many of the party's internal problems on what he called the party \"establishment\", saying they felt they had a \"divine right to govern\". \n“I tried to extend the hand of friendship once, twice, three times, but we cannot move on like this,” he said.", "comment_count": 46, "id": 1425}, {"keywords": "", "author": "", "article_body": "A 29-year old man from the Ivory Coast has been handed a six-month prison sentence for attempting to leave Malta with false documents. Basseze Sylla was arrested at the airport on Friday as he tried to travel to Brussels with a false passport and Italian residency permit. He was arraigned on Sunday and pleaded guilty to the charge. The prosecution, led by Inspector Lara Butters, said the court should send a strong message against the use of false documents. The inspector said the practice was becoming more common, with passports being bought “as if from a supermarket”. Despite the defence’s argument that the man had cooperated with police, Magistrate Audrey Demicoli sentenced him to six months in prison. The accused was represented by legal aid lawyer Marc Mifsud Cutajar.", "comment_count": 0, "id": 1426}, {"keywords": "", "author": "", "article_body": "A man accused of raping his wife while the couple were undergoing separation proceedings was denied bail on Sunday. The 38-year old, who cannot be named by court order, was arraigned before magistrate Audrey Demicoli and pleaded not guilty to charges of rape and several unwanted sexual advances in recent months. Requesting bail for the accused, defence lawyer Veronique Dalli told the court the man and his wife were in the process of separating but were still living in the same house and sleeping in the same bed. The two typically slept nude, she said, and the sexual encounter over which the rape had been alleged had begun consensually, but the woman later told police she had not wished to continue and had attempted to push the man off her. The defence said internal and external medical examinations had found no marks of a struggle, and that the woman’s testimony had contained inconsistencies. After the sexual encounter, the woman had gone to sleep next to her husband, the defence said. However, the prosecution, led by Inspector Paula Ciantar, said the woman had not consented to sex with the man at any stage, and that she had said no from the start. The prosecution said the incident was one of several dating back months. The magistrate denied the request for bail and ordered the man to be remanded in custody on the basis that the alleged victim had yet to testify.", "comment_count": 0, "id": 1427}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Nearly 200 parents have been jailed or detained over the last three years for failure to pay their children’s alimony or grant the other parent rightful access to their children, according to statistics.\nFigures just presented to Parliament revealed that while 172 parents were jailed or detained for failing to pay financial support, another 26 ended up behind bars for failing to grant the other parent access to their children following a court order.\nAnother 26 parents ended up behind bars for failing to grant the other parent access\nThe data was given to Parliament by Justice Minister Owen Bonnici in reply to a Parliamentary question by PN MP Claudette Buttigieg. The statistics cover the period January 1, 2016 to May 9 this year. According to the statistics, 105 men were detained and 64 jailed over their failure to pay their estranged partners financial compensation to cover expenses related to their children’s upbringing.\nOn the other hand, two women were detained and one jailed over the same offence.\nFailure to grant their estranged partners access to their children, on the strength of a court order, landed 16 women and 10 men with a detention or a jail term.\nAccording to law, the maximum detention for those partners who fail to pay alimony or grant their estranged partners access to their children is of two months.\nDr Bonnici told Parliament that no people were detained or jailed by the Gozo court over failure to pay for their child’s alimony or give access to their children. The statistics include both Maltese and foreign parents.", "comment_count": 8, "id": 1428}, {"keywords": "", "author": "", "article_body": "A car flipped over and temporarily blocked one lane of traffic close to the northbound Santa Venera tunnel on Sunday afternoon. Photo: Mario Borg\nThankfully, nobody was hurt in the crash on Regional Road and an ambulance was not needed, the police said. The incident was reported shortly after 2pm. \nAuthorities were called to the scene to clear the crash scene and help direct traffic until the vehicle could be moved. \n ", "comment_count": 0, "id": 1429}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nationalist leader Adrian Delia has blamed the PN “establishment” for putting spokes in the wheels and issued a stern warning to his most vociferous internal critics.\n“I tried to extend the hand of friendship once, twice, three times, but we cannot move on like this,” he said.\n“Whoever does not want to help, who wants to stay on the fence can do so, but we have no more time to lose tolerating those who will be pulling in the opposite direction. We have to be open but strong,” Dr Delia remarked.\nThe PN leader was speaking on the party’s radio station on the party’s future following the disastrous defeat suffered in the European and council elections.\nDr Delia said there was no single reason for this outcome. The electorate’s message was clear. The party had not changed enough to be seen as an alternative government, he said.\nThe PN leader attributed the huge vote swings to the fact that politics were less polarised nowadays, and consequently voters were less reluctant to switch sides.\nSwipe at party 'establishment'\nHowever, he took a dig at the party's old guard, which he descried as the “establishment”, saying they still thought “they have a divine right to govern” and to dictate decisions.\n“There are still lot of changes to be made. The result is testament to this. People want to see different faces,” he said.\nRead: Former PN ministers and advisers have their say \n“We have reached a point where people have to decide. Shall we remain stuck on the ideas of those who think they know it all? If we unite we will move forward,” he added.\nAlthough he did not refer to calls, including by former Prime Minister Lawrence Gonzi, to seek a vote of confidence before forging ahead with his leadership of the party, he said that he was not bothered to be under scrutiny, but was resolved to carry out his mission.\n“Those who do not agree, have to decide” he said.\n\nDr Delia said the PN would be analysing the result to identify any opportunities for growth in support, and make efforts not to lose the services of those who in recent months had approached the party to run as candidates.\nCo-option decision\nOn the party's decision to co-opt Jean Pierre Debono for the seat vacated by David Stellini, he noted that the seventh district was not represented by the PN in Parliament. Gozo, on the other hand, already had three MPs.\nWhile refuting claims he tried to influence the executive committee's decision, he stated that some of his predecessors had, in the past, made statements to give a certain direction as to who should be co-opted.\nDr Delia also remarked that many committee members turned up for this meeting, “including some who had barely showed up in the last two years”. The decision went to a vote with Mr Debono edging it by 42 votes to 40.\nThe PN leader said that in the coming days he would be visiting Gozo to lay the minds of PN voters at rest on the matter.\nMetsola to head party's EP delegation\nDr Delia announced that MEP Roberta Metsola, who obtained the highest number of votes from among the PN candidates, would be appointed as the head of the PN delegation in the European Parliament.\nHe added that in the coming months the party would decide what positions to take in Europe on issues relating to Malta.\nThe PN leader said that Labour’s huge victory in the elections did not mean that the government was absolved from the issues flagged in the rule of law report, issued by the Council of Europe. Labour's victory did not change the fact that the Prime Minister has too much powers, he said.", "comment_count": 171, "id": 1430}, {"keywords": "", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat on Sunday hammered home the message that no one individual was bigger than the party and the movement built around it.\nAddressing supporters during a rally in Valletta, Dr Muscat said Labour’s 10 election victories over the past years were all down to the unity that best characterised the movement.\n\n“You can never unite the population if at first you cannot unite your party”, he said.\nSpeculation has continued to grow as to when Dr Muscat will bow out of his leadership role, as the Prime Minister has repeatedly indicated he would not contest the next general election.\nDr Muscat said Sunday that a party and a movement was not united thanks to the work of just one person.\nThis unity came about thanks to a collective effort, he said.\n“The movement is not a single person. We are all part of it. This is the big lessons to be drawn from the past 10 election successes, one bigger than the other”, Dr Muscat said.\nThe Prime Minister’s asked supporters to be vigilant of anyone who was becoming big-headed, and to remind them of the bigger cause.\nBenefits for pensions, workers and students in next budget\nDr Muscat said the government had already shifted its focus to the next budget.\nPensioners would once again receive an increase in pensions and students could look forward to an increase in stipends.\nWorkers would be given back another day of the leave “stolen” from them, the Prime Minister continued.\nDr Muscat said major reforms to rent laws were in the pipeline. These reforms would balance out the rights of landlords and tenants, he said.\nThe Prime Minister also referred to the need for Constitutional reforms and the role the Opposition would play in this.\nDr Muscat said he was “disappointed” the Opposition had not heeded the strong message sent to it by the electorate.\nOpposition has not heeded electorate’s message\nLess than 24 hours after the election result, Opposition MEPs have already packed their bags to continue with the narrative against Malta, he said.\nOn a declaration by Opposition leader Adrian Delia saying he would not be taking any more notice of his MP Jason Azzopardi, the Prime Minister said Dr Delia would have to take notice of him, as the MP was his responsibility.\nSpeaking about the local elections, Dr Muscat vowed that the councils with a Labour majority, amounting to 70% of all councils, would be given space to work instead of being led on centrally.\nHe said the party’s job was to ensure every councillor fulfilled his promises to the electorate.\nDr Muscat also had words of praise for the Labour councillors in the 16 local councils that were under PN control.\n\nEnormous gains had been made in these councils too, Dr Muscat said, citing the example of Attard where the Labour Party gained an additional councillor.\nPL has strong base for the future\nThe Prime Minister said 40% of Labour’s councillors were youngsters. This showed the party had a solid base for the future. He thanked the older generation for their continued service to the party.\nDr Muscat hailed the success of Labour’s Lead programme, from which 33% of the women were elected during the local council elections.\nThe Prime Minister said he was still not satisfied by the amount of women elected and would continue devoting energies to encourage more to participate in public life.\nDr Muscat gave a nod to all candidates with a disability, who he termed as the “unsung heroes”.\nHe extended his congratulations to one of those candidates, Matthew Chetcuti, who was successfully elected to the Rabat council.\nThe Prime Minister said other candidates with a disability who had not been elected had a place in the Labour movement and he wanted to see the mainstreaming of such candidates.\nHe warned Valletta’s new Labour-led council that it had a big responsibility on its shoulders.\nDr Muscat said the scrutiny of this council and the anticipation of Valletta residents would be bigger than ever.\nThe Prime Minister’s said he wanted the Labour party to be the natural choice for Valletta residents in five years’ time.", "comment_count": 28, "id": 1431}, {"keywords": "", "author": "", "article_body": "The annual gathering of Malta’s Ambassadors took place in Valletta on Thursday and Friday with the theme ‘Expanding Our Horizons’.\nIn his opening speech to the ambassadors Foreign Minister Carmelo Abela spoke about the current political situation in the Mediterranean, migration, relations between Europe and Africa, security challenges in the Middle East, Trade Promotion and Malta’s candidature to a non-permanent seat on the United Nations Security Council (UNSC) in 2023-24.\nMr Abela also spoke about the opening of new diplomatic missions: “Through the opening of new embassies, including the first sub-Saharan Embassy, in Accra, Ghana, and the one, in Japan, Tokyo, where the work to open the embassy has been initiated, we are expanding our horizons within the ministry by having also the resources to open elsewhere,” he said with reference to the Consulate General in Morocco.", "comment_count": 9, "id": 1432}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Malta Developers’ Association has been benefitting from a fund aimed at assisting civil society organisations for the past four years, The Sunday Times of Malta can reveal.\nSet up 10 years ago, the Civil Society Fund provides financial assistance that facilitates the groups’ affiliation with similar European groups as well as with training at EU level.\nCivil society organisations are, by definition, usually those that are non-governmental and not-for-profit, made up of people from the social sphere and which work for the good of society.\nIt has now emerged that the MDA, which brings together real estate developers, has been benefitting every year from the fund since 2015.\nContacted by the newspaper, a spokeswoman for Parliamentary Secretariat for Youth, Sport and Voluntary Organisations confirmed that the association has benefitted under the scheme “in 2015, 2016, 2017 and 2018”, adding that there had yet to be a call this year.\n“It was supported for affiliation fees (UEPC), the organisation of conferences or seminars related to EU issues related to their sector, part of a salary of officials working on EU related affairs and the motilities and participation related to UEPC meetings abroad,” the spokeswoman said.\nThe revelation that the developers’ group received funding has irked members of other organisations, who said the MDA’s work benefitted a group of private individuals and not civil society.\nThe MDA’s work benefitted a group of private individuals and not civil society\nThey argued that it was incomprehensible that while certain organisations working to bring about positive change in society struggled with securing funding, others like the MDA succeeded in getting support more easily.\nAsked about these concerns, the parliamentary secretariat spokeswoman said that “as long as an organisation satisfies the requirements of eligibility for such benefits the government is committed to assist”.\nQuestions on whether the government believed the work by the developers’ association benefitted society and if so, in what way, remained unanswered.\nAccording to last year’s guidelines for applicants, published online, the organisations that are eligible to apply for funding include those that are voluntary and self-governing “not subject to direction by public authorities, independent of political control”. It also includes social partners and civil society organisations that have “official recognition under some specific law”.\nOrganisations that are established “for the specific purpose of meeting needs in the general interest” are also eligible, the guidelines state.\nEach organisation receives a maximum of €6,000, with the government publishing a list of the amounts approved on the Malta Council for the Voluntary Sector website.\nAccording to the latest data available, which covers the amounts supplied in 2017, there were 61 organisations that benefitted from the scheme, yet despite the government spokeswoman confirming the MDA received funding that year, the body was not on this list.\nWhen Times of Malta asked for a breakdown of the amounts supplied to the developers, no reply was received.\nA civil society organisation is defined as “a group of people which operates in the community, in a way that is distinct from both government and business”.", "comment_count": 41, "id": 1433}, {"keywords": "", "author": "", "article_body": "A 65-year-old cyclist was grievously injured on Sunday in a collision with a car in Gudja.\nThe police said the accident happened in Triq l-Avjazzjoni at 6.05am.\nThe cyclist, who lives in Marsascala, was hit by a Ford Transit that was being driven by a 51-year-old man from Attard.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1434}, {"keywords": "", "author": "", "article_body": "Labour celebrates\nLabour Party officials and counting agents celebrate their massive victory in the European Parliament elections last Sunday.\nWhat made the headlines\nLabour’s decisive victory: The Labour Party won a resounding victory in the European Parliament election, gaining 54 per cent of the vote compared to 38 per cent for the Nationalist Party. The distance between the two parties was of 42,656 votes. The result was the worst one for the PN since 1951. The small parties as well as independent candidates failed to make any headway. Labour won four seats, a gain of one, and the Nationalist Party won two seats, a loss of one. Labour’s elected candidates were Miriam Dalli, Alfred Sant and newcomers Alex Agius Saliba and Josianne Cutaja, while the PN saw the re-election of Roberta Metsola and David Casa. At the last European election in 2014 Labour got 53 per cent of the vote and the PN got 40 per cent, while at the 2017 general election Labour got 55 per cent and the PN got 43.68 per cent. There was more bad news for the PN when the local council results were announced: Labour won by 47,000 votes and captured Valletta, St Paul’s Bay, San Ġwann, Mosta and Siġġiewi from the PN. Labour got almost 58 per cent of the local council vote compared to almost 40 per cent for the PN.\nDelia defiant: Nationalist Party leader Adrian Delia insisted he would not step down after the party’s poor electoral result despite calls for his resignation from within PN circles. However the Times of Malta reported that Dr Delia could face a vote of confidence and that efforts were under way to collect enough signatures for an extraordinary session of the PN general council. According to the party statute, the council can be convened if there is a written request by at least 150 members. Meanwhile former prime minister Lawrence Gonzi told the Times of Malta that Dr Delia should put his leadership to the test and prove himself to be worthy of his post.\nFayez al-Sarraj.\nLibyan PM holds talks with Muscat: Libyan Prime Minister Fayez al-Sarraj held talks with Prime Minister Joseph Muscat over the precarious situation in his country. Speaking during a meeting at Auberge de Castille in Valletta, Mr Sarraj told Dr Muscat he wanted to clarify the situation in his country to his Maltese counterpart, the negative impact it was having on the country’s image, and the negative repercussions on the Libyan people. Dr Muscat said the fighting in Libya was of “deep concern” to Malta.\nNew law allows cremation: Cremation services can now be offered in Malta after the relevent law came into force on Tuesday. The new law will not only introduce a burial alternative but also allow people the flexibility to decide what to do with the ashes. Each crematorium will have a mortuary, a viewing room, adequate facilities for the extraction of implants from the body, a cremation room and a storage room for remains.\nBid to water down report by Council of Europe fails: An attempt by the government to whitewash a scathing report about the rule of law and the investigation into Daphne Caruana Galizia’s assassination was rejected by a Council of Europe committee. The Times of Malta reported that Labour MP Manuel Mallia presented more than 40 amendments seeking to delete critical passages about the government and watering down references to the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi. The draft report, approved in committee on Wednesday, sticks to the conclusion that the rule of law in Malta is seriously undermined by the extreme weakness of its system of checks and balances and the fact that top officials, like Mr Schembri, enjoy impunity under Prime Minister Joseph Muscat’s personal protection.\nBOV could lose dollar transactions provider: Bank of Valletta is preparing for the possible pull-out of ING, its sole remaining provider of correspondent banking services in US dollars, an official confirmed. ING, a Dutch bank, was fined €775 million in September after admitting that criminals had been able to launder money through its accounts. Ever since, it has been on a de-risking exercise and correspondent banking relationships with small jurisdictions seen as high risk are being severed.\nStudies on Sliema to Valletta footpath: A UK-based architectural firm has been commissioned to carry out a feasibility study into a pedestrian and cyclist bridge between Tigné Point, in Sliema and the gun post area in Valletta. Tourism Minister Konrad Mizzi said a preliminary agreement had been signed with the firm, led by architect Konrad Xuereb. He told the Times of Malta the agreement covered designs, an estimation of the costs and the technical feasibility as well as whether there would be any EU funding available to tap into.\nWhat trended\nMuscat’s EU aspirations\nThe story about Prime Minister Joseph Muscat’s EU hopes being ‘dented’ as horse-trading began for the bloc’s top jobs led to quite a reaction online.\n“Unbelievable! How can we expect Joseph Muscat to be on the radar with the Venice Commission and Greco reports? You can win as many elections as you want but justice can never be bought Dr Muscat!” said Frank.\nTo which Mario replied:  “The Venice Commission report was not a condemnation of the current government but of the judiciary system which was never updated in 25 years of Nationalist governments. Ironically the biggest changes have been happening under Labour governments since 2013, so your statement makes no sense.”\nErnest just couldn’t comprehend the EU toying with the idea of giving Joseph Muscat a post.\n“Why would any serious institution even consider giving Muscat such a position?” he asked.\nCarmen had a warning for Brussels: “They had better watch out. He may be capable of forming a clique of crooks there too. Anything he touches is tainted with corruption.”\nAndrew added: “Surely Muscat’s job prospects are even more dented by the assorted references to crime and corruption that crop up around people close to him? Why is no one mentioning this ginormous elephant in the room?”\nRamon summed it up this way: “Of course, Muscat can kiss his EU career aspirations goodbye. The EU only considers statesmen of the utmost integrity for such top posts.”\nChange at last?\nThe election of an independent candidate to the Żebbuġ council, Steve Zammit Lupi, who got nearly 1,000 first count votes, was met with a positive reaction online.\n“At last some change,” Carol said.\n“Good luck to Steve Zammit Lupi. Now give this man his chance as an independent councillor to establish his pledged autonomy,” said P.\nNoel was quick to offer a suggestion to Mr Zammit Lupi: “Bring back the bicycle lane on the stretch of road Żebbuġ-Rabat/Attard which was removed and replaced by a ‘shared’ lane but which has only served to create new dangers to cyclists and motorists alike.”\nTo which Vince replied: “He’s not even in office yet and you’re asking for ‘favours’ already.”\nNoel wasn’t amused: “I am not asking for any favours. I am asking for a number of rights and nothing to me personally.” Looks like Żebbuġ’s new councillor is in for an interesting time.\nM had advice for Mr Zammit Lupi: “Do not let the political parties intimidate you. The problem with local councils is that both major political parties ruined them with partisan politics.”\nWhat they said\n\n“This guy is not going to resign of his own accord. At this point in time, people who love the party have to force him out. The longer you delay, the bigger the loss of votes will be.”\nFormer PN candidate David Thake calling for PN leader Adrian Delia to be ousted.\n“We are ready to work with you, you should be ready to work with us.”\nPrime Minister Joseph Muscat sending a message to Nationalist MEPs while addressing jubilant Labour supporters after the party’s impressive victory in the European elections.\n“We need to understand why the people have yet to trust us to lead and we have to also understand why a good number of people decided not to vote.\"\nNationalist Party leader Adrian Delia conceding defeat in the European elections while visiting the counting hall in Naxxar.\n“I worry that the Labour Party’s arrogance will now grow.”\nIndependent candidate Arnold Cassola reacting to the Labour Party’s large majority in the European elections.\n\n“When we worked together, we managed to narrow the gap predicted by the surveys and if this continues we can achieve more results in two years’ time.”\nPN secretary general Clyde Puli downplaying the largest electoral defeat for the Nationalist Party since 1951, causing an uproar among many PN supporters.\n“The response was beyond my expectations.”\nNewly-elected independent Żebbuġ councillor Steve Zammit Lupi, an environmentalist, admitting to being “overwhelmed” by the popular support he received, which enabled him to obtain more than a quota in first-count votes.", "comment_count": 0, "id": 1435}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Most of those admitted to Mount Carmel Hospital against their will after attempting suicide or expressing suicidal thoughts suffer from potentially treatable mood and anxiety disorders, according to new research.\nMental Health Commissioner John Cachia, who carried out the research, is calling on other professionals to break the silence on suicide and possibly narrow the risks by looking at the pattern of admissions. \n“Half of the people who had attempted or expressed suicidal intention were diagnosed with mood disorders like depression or bipolar disorder,” Dr Cachia told The Sunday Times of Malta. “Another 22% suffered from severe anxiety or stress related disorder. \n“These are all potentially treatable conditions if people seek support early enough.”\nRead: Men committed 20 of 25 suicides in 2017\nDr Cachia will be one of the speakers at this month’s Malta Association of Psychiatry’s annual conference that will focus on suicide and self-harm behaviours.\nData shows that two people die by suicide every month. However, only a quarter of them would have come in contact with health services.\nNine in every 10 suicides are by men: they numbered 194 of the 223 suicide victims recorded between 2010 and 2018.\nWhile such data has been publicly available for some years, Dr Cachia has looked beyond the figures, especially at the ages most at risk.\nOver the past five years, two thirds of the men who died by suicide were aged between 30 and 59. A fifth of female victims were aged between 14 and 17.\nSo while suicide is dominated by males, it is not a men-only issue – Dr Cachia insists society needs to focus on young women as well.\nHis research took him one step further. Dr Cachia’s office monitors people who are admitted to psychiatric hospitals against their will. These make up a quarter of the total admissions, 400 patients in all.\nRead: The link between childhood trauma, a faulty stress response and suicide risk\nAnd among them are the people who are most at risk. Some 15% of involuntary admissions had either attempted suicide (53%), self-harmed (165) or had a suicidal intent (35%).\nBy looking into cases of people who come in contact with health services after expressing suicidal thoughts or making failed suicidal attempts, Dr Cachia hopes to identify risks and ways to mitigate them.\nWhen it comes to involuntary admissions for self-harm or suicidal intent, the ratio between men and women is no longer nine men to one woman, as in completed suicides. It shifts to seven men to three women.\nHowever, the number of girls aged 17 and under is still double that of men, exposing a higher risk among women at this vulnerable age.\nThere is no gender difference between the ages of 18 and 29 but the risk among men increases after the age of 30.\n“This means that while men are more at risk of completed suicide, when it comes to people who are referred or admitted for care, the scenario is completely different.\n“The figures tally with general psychiatry data: we normally see four women for every six men with acute psychiatric problems. Therefore, we need to understand better what triggers a situation that sees many more men dying by suicide.”\nDr Cachia called on fellow stakeholders to break the silence on suicide and suicidal thoughts, particularly when it comes to mood, anxiety and stress-related disorders.\nHe recommended looking at suicidal intent and attempts across all inpatient acute psychiatric admissions, which would include voluntary admissions for psychiatric care in Mater Dei Hospital, Mount Carmel Hospital and the Gozo Hospital.\nPatterns discovered from such data could help set off alarm bells for any professional who comes in contact with distressed people, possibly even narrowing down risks by gender and age, he added.\nThe MAP conference will be held on June 13 and 14. Its ultimate aim is to empower professionals from all walks of life to “promote a life worth living”. Log on to www.map.org.mt for more information.\nTragic figures\n■ Two people die by suicide every month.■ Nine in 10 suicides are by men.■ A fifth of female suicide victims are aged between 14 and 17.■ The risk of suicide among men increases after the age of 30.", "comment_count": 10, "id": 1436}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta says a defiant Adrian Delia on Saturday dismissed calls to resign saying he would shoulder political responsibility by leading the PN into the next general election. The newspaper also speaks to former PN general secretary Louis Galea who says the Nationalist Party needed to go “back to the drawing board for a refounding of the party”.\nMaltaToday says that unchallenged by MPs, PN leader Adrian Delia lives to fight another day.\nThe Malta Independent on Sunday says the Labour Party swept their opponents aside after obtaining 47 local councils out of 68, along with a huge margin of 47,100 votes, some 5,000 more than in the MEP elections.\nIt-Torċa says the vote difference between the two main parties would have been of around 60,000 had the councils’ election been a general one.\nIllum says that former PN leader Simon Busuttil had been going to resign in 2014.\nIl-Mument says the PN’s executive committee has chosen Jean Pierre Debono to be coopted to the seat vacated by David Stellini.\nKullħadd says Nationalist MP Chris Said is planning to lead a group of Nationalist MPs in Parliament.", "comment_count": 1, "id": 1437}, {"keywords": "", "author": "Anthony Manduca", "article_body": "Anthony Manduca asked a number of former PN ministers, advisers and experts what they see as the immediate way forward for the Nationalist Party after the latest electoral drubbing.\n\n‘Rethink, refound, rebuild and relaunch’\nLouis GaleaFormer PN minister and general secretary\n“There is no ‘immediate’ way forward. We cannot respond to the PN’s latest electoral defeat with the illusion that there is ‘quick fix’, something ‘out there’ that can instantly provide a solution. As I see it, the way forward for the PN consists of a ‘4 R’s’ process – rethink, refound, rebuild and relaunch. \nWe are facing a complex society. We cannot exist only for the moment, unmindful of the past and uncaring of the future. There is the need for a political process, an integrated approach, to regain some balance, first to construct the necessary unity around a cohesive vision and strategy. I agree that a report analysing the defeat will not get us far. We need a much bigger conversation.\nWe need calm, patience, for a slow rebuilding process. Real change happens bit by bit. One cannot force one’s seed of potential to grow until it is ripe and ready. I heard it said that ‘in the soil of the quick fix, is the seed of a new problem.’ We need to create an atmosphere of trust. \nWay forward? Back to the drawing board for a re-founding of the party. Easy? No. Is there the will for it? We’ll find out. \nThis would be the best birthday present we can give the party on its 140th anniversary next year. This is what we also owe our beloved country and people.”\n\n‘The eventual solutions are not going to come from the past’\nRichard Cachia CaruanaFormer Ambassador to the EU and adviser to Eddie Fenech Adami and Lawrence Gonzi\n“Whether we like it or not, a political party exists to win elections. It can have the best policies in the world but if it cannot win an election to put those policies into effect then it has failed. When the gap in votes is very great it is also clear that the problem is not only organisational but that there are personality and policy issues too.\nThe Labour Party has just won two large electoral victories – that for members of the European Parliament with a 16% advantage over the Nationalist Party and that for local councillors with an 18% advantage. Labour is quite rightly celebrating but its leaders will be admitting privately that the size of the victories was also due to what the PN voter base decided to do last week. A sizable minority reached the conclusion that it was more important to send a message to the PN leader, secretary general, executive committee and general council than to fully challenge Labour.\nAnd their message was simple, they do not believe that today’s Nationalist Party can win a general election. To long-serving supporters like me, this is a very bitter pill to have to swallow but swallow it we must. We can only be grateful that the PN voter base respects the Nationalist Party enough to tell it to get its house in order rather than just writing it off once and for all at the next general election.\nThe party must now show that it has heard the message, understood it and is totally committed to change whatever needs to be changed, starting immediately. There can be no ‘business as usual’. There can be no delays. There can be no sacred cows. Furthermore, the eventual solutions are not going to come from the past but from the future and anyone who wishes to move the clock back, either in terms of personalities or policies, has to understand that they are part of the problem.”\n\n‘The PN must redefine some of its basic policies’\nJoe FriggieriProfessor of Philosophy, University of Malta, former PN MEP candidate\n“Following its crushing defeat at the polls, the Nationalist Party must redefine some of its basic policies in order to make itself re-electable. And it must do this whether or not it decides to change its leader. Let me mention a number of areas where I think such rethinking is necessary.\nIn a climate of economic prosperity and negligible unemployment, the PN must show that whatever changes to the government’s economic model it intends to introduce will produce roughly the same rate of economic growth while ensuring a fairer and more equitable distribution of wealth. Above all, it will need to convince the large swathes of Labour voters in Labour strongholds, especially those in the lower income bracket that they will do better if such changes are implemented.\nWhere the environment is concerned, the PN must admit that decisions made in the past by some of its representatives have contributed in no small way to the production of the present state of environmental degradation. It will also need to spell out in no uncertain terms how it intends to stop the rot.\nOne of the main causes of air pollution and respiratory diseases is the huge volume of traffic clogging our roads and emitting poisonous fumes. There will have to be a sea-change in people’s ideas if public transport is ever to replace the private car. Here again, the PN needs to put forward concrete proposals for dealing with the problem – something it hasn’t done so far with any degree of success.\nThe PN must also make its position clear regarding immigration. Too many conflicting ideas were bandied about during the party’s campaign, and an opportunity was lost to combat racism and promote ways of integrating migrants into the community. This is another issue over which the PN must carry out some radical rethinking in order for its elected representatives to be able to put forward innovative suggestions in European forums whenever the need arises.\nIn a society that has witnessed such a radical transformation from traditional patterns of behaviour to more cosmopolitan life-styles, the PN needs to revamp its means of communication in order to project a more vibrant image of itself to all sectors of the population, especially the young.”\n\n‘Conservative, liberal and green forces should group together’\nJoe BorgFormer PN minister and European Commissioner\n“The latest election result is not so much a Labour victory as it is a PN defeat. The single most determining factor is the large number of voters who did not cast their vote and who are assumed to be largely PN sympathisers, especially since they hail mainly from areas that have traditionally voted for the PN.\nI firmly believe that the party should immediately carry out a deep analysis of the causes behind such an electoral defeat and set a short deadline by when such an analysis should be finalised and made public. I also believe that the party leader should himself pledge to seek a vote of confidence from the highest organ within the party, the General Council, immediately after the results of the analysis are out.\nThe whole process needs to be over and done with by the end of this year if there is to be a decent chance for the party and its leader, whether it is Dr Delia or someone new, to achieve an electoral success in 2022.\nI also believe that serious consideration should be given to the formation of alliances that group together conservative, liberal and green forces under one overarching structure. In this way the prospects for an alternative governing majority become much more real.”\nThese are excerpts from Joe Borg’s article.\n\n‘The party is coming across as a collection of amateurish prima donnas’\nMichael FalzonFormer PN minister\n“First of all, the factions within the PN should tread carefully and avoid knee jerk reactions at all costs. Alas, for some this advice is already too late!\nSecondly everybody in the PN should swallow their pride and forget their pet hates and concentrate on the job of behaving like a responsible party in Opposition – rather than bickering about whatever they disagree about within the PN itself. The party is coming across as a collection of amateurish prima donnas trying to outdo each other by loudly repeating the same ineffective mantras. This nonsense has to stop.\nThe PN is facing a dilemma: removing Adrian Delia will only serve to increase the anger of the grassroots that elected him PN leader while keeping him is seen as an ‘affront’ of those who fought tooth and nail against his bid – and lost.\nThe solution does not lie in changing the leader but in everybody coming to their senses and realise why the PN is losing ground – not to the Labour Party this time but because many PN supporters did not bother to vote.\nThe PN election campaign was amateurish and did not transmit a clear message as to why people should choose to vote for PN candidates. But now the PN should look forward rather than waste time on recriminations.\nThe PN should start thinking of preparing for an intelligent electoral campaign in three years’ time and for this it certainly needs expert advice. They have to start working on this now, in spite of the fact that in the last 15 years the party’s finances went from bad to worse to shambolic.”\n\n‘Adrian Delia should resign’\nLaurence GrechFormer editor, The Sunday Times of Malta\n“Despite his best efforts, Nationalist Party leader Adrian Delia has failed to stem his party’s 10-year decline. In last week’s European Parliament elections, the party declined further, to reach a nadir not seen since 1951.\nThe local election results, of which the loss of Valletta was the most symbolic, rubbed more salt into the PN’s wounds.\nDelia not only failed to convince thousands of Nationalist-leaning voters, who preferred to stay at home, but also failed to make any inroads among Labour sympathisers and newly enfranchised young voters. I am sure, too, that a few PN sympathisers this time gave their first preference to third parties.\nPN secretary-general Clyde Puli’s attempts to seek some consolation from the fact that the worst forecasts (a 72,000-vote gap between the two major parties) failed to materialise, since the gap was of ‘only’ 42,600, and Delia’s assertion that the PN is still the second largest party (ahead of Tal-Ajkla?) were pathetic, to say the least, and an insult to PN voters’ intelligence.\nDelia and his supporters correctly argue that he was chosen to lead the PN democratically. Yet the fact remains that, for various reasons, he has not managed to unite the party behind him. Although he insists that his leadership can only really be tested at the next general election, the EP and local councils’ results point to only two alternatives for the PN leader.\nAs has been suggested elsewhere, Delia should resign and the party leadership temporarily entrusted to a veteran, widely respected PN figure until such time as a new leader is elected or, at the very least, Delia should ask for a vote of confidence from the party structures and resign if he does not obtain it convincingly.\nUnless he takes one of these two options, Delia – and the party he leads – is bound to take a bigger battering come 2022.”\n\n‘The PN needs to determine what it stands for’\nLawrence ZammitChairman of Misco consulting firm\n“The Nationalist Party needs to stop being angry at the way people vote. The Nationalist Party does not have a right to government; but it has a duty to be a meaningful Opposition and a credible alternative government. Unless it does this, it cannot evaluate objectively the reasons for the result it obtained at the elections for the European Parliament.\nSeeking to depict the results of these elections as ‘not as bad as we thought they would be’ will only do a disservice to the party members and Malta.\nThe Nationalist Party also needs to determine what it stands for. Unless the PN sets out clearly its vision for the country, it will not be possible for it to engage with the electorate. To set out its vision, it needs to establish what its own aspirations are and then engage with Maltese society. The opinion poll published by The Sunday Times of Malta last April indicated clearly that this engagement with the electorate was not present.”\nFormer PN general secretary Joe Saliba was also asked for his opinion on the way forward for the Nationalist Party, but while thanking the newspaper for seeking his views replied: “I prefer to provide my thoughts on the way forward to the party directly, rather than via the media.”", "comment_count": 160, "id": 1438}, {"keywords": "", "author": "", "article_body": "Two passengers were on Saturday found carrying more than €21,000 in undeclared cash.\nCustoms said the money was found during cash control checks by Customs officials from the anti-money laundering team and the enforcement section.\nBoth passengers were Ivorian nationals and were departing Malta to Istanbul. Searches on one passenger resulted in the discovery of €11,760, the other was found to be carrying €10,000 in his trousers.\nThe former agreed to forfeit his cash in excess of €10,000 and the latter was fined €200 in line with legislation\nThese are the third and fourth positive cases of undeclared cash seizures by customs, bringing this week's tally to over €160,000.\nMore than €127,500 were discovered by customs officials on Thursday during a routine cash control exercise.\n ", "comment_count": 6, "id": 1439}, {"keywords": "Education", "author": "", "article_body": "A 28-hour course on pharmacognosy and herbal products will be held in July by Malta University Consulting Ltd.\nThis course is mainly aimed at qualified personnel who work in the pharmaceutical industry, such as staff with a BSc in chemistry or biology, professionals with a degree in pharmacy-related subjects and postgraduate students reading for master’s degree in pathology or pharmacology.\nParticipants will learn how pharmacognosy has evolved throughout the ages and has developed into a way of life for some patients and consumers.\nThe course coordinator and tutor is Prof. Everaldo Attard, the Maltese delegate on the Committee on Herbal Products at the European Medicines Agency. He also a member of the Homeopathic Medical Products Working Group of the Heads of Medicines Agencies of the European Union.\nThe course is approved by the National Commission for Further and Higher Education as equivalent to Level 6 (5 ECTS) and has been approved by Malta Enterprise under the Get Qualified Scheme.\nThe lectures will take place at the University Residence, Robert Mifsud Bonnici Street, Lija.\nFor further information call Maria Bugeja on 2124 0746 or 9982 9244 or e-mail maria.bugeja@muhc.com.mt or visit the website below.\nmuhc.com.mt/updates/pharmacognosy-and-herbal-products/", "comment_count": 0, "id": 1440}, {"keywords": "Education", "author": "", "article_body": "Following a recent study tour in Tampere, Finland, by members of Gozo College’s senior management team, all schools within the college are adopting practices from the excellent Finnish education system in their classrooms.\nFinland’s education system has been made famous as a result of its performances in the Programme for International Student Assessment (PISA). The study tour focus­ed on certain aspects of the system, namely, leading development work at schools; cooperation and leading educational support; good governance and administration; and the school of the future.\nThrough a series of lectures and visits to pre-primary, primary, secondary and post-secondary schools and educational institutions, the study tour participants, led by Gozo College principal Dr Denise Mifsud, gained an insight into how the Finnish education system works.\nWhat immediately struck the participants was that the system is based on competent teachers and outstanding teachers’ kits, rather than fierce competition. Finland embraces a student-centred approach where the student always comes first and is empowered to be independent from pre-school age. The school system is characterised by formative assessment, with a focus on hands-on teaching and learning.\nFinnish schools respect and support children and young people in the best possible way and all school staff are highly committed, regarding work as a national duty. The Finnish educational policy promotes harmony and excellent cooperation between schools, educational authorities and administrators.\nThe study tour was supported by the local European Union Programmes Agency with funds from the Erasmusplus programme and organised by Learning Scoop Finland in co-operation with the University of Tampere, Finland.", "comment_count": 0, "id": 1441}, {"keywords": "Education", "author": "", "article_body": "The Media and Knowledge Sciences Faculty of the University of Malta recently held the first edition of its Dean’s Award. The award recognised students of the faculty for their hard work and outstanding academic success during the 2017-18 academic year.\nAwards were presented to Lisa Marie Kähler, Michela Cutajar and Daniel Zammit for their academic performance in the first, second and third years respectively of the bachelor programmes.\nRebekah Mifsud received an award for her achievement in the taught component of a master programme, while Mikela Zerafa and Antida Mizzi won awards, their  outstanding dissertations presented as part of a bachelor programme and a taught master programme respectively.\nThe award trophy presented to the winners was designed by Dr Matthew Galea from the Department of Digital Arts.\nThe event was addressed by the faculty dean Prof. Noellie Brockdorff in the presence of University pro-rector Prof. Joseph Cacciottolo and registrar Veronica Grech and members of the faculty.\nAnimation and video production work by students of the Faculty’s Department of Digital Arts and the Department of Media and Communications were also shown during the event, which was supported by Farsons Direct.", "comment_count": 0, "id": 1442}, {"keywords": "Education", "author": "", "article_body": "Malta recently hosted delegates and speakers at the first International Vocational Education and Training Association (IVETA) Europe regional conference, held by Warnborough College and Mater Boni Consilii St Joseph School, Paola.\nThe conference was opened by Education Minister Evarist Bartolo, who spoke about the importance of a holistic education for sustainable development and an inclusive society. Mater Boni Consilii St Joseph school principal Kenneth Vella gave a history of vocational education in Malta. IVETA executive director Brenden Tempest-Mogg spoke about the association’s aims and activities. IVETA European vice president Dr Julian Ng spoke on the conference theme ‘Revaluing TVET’.\nThree speakers from the University of Malta provided an insight into the local TVET experience, while Mcast principal Prof. Joachim James Calleja said schools and industries should work more closely together.\nNCFHE CEO Rose Anne Cuschieri spoke about the Malta Qualifications Framework and the importance of accreditation.\nFrank Fabri, permanent secretary at the Education Ministry, spoke on the My Journey initiative. He claimed Malta was the only EU country whose education ministry formulates syllabi and curricula together with teachers.\nDelegates also visited Maria Regina College in Mosta to see how the My Journey initiative will be implemented.", "comment_count": 0, "id": 1443}, {"keywords": "Education", "author": "", "article_body": "A 10-session programme aimed at helping students in Form 1 and 2 choose the subjects that may determine their future professional career path will start on July 12.\nThe programme, entitled ‘My Future – Learning About My Prospects’ is organised by the Malta Institute of Management (MIM) in collaboration with Mater Boni Consilii St Joseph School, Paola. It aims to give students an oversight of various industries in order to provide them with the necessary knowledge to take the right decision for their future.\nDuring the programme, the students will be visiting various places of work in the hotel and banking sectors, the veterinary, audit and accountancy professions, the media, transport, logistics and hospital sectors, as well as the manufacturing, IT and new technology and pharmaceutical industries.\nHere, technical experts in the respective sectors will give them a practical view of what happens within their organisations. The participants will see the different operations within these sectors in order to understand the various roles and the skills required. Through the presentations the students will be able to understand the challenges and opportunities people face in the different roles and sectors and how their choice will impact their future.\nParents and guardians interested in booking a place for their child are to call Rita Micallef on 7909 3467 or e-mail rmicallef@easl.com.mt.\nThe participation fee is €105 per student, or €155 including transport. Places are limited and will be allocated on a first-come, first-served basis.", "comment_count": 0, "id": 1444}, {"keywords": "Gozo", "author": "", "article_body": "The Mikiel Anton Vassalli College and the Belgian Academy Eekhout are offering two intensive residential training programmes on an annual basis for teachers and educational leaders in Gozo.\nThis cooperation between the two entities started three years ago when Eekhout Academy started to offer an intensive week-long course in improving the overall educational quality of schools with a focus on ‘Educating for the Future’.\n“As from this year, we started to offer another intensive week training programme also in Gozo, this time about the necessary thinking processes for learning specifically Meta-Learning and Thinking Skills,” said Mikiel Anton Vassalli College principal Victor Galea. Course director Peter Van de Moortel said: “The basic line of the course is ‘The Quality of Our Future Depends on the Quality of Our Thinking’”.\nMikiel Anton Vassalli College Malta School of Music teachers Adriana Yordanova, Yuri  Chary-guine, Godrey Mifsud and Irina Fedcenko Carbonaro joined 20 participants coming from Germany, Latvia, Italy, Belgium and France. These residential training initiatives form part of the Erasmusplus EU Programme for education and training.", "comment_count": 0, "id": 1445}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo Tourism Association organised a half day seminar, entitled ‘Gozo what’s next...? Trends and Innovations in the Tourism Sector’, as part of the association’s 20th anniversary. The event, held at Vini & Capricci in Xewkija, was organised in collaboration with Booking.com and the Malta Tourism Authority.\nStefania Ditrani addressing the seminar.\nA very interesting presentation, entitled ‘Why to introduce influencer marketing in a digital marketing campaign’, was given by Chief Officer Strategic Development and Malta Tourism Authority deputy CEO Leslie Vella, followed by presentations by booking.com representatives Roberta Di Maria, Alessandra Blank,  Stefania Ditrani and  Marco Giardina and a question and answer session. \nThe seminar was introduced by Gozo Tourism Association chairman Paul Scicluna. ", "comment_count": 0, "id": 1446}, {"keywords": "Gozo", "author": "", "article_body": "May’s number offers the usual incredibly extensive mix of reports on diocesan, cultural and social topics and events. It covers, among others, the sporting exploits of medal winners in the Special Olympics and of Maria Farrugia, who has joined Sunderland AFC to continue her footballing career in the UK.\n\nThe disussion on the inter-island connectivity is sustained in the editorial and the main article. Another focuses on the EU’s Country Report and its official figures that attest to the shocking disparity of economic prosperity between the sister islands. There are biographies, book reviews, poetry, photography, obituaries and commemorations.\nShort pieces describe the legendary herbalist and Marian devotee Franġisk Mercieca, aka Frenċ tal-Għarb; how the Ta’ Pinu chapel was saved from ruin in the 19th century; and the precarious condition of l-Għajn ta’ Sarraflu in Ta’ Kerċem.", "comment_count": 0, "id": 1447}, {"keywords": "Gozo", "author": "", "article_body": "Justine Borg, a University third year student from Sannat, held a weekend multimedia exhibition, ‘Masculinities’, at Il-Ħaġar Museum in Victoria as part of her Digital Arts degree dissertation. Ms Borg highlighted diverse interpretations through environmental portraits and sound.", "comment_count": 0, "id": 1448}, {"keywords": "Gozo", "author": "", "article_body": "• The feast of St Anthony of Padua will be celebrated today at St Anthony’s Church, Għajnsielem. Gozo Bishop Mario Grech will lead Pontifical Mass at 9am. A procession led by Provincial General Fr Richard Grech will leave the church at 7.30pm, accompanied by St Joseph Band of Għajnsielem. The Mnarja Band of Nadur will also take part. At 10.30pm the procession will end with the antiphon and sacramental blessing. The celebration will be transmitted live on Radju Lauretana (89.3 FM) and on www.radjulauretana.com.\n• A charity bazaar in aid of The Friends of the Sick and Elderly is being held at St Francis Square, Victoria (opposite the church), until Saturday between 8.30am and 11.30am and from 4 to 6.30pm.\n• The Arka Foundation Gozo fundraising car boot, will take place at the main parking area in Marsalforn, today from 7am. No booking is required. A €10 donation per car space will be payable on the day.\n• A blood donation session will be held at the new District Health Centre in Triq tal-Ħamrija, near the Xewkija Primary School, on Tuesday from 1pm to 5pm.\n• The second edition of the Honey and Bee Fest is taking place at the Villa Rundle Gardens in Victoria on Saturday between 10am and 6pm.• Bis-Saħħa – a festival of wine, food and live music – organised by Ta’ Klula Foundation, will take place at Santa Luċija’s main square on Saturday from 8pm. Admission is free. For more information call 7955 9518.\n• The Don Bosco Summer Club for children aged four to 13 will be held in July and August. For applications visit http://donboscogozo.org.\n• The Minor Seminary Gozo is offering courses for ECDL Standard, ECDL Advanced, Robotics and touch typing. For more information call 9925 5304, visit facebook.com/shmsg or e-mail: ecdl@gozoseminary.com.\n• Home-Start (Għawdex) is looking for more ‘Family Support Volunteers’ to give a few hours of their time each week in Gozo to help families who would like support. For further information send an e-mail to gozohomestart@gmail.com .\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1449}, {"keywords": "Education", "author": "", "article_body": "Members of staff at De La Salle Sixth Form recently underwent professional development by attending courses in various European cities as part of an EU-funded project aimed at developing practices and skills required to meet the diverse needs of today’s learners. The project was also aimed at developing teaching systems that enhance learners’ qualities and skills such as flexibility of mind, ability to work in teams and communication.\nThe staff members undertook training in communication skills, using ICT in the classroom, teaching students how to be leaders and innovators in the classroom, entrepreneurship, the flipped classroom, EU educational projects, leadership, peer coaching and quality assurance.\nThe courses were highly beneficial to the staff members not only because of the knowledge they gained during the sessions but also by enabling them to share experiences and discuss issues with their European counterparts.\nOn their return from the courses, staff development sessions were organised internally within the Sixth Form whereby the participants delivered presentations, and workshops were organised on the material covered during the courses.\nDe La Salle Sixth Form believes in providing an education that is not simply based on training students to pass exams but that it should prepare students for a path that leads to further education and encourages them become independent adults and lifelong learners. It also considers it vital to have teaching systems in place that enhance learners’ qualities and skills such as flexibility of mind, ability to work in teams and proper communication.\nSo the school administration and staff felt it was necessary to expose its leaders and educators to ways that would help the school devise an effective programme of studies that was not restricted to academic aspects but also led to the development of 21st century competences and develop practices. These included skills such as collaboration, proper communication, critical thinking, creativity, citizenship and the overall development of each individual as a whole in the world we live in today.\nThe project, entitled ‘Training Educators to provide Students with 21st century Skills within a European and Ever-Changing Context’, was funded under the Erasmusplus KA1 programme.", "comment_count": 0, "id": 1450}, {"keywords": "Education", "author": "", "article_body": "Architect Claude Busuttil was recently awarded a European label for his PhD in Human Sciences on ‘The influence of French military engineers on Maltese architecture during the reign of Louis XIV (1645-1715)’.\nClaude Busuttil\nIn his research, Dr Busuttil examined the shift of power in the Order of the Knights of St John from the Spanish to the French sphere of influence during the 17th century, the political implications of this change, and the way French classicism was reflected in the architecture of certain important buildings in the Maltese islands.\nDr Busuttil’s thesis was directed by Michèle Virol, chair of scientific committee of the French National Association of Vauban, and he successfully defended it at the University of Rouen, Normandy, in front of an examining board whose members were from various European countries.\nDr Busuttil lectures at the International Institute for Baroque Studies at the University of Malta.", "comment_count": 0, "id": 1451}, {"keywords": "Education", "author": "", "article_body": "Alexia Farrugia, a surgical trainee currently working in the UK, was recently awarded a Master’s in Advanced Surgical Practice with distinction by Cardiff University.\nThe use of very low-calorie diets prior to weight loss surgery is Ms Farrugia’s area of interest and was the theme of her dissertation. Such diets are used to make surgery less complicated, and her research focused on whether their use reduced complications after surgery. This area of surgery is of particular importance due to the high rates of obesity locally and globally. Such diets are also used to treat medical conditions such as diabetes.\nFarrugia’s studies were supported by a scholarship provided through the Endeavour Scholarship scheme.", "comment_count": 0, "id": 1452}, {"keywords": "", "author": "", "article_body": "A 20-year-old man from Msida was grievously injured in a traffic accident on Saturday.\nThe police said the accident happened at the Coast Road in Naxxar at 4.20pm.\nThe young man was riding a Kawasaki when he lost control and fell. He was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1453}, {"keywords": "", "author": "Claire Caruana", "article_body": "Physiotherapists have urged the Prime Minister to address the “sub-standard environment” at the run-down department after over a week of industrial action there did not prompt any change.\nIn a letter sent to Prime Minister Joseph Muscat, the president of the Malta Association of Physiotherapists, Maria-Louisa Busuttil described the state of the physiotherapy department as “scary”.\nExposed wires can be seen in the majority of lighting fixtures at the department.\nThe “sub-standard environment” at the department is unsuitable for both the patients and staff treating them, the association head argued, calling for action to address the issue.\nThe call comes in the wake of a series of directives issued by the Malta Union of Midwives and Nurses last week. The union resorted to the action after Steward Health Care, tasked with operating the department situated at the now-closed St Luke’s Hospital, failed to provide upgrade timelines.\nWith the directives in force, the physiotherapists have not been treating any new patients, including those who undergo elective orthopaedic surgery. The physiotherapists have also not been assisting in clinics outside the St Luke’s Hospital premises and exercise classes at the amputee rehab unit are not held.\nUnsuitable for both the patients and staff treating them\nIn the letter, Ms Busuttil said the association was “concerned” about the situation at the St Luke’s unit, pointing to “existing standards” that were expected to be the norm in all physio-therapy clinics.\n“The MAP is concerned about the reported sub-standard environment in which physiotherapists are delivering their treatment sessions. This in view of the possible safety concerns of the clients that are being treated as well as the employees who report to work and provide a service on a daily basis.\n“To ensure this, there are existing standards that regulate physiotherapy clinics in Malta and this department should be no exception,” Ms Busuttil wrote.\nThe department sees about 300 patients every day, more than 75,000 a year but has not seen an upgrade in years, with physiotherapists being forced to make the best of what is available.\nThis meant that in recent months they have had no option but to make use of a corridor riddled with broken tiles during sessions with patients learning to walk again. The only treadmill available in the department has been out of order for months.\nOn its part, Steward Health Care has claimed that it has yet to unveil a promised master plan for the department because it needed to “dedicate enough time to planning in order to get it right”.\nLast week, a spokeswoman for the US hospital operator said that the master plan would be published “within a few weeks or months” but refused to provide a specific date.\nCalling for a “rapid resolution” to the issue so that the impact on the care received by patients is minimal, Ms Busuttil concluded the letter by urging the concerned authorities to “do their utmost” to also ensure good standards are met.\nQuestions sent to the government on whether the issue had been discussed with Steward and whether there had been any headway made were not answered by the time of writing.", "comment_count": 3, "id": 1454}, {"keywords": "", "author": "Denise Grech ", "article_body": "Nationalist leader Adrian Delia fired a strong missive against fellow MP Jason Azzopardi, saying he will be \"ignoring him\", hours after a stormy executive meeting which saw the resignation of its president and the co-option of Jean Pierre Debono to parliament. \nDr Azzopardi took to social media hours after PN executive committee head Mark Anthony Sammut resigned from the role, saying he felt the administration needed to carry responsibility. \n\nThe MP said on Facebook \"those who had nothing to do with the political strategy resigned while those who strategised could not be bothered\". \nAsked about the comments, Dr Delia said: \"I am going to ignore Jason Azzopardi - this is not the first time he has done this,\" he said. \"This does not help the party. Dr Azzopardi should also carry political responsibility and see and explain to people whether his attitude in public is helping the party,\" he added.\nThe PN leader did not elaborate on what this meant in concrete terms, however, he said he would not be asking Dr Azzopardi to resign.\n\"You do not ask people to resign over a comment unless it breaches certain limitations,\" he said. \"But I will not waste any more time on him,” he quickly added.\nDr Delia was speaking to journalists hours after a meeting at the PN general headquarters, where a vote was taken to fill a vacated Parliamentary post by David Stellini.\nBoth former MP Jean Pierre Debono, who had given up his seat for Dr Delia's co-option, and Gozitan councillor Kevin Cutajar, were interested in the post.\nRead: Manoeuvring starts for David Stellini's seat in parliament\nThe decision on Saturday was for the cooption of Mr Debono, who obtained 42 votes against Dr Cutajar's 40.\nAsked about the votes, Dr Delia said talk of clashes and faction was just an interpretation.\n\"There was an argument made about representing Gozo and another arguments were made about the lack of representation on the seventh district,\" he said.\nSome MPs had called for Dr Cutajar to fill in the post vacated by Mr Stellini, since they are both Gozitan. \n\"The executive discussed it and took a vote. This does not mean that I had any factions,\" he added.\nNationalist Party heavyweights led the charge on Saturday to send a message to the party administration that it is not business as usual. \nGozitan MP Chris Said, who had contested the party leadership, took to Facebook to express the Gozitans' \"disgust\" at the decision. He said he was considering the next step.\n\nAsked about Mr Sammut's resignation, Dr Delia said he personally called for a vote of confidence to be taken in him, but Mr Sammut had already taken his final decision.\nDr Delia continued to dismiss calls for a vote of confidence following last weekend's electoral loss, saying he would carry his political responsibility by soldiering on. \nPeople are sending a clear message, saying that they do not want the Nationalist party in government but they want it in Opposition. It needs to change before it can become an alternative government, he said. \n ", "comment_count": 114, "id": 1455}, {"keywords": "", "author": "Claire Caruana", "article_body": "Though the weatherman still forecasts rain showers for the coming weeks, empty sunbeds already hog prime spots at Għadira.\nIn recent years, beachgoers have repeatedly complained about unused sunbeds occupying seaside vantage points, having been placed there by operators as early as sunrise when the bays are close to empty.\nAlthough summer is still a few weeks away as is the bathing season proper, operators at Għadira Bay have already started taking up long stretches of the beach.\nBeachgoers who highlighted the matter to Times of Malta insisted that the sunbeds first appeared some weeks ago when few, if any, people were around even though scores of sunbeds were lined up on the shore.\n“It’s not even summer yet and the bay is already almost inaccessible because of the sunbeds. It’s one thing when they are in use but to take them out when there is nobody there is a whole other story,” one beachgoer said.\nThe bay is already almost inaccessible because of the sunbeds\nWhen Times of Malta visited the bay earlier in the week, over 100 sunbeds had already been laid out by 10am, even though not many swimmers could be seen.\nThe operator responsible for the sunbeds was nowhere to be seen during the visit though employees could be seen setting up the beach furniture.\nRead: Bathers still struggle to find space despite removal of main kiosk operator\nIn recent years, the Malta Tourism Authority had to take action after it emerged operators were hogging large areas of beaches by installing unrented sunbeds and umbrellas, especially on Comino.\nFollowing a spate of complaints, the tourism watchdog had its officials monitoring beaches to ensure no sunbeds or umbrellas were installed before they were rented.\nRead: 'We mean business': MTA boss talks beach management\nQuestions sent to the MTA last week remained unanswered at the time of writing despite reminders.", "comment_count": 67, "id": 1456}, {"keywords": "", "author": "Jacob Borg", "article_body": "A court has ordered a company owned by Malta’s Ambassador to Montenegro, Karl Izzo, to pay €120,000 in contested VAT and import duties.\nMalta’s Ambassador to Montenegro Karl Izzo\nMr Izzo, a personal friend of Prime Minister Joseph Muscat, is the co-owner of the retail fashion business Dizz Group, together with his wife Diane.\nRead: Karl Izzo approved as non-resident ambassador to Montenegro\nMadam Justice Lorraine Schembri Orland ordered the payment of the contested tax arrears on imports dating back to 2003 and 2004.\nThe company was found to have brought over a number of fashion items under certification that exempted it from paying duties on items imported from Europe. An inspection by Customs officers found that the origins of some of the imported clothing items could not be verified because they did not have labelling indicating they came from Italy.\nWhen the findings were referred to the Italian authorities, confirmation was received that, although the certification was authentic, it was not possible to verify whether all the products in the consignment had originated from Europe and were, therefore, covered by the exemption certificate.\nMr Izzo insisted in court the Italian company Dizz Limited, from whom they imported the fashion items, had always told them the clothes were made in Italy and would be labelled as such.\nIt was not possible to verify whether all the products had originated from Europe\nHe said he would not be present on site when the consignments arrived because the shipments were handled by his freight forwarders.\nHe said that he could not recall signing a document with the Customs department agreeing to pay the import duties due. An ensuing dispute led the company to take Customs to court in 2006 over the contested payment.\nThe court this week threw out Dizz Limited’s claim that the €120,000 tax charge was incorrectly applied by Customs.\nThe company was ordered to settle the import duty and VAT on the clothing items imported in 2003 and 2004.\nMr Izzo’s appointment as a non-resident ambassador was approved by Parliament in January following a heated sitting of the Public Appointments Committee. Opposition MPs had highlighted his lack of qualifications and experience in the diplomatic arena.\nAsked to justify his suitability for the role, Mr Izzo referred to his many trips to Montenegro relating to his work in sports.", "comment_count": 0, "id": 1457}, {"keywords": "", "author": "", "article_body": "A soldier was arraigned on Saturday, charged with stealing fuel, following an investigation sparked by the Armed Forces of Malta. \nIn a statement, the AFM said that it ordered the investigation after suspicions were raised in the quantities of the army's fuel storage.\nUpon confirming the illegalities, the AFM relayed the case to the police, which led to the arrest of the soldier. \n\"The AFM took a number of measures to stop the abuse and has started modernising the system of fuel storage,\" it said.\nThe arraignment comes days after two soldiers were arraigned with murdering a black migrant in Ħal Far in a case which shocked the country. ", "comment_count": 0, "id": 1458}, {"keywords": "", "author": "Ivan Martin", "article_body": "Labour’s efforts to entice youths and women to politics were reaping fruits, Prime Minister Joseph Muscat said on Saturday.\nSpeaking after the Labour Party secured a historic electoral margin in the local council elections on Friday night, Dr Muscat said he was excited about the results achieved by two PL programmes aimed at attracting youths and women to politics.\nThe PL, he said, had fielded nearly 100 youths for this election and out of these 16 had been elected as mayors and another 16 had made it to deputy mayor.\n“We are ensuring that from the seeds we are sowing today, this movement will reap the benefits for years to come,” he said.\nDr Muscat said that some 98 per cent of the youth candidates which had come through Forum Zgħazagħ Laburisti’s START campaign, had been elected to local council seats.\nWoman had also played a strong role in these council elections, with the PL electing 73 women. This meant that 27 per cent for the Labour councilors were women.\nAround four in every five women who had participated in the PL’s LEAD programme, aimed at attracting women to politics, had been elected.\nRomilda Baldacchino Zarb was last night elected Mayor of Mosta\n“I cannot but thank [MEP] Miriam Dalli who headed this programme, which was a success,” Dr Muscat said.\nHe told the audience how some had said that when two of the PL’s four MEPs were women, and now that many of Labour's councillors were also women, that the reform to ensure more women were elected to parliament was not needed.\n“But I say no, we need to be filled with energy, and we need to keep going until we reach parity, and half of our representatives are women,” he said.\nThis, Dr Muscat said, did not mean punishing men, but encouraging and promoting women to get the place they wanted and deserved.\nThe Labour leader said that when he had first seen the new faces of the first-time candidates the PL had put forward he had found that many were running precisely because of these new programmes.\n“And so we need to continue with these efforts. To show that our doors are open to let people into our party and not to usher them out,” he said.\n70 per cent of Malta is under Labour\nMuch of Dr Muscat’s speech focused on the “extraordinary” result of this local council election.\n“I can’t but express my great satisfaction that the Labour Party has secured the greatest victory in Maltese history,” he said.\nWith 58 per cent of the vote, a lead of 18 points which translates into a margin of 47,000 votes, an enormous responsibility had been placed on the PL’s shoulders.\nThe PL, he said had seen an increase of 15 councillors, increased control of five more local councils to reach 47 out of 68.\n“Practically 70 per cent of our local councils and even more when translated into territory are now under a Labour majority.”\nThis, Dr Muscat said, meant that Labour had a huge debt to repay to the public who trusted in them.\nThe PL would be setting up internal structures to coordinate local council programmes.\n“From tomorrow we need to start working because people expect us to deliver,” he said.", "comment_count": 13, "id": 1459}, {"keywords": "", "author": "", "article_body": "Sports, health and style take the spotlight for the June edition of Sunday Circle, out tomorrow with The Sunday Times of Malta and available digitally on www.tom-mag.com for free.\nGracing the cover is young tennis star Francesca Curmi, who shares the trials and tribulations that come with the territory.\nThe magazine this month also focuses on well-being\nMs Curmi also shares a video interview on the digital version of the magazine, available via the TOMMag App. The app also includes a video interview with Davide Tucci, who tells readers all about his journey as actor and model.\nThe magazine this month also focuses on well-being, with a very touching interview about one man’s journey out of drug abuse and how a residency at San Blas was instrumental in helping him rebuild his life. A writer details her challenges living with gluten intolerance, while best-selling author Jacob Burak gives an insight into the real meaning of self-help.\nThere’s also arts, fashion, shopping and personality interviews to enjoy, while the digital edition of the magazine offers readers the opportunity to win the new 100 ml Eau de Toilette by YSL, Y.\nSince its launch in October, the digital App keeps attracting a strong and loyal following, with thousands having already downloaded the app and experienced a host of fun features. If you have not done so already, download the digital version of Sunday Circle by looking up TOMMag on Google Play and Apple Store. It is free.\nThe Sunday Circle is published by Allied Newspapers.", "comment_count": 0, "id": 1460}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 8.30pm with PN's statement\nThe Nationalist Party's executive committee president resigned on Saturday and urged the administration to do likewise following a stormy meeting which saw Jean-Pierre Debono narrowly co-opted to parliament.\nThe developments came on Saturday after two electoral batterings which has left the PN in tatters.\nMark Anthony Sammut informed his colleagues he was stepping down because he wanted to assume responsibility for the heavy PN defeat at the European and council elections and wanted to express \"disgust\" at the party’s reaction to the result.\n\"I took the decision after the worst electoral loss in the PN’s history... The rest of the administration should step down,\" he told reporters after the meeting.\nWhatever mandate given by its members in a democratic manner was irrelevant at this stage, Mr Sammut said, saying that the administration should assume its responsibility for the disastrous result.Everyone's scared of speaking. Anybody who speaks up is branded a traitor\n\"We can only unite once the party walks out of this alley. Everyone's scared of speaking up. Anybody who does so is branded a traitor... History will judge us.\"\nAsked whether Dr Delia should also step down, he simply said: “I think my statement was clear enough”.\nMr Sammut who had taken on the role in November 2017 said he had been given a unanimous vote of confidence by the party executive but felt it was his duty to assume political responsibility, despite not being involved in the elections' campaign strategy. \n\nIn a post on Facebook, Nationalist MP Jason Azzopardi noted that while someone who was not involved in the drawing up of the political strategy was shouldering responsibility and resigning, those who drew it up and implemented it could not care less.\nAsked about this post later, Dr Delia said he will be ignoring Dr Azzopardi.\n“Dr Azzopardi has done it more than once and what he is doing is not beneficial to the party. I have no more time to waste with what he chooses to say on social media. Dr Azzopardi should shoulder his political responsibility,” Dr Delia said.\nAsked whether he would be asking Dr Azzopardi to resign, Dr Delia said he would not.\n“You do not ask someone to resign for a comment unless that comment goes over a certain limit,” he said.\nDebono replaces Stellini\nThe PN's executive committee decided to vote for Jean Pierre Debono, who had ceded his seat to pave the way for Adrian Delia to be co-opted to parliament in 2017.\nForty-two votes went to Mr Debono, just two more than Gozitan lawyer Kevin Cutajar, a result which party insiders said had now unofficially split the party right down the middle.\nJean Pierre Debono: back in parliament.\nThe co-option comes following the resignation of MP David Stellini.\nVarious PN MPs had expressed their support for Dr Cutajar's bid, while certain party officials and the party administration appeared to be supporting Mr Debono.\nIn a statement in the evening, the Nationalist Party said the decision was taken following a secret vote which was taken after both candidates were given the opportunity to make their case.\nThe main argument in favour of Dr Cutajar's cooption was that Mr Stellini had been one of four Gozitan MPs so the chair should go to a Gozitan. That in favour of Mr Debono was that the two MPs elected on the seventh district in the 2017 election had been given up, one to the Democratic Party the other to the Nationalist Party, so this district deserved a representative.\n\nNationalist MP Chris Said took to Facebook to express the Gozitans' \"disgust\" at the decision. He said he was considering what action to take.\nWalking out of the PN headquarters, Dr Cutajar said he had no comment to make. \nPN deputy leader Robert Arrigo gave no comment as he walked into the meeting.\nVideo: Chris Sant Fournier\nWalking out of the PN headquarters soon after getting co-opted to Parliament, Mr Debono said he disagreed with Mr Sammut’s decision.\n\"With people leaving, the party is not being strengthened but it is shrinking. What we need is a strong internal, in-depth discussion to analyse this big electoral defeat for the party.\"\nConcrete, rather than hasty, decisions that would strengthen the party would then be taken.\nAsked whether he believed Dr Delia should stay on following the result, he said \"it is not a matter of who stays or who goes. My interest is to see the party strengthen. What needs to be done should be done as long as the party is strengthened,\" he said.\nThe Nationalist Party's executive committee convened on Saturday morning for the first time since a landslide defeat at the European and local council elections.\nThe Labour Party won a majority of 42,000 votes in the European elections increasing it to 47,000 votes in the council elections. \nThe party leadership appeared to downplay the extent of the defeat and Adrian Delia has insisted he would run his term until the next general election. \nAsked whether he would heed former prime minister Lawrence Gonzi’s advice to put his leadership to the test, Dr Delia replied with a curt: “No.”\nLater, the PN leader said he had been entrusted with a task and when the party members who gave him that trust believed they no longer had confidence in him, he would leave.\n\"The party has its structures and members can take action when they deem fit,\" he said.\nDr Delia was also asked to comment about the way forward. This, he said, was to continue taking decisions in the interest of the country.\n“The people are saying the Nationalist Party has to change, some want it to change one way, others want it to change another way. We will go through the necessary processes to ensure theis is done,” he said.\nSpeaking prior to going into the PN executive meeting, he said that an analysis of the final results was yet to be made, he added.\n\"This was a democratic party and those within the party had structures where they could address their issues, he said.\nNationalist veteran Francis Zammit Dimech has in the meantime offered to intervene to help unite the party during a meeting with leader Adrian Delia.\nApproached as he was exiting the PN headquarters, former leader Simon Busuttil refused to comment.\nThe Nationalist Party has suffered two humiliating defeats.", "comment_count": 341, "id": 1461}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The gender gap in pensions in Malta is the widest in Europe, together with that of the Netherlands, according to a European report.\nAccording to the report, pay inequalities in employment extend to older age too, including the gender gap in pensions, which stands at 37 per cent to the disadvantage of EU women.\nPay gaps accumulate over people’s lives - wages and other earnings over the life course determine old-age pension entitlements.\nThe widest gender gaps in pensions were noted in the Netherlands and Malta (above 45 per cent) with the narrowest in Estonia (two per cent), according to a report by the European Institute for Gender Equality.\nThe gender pay gap revealed different realities that people face in their professional and personal lives, the institute said. Today, women across the EU earn on average 16 per cent less per hour than men.\nWe must get rid of gender stereotypes that underpin the pay gap\nMinding the gender gap\nIn Malta, there is an 11 per cent wage difference between men and women who do the same job, meaning that, symbolically, women here work for free between November 19 and the end of the year.\nIn Europe, the widest gap in earnings is among couples with children, indicating that the financial cost of having a family falls heavily on women’s shoulders.\n“Women are using flexible work arrangements to juggle work and family life but this is rarely the case for men. Our report shows that work-life balance initiatives can help boost women’s employment and close the gender pay gap but only if both women and men have support from their employers to take advantage of these measures,” institute director Virginija Langbakk said.\nThe gender pay gap is a result of many factors: women are concentrated in lower level and lower paid jobs, work more (both paid and unpaid) hours, take longer career breaks and are more likely to choose part-time work to reconcile work and care responsibilities.\n“We must get rid of gender stereotypes that underpin the pay gap, starting with the uneven concentration of women and men in the labour market. Women dominate fields that are less valued and lower paid, such as education or care work. At the same time, women are less likely to be in top management roles and this needs to change,” she added.\nEven higher education does not protect women from earning less, according to the institute, which noted that women with a tertiary degree faced a wider pay gap of 25 per cent. As they moved up the career ladder, the pay gap widened.\nThe institute referred to the EU’s Directive on Work-Life Balance for Parents and Carers, noting it was aimed at improving access to parental leave and flexible working as well as increase the take-up of such arrangements by men.\nLed and negotiated by Nationalist MEP David Casa, the directive was given the green light in April to become law by the European Parliament.", "comment_count": 30, "id": 1462}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapera:\nTimes of Malta cites a report saying that the gender gap in pensions in Malta is thewidest in Europe, together with that of the Netherlands. It also reports that physiotherapists have urged the Prime Minister to address the “sub-standard environment” at the run-down department after over a week of industrial actionthere did not prompt any change.\nL-orizzont says two thirds of Malta's councils had turned Labour after the final counts on Friday night, a result which had left many Nationalists disgruntled. \nThe Malta Independent quotes Minister Chris Fearne saying Labour will remain a winning party even after Joseph Muscat's departure. It also reports that a youth had been found guilty after almost running over a policeman. \nIn-Nazzjon quotes a report from The Atlantic which highlighted the situation in Malta after a critical Council of Europe report. It says that heads would have rolled in other countries after such a scathing report.", "comment_count": 0, "id": 1463}, {"keywords": "", "author": "Denise Grech ", "article_body": "The anti-Muslim remarks made by the Guardian of Future Generations were “completely unacceptable,” President George Vella has said.\nGuardian of Future Generations Maurice Mizzi raised eyebrows last week when he told The Sunday Times of Malta that Muslims “were taking over” and that the country should stop all migrants from coming in.\n“There’s no beating about the bush,” Dr Vella told Times of Malta yesterday. “Categorically, I am saying they are completely unacceptable.”\nMaurice Mizzi's incendiary comments sparked condemnation.\nRead: Maurice Mizzi's anti-Muslim tirade sparks calls for dismissal\nHowever, the President refused to comment on whether Mr Mizzi should be asked to step down.\n“That is the minister’s decision,” he said.\nEnvironment Minister José Herrera said he was still considering whether to dismiss Mr Mizzi, insisting he had always known him to be a “good man”.\nRead: Minister 'considering' Maurice Mizzi's position after anti-Muslim tirade\nDr Vella was speaking following a Stop Hate campaign conference in Valletta, which delved into the problem of hate speech in Malta and its proliferation.Even locally, xenophobic and racist movements are openly using hate speech\nOnly distancing oneself from xenophobic statements without condemning them plays into the hands of extremist groups, sending a very poor message to the rest of the population, he told the audience during an opening speech.\nHe also commented on the media’s role, saying words linking migration to an “invasion” might seem attractive, but have been proven not to be conducive to informative and impartial journalism.\n“While recognising that punitive measures and a criminalisation of hate speech are necessary, I believe that on their own they fail to counter the proliferation of hate speech,” he said. He called for a holistic approach to stop hate.\n“It is painful to note that even locally xenophobic and racist movements are openly using hate speech and making their presence felt at national level,” Dr Vella said.\n“It is even more troubling that these sentiments are sometimes echoed by political and public figures in Malta,” he said. “One should question what impact similar comments have on aspiring young politicians, party supporters and society in general,” Dr Vella added.\nSpeaking during the debate, Times of Malta online editor Herman Grech and The Shift News co-founder Caroline Muscat said they have sought to reduce hate speech from their news portals, but called out government entities and state media that continue fuelling stereotypes.\nMs Muscat noted that politicians have played a part in making hate speech mainstream. Mr Grech said it was not enough for politicians to make certain statements before an election.\nThe problem, he added, was also that social media giants like Facebook were out of control, providing a platform for hate.\n“Sometimes, empty vessels make the loudest sounds,” he said, insisting that it was not enough for people to stay silent but they had a duty to call out xenophobia and racism. \nIntegra Foundation head Maria Pisani noted that tokenistic statements from politicians were not enough, citing a series of examples which showed that racism was being institutionalised, often inadvertently. \nGovernment representative Diane Galea said authorities were looking at establishing a national agency on hate crime. People needed to focus on inclusion, not only integration, she said.\nMs Muscat, however, was quick to point out that many of the institutions look “fantastic” on paper but are often under-resourced or ineffective.\nThe discussion, in fact, underlined the need to facilitate the process of reporting hate and racism. ", "comment_count": 0, "id": 1464}, {"keywords": "", "author": "Denise Grech ", "article_body": "Nationalist veteran Francis Zammit Dimech has offered to help unite the party during a meeting with leader Adrian Delia, the former MEP said.\nSpeaking on NET TV, Dr Zammit Dimech said he believed his role within the party would be to help heal and to unite those with different opinions.\nDr Zammit Dimech told the Times of Malta that Dr Delia was \"open to the idea\". \n\"I believe this is what the party needs the most - to calmly analyse the situation,\" he said, admitting last weekend’s election results had been disappointing.\nThis is not the first time that the party turned to stalwarts to solve internal rifts.\nAfter Dr Delia asked former leader Simon Busuttil to suspend himself from the PN parliamentary group in the wake of the publication of the Egrant inquiry, Dr Zammit Dimech, former PN leader Lawrence Gonzi and former deputy leader Tonio Borg were roped in to avoid a split in the party. \nDr Delia had called on Dr Zammit Dimech to remain active within the party after the former MEP contested this year's elections but failed to obtain a seat. \nDr Zammit Dimech said he still wanted to remain of service to the PN. \"This is a big party and we want it to get stronger,\" he said.\nThe government had already captured institutions, leaving democracy under threat, Dr Zammit Dimech said. The country now desperately needed a united Opposition that used its wide range of resources, he added.\nHis first appeal to party members was to start expressing their opinions face-to-face, rather than on Facebook.\nHe also urged supporters to contain their anger. \n\"I never suggest something I do not practice,\" he said. \"Look at me, I am not expressing this with anger. I am here with the same smile, will and political energy - but I do not want to use it for myself. I want to extend it to the party,\" he added.", "comment_count": 94, "id": 1465}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Church needed to do some “soul-searching” after a murder in Ħal Far that was believed to be racially-motivated, Archbishop Charles Scicluna said on Thursday.\nTwo soldiers stand accused of killing Lassana Cisse Souleymane, 42, in a drive-by shooting last April. Another two men were also injured in the shooting. \nSpeaking at the University on the fringes of an ‘open dialogue’ following the murder, Mgr Scicluna said the Church needed to see whether there had been “discourse that paints dark people as something dangerous”.\n“We’re not about hatred, we’re about peace and brotherhood,” Mgr Scicluna said.\nThere were “historical narratives” the Church needed to re-visit, but a lot of work has been done on the ground to continue to support migrants in recent years, he said.\n“We realised that hatred could be nurtured by people saying we need to defend the Christian heritage of Malta against foreign invasion,” Mgr Scicluna said. “I think that is a narrative which the Church should condemn vociferously,” he added.\nThe Church had recently undertaken several initiatives to continue to foster inclusion, he noted.\nThere is a sense of belonging that we need to share with our brothers\nA parish recently invited people of colour within the parish on Maundy Thursday to take part in the ceremony of washing of the feet.\n“The community was enthused with this idea because there is a sense of belonging that we need to share with our brothers,” he said, adding this was a beautiful example of fostering inclusion.\nMr Cisse, he said, had sought help from the Emigrants Commission with his papers. Unfortunately, he added, he had been rejected by the authorities.\n“We gave him that label; our institutions and our legislation gave him that label. He was rejected. We are here because in the end he was physically eliminated,” he said.\n“We need to be united to get our track record back and be more inclusive,” he said.\nThe Curia is also organising a “good neighbourhood dinner” with a group of young people from Malta, Africa and Asia.\nAn estimated 60 youths are expected to attend, half of whom will be migrants. The event will be held on June 11.\n“Sitting together at the table and sharing the narratives of heritage, faith, culture because diversity is a gift and it is enriching,” Mgr Scicluna said. “It is not something we should fear, but welcome because it will make us stronger,” he added.\nHow to help\nAnyone wishing to contribute to the Archbishop’s charity fund can do so on the following APS bank account:\nAccount Name: Archdiocese of Malta Charity Fund-Mgr Charles J. Scicluna\nIBAN: MT53APSB77002000494820001626638\nSWIFT / BIC Code: APSBMTMT", "comment_count": 0, "id": 1466}, {"keywords": "", "author": "", "article_body": "Lawyer Kevin Cutajar has formally announced his bid to occupy the Nationalist Party seat vacated by David Stellini, potentially setting the stage for a further rift within the party. \nIn a Facebook post, Dr Cutajar, a Xagħra councillor, said he will be attending the Nationalist executive committee meeting on Saturday to formally request his co-option to parliament. \n\"Now that the election is over... I will be seeking to take David Stellini's seat, which was earlier occupied by Marthese Portelli, so as to respect the Gozitan voters' wish,\" he wrote. \nHe said he had informed PN leader Adrian Delia as well as PN officials about his wish.\n\"I'm sure the PN executive will respect Gozitan voters because the PN is Gozo's party.\"\nDr Cutajar was a PN candidate for the 2017 and 2013 general elections, as well as local councillor in Xagħra since 2007.\nVarious PN MPs have expressed their support for his bid, potentially exposing another rift between certain MPs and the party administration, which appears to be supporting Jean Pierre Debono. \nMr Debono had stepped down from parliament to pave the way for Adrian Delia. \nDavid Stellini officially resigned his seat in the House of Representatives, to return to his posting with the European People’s Party in Brussels.\nThe Labour Party won the European elections with a 42,000 majority over the PN last weekend. ", "comment_count": 42, "id": 1467}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated Saturday 7am\nLabour overwhelmingly won the 2019 council elections with 58% of the vote, with a record 47,000 majority over the Nationalist Party and with 5,762 given to independent candidates.\nIn all, 268 Labour councillors were elected against the PN's 192. Four independent candidates will also be taking a seat. The Labour Party won a majority in 47 councils, the PN in 19 (including Mdina where no election was held).\n\nThe counting came to a close on Friday, when the last 23 councils were decided.\nSpeaking on One as soon as the counting was over, Prime Minister Joseph Muscat said Labour got 18% more votes than the Nationalist Party, or a 47,116 vote difference.\nThis, he said, was a historic victory that consolidated the MEP results, which Labour won by a 42,000 majority. \nThe PL had won symbolic victories such as winning Valletta for the first time ever, and securing Siġġiewi, traditionally a PN locality. It had also won swing localities like Mosta and kept its hold on Labour leaning areas.\n\n\n\nHe thanked the PL candidates and volunteers and referred to the PL's LEAD programme, which enticed women to contest elections - saying the result proved this had been a success.\nThe party made other major victories on Friday taking over the previously PN-held Siġġiewi and Mosta. \nLabour won Siġġiewi by a razor-thin majority of 70 votes, obtaining 2,770 first count votes against the PN's 2,700. It won Mosta 7-6.\nMunxar mayor Damien Spiteri. Video: Mark Zammit Cordina\nThere was some consolation for the Nationalist Party as it saw the tiny village of Munxar swing in its favour 3-2, the first such swing in this series of elections all over the country.\nThe PN also won San Lawrenz 4-1, where Noel Formosa will be retaining his post of mayor. Mr Formosa has been elected to the council since councils started except for once when he did not contest. “Tomorrow, I mark 25 years in local government,” he said. It retained Swieqi 7-2, won Naxxar 5-4, Attard 6-3 and Kerċem and Għargħur 3-2.\nNoel Formosa. Photo: Mark Zammit Cordina\nBesides Mosta and Siġġiewi, Labour also won Senglea, Vittoriosa,Santa Luċija and Xgħajra 4-1 with the vote difference between the mayor and the deputy mayor in Xgħajra being of just one vote. It also won Floriana, Mtarfa, Safi, Kirkop and Qala 3-2. It won Gżira 5-4 and Luqa and Ħamrun 5-2. John Schembi, Parliamentary Secretary Silvio Schembri's father, was confirmed as Luqa's mayor. It won Qormi 7-4.\nBoth parties obtained two votes each in Żebbuġ (Gozo), where Nicky Saliba, formerly a PN councillor, was elected as an independent.\nRead: Labour wins 16 councils, PN four in Thursday's count\nVideo: Mark Zammit Cordina\nRead: Council results so far: no big surprises but some notable changes\nPhoto: Ivan Martin\nA little scuffle as counting agents of different parties complain of encroaching on each others space. Video: Ivan Martin\nFriday was characterised by loud celebrations of Labour supporters who flooded the hall.\nAt one point in the evening as PN supporters celebrated winning Attard, Labour supporters joined in the chants of “[Adrian] Delia! Delia!” - a jibe at the embattled PN leader.\nThe councils decided on Friday were Swieqi, Attard, Qormi, Naxxar, Mosta, Floriana, Luqa, Senglea, Għargħur, Ħamrun, Kirkop, Gżira, Santa Luċija, Siġġiewi, Xgħajra, Mtarfa, San Lawrenz, Safi, Vittoriosa, Munxar, Kerċem, Żebbuġ (Gozo), and Qala.\nVideo: Mark Zammit Cordina\nElected councillors\nSan Lawrenz: Noel Formosa (mayor), Anthony Formosa, Joseph Michael Cauchi, Carmela Grima - PN; George Camilleri - PL\nMunxar: Damien Spiteri (mayor), Carmela Parnis, Mark Anthony Busuttil - PN; Sonja Abela, Joseph Cauchi - PL\nSenglea: Clive Pulis (mayor), Anthony Bonavia, Joeline Attard, Corinne Buhagiar - PL; Malcolm Gatt - PN\nFloriana: Davina Sammut Hili (mayor), Gail Demanuele, Vincent Borg - PL; James Aaron Ellul, Justine Palmier - PN\nXgħajra: Neil Attard (mayor), Rosabelle Pulis, Anthony Valvo, Raymond Camilleri - PL; Doris Borg - PN\nSwieqi: Noel Muscat (mayor), Mary Anne Abela, Rowena Scicluna, Paul Fenech, Anna Pisani, Teresa Valentino, Edgar Rossignaud - PN; Matthew Bonello, Aleander Chetcuti - PL\nŻebbuġ (Gozo): Marlene Cini, Sandra Grech - PL; Daniel Cordina, Baskal Saliba - PN; Nicky Saliba - independent (mayorship undecided)\nKerċem: Mario Azzopardi (mayor), Pawlu Mizzi, Horace Vella - PN; Frankie Attard, Elvin Grech - PL\nQala: Paul Buttigieg (mayor), John Cefai, Joseph Buttigieg - PL; Karl Buttigieg, Valerie Cassar Mejlak - PN\nMtarfa: Daniel Attard (mayor), Kyle Mifsud, Marica Sammut Dimech - PL; Simon Paul Fenech, Anton Mifsud - PN\nKirkop: Terence Agius (mayor), Joseph Schembri, Ritienne Caruana - PL; John Luke Cassar, Cody Galea - PN\nGżira: Conrad Borg Manché (mayor), Ralph Mangion, Neville Chetcuti, Ian Buhagiar, Alexander Zammit - PL; Jeremy Cardona, Hugh Caruana, Shaun Farrugia, Jessica Borg - PN\nVittoriosa: John Boxall (mayor), Christopher Cassar, Trevor Mizzi, Jason Bortelli - PL; Anton Gellel - PN\nSafi: John Mula (mayor), Janice Azzopardi, Francis Callus - PL; Joanna Abdilla, Pupull Abdilla - PN\nGħargħur: Abraham Aquilina (mayor), Helen Gauci, Marilena Galea - PN; Christopher Fenech, Carl Grech - PL\nLuqa: John Schembri (mayor) Donald Cassar, Eric Camilleri, Kearon Bruno, Lucia Massa - PL; Frederick Aquilina, Victor Caruana - PN\nĦamrun: Christian Sammut (mayor), Vince Bonello, Jurgen Carl Grixti, Carmen Borg, Cynthia Tomasuolo - PL; Efrem Buttigieg, Louise Portelli - PN\nSiġġiewi: Kurstein Sant (mayor), Rodianne Haber, Dominic Grech, Adrian Farrugia - PL; Alessia Psaila Zammit, Julian Borg, Francine Farrugia - PN\nSanta Luċija: Charmaine St John (mayor), Frederick Cutajar, Terrence Ellul, Kyle D’Amato - PL; Liam Sciberras - PN\nMosta: Romilda Baldacchino Zarb (mayor), Chris Grech, Rachel Abela, Shirley Abela, Pia Bonnici, Marvic Camilleri, Joseph Howard - PL; Keith Cassar, Frans Debuara, Angele Rapa, Joseph Gatt, Aiken Zerafa, Mikhail Micallef - PN\nQormi: Renald Falzon (mayor), Josef C. Masini Vento, Donnha Barbara, Daniel Ablett, Marvin Zammit, Sean Apap Meli, Martina Grech - PL; Jerome Caruana Cilia, Ralph Puli, Carmelo Cuschieri, George Muscat - PN\nNaxxar: Anne Marie Muscat Fenech Adami (mayor), Christopher Deguara, Mary Anne Cuomo, Mark Anthony Deguara, Joe Spiteri - PN; Marlon Brincat, Noel Gatt, Ivan Gaffiero, Stephen Abela - PL\nAttard: Stefan Cordina (mayor), Alex Mangion, Connie Scerri, Remigio Bartolo, Silvio Brincat, Giorgio Schembri - PN; Helen Caruana, John P. Bonnici, Victor Galea - PL", "comment_count": 100, "id": 1468}, {"keywords": "", "author": "", "article_body": "A man was on Friday declared not guilty of trafficking drugs due to a lack of valid evidence.\nThe man, Darren Grech, was arrested behind the wheel of his car in December 2009. Joseph Duca, who was driving another car that Mr Grech was seen approaching, was also arrested.\nAs they approached the car, the police saw the accused throw away what they suspected was a sachet of heroin. Mr Duca was found in possession of €25 in his pocket and €80 in his wallet. A subsequent search of Mr Grech’s house returned a makeshift crack pipe and €885 in cash.\nThe accused released a statement at the time but was not allowed to consult a lawyer before or during the interrogation. The court declared the statement inadmissible in light of recent court judgements.\nThe only determining evidence in the case was the sworn statement released by Mr Duca, but he was not produced as a witness by the prosecution.\nNo tests were carried out on the substance in the sachet to prove it was heroin, nor was it exhibited as evidence and neither were other seized items including mobile phones, diaries and cash.The court, presided by magistrate Natasha Galea Sciberras, upheld the pleas raised by the defence and declared the accused not guilty.Lawyer Joe Giglio was defence counsel.", "comment_count": 6, "id": 1469}, {"keywords": "", "author": "", "article_body": "More than 4,000 bottles of non-alcoholic beverages on which taxes have not been paid were found by at a garage in Swatar.\nThe Customs Department said on Friday that a long investigation by the Joint Enforcement Task-force into the business of a Cospicua Barber Shop led customs officials and tax inspectors to the Swatar garage, which was being used for storage purposes by the owner of the Barber Shop.\nA total 4,134 bottles of non-alcoholic beverages imported in Malta without taxes being paid were found. The business owner also did not hold the necessary registration to import and trade excise goods.", "comment_count": 3, "id": 1470}, {"keywords": "", "author": "Ivan Martin", "article_body": "The drastic increase in hotels and restaurants on the island was posing a risk to the sectors’ profitability, the author of a nationwide study warned on Friday.\nConducted by ‘big four’ accounting firm Deloitte, the study found that while tourist arrival trends were still positive, the increases were less pronounced than in previous years and the sector was now facing “a number of challenges”.\n“Results aren't what we got used to. We had a number of years when the graphs kept going up,” Raphael Aloisio, from Deloitte, said.\nWhy was the sector facing a tougher reality today? While the study gives a variety of reasons, Mr Aloisio gave a blunt explanation of his own: if supply (of hotels and restaurants) continued to increase at a faster rate than the demand for rooms and tables, then the results would keep going down.\nThe number of permits for hotels being issued had shot up from 15 in 2012 to 119 in 2017, he said, describing this as “alarming”.\nHis warning prompted grunts from the hoteliers and restauranteurs gathered for the presentation and was quickly followed by a slight change of tone on Mr Aloisio’s part for industry players not to take any drastic decisions in reaction to these findings.\nTourism Minister Konrad Mizzi took the opportunity to announced that an agreement with alternative accommodation giant Booking.com had just been reached which would ensure that private accommodation providers in Malta would have to register with the Malta Tourism Authority before putting their property on the international website.\nThe authorities, Dr Mizzi said, were also holding talks with Trip Advisor, he said.\nDr Mizzi said new forms of accommodation were a reality that the country could not ignore. In this spirit, the government was developing a 2025 strategy document to help identify ways to help the sector.\nMHRA president Tony Zahra said that “for every up there is a down”.\nThe island was not going to get any bigger, and perhaps it was time to start directing investors to consider alternative ways of making money than building new hotels.\nHe urged future planning to ensure there were more ups than downs going forward, and said that while land reclamation could double the island's landmass, the sector had to keep its feet on the ground.\nWhat did the Deloitte study find? Mr Aloisio said tourist spending across the board had gone up in the first quarter this year, but only “marginally”, by 0.3%.\nDuring the first quarter this year, the number of tourists staying in hotels remained at par with the previous year, although the number of guest nights spent in hotels had dropped by 5.5% - with more tourists opting for accommodation alternatives.\nThis shift in accommodation patterns was having a negative effect on the hotel industry, the survey found, with bottom-line profitability now at stake.\nBoth four-star and five-star hotels in Malta were reporting dips in gross operating profits.\nTourists opting for non-traditional accommodation stayed in Malta on average for 9.31 days, up 8.% and almost four days longer than those staying in hotels. The dip in tourists opting for hotels naturally impacted occupancy rates, with the average occupancy dropping from 56.9% to 53.6%.\nAverage room rates were also down, by around 1%, resulting in an overall drop in revenue per room of some 6.3%.\nOn average, hotels registered a significant drop in gross operating profit per available room.\nIn this quarter that profitability figure had hit €918, that was €528 lower than in the same period last year, and €986 lower than in 2017.\nAlternative accommodation, the report says, was hitting the four-star hotel sector the hardest. Room rates for this sector dropped by 2%.\nRestaurants also experience tougher winter\nThe MHRA conducted a survey among 64 Maltese and Gozitan restaurant owners in collaboration with Deloitte to evaluate their performance during the last winter season, which they said was a “mixed bag”.\nMr Aloisio again gave a warning saying that 52 permits for new restaurants had been issued in 2012, but by 2017 this had shot up to 343.\nAccording to the MHRA, participants reported varying results, with nearly half saying they had declining revenues when compared to the previous winter.\nDespite this drop, some areas in Malta managed to register a positive performance. Restaurants in the north central part of Malta and Gozo managed a 3% increase in revenue overall.\nOn the other hand, coastal areas, Valletta, and southern areas registered a negative trend of 4%, 2%, and 6% respectively.\nThe MHRA estimates a slight growth in operating costs of 2.3%.\nPayroll costs climbed by 5.7%, which the association believes could be linked to the recruitment challenges faced by operators in the sector.\nAround 60% of employees in the catering sector are foreigners, the MHRA estimated.\nOverall, some 56% claimed to have had an unsatisfactory winter performance. However, almost all participating restaurants remained “upbeat” and were expecting good business for the upcoming summer season.", "comment_count": 51, "id": 1471}, {"keywords": "", "author": "", "article_body": "A young man who tried to run over a policeman while driving a stolen car had his driving licence suspended for a year on Friday and was placed under a three year probation order.\nThe court, condemned the car owner for leaving the car unlocked.\nThe incident happened in October, when the accused, whose name cannot be published by court order because he is a minor, stole a silver convertible Nissan March from Msida. Police officers spotted the stolen car while on patrol and stopped the driver, who was accompanied by a female passenger.\nAt the time, the car was stationary but when the police got out of their vehicle to approach the Nissan, the driver had unsuccessfully tried to run an officer over, before leading the officers on a car chase around Kirkop.\nThe chase ended when the accused turned to go up a one-way street and found himself staring at a van coming from the opposite direction.\nThe accused’s girlfriend had told the police the accused had told her he had found an abandoned vehicle and asked her to ride with him. Although the court, presided over by Magistrate Joseph Mifsud, had no hesitation in believing the prosecution’s version of events, it also had harsh words for the car’s owner for leaving the car unlocked.\n“The court condemns the irresponsible actions of the parte civile who left his car unlocked for a number of hours,” said the magistrate.\nMagristrate Mifsud noted that the accused had made “enormous progress” in his behaviour after being remanded in custody. After being granted bail he had dedicated himself to work and study and this had impressed his probation officer. All drug tests were negative.\nLawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 1472}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The dream of a 20-year-old afflicted by three bouts of cancer was fulfilled after his death when his family met Pope Francis in Rome this week.\nJerome Frendo had been diagnosed with a malignant and rare cancer – Ewing’s Sarcoma that targets bones and soft tissue – when he was just 16 years old.\nRead: Today is another day worth living - 19-year-old diagnosed with cancer twice\nJerome’s front cover.\nOutlived by his inspiring messages, Jerome also lives in Smiling with Jerome, a foundation set up by his parents. Before he died, the young man had asked his mother to support others in their same situation.\nHis parents Kenneth and Josette, his brother Jethro and aunt, Sister Rachel, on Wednesday presented to Pope Francis a book written in his memory.\nMr Frendo told Times of Malta his son had always felt inspired by Pope Francis and had once written a letter to the Pontiff, who replied with a personalised letter, addressed directly to Jerome and referring to his particular circumstances.\nHe added that during the long nights they spent in hospital when Jerome was battling cancer, his son used to express his wish to meet the Pope. Soon after his death in October of 2017, Jerome’s family started looking into how to fulfil his dream.\nThe Frendos met the Pope following his general audience, an event that left them emotional and speechless.\n“The Pope’s reaction when we presented the book was indescribable. He hugged the book, shook our hands and took his time to speak to us,” his parents said.\nThe meeting has made 2019 even more special for the Frendo family. This year marks 50 years since the first Mass of Tirana Archbishop George Frendo, Jerome’s great uncle, who was present at the meeting with the Pope. It is also 25 years since his aunt, Augustinian Sisters’ provincial superior Rachel Frendo, took up her perpetual profession.\nThis year, Jerome’s parents also mark 25 years of marriage, a celebration they found quite difficult in the absence of one of their sons.\nHe hugged the book, shook our hands and took his time to speak to us\n“Jerome’s loss is something that will never heal,” Mr Frendo said. In an interview with the Times of Malta a year after Jerome’s death, his parents had said that the gap he left was growing.\n“We see other youths his age finding a job and settling down. While they are writing wedding invitations, we are writing memorial invitations,” Ms Frendo had said.\nAll proceeds from the book Jerome, by Veronica Gerada, go to the Smiling with Jerome foundation.\nLog on to https://smilingwithjerome.com/ for more information about the organisation.", "comment_count": 1, "id": 1473}, {"keywords": "", "author": "", "article_body": "Malta Public Transport has introduced a new innovative service offering customers the possibility to book their bus seat on one of the new premium buses through the popular and updated Tallinja App.\nTD Plus is a pilot project which allows passengers to choose when and where they would like to be picked up from and dropped off. The system then checks the best ride available and provides the passenger with their trip confirmation. \n“This is a completely new approach to urban transportation and the feedback we received after an intensive testing period in the past weeks has been immensely encouraging,” said Konrad Pulé, general manager at Malta Public Transport.\nThe bus company partnered with Ecolane, an on-demand scheduling and dispatching software company, to provide this innovative service. TD Plus uses technology that matches the requests made by different passengers to select the most efficient route.\nCustomers can book multiple passengers on a single trip, and request access for wheelchairs or pushchairs. The system will also send notifications to alert the passengers that the bus is on its way to the bus stop.Malta Public Transport is initially operating TD Plus on a select number of bus stops in the following localities: Valletta, Floriana, Pietà, Blata l-Bajda, Msida, San Ġwann, St. Julian’s, Swieqi and Pembroke. The service is available every day between 05.30am and 10.30pm. As a special introductory offer, the service will be available at €2 per trip for all those customers who book through the Tallinja App during the month of June. Customers may choose to pay for their trip with the credit on their Tallinja Card or using their credit card.\nThe fleet includes six new premium minibuses which are low floor and fully wheelchair accessible. Free WiFi is available and seats are equipped with USB charging ports for added convenience. The minibuses can accommodate up to 16 passengers. The updated Tallinja App can be downloaded for free from App Store and Google Play Store. More information can be found on publictransport.com.mt.", "comment_count": 24, "id": 1474}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman who witnessed an alleged sexual assault was on Friday denied bail on charges of threatening the police and disobeying their lawful orders after trying to escape from custody.\nShe is believed to have vociferously objected to police questions on Friday morning and tried to escape from the police car, before creating a disturbance at the St Julian’s police station.\nSources say the woman had been in Wilga Street, Paceville in the company of a Somali man when he allegedly sexually assaulted another female.\nRaquel Lopez Romero, 30 from Spain, sobbed in the dock during her arraignment before magistrate Yana Micallef Stafrace on Friday morning.\nHer legal aid lawyer, Martin Fenech played down the incident, saying she might have said some unnecessary things to the police but that this did not merit her being denied bail.\nBut the woman, who has only been in Malta since Monday, could not remember her address for the purposes of bail, other than that she lived in an apartment in Sliema. The court said it had no option but to remand her in custody.\nHer Somali companion will be arraigned in the coming days.\nInspector Joseph Xerri prosecuted.", "comment_count": 0, "id": 1475}, {"keywords": "", "author": "", "article_body": "Radio veteran Terry Farrugia has lost his battle to leukaemia.\nMr Farrugia, 48, had been diagnosed with Acute Myeloid Leukaemia in 2016, when he was hospitalised and given his first line treatment of four rounds of chemotherapy.\nThe aim was to wipe out the faulty bone marrow and hopefully allow healthy tissue to grow back. Meanwhile, doctors started looking for a bone marrow donor to provide more security in ensuring that the cancer does not return.\nUnfortunately, there was no suitable donor on the international database.\nBy then, Mr Farrugia had gone into remission and was sent home in September 2016.\nAfter just over a year, Terry and his family received the dreadful news that the disease had returned.\nThe next line of treatment was more aggressive chemotherapy and this time a bone marrow transplant was not an option, but a must.\nThe father of two boys, aged eight and 10, underwent a transplant in March of 2018 and this involved more chemotherapy and some radiotherapy.\nHowever, soon after, it was confirmed that Mr Farrugia had relapsed. Four months after being given the more targeted chemotherapy drug, Mr Farrugia relapsed again.\nLast January, a number of media personalities had started to crowdfund for treatment, through the Terry Time campaign.\nHis legacy on radio\nMr Farrugia started his radio career on Island Sound Radio in the early 1990s with his popular programme Terry Time. He then moved his radio show to Bay Radio, where he eventually ventured into management, later moving on to 88.7 Vibe FM. He has been running Vibe FM since 2009.\nIn 2004 he was instrumental in launching radio awards that recognised local talent, the BMAs, with all proceeds raised being shared among a number of children’s charities.", "comment_count": 7, "id": 1476}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Prime Minister Joseph Muscat’s undeclared ambitions to secure a top position in an EU institution were severely dented in last Saturday’s European elections, according to sources in Brussels.\nThey noted that the unexpected excellent performance of the Socialist party in Spain catapulted their chances of securing a nomination for one of the EU’s top four positions. “That may leave Muscat and other Socialist leaders with similar ambitions out in the cold”, the sources commented.\nFollowing an informal EU summit meeting last Tuesday, in which the 28 EU leaders had their first opportunity to discuss the MEP election results the EU posts up for grabs, the sources said that, so far, “Muscat’s name is not on the radar”, despite his party’s outstanding performance in Malta.\n“Although it is very early days, it seems it will be very difficult for Muscat to manage to get any of the top EU posts. Horse-trading between the leaders and the European Parliament has just started but, at least so far, the Maltese Prime Minister’s name does not feature,” a senior diplomat, who insisted on anonymity, said.\nJoseph Muscat’s name is not on the radar\nThe Times of Malta is also informed that, during his intervention at the summit, Dr Muscat expressed himself against the system of the Spitzenkandidat, whereby the leader of the largest political force winning the MEP elections is elected president of the European Commission.\nThis position is shared by other heads of government, including Hungary’s Victor Orban, and, if adopted, would make the consideration of Dr Muscat’s name possible because the European People’s Party’s Manfred Weber and the Socialist’s Frans Timmermans would not automatically be the only two in the running.\nHowever, according to the sources, Madrid remains by far Dr Muscat’s main problem.\n“The Spanish Socialists have already pushed Foreign Minister Josep Borell, a former president of the European Parliament, as their preference for the post of the EU’s High Representative for Foreign Affairs, succeeding Federica Mogerini,” the senior diplomat said.\nAlthough things are still fluid, the Socialists are only likely to be able to secure one of the four top positions. The others will most probably go to the nominees of the European People’s Party, the Liberals and the Greens, the latter two having performed well in last weekend’s elections.\nDr Muscat avoids answering questions on whether he was interested in Ms Mogerini’s job, however, the Brussels sources noted that this was an open secret among EU diplomats.\nSo far, no names have officially been mentioned in relation to the vacant posts: president of the European Commission, president of the European Council, president of the European Parliament and the high representative. Consultations are expected to take centre stage before the next EU summit scheduled for the end of June, when an agreement is expected.\nAnother option\nThe Prime Minster had another option: nominating himself as Malta’s next European commissioner, succeeding Karmenu Vella, sources close to the government said.\nA spokesman for the Prime Minister told the Times of Malta “Dr Muscat is not interested in nominating himself to the post”. However, the sources said all options were left open and the commissioner nomination could well be a last option “if all the other doors are closed”.\nDr Muscat has been insisting he did not intend heading the government and the Labour Party beyond two legislatures and would resign before the next general election. Still, many party loyalists want him to stay and are in fact raising a petition asking him to change his mind.\n“That petition will always come in handy, if need be,” the government sources said.", "comment_count": 233, "id": 1477}, {"keywords": "", "author": "Claire Caruana", "article_body": "Secondary school students are still unsure if they will be sitting for their maths and Maltese exams in the coming weeks as talks between the government and the teachers’ union have stalled.\nThe uncertainty stems from directives issued by the Malta Union of Teachers, which ordered teachers and heads of department of the two core subjects to refrain from providing or correcting exam papers.\nConcerned parents who spoke to the Times of Malta insisting on anonymity for fear their children might face repercussions, said they assumed that, following the half-yearly exams in February, the issue had been resolved. At the time, the education directorate had stepped in, compiling papers from past exam questions and some new material.\nAccording to the parents, however, the exam papers had not covered the entire syllabus.\nNow, just days from the start of the final examinations, it has emerged that the union and the government have yet to resolve the issue and the directives remain in force.\nThe parents pointed out they only found out about the situation when they sat down with their children to do some revisions in preparation for the exams.\n“I asked my son whether he needed any help with his Maltese. It was then that he informed me his teacher was telling students they were likely not to have a proper exam once again,” one mother said.\nIt was then that he informed me his teacher was telling students they were likely not to have a proper exam once again\nThis was soon confirmed by the head of the school who, while insisting that he could not divulge much information, told her the exam papers for the two subjects were yet to be sent to the school.\nAnother parent recounted a similar experience. After finding out about the problem, the parent called the Education Department and was initially told no information could be given. Pressing further, the parent was informed “there is an issue” with the two core subjects.\nNot having final exams for the two core subjects was especially worrying for Year 10 (Form 4) students because end-of-year exams were one of the last chances they had to be tested before they sat for their O level examinations.\nAttempts by the Times of Malta to seek comments from heads of school proved futile.\nThe Malta Union of Teachers confirmed that the directives were still in force, warning they would remain, even though the exams were around the corner, if the situation in schools did not change.\n“The situation has not only remained the same but it has deteriorated. Teachers of various subjects, mostly maths and Maltese, have for over a year been assigned more lessons than indicated in the agreement with the government,” the union said in a circular to members.\nIt said that though the Education Ministry had repeatedly insisted the union was painting a wrong picture of the situation, information coming from teachers themselves confirmed the matter.\nBecause of the many lessons teachers had to handle, they were also struggling to implement changes introduced by the education authorities themselves, the union noted. This, it added, had an impact on the quality of education being provided.\nBoth the permanent secretary and the Education Ministry were informed about this and on how angry teachers are because the ministry was saying the issue would be addressed while facts continued to prove otherwise, the MUT commented.\nA string of questions on the matter sent to the Education Ministry last week, including what plans were in place to ensure students would not be forced to miss their exams, remained unanswered at the time of writing. In a curt reply, a spokeswoman only said the authorities were “still in discussions on the directive and the issues which led to it”.", "comment_count": 10, "id": 1478}, {"keywords": "", "author": "Jacob Borg", "article_body": "Bank of Valletta was preparing for the possible pull-out of ING, its sole remaining provider of correspondent banking services in US dollars, an official confirmed.\nThe official, who asked not to be named, said mitigating measures were being taken over fears that the Dutch bank could pull the plug on its correspondent banking services to Malta.\nING is the last remaining provider of correspondent banking services to BOV in US dollars. Deutsche Bank terminated its servicing of such transactions two years ago. \nING was fined €775 million in September after admitting that criminals had been able to launder money through its accounts. Ever since, it has been on a de-risking exercise and correspondent banking relationships with small jurisdictions seen as high risk are being severed.Lobbying efforts were under way to try to persuade ING not to pull the plug on Malta\nMalta’s willingness to combat financial crime has been called into question over recent years, fuelled in part by Prime Minister Joseph Muscat’s refusal to dump his chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi over their involvement in the Panama Papers scandal.\nING did not respond to a request for comment from the Times of Malta.\nThe BOV official who spoke to this paper said other small banks in Europe were facing the same problems with their correspondent banks. Although no formal word had been received by BOV about an ING pull-out, the official said the bank was in contact with certain second-tier American banks over the possibility of them providing correspondent bank services.\n“We are preparing for all eventualities and will find ways and means to widen the pool [of US dollar transaction providers],” he said.\n\nBOV is undertaking its own de-risking exercise and has closed down many US dollar accounts viewed as being high-risk.\nBanks clearing dollar transactions can fall foul of tough American anti-money laundering laws even when servicing transactions on behalf of another institution they could be providing correspondent banking services to.\nA BOV spokesman declined to comment on what he termed as an issue of a “sensitive and confidential nature”.\nHe said BOV was not in a position to give information concerning its correspondent banking relationships. “When we are in a position to disclose publicly, this will be done through the official channels as applicable to an institution listed on the Malta Stock Exchange.\n“We would like to reassure the public that the bank is taking all necessary measures to ensure that Bank of Valletta will remain a strong and stable institution in the best interest of our customers and stakeholders”, the spokesman said.\nA government official briefed on the situation said lobbying efforts were under way to try to persuade ING not to pull the plug on Malta. It is understood that the matter was also discussed at a Central Bank of Malta meeting earlier this week, though this could not be confirmed. A spokeswoman for the Central Bank declined to comment.\nFinance Minister Edward Scicluna said when contacted he had discussed the matter with his Dutch counterpart on the sidelines of a recent EU meeting and had also presented him with a letter on the subject. He said the latest report by the OECD showed that correspondent banking services were down by more than 20 per cent worldwide.\nFinancial expert Paul Bonello told the Times of Malta EU directives placed a lot of responsibility on correspondent banks. Bad press about Malta, whether justified or not, could not continue to be treated like water off a duck’s back.", "comment_count": 85, "id": 1479}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe Times of Malta reports that Bank of Valletta may lose its dollar transactions provider. It also says that an agreement has been signed to investigate the feasibility and cost of a pedestrian bridge from Sliema to Valletta.\nThe Malta Independent reports on its debate between PN deputy leader David Agius and his counterpart in the Labour Party Chris Fearne. It also explains why conflicting versions of an incident between a man and someone who allegedly sold drugs to his son was thrown out of court.\nL-Orizzont leads with a report on the PN \"humiliation\" in the local council elections, to which it dedicates its front page.\nIn-Nazzjon reports on the AFM's rescue on 75 migrants.", "comment_count": 0, "id": 1480}, {"keywords": "", "author": "Ivan Martin", "article_body": "Greenhouse gas emissions dropped across the EU over the past three decades but not in Malta.\nAccording to a new report published on Thursday by the European Environment Agency, Malta is one of six EU member states to register an increase in greenhouse gases compared to 1990.\nThe agency’s Greenhouse Gas Inventory Report found that between 1990 and 2017, Malta’s total emissions grew by 2.3% while the EU as a whole saw a drop of 23%.\nTotal emissions across the EU decreased by 1,327 million tonnes since 1990 (or 23.5%), reaching their lowest level during the period in 2014.\nAnother report published earlier this month listed Malta as having posted the second highest increase in emissions from 2017 to 2018. According to that report, the island registered an increase of 6.7%, second only to Latvia, up 8.5%.\nGreenhouse gas emissions are influenced by factors such as climate conditions, economic growth as well as the size of the population, transport and industrial activities.\nThe island has been lagging far behind its targets\nIn Malta, these emissions have been largely attributed to transport and traffic but also to a dependence on heavy fuel oil for energy production, which was phased out in recent years.\nThe latest report notes that Malta was the only EU country not to reduce nitrogen oxide emissions, which is directly linked to fuel combustion in cars.\nThe island has been lagging far behind its greenhouse gas reduction targets. While most member states have been cleaning up their air, in 2017, Malta actually registered a substantial increase of 12.8%, the highest across the EU.\nAccording to the EEA’s report, although traditionally economic activity was tied to global emissions, there has been a “progressive decoupling” of economic activity, measured in gross domestic product (GDP), and greenhouse gas emissions compared to the 1990s.\nThe EU’s overall reduction in greenhouse gas emissions over the 27-year period was due to a variety of factors, including the growing share in the use of renewables, the use of less carbon-intensive fuels and improvements in energy efficiency, as well as structural changes in the economy and the economic recession.\nDemand for energy to heat households has also been lower, as Europe, on average, experienced milder winters since 1990, which also helped reduce emissions.", "comment_count": 81, "id": 1481}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A local gas supplier has been ordered to pay €146,335 by way of damages to a competitor in the liquid petroleum market after a court held that it had “illegally and fraudulently” sought to pass off the other supplier’s cylinders as its own.\nLiquigas Malta Ltd had instituted a civil action for damages in April 2015 against Easygas Malta Ltd, claiming that the respondents had overpainted thousands of green cylinders, distinctive of Liquigas, in the distinctive dark grey colour of Easygas.\nIn the course of the proceedings, the First Hall, Civil Court heard how Easygas had been withdrawing from the market cylinders belonging to its competitor, overpainting them in grey, re-filling them and selling them on the market.\nLiquigas argued that this abusive practice made it difficult for the company to certify the condition of the cylinders and to maintain a chain of responsibility in case of any accident involving gas cylinders.\nEasygas had pleaded that Liquigas was not the owner of the cylinders since legislative amendments in 2011 had altered the definition of ownership.\nHowever, the Court, presided over by Mr Justice Mark Chetcuti, concluded that the respondent company had put forward no evidence to rebut the claim that the applicant’s cylinders were being overpainted.\nThis abusive practice, whereby Easygas sought to convert Liquigas’s cylinders into its own, was in clear breach of property rights and obligations laid down by laws regulating the liquid petroleum sector, the Court declared.\nWhen calculating damages, the Court deemed the estimate provided by Liquigas Chief Financial Officer as “reasonable”, thereby fixing the compensation at €146,335 in respect of some 9441 overpainted cylinders as at February 20, 2019.\nThe Court ordered Easygas to pay this sum together with interest and costs.", "comment_count": 0, "id": 1482}, {"keywords": "", "author": "Ivan Martin", "article_body": "Cremation services can now be offered in Malta after the relevant law came into force on Tuesday.\nLabour MP Rosianne Cutajar, who spearheaded the move to introduce cremation, said in a tweet she was “honoured” to announce that her first Bill was now law.\n\nThe road to cremation has been a long one.\nIn 2014, the government had put forward a number of other suggestions including freeze-drying bodily remains using liquid nitrogen and the introduction of a conventional crematorium.\nDissolving corpses in chemical baths was among the solutions being considered to address the island’s overcrowded cemeteries. Known as alkaline hydrolysis, this method was announced as a possible funeral choice during public consultation on the planning authority’s new cemetery policy.\nThen, in 2015, the planning authority published a policy on cemeteries and, in November 2017, a debate at parliamentary committee level ensued.\nMs Cutajar said research indicated that a third of Maltese would consider an alternative to traditional burials.\nShe was “proud” that the reform had finally been translated into law.", "comment_count": 26, "id": 1483}, {"keywords": "", "author": "", "article_body": "The Nationalist Party’s executive committee will be meeting on Saturday at the party headquarters to discuss who should replace David Stellini in parliament.\nThe MP is stepping down to resume his old job in Brussels.\nMr Stellini was elected in a casual election from the 13th district (Gozo) after Marthese Portelli, who was returned from two districts, gave up that seat.\nThis means that his resignation will prompt a co-option, allowing the PN to select any person to be appointed as an MP.\nRead: Manoeuvring starts for David Stellini's seat in parliament\nKarol Aquilina, a former president of the PN administrative council and an MP seen as being in the Simon Busuttil wing of the party, suggested on Facebook that the PN should retain its current representation in Gozo by nominating Kevin Cutajar to take Mr Stellini’s place.\nMr Cutajar told the Times of Malta that he would speak on the issue on Friday.\nThere have been suggestions in the PN that the party could opt to return Jean-Pierre Debono to Parliament. He had resigned to make way for newly-elected party leader Adrian Delia to have a seat in the House and become leader of the opposition, and his possible co-option is being seen as returning the favour.\nMr Stellini, who also serves as president of the PN's administrative council, obtained 3,600 first-count votes in the MEP elections last weekend, but failed to win a seat.", "comment_count": 17, "id": 1484}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A mother was cleared of smuggling cannabis to her son in prison after a packet wrapped in transparent plastic was discovered inside the man’s rectum following a contact visit with relatives.\nMiriam Borg, the 60-year-old mother from Ħamrun, had been targeted by criminal prosecution for alleged possession and trafficking of cannabis following a visit to the Corradino Correctional Facility in March 2013.\nA strip search on the accused’s son, some minutes after his mother and other family members had left the premises, had yielded a small dark object, later certified as some 3.61 grams of cannabis resin.\nThe woman was summoned to the police headquarters where she was informed of the drugs discovered inside her son’s body and was told that he had claimed that she had been the one to smuggle them into prison.\nTestifying in the course of the proceedings, the woman had recalled how at the time she would visit her son twice a week, submitting to checks on every occasion.\nOn that particular date, when visiting with her husband, daughter, father and sister-in-law, the search had been more intensive than usual on account of drug finds inside prison at the time.\nWhen called by the police, the mother had been shocked at the news, even more so since she was not aware that her son took drugs.\nHowever, fearing that other family members would be arrested, she had falsely admitted to the smuggling and released a statement after refusing legal assistance.\nOn the strength of established case-law, that statement was discarded as evidence against the accused.\nTurning to other evidence put forward, the court, presided over by magistrate Natasha Galea Sciberras, observed that all family members visiting the inmate had been searched on that day and results were negative.\nThe prosecution had brought no convincing evidence to prove otherwise, the court said, adding that the general prison practice had been to search an inmate immediately after a contact visit.\nMoreover, the accused’s son had walked unassisted from the visitors’ hall to the main gate to his division once the visit was over.\nThe court further questioned whether it would have been possible for the inmate to stuff the drug inside his body while in the presence of his family, without necessarily manouevring in such manner as would have likely roused the suspicion of the prison officials on guard.In light of such circumstances, the court cleared the mother of all criminal liability.\nLawyer Robert Galea was defence counsel.", "comment_count": 0, "id": 1485}, {"keywords": "", "author": "Keith Micallef, Rosanne Zammit", "article_body": "Updated Friday 8am\nThe Labour Party won control of 16 local councils while the Nationalists took four as the vote-counting process of Malta's council elections entered the second day.\nA total of 94 councillors were elected on the PL ticket, 57 were from the Nationalist Party while two were independent.\n\nAfter the second day of vote counting, PL has a 60 per cent majority of votes, the PN stands at 37 per cent, while the rest are independent.\nLabour celebrated retaining hold over the Birkirkara council and narrowly winning San Ġwann while the PN retained its strongholds of Sliema, Lija, Mgarr, and Victoria during the counting on Thursday.\nLabour supporters celebrating their party's hold on Birkirkara. Video: Chris Sant Fournier\nLabour won the Birkirkara council 7 to 6, a result which is bound to disappoint PN leader Adrian Delia who had expressed his wish to win back the locality.\nVideo: Chris Sant Fournier\nIt also managed to retain Rabat and won San Ġwann, both 5-4. During the last legislature, the PN had a majority of seats in San Ġwann but not votes.\nLija's new mayor Anthony Dalli. He was previously mayor of Iklin. Photo: Keith Micallef\n\nPrime Minister Joseph Muscat tweeted about his party's success, saying that not only had it managed to hold all its councils, it also consolidated its vote throughout.\nThe first result out on Thursday was Lija, which the Nationalist Party won 3-2.\nThe new mayor will be Anthony Dalli, formerly the mayor of Iklin. Outgoing mayor Magda Magri Naudi failed to be elected.\nMsida mayor Margaret Baldacchino Cefai. Photo: Chris Sant Fournier\nKalkara's result which came in shortly after saw Labour win 4-1 as were the councils of Marsaxlokk, Għaxaq, Sannat and Xagħra, where the PN's only candidate got the highest number of votes. Gudja and Pietà were also won by Labour 3-2. Labour won Msida 5-4, Paola 5-2, Cospicua 6-1, Fgura and Marsascala 7-2, and Żabbar 9-2.\nThe PN did not just lose Għarb, where it previously held the majority, but only managed to elect one representative in the locality. The other four went to Għarb L-Ewwel - two, and the PL, also two. The highest number of votes were obtained by outgoing PN mayor David Apap, who contested under the Għarb L-Ewwel ticket.\nThe party, however, managed to retain Victoria, winning the council 4-3 and won Sliema 10-3. The PN increased its eight seats in Sliema to 10 as the council's seats increased from 11 in the last legislature to 13. The PN also won Mġarr 3-2. \nVideo: Chris Sant Fournier\nWhat future for PN's sole councillor in Xagħra\nThe PN's sole councillor in Xagħra, Kevin Cutajar, was asked to comment on the fact that he was reportedly one of the people after David Stellini's seat in Parliament. He said he would speak on the matter on Friday.\nThe Nationalist Party is convening its executive committee on Saturday morning to decide who to co-opt to replace Mr Stellini, who is stepping down to resume his old job in Brussels.\nJean Pierre Debono, who gave up his seat for party leader Adrian Delia's co-option to Parliament, is also after Mr Stellini's seat.\nSorting process\nThe sorting process in the second batch of local elections, voting for which was held last Saturday, started right at 5.30pm at the Counting Hall in Naxxar.\nThe votes for 21 localities will be counted on Thursday: Birkirkara, Cospicua, Għaxaq, Lija, Żabbar, Fgura, Gudja, Kalkara, Rabat, Victoria, Xagħra, Għarb, Mġarr, Msida, Marsascala, Marsaxlokk, Paola, San Ġwann, Sannat, Pietà and Sliema.\nLabour supporters celebrate their various victories in the council elections. Video: Chris Sant Fournier\nThe counting process started on Wednesday when the votes for 23 localities were counted. Labour got majorities in 16 of 23 councils, including Valletta for the first time since councils were set up, and St Paul's Bay. The Nationalist Party held on to St Julian's and made an eight per cent gain in Nadur.\nRead: Council results so far: no big surprises but some notable changes\nThe votes are being counted electronically, reducing the process of vote inheritance, which used to take up to days, to minutes.\nThe last round of vote counting takes place on Friday. \nElected councillors\nLija: Anthony Dalli (mayor), Donio Cini, Daniel Mallia - PN; Lorraine Farrugia, Joseph Zahra - PL\nKalkara: Wayne Aquilina (mayor), Vincent Bongailas, Speranza Chircop, Cristopher Bruno - PL; Maria Sultana - PN\nGudja: Marija Sara Vella (mayor), Mario Calleja, Maria Micallef - PL; Mark Anthony Sammut, Stefan Caruana - PN\nMarsaxlokk: Steven Grech (mayor), Elenia Desira, Daniel Zerafa, Stephen Caruana - PL; Janice Chetcuti - PN\nGħaxaq: Darren Abela (mayor), Christine Dalli, Andreas Gatt, Keith Fenech - PL; Rose Agius - PN\nGħarb: David Apap, Miriam Borg - Għarb L-Ewwel; Tonio Mifsud, Joseph Mizzi - PL; Louis Apap - PN (mayorship undecided)\nXagħra: Christian Zammit (mayor), Stefan Bajada, Aaron Agius, Victor Curmi -PL; Kevin Cutajar - PN\nMsida: Margaret Baldacchino Cefai (mayor), Romina Galea, Jean-Claude Borg, Nicholas Joseph Chircop, Emanuel Brincat - PL; Charles Selvaggi, Maurice Agius, Alfred Farrugia, Judy Sciberras - PN\nSannat: Philip Vella (mayor), Frances Galea, Clayton Tewma, Steven Gauci - PL; Joseph Bajada - PN\nVictoria: Josef Schembri (mayor), Brian Azzopardi, Marcell Tabone, Maria Portelli - PN; Michael Buttigieg, Joseph Debrincat, Charlie Hili - PL\nPaola: Dominic Grima (mayor), Darren Lynch, Steven Axisa, Yvonne Arqueros, Neville Camilleri - PL; Ivan Bartolo, Rita Delezio - PN\nRabat: Sandro Craus (mayor), Matthew Chetcuti, Doris Coleiro, Alexander Sandro, Christopher Farrugia, Kris Grech - PL; Ian Mario Vassallo, Nazju Cassar, Karl Muscat, Rudolph Grima - PN\nSan Ġwann: Trevor Fenech (mayor), Anthony Mifsud Bonnici, Joan Farrugia, Violet Bajada, Tania Borg, Trevor Fenech - PL; Joe Aquilina, Etienne Bonello du Puis, Dominic Cassar, David Dalli - PN\nŻabbar: Jorge Grech (mayor), Bernice Farrugia, Mark Grech, Ghislaine Bongailas, Angelo Scicluna, Joseph Vella, Angel Gwyn Louiselle Camilleri, Joseph Agius, Patrick Barbara - PL; Joseph Buttigieg, Anna Calleja - PN\nCospicua: Alison Zerafa Civelli (mayor), Marco E. Agius, Noyah Spiteri Hammett, Melanie Agius, Johann Scerri, Martin Vella - PL, James Cauchi - PN\nFgura: Pierri Dalli (mayor), Clayton Portelli Cascun, Raymond Deguara, Toshera Schembri, Ryan Ellul, Mario Fava, Adrian Tanti - PL; Charles Bonello, Mark Lombardo\nSliema: Anthony Chircop (mayor), Graziella Attard Previ, John Pillow, Anthony Debono, Pierre Portelli, Vivien Galea Pace, Paul Radmilli, Leli Borg, David Soler, Kevin Wain - PN; David Muscat, Wallace Vella Baldacchino, Illona Fenech - PL\nMarsascala: Mario Calleja (mayor), Janice Falzon, Carmel Mifsud, Patrick Camilleri, Mary-Rose Mifsud, Ryan Portelli, John Schembri - PL; John Baptist Camilleri, Errol Cutajar - PN\nPietà: Keith Tanti (mayor), Zoya Attard, Anthony Camilleri - PL; Mark Pisani - PN, Josef Fitzpatrick - PN\nBirkirkara: Joanne Debono Grech (mayor), Rita Borg, Kaylocke Buhagiar, Karl Cutajar, Nancy Aquilina, Owen Patrick Attard, Sephora Cutajar - PL; Michael Fenech Adami, Justin Schembri, Antoine Attard, Deborah Mifsud, John Mizzi, Marie Claire Zammit Bonello - PN\nMġarr: Paul Vella (mayor), Wistin Vella, Odette Muscat - PN; Clayton Gauci, Tiziana Borg Busuttil - PL", "comment_count": 64, "id": 1486}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A cleaner’s confession that he had given an electronic access key to a man intending to rob office premises led to the thief’s convinction.\nMark Lawrence Rizzo, now 35, was found guilty of stealing electronic office equipment 10 years ago and was placed under probation after the court was informed that the accused had since addressed his personal problems and found a steady job.\nHe had entered a company office at Gżira on three consecutive afternoons back in September 2009, gaining access by means of a plastic electronic key used by the cleaners, complete with its alarm code, which had gone missing some two monhs previously.\nA report about the missing items had reached the Sliema district police on September 23 with the list comprising a 47” TV, six computers, eight monitors, a laptop and a docking station, worth a total of some €7,500.\nThere had been no signs of any break in and investigators zoomed in on two people working for a cleaning company, who had been on duty at the time that the key had disappeared.\nOne of these confessed to having passed on the key, together with the alarm code, to the accused in exchange for “some money”. The cleaner was prosecuted and sentenced.\nA third party, who confessed to having bought a TV set from the accused for €900, was also convicted.\nAlthough the accused denied his involvement in the thefts, the court concluded that there was no reason for it to dismiss the testimony of the cleaner which had been “unequivocal”, supplying details as to where, when and how he had passed on the key and code to the accused.\nIn the light of all this, the court, presided over by magistrate Josette Demicoli, placed the accused under an 18-month probation period.\nInspector Saviour Baldacchino prosecuted. Lawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 1487}, {"keywords": "", "author": "", "article_body": "More than €127,500 were discovered by customs officials on Thursday during a routine cash control exercise at Malta Airport’s departures lounge.\nCustoms said in a statement the discovery was made by its Anti Money Laundering team.\nA Libyan national, who was embarking a flight to Istanbul, was stopped for cash control and submitted to an inspection on his person, luggage and personal belongings.\nHis hand luggage was found to contain a false bottom, where €127,506 in large denominations were concealed.\nCustoms said this was the second largest undeclared cash seizure made by its Anti Money Laundering section, making 2019 a record breaking year in terms of undeclared cash seizures.\nThe police were immediately informed the police and the passenger was arrested pending investigation. In line with European and national law, €10,000 were returned to the passenger and the rest withheld.\nJust two days ago, a Ukranian national travelling to Istanbul was found carrying €10,559 and agreed to an out of court settlement, forfeiting €559.", "comment_count": 10, "id": 1488}, {"keywords": "", "author": "Denise Grech ", "article_body": "Newly-elected Żebbuġ councillor Steve Zammit Lupi on Thursday admitted to being \"overwhelmed\" by the support he has received from people in his locality which enabled him to obtain more than a quota in first-count votes.\nAlthough he contested as an independent, without any support from the two main political parties, Mr Zammit Lupi, an environmentalist, was elected with 947 votes on the first count. \n\"The response has been beyond my expectations,\" he told Times of Malta. \nHe believes his election could be a message to the two-party system - that, on a local level at least, people were ready to put candidates and ideas before partisan politics.\n\"That is the way it should always be,\" he said.\n\"Żebbuġ is small and I thought that [contesting independently] would be the best way to breach the political spectrum. I was able to focus on policies, rather than compete with others within my own party or in another party,\" Mr Zammit Lupi added. \nThe young councillor, who turns 24 in August, admitted he did not expect to be elected, submitting his name at the eleventh hour and announcing his campaign just four weeks before the election. \nNow that he has been elected, he hopes to act as a mediator between the two five Labour and three Nationalist councillors within his locality and to accomplish the over 70 proposals that made up his manifesto. \nMr Zammit Lupi's uncle, outgoing Partit Demokratiku leader Godfrey Farrugia, had also successfully contested local council elections as an independent candidate in 1993, where he went on to serve as mayor of Żebbuġ. He was again elected in a subsequent election.", "comment_count": 19, "id": 1489}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Businessman Mark Weingard has unveiled a €2,000-a-night suite at his Iniala Hotel on St Barbara Bastions in Valletta, saying he was convinced that Malta was beautiful enough to attract people who could spend that kind of money.\n“Everyone says that pop stars, prime ministers and multimillionaires don’t want to come here but I think that the real problem is that they would if they had somewhere to stay. And I believe that Iniala will fill that gap,” he said during a media tour of the two-bedroom suite of the hotel which will be opened in the near future.\nMr Weingard originally bought the building intending to use it as his home.\nMr Weingard bought his first building on the street back in 2012, originally intending to use it as his home. He then bought the adjoining building that used to serve as the headquarters for Mediterranean Bank (as MeDirect was then called) and decided to wait to buy three others – including ones with access on East Street – and turn them into a hotel. It took him three years to finalise the deals and work on them is now in full swing.\nThe hotel cluster will be made up of just 23 suites and a few apartments, with the penthouse suite with its two private pools available for €3,000 a night. The cluster also has a spa with indoor heated pool, and gym.\nThe basement vault has been transformed into a spa with heated indoor pool. File photo.\nArtist's impression of what it will look like.\nMr Weingard – who first made his mark on Malta with his pop-up restaurant in Valletta – also announced that Iniala’s rooftop restaurant would have Andrew Borg, former chef at Risette, as its executive chef.\nGeneral manager Danny Drinkwater said that the new hotel would tap into the network of agents already familiar with Iniala’s award-winning flagship property in Thailand.\n“We will be adopting the same ethos, with seamless service from touchdown to take-off,” Mr Drinkwater promised.\nTourism Minister Konrad Mizzi, who was present for the walk-around, said the government was committed to attract more investors like Mr Weingard, describing him as a first mover but promising that he would be followed by others.\nEntpreneur Mark Weingard (right) revealed that Andrew Borg would be the executive chef of the rooftop restaurant.\n“We as a government can continue to do our part to support his efforts by upgrading the tourism product,” he vowed.\nThe hotel is just part of a portfolio that Mr Weingard has accumulated in Malta since 2012, with over €100 million equity invested so far, a considerable chunk of the Iniala Group’s €150 million worldwide.\nMr Weingard still has plenty of projects up his sleeve, including a number of other properties being done up in Valletta, such as a building along Hastings, and Canberra House on St Paul’s Street, Valletta.\nHe also intends to carry on with his already strong philanthropic work, which has already seen €400,000 ploughed into good causes – in particular through the Social Impact Awards that he has run for four years with the Gasan Foundation.\nHe is now committing “at least” €100,000 a year for the Valletta community, and is prefacing that with a €15,000 research project commissioned to the University of Malta which will study what the needs of the residents of the capital city.\nIn spite of the enthusiasm with which he presented his long list of projects, Mr Weingard was most passionate when he talked about his next one: he will also set up an academy for philanthropy – the Academy of Givers.\n“This will be an even bigger project than this one,” he promised.", "comment_count": 30, "id": 1490}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Valletta is to be branded as a tourist destination in its own right, Tourism Minister Konrad Mizzi announced on Thursday, saying that research showed that the brand was even more powerful than Malta’s.\n“Our research has shown that Valletta is very well recognised. As a separate brand it will complement that of Malta and Gozo,” he said.\nThe minister also said that the Malta Tourism Authority was currently drafting its vision for 2025 and beyond.\nDr Mizzi was speaking at the unveiling of a €2,000-a-night suite at Iniala’s new hotel on St Barbara Bastion in Valletta.\n\nHe also revealed that a preliminary agreement has been signed with the UK-based architectural firm led by Konrad Xuereb for initial studies into a pedestrian and cyclist bridge between Tigné Point in Sliema and the gunpost area in Valletta.\nHe told Times of Malta that the agreement covered designs, an estimation of the costs and the technical feasibility – as well as whether there would be any EU funding available to tap into.\nDr Xuereb’s proposal stemmed from his experience heading a bridge engineering team responsible for the design of pedestrian bridges overseas as part of community regeneration projects.\nHe first proposed the idea in 2017 and his article had gone unexpectedly viral, as Facebook pundits debated the merits and pitfalls of the project.\nThe proposal also caught the imagination of those who recalled a 1960s proposal for a cable car between Sliema and Valletta.\n“Connectivity is key to regeneration, and this is why I believe that such a pedestrian bridge could contribute to improving the urban quality in lower Valletta,” Dr Xuereb had explained to Times of Malta two years ago.\n ", "comment_count": 2, "id": 1491}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated with Delia's tweet\nRoberta Metsola has filed a police report over a Facebook post warning the PN MEP that she could end up like Daphne Caruana Galizia.\nA Facebook user with the name Josef Farrugia posted on the social network: “Be careful as you will end up like Galizia” under a One news article headlined 'Metsola was in Malta at the time that the President met the elected MEPs.'\nMs Caruana Galizia was blown up in a car bomb that went off as she was driving away from her Bidnija home in October 2017.\n\n\"Such hate speech starts with dishonest spin. The Labour Party's propaganda channel chose to publish a story about MEP Metsola, knowing full well that she had an urgent flight to catch, and the timing of the President's appointment, with traffic and airport considerations, was impossible for her,\" a spokesman said when contacted.Roberta Metsola\nLabour knew this fact and yet it still chose to spin it dishonestly, he added.\n\"One thing leads to another. This story, pushed on every Labour Party medium, escalated the matter further and led to comments equating Dr Metsola's future with Ms Caruana Galizia's assassination.\n\"Although Dr Metsola may not have considered this to be a death threat as such, this type of hate speech - in this case triggered by One News - is not acceptable.\"\nThe case was now in the police's hands, he said.\nIn a similar incident last year, a 66-year-old was sentenced to a six-month jail term suspended for one year for posting a Facebook comment saying that Dr Metsola should be burned alive.\nEmmanuel Navarro had written: \"All of you, especially you [Metsola], you're a national traitor. It's not a condemnation you deserve, but to be burnt alive, you dung.\"\nPN leader Adrian Delia pledged his full support to Dr Metsola. ", "comment_count": 147, "id": 1492}, {"keywords": "", "author": "", "article_body": "A man accused of having planted a bomb which killed an innocent passer-by in Żejtun in 2005 has had his life sentence confirmed by an appeals court.\nThe case stemmed from a dispute Azzopardi had with the partner of his late brother.\nHis brother had been killed in 2001 and Azzopardi was miffed that his brother had left all his inheritance to his partner and children.\nThe court heard how he placed a bag carrying a powerful bomb alongside the woman's parked car in Żejtun while she visited her mother. The home-made bomb had a firing switch attached to a radio receiver similar to the type used on remote control cars. One kilogram of explosive material was contained inside a small fire extinguisher and bullets were also include to increase potency.\nREAD: Court hears details of home-made bomb which killed woman in Żejtun\nA woman, Theresa Grima, who was watching Azzopardi from the roof, went down to move the bag to a nearby construction site, thinking it contained rubbish. She was helped by another woman, Angela Bondin, because it was heavy.\nAs the two women chatted, the bomb blew up, killing Bondin and seriously injuring Grima.\nThe appeals court dismissed arguments by Azzopardi that the witnesses were inconsistent. It also gave much weight to CCTV showing him driving in the area. It also dismissed claims that he had been in Cospicua at the time. \nThe court said the life sentence imposed by the first court was deserved given the gravity of what Mr Ellul had been found guilty of. The court said it could not but express its disgust at Mr Ellul's criminal actions.\nTo achieve his shameful aims, he had used methods which could not only harm his intended target and her children, but also other persons. As a result an innocent woman had been killed and another seriously injured. He deserved no clemency, the court said.  \nRead: Żejtun murder trial: Witness changes his version, denies being asked to kill woman\nRead: ‘Bomber who killed innocent woman wanted to strike again’\n ", "comment_count": 0, "id": 1493}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A father who was accused of attempting to injure the man who allegedly furnished his son with drugs has been cleared by a court for lack of evidence. \nThe incident happened in Cospicua in April last year when Joseph Ellul spotted his son’s suspected drug supplier seated inside a BMW 530 Sport, and allegedly rammed his VW Polo at him. The crash was followed by a heated argument.\nThe BMW driver, Joseph Brignione, filed a police report saying he had been chatting on his mobile phone when Mr Ellul drove past and suddenly reversed “gas down” into his car. He claimed that Mr Ellul had then approached him wielding “a green metal bar”.\nMr Ellul gave a conflicting version, claiming that he had drawn up alongside Mr Brignione’s car and had angrily told him, “Stop selling synthetic [drugs] to my son!”\nAs he was about to get out of his car, the other man had sped off, the BMW scraping against his VW Polo.\nThe following day, the police received a report of another incident claiming that Mr Ellul had driven his Polo at Mr Brignione’s father who had been riding a Kymco Agility scooter in Vittoriosa.\nThe alleged victim had claimed that while driving towards Kalkara, he had sighted Mr Ellul in his Polo. A while later he heard loud screeching brakes and swerved suddenly, narrowly avoiding being hit by the accused’s car.\nMr Ellul was ultimately charged with attempting to kill Mr Brignione’s father, as well as attempting to injure the younger man, in addition to a number of other charges stemming from the two incidents.\nMagistrate Donatella Frendo Dimech observed that while the case pivoted upon conflicting versions, those given by the two alleged victims were not corroborated by the evidence put forward.\nThe elder of the victims had spoken of “loud screeching brakes,” and yet police had found no brake marks on site.\nThe court concluded that Mr Brignione’s father was not credible and his version was not “safe and satisfactory.”\nThe same applied to Mr Brignione who first said that he had been on the passenger seat and later said he had been on the driver’s side when the accused slammed his car into the BMW.\nHe had also claimed that Mr Ellul had been armed with a metal bar, a fact denied by the accused. Moreover, the police had never traced the weapon.\nThe alleged victim had also failed to reply to questions about his relationship with Mr Ellul's son. “His silence and reluctance impinged upon his credibility,” the court remarked, expressing doubt as to the veracity of information given to the police.\nWhilst concluding that the more serious charges had not been proved, the court found Mr Ellul guilty of causing voluntary damage to third party property and of breaching the peace, placing him under a two-year probation period.\nThe accused, concerned for the well-being of his son, had likely let paternal instinct and love get the better of him, the court observed when meting out punishment, also noting the man’s clean criminal record.\nThe court ordered the Police Commissioner to investigate Joseph Brignione, his sister and her boyfriend, registered owner of the BMW, who appeared to have lied in their testimony to hide the fact that the alleged victim had been driving without a licence and insurance cover.\nLawyers Arthur Azzopardi and Rene’ Darmanin were defence counsel.", "comment_count": 0, "id": 1494}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta remains among the best countries worldwide for children’s well-being though it has registered only slight progress in the past two decades, according to a major report.\nSave the Children said in its Global Childhood Report that conditions had improved in 173 out of 176 countries, with Singapore ranking as the country that best provides for children.\nWith 961 points out of a possible 1,000, Malta was ranked 32nd, placing among countries where very few children missed out on childhood because of sickness, deaths, child marriage, early pregnancy or no schooling.\nThe ranking places Malta above several developed countries, including the US, Russia and China, but behind all EU member states with the exceptions of Bulgaria and Romania, which both ranked lower.\nMoreover, Malta’s relative progress since 2000, a slight seven-point improvement, was among the slowest in the world. Only five countries had smaller gains and three regressed.\n690 million children still missing out on their childhood\nThis relatively slow progress meant Malta was leapfrogged in the rankings by eight EU member states (among other countries) that had been ranked lower two decades ago.\nGlobally, Save the Children estimated that 690 million children were still missing out on their childhood, down from 970 million in 2000.\nSierra Leone, Rwanda and Ethiopia were cited as countries that had significantly improved the lives of children over the past two decades.\nThe NGO found that child deaths dropped and there were 49 million fewer stunted children, with China and India accounting for more than half of the global decline.\nOf the eight indicators used by Save the Children to measure progress for children, only one was on the rise ‒ the number of displaced children from conflict. Some 420 million children live in conflict zones, more than double the number in 1995.\nAfter Singapore, Sweden, Finland, Norway, Slovenia, Germany, Ireland, Italy, South Korea and Belgium were listed as the top 10 countries where children are the most protected.\nThe Central African Republic ranked last at 176, just below Niger and Chad.\n“While progress has been remarkable, we now need to ensure every last child receives the childhood he or she deserves,” Save the Children CEO Carolyn Miles said.\n“These findings make a powerful case for more investment in child-sensitive development – from strengthening legal frameworks, to improving health systems, to empowering teenagers to make life choices that set them on a path to realise their full potential. It all counts,” she noted.", "comment_count": 13, "id": 1495}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "The first local council results on Wednesday did not produce much in terms of surprises, but there were a few points that will go down in the history books.\nThe Labour Party won control of the Valletta council for the first time.\nAnd Carlos Zarb, 17, was elected on the locality of St Paul’s Bay - he is the youngest-ever councillor.\nIn Zebbuġ, an independent candidate, Steve Zammit Lupi was elected on the first count with almost 1,000 votes, just four weeks after the environmental campaigner declared himself a candidate. He appeared to have taken almost all of his votes from the PN.\nThe Labour Party retained its control of Żebbuġ and increased its share of the votes by five percentage points to 58.8 per cent.\nPL retained all the councils in this first day of counting, adding Valletta and St Paul’s Bay to its tally.\nIt had hoped to gain control of Nadur, which it had missed by a whisker in the last elections. But the Nationalist Party recorded its best gains here – an increase of 8% in its support consolidated Edward Said, Chris Said’s brother, as mayor. The PN also enjoyed some success in Għajnsielem, where its support grew to 68 per cent from 52.7% in 2015.\nLabour had also hoped to win tiny Fontana. It actually won a majority of votes there but missed out on a third seat, reportedly by four votes, when the preferences were counted.\nThe party had hoped to make significant gains in St Julian’s, but made a slight gain – from 34% last time to 35.7% now.\nPL gains across the board\nThe counting process started after the MEP elections, which Labour won by 42,656 votes over the Nationalist Party.\nRead: Official results out, Labour lead trimmed to 42,656\nLabour’s gains were practically across the board, including 4% in the PN stronghold of Balzan. \nIn Pembroke, despite widespread anger over the db project, Labour actually increased its share of the vote to 60 per cent from 54.7 per cent in 2013. In Ta’ Xbiex, its share of the vote rose from 60.3% to 62.5 per cent.\nIn St Paul’s Bay, Labour achieved a majority of 50.1 percent from 46.88 per cent when the election was last held there in 2015.\nIn Valletta, the PL raised its share of the vote to 53 per cent from 48.4% in 2013.\nSome new mayors were elected even is the councils did not change colour. Of the 23 localities counted so far, Labour will have 11 new mayors.\nIn Żurrieq, long-serving mayor Ignatius Farrugia saw his post taken by Rita Grima, who got more 166 more votes than him, although both were elected on the first count.\nIn Iklin, possibly the council with the least vote movement in percentage terms, Nationalist candidate Dorian Sciberras will succeed long-serving Nationalist mayor Anthony Dalli, who this time stood for election in Lija.\nAlbert Buttigieg, formerly deputy mayor, will be the new mayor of St Julian’s, replacing Guido Dalli, having won more votes than him.\nSimilarly in Mellieħa, deputy mayor Dario Vella won more votes than mayor John Francis Buttigieg and replaces him.\nIn St Paul’s Bay, outgoing mayor Graziella Galea got more votes than any other Nationalist candidate so far, at 1,688, but since her party lost the vote there, she will be replaced by Alfred Grima.\nThe vote-counting continues on Thursday and Friday. Localities of particular interest to watch out for on Thursday are Birkirkara and Sliema.", "comment_count": 29, "id": 1496}, {"keywords": "", "author": "", "article_body": "Updated\nA 23-year-old worker was grievously injured when he fell from a height of two storeys at a construction site in Sacred Heart Avenue, St Julian's, on Thursday.\nThe accident happened at 10.55am.\nHe was assisted by members of the Civil Protection Department and was taken to hospital by ambulance.\nAnother was slightly injured.\nThe police are investigating.", "comment_count": 0, "id": 1497}, {"keywords": "", "author": "", "article_body": "Seven co-owners of a Senglea apartment, requisitioned in late 1986 and subsequently demolished as part of a slum-clearing project to make way for social housing, were awarded €34,000 in damages and expenses.\nThe owner told the European Court of Human Rights the property, which they had inherited, had been demolished at some point between March and September 1989. They took the case to Strasbourg three years ago after seeking redress in the Maltese courts.\nThey complained they had suffered a de facto expropriation on grounds that the flat had been demolished abusively and that a yearly recognition rent of €158.40 and the award of moral damages to the tune of €1,500 had not made up for the breach they suffered. They also argued they had been deprived of their property and, for 30 years, had not yet received any compensation while they had to disburse costs in litigation.\nThe Strasbourg Court agreed with the Constitutional Court in Malta and noted that the demolition took place before the apartment was taken over by the State under title of possession and use in terms of a declaration by the President in late October 1989, when the government had simply occupied the property without any title to it. Thus, the demolition was unlawful, it decreed.\nThe government had simply occupied the property without any title to it\nIt decided that, in such circumstances, there was no point considering whether the demolition pursued a legitimate aim or whether the measure was proportionate. The European judges hearing the case also pointed out that the owners had not been compensated in any way for the unlawful demolition of their property.\nHowever, although the decision to demolish the place was not in line with the law, the way in which the property was eventually taken over by the State was correct and pursued a public interest, it remarked. Still, the court went on, such measures had not been applied in a fair manner.\nThe Strasbourg Court, thus, found there had been a violation of the right to protection of one’s property. It awarded the owners a total of €18,000 in pecuniary damage, another €8,500 in moral damages and €7,500 to cover costs and expenses.\nChief Justice Emeritus Vincent De Gaetano was among the seven European Court judges hearing the case.", "comment_count": 7, "id": 1498}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The cleaning of a Sannat site, where the remains of what could be a medieval church were recently unearthed, is being monitored by the Superintendence of Cultural Heritage and an archaeologist.\nOver the years, historians have referred to a Santa Marija ta’ nofs Awwissu church in Sannat, which was first documented in 1545 but probably dates back to the 1300s.\nWhen contacted, historian Joseph Bezzina  noted that while carrying out research and fieldwork for his book Ta’ Sannat fi Ġrajjet Għawdex , published in 1989, old folk pointed out an area, and not a particular spot, in front of the former restaurant complex Palazzo Margherita as the expanse of land where the chapel was possibly sited.\nPresumably, these folk pointed out the area basing themselves on oral tradition, he said.\nAsked whether the remains could have served some other use over the years, Dr Bezzina said it was known, from sites of former dilapidated chapels like that of St Cecilia, that indeed they were used as sheds and even as shelters for animals.\nThe site hosting the potential remains has been earmarked for a development which was granted permission in March. It will see the construction of 43 garages, overlying 30 units on two floors and an additional 12 apartments at set-back floor level.\nAccording to a submission by the superintendence, the site in Sannat is located in an area of archaeological sensitivity.\nWhen contacted, Wirt Għawdex president Giovanni Zammit said that the NGO had done its part and alerted the Planning Authority and the Superintendence of Cultural Heritage when it learnt of the potential discovery.\n“We feel that the SCH and the architect are doing their job by directing, monitoring and supervising works on site. \n“The NGO has been told it can access the site but we would like to leave it up to the authorities to continue with their work and surveillance.  In the meantime, we will await the SCH site report of whether any archaeological remains exist on the site or not.”\nQuestions sent to the Superintendence on May 16 have not yet been answered.\nMeanwhile, a spokesman said the PA was informed that the only works carried out on site were related to archaeological evaluation prior to the issue of a planning permission. This work was undertaken under the direction of the Superintendence, he added.", "comment_count": 4, "id": 1499}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta quotes former prime minister Lawrence Gonzi saying Adrian Delia must put his leadership to the test after the EP elections defeat.\nIt also reports how the Labour Party had won control of Valletta council for the first time.\nThe Labour victory in Valletta is the lead story in l-orizzont, which says it is 'historic'.\nThe Malta Independent reports how the Malta government's proposed amendments to a Council of Europe report on the rule of law in Malta were rejected.  It also says that David Stellini's place in Parliament is to be filled in the coming days.\nIn-Nazzjon quotes Adrian Delia saying he will continue to listen to the people so as to draw up a future of the PN with them.\n ", "comment_count": 1, "id": 1500}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Nationalist Party had the necessary structures for those wanting to express dissent but what mattered at this point in time was the courage to stand up and be counted, former leader Lawrence Gonzi told Keith Micallef.\nWhat is your evaluation of the current state of the Nationalist Party? Do you subscribe to views it is at its lowest ebb ever?\nThere is no doubt whatsoever the party is facing a number of challenges that need to be addressed with urgency and courage but also with a strong sense of loyalty towards our values. The party has a duty to the country first and foremost and, therefore, it is expected to perform its duties as a strong Opposition that is able to defend our country’s reputation while offering an economic vision that guarantees continued well-being for everyone.\nWhat are the reasons for the decline the party has suffered since 2003?\nThe party has always had a major political vision that excited and inspired people. It has managed to deliver on all its major promises throughout its history and Malta in 2019 is the Malta that had been designed by the PN and no one else.\nMalta is a successful EU member, with a vibrant economy that encourages the private sector to invest in the island but also to look beyond our shores. We have a younger generation that is today able to benefit from a wide spectrum of education opportunities enhanced by EU opportunities that the Labour Party would have denied them.\nAll of this was the result of some tough decisions that needed to be made. We had to restructure our public and private sector to introduce the euro in 2008. This helped us face the financial and economic crisis between 2008 and 2013 but, even then, tough and very unpopular decisions needed to be made.\nWe were obviously aware that in politics tough decisions often lead to loss of votes, which is exactly what happened. For example, we are criticised for having increased the water and electricity rates but this criticism fails to recognise the fact that the price of oil shot sky-high.\nThe long and short of it is that the decline in popularity for the PN since 2003 was, in part, due to the tough decisions that had to be made. Of course, I am the first to admit that mistakes were committed but the economic results we achieved in tough times together with the high international and European reputation of Malta speak for themselves. Contrast this to today’s state of play.\nWhat are the factors that contributed to the dismal result in Saturday’s European elections, which is the worst since 1951?\nI will not mince my words. The results clearly show that there is a sizeable faction of PN voters who decided to vote in a manner that sends a strong message to the PN’s present leader, his advisers and the party officials. This faction includes voters who decided to abstain from voting.\nAdrian Delia should put his leadership on the line and prove himself to be worthy of the honour to lead the party\nAccepting this as an undisputable fact is fundamental, otherwise the PN will remain unable to regain lost ground. This is evident, especially from the results registered in key stronghold districts that have traditionally supported the PN.\nThis situation reminds me of a similar situation faced by Labour in 1998 when Alfred Sant antagonised a large chunk of Labour voters because of the “Mintoff traditur” (Mintoff traitor) issue. The very positive results achieved by the PN at the time, both in the local council elections and the 1998 general election, are again self-evident. This is not the only reason for this 2019 negative result, but it is one of the most important.\nWhat is the way forward for the PN to start regaining ground outside the party walls, within the electorate?\nIn my opinion there are two measures that need to be taken immediately.\nDr Delia needs to go through an exercise that challenges his leadership. If reconfirmed, then everyone needs to close this chapter and focus on strengthening the party’s unity over the next two years.\nThe second – and, possibly, more important – challenge is to present the Maltese electorate with an economic vision that guarantees the future well-being of our people but with Malta’s reputation fully reintegrated in the international arena. The PN is the only party that is able to do this.\nDo the right forums exist in the current structure for anybody who would like to express dissent within the party?\nYes, certainly. The issue is not the structure but the courage to stand up and be counted.\nIs there still time for Dr Delia to win the support of his critics even internally or is it too late now? How would you go about it?\nIn politics it is never too late. Back in 2008, all pundits predicted a major loss for the PN in the general election. I won that election by sheer determination and conviction that our policies were the best. But I too made some tough decisions within the party even though they could have put my political career at risk.\nShould Dr Delia resign?\nAdrian Delia should put his leadership on the line and prove himself to be worthy of the honour to lead the party. Whatever people say, he is the legitimate leader of the PN as a result of a democratic process that took place 18 months ago. However, the circumstances today demand that he recognises the present state of affairs and move forward to face the challenge head-on.\nIf he decides to stay, should Dr Delia call for a vote of confidence to gauge his support within the party as you had done in 2012?\nIn 2012, I faced a situation where my leadership was put in doubt. I had an option of resigning or face the challenge. I chose to face the challenge head-on and put my leadership (and, of course, my prime ministership) on the line for the benefit of the party and the country.\nLooking back, I believe it was the right decision as it legitimised my decision to stay on until the end of the legislature, facing the challenges of an economic and financial crisis that saw the economy of larger countries collapse and millions of workers and pensioners suffering as a result. Thank God, we managed to avoid all this.", "comment_count": 15, "id": 1501}, {"keywords": "", "author": "", "article_body": "Nationalist Party leader Adrian Delia should put his leadership to the test and prove himself to be worthy of his post, former prime minister Lawrence Gonzi told the Times of Malta.\nDr Gonzi, who resigned as PN leader after suffering a huge electoral defeat in the 2013 general election, acknowledged that Dr Delia was the legitimate leader of the party. “However, the circumstances today demand that he recognises the present state of affairs and moves forward to face the challenge head-on,” he remarked.\nVarious quarters called for Dr Delia, his close aides and top officials to step down after the PN was crushed by Labour at last Saturday’s European Parliament elections. Labour won 141,267 votes (54.2 per cent) against the PN’s 98,611 (37.9 per cent).\nThe PN also appears to be heading towards a similar defeat in the local council elections, which were also held on Saturday.\nDr Gonzi, who served as prime minister and PN leader between 2004 and 2013, said that the party was facing challenges that had to be tackled “with urgency and courage”.\nTo him, last weekend’s results showed “there is a sizeable faction of PN voters who decided to vote in a manner that sends a strong message to the PN’s present leader, his advisers and the party officials”.\nThe way forward, in his opinion, is for Dr Delia “to go through an exercise that challenges his leadership” but also presents to the electorate an economic vision guaranteeing the future well-being of the people.\nRead the full interview with Dr Gonzi here.", "comment_count": 227, "id": 1502}, {"keywords": "", "author": "", "article_body": "Updated Thursday - \nA group of 75 migrants found stranded on a tuna pen were rescued by the Armed Forces on Wednesday evening and brought to Malta early on Thursday.\nIn a statement, the government said the AFM and the Italian coast guard conducted multiple joint rescue operations supporting the Libyan coast guard.\n\n\n\nThe Italian coast guard carried out other rescues and is taking migrants to Lampedusa.\nThe rescue is reminiscent of another similar incident in 2008 when a group of 56 migrants were also found clinging on to a tuna pen. The pictures of the rescue then had shocked the world. ", "comment_count": 0, "id": 1503}, {"keywords": "", "author": "", "article_body": "Former Nationalist MP Michael Bonnici died on Wednesday, aged 75.\nA pharmacist by profession, Mr Bonnici, who was from Żebbuġ, a locality he was very committed to, was first elected to Parliament in 1987.\nHe served as an MP until 2003, including some years as deputy speaker. He was always moderate and correct in his actions, and was never spiteful in his criticism.\n\n\n\nIn 2011, he returned an honorary decoration he received in protest at the change of a street name that he said was disrespectful to one of the village’s “most respected ancestors”.\nMr Bonnici also kept records of the oldest people in Malta. His father, also a pharmacist, lived to be 100, as did his grandmother and great grandmother.\nThe Nationalist Party expressed its condolences, describing Mr Bonnici as a kind-hearted man who was ready to help anyone, independently of his political beliefs. Mr Bonnici worked hard for his country and especially for his hometown Żebbuġ, the party said.\n \n ", "comment_count": 21, "id": 1504}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The outcome of Saturday’s MEP elections reflected, almost to precision, the clear indications given by pre-election surveys commissioned and published by The Sunday Times of Malta over the past two months.\n\nBoth surveys, which tallied with others conducted by other media outlets, indicated a significant gap between the two main political parties, below 50,000 votes.\nNotwithstanding their margin of error, the surveys indicated that the Labour Party would poll over 50% of the vote with the Nationalist Party winning 40% or less.\nThe last survey, published by The Sunday Times of Malta a week before the country went to the polls, gave Labour 55%, a fraction higher than the actual result. The PN fared worse than the 40% margin projected by the survey, getting 37.9% of the vote, its worst result since 1951.\nThe surveys, conducted by Misco, also proved to be spot-on with regard to the elected candidates in the EP elections.\nThe four Labour candidates indicated as being the most popular in the latest survey by The Sunday Times of Malta were, in fact, all elected.\nThe same applies to PN candidates, with the study clearly predicting the party would lose its third seat and that Roberta Metsola would be the most popular among Nationalist voters.\nJust a week before the polls, David Casa and Frank Psaila, the latest openly backed by the PN administration and the party ‘machine’, were neck and neck with equal chances of making it to Brussels.\nHowever, Mr Casa, the longest-serving Maltese MEP, made an eleventh hour comeback, persuading PN voters to prefer him over the newcomer.", "comment_count": 6, "id": 1505}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Comments made by the PN leader’s ‘kitchen cabinet’ and secretary general Clyde Puli caused an internal backlash, especially among loyal supporters, party sources told Times of Malta.\nIn trying to justify the largest defeat ever suffered by any PN leader, Mr Puli said on NET TV the party had managed to do better than the surveys indicated before the election.\n“When we worked together, we managed to narrow the gap predicted by the surveys and if this continues we can achieve more results in two years’ time,” he said.\nReferring to a survey published by the General Workers Union’s weekly, It-Torċa, in November 2017, Mr Puli said the indications were a gap of more than 75,000 votes for Labour. He deemed it positive that the difference in votes won by the two large parties stood at 42,000 votes.\nSocial media websites reporting Mr Puli’s statement were inundated with comments lashing out at him for his “illogical and puerile” justifications and others, particularly, Labour supporters, poked fun at him.\n\n“One would understand people like Clyde (Puli) and Pierre (Portelli) trying to save their skin and livelihood after such a disaster. However, it is very insulting to make such stupid arguments, thinking all PN supporters are dumb,” a member of the party’s general council said.\nAn executive committee member remarked that the party seemed to have been hijacked by a very small pool of people “who also control [Adrian] Delia”.\nHe added that, rather than “vanishing, because it is quite obvious the PN cannot move on with them, they were using the party’s machine, including the media, to try to remain in control”.\nWe have a parliamentary group that is not happy with their leader\n“How someone at the helm can compare an electoral result to a survey instead of a similar electoral poll beats me.”\nReferring to Mr Puli’s comments, a female Nationalist councillor said she could not understand why one should compare an electoral result to a survey rather than a similar result.\nDr Delia has already declared he would not be stepping down and PN councillors have reportedly started an initiative to raise 150 signatures from among general council members to force a vote of confidence in the leader. \nIt could not be ascertained on Tuesday what kind of response had the initiative received so far and neither who was behind it.\nAlthough many supporters of Dr Delia defend him publicly and want him to stay until the general election, a long-standing party member said they too admitted privately that the party was unlikely to win any election with its present leadership.\n“The problem is not only Delia. It’s all those in the key positions who love themselves and their personal interests more then the party,” he said.\n“We have a parliamentary group that is not happy with their leader but whose members fear a challenge as they are more interested in keeping their cosy seat,” another remarked.", "comment_count": 89, "id": 1506}, {"keywords": "", "author": "", "article_body": "Miriam Dalli has been appointed Labour’s head of delegation in the European Parliament for the next five years, the Labour Party said.\nThe party said in a statement this was unanimously agreed in a meeting attended by the party’s four MEPs.\nDr Dalli, who obtained 63,438 first count preferences, will be serving in the European Parliament for a second term.\nCommenting on her appointment as head of delegation, Dr Dalli thanked her colleagues and said she looked forward to working with them in the country’s interests.\nThe meeting also discussed the priorities the party’s MEPs shall be focusing upon in the coming months.", "comment_count": 20, "id": 1507}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The procedure set in motion to de-flag six fishing vessels belonging to Darren Debono is set to be scrutinised in an action for judicial review after preliminary pleas by the State were dismissed by the court.\nThe procedure had been set in motion by the Registrar General of Shipping and the Minister for Transport, Infrastructure and Transport.\nThe State had set the procedure in motion in the wake of the arrest and subsequent prosecution in Italy of Mr Debono, a shareholder in World Water Fisheries, over his alleged involvement in a fuel smuggling racket, a serious offence in breach of sanctions imposed by the UN Security Council and the US Government against Libya.\nHowever, the cancellation of the flags of the MV Albasel, MV Marie De Lourdes, MV Marie De Lourdes I, III and V and the MV Zeus, was not effected after the Court upheld a request by their owner World Water Fisheries for a warrant of prohibitory injunction.\nMeanwhile, in a partial judgment, the First Hall, Civil Court, presided over by Mr Justice Mark Chetcuti, rejected preliminary pleas raised by the respondents – including their argument that the minister was non-suited.\nOther pleas that no administrative action had been taken, that there had been no order or direction amounting to such and that the applicant had not identified the right claimed, were all thrown out by the Court.\nIndeed, the Court observed that were it not for the injunction proceedings and the relative warrant issued, “the cancellation [of the flags] would have been effected.”\nThe minister, when testifying in the proceedings, said he had issued instructions to the Registrar of Shipping to effect the de-flagging as recommended by the Surveillance Board, to avoid any possible negative impact upon the Maltese flag.\nThe letter sent by the respondents informing the company that its ships were going to be de-registered within the month, if the current situation persisted, was indeed an administrative decision kept in abeyance for one month, the court concluded.\nAs the case continues, the Court will deliver a judgment on the merits at a later stage.\nLawyer Victor Bugeja is assisting the applicant.", "comment_count": 0, "id": 1508}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 5.40pm, adds government statement\n\nLabour MP tries to gloss over negative references in Council of Europe report\nAttempt to remove reference to Brian Tonna's role in the Panama Papers scandal and his association with Keith Schembri rejected\n\nAn attempt by the government to water down a scathing report about the rule of law and the investigation into Daphne Caruana Galizia’s assassination was rejected by a Council of Europe committee on Wednesday.\nLabour MP Manuel Mallia presented over 40 amendments seeking to delete critical passages about the government and watering down references to the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nLabour MP Manuel Mallia\nThe draft report, approved in committee on Wednesday morning, sticks to the conclusion that Malta’s rule of law is seriously undermined by the \"extreme weakness\" of its system of checks and balances,  and points out that top officials like Mr Schembri and Dr Mizzi enjoy impunity under Prime Minister’s Joseph Muscat’s personal protection. \nDr Mallia attempted to get this paragraph in the report removed, replacing it instead with a passage that concludes the Maltese authorities should take into account the Venice Commission recommendations to start a process that would examine the need of Constitutional reform.\nIn another amendment, Dr Mallia sought to water down references to Nexia BT accountant Brian Tonna, who is a close friend of the Prime Minister’s chief of staff.\nDr Mallia attempted to replace a paragraph emphasising the \"key role\" played by Mr Tonna and Nexia BT in the Panama Papers, Electrogas, Egrant, Hillman and ‘golden passports’ affairs and the lack of disciplinary action taken against them by the Accountancy Board.\nThis paragraph highlighted how Mr Tonna and Nexia BT received numerous lucrative government contracts, including after Mr Tonna came under investigation. \nThe Labour MP wanted this passage to be either deleted or replaced with text merely stating that Mr Tonna and his firm “has received government contracts”.\nA series of concerns put forward about the murder investigation by the Council of Europe were also targeted by Dr Mallia.\nDr Mallia demanded the deletion of passages noting serious concerns about the probe, including references to the recusal of magistrate Consuelo Scerri Herrera, the “need” to remove the former lead police investigator Silvio Valletta from the probe, and the Prime Minister’s removal of inquiring magistrate Anthony Vella by virtue of his promotion to judge.\n\nThese amendments were also rejected.\nReferences to the resignation or dismissal of four police commissioners between 2013 and 2016, and the Prime Minister’s power of appointment were also targeted by Dr Mallia.\nThe Labour MP instead wanted this passage replaced with a reference to the high public trust in the police, as evidenced by successive Eurobarometer surveys.\nThe report, compiled by Dutch MP Pieter Omtzigt, will now be presented to the Council of Europe’s plenary in June for final approval.\nDr Mallia had attempted to oust the Dutch MP from his rapporteur role last September. \nReport riddled with inaccuracies - government\nIn a statement, the government said the report was \"riddled with inaccurate and gratuitous statements\" exposing a very biased agenda which is not based on the true picture of the matter.\nIt said that the process regarding the motion originally presented by Mr Omtzigt was ongoing and not public. The government and its MPs respected the Council of Europe’s rules of procedure about the confidentiality of processes and meetings.\nThis policy was, however, not followed by all in the Council of Europe and an example of this was the leaking to the media of the draft report.\n\"The government notes the very dubious timing of the leak, just days before the European elections. The leak was intended to create a hostile and unreceptive environment towards Malta and to preempt any effort to have the report discussed in any spirit of objectivity. In fact, the report itself is a reflection of deep animosity against Malta.\n\"This attitude is very dangerous from a democratic point of view. International institutions cannot just pass one-sided reports against a country by sheer force of numbers.\n\"It is clear that the rapporteur, amongst other matters, having himself previously written to the Committee of Ministers to take action against Malta and having had his request rejected, was not the best placed person to take on this role,\" the government said.\nIt pointed out that Mr Omtzigt had come under fire over claims that he helped a fake witness to the MH17 disaster over Ukraine infiltrate a briefing attended by victims’ relatives. He himself had admitted to have behaved inappropriately on the matter.\nThe report, the government said, represented the very biased views of a small fraction of Maltese Opposition politicians who appeared to have kept close to the rapporteur and formed alliances with various vested interest groups that had an interest in damaging Malta’s reputation and in isolating Malta from Europe.\n\"The manifest disregard for basic fairness and the barefaced manipulation of the scenario are the most worrying aspects of this episode.\n\"The Maltese Government MPs are making their case as forcefully as possible to the Parliamentary Assembly with a full report which gives a detailed picture of the extent of manipulation in the report presented to the Parliamentary Assembly.\n\"Unfortunately, the attempt to rush this report through without regard to basic fact-checking betrays an attitude which is far from giving a true picture of the situation in Malta,\" the government said.", "comment_count": 176, "id": 1509}, {"keywords": "", "author": "Keith Micallef, Rosanne Zammit", "article_body": "Valletta and St Paul's Bay swing over to Labour \nLabour wins 16 out of 23 councils counted on Wednesday\nPN holds onto St Julian's, sees 8% gain in Nadur \nFull list of elected councillors at bottom of article \n\nThe Labour Party won the Valletta council for the first time since council elections started to be held, piling more pressure on the Nationalist Party just days after the European elections debacle.\nThe PL will have four of the seven councillors in the capital, with One presenter Alfred Zammit netting the most votes to be elected mayor. In 2013, when the last Valletta local council election was held, the Nationalist Party had won 51.6% of the vote.\nParty counting agents began celebrating the Valletta win just after 8pm, even smashing the perspex used to separate party operatives from electoral commission officials in the process. \nPrime Minister Joseph Muscat tweeted the news shortly afterwards. \n\nLabour captures St Paul's Bay\nThe victory capped a day of wins for the Labour Party, which also won the St Paul's Bay council election, taking it over from the PN. In 2015, the PN had obtained 47.7% of the votes cast in St Paul's Bay, with the PL 46.9%, AD 3.5% and independent candidates 1.9%.\nLabour also won St Paul's Bay. Video: Mark Zammit Cordina\nThe PL also retained Mellieħa with five councillors to four, where Dario Vella will be the new mayor replacing Johnny Buttigieg, who was also elected; as well as Santa Venera withbfour councillors to three.\nLabour also scored another success in its stronghold of Marsa, where the party won six of the seven available seats. It will be the first time Marsa has a seven-member council: previously the locality had five councillors, four of whom represented the PL.\nOverall, the PL won 16 out of the 23 localities counted on Wednesday.\nPN retains St Julian's\nThe PN could take solace in the fact that it retained its stronghold St Julian's, winning the council 6-3.\nThe party also kept hold of Għasri - the first locality to get its result on Wednesday evening - despite losing 3.3 per cent of the votes there. \nResults for Għasri were issued about an hour after the sorting process began. In the end, the Nationalist Party obtained 185 votes with the Labour Party just 30 behind at 158. \nThe second result issues was for Pembroke, another small locality, but the counting process took an hour and a half. As expected, the locality was retained by the Labour Party.\n \n\nResults continued to trickle in with the PL electing four of the five councillors in Dingli, Xewkija and Qrendi, three of the five councillors in Mqabba and Ta' Xbiex, seven of the nine councillors in Birżebbuġa, Żejtun and Żurrieq and five of seven councillors in Tarxien. The PN elected four of the five councillors in Balzan and three of the five in Fontana, Iklin and Nadur.\nIn Għajnsielem, the PN increased its majority from three to four as Stephen Mercieca, previously an independent, was now elected on the PN list.\nVideo: Keith Micallef\nIn Żebbuġ, independent candidate Steve Zammit Lupi was elected with more than 900 votes. He will join five PL and three PN councillors in the locality's new council.\nSorting process\nThe sorting process in the first batch of local elections starting right on time at 5.30pm. Ballot sheet scanning started shortly after the ballots in the first boxes were sorted, at around 5.45pm.\nThe first results were expected immediately, but none had been given by 6.15pm.\nBallot boxes containing the votes of 23 localities started being opened at the counting hall in Naxxar earlier in the afternoon in preparation for the vote sorting.\nThe atmosphere at the counting hall, which was very quiet earlier with just a handful of party agents roaming around, got busier and rowdier once the sorting started.\nAs happened in the European Parliament elections, the votes will be counted electronically - reducing the process of vote inheritance, which used to take up to days, to just three minutes.\nPhoto: Keith Micallef\nVideo: Mark Zammit Cordina\nA few teething problems were experienced for the EP elections, which had delayed the process.\nCounting agents from both parties acknowledged that the new electronic system had taken the \"excitement\" of the counting process away.\nThis was because there would be no indication during the process of how individual candidates were doing. \nThey do not let politics come between them: Jeremy Cardona contested Gżira with the Nationalist Party, his girlfriend Joslyn Saliba Żejtun with the Labour Party. Photo: Mark Zammit Cordina\nThe screens only display the number of the ballot box being inspected and any dubious ballots. The result - from first to final count - would then be immediately announced with the results for the smaller localities coming out first.\nWhen asked why the process was not started on Wednesday morning, sources close to the Electoral Commission blamed it on a lack of resources when compared to previous years, with fewer people applying to be counting agents.\nEven the political parties were not keen on starting the process in the morning as candidates and their agents would not be available due to work commitments. Being a workday, it was even harder to find the required number of staff due to availability.\nPhoto: Mark Zammit Cordina\nSo it was agreed to start sorting at about 5.30pm.\nThe localities counted on Wednesday are Valletta, Birżebbuġa, Dingli, Balzan, Tarxien, Żebbuġ, Marsa, Mellieħa, Qrendi, Żejtun, Żurrieq, Iklin, Mqabba, Pembroke, St Julian’s, St Paul’s Bay, Sta Venera and Ta’ Xbiex in Malta and Għajnsielem, Fontana, Nadur, Xewkija and Għasri in Gozo.\nThe Gozo votes are also being counted in Malta.\nLabour celebrations for Valletta went a bit out of hand when the perspex was broken. Photo: Keith Micallef\nElected councillors\nGħasri: Daniel Attard (mayor), Salvu Felice Pace, Emanuel Mintoff - PN; Elizabeth Mintoff Elizabeth, Sammy Saliba - PL\nPembroke: Dean Hili (mayor), Omar Elaref Arab, Raymond Lanzon - PL; Desiree Vella Brincat, Charles Cesare - PN\nValletta: Alfred Zammit (mayor), Ray Azzopardi, Ian Pace, Jurgen Briffa - PL; Christian Micallef, Mark Spiteri Lucas, Vincent Fabri - PN\nDingli: Raymond Schembri (mayor), Sandro Azzopardi, Paul Mamo, Ryan Tanti - PL, David Vassallo - PN\nMqabba: Omar Farrugia (mayor), Mary Grace Zerafa, Henry Zaffarese - PL; Jonathan Dingli, Owen Sciberras - PN\nTa' Xbiex: Max Zammit (mayor), Rosario Portelli, Oriana Calleja - PL; Louise Cachia Castelletti, Eugenio Muscat - PN\nBalzan: Ian Spiteri (mayor) Angelo Micallef, Stephen Gatt, Mary Louise Briffa - PN; Oliver de Gaetano - PL\nQrendi: David Michael Schembri (mayor), Patrick Bugeja, Marion Parnis, Carmel Zerafa - PL; Daniel Farrugia - PN\nMellieħa: Dario Vella (mayor), John Buttigieg, Rebecca Bartolo Cutajar, Annabella Brincat Stellini, Kurt Michael Buttigieg - PL; Ivan Castillo, Marvin Abela, Gabriel Micallef, Emvin Bartolo - PN\nFontana: Saviour Borg (mayor), Josephine Camilleri, Carmel Farrugia - PN; Horace Micallef, Jonathan Cefai - PN\nSanta Venera: Stephen Sultana (mayor), Gianluca Falzon, Kursten Dimech, Silvio Vella - PL; Darren Carabott, Courtney Farrugia, Joe Vella - PN\nSt Julian’s: Albert Buttigieg (mayor), Guido Dalli, Patricia Camilleri, Clayton Luke Mula, Rita Dimech Portelli, Sean Gauci - PN; Adrian Dominic Ellul, Martin John Sultana, John Agius - PL\nBirżebbuġa: Joseph Farrugia (mayor), Scott Camilleri, Josette Busuttil, Sandro Alexander Caruana, Maria Mifsud, Carlo Stivala, Joseph Baldacchino - PL; Stanley Zammit, Doriana Portelli - PN\nTarxien: Joseph Abela (mayor), Darlene Vella Zammit, Neil Portelli, Thomas Debattista, Christian Pace - PL; Ismael Dalli, Anabelle Marmara - PN\nSt Paul’s Bay: Alfred Grima (mayor), Carlos Zarb, Darryl Connor, Mario Joseph Salerno, Alfred Bray, Paul Bugeja, Stephen Cremona - PL; Graziella Galea, Anne Marie Fenech, Anthony Delia, Anthony Angelo Attard, Christopher Vella Petroni, Antoinette Bezzina - PN\nŻurrieq: Rita Grima (mayor), Ignatius Farrugia, Joseph Damato, Kaydem Schembri, Tiffany Farrugia, Marisa D’Amato, Kenneth Farrugia - PL; Kyle Mifsud, Dino Bonnici - PN\nIklin: Dorian Sciberras (mayor), Yvonne Bartolo, Emanuel Zammit - PN; Bernice Farrugia, Godwin Catania - PL\nŻejtun: Doris Abela (mayor), Joan Agius, Stephania Fenech, Gesmond Baldacchino, Raymond Caruana, Camilleri Dorcas, Sean Chircop - PL; Amanda Abela, Roderick Caruana, PN\nNadur: Edward Said (mayor), Eucharist Camilleri, Josef Frank Camilleri - PN; Joseph Vella, Jean Paul Portelli - PL\nŻebbuġ: Paul Malcolm Galea (mayor), Mark Camilleri, Clive Azzopardi, Philip Edrick Zammit, Patrick Bonnici - PL; George Cortis, Kevin Glynn - PN; Steve Zammit Lupi - Independent\nGħajnsielem: Kevin Cauchi (mayor), Franco Ciangura, Stephen Mercieca, Teddy Saliba - PN; Larry Buttigieg - PL\nXewkija: Hubert Saliba (mayor), Paul Azzopardi, John Vella, Domenic Zerafa - PL; Jeanelle Attard - PN\nMarsa: Josef Azzopardi (mayor), Joseph Scerri, Francis Debono, Colin Pace, Domenic Spencer, Joseph Lia - PL; Charmaine Aquilina - PN\nPhoto: Mark Zammit Cordina\nOne of the boxes being opened. Photo: Mark Zammit Cordina\nAll set and ready to go... Photo: Mark Zammit Cordina\nPhoto: Mark Zammit Cordina", "comment_count": 134, "id": 1510}, {"keywords": "", "author": "Keith Micallef", "article_body": "A controversial proposal for the construction of 30 apartments in a 250-year-old scheduled property in Għaxaq, initially refused by the planning authority, is back on the agenda after the developer filed an appeal.\nHowever, proceedings before the Environment and Planning Review Tribunal which is hearing the case have stalled after the first sitting due to a potential conflict of interest involving the tribunal’s chairman, Martin Saliba.\nMr Saliba notified the parties he was recusing himself from the case in view of the fact that he had been involved in the early part of the application’s processing, known as screening. In view of this, it was decided to put off the case and appoint a new tribunal.\nThe application in question was unanimously refused last February and involved the development of the garden of Palazzo Giannin, which is a Grade 2 scheduled building. The status is granted to buildings of some architectural or historical interest or which contribute to the visual image of an urban conservation area.\nThe proposal comprised basement level garages, 30 residential units over five levels including penthouse and the restoration of what would remain of the baroque garden. It prompted a barrage of complaints, including a petition from NGO Flimkien Għal Ambjent Aħjar, which has been endorsed by more than 1,700 objectors.\nThe PA had justified the refusal on grounds that the proposal would result in excessive development and have an adverse impact on the garden and palazzo, thus breaching cultural heritage protection policies.\nIn his appeal, the developer noted that an outline development permit had already been issued, meaning the regulator had agreed in principle that deve-lopment could take place.\nIt was also pointed out that scheduling of the property did not preclude any development and, furthermore, the PA had adopted doubled standards because an application on an adjacent property that once formed part of the palazzo had been approved. The plans had also been altered from those filed at outline stage to conform to certain requests.\nThe PA commented that the outline permit had only been issued in 2011 following an appeal before the same tribunal. The proposed application did not respect the conditions set.\nThe PA reiterated its concern that the proposal constituted excessive development and dismissed the argument that a permit had already been issued in an adjacent property, saying it was not a like-with-like comparison in terms of planning policies.", "comment_count": 9, "id": 1511}, {"keywords": "", "author": "", "article_body": "The amount of organic waste being collected from homes is creeping up again, after a few months when only low amounts were registered.\nEnvironment Minister Jose Herrera said in response to a parliamentary question posed by MP Karol Aquilina, that the amount had reached 14,243 tonnes in Malta and 1,011 in Gozo.\n\nThe amount collected had dipped a few months after the new scheme was put in place on October 31 – however, it has since recovered and is creeping up each month, with 2,582 tonnes collected in April 2019. At this rate, it means the total for 2019 could be almost twice the 16,000 tonnes forecast by WasteServ for 2019.\nOrganic waste is currently collected three days a week. The intention is to produce compost from this waste which can be given to farmers for use in agriculture.\nAt the moment, the organic waste scheme and the recycling collection are voluntary but the government intends to make waste separation a legal obligation.", "comment_count": 13, "id": 1512}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Liam Debono, the teenage driver at the centre of the hit-and-run incident involving police constable Simon Schembri, has been unable to contact his parents since being detained at Corradino’s Division 6 following his re-arrest last Friday, a court was told on Wednesday.\nMr Debono was arrested on Friday afternoon when he was spotted in Luqa behind the wheel of a Fiat Uno despite having been granted bail on condition that he did not drive. He was arraigned on Saturday and remanded in custody.\nLegal aid lawyer Victor Bugeja said that for the past four days, the teenager had been detained at Division 6 of the Corradino Correctional Facility and had been denied communication with his parents.\nNot only did the young man need a fresh change of clothes and other personal belongings, but he also needed medication which he was meant to be administered daily.\nMagistrate Joseph Mifsud recommended that the Prison Director ask the facility’s medical professional to liaise with Mr Debono’s personal doctor via the accused’s father to ensure that the necessary medication would reach him in prison.\nLast Friday, an off-duty police sergeant, Kevin Curmi, driving near the airport roundabout, had sighted the young driver, his suspicion aroused by the man’s slouching posture in the driver’s seat.\nPS Curmi exhibited a picture which he had snapped with his mobile phone while tailing the beige Fiat Uno on Friday.\nThe officer also confirmed that a photo of Liam Debono at the moment of arrest tallied with his own description of the young driver who had been wearing sunglasses which had since been preserved in the records of the case.\nTVM reporter Brandon Pisani was next summoned to present a set of five photos sent to the newsroom by a source who had captured the moment of Mr Debono’s arrest at Luqa.\nProsecuting Inspector Pierguido Saliba told the court that a couple of witnesses had so far proved elusive, even exhibiting the negative notes of referral proving that the police had failed to track down these individuals, including the registered owner of the vehicle and the man who had been with Liam Debono at the time of his arrest.\n“Put them on the wanted list and rope in the assistance of the CMRU(Community Relations and Media Unit of the Police Force) which is very efficient,” advised Magistrate Mifsud, authorizing the prosecution to serve notification of summons “at any time and place.”\n“Find them by the next sitting,” was the Magistrate’s final word.\nIn the course of today’s hearing the court also observed that a Probaton Officer tasked with reporting regularly on Mr Debono’s progress had filed no report since her appointment last July. The officer is also expected to testify in the proceedings.\nThe case continues on Wednesday", "comment_count": 0, "id": 1513}, {"keywords": "", "author": "", "article_body": "Local postage rates have been raised following a decision by the Malta Communications Authority to partially uphold a request by Maltapost for a revision of domestic single-piece and bulk mail services.\nThe authority said the current rates had been loss-making for a number of years and were unsustainable. It had issued MaltaPost’s proposals for public consultation but no feedback was received.\nIn terms of the revision, domestic postage of small local items will cost 28c instead of 26c, rising to 30c next year.\nSee the full list of revisions below.\n\n\n ", "comment_count": 33, "id": 1514}, {"keywords": "", "author": "", "article_body": "Updated 2.30pm with ministry reply\n3D scan of the interior of Calypso’s Cave in Gozo will have to be repeated as the results were “not what was expected”.\nThe Gozo Ministry later confirmed that the scan, carried out by the University of Malta, was not conclusive, noting that it had been done \"free of charge\". \nThe cave was closed several years ago as it was considered to be unsafe, following a partial collapse. The popular tourist site was untouched for some time but earlier this year, Wirt Għawdex was commissioned by the government to finance a study on the condition of the cave and the interventions required to preserve it.\nHowever, responding to a parliamentary question by MP Chris Said, Gozo Minister Justyne Caruana said that while both the internal and external 3D scans had been done, the former would have to be re-done.\nThe clay layer and how this affects the site’s stability will also have to be monitored in each of the four seasons, prior to any intervention.\nGozo has been associated with Ogygia since the 4th century BC, with Professor Anthony Bonanno of the University of Malta confirming that Gozo's connection with the nymph Calypso goes back to 300 BC.\nIn Homer's Odyssey, Calypso detained Odysseus on Ogygia for seven years and kept him from returning to his home of Ithaca, wanting to marry him.\nThe site was popular with tourists, prompting reader Kevin Cutajar to write to the Times of Malta in 2016 lamenting that if the cave were to collapse, it would mean “the Gozitan identity, which we so proudly date back to Calypso, would have lost its place of origin. This is not just an issue of Gozitan pride, but also an issue that impinges on our pockets”.\n\"Wouldn’t the eventual loss of Calypso’s Cave mean that we have one attraction less to attract tourists to Gozo and to spend their money here? So, what are we waiting for to stop neglecting Calypso’s Cave and to carry out the necessary restoration works?\"", "comment_count": 1, "id": 1515}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A judge has urged the court of appeal to handle with urgency any appeals in the case challenging the appointment of new members of the judiciary.\nThe case was instituted by civil society NGO Repubblika which is seeking to nullify judicial appointments until the government implements recommendations by the Venice Commission on the rule of law.\nLast week, the First Hall, Civil Court in its constitutional jurisdiction, found that Repubblika did not have a juridical interest in the issue under Maltese law but refrained from a decision about whether the case should be referred to the European Court of Justice, reserving that decision to a later date.\nRepubblika is seeking to nullify the appointment of six new members of the judiciary, saying no new members should have been added to the bench until a revised system of appointments was in place.\nAs the case proceeded on Wednesday morning, Mr Justice Mark Chetcuti, heard submissions by Simon Busuttil, assisting the applicants, who pointed out that if the AG’s request for leave to appeal were to be upheld the appeal would drag to “the second half of the year or possibly even to next year.”\nMeanwhile, the six newly-appointed members of the judiciary will “have decided hundreds of cases which could be nullified,” Dr Busuttil argued, urging the Court to assess whether the prejudice likely to be suffered by those citizens whose cases subsequently turned out to be null, weighed more heavily than the prejudice to be suffered by the government if denied leave to appeal.\n“There is far greater urgency for this case to move forward and possibly to go to the European Court for a decision of the system of judicial appointments,” Dr Busuttil went on, stressing that this was “a matter of national urgency and if leave of appeal be upheld, the case will be shelved.”\nMoreover, Repubblika was willing to withdraw its own appeal if the government dropped its request likewise, the court heard.\nAttorney General Peter Grech countered that the scenario painted by Repubblika’s lawyer “would apply to all members of the judiciary,” adding that, “these six had nothing different from the others.”\n“The administration of justice cannot grind to a halt simply because of allegations raised from time to time. The justice system must continue. Today all we have is an allegation and an allegation is just that, nothing more,” Dr Grech observed.\nAfter hearing submissions by both parties, the Court upheld both parties’ request to appeal, declaring that such a “sensitive” issue merited direction from a superior Court, namely the Court of Appeal.\nHe emphasized the urgent nature of the matter at hand and requested that the appeals be treated with urgency as deemed by the Court of Appeal. \nThe court adjourned the case for further information to late June.", "comment_count": 0, "id": 1516}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The projected three-lane Triq il-Buqana, an arterial road between Mtarfa and Mosta, will not be reduced to two lanes in some parts because of buildings which cannot be pulled down, Infrastructure Malta said.\nRoad building industry sources told the Times of Malta the works to widen the road, costing about €4 million, might not have the desired effect because, at one point, where buildings stand on both sides of the thoroughfare, three lanes would be impossible, thus creating a bottleneck.\n“Although the new project to widen the busy road should, in theory, make life easier for drivers, there is one major problem. Part of the road will become narrower because of a protected farmhouse, which cannot be demolished,” they said.\nThey said that the project design left a lot to be desired because, despite the road upgrade, a bottleneck would ensue causing traffic problems, particularly during rush hour. This, the sources continued, would probably defeat the whole purpose of the road-widening project on which so much money was spent.\nWorks, which, according to Infrastructure Malta, will include a new northbound lane and a cycle track, are at an advanced stage.\nA spokesman for Infrastructure Malta defended the project design, insisting there would still be three carriageways where the buildings mentioned earlier stood.\nAt no point will the road narrow to two lanes and then widen again\n“The plans, concluded in 2018, had also taken into consideration the indicated buildings. The new road alignment was purposely designed to safely include the three-vehicle lanes in front of these buildings, without affecting the structure. At no point will the road narrow to two lanes and then widen again,” he noted.\nResidents had already raised concerns during the application process to upgrade the road. \nOne argued that, to be able to fit three lanes in front of the two buildings, the government would be significantly reducing the width of the pavement, making it unsafe for pedestrians.\nInfrastructure Malta had dismissed such concerns, stating that safety was taken into consideration at the design stage.\nThe works started last December and are scheduled to be completed this summer.", "comment_count": 49, "id": 1517}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 12pm with Minister Jose Herrera comments\nEnvironment minister José Herrera is still considering whether to dismiss Guardian for Future Generations Maurice Mizzi, under fire for a series of anti-Muslim remarks. \nSpeaking to the Times of Malta, Dr Herrera said Mr Mizzi was a \"good man\" and deferred a decision on his future until next week. \nDr Herrera - who has dissociated himself from the remarks - summoned Mr Mizzi to a meeting on Monday to \"clarify\" an interview with The Sunday Times of Malta where he had said Muslims were \"taking over\" and that the country should stop all migrants from entering.\nHuman rights groups have condemned the comments as racist and called for Mr Mizzi's resignation. \nAsked about Mr Mizzi's comments, Dr Herrera said he had known him for years and always knew him to be a good man. “I never heard him speak racially – in fact, he prioritises eliminating poverty, and I took this into consideration when I chose him for the role,” he said.\nThe environment minister nevertheless distanced himself from Mr Mizzi’s comments, insisting he was “not a racial person.”\n“Everyone who knows me knows I am the opposite of a racist,” Dr Herrera said.\nDr Herrera, however, did not commit to whether he would keep Mr Mizzi in his role as Guardian, saying he was still monitoring the situation and considering his position.\n“Those who express themselves then have to pay the price. I am considering what he said, I am monitoring the situation and will give my decision in due course,” he said.\nThe minister said that, during their meeting on Monday, Mr Mizzi told him he wanted to give the message that the country should “embrace and integrate the immigrants here” but that he had failed to communicate that effectively. \n\"It is true he expressed his worries about illegal immigration,\" Dr Herrera said, adding he was not comfortable with the comments.\nDuring the interview, Mr Mizzi had actually dismissed the suggestion of better integration programmes, retorting: \"Muslims don’t change. Go and live in these places where there’s this religion. They kill Catholics there.\"\nMizzi defends comments\nIn a statement issued on Tuesday, a spokeswoman said: \"Chev. Maurice Mizzi regrets the fact that his personal statements may have been perceived or interpreted as potentially insensitive directly or indirectly to certain individuals of the community, his true arguments and views were made in the broader context of the right for every person to have a high degree of well-being.\"\nThe comments, the spokeswoman said, were made in his personal capacity and did not reflect the position of the Guardian for Future Generations commission, which he heads. Moreover, they were only a small part of a wide-ranging interview which also delved into infrastructure and social housing.\n\"Chev. Maurice Mizzi has always been at the forefront in supporting families and children coming from all walks of life including various nationalities and ethnic origins. Throughout his life, Chev. Mizzi has provided support, through the Spiru Mizzi Foundation without any sort of distinction with respect to race, religion or ethnicity.\"\nIn the Sunday Times interview, intended to discuss the Guardian's work promoting sustainable development in government policymaking, Mr Mizzi returned to the issue of migration unprompted multiple times. \n\"There are so many Muslims coming – they’re all having nine babies, next to our two – and they will take over eventually,\" he said.\nHis comments came just days after two men were charged with the murder of Ivorian migrant Lassana Cisse in what is alleged to have been a random, race-motivated attack, and as politicians and public figures warn of the dangers of xenophobic discourse in sowing the seeds of hatred.", "comment_count": 0, "id": 1518}]