[{"keywords": "Education", "author": "", "article_body": "Eco-School students from 50 schools last week presented MPs with a document outlining their environmental concerns and ideas how they can be tackled, at the 14th Eco-Schools Parliament session held at the Parliament building. The session was chaired by Speaker Anġlu Farrugia and attended by several MPs.\nThe document had been compiled and approved at the ninth annual Eco-Schools Young People’s Summit held at Maria Regina College’s Dun Manwel Attard Young Adult Education Resource Centre, Wardija, attended by 140 pupils and students from 28 schools.\nThe document deals with issues such as the excessive number of cars and traffic generated, marine pollution, especially by plastic waste, and the lack of green open spaces due to too much building development.\nDuring the summit the students raised environmental concerns affecting their future, discussed ideas and formulated recommendations how to ensure a good quality of life.\nIt was organised by Nature Trust FEE Malta in collaboration with the Malta-EU Steering and Action Committee as part of the Eco-Schools programme.", "comment_count": 0, "id": 3519}, {"keywords": "", "author": "", "article_body": "The Malta National Audit Office hosted the 13th meeting of a working group of the European Organisation of Supreme Audit Institutions earlier this week. During the IT Working Group meeting, auditor generals discussed a review of the IT self-assessment initiative, among other things.\nIn his opening address, Auditor General Charles Deguara welcomed the 69 participants from 31 national audit institutions together with the European Court of Auditors. He gave a brief overview of the work presently undertaken by the IT Audits Unit with the NAO.\nOn his part, Krzysztof Kwiatkowski, president of the Supreme Audit Office of Poland, thanked the Maltese NAO for hosting the meeting.\nHe said that his office was satisfied with the work achieved by the IT Work Group during his Office’s Presidency, which was coming to an end.\nJanar Holm, Auditor General of the National Audit Office of Estonia, who will be taking over the chairmanship of this IT Working Group, was also present for the two-day meeting.\nHe conveyed his appreciation for the excellent organisation as well as the hospitality shown by the Maltese National Audit Office.", "comment_count": 5, "id": 3520}, {"keywords": "", "author": "", "article_body": "A 20-year-old Syrian has been arrested under a European Arrest Warrant, the police said.\nThey said in a statement he was arrested following days of observation and will be arraigned in the coming days for the extradition process to be embarked upon.\nHe is the fifth person to be arrested under a European Arrest Warrant since the beginning of the year.\nSuch operations are intended for people who are wanted internationally to face justice.", "comment_count": 8, "id": 3521}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Those who thought they would be saving some euros by buying health products from overseas are being asked to fork out an additional fee when their items land in Malta.\nReaders of Times of Malta have complained that irrespective of whether they are from the EU or third countries, health products including food supplements such as vitamins, which do not require a prescription, are being subjected to an additional charge.\nOne reader was informed that such products are forwarded to the Port Health Office (PHO) and a €5 charge applied on every item sent there for inspection.\nWhen contacted, the health authorities informed the newspaper that Maltapost was charging customers the new fee and that such items have always been forwarded to the PHO.\nApart from questioning why Maltese customers were being subjected to an additional charge for EU products, a letter to Times of Malta asked whether this constituted a trade barrier.\nA €5 charge applied on every item sent for inspection\nA Maltapost spokesman told the newspaper that all health products went through Customs, and it was the latter who decided what to release for distribution, and what needed to be sent to the PHO.\nOnce an item was given the green light, it was sent back to Customs and then released for distribution, he noted. This applied to all items, irrelevant of their origin and Maltapost was just the messenger in between.\nThis daily process required manpower and therefore came at a cost for the company.\nMaltapost introduced a €5 fee for every item that is flagged by Customs in January, after it reviewed its costs and informed the Malta Communications Authority of the changes.\nAsked why Maltapost did not request a public health officer to go to its offices to inspect the packages flagged by Customs, the spokesman said that this practice was in place some years ago, however the officer would only be able to drop by once a week or once in 10 days.", "comment_count": 17, "id": 3522}, {"keywords": "", "author": "", "article_body": "The number of students attending universities in the United Kingdom dropped by 18% last year, according to official higher education enrolment statistics.\nThere were 755 Maltese students attending UK universities during the scholastic year 2017-18, according to the statistics. However, the data also showed the number of Maltese students attending UK universities located overseas was largely increasing.\nOf the total number, 565 of them were attending English universities followed by Scotland (125), Wales (55) and Northern Ireland (10). There were 540 postgraduate students as opposed to 215 undergraduate students, the data showed.\nWith over 458,000 international students, the UK claims the second spot in the list of the most popular study destinations in the world. Students from Malta are also part of the large international student population in UK.\nThe number of students attending universities in the UK has been dwindling for years, the data also showed.\n3,590 students from Malta attending UK degrees outside UK\nDuring the 2014-15 scholastic year, 183 higher education providers in the UK reported 895 students from Malta, the statistics showed.\nThe number of Maltese students attending UK universities with branches overseas more than doubled between 2016 and 2018.\nThere were 1,370 Maltese students studying with UK universities in their overseas branches in 2016. In 2017-18 the figure expanded largely and there were 3,590 students from Malta attending UK degrees outside UK, climbing the charts and be-coming one of five EU countries with the highest number of students enrolled at the UK’s Transnational Education.\nBetween two consecutive academic years, 2016-17 and 2017-18, the number of Maltese students attending UK universities located outside the UK more than doubled.\nIn 2016-17, statistics show that 1,370 students from Malta were studying for UK degrees outside UK. As such, for the first time, Malta entered the list of top 10 EU countries whose students attend UK universities located overseas.\nBased on official records, during last academic year around 700,000 students of different nationalities were attending the UK’s Transnational Education (TNE) programme.\nIn Malta, foreign students from pre-primary to secondary school level more than doubled in five years and exceeded 5,000 by the end of the 2016-17 scholastic year, according to official data.\nNon-Maltese students now account for one in every 10, with the biggest increase being registered among African and Asian pupils, whose number have more than trebled, the figures show.", "comment_count": 6, "id": 3523}, {"keywords": "", "author": "Keith Micallef", "article_body": "An investigation has been launched into an electronic waste storage facility run by Wasteserv after it transpired that it was not covered by a permit, the Planning Authority has confirmed.\nThis was revealed when Times of Malta asked what course of action had been taken on the matter which the newspaper flagged last week.\nThe investigation centres on a site in Iklin, next to the Bitmac Ltd tarmac plant, which some time ago started receiving  electronic waste such as old television sets and various white goods.\nSources close to Wasteserv, which falls under the responsibility of the Environment Ministry, told this newspaper that the site had been rented out because various civic amenity sites were full to capacity.\nREAD: Overflowing civic amenity sites\nThe measure was the result of a €1 million contract signed with Bitmac Ltd, which is owned by three major road construction companies. No public tender was issued for any parties interested to offer their premises for the storage of electronic waste.\nAsked if this facility was covered by permits, a Wasteserv spokesman said that an environment permit was issued by the Environment Resources Authority, but no details were given.\nEnvironment permit issued by the ERA\nAccording to the PA website, Wasteserv submitted an application in June last year but this has not yet been approved or rejected. Furthermore, the application is listed as being currently suspended at the architect’s request.\nAsked what action the authority would be taking on the matter, a PA spokesman confirmed that an investigation had been launched following the story published by the Times of Malta. However, the authority did not commit itself as to whether an enforcement order would be issued, with the spokesman saying such a possibility was not being excluded.\nAccording to Wasteserv, the facility in Iklin will only be used for three years, until a multi-material recovery facility in Ħal Far is built.\nThe facility has been in the pipeline for a number of years now. Its aim is to act as a holding house for material earmarked for recycling.", "comment_count": 4, "id": 3524}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Gay men should be able to donate blood by August while those who go abroad might not have to wait months to contribute to the reserves, as health authorities are investing in new equipment.\nThe equipment screens blood to reduce the risk of transfusion-transmitted infections and will also test people for viruses they might have contracted from abroad.\nGay men are currently prohibited from donating blood to prevent the transmission of HIV, which is disproportionately prevalent among such individuals.\nHowever, with the introduction of what is known as Nucleic Acid Testing (NAT) equipment, men in a relationship with other men would be able to donate blood.\nLast year, Health Minister Chris Fearne had said that gay men will be able to donate blood by February this year. However, readers said they are still barred from giving blood.\nWhen contacted, a Health Ministry spokeswoman said that the equipment for NAT has been purchased and was currently awaiting delivery.\nBlood transfusion unit has a daily demand of 50 bags\nThis test would make it possible for certain diseases to be detected earlier, among them the HIV virus and the West Nile virus, she said.\nThe spokeswoman added that following delivery and installation of the equipment, the same equipment will be validated and the staff trained on its usage.\nThis meant that effectively, NAT testing would commence in about four months, she said.\nWith the new equipment, donors could be given the go-ahead to give blood without having to wait days or even months after returning from their travels.\nThe reduction in waiting time will be particularly important in summer, when the number of blood donations declines.\nIn September, Dr Alex Aquilina, head of the National Blood Transfusion Service, told Times of Malta that even a trip to Italy could expose donors to certain viruses.\nBlood donations save lives and the blood transfusion unit has a daily demand of 50 bags, often struggling to keep up.\nThose who wish to give blood and have returned from abroad over the past four weeks should call on 8007 4313 to check if they are eligible. Donors should take their identity card, driving licence or Maltese passport with them.\nTo keep updated, look up National Blood Transfusion Service – Malta on Facebook.", "comment_count": 72, "id": 3525}, {"keywords": "", "author": "Jacob Borg", "article_body": "New rules on lobbying, gifts, the misuse of public resources and insider information are being considered by the Commissioner for Standards in Public Life, Times of Malta was told.\nIn a report published earlier this week, the Group of States Against Corruption (Greco), recommended that contact between top government officials and lobbyists be disclosed along with the subject matters of such meetings.\nStandards Commissioner George Hyzler told Times of Malta his office had already started looking into these aspects and the imminent recruitment of a senior researcher and a legal consultant would help drive this forward.\nHe said the law governing standards in public life empowered him to make recommendations for improving the code of ethics for ministers, MPs and persons of trust within ministerial secretariats.\nDr Hyzler, who was appointed last October, said his office would also be exploring rules to crack down on officials who transitioned to private firms they would have regulated while in office.\nIn its report, Greco highlights what it describes as “fears” that the Standards Commissioner’s nascent office will remain a “weak body”.\nImmediately after being sworn in, Dr Hyzler indicated he would not be able to investigate the 17 Black case due to restrictions in the law as it predated the setting up of his office.\nHe pointed out that Greco made the “weak body” statement after mentioning the number of staff in his office and the fact that the Standards Commissioner had no jurisdiction over events that occurred before the Standards in Public Life Act came into force.\nHe said there was not much he could do about the restrictions in the law when it came to investigating past cases but, nonetheless, the legislation was an important step forward for governance in Malta. The law, he pointed out, was a means to promote higher standards of conduct in public life.\nOn staffing levels, Dr Hyzler said he was not facing any restrictions, although numbers alone were not a measure of his office’s effectiveness. “What really matters is whether cases of ethical misconduct are considered fairly, swiftly and without fear or favour,” he remarked.\nAnother concern flagged by Greco was the lack of powers available to the Standards Commissioner to sanction transgressions. Greco evaluators, who visited Malta last year, said they would have expected to see more effective and dissuasive sanctions available in the Commissioner’s arsenal.\nUltimately, Greco said the only sanction foreseen was for the person investigated to be admonished, unless the matter escalated to a criminal investigation because it was forwarded to the police or to the Permanent Commission Against Corruption.\nOne of its recommendations is that the Standards Commissioner is given the ap-propriate means to conduct inquiries and to propose effective, proportionate and dissuasive sanctions. Also, his jurisdiction should be extended to ongoing situations even when these resulted from actions that predated the enactment of the law setting up the Standards Commissioner’s office.\nDr Hyzler noted that he could refer breaches of the law to Parliament’s Standing Committee for Standards in Public Life, which was equally represented by government and Opposition MPs.\nIf the committee agreed with his report, it could admonish the person investigated and also demand the repayment of any public funds that could have been misused.\nThe committee could also recommend the dismissal of a person of trust, although it would be up to the government to decide whether or not to follow such recommendation, Dr Hyzler said.\nHe conceded that while admonitions or orders to apologise could be viewed as only being symbolic sanctions, viewed within the local political scene, where it was very rare for people in public life to apologise or admit they were wrong, such sanctions could be quite effective.\n“An admonition or an order to apologise for misconduct will send a powerful message that not anything goes and that such misconduct is no longer acceptable, in which case the person could pay a political price.\n“I do agree that the Standards in Public Life Act could be strengthened but I also believe that even in its current state it should be a force for the raising of standards in our country,” Dr Hyzler said.", "comment_count": 12, "id": 3526}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "About a quarter of police officers reinstated after Labour’s return to power in 2013 were allocated non-policing duties in government ministries, the Times of Malta is informed.\nPolice sources said only a handful of the over 100 officers who returned to the corps six years ago were still active in the force.\n“Most of them have retired again, though receiving a much higher pension,” a senior officer said.\nThe few remaining others, he continued, were doing office jobs at the police headquarters or asked to be seconded to government ministries, including as private secretaries to ministers they used to “help” before the election.\nAccording to recent information given in Parliament, 119 police officers were reinstated since 2013 following a change in the rules.\nTwenty-six of them are serving in ministries though still on the police payroll. These included the Office of the Prime Minister and the ministries responsible for justice, Gozo, education and transport. Others were seconded to the Freeport, Identity Malta and even an NGO.\nThe police sources described such secondments as unnecessary, deeming them “the usual political favours so certain people can continue receiving a pay without making such a big effort”.\nAccording to police rules in force until 2013, only officers who had not been in retirement for more than 10 years could rejoin.\nFormer officers aged over 55 years were not eligible for reinstatement. The rules were changed under then national security minister Manuel Mallia and former police commissioner Peter Paul Zammit, himself reinstated.\nAmong those who returned to the force post-2013 were officers who had retired more than 25 years earlier, in 1986 and 1987. Some of those who passed the medical exam to rejoin were already over 61 years old.\nSome of the reinstated officers worked for a few hours a week, receiving a pro-rata payment in addition to their service pension.\nSome of those who rejoined in 2013 were promoted and left the force soon after, making them eligible to a higher pension.\nIn a case that hit the headlines, an officer who had retired 12 years earlier and who could not stand on his feet for an extended period of time and even qualified for a blue badge, was reinstated and promoted to the rank of sergeant. He was detailed to the VIP section at Malta International Airport.\nivan.camilleri@timesofmalta.com", "comment_count": 52, "id": 3527}, {"keywords": "", "author": "", "article_body": "A 26-year-old German tourist has been found dead at a hostel in St Julian's, the police confirmed on Saturday. \nA magisterial inquiry has been opened and an autopsy will be held to establish the cause of death, however at this stage no foul play is suspected, the police said. \nThe victim was found dead on his bed in his room. Three other tourists were occupying the same room. No further details are available.\nThe German embassy has been informed about the incident. \nThe police are investigating. ", "comment_count": 0, "id": 3528}, {"keywords": "", "author": "", "article_body": "Fitness enthusiast and 'influencer' Tamara Webb opens up about her struggles on her journey towards a healthy lifestyle on this month’s edition of Sunday Circle.\nOne of Malta’s most recognisable faces, Ms Webb has used social media to share her experiences about the challenges that life in the fast lane can bring with it. Now she opens with Sunday Circle readers to talk about the ups and downs of fame, her struggles with body image and her fitness routine.\n“Balance is important in everything we do and, with all the images we see on social media, it can be easy to think that all some people do is work out, eat healthy and look fabulous. I fell for it too, but I’ve since worked hard to reach a point in my life in which I am comfortable with failing and with not being ‘the best’ at things.”\n\nThe magazine is out this weekend with The Sunday Times of Malta, together with the fully-interactive digital edition that will be accessible on the TOM Mag app.\nThe magazine this month also turns the spotlight on volunteers who dedicate their time towards helping dogs find a new home, following the inspiring story of Francesca Runcie and Rosalind Agius, two of the driving forces behind the Association for Abandoned Animals.\nBalance is important in everything we do\nTwo Maltese icons also take centre stage with two separate artistic exhibitions taking inspiration from the all-time favourite pastizzi and ravjul, as the magazine delves into the pop culture aspect that makes their popularity so evergreen.\nThe digital edition of the magazine offers readers the opportunity to win some really fabulous prizes, including Diego Dalla Palma and Kiehl’s Musk goodies and two €50 vouchers from Parfois.\nClarins are also offering all digital readers a free starter pack including Matifying Hydrating Cream, Re-Charge Relaxing Sleep Mask, Purifying Cleansing Gel and Pore-Less Blur and Matte Stick. Readers can find out how to collect their free gift by reading the digital edition.\nSince its launch in October, the digital app keeps attracting a strong and loyal following, with thousands having already downloaded the app and experienced a host of fun features.\nIf you have not done so already, download the digital version of Sunday Circle by looking up TOMMag on Google Play and Apple Store.\nThere’s also fashion, shopping, personalities and more. So, don’t forget to check out the print or digital version of this month’s edition of Sunday Circle.\nSunday Circle is published by Allied Newspapers Limited.", "comment_count": 16, "id": 3529}, {"keywords": "", "author": "", "article_body": "The Transport Ministry is being challenged to reveal all studies related to the proposed tunnel between Malta and Gozo through a judicial protest filed by 12 organisations. \nThey also asked for a Strategic Environmental Assessment to be carried out as required by national and EU laws.\n\"This game of hide and seek and of withholding essential information must stop. The proposed tunnel will have enormous and far reaching consequences on the health, quality of life and environment of all who live in Malta and Gozo,\" the NGOs said.\nCitizens cannot be left in the dark about the true implications of such momentous decisions.\n\"We call upon the authorities to publish all the studies so that citizens may develop an opinion based on facts. That is a major principle of democracy.”\nRead: Hold your horses on Malta-Gozo tunnel, NGOs warn\nThe 12 organisations filing the judicial protest are: Din l-Art Ħelwa, Ramblers' Association of Malta, Nature Trust (Malta), BirdLife Malta, Friends of the Earth Malta, Moviment Graffitti, the Archaeological Society Malta, Flimkien għal Ambjent Aħjar, Kamra tal-Periti, Isles of the Left, Bicycle Advocacy Group and Żminijietna – Voice of the Left.\nThe Church Environment Commission had also joined NGOs warning there was no reliable information in the public domain\nThe government has shrugged off criticism that the public was not adequately informed about its planned tunnel linking Malta and Gozo, insisting the studies would be published \"soon\".\nPlans for a 13-kilometre tunnel between Manikata and Nadur will be forging ahead, the government said, insisting the project was part of its 2017 electoral mandate.\n ", "comment_count": 62, "id": 3530}, {"keywords": "", "author": "Denise Grech ", "article_body": "The general asking price level of properties jumped around 25 per cent in one year, a study by KPMG has shown.\nThe study, published on Friday, revealed the estimated overall growth in price level of properties increased between 20 and 25 per cent during the period 2016-2017.\nThe findings were part of a study commissioned by the Malta Developers Association and were an update to the Construction Industry and Property Market report first published in October 2017.\nIn all, the construction and real estate sectors contributed around 13.5 per cent of the country’s gross value added in 2017. The construction sector was the biggest economic multiplier.\nContractors were more environmentally conscious, but the market often did not prioritise this particular sector, they lamented. They also noted it was a challenge to find both skilled and unskilled workers.\nNo property bubble but concerns of market overheating\nThe property market had become more dependent on financial services and gaming, making Malta’s economic attractiveness crucial, KPMG advisor David Pace said during the presentation of the results.\nWhile there was no property bubble, there were still concerns about possible market overheating, Mr Pace noted.\nYesterday, Malta Developers Association Sandro Chetcuti noted the construction industry was not the only reason for economic growth, which was diversified enough to be affected by multiple sectors. Everything indicates that employment is increasing to this day, he said.\nWhile there were concerns of oversupply, making the market unsustainable, the industry could remain on the right track if it moved carefully, he added.\nPrime Minister Joseph Muscat welcomed the findings, saying that the study dismissed concerns of a housing bubble.\nThe market, however, would need to regulate itself and the issue was not whether they made a quick buck or not, but rather about ensuring “stakeholders did not spit in the same well they drink from”.\nThere was no pumping the brakes on the economy, he warned, adding that what it needed was to remain diversified.\nThat way, he noted, when one sector received a setback, other sectors in the country could make up for it.\n“The only way forward is growth,” Dr Muscat contended.\n“We cannot be satisfied with what we have. That is a fallacy and a fairy tale.”", "comment_count": 39, "id": 3531}, {"keywords": "", "author": "Jacob Borg", "article_body": "Almost half of foreign workers exited the labour market after a period of between one and two years, a study by the Central Bank has found.\nA 2019 policy note by the Central Bank found that between 2002 and 2017, 25 per cent of foreign workers left the labour market within the same year they were employed and 45 per cent after between one and two years. Only 30 per cent remained employed in the Maltese labour market for more than six years after their first engagement, the study found.\nThe amount of foreign workers has been the subject of much political debate recently.\nPrime Minister Joseph Muscat has gone as far as declaring that those who did not want foreign workers in Malta would also be turning their back on economic growth and social measures like pensions.\nRead: If you don’t want more foreigners, say goodbye to pensions, warns Muscat\nJobsplus chief Clyde Caruana said during a recent interview with The Sunday Times of Malta that the country would require another 13,000 foreign workers this year alone to maintain the economic growth.\nWhen comparing Malta’s migration flows to those experienced by other European countries, the Central Bank found that the island had a dual phenomenon of large migrant inflows and outflows.\nIt had the second largest immigration rate in 2015 but, that same year, Malta experienced the third highest re-emigration rate.\nSince migration to Malta in the last few years was mostly related to work opportunities, the large flows suggested that while the country had managed to attract a large number of foreign workers, their length of stay was rather short, the Central Bank noted.\nThe average length of stay of foreign workers is three-and-a-half years, relatively unchanged since 2012.\nExit rates had limited evolution over time and indeed remained quite high throughout the period 2002 to 2017, the study said.\nNon-EU nationals were found to stay in the labour market for longer than foreign workers from the EU.\nThe exit rate of European Union nationals was said to be six per cent higher than those of third country nationals during the first year of employment. The exit rates converged over longer durations.\nForeign workers in Malta tended to be quite young, as 27 per cent employed between 2002 and 2017 were under 25 and 43 per cent fell into the 25 to 34-year age bracket.\nIn general, those in the youngest age brackets tended to have the lowest length of stay.\nThe highest skilled foreign workers tended to have a longer length of stay but the results were mixed when comparing low- and medium-skilled employees, the study noted.\nThe high exit rates meant it was difficult for their wages to converge with those of the native population.\nVery few foreign workers change their job or improve their employment occupation while in Malta.\nThe lack of labour mobility within the Maltese labour market, in turn, posed challenges to labour productivity growth as firms had to consistently hire new workers, with limited gains from ‘learning-by-doing’, the Central Bank said.", "comment_count": 87, "id": 3532}, {"keywords": "", "author": "", "article_body": "A man sustained grievous injuries after a transport coach he was working under fell on top of him, the police said. \nEmergency responders were dispatched to Wesgħet il-Vittmi tal-Gwerra, Luqa, on Friday night upon being alerted to the accident. \nThe 25-year-old had been carrying out works under the coach when for some reason the vehicle rolled off its jack, crushing him beneath, the police said. \nThe victim was rushed to Mater Dei Hospital where he was certified to be in serious condition. \nPolice are investigating. ", "comment_count": 0, "id": 3533}, {"keywords": "", "author": "", "article_body": "A 74-year-old man who had been reported missing at the Birżebbuġa police station has been found. Carmel Spiteri\nCarmel Spiteri was last seen on Friday night at the Birżebbuġa parish church. \nIn a statement, the police said the man had been found and thanked the public for its help. ", "comment_count": 0, "id": 3534}, {"keywords": "", "author": "Herman Grech", "article_body": "Updated 12.30pm with Sea-Eye Comments\nA humanitarian vessel with 64 migrants on board is heading to Malta after it was rebuffed by Italy in what appears to be another protracted migrant saga in the making.\nThe vessel Alan Kurdi is now on its way to Malta as it is the next safe harbour and the ship will need weather protection, the NGO Sea-Eye said in a statement.\n\"We are very worried about the weather. Some of those rescued are sleeping on deck. We will follow the instructions of the Maltese authorities not to sail into Maltese waters without permission. But we cannot sustain this situation for many days and will quickly need drinking water and food,\" Sea-Eye Gorden Isler told Times of Malta.\nTwo children and 12 women are on board, including two who are pregnant.\n\"We hope your Prime Minister will help us. The year is still young and there is enough time to argue with other politicians for more far-reaching solutions. But for the moment 64 people need help, urgently.\"\nThe Alan Kurdi vessel.\nA government spokesman told Times of Malta the vessel was now located around 30 miles off Malta after it was refused to dock on the island between Friday and Saturday.\n\"We are monitoring the situation,\" the spokesman said.\nSea-Eye is one of the few NGOs still operating in the Mediterranean amid an clampdown against humanitarian organisations. \nBoth Italy and Malta have refused it a safe harbour, leaving the migrants sleeping in cramped conditions on deck as a storm approached.\nOn Friday afternoon Italy finally agreed to evacuate two children with their mothers for humanitarian reasons, sparking protests from Sea-Eye.\n\n\"To separate mothers and children from their fathers without a proper reason is active family separation and emotional torture,\" said spokesman Gorden Isler.\nSea-Eye said the experience with the Italian government so far showed there was no trust nor confidence in a quick, responsible and humanitarian solution.\n\"It is all about the safety of the rescued people. Because they are human beings and that alone is enough to grant them the same human rights that we claim for ourselves,\" Mr Isler said.\n\"Matteo Salvini not only humiliated the rescued. He instrumentalises everything and everyone to derive the greatest possible political benefits from this situation for himself. The many Italian hate mails that have reached us in the last two days show that he is successful,\" Mr Isler said.", "comment_count": 0, "id": 3535}, {"keywords": "", "author": "Denise Grech ", "article_body": "Three young men charged with hijacking a vessel are being allowed just one hour outside their cell at the high-security division of the adults’ prison in Corradino, the Times of Malta has learned.\nLawyer Neil Falzon confirmed his clients – aged 15, 16 and 19 – were being held in the high-security division of the prison. Keeping the two minors in an adults’ prison would be in breach of magistrate’s orders to give them full State care, he argued.\nThe three teens have pleaded not guilty to charges of seizing a vessel through the use or threat of force and intimidation. The “seized vessel” made its way to Malta last week with some 100 people aboard after the captain of the El Hiblu 1 told authorities he was not in control of the vessel.\nRead: Three teens charged with terrorist activity in ship hijacking case\nIf found guilty, the three teens face between seven and 30 years behind bars.\n“We demand to know who took this decision and on what criteria. We remind the authorities that our clients are young men who are to be presumed innocent until proven otherwise,” Dr Mifsud said.\nWe demand to know who took this decision\n“We fear the damage already done to their well-being but hope justice will prevail,” he said.\nSpeaking to Times of Malta on Friday, Home Affairs Minister Michael Farrugia insisted he could not disclose where the teenagers were being kept.\nHe also said he had no say in the circumstances, arguing it was the Corradino Correctional Facility’s director’s responsibility to see where the accused were kept.\nAsked whether it would be in breach of the magistrate’s orders if the youngsters were not kept at a youth section of the prison, Dr Farrugia said he did not interfere with the decisions of the director at CCF.\nAttempts to reach prisons’ director Alexander Dalli proved futile by the time of writing.\nAsked about the fate of some 100 people who disembarked from the vessel last week, Dr Farrugia said they were still being treated as part of the ongoing investigations.\n“We also need to see if there will be legal steps taken against the ship and crew,” he said.\nLast week, the Times of Malta reported police were questioning the captain’s version of events.\nInvestigators were looking into the possibility the skipper could have “misled” authorities by claiming he had lost control of the vessel after he rescued them off Libya.", "comment_count": 0, "id": 3536}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that new rules on lobbying, gifts, the misuse of publicresources and insider information are being considered by the Commissioner for Standards in Public Life. It also reports that three young migrants charged withhijacking a vessel are being allowed just one hour outside their cell at the high-security division of the adults’ prison in Corradino.\nL-orizzont says Toly Products had invested €20 million in a new factory. It also carries an interview with the project manager of a new school in Qawra who underlines the need for quality work.\nThe Malta Independent cites a report published on Friday which showed that property prices rose by more than 20 per cent between 2016 and 2017. \nPicking on the same issue, In-Nazzjon says more Maltese were facing the problem of high property prices. It also quotes PN leader Adrian Delia saying the government had lost its social conscience. ", "comment_count": 0, "id": 3537}, {"keywords": "", "author": "Denise Grech ", "article_body": "Nationalist party leader Adrian Delia said on Friday he felt \"humiliated\" by children who scolded politicians for not taking care of the environment.\nHe said he came out of a Parliamentary sitting with children for the EkoSkola event with his head held down. \n\"Children care about the environment,\" he said. \"Kids are angry, they are upset they will look back and see we ruined our country's environment,\" Dr Delia said, insisting now was the time to act.\n\"I was humiliated in front of our children's calls that we raped the environment. We need to understand our responsibility,\" Dr Delia added.\nHe also said he had met 1,960 businesses that were struggling, noting small businesses were not doing well. This was the government of big business with a hunger for power, Dr Delia added.\nIt was also important for people to understand how corruption affected their day-to-day lives, he said, adding it was not just something speculative politicians spoke about.\nHe referred to studies showing corruption cost taxpayers in Malta €725 million every year. That money could be used to give people medicine or alternative accommodation when they needed it, he said.\nThe Labour party, he said, was only hungry for power that resulted in people's suffering. The PN was ready to take on the challenges of those suffering to show that the arrogance of the current government could change, he said.\nEnding his speech, Dr Delia said PN candidates were lifting their weight and doing their part. In a call for action, he encouraged those listening to join the PN and use their voice. \n ", "comment_count": 50, "id": 3538}, {"keywords": "", "author": "Claire Caruana", "article_body": "Education Minister Evarist Bartolo dismissed teachers’ concerns on the new applied subjects being launched in the next scholastic year, insisting the issues will be sorted out before September.\nCommenting to Times of Malta in the wake of concerns flagged by the teachers’ union that the introduction of the new subjects was half-baked, Mr Bartolo insisted that any “genuine” issues that could be addressed would be dealt with ahead of the launch.\n“Meetings have been going on with teachers and they will continue. We will address genuine concerns and we want to make sure we prepare our teachers for this new development,” he said.\nHe added that the introduction of the new subjects, which will see students learn solely through a hands-on approach, would benefit not only the pupils but their teachers too.\nOne of the reasons students misbehaved, Mr Bartolo noted, was because they felt their educational experience was irrelevant. Pressed on whether the government would insist on launching the new subjects “come what may”, even in light of scepticism by the teachers that the change would be incomplete, Mr Bartolo reiterated that the government would be sticking to its planned timeframes.\nWe want to make sure we prepare our teachers for this\n“No, we will take all the necessary action to introduce these subjects. The biggest challenge in education is always how to do things with urgency but slowly because if you rush things that would be a problem,” Mr Bartolo said.\nThe 13 new subjects in the pipeline mark a major shift in the education system, moving away from a purely academic approach. State school students struggling with traditional teaching methods will be able to take subjects focusing on hands-on learning when the new academic year starts.\nThe Malta Union of Teachers has warned there might not be enough educators to cater for all the new subjects and said a number of educators who signed up for a 10-day crash course to obtain the skills needed to teach such topics had dropped out, which the ministry refuted. It insisted that 62 people had attended and concluded the course.\nThe teachers’ union said it was informed that several people had opted not to take up the teaching of the new subjects after attending the course.", "comment_count": 5, "id": 3539}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Heritage groups have called for the preservation of what looks like an underground vaulted reservoir discovered underneath a historic Sliema home being turned into a boutique hotel.\nThe underground vaulted reservoir discovered underneath a historic Sliema home.\nThe Sliema Heritage Society was contacted after Times of Malta received photographs from concerned residents over what could be a historical discovery.\nBuilding industry sources said the Planning Authority permit usually contained a standard condition that the Superintendence of Cultural Heritage must be informed of any historical finds.\nThe Cloisters, a Grade 2 scheduled building in Mrabat Street, is being converted into a 29-bedroom boutique hotel, with a stepped block of 27 apartments and maisonettes overshadowing it at its rear by replacing the garden with a seven-storey development.\nThe permit was granted to Bilom Group in February last year. The project will see the addition of a storey to the facade and the obliteration of the extensive back garden, making way for an apartment block rising 21 metres above the building, which is within the urban conservation area.\nThe application had been recommended for approval by the Planning Directorate and the Superintendence of Cultural Heritage had raised no objections.\nThe heritage watchdog, which visited the site and met the architect to discuss details of the project, noted that the Cloisters building had architectural and historic value and lay close to several other scheduled properties.\nCall for immediate action to ensure its preservation\nIt also noted that the project would involve the restoration of the historic building and the demolition of non-scheduled parts of the property.\nAlterations on scheduled buildings can only be carried out if they are sensitive and do not detract from the character or architectural homogeneity of the site.\nA spokesman for the Sliema Heritage Society, which had objected to the development, said the vaulted reservoir was something that should be preserved.\nHe called on the Superintendence of Cultural Heritage to take immediate action to ensure its preservation and inclusion in the project.\nThe approved plans includes the creation of underlying garages having 55 parking spaces. With the discovery of the reservoir, the garages might need to be scrapped or changed, the spokesman said.\nThe Superintendence for Cultural Heritage did not reply to questions on whether it was aware of the find.", "comment_count": 11, "id": 3540}, {"keywords": "", "author": "Denise Grech ", "article_body": "Newly-appointed President George Vella said he never imagined himself as President, but insisted he was committed to see the country move forward once he decided to assume the role.\nSurrounded by Cabinet members at the Presidential Palace in Valletta, President Vella recalled memories of working with his former colleagues.\n\"We had our disputes, but that is normal in politics... My friends are now people who legislate and write the laws of this country,\" he said. \nDuring a courtesy call, he said he looked forward to be a \"moral compass\" and that he would not hesitate to express himself where he disagreed with others. \nHe also made calls for a fair and equal distribution of wealth, saying there were people who were \"not comfortable\", despite the economic progress.\n“I will endeavour to be a reference point and to act as moral compass, and will be pointing out anything I think I should give my views upon,” President Vella said.\nWomen also needed more rights to be on par with rights men, he said. \nDespite conceding he set himself an \"ambitious programme\", President Vella said he was happy to aim high. \nPrime Minister Joseph Muscat said he had no doubts the new President would continue to steer the country in the right direction. \nPresident Vella's speech had touched and inspired everyone, Dr Muscat said. \nRead: President Vella delivers unifying address after swearing-in", "comment_count": 54, "id": 3541}, {"keywords": "", "author": "", "article_body": "An argument between an estranged couple on Thursday morning caused the woman to suffer a fractured arm while the man ended up in court on Friday under arrest, regaining his freedom under the strict terms of a bail decree.\nCharged with willfully and grievously injuring his estranged spouse, threatening her and breaching the peace, the 65-year-old Żebbuġ pensioner pleaded not guilty to all charges.\nProsecuting Inspector Alfredo Mangion explained how Thursday’s incident had erupted when the former couple, currently de facto separated, came across each other at a garage annexed to the matrimonial home where the woman still resided.\nThe man reportedly visited the place regularly since he used the garage as a store for wares, related to his part-time occupation.\nHowever, Thursday’s encounter between the two sparked off an argument which escalated to the point that the woman ended up suffering grievous injuries, while her alleged aggressor ended up in police custody.\nDefence counsel Franco Debono and Marion Camilleri submitted a request for bail, arguing that the couple had been living apart for the past 12 years and there had never been any prior incidents.\nThis request was objected to by the prosecution on account of the fact that since the couple were not legally separated, the accused had access rights to the matrimonial home, making future encounters with the alleged victim possible.\nHowever, the defence countered that the man needed to retain access to the garage to get on with his part-time work as a green grocer.\nIn the light of these submissions, the court, presided over by magistrate Gabriella Vella, upheld the request, granting bail but imposing strict hours of access to the garage by the accused in such manner as to avoid meetings with his wife, who was present in the courtroom throughout the arraignment.\nThe court imposed a deposit of €500, a personal guarantee of €10,000 and an order to sign the bail book on a daily basis.", "comment_count": 0, "id": 3542}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man was denied bail after pleading not guilty to raping and beating his former partner on several occasions spanning a number of years.\nAhmad Abu Hassan, a 56-year old Syrian baker, residing at Cospicua, was arraigned on Friday over charges of raping, insulting and threatening his victim, causing her to fear violence.\nThe man was also charged with committing the acts during the operative term of a suspended sentence as well as with being a relapser.\nSources said that when the two broke up, the accused kept  turning up at the woman's home insisting on having sex. When she refused, he became aggressive and forced himself upon her. The last violent incident occurred on April 1.\nDefence lawyer Joseph Brincat pointed out that the alleged victim had been phoning the accused several times over the past four years, inviting him over to her home.\nThe man denied the charges and requested bail.\nHowever, the request was objected to by prosecuting Inspectors Trevor Micallef and Roxanne Tabone.\nAfter hearing submissions by both parties, the court, presided over by magistrate Gabriella Vella, turned down the request in view of the gravity of the charges and the fact that the alleged victim was still to testify.\nLawyers Arthur Azzopardi and Alfred Abela appeared parte civile.", "comment_count": 0, "id": 3543}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young German student who blackmailed a Maltese married man with whom she had a brief affair, threatening to spill the beans to his wife, was given a suspended sentence after admitting her wrongdoing in court.\nEssoutouti Asia, the 23-year old woman, was arrested at a Paceville hotel where she was lodging after the police in Malta received a report alleging that the young lady had traveled to the island, demanding a €60,000 car from her victim against threats of disclosing compromising videos and photos to his wife.\nThe woman was arrested and arraigned on Friday over charges of extortion, harassment, misuse of electronic communications equipment and possession of pepper spray.\nThe prosecution explained how the Maltese man had met the young woman on a trip to Germany, the encounter ending up on an intimate level after the woman allegedly got him drunk, took his credit card and extorted €15,000 out of pocket in exchange for parting company without telling his wife.\nHowever, the woman later extorted more money from the businessman by claiming she was bearing his child, sending him an ultrasound scan belonging to her pregnant sister to back her claim.\nThe prosecution explained in court on Friday that the woman had admitted under interrogation that the ultrasound image was not hers.\nLawyer Joseph Giglio, appearing parte civile, requested the court to order the destruction of the mobile phone as well as all the other compromising material evidence which could possibly leak the victim’s identity.\nLegal aid lawyer Joseph Ellis explained that his client had repented for her wrong and was truly sorry.\nMoreover she had a clean criminal record, Dr Ellis argued, adding that “a suspended sentence would be a sword of Damocles over her so she would not repeat the reprehensible acts.”\nProsecuting Inspector Elton Taliana also pointed out that the accused had cooperated.\nThe court, presided over by magistrate Gabriella Vella, after hearing these submissions declared the accused guilty upon her own admission and condemned her to an 18-month jail term suspended for four years.\nThe court also ordered the confiscation and destruction of the woman’s mobile phone.", "comment_count": 0, "id": 3544}, {"keywords": "", "author": "", "article_body": "More than two million passengers passed through Malta International Airport between November and March leading the company to post growth of 5.9% in traffic over the same period last year.\nThe growth was observed in line with an 8.1% increase in aircraft movements and a 7.6% increase in seat capacity. Seat load factor (SLF) for the season stood at 76%.\nThe airport’s enhanced winter flight schedule was an important factor in the attainment of the results, the airport said.\n“Having an extensive route network is crucial in securing year-round traffic, but it is the unceasing efforts of our people which ensure that we can continue to provide safe and delightful airport journeys to an ever-increasing number of passengers,” Malta International Airport CEO Alan Borg said.\n\nNew developments and better frequencies on several routes, introduced by the winter schedule, led all of MIA’s top five markets, with the exception of Germany (-2.9%), to experience growth. While the United Kingdom and Italy registered modest growth rates of 0.3% and 3.3% respectively, at 14.7% and 63.1%, France and Spain registered more substantial increases.\nOutside the top five drivers of traffic, other markets that performed exceptionally well included Slovakia, Portugal and Estonia. The results achieved by these three markets could be attributed to the operation of the Bratislava, Porto and Lisbon, and Tallinn routes in the winter months for the first time.\nBringing winter to a close, March registered an increase of 1.3% in passenger movements. This modest increase was mainly due to the fact that the Easter holiday effect occurred in March last year.", "comment_count": 9, "id": 3545}, {"keywords": "", "author": "", "article_body": "Prompt action by the Civil Protection Department prevented a fire in a Pembroke apartment from spreading further on Friday afternoon.\nThe department said that the fire was started by a washing-machine but that no-one was hurt in the blaze.\nThe apartment is located in Triq Pietru D'Armenia.\nInvestigations are under way.", "comment_count": 0, "id": 3546}, {"keywords": "", "author": "Denise Grech ", "article_body": "Construction industry stakeholders called for higher standards at the Planning Authority, saying buildings should contribute to the country's aesthetic rather than construction waste.\nVarious operators in the industry were contacted for a KPMG study on the construction industry and property market commissioned by the Malta Developers' Association.\nThe findings covered the year 2018 and were an update to the Construction Industry and Property Market report first published in October 2017.\nIn all, the construction and real estate sectors contributed around 13.5 per cent of Malta’s gross value added in 2017. The construction sector was the biggest economic multiplier.\nContractors were more environmentally conscious but the market often did not prioritise the environment, they lamented. They also noted it was a challenge to find both skilled and unskilled workers.\nThe property market had become more dependent on financial services and gaming, making Malta's economic attractiveness crucial, KPMG advisor David Pace said during the presentation of the results.\nWhile there was no property bubble, there were still concerns about possible market overheating, Mr Pace said.\n'Don't spit in the well you drink from,' Prime Minister warns\nPrime Minister Joseph Muscat welcomed the findings, saying the study dismissed concerns of a housing bubble.\nThe market however, would need to regulate itself and the issue was not whether they made a quick buck or not, but rather about ensuring \"stakeholders did not spit in the well they drink from\".\nNoting that the study found that the market had grown by 9 per cent in one year, Dr Muscat noted this was not the biggest growth sector.\nThere was no pumping the brakes on the economy, he warned, adding that what it needed was to remain diversified. That way, he noted, when one sector received a set-back, other sectors could make up for it.\n\"The only way forward is growth,\" he said. \"We cannot be satisfied with what we have. That is a fallacy and a fairy tale,\" he added.\nGrowth was not without its problems, he noted, adding that affordability was becoming a concern. The issue of affordability was generated by the high demand was coming from a fast-growing economy - but without that economy, many other sectors would not be viable.\nOn quality, he stressed that this needed to percolate across all types of property, and not just high-end ones.\nMDA boss urges Muscat to stay on\nMalta Developers Association Sandro Chetcuti made an impassioned plea for Dr Muscat to stay on, saying the developers' lobby was \"concerned about the fact he was leaving\".\nDr Muscat has repeatedly said he would serve for only two terms as prime minister.\nThe next prime minister should ensure the work already in place by Dr Muscat would continue, Mr Chetcuti said.\nSpeaking on the KPMG study, Mr Chetcuti noted the construction industry was not the only reason for economic growth, which was diversified enough to be affected by multiple sectors. Everything indicates that employment is increasing to this day.\nWhile there were concerns of oversupply, making the market unsustainable, the industry could remain on the right track if it moved carefully, he said.", "comment_count": 38, "id": 3547}, {"keywords": "", "author": "", "article_body": "The joint owners of immovable property in Xagħra failed to convince the European Court of Human Rights the government had acted incorrectly with them when it took over their land 36 years ago.\nThe six applicants owned two pieces of land in Xagħra that was taken over by the government by virtue of an acquisition order in November 1983. No offer for compensation had been made as the authorities were in duty bound to do by law.\nIn view of the fact that no official action had been taken to regularise the situation they instituted a constitutional case in 2004. The owners claimed a violation of their right to property since they had received no compensation, also complaining they had not been given access to a tribunal to force the authorities to pay them.\nThe deed of transfer of the land in question was finally published 10 years later and the owners were paid €1.3 million, which was the value established by the Land Arbitration Board, plus interest. However, the interest was calculated as the average between the amount initially offered by the Land Commissioner and that decided by the Land Arbitration Board.\nThe owners felt their property rights had been breached, arguing that the interest paid was substantially lower than what they would have received under previous practice.\nThe State had compelling public interest motives\nThe Civil Court (First Hall), in its constitutional competence, rejected their claims in May 2016. They appealed but the Constitutional Court threw it out in November of that same year.\nThe Constitutional Court argued that the value of the land was based on a 2005 valuation, which meant the joint owners had already benefitted from the increase in value of the property. It followed that a calculation of interest based on a mean between the two valuations was adequate in the circumstances, it added.\nThe owners took their case to the European Court of Human Rights in the first quarter of 2017 arguing they had been subjected to legislative interventions that had shifted the balance in favour of the government. \nThe European judges, among them Chief Justice Emeritus Vincent De Gaetano, commented in their decision that a State could enact general legislation, which could prove unfavourable to litigants, if it did not actually target pending judicial proceedings and was not aimed at circumventing the principle of the rule of law.\nIn this case, the Strasbourg-based Court found that the legislative action the land owners complained of did not change the existent legal framework relating to compulsory purchase or compensation but only a general practice on the calculation of interest on compensation, which had not been regulated by law before.\nFurthermore, it noted, the legislative action in question did not determine the substance of the dispute but only affected the calculation of interest, usually based on the final payment by the State and not necessarily determined judicially.\nThe European Court judges felt that the State was only trying to regulate a lacuna in the law, which could have led to applicants taking advantage of interest rates that did not reflect the realities of the market and, in turn, allowed them to make windfall profits. In fact, they added, the State had compelling public interest motives in taking the legislative action it took.\nIn the circumstances, the joint owners’ complaint with regard to unfavourable legislative intervention was declared inadmissible.", "comment_count": 4, "id": 3548}, {"keywords": "", "author": "", "article_body": "The facade of the Old University Building in Valletta is slowly but surely regaining its former glory as a restoration project works its magic.The €1.5 million project is tackling an area of over 8,000 square metres, while tenders for internal work will be left to the second phase. The first phase should be ready by the end of next year.\nThe project envisages the restoration of both the Jesuits church and the Old University Building.\nThe restoration of the outside of the Jesuits church was finalised in 2018.\nWorks started with the Jesuit Church.\nWorks are currently undergoing on the outside fabric of the old collegium, with works on the façade of the Old University overlooking St Paul’s street finalised. Works are currently underway on the façade overlooking Merchant Street, with restoration works on the St Christopher street façade starting in the coming weeks.\nThe façade facing Merchant Street has large amounts of cement plasters on the lower storey, probably due to large deterioration and these are currently being removed using hand tools to avoid damage. The façade also has large amounts of black crusts, which will be cleaned carefully. It also has considerable areas of highly deteriorated stones especially on lower levels and around window apertures. Works will also include restoration of statues and their pedestal, present on the façade.The proposed works for the St Christopher street façade are very similar to the works on Merchant street and to St Paul’s too, the latter being the latest phase to be completed.This portion of the façade is not part of the original structure dating back to the early 1600s but is one of the later reconstructions, which occurred throughout the building’s use.\nThe current main entrance to the Old University lies along this façade. Its imposing portico was constructed in 1824 and is an example of neoclassical architecture, with the Royal Coat of Arms of the United Kingdom.\nThe corner statue of St Stanislaus Kosta, which was heavily damaged in an impact by a passing vehicle, was painstakingly restored and painted for protection. All the apertures were cleaned, maintained and painted including the two large gates on the ground floor.", "comment_count": 0, "id": 3549}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 4.30pm, adds comments from Chamber of Commerce\nPaternity and parental leave should be remunerated by the government because it is a social service, according to employers and small and medium enterprises.\nThe extension of paternity leave to 10 days, and two months paid parental leave for each parent until their child turns eight was given the green light by the European Parliament on Thursday.\nThese benefits form part of the Work-Life Balance directive, which was negotiated by Nationalist MEP David Casa.\nWhen it was proposed, the directive divided opinion.\nContacted following the European Parliament's vote, director general Joseph Farrugia said the Malta Employers’ Association's stand on such issues was based on the fundamental principle that social services were paid by the government not employers.\nMr Farrugia was asked to comment about the previously unpaid four months parental leave which will now have to be paid.\nEmployers paid wages and salaries through the value-added generated by the company or organisation. Social services were paid from tax revenue, he said.\nAsked what he thinks about the fact that parental leave is non-transferrable, he said that family responsibilities should be shared by both parents, and the sharing of parental leave was a step in this direction.\nRead: Use surplus to fund paternity leave, Casa says\n“This is a clear sign to society as a whole. We cannot expect women to carry the burden of employment and family commitments.\n“In spite of challenges which such a change may present on many levels, this is the way to go.”\nThe Chamber for Small and Medium Enterprises (GRTU) agrees with the non-transferrable concept and believes it was important for employees and employers.\n\"The sharing of family responsibilities should be encouraged further because the more parents move towards the equal sharing of parental roles the more women will be in a position to be at work and maintain their careers. This would have a positive impact on the economy and employers,\" CEO Abigail Mamo said.\n'We are against a one-size-fits-all approach'\nHowever, GRTU also believes that parental leave pay should be covered by the state.\nThe directive introduces the concept of payment but leaves the amounts and method of remuneration in the hands of member states.\nThe payment will make feasible an already existing right, and therefore more frequently taken up, according to Ms Mamo.\n\"From a small business perspective, one needs to appreciate that the staff complement is very limited. Not having a person at work for months is a significant stretch of time and sharing the workload and making up for that absence is a very difficult task.\n\"We believe the government must do its bit and contribute to this end through paying the parental leave itself. It is, after all, a social measure and such measures should be state funded.\" The government must do its bit and contribute\nIn January, Ms Mamo had told the Times of Malta that introducing paternity leave at European level was not considered appropriate and the GRTU disagreed with it. \nDoes the GRTU still hold the same position?\n\"We are against a one-size-fits-all approach and unfortunately this is the way the EU has legislated. Such discussions and decisions are better catered for at member state level, because at national level we can adapt based on our countries’ circumstance, being in a position to move forward and not shock the system,\" she said.\nMalta, according to Ms Mamo, was the member state that was currently furthest from the 10 days paternity leave as imposed by the directive, and this should have been taken into consideration.\n'Take all necessary precautions and safeguards' - Chamber\nThe Chamber of Commerce called on the government to put all the needed precautions in place and safeguard sustainable employment once the directive is transposed into local legislation.\nChamber director general Kevin Borg said the chamber, through the Malta Business Bureau, had played a key role during the consultation process related to the directive.\nIt had prepared an extensively researched dossier to mitigate the potential impacts of the proposal on European businesses, especially SMEs.\nIn the report, which was submitted to European Institutions, the Chamber called for a degree of flexibility, and for member states to decide on the parental leave entitlement.\n“The Malta Chamber welcomes the fact that this level of subsidiarity has been granted and remains of the belief that such parental leave should be paid by the government, not the employer.”\nThe Chamber was fully in favour of the introduction of family friendly measures, but the cost of these could not be borne by business.\n“In an economic reality where labour costs are increasing faster than productivity levels, further labour related burdens would continue to jeopardise the competitiveness and sustainability of businesses in a price-sensitive international market,” he added.\nThe ball was now in Malta’s court and in the interest of jobs, the Chamber reiterated its call to the government to keep international cost competitiveness in high priority, Mr Borg said.", "comment_count": 86, "id": 3550}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A former police constable who broke into a parked vehicle and made off with its dashboard, was placed under probation and a 200-hour community service order after admitting to the theft.\nThe court argued that a person could go through dark patches in life, possibly resulting in acts which “cast a shadow upon a 30-year career within the police”.\nNevertheless, it observed that public officers – including police, armed forces, civil protection officers and community officers – were to abide by the law and model their life upon “sound moral values”, adding that this applied across all ranks.\nJoseph Farrugia, a 50-year old residing in Gozo, late one evening in October removed the dashboard from an Isuzu vehicle parked inside the Xewkija Industrial Estate.\nIn light of his admission, the court, presided over by magistrate Joseph Mifsud, declared the accused guilty, seizing upon the opportunity to stress that members of all disciplinary corps should set an example for the rest of society.\nAfter much reflection, the court chose not to give in to public accusatory calls, but rather reaffirmed its belief in reparative justice, and place him under a three-year probation order and a 200-hour community service order, recommending that this be served at the Arka Foundation of Għajnsielem.\nInspectors Josef Gauci and Mario Xiberras prosecuted. Lawyer Anton Refalo was defence counsel.", "comment_count": 0, "id": 3551}, {"keywords": "", "author": "", "article_body": "A 35-year-old motorcyclist was grievously injured following a car crash in Xewkija, Gozo.\nThe police said the incident took place at 7.30pm on Thursday, when a Hyundai Accent driven by a 45-year-old man from Xewkija was involved in a crash with a Honda motorbike driven by a 35-year-old from the same locality.\nThe younger man was taken to the Gozo General Hospital.\nThe police are investigating.", "comment_count": 0, "id": 3552}, {"keywords": "", "author": "", "article_body": "Two young Somali men were grievously injured after they were beaten with glass bottles in two separate cases in St Julian's.\nThe police said the first attack took place at 3.30am in Triq il-Bajja, however, the aggressors had fled the scene by the time the officers turned up on site. \nAn ambulance took the man, who lives in Żurrieq, to Mater Dei Hospital, where he was certified to be suffering grievous injuries.\nHalf an hour later, the police were called to Triq Gort to assist a man who reported a similar attack.\nThe second victim, also a Somali man, is 23-years-old and lives in Marsascala. He too was certified to be suffering grievous injuries.\nThe aggressors also fled the scene.\nThe police are investigating. ", "comment_count": 0, "id": 3553}, {"keywords": "", "author": "", "article_body": "A 67-year-old Irish man was hospitalised after being struck by a car in Sliema early on Friday morning. \nThe incident happened in Windsor Street in Sliema at 1am when a 30-year-old man from Mosta lost control of his Smart car, and hit the pedestrian.\nInvestigations are still underway.", "comment_count": 0, "id": 3554}, {"keywords": "", "author": "Jacob Borg", "article_body": "An American insurance mogul who set up shop in Malta in 2014 was this week charged by US prosecutors with wire fraud and bribery, the Times of Malta has learnt.\nGreg Lindberg was named in an indictment along with North Carolina State Republican Party chairman Robin Hayes and two other associates.\n“The indictment unsealed today [Tuesday] outlines a brazen bribery scheme in which Greg Lindberg and his co-conspirators allegedly offered hundreds of thousands of dollars in campaign contributions in exchange for official action that would benefit Lindberg’s business interests”, the assistant attorney general of the Justice Department’s criminal division said in a statement.\nRelentlessly investigate and prosecute corruption\nMr Lindberg was associated with 10 companies set up in Malta between 2014 and 2017. The Maltese companies were not mentioned in the US indictment.\nAsked whether any regulatory action would be taken, a spokesman for the Malta Financial Services Authority said that, once the relevant investigations were concluded, the financial watchdog would take the necessary action based on the intelligence and evidence assembled.\nDetails of the investigation could not be disclosed due to confidentiality reasons, the spokesman said.\nOne of Mr Lindberg’s Maltese insurance companies, Standard Re, voluntarily surrendered its licence last December. The MFSA said the surrender was entirely voluntary and not the result of any regulatory action.\nAnother of his other companies, Standard Advisory Services, holds an MFSA investment licence.\nAccording to the US indictment, Mr Lindberg and his co-defendants engaged in a bribery scheme for the purpose of causing the commissioner for insurance to take action favouring his company.\nThe lead FBI investigator in the case said the men involved devised a plan to use their connections to a political party to attempt to influence the operations and policies of the North Carolina department of insurance. In a bid to hide the bribery scheme, one of Mr Lindberg’s associates set up two corporate entities to anonymously funnel a promised €1.3 million to the commissioner for insurance to support his re-election campaign, the indictment alleges.\n“Bribery of public officials at any level of government undermines confidence in our political system. The criminal division will use all the tools at our disposal, including the assistance of law-abiding public officials, to relentlessly investigate and prosecute corruption wherever we find it”, Assistant Attorney General Brian Benczkowski said.\nAll the suspects have denied the charges.", "comment_count": 0, "id": 3555}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to Friday's front pages:\nGeorge Vella's swearing in as President of Malta dominated the front pages of all newspapers.\nTimes of Malta and The Malta Independent say Dr Vella's speech was one underlining the need for unity.\nL-Orizzont says Dr Vella emphasised his presidency would be a silent and impartial one. \nIn-Nazzjon quotes the new president saying life should be protected from the very beginning. \nThe Times also reported that the permit for the Magħtab fuel station had been revoked.\n ", "comment_count": 0, "id": 3556}, {"keywords": "", "author": "Keith Micallef", "article_body": "Changes in planning laws and a boom in the construction industry stretched the heritage watchdog’s resources to the limit as planning consultation requests rose nine-fold in just three years.\nThe Superintendence of Cultural Heritage issued 1,099 consultations in 2015. However, changes in planning legislation, which came into force the following year, resulted in a much larger workload as all full development applications had to be referred to the watchdog. \nConsequently, by the end of 2018, the number of requests had risen by nine times to 9,773.\nThis trend was highlighted in the 2018 annual report, which flagged the difficulties encountered by the watchdog to fulfilits duties within the limited resources availability.\nThe report notes that following an operations review carried out when Joseph Magro Conti succeeded Anthony Pace as superintendent in March last year, it immediately emerged that day-to-day operations with regard to planning consultation and archaeological monitoring “did not work smoothly as they should”.\nIn this respect, it was pointed out that the workload of 200 weekly cases had to be shouldered by just four officers who, by law, have no more than 30 days to give their reaction on every case. \nThe limited resources meant that other tasks, such as participation in EU projects, had to be placed on the back-burner.\nApart from such constraints, the review also flags the inadequacy of the existing premises, ICT infrastructure and lack of cars to carry out onsite inspections. \nLimited resources meant that other tasks had to be placed on the back-burner\nOn a positive note, the report says that, by the end of last year, progress was registered on some fronts, including the acquisition of two vehicles for onsite inspections. A number of sites were considered for alternative premises but the superintendence said these could only be secured within two or three years.\nAs for human resources, 16 officers were recruited in the second half of last year and a further five were brought in on loan from the Planning Authority.\nPlanning consultation requests are being filtered to give early feedback on minor developments having minimal impact on cultural heritage. On the other hand, more demanding applications are being flagged at an early stage. \nSuch a measure was taken in the wake of the fact that, until recently, the superintendence was facing criticism it was not giving its feedback on all applications. \nIn such circumstance, this is taken as a no objection.\nHowever, there have been instances where the superintendence did not make an objection or demand a change in plans, despite being vested with such power by law. \nOne such incident was in a development application filed by Infrastructure Malta for the construction of a tunnel to relieve traffic congestion in Santa Luċija. \nIn this case, the superintendence had protested as a geo-radar survey in this “archaeologically very sensitive” area had been carried out without its consent.", "comment_count": 8, "id": 3557}, {"keywords": "", "author": "Ivan Martin", "article_body": "Migrant smugglers are using far safer vessels or towing rickety clandestine boats behind larger fishing trawlers in a bid to get closer to mainland Europe and Malta, according to a new report into human trafficking.\nConducted between May and December last year, the report, ‘The human conveyor belt broken – assessing the collapse of the human-smuggling industry in Libya and the central Sahel’, was launched by the Global Initiative against Transnational Organised Crime.\nWritten by former Times of Malta news editor Mark Micallef, the report maps out the people involved, their networks and the flow of smuggling profits.\nIt notes that as European search-and-rescue missions withdrew from the Libyan coast, the region saw a notable shift among smugglers back to methods seen before the Libyan Revolution.\n“There has been a relative shift towards the use of more seaworthy vessels that are better prepared or to resorting to other tactics, such as towing migrants behind fishing vessels,” the report says.\nThe lack of search-and-rescue capacity along the North African coast could also be linked to an increase in the mortality rate for the central Mediterranean crossing, the study continues. \nDepartures from the Libyan coast continued falling throughout 2018 despite a small seasonal increase over the summer. \nThis was mainly attributed to Libya’s human-smuggling industry experiencing a “general and sustained retreat” of armed groups’ support. The remaining smuggling operations, which once operated in plain sight, had now been driven underground, with migration largely taking place out of view, the report says.\nThough this raised costs and limited the numbers travelling, it also left migrants at risk of abuse as smugglers avoid law enforcement and increasingly seek to boost profits through extortion, ransom and forced labour.\nThe effective curtailment of departures from Libya’s coast had also put migrants stranded in Libya at a higher risk of abuse and mistreatment at the hands of smugglers.\nDepartures from the Libyan coast continued falling throughout 2018\nMistreatment, theft, torture, sexual abuse, rape and labour exploitation, including through inducement into sex labour, are all rife throughout the course of a migrant’s journey through Libya, according to the report.\nRansoming, in particular, appeared to be on the rise, as the actual business of smuggling migrants into Europe becomes more challenging. \nThis was also compounded by the chronic crisis in Libya’s migrant-detention system. Mismanagement and corruption, the report says, led to dire conditions at the centres and weak provision of service, with the situation heightened by periodic overcrowding.\nThe disappearance of migrants from detention centres was described as a critical issue, which, together with other overlapping crises, fuelled repeated protests at various centres and increased reports of suicide and suicide attempts.\nDesperate migrants have repeatedly tried to break out of abusive detention centres.\nThere have been more consistent reports of migrants having to pay multiple ransoms before being released by smugglers. \nSometimes this happened when released migrants were intercepted at sea or even on land and brought to a detention centre, where the same smugglers who previously held them in captivity would ‘purchase’ their release and then extract a second payment from them.\nWhile such instances were not entirely new patterns, they appeared to have become more systematic and were being reported with greater frequency. \nThe report mentions the case of a 33-year-old Cameroonian migrant who reported being swindled out of most of his money at the Algeria-Libya border. A smuggler leading them across the border disappeared when the group was intercepted by Algerian border guards, only to reappear on the Libyan side after all their belongings had been taken by the authorities.\nSubsequently, the group was taken to a warehouse where the migrants were asked for a ransom. \nAfter paying, they were transported north to the west coast of Tripolitania where they were detained again and asked for a second ransom. The Cameroonian migrant eventually made the sea crossing and was rescued and taken to Malta last August 14.", "comment_count": 0, "id": 3558}, {"keywords": "", "author": "Denise Grech ", "article_body": "Two teenage migrants charged with \"terrorist activity\" after being charged with taking over a commercial vessel are being held at the main prison in Paola, in breach of the magistrate's orders, Times of Malta has learned.\nThe minors were meant to be held at the prison youth section in Mtaħleb, rather than at the adults' prison in Paola, after being arraigned on Saturday and accused of seizing control of the vessel through the use or threat of force and intimidation. \nIf found guilty, the two teenagers - aged 15 and 16 - face between seven and 30 years behind bars. \nContacted about the incident, lawyer Neil Falzon said apart from the fact it was shameful that the two were facing terrorism charges it was also shameful that, pending the procedures, their special protection needs were being totally ignored. \nOn Saturday, magistrate Donatella Frendo Dimech ordered the two minor suspects to be entrusted to State care and everything done to ensure their safety and well-being. \n\"Tomorrow morning we will be taking the necessary action to ensure that our clients are protected according to law,\" he said on Thursday. \nAnother, aged 19, was also arraigned on the same charges. The three teenagers have pleaded not guilty to the charges and requested bail.\nThe case made international headlines after the captain and crew of a Turkish merchant ship had rescued some 100 people stranded at sea. The three allegedly forced the captain to change the vessel's route to Malta, instead of Tripoli. \nMalta's Armed Forces stormed the ship when it was close to the country's waters after the captain insisted he was not in control of the ship.\nA pregnant woman, a child of six months and 47 people claiming to be minors were among the rescued aboard the ship. ", "comment_count": 0, "id": 3559}, {"keywords": "", "author": "", "article_body": "Over 400 people were living with HIV in Malta in 2018, figures from the European Centre for Disease Prevention and Control show.\nThe statistics, published as part of a 2018 progress report on HIV care, revealed 90% of people in Malta know their status and are receiving treatment. \nOf the 453 people living with HIV, over half - 298 - saw the illness being virally suppressed.\nA total of 210 men and 281 migrants were diagnosed in 2018, the figures showed. \nWith 387 cases reported since 2007, Malta had the third highest rate of new HIV diagnoses in 2016.\nIn a statement, the Health Ministry said the satisfying results led to the virus in the blood being so low that it became non-transmissible. \nThe report is based on four criteria: the number of people diagnosed with HIV, the number of people who have been diagnosed, the number of people receiving treatment and the number of people that are receiving satisfying treatment. \nRead: I am not a person with HIV. I am a person, fullstop", "comment_count": 36, "id": 3560}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The man accused of murdering his partner inside the couple’s Paola apartment in September has pleaded legal insanity, bringing about the suspension of the compilation of evidence in his regard.\nMichael Emmanuel, the 28-year-old Ivorian national accused of strangling Maria Lourdes Agius, his 35-year-old partner and mother of seven children, three of them fathered by the accused, had been facing compilation proceedings, pleading not guilty to the murder.\nThe victim’s lifeless body had been discovered by the police in her bedroom, seemingly asleep, shortly after her partner had turned up at the local police station to report that the woman could not be roused from her sleep.\nA police sergeant on site, aware of an earlier domestic violence report filed by the woman, had sensed that the young mother might have been dead, and his suspicion was soon confirmed.\nAn autopsy later certified that the cause of death had been strangulation, with the victim also bearing bruises on her neck.\nAs proceedings continued on Thursday, defence lawyer Dustin Camilleri, informed the court that he would be pleading legal insanity, adding that an application to this effect was to be presented in due course.\nIn view of this information, the court, presided over by magistrate Caroline Farrugia Frendo, declared the suspension of the compilation of evidence and sent the acts to the Attorney General in terms of law.\nThe matter will now be entrusted to a number of psychiatrists, usually three, who are to examine the accused and determine whether he was insane at the time of commission of the offence.\nShould the experts’ report be contested by the Attorney General, the matter would be decided by a panel of jurors.\nShould the allegation of insanity be determined, the court would order the accused to be kept in custody at Mount Carmel Hospital, to remain so detained in terms of the Mental Health Act.\nIn the light of this plea, the court ordered that the accused be temporarily transferred from the Corradino Correctional Facility to Mount Carmel Hospital, while sending the acts of the case to the Attorney General.\nInspectors James Grech and Sarah Zerafa were prosecuting. Lawyers Matthew Xuereb and Charles Mercieca appeared on behalf of the Office of the Attorney General. Lawyer Stephanie Caruana appeared parte civile.", "comment_count": 0, "id": 3561}, {"keywords": "", "author": "Ramona Depares", "article_body": "As many still struggle to figure out the implications of new drink-driving laws, a group of enterprising business students may have hit upon a solution to put a definite end to that eternal question: have I had too much to drink?\nThe students, who are taking part in the annual JAYE Malta Company programme under the name Exhale, have come up with a battery-powered breathalyser in the form of an easily-portable keychain.\nThe breathalyser device is activated with a quick puff that will instantly let the user know whether s/he is still within legal limits to drive.\n“From the first day the team got together to take part in this year’s JAYE programme, we knew we wanted to come up with something that was of use to society. Our initial thoughts veered towards the environment but then we decided we wanted a product that offered immediate results,” Andrea Galea, the team’s marketing director, said.\nWith the students making up the team all hailing from a business background, the necessary scientific knowledge required to develop the product was lacking. But this stumbling block was not enough to halt the project.\n“We spent months researching the topic and the products available in other countries. It turned out that, in Malta, there was one attempt to offer portable breathalysers but the initiative failed to take off,” Mr Galea said.\nA small pool of potential suppliers was identified, until further research narrowed it down to a distributor in China.\n“We negotiated the price and the rights to it and sealed the deal. The location of the product presented some challenges, especially with respect to shipping times and costings – not to mention the considerable language barrier – but the advantages of the product itself outweighed these, so we decided to go ahead,” the young entrepreneur said.\nMentored by Matthew Manfre, the students came up with a roadmap that included rebranding the breathalyser into an Exhale product and making sure it reached the target market.\nWith the first batch taking over a month to reach Malta and be prepared for distribution, the process was not without its anxiety-inducing moments but the encouraging feedback soon put all misgivings to rest.\n“We sold out the first batch of about a 100 devices and ordered more, which, thankfully, didn’t take so long to make it to Malta. The feedback from our teachers has also been positive,” Mr Galea continued.\nUpon seeing continued interest, the students held meetings with bar owners and other stakeholders, including personnel from the Emergency Department at Mater Dei Hospital, who offered valuable insight into the advantages of fostering a culture where self-care in such matters is considered natural.\n“We will stop selling the devices in mid-April, due to JAYE competition rules, but we are hoping to be able to continue the business afterwards,” Mr Galea concluded.\nPortable breathalysers are commonly used abroad, with France having gone as far as to make it a legal requirement for all drivers to carry breathalyser devices.\nIn Malta, the alcohol limit for drivers was reduced from 0.8g of alcohol per litre of blood, which was the highest limit in Europe, to 0.5g for all drivers.\nOn average, two drinks in the first hour raise a person’s BAC (blood alcohol concentration) to 0.5g and one standard drink per hour subsequently will maintain that level. For new drivers with a driving licence issued less than two years earlier, the limit is set even lower, at 0.2g/l.\nAccording to a police statement, five drivers reached the level of reasonable suspicion to warrant a legitimate breathalyser test on New Year’s Eve, three of whom were found to be drink-driving.", "comment_count": 10, "id": 3562}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A former high-ranking official under the Gaddafi regime has been acquitted of forgery after evidence clearly showed that he had been unaware that his Guatemalan travel documents were counterfeit.\nMohammed Ali Hassan Fakrun, 52, from Benghazi, former undersecretary for economic affairs, working “directly under the Prime Minister himself”, had been about to travel out of Malta on a flight to Istanbul on May 23, 2018, when his passport and ID Card, bearing a Guatemalan stamp, attracted the suspicion of the police.\nThe passenger was arrested and arraigned two days later on charges of forgery and use of a counterfeit passport and ID card, being granted bail after denying the charges pressed against him.\nDuring police interrogation and later when testifying in court, Mr Fakrun denied any knowledge that the personal documents found in his possession had been fake, pleading his innocence and insisting with the police to contact the Guatemalan Embassy in Rome to confirm their authenticity.\nThe local police authorities did contact the Embassy in Rome as well as Interpol in Guatemala, receiving confirmation that, in fact, the documents were counterfeit, with the ID card number belonging to a third party.\nHowever, the accused insisted that he had obtained his documents through the help of a “special envoy to the United Nations Institutions” who had travelled to Istanbul where he met the accused who had set up his commercial activity there.\nAfter the political turmoil that broke out in Libya in 2011, Mr Fakrun had fled the country, seeking refuge in Jordan and subsequently traveling to Malta from where he moved to Turkey, in the hope of finding better work opportunities there.\nAfter setting up business in Turkey, exporting food and medicines to Libya and Jordan, the man had decided to apply for a second nationality, adding a layer of protection for himself and his family.\nThat was when his friend, in a “high position”, stepped in, having the documents delivered by a special Guatemalan envoy in Turkey, free of charge.\nUpon the evidence put forward, the court, presided over by magistrate Audrey Demicoli, concluded that although the prosecution had proved beyond reasonable doubt that the documents were false, yet the criminal intent had not been proven.\n“The Court deems that the accused has given a satisfactory explanation of how the documents came into his possession and that he had no knowledge that the documents were not authentic and no reason whatsoever to suspect that they could not have been authentic.”\nMoreover, the Court observed that the prosecuting officer had remarked that the said documents “were very good counterfeits”, so much so that even he had his doubts as to their authenticity and for that reason had agreed to contact the authorities in Guatemala.\nLawyer Giannella De Marco was defence counsel.", "comment_count": 0, "id": 3563}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A permit for a fuel station in Magħtab was revoked by a tribunal on Thursday, sending the case back to the Planning Authority after an appeal by residents.The ODZ fuel station had been approved by the PA in January 2018, provoking controversy that led the government to order a review of the planning policy under which the permit was issued. The review is still ongoing.The ruling by the Environment and Planning Review Tribunal (EPRT) to annul the PA’s decision was based on procedural grounds: that residents did not have access to information provided to the developers ahead of the hearing where the project was greenlit.The tribunal’s ruling means the project will now be sent back to the PA for a fresh decision. The merits of the approval were not challenged by the tribunal, and the application will not need to be reassessed. \nThe objectors were represented in their appeal by architect Carmel Cacopardo and lawyer Tanya Sciberras Camilleri. The 3,500 square metre project by Abel Energy aims to build a fuel station with an electric car charging station, car wash, shop, mechanic workshop, stores and parking area. A kerbside station in Mosta will in turn be decommissioned. The PA board first rejected the proposal in March 2016 on the basis of SPED policy (Strategic Plan for Environment and Development) provisions which aim to protect and enhance the positive qualities of the landscape and the traditional components of the rural landscape.But the appeals tribunal ordered that the application be reconsidered, ruling that the PA had not explained why the SPED should take precedence over the 2015 Fuel Stations Policy, which allows petrol stations to be relocated to rural areas outside development zones.When the permit was brought back before the PA board in December 2017, the board first indicated it would once again reject the proposal, only to double back a month later and grant approval in the final vote.\nGovernment representative Clayton Bartolo and Opposition representative Ryan Callus had both voted in favour, while PA chairman Vince Cassar, ERA chairman Victor Axiak and NGO representative Annick Bonello were among those who opposed.Less than two weeks later, environment minister José Herrera ordered a review of the Fuel Stations Policy to reduce the burden on agricultural land.\nHow the saga has played out\n• March 2016: PA board votes to reject the proposal on the basis of SPED provisions on protecting rural landscape.• September 2017: Appeals tribunal orders a reconsideration on the basis of the Fuel Service Stations Policy.• December 2017: PA board meets with eight members present, and records a provisional vote of six to two against the proposal.• January 2018: PA board meets with all 14 members present for final vote, and this time approves the project.• April 2019: Appeals tribunal annuls the approval on procedural grounds and sends the case back to the PA for a new decision.", "comment_count": 7, "id": 3564}, {"keywords": "", "author": "Jacob Borg", "article_body": "A political commitment signed in Malta two years ago to protect juvenile fish stocks in the Mediterranean was at risk, a sea and ocean protection NGO warned.\nThe Malta MedFish4Ever declaration was spearheaded by the European Commission and signed by 15 countries, including Malta, in March 2017. It set out a detailed programme to protect fish stocks in the Mediterranean through the setting up of protected areas and better data collection.\nThe declaration also aimed to eliminate illegal fishing by 2020 by ensuring that all signatories had the legal framework and the necessary human and technical capabilities to meet their control and inspection responsibilities.\nA key plank of the MedFish4Ever declaration was the protection of nursery grounds through the setting up of protected essential fish habitats in the Mediterranean.\nIn comments to Times of Malta, Oceana policy adviser Nicolas Fournier warned that Malta’s commitment was now at risk.\nNo country had so far proposed areas for protection of juvenile fish\nOne characteristics of overfishing in the Mediterranean is the high catch of juvenile fish that have not had time to reproduce.\nThese small fish are often sold as they can be used for dishes like tapas.\nA report by Oceana last year uncovered 41 potential cases of illegal, unreported and unregulated fishing in the Mediterranean Sea.\nThe report provided evidence of illegal fishing activities inside areas closed to fisheries designated to protect young fish, corals and other threatened habitats.\nMr Fournier said no country had so far proposed areas for protection of juvenile fish, despite the requirements to do so by 2018 under the MedFish4Ever declaration.\nEuropean Maritime Affairs Commissioner Karmenu Vella had hailed the “historic” agreement as a concrete show of political will to take action in the Mediterranean.\nOceana implored him to “walk the talk” on fish habitat protection and make the EU a champion in this regard.\nMr Fournier said that with over 80% of fish stocks overfished in the Mediterranean, policymakers could not afford empty announcements anymore.\n“Oceana expects concrete and ambitious proposals to be announced at a high-level political meeting in Morocco in June that will advance the establishment of the network of essential fish habitats in the whole region”, Mr Fournier said.", "comment_count": 8, "id": 3565}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A 76-year old pensioner accused of an attempted armed hold-up at the Żejtun HSBC branch on Wednesday was granted bail after pleading not guilty upon his arraignment on Thursday.\nGrezzju Piscopo, a Żejtun resident, was escorted to court under arrest.\nHe was accused of attempted aggravated theft, unlawfully holding a number of people against their will, possession of a weapon or an imitation firearm as well as having covered his face in public by wearing tights over his head.\nA request for bail by defence lawyers Kathleen Calleja Grima and Andrew Cauchi was met by objections by the prosecution in view of the fact that several civilian witnesses still had to testify.\nHowever, Dr Grima countered that they would definitely not object to any strict prohibition barring the accused from setting foot anywhere near the bank.\nMoreover, as for the man’s financial means, the lawyer pointed out that his three children, all present in the courtroom and fully supportive of their elderly relative, would willingly help out.\nMagistrate Caroline Farrugia Frendo granted bail against a deposit of €750, a personal guarantee of €9,000 and a strict order not to approach any of the witnesses or any HSBC branch in Malta.\nThe man was also placed under a curfew between 10pm and 7am.\nHe was placed under a Temporary Supervision Order pending the proceedings. Inspectors Trevor Micallef and Mario Xiberras prosecuted.", "comment_count": 0, "id": 3566}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Time Person of the Year Shahidul Allam referred to murdered journalist Daphne Caruana Galizia during a speech in Valletta as he called for dissent to be “protected and nurtured”.\n“While we are very happy that an investigation is taking place, it is certainly not desirable that journalists become victims because of what they do,” Mr Alam, an award-winning Bangladeshi photographer and activist, said at a recent event for young arts festival managers.\n“Journalism is what they are about, investigation is what they are meant to be doing. Digging things up is part of their job, giving their lives is certainly not,” he said.\nMalta, he added, was far from the only place where journalists faced risks.\n“I would be hard-pushed to find a government that does not, in its rhetoric, promote freedom and democracy and does not, in its practice, actively try to put it down.”\nDigging things up is part of their job\nMr Alam was one of eight journalists, all targeted for their work, who were celebrated collectively by Time magazine as its Person of the Year in 2018 after he spent more than 100 days in prison for anti-government comments during student protests in Bangladesh. \nHis arrest triggered international protests, with rights groups, Nobel laureates and academics calling for his release.\nHe shared his experience of arrest and imprisonment and of using art to engage communities and foster a spirit of dissent when speaking at the opening of the international Atelier for Young Festival Managers, which ran between March 23 and 29.\n“In my country we are now in a situation when artists are silent, they do not ask questions, they prefer to keep quiet and wait for better times,” he said. \n“I want to remind you all that there are never better times. Spaces for dissent need to be created, protected and nurtured; it doesn’t happen by itself.”", "comment_count": 5, "id": 3567}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The charred body of Gaetano Romano was discovered in the furnace of his father’s gypsum workshop, a day after his 20th birthday, in 2009. Ten years on, the perpetrator of the gruesome murder remains at large.\nShortly before the body was discovered by his own father in Buġibba, the young man, who was found with six nails in his head, had written a letter expressing fears for his life and naming a suspect.\nThe murder in Damascus Road was the first of the year for 2009. \nThe young Sicilian man worked at his father's shop Cinque Stelle Services, situated right next to the place where his corpse was found.\nInvestigators initially believed a nail gun could have been used to shoot the tacks into the young man's head but such a weapon was not found.\nGiven this, police sources had said investigators were not ruling out the possibility that the nails were hammered in his skull.\nThree suspects had been held a few days following the discovery of the body - they included a relative of his father, a man in his 30s, as well as a Maltese and a \"Yugoslav\" who were close friends of the victim but who were reported to have had a number of arguments with him. They were all released.\nThe grim find came after his father Nicola, who was abroad, had made several failed attempts to contact his son.\nNeighbours had told Times of Malta that when Nicola did not find his son at home, he forced open the door to his garage.\nThey saw Gaetano's father crying and banging on a low wall near the garage.\nThe family's dog had been killed eight months before and found rolled in a carpet in a nearby field. A neighbour said the family had even received photos of the dead dog.\nTheir gypsum business was at the centre of a controversy in the previous months when residents complained he was operating an illegal furnace, which they feared could blow up at any moment.\nNicola Romano opens the industrial oven where he found the charred body of his son, who was murdered three months ago. Photo: Jason Borg.\n'My son knew who was going to kill him' \nNearly three months after the gruesome discovery, Nicola said his son had written a letter which showed he feared for his life, naming the man he was afraid of as someone close to the family.\nNicola found the letter, which had been written \"in case something happened to him”, in his office shortly after finding his body.\n\"If something happens to me, you know who to look for - you don't have far to look,\" Mr Romano said quoting the letter.\nHe had once also told his father that he would die young.\n\"They took away my son and they took away my life,\" Nicola Romano said.\nHe added that his son was everything to him: \"When his mother died, I was his father, mother, friend, cousin - everything.\"\nGaetano Romano's Maltese mother died aged 45, when he was preparing for his confirmation.", "comment_count": 41, "id": 3568}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Fathers will finally start benefiting from 10 days of paternity leave and both parents will get paid for two months parental leave until their child is eight years old.\nThese benefits form part of the Work-Life Balance directive led and negotiated by Nationalist MEP David Casa, which was given the green light on Thursday to become law by the European Parliament.\nMEPs voted in favour of a directive that will introduce 10 days of paternity leave - up from one day - remunerated at not less than the national sick pay level.\nThe EU directive also lays down that the four months' parental leave, which in Malta are currently unpaid, would also be paid and made available to parents during their child’s first eight years.It would also introduce the right for employees to request flexible working arrangements\nThis measure would be non-transferrable, meaning that two months have to be taken by the father and another two months by the mother, in consultation with the employer.\nMeanwhile, it would also introduce the right for employees to request flexible working arrangements and five days of annual leave being granted to workers to care for sick relatives. \nThe motion was overwhelmingly approved.\nWhen it was proposed, the directive divided opinion, with some saying the 10-day paternity provision was not enough and others questioning the financial burden of increasing paternity leave entitlement.\nSmall and medium enterprises had shot it down, while the Association for Equality welcomed it, saying it was a positive step towards ensuring more equality for fathers.\n\"The existing two-day paternity leave is a huge injustice and 10 days is the least that fathers should be granted,\" according to the A4E.\nMeanwhile, CEO for the Chamber for Small and Medium Enterprises Abigail Mamo had said that introducing paternity leave at European level was not considered appropriate and the GRTU disagreed with it.\nDirector Joseph Farrugia had said the Malta Employers’ Association’s strongly resisted any further financial burdens on employers, and insisted that, in line with many other countries, the government financed such social services.\nMalta’s economic surplus should be invested in the leaveIn comments to Times of Malta ahead of the final vote, Mr Casa had said that Malta’s economic surplus should be invested in the leave, which would help bridge the gender employment and pay gap in the long-run.", "comment_count": 10, "id": 3569}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "Updated 1.15pm\nPresident George Vella delivered a unifying speech at his inauguration on Thursday, saying that one of his priorities would be that of seeking to heal divisions, including those caused by the blots on Malta’s character caused by the murders of Karin Grech, Raymond Caruana and Daphne Caruana Galizia.\nThe former foreign minister was sworn in at a special sitting of Parliament, taking over from his former Cabinet colleague Marie-Lousie Coleiro Preca.\nDr Vella, said his would be a silent, impartial presidency that would also seek to be a moral compass, a mirror of the people’s needs, giving a voice to those who were not heard and solace to those who needed it.\nDr Vella said he was assuming the office with deep humility, gratitude and pride.\nHe said he had accepted to assume the role of President in order to serve the people and to promote Malta’s values, including a fair distribution of wealth.\nThe concept of charity had unfortunately been eroded, he said, but those who needed help should receive it as a right not as charity.\nEconomic wealth did not mean there was no material poverty, and he would therefore seek to maintain the social commitment demonstrated by his predecessor.\nThe new President greets well-wishers in Valletta.\nHe would promote social welfare and a decent quality of life everyone was entitled for, including migrant workers.\nAs a doctor, he would interest himself in developments in the health sector and continue to see that there was respect for medical and moral ethics ‘including respect for life from its very beginning.’\nHe would also closely follow the sector of the elderly, where it needed to be ensured that there was no deterioration of living conditions.\nIn a mixed liberal community, Dr Vella said, Malta needed to be proud of its moral values, including charity and solidarity.\nHe would also commit himself to education, whether academic or utilitarian, but also an appreciation of art and culture.\nHighlights importance of the environment\nDr Vella recalled that the environment had been among his first ministerial responsibilities in 1996. Much had changed since then, he said, but Malta’s size remained the same.\nMalta, he said, faced strong pressure on the natural and built environment, and he would be recommending enforcement of the rules to ensure environmental sustainability.\nPresident George Vella delivering his inaugural address.\nHe would also promote measures for better quality of air and the sea and measures to avoid global warming.\nAbsolute importance would be given by the presidency to strengthen national unity. Having different points of view was a sacred right but there needed to be dialogue that was mature and respectful, with no personal attacks.\nNational unity also meant dialogue between the state and the various churches and religions.\nThere was also a need to rekindle respect for national symbols such as the flag, the anthem, the language, history and culture, the constitutional structures and their laws, and especially, respect to the Constitution. \nDifferences remained on issues such as the rule of law, administrative powers and the blots on Malta caused by the murders of Karin Grech, Raymond Caruana and Daphne Caruana Galizia. \nDr Vella also spoke about his role as guardian of the Constitution and insisted that the process for a revision of the constitution should be as broad as possible, including MPs, experts, NGOs and civil society in general.\nBut even more important than updating the Constitution was the need for a commitment to respect what was agreed upon.\nThe President also spoke briefly on foreign affairs and said that Malta, despite being small, would remain relevant and would be respected as long as it showed itself to be competent.\nCites concerns with right-wing extremism, populism\nHis concerns, he said, included populism, right-wing extremism, climate change, organised crime, human and arms trafficking and organised crime. Malta could play an important role in international fora in the context of the Euro-Mediterranean region.\nMalta should be proud of its values and morals even in international fora, he said, including in the UN Security Council if it was elected to it in 2023-24. “We need to be clear in our condemnation of exploitation of workers from other countries, human trafficking, arms trafficking and organised crime.\nRead the full address in Maltese on pdf below.\nDr Vella was sworn in by the Speaker of the House, Anġlu Farrugia.\nA resolution for his appointment was approved by the Labour and Nationalist members of parliament on Tuesday.\nThe ceremony was preceded by Mass led by Archbishop Charles Scicluna at at St John’s Co-Cathedral.\nDr Vella then walked to the Palace, where the parliamentary sitting was held in the Grand Council Chamber. \nDr and Mrs Vella arrive at the Palace.\nAs soon as the oath of office was administered, the AFM fired a salute from Pope Pius V Street in Valletta using vintage guns. Trumpeters sounded a fanfare in the Chamber.\nThe new President read a proclamation declaring that he has assumed the new duties and then delivered his inaugural address. \nThe new President waved to the crown on St George Square from the Palace balcony.\nREAD: 'Defend Malta's heritage' - Archbishop's call to the new President\nHis first official function was to pay tribute to the fallen by laying a wreath at the foot of the War Memorial in Floriana.\nHe then proceeded to San Anton Palace – his home for the next five years - where the staff will be introduced.\nPresident Vella will receive courtesy calls by Prime Minister Joseph Muscat and Opposition leader Adrian Delia. \nPrime Minister Joseph Muscat is greeted outside the Palace, with Mrs Muscat (left).\nThe role of the President\nThe President of Malta is the head of state and has a largely ceremonial role.\nHowever, it is the President who decides who to appoint as prime minister after a general election, basing his decision upon who in his judgement commands a majority of the members of the House of Representatives.\nThe President summons and dissolves the House of Representatives and calls a general election on the advice of the prime minister.\nHe/she may, however, act upon his own judgement to dismiss the prime minister or dissolve the House if the government loses a confidence vote. Conversely, if the prime minister recommends dissolution of parliament (before the end of its term) and the President considers that the government can be carried on without dissolution and that dissolution would not be in the interests of Malta, he may refuse to dissolve parliament.\nThe President is a key part of the legislative process. Draft financial legislation first needs to be presented to the President who then recommends it to the House. The President also has to give his assent to all Bills approved by the House before they become law.  \nIn cases of public emergency, if the House is not in session, the President may by proclamation summon it.\nDespite this important legislative role, the President only addresses the House of Representatives upon his/her appointment and at the summoning of parliament. Only one President has addressed the summoning of parliament twice – Ugo Mifsud Bonnici did so when Alfred Sant’s Labour government was elected in 1996 and when the PN government was elected 22 months later.\nAmong other roles, the President receives the diplomatic credentials of new ambassadors to Malta, chairs the Commission for the Administration of Justice and, acting on the advice of the government, appoints judges and the heads of constitutional bodies. \nThe President may grant a pardon to convicted criminals as well as reduce or nullify court sentences, acting on the advice of the Minister of Justice.\nThe President has a right to be informed by the prime minister and ministers of all affairs of state.\nWhile judges and other holders of constitutional offices such as the Auditor-General and the Ombudsman enjoy security of tenure and cannot be removed without a two-thirds majority of the House, the President is appointed and may be removed by resolution of the House backed by a simple majority. Removal of the President can only take place on the grounds of inability to perform the functions of his office (whether arising from infirmity of body or mind or any other cause) or inappropriate behaviour.\nThe term of office the President otherwise lasts for five years. There is no second term. \nHistory of the presidency\nThe presidency came into being on December 13, 1974 when Malta was declared a republic. Malta's first President: Sir Anthony Mamo.\nThe first President was Sir Anthony Mamo, the only President who did not come with a political background. He was previously Chief Justice and Governor-General.\nThe other Presidents were Anton Buttigieg, Agatha Barbara, Censu Tabone, Ugo Mifsud Bonnici, Guido de Marco, Eddie Fenech Adami, George Abela and Marie-Louise Coleiro Preca. Paul Xuereb was acting president for just over two years. All previously served as ministers except George Abela, who was deputy leader of the Labour Party and Paul Xuereb who was an MP and later Speaker. Dr Fenech Adami was previously prime minister.\n\nBiography: George Vella\nGeorge Vella, born on April 24, 1942, is the oldest person ever to have been appointed President and the second to come from the medical profession, the other being Ċensu Tabone.\nHe has lived all his life in Zejtun and is best known there as a dedicated family doctor. He graduated as a doctor in 1964 and later also specialised in aviation medicine, serving as a consultant to Air Malta and the Civil Aviation Department.\nHe first stood for election with the Labour Party in 1976 but was elected, by casual election in 1978. He was then elected during the general elections of 1981, 1992, 1996, 1998, 2003, 2008 and 2013.\nGeorge Vella (left) at Alfred Sant's swearing in in 1996.\nIn 1992 Dr Vella turned down an invitation from then Labour leader Karmenu Mifsud Bonnici to be nominated party leader, but was then elected party deputy leader for parliamentary affairs while Alfred Sant was leader.\nHe was deputy prime minister and foreign minister in the Sant government between 1996 and 1998 and then in his role as shadow foreign minister along with Dr Sant, spearheaded the campaign against Malta joining the European Union, until the matter was decided by referendum.\nDr Vella is credited as having been the one to push Joseph Muscat into seeking the leadership of the Labour Party when Dr Sant resigned after losing the 2008 general election.\nWhen Labour was returned to power in 2013 Dr Vella became Joseph Muscat’s foreign minister, focusing on broadening Malta’s relations with non-EU countries, particularly those around the Mediterranean, the United States and China. He did not seek re-election in 2017.\nDr Vella is married to Miriam (née Grima), has two daughters and a son and seven grandchildren.  ", "comment_count": 112, "id": 3570}, {"keywords": "", "author": "Keith Micallef", "article_body": "A man of integrity who will rise to the challenge and make Malta proud was the overwhelming sentiment among those who gathered to see George Vella's appointment to the presidency.\nScores of people gathered in St George's Square in Valletta to follow the swearing in ceremony on the big screen and get a glimpse of President Vella saluting those present from the Palace's Balcony.\nTimes of Malta spoke to some members of the crowd, many of whom were either his constituents or former patients.", "comment_count": 4, "id": 3571}, {"keywords": "", "author": "", "article_body": "Not one individual was prosecuted for killing turtle doves during the spring hunting derogation period, BirdLife Malta said on Thursday.\nThe eNGO was commenting following the Ornis Commitee meeting on Wednesday, held just a week before the opening of the spring hunting season, to which senior police officials were invited to discuss enforcement plans.\nBirdLife Malta has been vociferously protesting against the opening of the hunting season for quail, insisting that this was a smokescreen which would allow the illegal killing of the red-listed turtle dove.\nThe eNGO said that the derogation allowing spring hunting between April 10 and 30 could only be justified to the European Union if it followed a strict number of criteria, including that of enforcement.\nIt said Maltese authorities were obliged to field a ratio of seven police officers per 1,000 hunters. With 7,647 applications for spring hunting licences, this makes this year’s requirement a total of 54 officers at any one time.\n“While on paper these figures would be reported as a given, their effectiveness is very limited,” it said.\nThe last two weeks of April are associated with a peak migration of turtle dove.\nBirdLife Malta said 2018 was a record year for illegally shot protected birds since 2013 with a total of 114 reported.\nSo far this year, it has already received 13 illegally shot protected birds during the closed season. Ten of these were recovered since the start of spring, seven of them confirmed shot just over the past week.", "comment_count": 5, "id": 3572}, {"keywords": "", "author": "", "article_body": "The new President was urged to defend Malta's heritage on Thursday during pontifical Mass before his swearing-in.\n\"The President of the Republic has the privilege to be the Head of State. We want to see in him a defender of Malta’s heritage in every sense – cultural, historical, artistic, architectural and natural,\" Archbishop Charles Scicluna told George Vella during his homily.\nEarlier, Mgr Scicluna said the economic prosperity of a country was placed on a sound foundation when its leaders first embraced attitudes linked towhat was wise and right.\nThe same could be said for the reputation of the country: \"it is strengthened and grows depending on the priorities we have when we embrace the valuesof integrity, justice and solidarity. If the first or only thing we seek is gain or profits, democracy becomes a kerdocracy (a society based on a mad rush after profit) and from there on it is easy to slide into a kleptocracy (a society where power is in the hands of the greediest).\"\nAs Pope Francis had explained in his Message for the 2019 Day of Peace: “The thirst for power at any price leads to abuses and injustice. Politics is an essential means of building human community and institutions, but when political life is not seen as a form of service to society as a whole, it can become a means of oppression, marginalisation and even destruction.”\nMgr Scicluna said the figure of the President was welcomed as a symbol of national unity and as a call for a democracy based on the choice for what was right and a hunger for justice.\n\"The fundamental role of the President of the Republic is to remind us by means of words, gestures and example that politics is above all a service without fear or favour, but with a real sense of responsibility, a real sense of service to the State and a big heart full of compassion.\n\"The President of the Republic has the privilege to be the Head of State. We want to see in him a defender of Malta’s heritage in every sense – cultural, historical, artistic, architectural and natural. The President encourages us to defend, appreciate and promote all that is good and beautiful among us, all that we need to preserve for the benefit of future generations,\" he said.\nIn his homily, the Archbishop thanked outgoing president Marie-Louise Coleiro Preca for her service and wished President-elect Vella well. \nRead an official translation of the homily on pdf below.\nDr Vella waves to the crowd in Valletta. Photo: Chris Sant Fournier\nA heartfelt send-off to Dr Vella\nDr Vella was given a heartfelt send-off by the people of Żejtun when he emerged from his residence on his way to Valletta this morning.\nHundreds, who knew him as their doctor, shook his hand, hugged him and chatted briefly with him as he walked slowly to his official car. Elderly people had tears in their eyes.\nMany young school children also lined the street, waving Maltese flags.\nDr Vella was escorted to St John's Cathedral by police motorcyclists. He was welcomed by a loud cheer by those who gathered around St John Square in light rain.\nThose present for the Mass included President Marie-Louise Coleiro Preca, the prime minister, the Speaker, members of the government and the opposition, the judiciary and the diplomatic corps.\nAlso present were members of other religious denominations, who recited prayers in their own languages.\nThe people of Zejtun give Dr Vella a memorable send-off. \n\n\nPhoto: Chris Sant Fournier\nPresident Marie-Louise Coleiro Preca greets the crowd in Valletta before the Mass.\nThe prime minister and Mrs Muscat arrive at St John's.(DOI)\n ", "comment_count": 29, "id": 3573}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "As the fuel stations policy review inches towards conclusion, plans for another facility on agricultural land in Burmarrad could be headed for approval.\nThe Planning Authority is scheduled to decide next Thursday on a proposal to ‘relocate’ a kerbside fuel station from the town centre to a field outside development zones on Triq Burmarrad.\nThe plans, which include a car wash, a retail outlet, offices and parking spaces, are recommended for approval despite the objections of the Environment and Resources Authority and the planning watchdog’s agricultural advisory committee.\nThe committee has certified that the land is of good quality and could potentially support an agricultural yield valued at about €27,000 a year.\nThe 2015 fuel stations policy specifically blocks relocations to good quality agricultural land. \nHowever, the PA’s case officer said the land was not designated as an area of agricultural value and that the same policy allowed such a relocation in cases “where the community would benefit from the relocation” and where there were no “unacceptable adverse environmental concerns”.\nThe case officer also noted there were no suitable alternative sites for the relocation and that the developer had downscaled the fuel station footprint from 3,700 square metres to 2,400 and then to 1,700 square metres.\nThere is no valid justification for the further loss of undeveloped land\nEnvironmental authorities have also sounded the alarm over the plans. When the application was first submitted, the Environment Protection Directorate (forerunner to the ERA) said the proposed development was not “simply a relocation to a safer location but is a major expansion ODZ with rather extravagant land take-up”.\nIn the latest assessment, the environment regulator said: “There is no valid justification for the further loss of undeveloped land outside the development zone boundary, along with the associated environmental impacts to accommodate such use.”\nThe application by Bonnici Stores Ltd was submitted in 2007. Two previous applications for a filling station and a fuel station on the same site had already been rejected in 1995 and 1997.\nThe PA’s latest decision comes amid a long-promised review of the controversial fuel stations policy, ordered by Environment Minister José Herrera in January 2018 to minimise the burden on agricultural land.\nAfter months of delays, Dr Herrera and Planning Minister Ian Borg pledged to publish the revised document for public consultation this month.\nRead: Petrol station relocations to ODZ could be allowed\nHowever, a key proposal made by the ERA for the review – a ban on all new and relocated fuel stations ODZ – is unlikely to make it into the final policy, with Dr Borg suggesting recently that relocated stations would still be allowed.", "comment_count": 35, "id": 3574}, {"keywords": "", "author": "", "article_body": "A young construction worker was injured in a fall late on Wednesday afternoon.\nThe police said an 18-year-old Syrian fell while working on a site at Triq Kanonku Giovanni Dedamenico, in Żejtun. The accident happened at about 7pm.\nHe was seriously injured. ", "comment_count": 9, "id": 3575}, {"keywords": "", "author": "Ivan Martin", "article_body": "The murder of a mother and her daughter in Għaxaq last week is the third instance of bloodshed within the ill-fated family.\nJoseph Bonnici, 38, of Għaxaq, was on Sunday charged with murdering his mother, Marie-Lourdes Bonnici, 70, and his sister, Angele, 29.\n\nThe prosecution said in court during his arraignment he had confessed to the double killing when being interrogated by the police and later also agreed to take investigators to the Gudja field where he had buried the two bodies. \nThe grim discoveries were made early on Saturday.\nThe two had been reported missing the Wednesday before, having last been seen 24 hours earlier.\nPaul Bonnici, the father of the accused, is serving a 31-year prison sentence after having been convicted of killing two neighbours 19 years ago.\nJoseph Bonnici’s own grandfather had been shot dead in October 1978.\nThe 2000 double murder was the culmination of a long-standing dispute between the Bonnici family and their neighbours. \nTheir regular arguments came to a head one day in May when Mr Bonnici Sr shot Joseph and Carmela Dalli outside their home. He then reloaded the gun and shot the two at point-blank range in the head, his trial had been told.\nThe grandfather’s murder occurred in the village of Kirkop, which was rocked by the mysterious shooting of father-of-nine Ġużeppi Callus, 57.\nHe was fatally shot in the chest while at his field. Hearing a gunshot, the victim’s wife, Antonia, rushed to his aid. \nMr Callus, who was bleeding profusely, reportedly died in her arms.\nThe murder remains unsolved to this day and all investigators had been able to establish was that the murderer was likely to have hid among the trees and then shot Mr Callus from behind a tree. Antonia Callus had insisted her husband did not have any enemies and believed it was a heated political issue that had led to the murder.\nMurder weapons found\nTVM reported yesterday that the murder weapons used in last week's murder - a gun and a sledge hammer- had been found by the police. They were found in the civic amenity site in Ħal Far, which was temporarily closed while the search was carried out.\nBoth victims suffered gunshots and a blow to the head with the sledge hammer.", "comment_count": 20, "id": 3576}, {"keywords": "", "author": "", "article_body": "A man was hospitalised on Wednesday following an argument in St Julian’s.\nThe police said the incident took place in Triq San Andrea at 7.45pm.\nThe man’s condition is not yet known.\nNo other details were available. The police are investigating.", "comment_count": 0, "id": 3577}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Labour government has taken the country back to feudal times, Opposition leader Adrian Delia said in reaction to a Greco report.\nThe report, by the Group of States Against Corruption, noted Maltese legislation - three-quarters of which was enacted under a Nationalist government - was good on paper, Dr Delia said. However, \"there was a total disaster\" once steps against those implicated in wrong-doing needed to be taken. \nThe report was published Wednesday, after the government delayed publishing it immediately since \"it was being studied\". \nJudge Giovanni Bonello said a country could have the best constitution in the world, but it was worth nothing if it was being led by crooks, Dr Delia said.\nNoting the report was one condemnation after another, Dr Delia said the effectiveness of the country's institutions had been hampered after the Prime Minister appointed people who failed to do their job. \nTurning to reports that the public prosecutor was to be a government appointee, Dr Delia said instead of one person being pulled by strings, there would be two. \nThe government has said it would be hiving off the prosecution role from the Attorney General’s functions, implementing a recommendation by the Venice Commission.\n\"Things aren’t done that way. We are no fools and you are not pulling our leg. You either implement all the recommendations and implement them well or don’t implement them at all,\" the Opposition leader said.\nThe country, he said, was worse than it was in the 1980s. Instead of a Malta for everyone, there was now a Malta that was only for them, he said, referring to the Labour party's electoral slogan Malta Tagħna Lkoll.\nAt the end of his address, the Opposition leader said the PN would not lose heart. He encouraged others not to lose hope and to stand to convince others.\n\"This is not a fight against Labour. This is a fight for Malta, for Nationalists and for true Labourites. Let us protect our national identity so that we can truly say that Malta has truly been given to everyone,\" he said.\n ", "comment_count": 72, "id": 3578}, {"keywords": "", "author": "", "article_body": "An 85-year-old woman from Sliema and a 32-year-old man were grievously injured in separate traffic accidents on Wednesday afternoon.\nThe police said the woman was injured when she was hit by a car in Triq Clarence, Msida at 1.40pm.\nShe was hit by a Mercedes Benz that was being driven by a 28-year-old woman from Mosta. The driver lost control of the vehicle which ended on the pavement and hit the woman.\nIn the other accident, a 32-year-old Eritrean who lives in Birkirkara who was riding a Sym in Triq Salvu Psaila, Birkirkara, was injured when he was involved in a collision with a Toyota Passo that was being driven by a 27-year-old woman from Birżebbuġa.\nIn both accidents, the victim was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 3579}, {"keywords": "", "author": "", "article_body": "A new initiative by French President Emmanuel Macron will give civil society activists the opportunity to discuss their ideas in the youth, education and mobility sectors.\nA summit taking place in Marseille in June will discuss the important role of the region's particularly active civil society. The summit will consist of a meeting of the heads of State and Government and a regional dialogue with prominent civil society representatives from Malta. \nSpeaking about the initiative, Foreign Affairs Minister Carmelo Abela said Malta has always been a location of dialogue, tolerance, cooperation and trade. \n\"This approach is not just a matter of consequence but is rooted in a strong and principled belief that peace, stability, and prosperity in the region represent Malta’s and the region’s vital interests,\" he said.\nIn April, Malta will host one of the five regional civil society fora that are being organised in preparation for the summit. It will focus on \"Youth, Education and Mobility\". For each of the five fora, Malta will be represented by a man and a woman with Prof. Simone Borg as the chef de file.\n\"Together with other personalities from the nine other Mediterranean countries, these participants will have the opportunity to propose a number of initiatives which will be presented to the heads of State and Governments in Marseille for their endorsement. These will then be translated into real and tangible projects,\" Mr Abela said.\nFollowing the completion of the five fora, the Maltese representatives will participate in L’Assemblée des Cent, where 10 participants from every 5+5 country will meet in Tunis to present their conclusions from the project.\nThose interested to participate in the pre-summit forum in Malta may send an email to s2r.mftp@gov.mt by 5.15pm on April 12.", "comment_count": 0, "id": 3580}, {"keywords": "", "author": "", "article_body": "Twelve environment NGOs are concerned by the use of concrete in various country pathways in various localities in Malta and Gozo.\nIn a statement, they said the works were destroying the habitat for various species of flora and fauna including protected species and pollinators such as the honey bees. The ongoing destruction of this vegetation could have an impact on honey production and the pollination of agricultural crops in Malta.\nThe construction methods used to upgrade these country pathways went against the water conservation measures already in place. The end result would facilitate water runoff and could lead to flooding and soil sealing to the detriment of the agriculture sector and other users of the Maltese countryside.\nWhile the NGOs understood that some upgrades were necessary, they demanded that any upgrading works of the rural roads network was carried out according to established policies, laws and in consultation with relevant authorities.\nIt was evident that in the ongoing works the planning process was being completely ignored. Many of the rural roads were being developed to an extent and with materials which did not respect the rural character, did not prevent water runoff, and had little to no measures of water collection.\nDingli\nThe Maltese rural setting was normally characterised with paths flanked by rubble walls and having flora growing on the sides and in the middle. The latter green infrastructure contributed substantially to the agricultural sector by supporting a variety of essential species of fauna including by providing foraging for pollinators which will eventually pollinate the cultivated crops. The presence of the side vegetation protected from soil erosion.\nRead: Why Malta's rubble walls did not make a Unesco heritage list\nThe removal of the vegetation, which often slowed down traffic, would encourage faster vehicular flows in areas that up to now had been favoured by those visiting the area on foot and on bicycles.\nThe NGOs urged all the relevant entities to follow the established mechanisms, reverse the damage already done by removing the concrete and asphalt at the sides of the country pathways, and carry out sustainable development practices.\nThe statement was signed by the Malta Beekeepers’ Association, Għaqda Produtturi tal-Għasel Malti, Breeds of Origin Conservancy, Friends of the Earth Malta, BirdLife Malta, Ramblers Association of Malta, Flimkien għal Ambjent Aħjar, Għaqda Siġar Maltin, Green House, Malta Youth in Agriculture Foundation, Nature Trust (Malta), Permaculture Research Foundation Malta.", "comment_count": 13, "id": 3581}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman whose life was irreversibly ruined after contracting the MRSA infection when admitted to St Luke’s hospital for treatment has been awarded €70,000 in an action for damages over the case which dated back 12 years.\nIt was around February 2007 when the 48-year-old housewife had been admitted to the former state hospital suffering from vertigo, nausea and stomach pains. Her medical file showed that she had been admitted on previous occasions for a number of health problems.\nOn that occasion, fearing possible dehydration, the patient was referred to the emergency department by her doctor where, upon admission, she was placed on a drip and entrusted to the care of a surgeon for the following fortnight.\nA dark bruise developed on her right forearm at the point where the needle punctured her skin, with a yellowish fluid accumulating at the spot.\nUpon trying to get out of bed some two weeks later, the patient suddenly collapsed. Her legs simply gave way.\nFollowing that episode, the woman spent four weeks in bed, unable to move and placed on antibiotics, after it was established that she had contracted the MRSA infection which had attacked her spine and had even affected her bladder.\nThat diagnosis spelt the start of an ordeal for the patient who, after spending three months in hospital, was subsequently transferred to the neuro-rehabilitation ward at Boffa Hospital pending her recovery.\nHowever, the woman never regained her former health, ending up in a precarious paraplegic state, unable to walk without a walking frame and battling a series of gastrointestinal problems, which meant that she lost her former independent life-style.\nIn the course of civil proceedings for damages, instituted against the director general of health care, a medical expert appointed by the court confirmed that the illness had resulted in a 60% debility.\nAlthough it was difficult to determine the precise incubation period of the MRSA bug, one could safely conclude that the patient had contracted the infection when in hospital, possibly on some earlier visit, as attested by her medical records.\nThe expert also pointed out that had the hospital authorities provided immediate surgery upon the early appearance of the symptoms, the patient would likely not have ended up a paraplegic for life.\nThe overcrowding at St Luke’s hospital, preceding the translocation to the new Mater Dei Hospital at the time of this particular case, possibly made things worse, the court observed.\nThe woman’s ailment meant that the hospital authorities had failed to honour their obligations under the “hospitalisation contract” entered into with each patient immediately upon admission for treatment, the court concluded.\nIn the light of all evidence put forward, the First Hall, Civil Court, presided over by Mr Justice Joseph R. Micallef, upheld the claim of the woman and her husband, awarding them €69,561.65 by way of damages payable by the Chief Government Medical Officer who was called into the suit.\nIn line with established court practice, since the woman had been a housewife, not gainfully occupied before contracting the disease, the court used the minimum wage as the yardstick for calculating damages.\nIt was observed that hospital authorities had a duty to provide an environment which would ensure the health and safety of its patients, also by affording facilities and conditions which would reasonably guard such patients against any harm or danger.\nLawyers David Camilleri and Joseph Gatt were counsel to the applicants.", "comment_count": 0, "id": 3582}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Abuse in the procurement and management of cleaning service contracts at Mount Carmel hospital, reported by Times of Malta several weeks ago, have been confirmed through a new audit by the National Audit Office.\nThe disregard to public procurement rules by the Health Ministry was only discovered by chance, during a separate investigation by the NAO of another contract, for clerical services, which was also found to be grossly irregular.\nAccording to the latest NAO findings, at the moment there is “no formal document covering the mental hospital’s outsourcing of cleaning services” and the contract, worth millions of taxpayer money every year, has been renewed every three months with the blessing of the Contracts Department at the Ministry of Finance, in clear breach of public procurement rules.\nThe NAO observed “the fact that a service bearing such a considerable financial impact is not adequately covered by an official contract document is an obvious cause for concern”. \n“The Office strongly contends that procuring a service for three months with a value of nearly half a million euros through a call for quotations and extending it over a number of years with increasing financial values, poses a considerable governance risk,” the NAO insisted.\n“The financial value at which cleaning services at MCH are acquired far exceeds the maximum threshold for a call for quotations (as justified by the Health Ministry) as set by the national public procurement rules.” \nAlthough the NAO did not name the contractor currently providing the service, Times of Malta is informed that during the past years, cleaners at Mount Carmel were provided by WM Environmental Ltd.\nThe company was chosen directly by Health Minister Chris Fearne’s office through a direct order and kept the multi-million contract in place by temporary renewals by the Finance Ministry every three months.\nWhen the newspaper revealed the state in the administration of contracts at Mount Carmel Hospital last November, a spokeswoman for Mr Fearne had insisted that the cleaning service contract was allocated through a tender. \nThis now results to be untrue.\nThe NAO also discovered a similar trend in other contracts administered by the same hospital where the cleaning contract was used to ‘recruit’ additional staff, mostly before the last election. \nAccording to the audit, while the cleaning service provider was supposed to supply the hospital with 79 cleaners, it had suddenly increased the personnel by an extra 44. However, since all the cleaners were not necessary, they were ordered to perform unrelated duties such as the collection of bulky waste, distribution of food to patients, movers and theatre operatives.\nSome of the cleaners are not well suited or trained to interact with patients\nAlso, according to the hospital’s management, some of the ‘cleaners’ were not up to standard.\n“MCH’s Chief Nursing Manager highlighted that these deployed personnel were not conversant with certain cleaning principles, which are pivotal in a hospital environment, such as complete disinfection of certain areas.”\n“Some of the deployed cleaners are not well suited or trained to interact with mental health patients,” the NAO was told.\nDuring the audit the NAO also found the approval of a discrepancy of €2.3 million approved to be paid to the cleaning service contractor.\nWhen enquired, the MCH management replied that this was “a calculation error during the approval process”.\nAbuse in cleaning contracts dished out by the government have been in the news for the past months.\nIn an identical case, St Vincent De Paul – the government’s long-term residence for the elderly – has paid over €9 million to another cleaning service provider, X-Clean, since 2015, without a tender ever issued. As happened at MCH, the Finance Ministry kept renewing the Naxxar firm’s direct order every six months.\nTimes of Malta reported that the company, given €9 million in direct payments, has not paid income tax and other taxes for the past eight years, and owes the Inland Revenue over €4 million.\n ", "comment_count": 10, "id": 3583}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The planned re-introduction of a helicopter passenger service between Malta and Gozo would not be operated by Air Malta, Times of Malta was told.\nTourism Minister Konrad Mizzi deemed such a service “does not fall within the airline’s business plan or strategy”, a spokesman said.\nPlans to re-introduce an air connection between the two islands, a service that gave rise to viability issues every time it was running, were resurrected recently by Dr Mizzi.\nHis spokesman confirmed the government’s intention to put in place a new helicopter service, adding feasibility studies were already underway.\n“The service will be run by a specifically-set-up subsidiary company of Malta MedAir,” the spokesman said.\nMalta MedAir is a government company originally set up to buy airport slots previously owned by the national airline and lease them back to Air Malta. It is distinct from Air Malta, although the government owns the majority of shares in both.\n“With regard to Air Malta, the service does not fall within the airline’s business plan or strategy. The airline will focus only on international flight connections,” the spokesman said.\nCivil aviation industry sources commented that, while the government had every right to operate a helicopter service between the islands, the explanation with respect to Air Malta did not make sense as the air connection could still be easily provided by the national airline, as happened in many other European countries.\n“Since the service will be heavily subsidised, the new service can also be a new revenue stream for Air Malta,” they said.\nAccording to EU rules, the government will be allowed to subsidise the service between Malta and Gozo through a public service obligation contract. However, the level of subsidies allowed are not yet known and neither whether a tender, similar to the Gozo channel crossing concession, is necessary.\nSources close to the government said the Gozo Minister was pushing for the helicopter service, particularly as it was deemed crucial for certain top-end hotels in Gozo, especially during the winter months.\nA helicopter link used to be provided by an Air Malta subsidiary, Malta Air Charter, between 1990 and 2004, carrying an average 50,000 passengers a year. Despite Air Malta having forked out about €345,000 in subsidies a year, the service was stopped as it was not making money.\nA Spanish company – Helicopteros del Sureste – had started flying between the two islands in the first quarter of 2005 but, again, the operation turned out to be a loss- making venture and was also stopped.\nThe same happened to a seaplane service, which ran between 2007 and 2012.\n ", "comment_count": 10, "id": 3584}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Libyan man who had embarked on a drunken stabbing spree following an argument that broke out on the streets of Paceville four years ago, has been jailed 12-and-a-half years and faced with bill of expenses totaling €22,000.\nEhab Zorgani, 26, had been targeted by criminal prosecution over the attempted murder and grievous bodily harm of six persons, stabbed with a sharp instrument in the course of the incident which broke out early one Sunday morning in September 2015.\nThe violent episode had stemmed from a heated argument that erupted when one Arab man had taken a fellow national to task for harassing women, reproaching him for giving Arabs a bad name.\nAs the argument between the two escalated, Mr Zorgani, not involved in the original dispute and slightly under the influence of drink, ran along the streets of the entertainment hub, knifing some six individuals, including innocent passers-by.\nProceedings before the Magistrates’ Court had resulted in a decree, one month after the arraignment, whereby it was declared that there was sufficient evidence for the accused to be placed under a bill of indictment.\nHowever, rather than face a trial by jury, the accused pleaded guilty and was sentenced by a Criminal Court, presided over by Madam Justice Consuelo Scerri Herrera, in light of a plea bargaining exercise between the prosecution and the man’s defence counsel. Besides jail, the man was also given a €100 fine and ordered to pay court expenses totaling €22,025.", "comment_count": 0, "id": 3585}, {"keywords": "", "author": "", "article_body": "Fr Giovanni Cefai MSSP has been appointed bishop of the newly set up territorial prelature of Santiago Apóstol de Huancané in Peru, which is part of the archdiocese of Arequipa.\nArchbishop Charles Scicluna, Gozo bishop Mario Grech, and Auxiliary bishop Joseph Galea-Curmi congratulated the bishop-elect and said they would pray for the Lord to help him in his new mission.\nFr Cefai was born in Żebbuġ, Gozo in 1967 and joined the St Paul’s Missionary Society in 1984. He was ordained priest in 1997.\nDuring his priesthood, Fr Cefai served as director of the De Piro Youth Animation Centre in Malta and was parish priest of the parishes of Santa Cruz and San PabloApóstol, both in Arequipa. He was also regional superior of the St Paul Missionary Society in Peru.\nThe territorial prelature of Santiago Apóstol de Huancané is formed of 20 parishes in which more than 200,000 people, around 85% of whom are Catholic, live.\nThe territory includes 15 priests spread on 18,000 square kilometres of land, 75 times the size of Malta.", "comment_count": 9, "id": 3586}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Polish lawyer has ended up behind bars in Malta after being accused of simple theft, attempted theft from a private residence as well as charges of having allegedly harassed, blackmailed and threatened former colleagues at a law firm, causing them to fear violence. \nHe was further charged with the misuse of electronic equipment.\nBartosz Marcin Andruszaniec, 42, pleaded not guilty, explaining that he had been employed as a lawyer with a local firm but was currently uncertain as to the continued validity of his employment contract.\nProsecuting Inspector Clayton Camilleri said that Mr Andruszaniec's troubles started on February 7 when he sent a series of emails and WhatsApp messages to directors and colleagues at a law firm in what amounted to harassment, blackmail, fear of violence and misuse of electronic equipment.\nMatters took a turn for the worse last Monday afternoon when Mr Andruszaniec first stole an item, worth less than €15, from a St Paul’s Bay shop and then, merely ten minutes later, broke into a private residence close by.\nHis apparent burglary attempt was thwarted when he came face to face with the homeowner. In the ensuing scuffle, he was held and subsequently arrested by the police.  \nThe man’s defence lawyer, Graziella Tanti, requested bail, arguing that the police knew where to find him since he was residing at Xemxija and would continue to live in Malta if released from preventive arrest.\nHowever, the prosecution objected to the request, pointing out that the place where Mr Andruszaniec had taken up residence was an abandoned house, without water and electricity.\n“The place is not livable,” the inspector explained, adding that Andruszaniec was a foreigner who would not be easily traced.\nThe defence lawyer rebutted that the man was trying to find a job and was in constant contact with the police.\nHowever Magistrate Audrey Demicoli, upheld the prosecution’s objections and denied the request for bail, thus remanding the accused in custody.\nLawyer Stefano Filletti appeared parte civile.", "comment_count": 0, "id": 3587}, {"keywords": "", "author": "Jacob Borg", "article_body": "The Security Service continued to enjoy widespread surveillance powers, including backdoors into the networks of all internet service providers, sources told the Times of Malta.\nThe backdoor technology, referred to as a ‘black box’, allowed the Security Service (MSS) to remotely monitor in real-team internet traffic, including on smartphones and other devices, without any judicial oversight, the sources noted.\nBy law, the MSS is tasked with protecting the national security and, in particular, against threats by organised crime, espionage, terrorism and sabotage, the activities of agents of foreign powers and against actions intended to overthrow or undermine parliamentary democracy by political, industrial or violent means.\nThe MSS must also safeguard the economic well-being of Malta and ensure public safety, particularly the prevention or detection of serious crime.\nSources familiar with the surveillance capabilities said the MSS had such ‘black box’ devices installed at all ISPs, allowing them to monitor the metadata of a targeted user. A warrant issued by the Home Affairs Minister would be required to conduct such monitoring. \nCommunications companies are legally barred from discussing the MSS’s surveillance capabilities\nAnalysis of metadata can help give insight into an individual’s movements, interests and relationships, although the actual contents of the target’s messages and other similar data will not be captured via the remote monitoring system.\nThe ‘black boxes’ allowed the MSS to remotely monitor a target’s data without needing to go through the ISP, the sources said.\nCommunications companies are legally barred from discussing the MSS’s surveillance capabilities.\nA report by the Group of States against Corruption (Greco), published on Wednesday morning, flagged the “broad discretion” given to the Home Affairs Minister and the Prime Minister when approving MSS surveillance, the sources said.\nSuch discretion was not supervised by a judicial authority, they pointed out.\nOversight\nIn its Malta evaluation report, Greco says the investigation and prosecution of corruption cases would often require the use of special investigative techniques due to its eminently secretive nature.\nThe only supervision in place, the report notes, involves a “mere commissioner” who is appointed by and reports to the Prime Minister, as well as a security committee composed of the Prime Minister, two other members of the government and the Opposition leader.\nSurveillance measures can be applied for a renewable term of six months with no absolute upper limit and the warrant can be modified at any time by the minister.\nGreco urges Malta to provide for a proper system of checks and balances and also a balance between the need for an effective fight against corruption and other forms of serious crime and the upholding of fundamental rights.\nIt recommends that criminal investigative bodies should be empowered by law to seek and use wiretaps and other similar measures in the investigation of corruption offences and the judiciary would be able to authorise their use. The resulting evidence should be admissible in court while respecting the case law of the European Court of Human Rights.\nGreco also recommends that it is made clear to all the authorities involved in the investigation of corruption that the evidence obtained through surveillance is, under certain conditions, admissible in court.\nLeaked e-mails from May 2013 indicated that a representative of Alberta Malta had enquired about marketing the Italian firm Hacking Team’s remote intrusion software to the government.\nReporters without Borders had described Hacking Team as an “enemy of the internet”.\nAccording to the e-mail exchanges, leaked from Hacking Team in 2015, the software was designed to attack, infect and monitor target PCs and smartphones, including features such as microphone eavesdropping, camera snapshots and screenshots.\nFollowing a meeting with government officials, the Alberta representative had told Hacking Team the MSS was already in possession of such software but it was probably outdated.\nFurther e-mails from 2015 had shown the MSS expressed an interest in the hacking software, although the government denies any such “equipment” was bought from Hacking Team.", "comment_count": 141, "id": 3588}, {"keywords": "", "author": "Claire Caruana", "article_body": "Just over €9 million have been recovered by the taxman after offshore dealings were exposed in the Panama Papers three years ago.\nAccording to information supplied to the Times of Malta by the Tax Compliance Unit, a total of €9,194,468 has been recovered - €5,006,103 in Pure Tax and a further €4,188,365 in Omission Tax & Interest.\nThe 2016 Panama Papers leak shed a global spotlight on the use of offshore companies by criminals, celebrities and politicians to hide and launder their money away from the prying eyes of tax authorities.\nTaxmen in 22 countries worldwide raked in more than €1 billion in fines and back taxes following investigations into the Panama Papers data, which was leaked from the now-defunct Panamanian law firm Mossack Fonseca.\nAccording to the Tax Compliance Unit, there were 237 taxpayers in Malta who featured in the Panama Papers - 163 individuals, 62 companies and 12 trustees.\nThe Unit has also said that it is continuing with the pre-audit exercises on all cases that featured in the Panama Papers, of which, 121 individuals or companies are \"already undergoing a full investigation or nearing completion\".\nRead: €16.8m recovered following Panama Papers and Swiss Leaks probes\nAll cases need to follow the process of a pre-audit, a Unit spokesman said, and if it is found that the level of tax at risk is high, \"a full investigation is immediately initiated\".\nThe Panama Papers had revealed that both the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi had opened secret companies in Panama sheltered by trusts in New Zealand.\nBoth trusts were not registered with local tax authorities, and the two men were investigated by the government’s anti-money-laundering agency. Dr Mizzi blamed financial advisers Nexia BT for his failure to register his trust. An FIAU report found that Nexia BT \"withheld\" information about the two.\nIn a statement marking three years since the leak, the ICIJ said on its website that while recouping the proceeds of hidden assets helps to fund vital government services, there is a growing sentiment that the enduring legacy of the Panama Papers will be \"its effect on behaviour and public attitudes\".\nMore than 100 media organisations, including the Times of Malta participated in the investigation, which uncovered accounts in tax havens held by 140 politicians, football stars and billionaires and enjoyed a global media echo.", "comment_count": 20, "id": 3589}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Three of four men arrested in a drug raid on Monday have been remanded in custody after pleading not guilty to their alleged involvement in a drug-trafficking racket.\nSerbians Zvetco Zivkovic, a 37-year old plasterer and Celic Zvonko, 42, an embroiderer, were arraigned separately and accused of conspiracy to import ecstasy and possession and trafficking of cannabis within 100 metres of a place where young people habitually met.\nProsecuting Inspector Justine Grech explained how a police surveillance team had watched on Monday as the two Serbs met.\nMr Zivkovic had been carrying a box which was placed inside a vehicle that was parked in a garage. When the police zoomed in on site, the box yielded cannabis grass.\nOther drugs were found after interrogation of the suspects. The total yield amounting to some 17 kilos\nMr Zivkovic made no request for bail, unlike Mr Zvonko whose request was, however, turned down.\n“We are talking about an organised crime group. I have four people under arrest and 48 hours is not enough time (for investigations),” said the inspector, adding that more arrests could follow.\nWhen making submissions on bail on behalf of Mr Zvonko, lawyer Giannella De Marco pointed out that her client ran a commercial activity in Malta where he has been residing for the past 16 years.\n“He has three children in school here. Two of his children were born here. He has a clean criminal conduct. The seriousness of the charge in itself is not a reason for withholding bail,” argued the lawyer.\n“We need some form of evidence that if granted bail he would tamper with evidence. There is no fear of him absconding, quite aside from the fact that the fear of him doing so is not enough.”\nHowever, Magistrate Audrey Demicoli turned down the request for bail at this stage, issuing a freezing order upon all his assets, both movable and immovable.\nThe third man, Mark Cassar, a 40-year old Qormi resident, self-employed as a slush puppy vendor, was charged with having conspired to traffic cannabis grass, possession of the drug under circumstances denoting that it was not for his own personal use as well as with having committed these crimes within 100 metres of a place where young people habitually met.\nInspector Grech explained that the man had been spotted parking in Sliema and a box of 17kg cannabis was placed in the boot of his car. A joint was found on his person when he was arrested.\nLawyer Joe Giglio, defence counsel to Mr Cassar, told the court that he would not be making a request for bail at this stage but asked the court to recommend that the prosecution summon their witnesses as early as possible.\nLawyer Manuel Mallia was counsel to Mr Zivkovic.", "comment_count": 0, "id": 3590}, {"keywords": "", "author": "", "article_body": "Updated at 1.15pm - Police say five cars were involved\nEmergency services rushed to a key thoroughfare running along the Addolorata cemetery on Wednesday morning following reports of a five-car crash.\nVjal Santa Luċija was temporarily closed to traffic as a result of the crash. \nThankfully, nobody was seriously injured in the crash, with one of the drivers given first aid at the scene and none hospitalised. \nPolice and paramedics were sent to the scene.", "comment_count": 0, "id": 3591}, {"keywords": "", "author": "", "article_body": "Updated at 1.20pm\nA hooded man with a gun in his hand tried to rob a bank in Żejtun in broad daylight on Wednesday morning, but fled the scene empty-handed and was arrested a short while later.The attempted hold-up of an HSBC branch was reported at around 11.15am, the police said.\nIn a statement, the police said that the suspect was a 76-year-old hooded man armed with a gun. \nSources said bank workers hit an alarm bell after the man demanded money from cashiers. The alarm alerted police and automatically blocked off access to the cashiers' area. \nThe suspect fled using a getaway car, only to be caught a short while later.\nNobody was injured.\n ", "comment_count": 0, "id": 3592}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A special clause in a new law setting up the Valletta Cultural Agency allows former Valletta 2018 chief Jason Micallef to be appointed chairman despite also being at the helm of the Labour Party media house.\nThe Valletta Cultural Agency was set up in March to continue the legacy of the Valletta 2018 Foundation in the capital and to lay the groundwork for Malta’s next European Capital of Culture stint in 2031.\nMr Micallef, executive chairman of One Productions, would have been disqualified from chairing the new agency because the law establishing it bars anyone with “a financial or other interest in any enterprise or activity which is likely to affect the discharge of these functions” to occupy the post.\nHowever, the law includes a provision empowering the Culture Minister to waive such disqualification with a notice in The Malta Government Gazette if the person declares his/her interest.\nHad pledged to resign his One chairmanship\nIn fact, on March 29, the day after the new agency was officially launched, a notice appeared in The Malta Government Gazette in which Mr Micallef declared his interest and the minister duly waived the disqualification.\nMr Micallef wrote in his declaration: “I do not consider that my position in the said company [One Productions] is likely to affect the discharge of my functions as chairperson of the Valletta Cultural Agency but I am nevertheless declaring the said interest for the avoidance of doubt.”\nThe waiver includes an obligation for Mr Micallef not to participate in any agency decisions in which One could have an interest.\nThe Culture Ministry yesterday failed to respond to questions on whether the waiver provision had been included specifically to re-move any impediment to Mr Micallef’s appointment.\nMr Micallef, who also did not reply to a request for comment, has always maintained there was no conflict of interest in his dual role as chairman of One Productions and the Valletta 2018 Foundation.\nHowever, shortly after his appointment to the foundation in 2013, he had pledged – echoing Prime Minister Joseph Muscat – to resign his One chairmanship before the start of the European Capital of Culture year in 2018. He still holds the position today.\nMr Micallef’s leadership of the Valletta 2018 Foundation has been hailed as successful by the government.\nBut it has also been marked by calls for his resignation from hundreds of international artists, activists and MEPs, in particular over a controversial Facebook post seen as mocking the late Daphne Caruana Galizia and his consistent calls for the clearing of a makeshift memorial for the murdered journalist.", "comment_count": 31, "id": 3593}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Sport could be an integral part of treatment for autistic children who are put on a waiting list for psychological support. However, sporting facilities for children on the spectrum are scarce in Malta, according to local research. \nUnderstaffing within the public service provision of child psychology has seen children being put on the waiting list for months, even up to a year, psychiatry trainee Daniel Vella Fondacaro said. \nFor some autistic children, the alternative to occupational therapy and psychological support is medication that could treat severe symptoms. However, parents are always wary of medicinal treatment and often ask for an alternative, so Dr Vella Fondacaro set about looking into sport as an alternative.\nDr Vella Fondacaro will be speaking about his research at a national conference organised by the Association for Child and Adolescent Mental Health. Held on Thursday and Friday, the conference will focus on neurodevelopmental disorders.\nWhile research into the benefits of sports for autistic children has already been carried out abroad, Dr Vella Fondacaro had not come across similar studies in Malta, so he sought a sample from the Child and Young People Services unit at St Luke’s Hospital. \nWatch: Meet Quincy, an autistic child's best friend\nHe narrowed down the sample to 10 parents of autistic children, four of whom have been diagnosed with severe, four with moderate and two with a mild form of autism.\nThose with milder forms of autism prefer technology-related activities\nAccording to the feedback he received, while more parents want their children to participate in group sports and social activities, those with milder forms of autism preferred technology-related activities. \nThe research was carried out among parents of five- to 10-year olds, with the youngest ones and those with more severe autism being the most active in sporting events. \nThe parents admitted that while individual sport activities helped their children with building up their confidence, “it was like they were living in a bubble”.\nParents who took part in this postgraduate research flagged lack of awareness among the public and sports opportunities for autistic children. The biggest hurdle to overcome was the lack of group sporting activities provided to autistic children, with parents being able to mention only one dedicated facility. \nAnother challenge to engaging in sporting activities that parents who took part in the research mentioned was overcoming internet addiction.\nWhen it comes to awareness, parents explained how people would pass comments about how they dealt with their children when they threw a tantrum in public. \nFor more information, visit www.acamh.org", "comment_count": 0, "id": 3594}, {"keywords": "", "author": "Denise Grech ", "article_body": "It was a normal Tuesday afternoon at the office for Albert Bonnici, an engineer at the Kalkara marina, when he suddenly heard a loud bang that sounded like a bomb had gone off.\n“It sounded like a fireworks factory explosion,” he said.\nOnly, it was no fireworks explosion but a yacht that burst into flames while berthed in Kalkara.\nThe blaze practically destroyed the yacht. Two other boats, berthed about a metre from the yacht, could have sustained damages running close to €100,000, staff at the marina said.\nStill shaking from the experience, Cecere Donato, whose boat was berthed opposite the yacht, said he was doing some odd jobs on deck when glass shards fell on him.\nDamage to yachts berthed next to a boat that caught fire yesterday is expected to run into thousands of euros. Photo: Jonathan Borg\nQuickly taking stock of the urgency of the situation, the marina employees rushed to the stricken boat and cut the ropes to push it out of its berth, thus ensuring those onboard the two adjacent boats would be safe.\nThey used a dinghy to tow the burning boat to the mouth of the creek, where the Civil Protection Department took over and used two fire-boats to quell the flames. However, the blaze was so strong that the fire only died down when the boat started sinking.\nIt is not yet known what caused the fire.\nAsked what precautions should people take when leaving a boat berthed at a marina, Mr Bonnici recommended that all mains should be switched off and gas tanks secured. He also recommended that boats are surveyed by professionals.\nThe Civil Protection Department cautioned people to always keep a functioning fire extinguisher within easy reach.", "comment_count": 0, "id": 3595}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 10.35am with reaction\nA civil servant who had a central role in the Valletta property scandal that led to the resignation of a parliamentary secretary has been given an executive position at the Lands Authority, the Times of Malta has learnt.\nCharles Camilleri, who the Auditor General had found “colluded” with Mark Gaffarena in the shady Old Mint Street property deal, was appointed acting chief officer for estate management, according to a Lands Authority staff circular issued by CEO James Piscopo.\nThis is the same office he managed prior to his resignation in the wake of the Gaffarena scandal.\nMr Gaffarena had acquired €3.4 million in land and cash from the government for the expropriation of half a building valued at about €900,000.\nMr Piscopo said in the circular the appointment formed part of a new team “capable of anticipating future demands and challenges”.\nREAD: New claims by official on Gaffarena scandal\nIn a report issued by the National Audit Office in 2016, Mr Camilleri was identified as one of the main trio of participants that led to “irregularities” that were “in clear breach of the fundamental principles of good governance, transparency and fairness”.\nThe Auditor General said Mr Camilleri was at “the centre of negotiations”, with Mr Gaffarena making frequent visits to his office almost on a weekly basis.\n“The NAO arrived at the understanding that it was the director estate management, Charles Camilleri, who assumed the primary role of negotiating with Mr Gaffarena; however, it must be stated that the conclusions of these negotiations would not have been possible without the endorsement of the DG (director general Ray Camilleri) and the final authorisation by Parliamentary Secretary Michael Falzon,” the report had said.\nSame office he managed prior to his resignation\nAfter stepping down, Mr Camilleri had issued an affidavit and told Parliament’s Public Accounts Committee he acted the way he did as he felt pressured and threatened by Mr Gaffarena and Clint Scerri, Dr Falzon’s liaison with the then Land Department, to expedite and conclude negotiations on the Valletta property.\nA Lands Authority spokesman justified Mr Camilleri’s new role saying he “was never charged with any wrongdoing regarding the Gaffarena case”.\nWhen the NAO report was published, Prime Minister Joseph Muscat had said he expected other resignations apart from that of Dr Falzon and Mr Camilleri.\nThis newspaper is informed that Mr Piscopo, a former Labour Party CEO, informed the Lands Authority board a few weeks ago about the new appointments, which also included Marisa Grech and Karen Zerafa as acting chief officers.\nNo call for applications was issued.\nAsked whether he had approved the appointments, Nationalist MP Ryan Callus, who sits on the board of directors, distanced himself from the issue.\nHe said he found the whole exercise unacceptable and an excuse to directly appoint chief officers without providing an opportunity to other well-talented officials.\n“While these new appointments were selected directly by Piscopo, calls for other positions are being issued as we speak, proving that this was nothing more than an excuse.\n“Rather than who was selected, the issue revolves around meritocracy, which was never respected, in spite it being a central pledge by the Labour government,” Mr Callus said.\n“To that effect, I formally objected to this decision during the board meeting.”\nCharles Camilleri reaction\nIn a reaction, Mr Camilleri told Times of Malta on Wednesday:\n\"The facts of the case remain that immediately after the NAO published its findings, I personally questioned these findings through an affidavit outlining my strong reservations.\n\"Eventually I was summoned to appear before the Public Accounts Committee in Parliament where I have given my full collaboration and testimony. I was also questioned by the Police for several hours where again I offered my total collaboration outlining the facts as they were.\nNeither the Public Accounts Committee or the Police recommended any action against me- Charles Camilleri\n\"Neither the Public Accounts Committee or the Police recommended any action against me. In the process I had, on my own initiative, resigned from the post I held at the Government Property Division at the time to be in a position to defend myself with integrity.\"\nMr Camilleri said he has been employed with the government and at the Lands Department for almost 40 years.\n\"I have progressed on my merit, promoted under different governments and different Ministers and Parliamentary Secretaries. I have done my job loyally and diligently for all these years and I will continue to discharge my duties responsibly. The case you are referring to almost destroyed my career, and me personally having to go through serious health issues. My family has suffered with me in silence,\" he said.\nivan.camilleri@timesofmalta.com", "comment_count": 88, "id": 3596}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Wednesday.\nTimes of Malta reveals that a civil servant who had a central role in the Gaffarena property scandal that led to the resignation of a parliamentary secretary has been given an executive position at the Lands Authority. \nThe newspaper also reports that the number of companies with more than 10 employees that recruited more workers dropped by 18 per cent in 2017.\nThe Malta Independent says cost-cutting and revenue generation remain on Air Malta's agenda. It also reports that a magistrate who is investigating the leaking of FIAU documents about Adrian Delia has summoned police officers. \nMaltaToday leads with Tuesday's parliamentary approval of the nomination of George Vella to become Malta's next president. Like the other newspapers, its front page also features a yacht which caught fire in Grand Harbour. \nIn-Nazzjon says that another damning report about the Maltese government is expected to be published on Wednesday\nl-orizzont says Malta has marked World Autism Day. A new centre to help children with the condition is being set up. ", "comment_count": 0, "id": 3597}, {"keywords": "", "author": "", "article_body": "Updated 8.55pm\nA woman was hospitalised on Tuesday evening after she was found injured on the ground in Ħamrun in a probable case of domestic violence.\nThe police said the woman was found in Triq Patri Magri at around 7.45pm.\nThe woman had several cuts all over her body and was taken to Mater Dei for further inspection.\nHer condition, age and nationality are not yet known.\n ", "comment_count": 0, "id": 3598}, {"keywords": "", "author": "", "article_body": "Four men have been arrested after the police found some 65 kilos of cannabis grass ready for trafficking in their possession.\nSome of them are being arraigned on Wednesday.\nThe police said some 17 kilos of cannabis grass were found hidden in a vehicle belonging to a 40-year-old Maltese man, from Qormi.\nAnother 47 kilos of the drug were found in a Gżira garage and in a residence in the Msida area. The police also found a haversack containing another kilo of cannabis grass, a small amount of resin and a small amount of magic mushrooms, as well as €17,000 in cash.\nThe police also arrested a 42-year-old Croat who lives in Gżira and two Serbs, aged 36 and 37, who live in Msida and Naxxar respectively, in connection with the find.\nAn inquiry is being held.\nBags of cannabis were found vacuum wrapped. Photo: Malta Police", "comment_count": 0, "id": 3599}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nationalist Party councillors in Mellieħa are seeking to reverse a recent controversial decision to issue a permit for the construction of an eight-storey hotel in a residential area on the village’s outskirts.\nThey are also requesting the government to “return” the plot of land earmarked for this hotel, for the construction of a community centre. Such a demand was made in the wake of the fact that the site was in the council’s hands through an encroachment agreement which the government terminated in 2015.\nThe move, however, will be nipped in the bud unless it is endorsed by the Labour councillors who command a one-seat majority. \nThough the council had objected when the development application was put to a vote during a Planning Authority board hearing earlier this month, Mellieħa mayor John Buttigieg was non-committal when Times of Malta sought his position on the motion.\nMr Buttigieg, who was in Adenau, Germany, on council-related business, said he was yet to see a copy of the motion.\n“The merits of the motion will be considered by the council, and if there is agreement we will forge ahead,” the Mellieħa mayor said.\nA fortnight ago the Planning Authority approved a development application by J. Portelli Projects for an eight-storey hotel next to the Valyou Supermarket. The project also comprises 120 residential units, shops and an underground parking.\nSpread over a footprint of 3,600 square metres, the development had been recommended for refusal as it was in breach of the height limitation policy for the area. Yet, the PA board controversially overruled the case officer’s recommendation on the basis of a separate policy which allowed a degree of flexibility when deciding such applications.\nPermit was approved by nine votes to four\nThe permit was approved by nine votes to four, with those against being board chairman Vince Cassar, Environment and Resources Authority chairman Victor Axiak, NGO representative Annick Bonello and Mellieħa mayor John Buttigieg. \nOn the other hand the government representative on the board and former Labour Mellieħa councillor, MP Clayton Bartolo, voted in favour. Opposition representative Marthese Portelli was not present.\nPA executive chairman Johann Buttigieg did not take part in the vote citing a conflict of interest in view of allegations made towards him by the applicant.\nDuring the meeting, PN MP and former Mellieħa mayor Robert Cutajar vehemently opposed the proposal while pointing out that in 2009, during his mayorship, the land in question had been handed to the council through an encroachment agreement. Such a concession was made on condition that the land had to be used as a park and ride facility.\nNonetheless, for the long term, the council had already expressed its wish to develop this site for a community project. Though the Labour-led council, which took office in 2013, had endorsed such a plan, in 2015 the Labour government thought otherwise as the concession was terminated.\nInstead, the government opted to sell the land by auction, which was divided in two plots. Though the selling price is not known, only offers above €2.5m for each were allowed.\nIn their motion, signed by minority leader Hilary Fenech, Emvin Bartolo and Patrick Cutajar, the PN councillors claim that the hotel will ruin “another” part of Mellieħa, goes against the local plan, would constitute an eyesore and would be incompatible with the surroundings. The motion notes that PN councillor Joseph Gauci also endorsed the move but was unable to sign it as he was abroad.\nApart from this proposal, the council has recently objected to a separate application concerning the Panorama Hotel, which is close to the village core and overlooking Għadira Bay.\nThe applicant is seeking approval for the construction of two additional storeys. The application, which is still pending, has prompted objections from residents amid concerns of over-development and that it would dwarf the nearby parish church.", "comment_count": 14, "id": 3600}, {"keywords": "", "author": "Claire Caruana", "article_body": "Transport Minister Ian Borg has insisted the police “cannot be everywhere” in reaction to criticism that the slashed drink-driving limits were having no positive impact.\nTransport Minister Ian Borg. Photo: Chris Sant Fournier\nLast week, Times of Malta reported insurers feared that lowering the drink-driving alcohol limits had little-to-no impact on traffic accidents, with intoxicated motorists still getting behind the wheel.\nThe impact was so “minimal” that insurance companies have reported no improvements in accidents involving drivers who had consumed alcohol above permitted levels.\nAsked for a reaction on this, Dr Borg said that while the government was “worried about every accident”, it was clear that despite the laws being in place and there being enforcement, people were still abusing the system.\n“We need more campaigns, including better use of social media, so that people are educated. No minister or government can control what every person drinks. We make the legislation, we enforce and we make campaigns, but ultimately this is a collective responsibility,” Dr Borg insisted. \nWhen it was pointed to him that there has been criticism over a lack of enforcement, with this only being stepped up around the festive period in December, Dr Borg dismissed the criticism, insisting the laws were being enforced all year round.\n“I am convinced that the necessary enforcement is taking place. But I repeat, this is not solely an issue of enforcement. The police cannot be at every party, wedding or family event to monitor what people are drinking. \nWe need more campaigns, including better use of social media, so that people are educated\n“It is the people who need to be responsible and be aware that when drinking and driving they are putting themselves – and those around them – in danger,” Dr Borg said.\nIn recent months, insurers have repeatedly expressed scepticism on the low number of people caught breaking drink-driving rules. They stepped up calls for action after this newspaper reported earlier this year that only three people were caught driving under the influence of alcohol on New Year’s Eve and none on Christmas Eve. \nAccording to the revised rules, motorists are considered to be under the influence of alcohol if they are found to have 22 microgrammes of alcohol in 100 millilitres of breath. This means that a man of average build is limited to just under a pint of beer or a large glass of wine while women can consume no more than half a pint of beer or a small glass of wine. \nclaire.caruana@timesofmalta.com", "comment_count": 43, "id": 3601}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman who threatened and assaulted a manager at the Malta Community Chest Fund office after her request for €50 in cash was not met was reprimanded by the court and prohibited from setting foot there for the next three years.\nAlexandra Scerri had turned up at the office located within the President’s Palace at Valletta in November claiming that she was to withdraw €50 in cash after having, earlier on, spoken to the President herself.\nHowever, a female manager, well aware of the policy not to hand out donations in cash, told the visitor, not a first timer at the office, that she would first speak to the President to confirm the facts.\nUpon doing so, the manager was informed that although Ms Scerri had indeed made such a request, claiming that she needed the money to pay for an ID card, no sum had been specified.\nThe manager returned to the waiting visitor explaining that the office was willing to hand out a cheque and refer her to a member of staff at Identity Malta who would be willing to see to her needs.\nUpon receiving this information, the woman turned aggressive, hurling abuse at the manager and slamming her laptop shut onto the other lady’s fingers, even threatening “to chop off all her fingers”.\nAs she was being reluctantly led out, the woman grabbed a heavy paper weight and was stopped short of flinging it at her victim.\nThe entire episode was recounted in court on Tuesday by the manager herself who took the witness stand, as did another member of staff at the President’s secretariat, who had also seen the incident unfold before her eyes.\nThe latter explained that the accused had turned up at the office for financial help on several occasions before November’s incident when she had “rebelled and turned violent”.\nA male security guard stationed at the office testified as to how he had heard a disturbance and had headed into the room just in time to witness the accused slam the laptop shut onto the manager’s fingers while threatening to “see her outside”.\nUpon hearing this evidence, the court, presided over by magistrate Joseph Mifsud, observed that such behaviour was reprehensible, cutting short persistent attempts by the woman to put in a word in her own defence, in spite of her lawyer’s warnings not to speak.\n“We were lucky to have had a President who opened her doors to help those in need, but such abuse is certainly not to be tolerated,” remarked magistrate Mifsud.\nWhen making submissions on punishment, defence counsel George Anton Buttigieg pointed out that this had been a one-off incident and that his client had been well-behaved whenever she had visited the MCCF on previous occasions.\n“While not condoning what she did, she certainly had no intention of doing wrong,” the lawyer argued, pleading for clemency.\nIn the light of the fact that imposing the statutory €58 fine would be “ridiculous”, the court formally reprimanded the accused and barred her from stepping into any of the MCCF offices over the next three years.\nIt also issued a protection order in favour of the injured party and other members of staff at the office concerned and called upon the legislator to raise the maximum limit of such fines to some €500.\nInspector Jeffrey Scicluna prosecuted.", "comment_count": 0, "id": 3602}, {"keywords": "", "author": "Luke Scicluna", "article_body": "George Vella was on Tuesday approved as Malta's next President during a parliamentary sitting that was boycotted by the Democratic Party. All those present for the sitting voted in favour of the nomination.\nThe former foreign minister, who also served as deputy leader of the Labour Party was nominated to replace Marie Louise Coleiro Preca by Prime Minister Joseph Muscat, who stated that few politicians could boast of as long and as distinguished a record of service as Dr Vella.\n\"He was there to serve people,\" he added, attributing Dr Vella's care for workers and patients to his upbringing.\nDr Muscat added that Dr Vella was one of very few politicians to have refused power. Dr Vella had been thrust into the spotlight by Labour Party leader Karmenu Mifsud Bonnici, who had touted him as his successor, a role which Dr Vella had not pursued.\nOpposition leader Adrian Delia noted that the government had not taken the Opposition's suggestion to nominate somebody from outside the Labour Party, at a time when national unity was needed.\nAside from the respect enjoyed by Dr Vella, there was the need for somebody who enjoyed the unanimous support of the House to accede to the Presidency.\nDr Delia said that, although the Opposition would be voting for Dr Vella's nomination, it would be moving a constitutional amendment in the coming days to ensure that Presidents could only be appointed or removed with the support of a two-thirds majority vote.\nThe Opposition Leader added that the President bore a collective moral responsibility even though the Presidency did not have executive powers. In the coming months, this responsibility would be tested when it came to decisions where the President would have the last word, he said, adding he was convinced that Dr Vella was ideal to safeguard the country’s moral fibre.\nDr Vella will be sworn in as Malta's 10th President on Thursday.\nThe House also approved a motion to recognise the work done by outgoing President Marie-Louise Coleiro Preca. Presenting the motion, Dr Muscat said that the broad appreciation for the work carried out by President Coleiro Preca was a sign of political maturity.\nWhen she was originally touted for accession to the Presidency, he said, it was commonplace to hear that the Government would be losing a key defender of the marginalised and voiceless members of society.\nHowever, the country had become richer thanks to the way in which she promoted matters of conscience and kept the Government on the straight and narrow, as she had remained vociferous in her defence of migrants and children, among other groups.\nDr Muscat expressed his certainty that the Foundation for Social Wellbeing, which would be a key element of her legacy, would continue its work under her stewardship.\nDr Delia said that what the Presidency had gained through the appointment of President Coleiro Preca, the government had lost, a loss which continued to be felt by many.\nCabinet had lost an important voice which spoke out in favour of the weak and powerless, at a time when this voice was most needed.\nThe President had shown herself to have departed from mere service to the state or to politics, and she had a powerful voice which, he hoped, she would continue to use in defence of the voiceless. He was sure that she would continue to offer her energy and enthusiasm in service of the country.", "comment_count": 14, "id": 3603}, {"keywords": "", "author": "Ivan Martin", "article_body": "Prime Minister Joseph Muscat’s behaviour at a party in his official residence at Girgenti Palace was not a breach of ethics, Commissioner for Standards in Public Life George Hyzler has concluded.\nDr Hyzler was asked to investigate the party by indepedent MEP candidate Arnold Cassola after a video of the Prime Minister and his wife Michelle Muscat chanting a partisan Labour Party anthem during a boozy party at Girgenti Palace went viral back in February.\nIn the leaked video, Dr Muscat can be seen jumping and chanting with the crowd to the former Mintoffian tune \"Ma Tagħmlu Xejn” while his wife Michelle dances in front of him, waving a bottle of champagne.\nThe historic Girgenti Palace is used as the Prime Minister's summer residence.\nIn his five-page report on the matter, Dr Hyzler concluded that Dr Muscat’s behaviour, even singing along to the chant did not constitute a breach of the ministerial code of ethics or any other statutory duty.\nThe commissioner also concluded that the organisation of a private event in the official residence which, he found, was not financed in any way by public funds was also not in breach of ethics.\n“Not everything that might offend the sensibilities of some, necessarily constitutes a breach of ethics,” the report reads.\nIt was true that the Code of Ethics for Minister and Parliamentary Secretaries obliged ministers (or, in this case, the Prime Minister) to behave to the highest order, Dr Hyzler wrote in his conclusions.\nThe commissioner however added that each situation must be assessed objectively as to whether the contentious behaviour had indeed broken any codes of conduct.\nIn this case, there was no basis to reach the conclusion that the Prime Minister had behaved in such a manner that was improper.\nFor one to celebrate within the limits of decency in one’s house cannot be considered to be behaviour that should be censored, Dr Hyzler said.\nIf a person is entitled to live in a state residence, then that person has the right to organise celebrations or private events in that residence and invite friends and relatives, Dr Hyzler said. If the guests of a private event sing a partisan chant, this does not mean that the activity somehow ceased from being private and instead became a political activity, the commissioner concluded.\nIn these circumstances therefore, it cannot be concluded that the residence was used for political purposes, he wrote.\nProf. Cassola, a former Alternattiva Demokratika chairman, had written to the Electoral Commissioner and the Standards Commissioner, saying that the video constituted \"unethical behaviour\".\n\"I urge you to open an investigation into unethical behaviour by an MP (the prime minister) and the fact that a state property is being used by a political party, something which breaches party financing laws,\" he had said in the letter, copied to the press.\nThe undated video clip also irked a number of Nationalist Party exponents, including MP Jason Azzopardi who wrote on social media: \"The former Chapel of Girgenti Palace... such a suitable setting indeed.\"", "comment_count": 42, "id": 3604}, {"keywords": "", "author": "Jacob Borg", "article_body": "A study by the European Greens has flagged Malta as a popular tax destination for the rich and famous, although the authorities refused to hand over data about the number of high income individuals who have benefited from tax exemptions.\nIn the study, published on Tuesday, the Greens call on the EU to harmonise existing tax rules and develop a common framework against tax avoidance on personal income.\nThe Greens say Malta, Cyprus and Italy recently introduced new schemes or extended existing ones “to be even more damaging”, even doing away with the need to reside in the country.\nA 2019 study by the European Commission report on citizenship and residency schemes across the EU found that although the residence requirement exists in legislation, in practice the requirement for applicants to physically reside in Malta is not verified sufficiently.\nBoth Malta and Cyprus featured on a ‘blacklist’ published by the OECD in 2018 due to the “high-risk” schemes which could allow individuals to hide or misrepresent their wealth.\nThe report by the Greens delves into how Malta, Ireland and the UK operate so-called ‘non-dom’ schemes. Such schemes allow people residing, but not domiciled in these countries for tax purposes, to avoid paying tax on foreign-derived income.\n“Anyone who keeps his or her investments neatly separated in Jersey or the British Virgin Islands whilst living a comfortable life in London or in the pleasant climate of Malta can thus make huge profits without paying any tax there or in any other place”, the Greens say.\nThe Greens note in their report how Malta is the only European country to feature in a top 20 worldwide list of wealth growth driven by the migration of wealthy people over the past 10 years.\nAccording to the list, published by research group New World Wealth, while Malta experienced migration driven wealth growth of 95% between 2007 and 2017, European countries with high tax regimes experienced negative growth.\nGreens MEP Sven Giegold, who has been in both the PL and PN’s crosshairs this week over calls for decisive action by the European Commission over Malta’s rule of law failings, urged the Commission to present an action plan on how to end tax avoidance of the super-rich.\nHe said European tax competition had entered a new phase. \"The EU member states are inviting not only Apple, Facebook and Amazon, but also super-rich people like Christiano Ronaldo to reduce their tax burden.\"\n\"The EU member states compete for the privilege of wealthy private individuals with extra tax deals while the rest of the population pays the bill”, Mr Giegold said.\nMr Giegold said the front runners of tax injustice are the Netherlands and the UK, each with more than 50,000 beneficiaries of non-dom rules.\nA request for data by the Greens for information about the amount of beneficiaries in Malta was rejected by the Finance Ministry.\nMalta last week was dubbed a “tax haven” by the European Parliament due to its advantageous tax regime for companies.", "comment_count": 16, "id": 3605}, {"keywords": "", "author": "Claire Caruana", "article_body": "The vast majority of those who reported domestic violence last year were again women, official data has confirmed. \nTabled in Parliament on Tuesday by Home Affairs Minister Michael Farrugia, the data shows that last year, 1,546 domestic violence reports were reported to the police. The minister provided the information in reply to a question by PN MP Claudette Buttigieg. \nOf these, only 364 came from male victims, the remaining 1,182 were from women. \nLast year's figure was the highest since 2010, up from 1,397 in 2017.\nThe most common type of violence, the data shows, was that defined as psychological harm, followed by slight body harm \"with physical force\". \nOn age groups, the data shows that while those aged between 18 and 59 were most likely to be victims - 1,055 women, 256 men - a number of people over the age of 60 also reported some form of domestic abuse. \nAccording to the data, there were 83 women over the age of 60 who filed such reports. The number of males over the age of 60 who reported abuse stood at 62.\nAnd while there were more reports from female adults than men, reports by boys under the age of 18 surpassed those by the number by girls in the same age group. While there were 44 girls who about whom a report was filed, there were 46 boys. Last year's figure marked the first time in recent years that more boys reported abuse than girls. \nDespite the laws being updated in recent years to better protect those domestically abused, the numbers have continued on an upward trend.\nWhile NGOs that work with victims have acknowledged that more awareness could result in an increase in the number of people coming forward to report abuse, they have often warned that victims often feel like abusers get away with impunity, with few offenders ever actually being found guilty of such crimes. ", "comment_count": 15, "id": 3606}, {"keywords": "", "author": "", "article_body": "A Serbian woman who shot video of two elderly British men as they wasted away inside her Buġibba apartment has been jailed for five and a half years. \nDragana Mijalkovic, 45, had become the subject of a criminal investigation when 78-year-old Neville Ayers had been found dead inside her flat, merely months after another man, 67-year-old David Grant, had been discovered under similar circumstances, both men bearing visible signs of neglect.\nDragana Mijalkovic\nEver since her arraignment back in 2016 over charges of having caused her victims unjustifiable physical and mental suffering to the extent of placing their lives in jeopardy, Ms Mijalkovic was detained under preventive arrest, never being granted bail.\nCriminal proceedings drew to an end on Tuesday with the delivery of a 63-page judgment delivered by magistrate Donatella Frendo Dimech, which painted a very sad and disturbing picture of the suffering endured by the victims who were reduced to a mere shadow of their former selves in the final stages of their lives, while sharing the accused’s life and home.\n'A documentary'\nThe court closely analysed a series of videos and snapshots recorded by the accused, reportedly to serve as evidence of the men’s reluctance to seek medical help.\nThe court likened the footage to “a documentary produced by the accused, written and directed for actors who played their part involuntarily and against their will”.\nMs Mijalkovic's voice in the background consistently came across as being detached and void of concern for the health of the vulnerable persons who were being filmed in the most awkward and helpless positions, the court observed, either naked in an empty bath, or in a crumpled heap on the floor, soiled in their own faeces.\nMr Grant had appeared bruised and cut, short of breath and hardly able to answer the incessant questions which the accused kept putting to him.\n“Why you fell? For last month how many time you fell?” and other questions in similar vein which the woman kept putting while filming the men instead of shouldering her duty of care towards them and seeking immediate medical help.\nShe had allowed their health to deteriorate, more concerned with gathering evidence which ultimately served “to incriminate rather than exonerate her,” the court declared.\n“Her attitude was unemotional and cold, retaining a distant stance without a shred of mercy, totally dismissive in spite of the scenes before her,” the court remarked, concluding that the prosecution had proved its case beyond reasonable doubt.\nThe woman was deemed a “serious and real threat to society,” unscrupulous living off elderly and vulnerable men, yet turning her back upon them when they most needed her help, continuing to film them instead of seeking immediate medical assistance.\nSuch behaviour called for a punishment that would put the accused “out of circulation” and serve as a deterrent by sending out a message loud and clear.\nUpon such considerations, the court condemned the accused to a five-and-a-half year effective jail term out of a possible seven-and-a-half maximum and ordered her to pay €14,514 in court expenses.\nThe court also ordered the accused’s removal from Malta once she served her sentence.\nInspectors Fabian Fleri and James Grech prosecuted.\nPeter Fenech took over from a legal aid lawyer as counsel to the defence.", "comment_count": 0, "id": 3607}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "An employee at Kalkara Marina hesitated for only a few moments when confronted by the fire raging on a yacht at one of the pontoons on Tuesday morning.\n“All of us had taken a course in fire fighting – so we knew what we had to do,” he said.\nDeclining to be named, the employee – who has decades of experience – was taken aback when he saw the plumes of acrid smoke and the roaring flames.\n“Fibreglass catches fire very quickly – even quicker than petrol,” he said, admitting he was still shaking from the experience.But when you are confronted with that blaze, it is really impressive\n“But when you are confronted with that blaze, it is really impressive. All I can say is praise the Lord that there was no one on board at the time.”\nThe fire broke out at 12.15pm and the marina staff’s priority was to get the boat out of its berth, a risky manoeuvre using a dinghy to pull it out and away from the boats lying a metre or so away on either side.\n“We were scared at the time,” the employee acknowledged, with his colleagues near him nodding in agreement, “but we knew how important it was to stop the fire from spreading and to control the damage.”\nThe boat - which has been in the marina for over a year - was towed out to the end of the creek where the Civil Protection Department took over, using two fire-boats to control the flames.\nDaniel Cilia's photo show the marina's staff taking action to get the boat out before the fire spread to other boats.", "comment_count": 8, "id": 3608}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Prime Minister’s wife Michelle Muscat fired a missive at the media on Tuesday, insisting they should not report “based on the agenda of those who lead them”.\nMrs Muscat was representing the Marigold Foundation in presenting a donation to the San Blas Rehabilitation Centre for men. The building is undergoing renovations after it was found to have “mould” on the walls and ceilings.\nBut the Prime Minister’s wife decided to dedicate most of her speech to lambast the media for using its power to be “negative”.\nShe said the power of the media was very often being used badly and that it should report on important projects no matter who was behind them.\n“I was a media student so I know exactly what I am talking about,” she said.\n\"If we weren’t strong and did not believe in what we were doing, then the media would have broken us,\" she added.\nMrs Muscat said the Marigold Foundation kept on working despite those who “tried to break” it.", "comment_count": 149, "id": 3609}, {"keywords": "", "author": "", "article_body": "A 24-year-old motorcyclist who lives in Santa Venera was injured in a traffic accident in his hometown on Tuesday.\nThe police said the accident happened in Triq San Pawl at 2pm.\nThe motorcyclist was riding a Sym Symphony when he lost control.\nHe was taken to Mater Dei Hospital for treatment where his injuries were found to grievous.\nThe police are investigating.", "comment_count": 0, "id": 3610}, {"keywords": "", "author": "Denise Grech ", "article_body": "Plans to postpone administrative council elections to a later date are being opposed by the Nationalist Party. \nAccording to a legal notice published last month, elections for administrative councils scheduled for next month \"shall be postponed and held on any other date as published by regulations issued by the minister\". \nThere are currently 16 hamlets, including Swatar, Madliena and Baħar iċ-Ċagħaq, which are run by administrative councils. \nVoters will go to the polls to elect their local councils in May. \nThe Nationalist Party on Wednesday criticised the legal notice. PN MPs Robert Cutajar, Karol Aquilina and David Agius presented a motion to the Speaker calling for a debate on the decision. \nThe date for the administrative council elections has not yet been announced or determined, the PN MPs noted in their motion.\nA draft white paper into reforming local councils could do away with administrative councils altogether, with their powers moving to larger neighbouring local councils. \n ", "comment_count": 3, "id": 3611}, {"keywords": "", "author": "Claire Caruana", "article_body": "A policy specifically-designed to address inclusiveness in schools all over the island was unveiled on Tuesday, with a public consultation running until next month.\nUnveiled at the St Benedict College in Kirkop, the new policy outlines 10 themes that educators would be able to follow to ensure inclusion in all schools.\nUnder the new policy, school leaders, for instance, would be tasked with ensuring that the diverse needs of different students were all met. They were encouraged to build what was being called “an effective learning community” at the schools.\nRead: Report on inclusive education launched\nEducators would have to set targets to ensure that the school as a whole developed and moved forward. A shift towards teaching that involved less curricular, social and physical barriers, and more towards increased accessibility was also being proposed. Parents and the rest of society would be urged to engage with the school community.\nMentoring of teachers to ensure a holistic environment was also being put forward while policies on positive behaviour would be introduced.\nSpeaking at the unveiling of the policy, Education Minister Evarist Bartolo insisted that ensuring inclusion was not an easy feat.\n“Inclusion is difficult and it is difficult to understand this. It is not a destination but a continuous journey. We can speak about this a lot but unless there is love, it is useless to have professional development and to have talk and policies.\n“At the end of the day, it is the commitment to open ourselves to each other and to those who are different to us. We need to understand that the educators face a difficult feat,” the minister said.\nOn his part, Permanent Secretary Frank Fabri insisted that inclusion that was exclusively tied to children with certain physical needs did not make sense. Instead, he said, the focus should be on the need of every single child and a move away from the one-size-fits-all approach.\nThe public consultation, which comes to an end on May 10, can be accessed here.\n ", "comment_count": 8, "id": 3612}, {"keywords": "", "author": "", "article_body": "The EU has approved €150 million in funding for a Water Services Corporation initiative, the largest ever Cohesion Policy financing for a project in Malta.\nThe project was one of 25 large infrastructure projects in 10 member states that will received a total of €4 billion from the Cohesion Policy funds.\nThe ‘Net Zero Impact Utility’ project is being described “as a blueprint in terms of water sustainability”, the corporation said, affecting the way water is produced and distributed across Malta and Gozo.\n“The approach is so holistic that it will not only lead to a drastic improvement in groundwater conservation, but it will also lead to better energy efficiency and an improved product for the general public. The €130-150 million investment balances the social, economic and environmental dimensions of sustainability and will result in a better quality of life also in a context of a rapidly growing economy,” it added.\nWhat is being done?\nThe capacity and efficiency of seawater desalination plants is being upgraded to produce more water with less energy. The corporation’s ground water extraction will be reduced by 4 billion litres per year. A new reverse osmosis plant is also being built in Gozo with a production capacity of 9 million litres per day.\nThere will also be an overhaul of the distribution and blending system, central to which is a €33 million tunnel from Pembroke to Ta’ Qali. Major upgrades are also being undertaken on the sewage network with new treatment technology being introduced.\nWatch: WSC plans a tap water revolution\nA maximum of 7 billion litres a year of recycled water are also being made available to the agricultural community through over 70 kilometres of network and over 400 automated dispensers.\nWho else benefitted?\nThe other member states to benefit are Bulgaria, Czechia, Germany, Greece, Hungary, Italy, Poland, Portugal and Romania. The projects cover a wide range of areas: health, transport, research, environment and energy. With national co-financing, the total investment in these projects amounts to €8 billion.\nCommissioner for Regional Policy Corina Creţu said: “These 25 projects are as many examples of how the EU is working to improve everyday life for our citizens from better drinking water to faster rail transport and modern hospitals. In the current budget period, I have adopted 258 large infrastructure projects worth €32 billion of EU funds; they are, in a way, the ambassadors of Cohesion Policy and I'm proud of each and every one of them.”\n• Large infrastructure projects – so-called “major projects”– are worth over €50 million of Cohesion Policy funds (€75 million in the case of transport projects).\n• In the 2014-2020 programming period, 258 major projects have received EU funding.\n• The EU contribution to these projects amounts to €32 billion, which is half their total value.", "comment_count": 18, "id": 3613}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man and a woman who admitted to having threatened and assaulted blogger Manuel Delia’s wife during an incident in Valletta last December were placed under protection orders on Tuesday.\nPaul Cassar, 59, and Helen Cutajar, 58, were accused of threatening and insulting Clemence Dujardin on December 13.\nMr Cassar was also separately accused of assault and criminal damage, having smashed Ms Dujardin’s mobile phone as she filmed the unprovoked attack.\nThe victim’s husband, Manuel Delia, had blogged about the assault, explaining how his wife had been out Christmas shopping in Valletta when she stopped to have a chat with some activists in front of the makeshift memorial to assassinated journalist Daphne Caruana Galizia.\nUpon hearing a commotion and saw a small group of people shouting and swearing at activists who were laying flowers and candles at the foot of the memorial.\nWhen she tried to film the incident, she ended up having her phone knocked out of her hands. She was then punched by a man, later identified as Mr Cassar.\nMagistrate Joe Mifsud said people had a right to express themselves without getting hurt.\n“You should never have gotten to this stage,” he told the guilty pair.\n“They have a right to express themselves as do you. That is the beauty of our country - that we don’t agree but we get along.”\nAs the two admitted to the charges, the court ordered that any issue of damages be settled before proceeding to deliver judgment.\nMs Cutajar was handed a reprimand and admonition, whilst Mr Cassar was conditionally discharged.\nMoreover, the court placed the two under a Protection Order in favour of Mr Delia and his wife, both present in the courtroom.\nAfter delivery of judgment, the magistrate urged the parties to shake hands.\nHowever, parte civile lawyer Andrew Borg Cardona, declared that at that stage “they would exchange greetings and stop there today,” as the parties silently filed out of the courtroom.\nInspector Priscilla Caruana Lee prosecuted. Lawyer Dustin Camilleri was defence counsel.\nLawyers Karol Aquilina and Jason Azzopardi were also parte civile.", "comment_count": 25, "id": 3614}, {"keywords": "", "author": "Edwina Brincat", "article_body": "NGO Mission Lifeline presented documentary evidence in open court on Tuesday showing that its vessel was Dutch-registered in spite of a new certificate attempting to cast doubt upon the ship’s flag.\nThis snippet of information emerged during the testimony of the NGO’s CEO Axel Steier who was giving evidence in the ongoing compilation against captain Claus-Peter Reisch.\nThe captain is currently facing charges of steering the ship within Maltese territorial waters without the necessary registration and licence.\nThe 57-year old German captain had been at the helm of the charity-run ship MV Lifeline when it had rescued more than 200 migrants in the Mediterranean last June.\nRead: It's Dutch to me: Lifeline case delayed again due to lack of translators\nWith the compilation now entering its final stages and a judgment expected in May, the last witness summoned by the defence was Mr Steier who took the stand, confirming documentation and answering a series of questions to prove that the ownership and registration of the vessel was in order.\nThe MV Lifeline had been purchased from NGO Sea Watch in August 2017 for €120,000, said Mr Steier who exhibited the bill of sale, the contract, as well as the protocol of delivery and acceptance, dated September 2017.\nUpon transfer of ownership, the vessel’s Dutch flag had been retained, the witness explained, supplying an account of all the formalities undertaken to keep the flag, obtaining a new registration and an international certificate showing that the MV Lifeline, owned by the eponymous NGO, had a Dutch flag and its home port at Amsterdam.MV Lifeline is clearly a Dutch vessel\n“MV Lifeline is clearly a Dutch vessel,” Mr Steier stressed, adding it had only been after the start of these proceedings before the Maltese courts that the NGO had received a certificate in an open envelope in the post, with an ‘N/A’ instead of the former reference to its Dutch flag.\nEarlier on, the Dutch embassy had signaled that the Lifeline’s registration was not in order, stating this by means of a tweet which the NGO had immediately countered via the same Twitter platform.\nRead: Bloody hands and a mock trial as Lifeline case delayed again\nAnswering a question under cross-examination, Mr Steier confirmed that the Lifeline’s rescue operations in respect of “people in distress” especially in the Mediterranean, clearly fell within the parameters of the vessel’s official mandate which limited its licence to “recreational purposes and not for financial gain.”\n“We do it out of love for people,” remarked the witness, thus bringing down the curtain on the evidence stage.\nAfter the defence team had declared that it had no further evidence to put forward and as the prosecution presented its written note of submissions today, the court, presided over by magistrate Joseph Mifsud, adjourned the case for judgment on May 14.\nInspectors Mario Haber and Daryl Borg prosecuted. Lawyers Cedric Mifsud, Neil Falzon and Gianluca Cappitta were defence counsel.", "comment_count": 0, "id": 3615}, {"keywords": "", "author": "", "article_body": "A 44-year-old man from St Paul's Bay has been taken to court after allegedly defrauding a number of foreigners by taking rental deposits for properties which were not actually under his control, the police said.\nInvestigations were launched after several people complained that people had paid deposits online only to later find out that the property had already been rented out to other people by the landlords.\nThe deposits were more than €5,000.\nThe accused pleaded not guilty and has been remanded in custody. \nInspectors Elton Taliana and Bernardette Valletta prosecuted. ", "comment_count": 2, "id": 3616}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A sick cow could die overnight if it is not treated with antibiotics.\nBut how lax are breeders with the medicine, considering that its misuse could pass on resistant bacteria to the person who ends up drinking its milk?\nFarmers say they cannot abuse antibiotics even if they wanted to, and tests reveal high compliance.  \nThere are concerns, however. We spoke to stakeholders, from farmers to doctors, to better understand the situation.\nThe farmer \nConsuming animal products containing antibiotic residues is just as bad astaking a dose of antibiotics, medics warn, but dairy farmer Frankie Fenech says breeders are subject to strict monitoring.\nMisuse of antibiotics could mean the end of an animal breeder’s livelihood as it could mean losing EU funds and other grants that are often a lifeline for the farmer, according to Frankie Fenech.\nThe former president of the Koperattiva Produtturi tal-Ħalib explained that dairy farmers were required to keep prescribed painkillers and antibiotics on their farm as part of their welfare regime.\nPaul Spiteri (left) and Frankie Fenech. Photo: Jonathan Borg\nIn the worst case scenario, if a cow took a turn for the worse during the night in the weekend and it was not treated immediately because of a lack of medicine or a vet, a farmer could lose the animal overnight to an infection.\nLeafing through a file containing 15-years’ worth of prescriptions, he explained that every farmer was obliged to document the prescribed treatment and its administration in a herd book which was monitored by a vet.\nFor dairy farmers there is no way around compliance – the milk they produce is tested daily for quality and any residue, and a sample kept for some days to ensure traceability in case something happens.\nApart from random inspections by the veterinary authorities, the dairy cooperative and the local milk producer also carry out farm visits.\n“In order to qualify for EU funds, officials carry out cross-check compliance visits, and believe me, nowadays we cannot do without such funding.\n“At the same time, in Malta we are competing with EU products and the only way to survive is to keep our standards higher than everyone else’s.” Because of the island’s size, breeders could not run away from inspection, while products ended up on consumers’ table overnight, he said.\n“We are very careful because if one breeder commits one mistake, the whole sector will all come falling down,” Mr Fenech said, noting that the average herd size in Malta was larger than that of France and Germany.\nThe academic\nWarnings of antibiotic overuse might make headlines, but animal husbandry lecturer Paul Spiteri reckons the biggest problem is the exact opposite.\nMcast lecturer Paul Spiteri, who has also worked in poultry breeding, confirmed that the penalties were far too big for any farmer to abuse medicinal treatment.\nThe only way to survive is to keep our standards higher than everyone else’s\nApart from medicine being costly, its misuse could see a breeder lose the whole stock.\nHe insisted that the proper use of antibiotics was not wrong, but rather its misuse, and more specifically underuse was detrimental as it led to resistance.\nDangers of antibiotic underuse\n“Underuse is even more dangerous than overuse. If there are still people who do this to save money it is because they are unaware that resistance – and therefore disease – could spread across the whole farm.”\n“If this happens at least once on a poultry farm where chicken is grown for its meat, the breeder could lose a fifth of their annual income, as they usually have five crops a year.”\nMr Spiteri has witnessed a decrease in antibiotic use. While in the past poultry used to be administered treatment “just in case”, there has now been an increase in prevention methods.\nRead: Animal antibiotics being bought over the counter\nAnimal breeders were more focused on ensuring the right environment for the animals.\nWhen it comes to egg-laying poultry, antibiotics could not be administered because residues in eggs could lead to the destruction of a whole batch of thousands of eggs.\nBreeders have therefore resorted to vaccinating the chickens when they are still young, so that during their egg-laying period they do not need any antibiotics.\n“If breeders overuse antibiotics they will one way or another get caught, and if they underuse antibiotics, they would create resistance. Either way, it is very expensive for the farmer.”\nThe regulator\nNew legislation will give Maltese authorities stronger teeth when it comes to veterinary medicine compliance, but in the meantime Roberto Andrea Balbo has already noticed increased biosecurity compliance by farmers.\nCurrent legislation allows some control over medicinal use within the veterinary sector that acts as a deterrent for farmers, such as the destruction of carcasses containing antibiotic residue and the culling of whole flocks.\nVeterinary Regulation Director Roberto Andrea Balbo. Photo: Jonathan Borg\nHowever, the lack of a comprehensive law means that while the authorities could take someone to court, the case could fall because of legislative gaps, Dr Balbo, Veterinary Regulation Director, explained.\nTough new laws\nSo when the EU started drafting veterinary medicine legislation which has to be fully implemented by 2022, Malta started doing its own homework.\nThe new local legislation, which should be in place later on this year, has been tailor-made to not only reflect the EU regulations, but to also cover the existing gaps.\nFor Dr Balbo, the possible misuse of medicine without a prescription is a primary concern.\n “Keeping some medicine at hand just in case there are no vets available is not the ideal approach. While there are medicines that are considered relatively safe and can be bought over the counter, there are others that could create more problems if they are consumed than if they are not.”\nThe possible misuse of medicine without a prescription is a primary concern\nJust like an ill person, a sick animal – whether at home or on a farm – requires treatment, however prevention is always better than cure.\nThis included changing one’s footwear or clothing to avoid spreading germs when visiting a farm, ensuring optimal storage of feed, proper ventilation within animal holds, and preventing the disease getting out of the farm.\nVaccination is also imperative, as is proper hygiene at home around pets.\nTests reveal high compliance\nFarmers, he noted, had to ensure that they were compliant with biosecurity measures if they wanted to access EU and other grants.\n“We visit all the farms in Malta more than once a year, including small units with less than 10 sheep for example as they still need to be tested,” he said, adding that some inspections were unannounced.\nThere the officials test for residues of, among others, contaminants, undeclared additives, medicine, antibiotics and hormones – things that can end up in the animal and therefore in the final product. Some tests are carried out in Malta and other samples are sent abroad to accredited laboratories.\nAround 1,050 tests were carried out locally and abroad for antimicrobial residues in 2016, another 1,600 in 2017 and a further 1,600 in 2018.\nA total of five failed in 2016, another nine in 2017 and a further eight in 2018.\nThis, according to Dr Balbo, showed an extremely high degree of compliance. The authorities have meanwhile taken an active role in raising awareness about the risks involved in misuse of medicine, Dr Balbo said.\nApart from missing out on grants and compensation funds, farmers could also lose part or all of their animal stock. If a carcass tested positive for antibiotics at the slaughterhouse, the farmer would remain under continuous monitoring, while a dairy producer’s whole consignment of milk could be discarded or a poultry flock culled if there were any residues.\nThe doctor\nCan remnants in animals be passed on to people? Prof. Michael Borg, Head of the Department of Infection Control, answers the worrying questions.\nProf. Michael Borg. Photo: Matthew Mirabelli\nCan remnants of antibiotics in animals be passed on to people when they consume meat or products such as dairy?\nDefinitely. If you consume animal products that contain antibiotic residues, this is just as bad as taking a dose of an antibiotic. If this happens regularly due to poor practices in animal husbandry, then the impact on human health is very real.\nCan resistance to antibiotics be passed on to people in any way?\nAgain yes. The worry is that resistant bacteria from food directly contaminate humans. To give an example... if a chicken develops resistant bacteria in its intestine as a result of inappropriate antibiotic use by the farmer, when it is slaughtered the bacteria ends up contaminating the carcass.\nWhen the chicken is processed at home, those bacteria then end up contaminating the chopping board, work surfaces and hands of whoever is preparing it. These bacteria can easily be ingested by touching the mouth or face or by cross-contaminating ready-to-eat foods – especially if the basics of food hygiene are not rigidly applied. Therefore these resistant bacteria enter the human gut and there can proliferate and render the person a carrier of these resistant microbes.\nWhat precautions should people take when preparing meat/dairy products at home, so as to avoid the transmission of antibiotics, or resistance?\nProperly cooking meat items – especially poultry and particularly on BBQs. Reach at least 75˚C – few people use a probe thermometer to check cooking temperatures but this should be the rule. Above all, strict food hygiene. Using separate chopping boards for raw meats from those of ready-to-eat food such as salads and cheese. Washing chopping boards used for raw meat separately and then rinsing with piping hot water to kill any microbes. Ensuring work surfaces used for raw meats are disinfected with an appropriate sanitiser after preparing raw meats and most important of all, washing hands thoroughly every time after handling raw meats.\nEating local\nThis is the third in a series of articles in The Sunday Times of Malta looking at different aspects of the local food industry in a bid to raise more awareness of this crucial, yet often neglected, sector.\nOther articles in the series: \n1. Farmers are giving up because they feel cheated, not because it's hard work\n2. 'This generation think carrots grow in supermarkets': getting them young", "comment_count": 12, "id": 3617}, {"keywords": "", "author": "", "article_body": "A building used by Caritas for drug rehabilitation programmes is undergoing renovation works. \nFor over 30 years, the building in San Blas has been used to house people undergoing drug rehabilitation programmes.\nIt was also used as a telecommunications building during the Second World War.\nArchitects Karl Ebejer and Jessica Vella said a roof at the property was found to be dangerous and at risk of collapse.\nWorks are also under way to remove mould from walls and ceilings, and noted a lack of privacy in living quarters. \nRooms will be completely renovated to house more people, taking it from its current capacity of 18 to 24 once works are completed. \nCaritas director Anthony Gatt noted that the physical environment had significant impact on the therapy programme participants undertake. \nRenovations for the building will run up to the tens of thousands of euros, a spokeswoman for Caritas added.\n“I was shocked when I heard how much works would cost,” Bank Of Valletta chairman Deo Scerri said.\nA number of directors have renounced their directorship fees and will be donating it to the project.\nThe bank will also be giving a donation every time someone uses their Cashlink for payment.\nThe project is also aided by the Marigold Foundation.", "comment_count": 1, "id": 3618}]