[{"keywords": "", "author": "Ivan Camilleri", "article_body": "A new “state-of-the-art” shooting range in Ta’ Kandja has not been used for months amid operational problems and discord on how the facility is to be managed.\nDespite government promises and millions of euros paid for jobs allocated by direct order on the pretext that the facility had to be completed in time for the International Shooting Sport Federation World Cup event last June, the project was far from finished and further investment was required to cater for other international shooting disciplines such as rifle and dynamic ranges, sources close to the Education Ministry said.\n“So far, the facility has been used for a few days last year for just one event, the World Cup, and has been inoperative ever since,” the sources added.\nNotwithstanding the huge amount of money spent, the government had still not found a way to make good use of the ranges, they continued.\nShooters who spoke to this newspaper termed the prevailing situation as “pitiful”, describing it as a monument to the waste of taxpayer money.\nRange a monument to the waste of taxpayer money\n“Instead of making the best use of this new range, we have been told to use other facilities because Ta’ Kandja is closed,” one of them remarked.\nThe shooting range, which lies on the grounds of the Police Academy in the limits of Siġġiewi, was an electoral pledge made by Labour on the eve of the 2017 general election.\nShooters said that, according to the pledge made by then sports parliamentary secretary Chris Agius, once built, the management of the shooting range, equipped with all facilities, would be handed over to the Malta Shooting Sport Federation.\nThe shooting range was, however, partly completed – only catering for trap and skeet – and the Parliamentary Secretary for Sport, Clifton Grima, was insisting it should be managed by government agency Sport Malta, they noted.\nEducation Minister Evarist Bartolo told Nationalist MP Robert Cutajar in reply to a question in Parliament that, following discussions with the federation, the facility could again be used as from next month.\nFederation president Peter Montebello confirmed when contacted that a preliminary agreement had been reached with the government but “nothing has been signed yet”.\nThe Police Academy, this newspaper was told, was insisting on the correct health and safety measures, including insurance cover, being in place before shooting starts again.\nIn addition, complaints have been made about some of the facilities either having been badly installed or developing problems soon after they started being used.\nDuring last year’s international competition, the Police Academy had to be evacuated for some time as pellets fell on to its precincts.\nThe construction of the facility had been described by industry sources as a “record-breaker” in terms of direct orders, with some contractors being granted contracts worth millions of euros.\nAmong the largest recipients were road builders Bonnici Brothers, awarded over €5 million in direct works.\nOriginally estimated to cost €7 million, the government has already spent €14 million on the first phase of the facility.", "comment_count": 24, "id": 1119}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An appeals court has confirmed a decision ordering Transport Malta and a roadworks contractor to pay €1,800 to a driver whose car ended up in a field on account of poor road conditions.\nCarmelo Portelli had sued the transport watchdog and contractor Raymond Calleja after his car veered out of control after encountering dust and gravel left behind by the contractor's workers at Triq iz-Zejtun, Birzebbuga, in April 2015.\nThe driver had been awarded €1,800 in damages by the Small Claims Tribunal, a decision appealed by Transport Malta. It did not contest the dynamics of the accident  but argued that it could not be held responsible, highlighting a clause in the works agreement whereby the contractor was to “assume all risks of accident or damage.”\nA TM official testified that a traffic management scheme had been put into effect, attributing the mishap to waste material left behind on the road surface merely a “few hours” before the accident.\nHowever, a policeman testified that there had been no adequate signage and lighting, corroborating the version by the driver and his sister who had said that while on site, they had witnessed another accident at the same spot.\nThe court of appeal, presided over by Mr Justice Anthony Ellul, observed that the contractor had been lacking, to the extent that the police had to bring in the Civil Protection Department to clear away the rubble left behind.\nThis was yet “another contractor who paid no heed to the health and safety of road users, leaving the road in a state of serious danger,” the court declared, pointing out that there had simply been a few, spaced out plastic barriers along the stretch of road that was poorly lit.\nIt added that Transport Malta was the competent authority to ensure that the road was “safe to use”, and could not shrug off responsibility upon the contractor, irrespective of the clause in the contract which, moreover, was extraneous and hence irrelevant to the driver concerned.", "comment_count": 0, "id": 1120}, {"keywords": "", "author": "Keith Micallef", "article_body": "As the UK’s departure from the EU edges closer, the government has taken steps to stop British citizens residing in Malta from voting in the forthcoming European Parliament elections.\nThe move was made through an amendment to the European Parliament Elections Act, which was recently published in the form of a legal notice.\nWhile the law makes no specific mention of British citizens and the UK’s imminent exit from the EU, which will be triggered on March 29 unless the date is extended, it leaves little doubt about its scope.\nThe law lays down that “in the event that a state ceases to be a member state of the European Union, the Electoral Commission shall proceed to cancel from the European Union electoral register any such persons who are solely registered in that register by virtue of their being citizens of that state which has ceased to be a member of the European Union and this without any further notice or proceedings”.\nAll other foreign EU citizens will be unaffected by these changes.\nScheduled for May 25, the European Parliament elections will, for the first time, be held concurrently with council elections across all 68 localities in Malta and Gozo. In the 2014 European elections, 344,356 voters were registered, of whom 74.8 per cent had exercised their ballot right.", "comment_count": 44, "id": 1121}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A Czech man facing a second round of extradition proceedings has been granted bail after being arrested last week.\nMarek Drga, 40, residing in Gozo, was arraigned on Friday after Czech authorities issued a European Arrest Warrant for him to be returned to his homeland, where he is wanted for alleged tax evasion, tax fraud and complicity in crime.\nMr Drga had already undergone extradition proceedings last year and faced sentencing abroad. He returned to Malta pending an appeal, before being targeted by a fresh European Arrest Warrant.\nA request for bail was made by defence lawyer Roberto Montalto, who claimed that the Czech authorities were “abusing the system.”\nAs committal proceedings continued on Wednesday, that request was upheld by the court , presided over by magistrate Donatella Frendo Dimech, against a deposit of €3000 and a personal guarantee of €17,000.\nExtradition proceedings continue later this month.\nLawyer George Camilleri from the Office of the Attorney General is prosecuting.Lawyer Roberto Montalto is defence counsel.", "comment_count": 0, "id": 1122}, {"keywords": "", "author": "", "article_body": "Justice Minister Owen Bonnici has hit back at suggestions that he misled MEPs during a tax committee hearing held earlier this week.\nDr Bonnici met with the EP’s TAX 3 committee on Monday, hitting back at critics of Malta’s rule of law and insisting that the government was committed to reforming systems where needed.\nThe Times of Malta subsequently published an article in which it fact-checked a number of Dr Bonnici’s claims to MEPs.\nDr Bonnici took umbrage to that assessment, saying it missed the point “on every matter raised”.\n“I gave no wrong information to the TAX 3 committee,” the minister said.\nHe argued that it made no difference that the names of Maltese passport buyers  were not published in isolation, saying “the fact remains that Malta publishes the names as distinct from what goes on in other countries”. \nDr Bonnici said some politicians had obviously not liked the fact that local courts had thrown out their claims to have Panama Papers revelations investigated.\nThis, he said, was something which MEPs on the TAX 3 committee would have known.\n“Are you suggesting that the MEPs do not follow the local scene and are gullible?” he asked rhetorically. “The Egrant Inquiry was initiated following a request by the Prime Minister himself. Again, MEPs are not gullible.”\nDr Bonnici said he had been given access to the full Egrant inquiry in order to advise the Prime Minister as Justice Minister.\n“That fact has nothing to do with any access by the Minister of Justice to ongoing investigations,” he said. “There is no such right of access as I correctly informed the TAX 3 Committee accordingly.”He also took exception to the suggestion that the government had only solicited a Venice Commission opinion on Malta’s rule of law after the Council of Europe had.\n“Irrespective of the three-day gap between the request of a Committee of the Parliamentary Assembly of the Council of Europe to the Venice Commission and that of the Government of Malta, the fact remains that the Government itself invited the Venice Commission to express its opinion on Malta,” he said.\n‹›-+Page:  /", "comment_count": 24, "id": 1123}, {"keywords": "", "author": "", "article_body": "A hooded man armed with a knife made off with cash during a hold-up in a Zabbar shop on Wednesday afternoon.\nThe police said the hold-up took place at 3pm in St Dominic Street.\nThe robber demanded the cash from a 19-year-old shop assistant, who was not harmed. \nA magisterial inquiry is under way. ", "comment_count": 0, "id": 1124}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A controversial call for tenders issued in December for a multimillion-euro cleaning contract at St Vincent De Paul Complex has been suspended amid objections to the conditions imposed.\nIt took the government three years to issue the call for tenders, which the Director of Contracts described as “complicated”, yet, a number of potential bidders are complaining that some of the conditions included are illegal.\nIn an ironic twist, one of the complaints was made to the Public Contracts Review Board by X-Clean Ltd, of Naxxar, which had been given the cleaning contract through repeated direct orders since April 2015.\nAccording to the complaint, filed on the company’s behalf by former police commissioner Peter Paul Zammit, a legal procurator, X-Clean is arguing that the requirement for bidders to have won cleaning services contracts amounting to a minimum value of €12 million should be removed as it is “limiting the tender market” and is against EU public procurement rules.\nX-Clean, owned by Denis Xuereb, wants the Contracts Department to revise this such condition, insisting it was “excessive”. Another potential bidder, Servizi Malta Ltd, also filed objections and is demanding a revision.\nGanado Advocates, on behalf of the cleaning firm, accused the Department of Contracts of making an illegal intervention through a clarification it issued after the offer’s request had been published.\nWhile, originally, the call underlined the need that bidders must present certificates of proof that all company VAT, income tax and social security payments were up to date, the Contracts Department later issued a clarification stating these were not necessary upon the submission of offers but only in the case of being successful.\nServizi Malta contested this and is asking that all contenders are required to submit such certificates of clearance at the submission stage.\nThe St Vincent De Paul cleaning contract has been hitting the headlines for the past months. The Times of Malta has reported that, instead of issuing a new call for tenders when the previous one expired, the government had, since 2015, selected X-Clean giving it direct orders every six months.\nThe company received about €9 million along the years. This newspaper had also reported that the bill for cleaning services at the government facility tripled over the past years with payments also made for unrelated services such as hairdressing, gardening, the provision of employees and technical jobs.\nContracts director Anthony Cachia had insisted he had only given approval for the payment of cleaning services.\nOpposition leader Adrian Delia last week asked the National Audit Office to look into the manner in which the government handled this contract.\nPending a decision on the legal challenges filed, the government is expected to keep renewing direct orders to X-Clean. This could take months.", "comment_count": 10, "id": 1125}, {"keywords": "", "author": "", "article_body": "A cyber attack on Bank of Valletta on Wednesday involved the creation of false international payments that saw €13 million transferred to banks in four countries, Prime Minister Joseph Muscat told parliament.\n“That money did not come from the people’s money and the amounts have been traced and are being reversed,” Dr Muscat said in a statement.\nHe said that at a meeting with the bank’s management he had been given an account of developments through the day and assured that depositors’ accounts were safe.\nThe attack was detected soon after the start of business on Wednesday during reconciliation of international transactions when discrepancies in eleven payments were noticed.\nShortly after, the bank was informed by the Security Service that it had received information that the bank had been the target of a cyber attack originating abroad.\nWithin half an hour the bank stopped international payments made to four countries - the UK, the US, the Czech Republic and Hong Kong.\nThe bank asked its correspondent banks to stop payments and reverse payments which may have already been made.\nIn order to minimise risk and review its systems, the bank then suspended operations.\nThe National Cyber Security Committee was informed and its experts were called to assist in investigations.\nBank's systems robust\nReplying to various questions by Opposition leader Adrian Delia, Dr Muscat said he had made his statement as prime minister and in view of the bank’s importance to the economy and not because the government was a shareholder.\nDr Muscat said that the fact that the bank had detected the attack even before it was informed internationally, and it shut down within 30 minutes, showed the robustness of its systems. This had been a major and complex operation which was executed quickly once the bank noticed the discrepancies in international payments.\nRead: Six times cyber crime targeted banks in 2018\nThe bank, he said, accounted half of Malta’s bank transactions. The fact that it had been closed for a day had an impact on the economy. It also caused problems not just locally but also abroad for credit card holders who needed to make payments, such as to hotels.\nAlternative arrangements are being made with card companies to help such people, the Prime Minister said. \nAlternative arrangements for cardholders abroad and social security payments\nFurthermore, he said, 12,000 people also needed to receive social security payments through direct credit to Bank of Valletta accounts on Thursday. Contingency planning was being made by the Central Bank, which would issue its own cheques if necessary.\nDr Muscat said Bank of Valletta was also considering ways how it could resume operations gradually.\nThe starting point, was that people’s money was safe. No one had lost anything.\nWhat needed to be ensured was that when the system was turned back on, it was ‘clean’ and this problem did not re-appear. Experts needed to be sure that the attack was not dormant and may reappear.\nA balance therefore had to be struck between haste to resume business and making sure all was well.\nThe bank was carrying out an internal review to establish where the attack originated from. Had protocols been broken? Was this a phishing attack? Had all procedures been followed? Was the attack so sophisticated it could overcome procedures?\nDr Muscat said the false transactions had been traced to the countries and banks to which the funds had been sent, some in sterling and some in dollars and the funds were being recovered.\nPolice investigations are under way and a Magisterial inquiry has been launched.", "comment_count": 36, "id": 1126}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "Bank of Valletta was forced to shut down all its operations on Wednesday after detecting a cyber attack on its systems. \nIt is the first time hackers' attempts to infiltrate a Maltese bank has been made public, and arguably the highest-profile cyber attack in local history.\nBOV, however, is far from the first bank to face digital aggression.\nArguably the largest digital heist in history took place in February 2016, when Bangladesh’s central bank fell victim to hackers who exploited a loophole in the SWIFT transfer system to successfully request multiple cash transfers before a rudimentary spelling mistake – they spelt ‘foundation’, ‘fandation’ – prompted a correspondent bank to query one of the transactions.\nAuthorities quickly shut down the system, but hackers had already stolen $81 million.\nCyber attacks on banks have continued unabated in subsequent years, with countless examples just last year.\nSome were based on social engineering methods, through which conmen (or women) tricked employees into giving them access to systems or divulging information. Others were malware attacks, in which malicious programming code was infiltrated onto computer systems.\nAs banks introduce new products and web portals, the opportunities for hackers are destined to grow. A 2018 Accenture report which assessed 15 apps created by US banks, for instance, found security flaws in every single one. \nHere are six cyber security incidents related to banks which took place in 2018.\nMarch 2018Europol announces that it has arrested the suspected ringleader of a criminal hacking ring which had managed to steal over €1 billion from a variety of banks.\nThe group used malware – malicious computer code – to infiltrate systems of banks in over 40 countries, stealing an estimated €10 million each time. The hackers could then deploy the code to set ATMs to spit out money at predetermined times.\nThe ringleader’s arrest did not stop the group’s activities. Just a few months later, Europol acknowledged that at least two other banks had been targeted by the group.\nRead: BOV goes dark after detecting a cyber attack on its systems\nApril 2018The UK’s National Crime Agency confirms that seven of the country’s largest banks had been crippled by hackers using relatively primitive software.\nThe attack affected Santander, Bank of Scotland, HSBC and Tesco Bank, among others, and in some cases left customers unable to access their funds for days.\nBank of Valletta is the first local victim that we know of. Photo: Jonathan Borg\nMay 2018Two of Canada’s largest banks say “fraudsters” managed to steal personal and financial information of around 90,000 customers in total.\nThat same month, hackers break into the computer systems of Chile’s largest ban, Banco de Chile, and steal $10 million.\nAugust 2018HSBC says hackers breached some customers’ accounts in the US and accessed their information. The bank does not say how many customers were affected.\nOctober 2018The UK’s Tesco Bank agrees to a £16.4m payment to settle claims related to a 2016 cyber attack in which hackers stole more than £2 million. UK regulators say the bank had “deficiencies” in its systems but acted quickly to address them.\nNovember 201810 Pakistani banks suddenly block all international transactions. A Pakistani cyber security official subsequently says almost all the banks operating in the country have been hacked, in what is the largest cyber attack in the country’s history.", "comment_count": 5, "id": 1127}, {"keywords": "", "author": "", "article_body": "The European Court of Human Rights has ordered the government to pay compensation of €6,000 to the father of Maximilian Ciantar over the confiscation/seizure of two vehicles including one used by Maximilian when he ran over two twin sisters in 2010.\nThe Constitutional Court had found in 2014 that Emanuel Ciantar’s right to peaceful enjoyment of his possession had been violated when two vehicles had been confiscated/seized.\nThis, the court ruled, amounted to lack of balance between the interests of the general community and his own rights as well as that of the company he owned.\nIt ordered the release of both vehicles and the payment of €300 in moral damages. Mr Ciantar’s share of court expenses amounted to €1,129.46.\nThe two vehicles in question were a Peugeot van and a Toyota Vitz.\nThe Peugeot was being driven by his son, who did not have a licence, in the hit-and-run accident in Attard on the evening of April 28, 2010, in which Sarah Marie and Rebecca Marie Falzon, 11, sustained serious injuries, the latter spending two weeks in intensive care.\nMr Ciantar Jr had been jailed for two years but a 10-year driving ban was reduced to six months on appeal. Less than three months after the Court of Appeal judgment, Mr Ciantar Jr was found guilty of making use of the Toyota, which belonged to his father. Though the court had not ordered the confiscation of the car, arguing it had been used without the owner’s consent, the police seized it and was not released by the authorities.\nHis father subsequently appealed to the Constitutional Court demanding the release of the vehicles and insisting both he and his company had been deprived of their property. The court decided that the cars should be returned.\nIn early 2015, Mr Ciantar sought redress before the Strasbourg-based court insisting he had been deprived of his property and also that he was not given adequate compensation.\nThe seven judges hearing the case, including Chief Justice Emeritus Vincent De Gaetano, noted that to be compatible with the European Human Rights Convention, an interference with the right of property must be effected “in the public interest” and “subject to the conditions provided for by law and by the general principles of international law”.\nIn addition, the interference had to strike a “fair balance” between the demands of the general interest of the community and the requirements of the protection of the individual’s fundamental rights.\nIn view of the findings of the Constitutional Court, the European judges felt it was not necessary to examine again in detail the merits of the complaint.\nIt was enough to find that, as established by the Maltese courts, the authorities had failed to strike a fair balance, though the Strasbourg Court restricted this only in relation to the seizure of the Toyota.\nIt ordered the government to pay Mr Ciantar Sr €3,000 in moral and pecuniary damages and another €3,000 to cover court expenses.", "comment_count": 6, "id": 1128}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The Finance Ministry is not in favour of phasing out 1c and 2c coins in the foreseeable future and will not be rushing, according to a spokesman.\nThe Times of Malta reported earlier this month retailers were in favour of phasing out the cumbersome 1c and 2c coins, arguing the move should have a “negligible” impact on inflation.\nAround 70 per cent of the 8,500 readers who responded to a Times of Malta poll run online and on Facebook were in favour of phasing out the coins, a measure that has already been taken by five eurozone countries: Finland (2002), the Netherlands (2004), Belgium (2014), Ireland (2015) and Italy (2018).\nThe ministry was not moved by the figures, however, and the spokesman said: “If 30 per cent do not want such a move – because it will raise their prices or purchasing cost – the government should not rush on such issues.”\nGovernment should not rush on such issues\nThe idea had met the approval of the Chamber of Small Enterprises ‒ GRTU and the Malta Bankers’ Association.\n“Many customers do not even want to receive the small coins as change,” the GRTU’s chief executive, Abigail Mamo, said.\nThe Malta Bankers’ Association noted that handling coins was a costly process, involving carriage, counting, packing, security and insurance, noting that phasing them out would benefit members, although it expressed doubts on whether the long-term savings would be significant.\nPhasing out the coins could be done in various ways. A spokesman for the European Central Bank said it would not have a noticeable impact on inflation, provided that the rounding was done to the final bill at the till for payments in cash and to the nearest 5c.\nCard transactions would still be made according to the actual bill.\n ", "comment_count": 9, "id": 1129}, {"keywords": "", "author": "", "article_body": "Works are underway at the Mediterranean Conference Centre which will enable it to host open-air events on the roof, commanding views of Grand Harbour.\nTourism Minister Konrad Mizzi visited the complex on Wednesday to mark the 40th anniversary since its conversion to a conference centre.\nHe said €10 million were being invested in works which include new air conditioning, new dressing rooms and the transformation of the former 'tank room' into another conference hall.\nHe said the conference centre is also preparing to host a major international annual event which would be a tourist attraction.\nThe conference centre was originally an infirmary built by the Hospitaller Knights of Malta. Along the years it also served as a police headquarters and examination centre. It suffered war damage and was largely disused before its conversion to current use. \n ", "comment_count": 2, "id": 1130}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young lady with an apparent penchant for stealing petty cash was granted bail pending a pre-sentencing report after admitting to a series of thefts.\nAmber-Ann Zammit, a 23-year old from Ħamrun, currently unemployed, was arrested and taken to court on Wednesday after incriminating CCTV footage placed investigators on her heels as the suspect behind a series of thefts from the University library compartments over the past months.\nOn six separate occasions, five in November and another just last week, the young lady, who is not a student, visited the University library and made off with small amounts of cash from personal belongings placed inside the compartments.\nShe then reportedly used the money to acquire designer products.\nThe young lady was accused of three charges of theft aggravated by time, three other charges of simple theft as well as with breaching the terms of a three-year conditional discharge handed down in 2016.\nAfter a brief consultation with her lawyer, Franco Debono, the woman registered an admission while Dr Debono suggested a pre-sentencing report which could possibly shed light upon any problems which lay at the root of her problem.\nThe court, presided over by magistrate Charmaine Galea, upheld this request, as well as another for bail which was not objected to by the prosecution.\n“I’d rather she learnt a lesson, than insist on her going to jail,” said prosecuting Inspector Colin Sheldon, whilst insisting that the accused was not to approach University.\nAnother request for a ban on the woman’s name was rejected by the court, with the magistrate declaring that there were no valid reasons at law for the ban.\nBail was granted against a deposit of €200, a personal guarantee of €1,000 and an order to sign the bail book three times a week.\nLawyer Marion Camilleri was also defence counsel.", "comment_count": 1, "id": 1131}, {"keywords": "", "author": "", "article_body": "Nationalist MEP David Casa said on Wednesday that he was 'ready to push' for EU funding for a fourth ferry for Gozo Channel.\n\"The cohesion fund, for instance, was successfully used in the construction of the Cirkewwa terminal. A fourth ferry for the Gozo Channel would be of benefit of all Gozitan families, workers and service providers,\" the MEP said. \nGozo Minister Justyne Caruana has spoken of plans to acquire a fourth ferry but has given no timetable. \nMr Casa said that while plans for a tunnel or bridge were welcome, they would take years to complete.\n\"The short term problem which is a daily concern for all Gozitans needs to be addressed, and can be alleviated by obtaining a fourth ferry for the Gozo Channel service. This is the crucial first step to help clear the hours-long queues that are a harsh reality every single day of the week, and especially on weekends,\" he said. ", "comment_count": 13, "id": 1132}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman who admitted to stealing some €1,500 from her former employer was handed a suspended sentence by a magistrate on Wednesday.\nProsecuting Inspector Joseph Xerri said the 28-year old Zurrieq resident had fully cooperated with police, had no prior convictions and had returned the sum stolen.\nDefence lawyer Graziella Tanti said her client was very sorry for what she had done adding that this was a “classic case” for a suspended sentence.\nMagistrate Charmaine Galea, declared the woman guilty and handed her a 30-month jail term, suspended for four years.\n“The court is giving you an opportunity not to go to prison. Don’t waste it,” the magistrate said. \nThe court banned publication of details about the case. ", "comment_count": 0, "id": 1133}, {"keywords": "", "author": "Bertrand Borg, Vanessa MacDonald, Claire Caruana ", "article_body": "Last updated Thursday 7.30am as bank's mobile app went back online\nBank of Valletta shut down all its operations on Wednesday morning after hackers broke into its systems and moved €13 million into foreign accounts.Mobile banking services are down.\nAll of the bank’s functions - branches, ATMs, mobile banking and even email services - were suspended and its website taken offline. \nThe bank's mobile app was back online on Thursday morning.\nThe fraudulent transactions had been traced and were \"being reversed\", Prime Minister Joseph Muscat told parliament later on Wednesday. \nThe attack is believed to have originated overseas. \n'Funds not compromised'\nIn a statement, the bank reassured customers that their accounts and funds “are in no way impacted or compromised” and that it was working to resume normal services in a phased manner as soon as possible. “The Bank is working closely with local and international police authorities in this regard,” it said.\n\"Bank of Valletta apologises to its clients for any inconvenience caused and will be keeping its customers and the general public informed of developments.\" Customs may phone on 21312020.\nHSBC Malta issued a one-line statement saying its services were operating normally. \n\nPayments to four countries blocked\nThe attack was detected shortly after the start of business on Wednesday morning, Prime Minister Joseph Muscat told parliament, when it noted reconciliation problems regarding international transfers. Hackers sought to make international transfers to banks in the UK, US, Czech Republic and Hong Kong. The transfers were blocked within 30 minutes and the banks  alerted, the Prime Minister said.\nWatch: Prime Minister Muscat speaks to parliament about BOV hackInitial indications are that the hack originated overseas, Dr Muscat added. \nBank of Valletta \nMFSA keeping tabs\nMalta's financial regulator, the MFSA, is closely monitoring the situation.\n\"The MFSA follows ECB guidelines with respect to cyber-security threats and attendant risk mitigating factors which need to be followed by licenced institutions,\" MFSA CEO Joseph Cuschieri told Times of Malta. \nIt was banks' responsibility to safeguard their cyber security, he added. \n\"We strongly encourage banks and other other licenced financial institutions continuously invest in their IT systems to prevent such occurrences,\" he said. \nShop owners in the dark\nThe shutdown has affected several local businesses which rely on BOV-operated point-of-sale equipment to process card payments. It also means POS systems run on rival banking networks cannot process payments on BOV-issued cards. \nAs of 3pm, shop owners remained in the dark.\nSpeaking to the Times of Malta on Wednesday afternoon, Chamber for Small and Medium Enterprises (GRTU) head Abigail Mamo said that shop owners had no option but to decline card payments as the point-of-sale devices used to charge credit cards were not working.\nShop owners initially thought something was wrong with their own systems, she said. \n\"Since the bank could not get in touch, they were not aware that something was wrong,\" she explained. \n\"They tried calling BOV, but didn't manage because their communication systems were down. It was a while before the bank got in touch and told them that they were offline,\" Ms Mamo explained.\nNo additional information was supplied to them, she said.She explained that many customers were being turned away, resulting in some chaos in certain bigger shops, such as supermarkets, where they relied on the electronic devices for the majority of their payments. “It’s obviously not the customers’ fault but they are, unfortunately, being turned away because the systems just aren’t working at the moment,” Ms Mamo said. The GRTU head said that while some shop owners did have other POS machines installed, it was not always viable to use these as charges were higher.\nA main clothing retailer confirmed that the problems started at around 1.15pm, noting that there had not been any issues earlier in the day. While the retailer was making an effort to serve all customers, including those with a BOV card, by using the POS devices from other banks, some sales were still being lost.\nAPS Bank suspends some services\nAPS Bank said it had decided, as a precautionary measure, to suspend some of its services, including ATMs, cards-related transactions and payments from and to Bank of Valletta).\nIt stressed, however, that the integrity of its customers' accounts was protected and that deposits were safe.\nVery rare occurrence\nEuropean Banking Authority guidelines introduced in 2018 lay out the steps EU-based banks and banking regulators ought to take when assessing and minimising their risk to IT-based threats.\nAlthough banks in Malta have been attacked in the past, a source familiar with the regulatory sector said that something on this scale was very rare - which showed the levels of protection that banks had built up.BOV ATMs have also been switched off.\nBanks in Malta are regulated by the Malta Financial Services Authority, which would - along with the European Central Bank - have been advised about this attack by BOV, he said.\nThe sources said that the authority would, in an ideal world, itself carry out checks on banks' IT systems, and not just on their capital ratios and governance.\n\"The reality is that to do this you need to have very qualified technical resources who would understand the systems and be able to check them and challenge their protection systems,\" he told the Times of Malta.\n\"Having said that, the banks do not rely on the regulator but have their own internal audit teams, and most also get external consultants to monitor them.\"\nOPINION: Malta's cyber defence - Martin Scicluna\nBanks and other large enterprises often employ so-called white-hat hackers - ethical hackers - to probe its systems and find bugs and shortcomings in their systems, a digital security expert told Times of Malta.\n'Malta a honey pot'  \nThe bank’s decision to completely shut down its operations was either taken in haste or else because it was a severe attack, a separate digital forensics expert told Times of Malta. “Banks usually try to mitigate these attacks behind closed doors,” he explained, while making it clear that he had no knowledge of this specific attack.\nMalta’s rapid economic growth meant more malicious players would be interested in hacking local companies, he added. In such cases, companies’ focus in such cases was on getting their businesses up and running again, rather than preserving evidence. “Most of the time the private sector rarely cases about the second,” he noted.\nHave you been affected by the bank shutdown? Get in touch on mynews@timesofmalta.com", "comment_count": 199, "id": 1134}, {"keywords": "", "author": "Claire Caruana", "article_body": "The southern harbour region has the highest number of patients receiving assistance because of mental health problems, fresh data shows.\nWhen it comes to localities, Birkirkara, which has the second highest population, tops the list, with 30 patients receiving assistance. Twelve of them were aged between four and 16, another 16 were in the 17-62 age bracket and two were older than 62.\nThe numbers emerged from a profiling exercise carried out across the island by the LEAP centres with the aim of identifying the number of residents with mental health problems who are eligible for food provided by the European Union.\nRead: Question time: Mental illness\nThe data was tabled in Parliament this week by Family and Social Solidarity Minister Michael Falzon in reply to a question by Nationalist MP Ivan Bartolo.\nAlthough the numbers for Birkirkara were the highest, overall, the majority of cases came from localities in the southern harbour region, which is made up of 14 localities – Valletta, Vittoriosa, Senglea, Cospicua, Żabbar, Fgura, Floriana, Kalkara, Luqa, Marsa, Paola, Santa Luċija, Tarxien and Xgħajra.\nBirkirkara tops list with 30 patients receiving assistance\nIn Cospicua, there were 15 minors and 12 adults registered as having mental health problems. Similarly, in Żabbar there were 26 patients – six minors, 17 adults and three over the age of 62.\nOut of 186 people offered mental support, the data showed that 75 hailed from this region.\nAnother 47 resided in the northern harbour region, made up of Qormi, Birkirkara, Gżira, Ħamrun, Msida, Pembroke, Pietà, St Julian’s, San Ġwann, Santa Venera, Sliema, Swieqi and Ta’ Xbiex.\nThere were seven minors and two adults who were identified as having mental health problems in St Paul’s Bay, which forms part of the northern region. According to an exercise carried out last year by the Times of Malta, the locality registered a 26 per cent increase in residents over three years.\nMental Health Commissioner John Cachia said the numbers mirrored points he had made last year in his annual report for 2017.\nRead: Twenty per cent of working population have mental health conditions\nIn it, he had also noted that the relative risk of acute involuntary admission as a result of mental health problems was much higher for residents of the southern harbour and northern regions compared to the rest of the country.\nDr Cachia pointed out, however, that more awareness about mental health was resulting in more people from different localities seeking help, which he said could result in a shift in trends in the coming years.\nA spokeswoman for the Richmond Foundation echoed Dr Cachia’s comments, saying that while a decade ago the majority of those asking for help from the non-governmental organisation came from certain specific areas, today more people from all localities were coming forward with their problems and seeking assistance.\n ", "comment_count": 9, "id": 1135}, {"keywords": "", "author": "", "article_body": "A free service offering transport within Cospicua was used by elderly residents and the vulnerable 2,800 times last year, the Cospicua council said.\nThe last quarter of 2018 was the most busy, with 400 people booking to use the service. The rise in clients prompted the council to extend the service to run daily instead of three times a week, mayor Alison Zerafa Civelli said.\nThe idea of purchasing two vans for transport within the city came after a \"substantial amount\" of complaints from residents, Ms Zerafa Civelli said.\nElderly people and those with vulnerabilities often found it difficult to run errands, go to the health centre or the post office, the mayor added.\nThe service also helped decrease traffic and lower sound pollution levels, the council said.\nSome could not rely on family members to drive them around, Transport Minister Ian Borg added, noting Cospicua also had a lot of steps that meant arriving to the city centre could be an added challenge for residents.\nIt cost €72,000 to purchase the two electric vans for the service, €60,000 of which were subsidised using the Transport Ministry's Sustainable Urban Mobility Plan.\nThe council launched the inter-city transport programme as a pilot project in 2017. During the first three months, the service was used by 258 individuals. \nThe service, which used to be offered three times a week, will now run daily between 7.45am and 1pm. ", "comment_count": 6, "id": 1136}, {"keywords": "", "author": "", "article_body": "Media.Link Communications political editor John Zammit has resigned but remains committed to the Nationalist Party, the PN said.\nIn a statement signed by Mr Zammit and secretary general Clyde Puli, the party said Mr Zammit had given notice two days ago \"to seek pastures new\".\nHowever, he remained totally committed to the party which was the only alternative to a corrupt government which lacked any kind of plan, the statement said.", "comment_count": 26, "id": 1137}, {"keywords": "", "author": "", "article_body": "Alternattiva Demokratika and Partit Demokratiku have been exploring avenues of cooperation for the past weeks.\nIn separate statements, both parties said that, at the request of AD, various meetings were held in the past weeks.\nThe meetings concluded that although formalising the relationship between the two parties was not opportune at present, they both needed to coordinate their efforts to \"serve the country in the best way possible.\"\nIn another statement, PD deputy leader Timothy Alden encouraged people voting for candidates on the PD list to continue onto the AD list.\n\"They can then consider the larger party candidates they prefer. This will maximise use of our voting system in support of the third party.\"", "comment_count": 9, "id": 1138}, {"keywords": "", "author": "", "article_body": "Updated at 12.10am\nPassengers on an Air Malta flight to London Heathrow, which had been scheduled to leave Malta at 7.55am, had been taken off the aircraft, which did not leave due to a malfunction.\nA passenger on board told Times of Malta the aircraft had refueled but that there was no indication when it would be leaving.\nMalta International Airport’s departure site initialy showed the flight’s estimated time of departure as 10am but this was later removed with the flight showing just a 'delayed' status.\nAt 10.05am, the crew served passengers drinks but they were not given any information.\nThe aircraft started taxying at around 10.15am with passengers being told that they should depart in about 10 minutes. But the engines were soon switched off again and an engineering team was back on the aircraft. By 10.45am, the passengers were finally taken off the aircraft.\nAt around noon, Air Malta decided to send the passengers to their destination using a replacement aircraft. The new flight is set to leave Malta at 1.45pm.\nEarlier, a spokesman for Air Malta had said there was a minor technical issue which the airline's engineers were currently working upon.\nThe airline, he said, apologised for the delay but its primary concern was the safety of its crew and passengers.", "comment_count": 23, "id": 1139}, {"keywords": "", "author": "Ivan Martin and Bertrand Borg ", "article_body": "Updated 1pm with EU Commission statement\nThe disgraced director of fisheries had a very cosy relationship with a Spanish tuna kingpin accused of running a massive illegal fishing racket, phone intercepts indicate.\nTranscripts of intercepted phone calls between the now-suspended fisheries head Andreina Fenech Farrugia and tuna tycoon Jose Fuentes Garcia, seen by Times of Malta, show how the two were in close contact using “secure” mobile phone numbers, and discussed meeting up in Malta hotels. \nInvestigators noted how their Spanish suspects referred to an \"Andreina\" as \"the boss\". \nRead: Illegally caught tuna flooding the tapas bars of Spain\nA Spanish telecoms provider confirmed to the investigation that the mobile phone numbers were registered to the Spanish fishing giant’s company Ricardo Fuentes and Sons.\nAndreina Fenech Farrugia with EU Commissioner Karmenu Vella.\nSpanish investigators only discovered the existence of this communication by chance, stumbling across another company mobile phone other than Mr Fuentes’ which appeared to belong to a certain “Andreina”.\nMaltese magistrates investigating tuna industry\nThey believe that the nature of the conversations suggested the two had a relationship of “absolute trust”, discussing meetings involving “senior government officials” that investigators believe were intended to facilitate a tuna laundering racket.\n\nDr Fenech Farrugia was on Tuesday suspended on full pay in the wake of allegations that she had demanded money off Mr Fuentes, saying in the transcripts: “I am in Bulgaria just for you. You have to pay me because I have a meeting with the [director] general of Brussels.”\nThe transcripts, which form part of a Spanish court case due to begin in the coming days, date that particular conversation as having taken place last June 20 (see timeline below), when EU fisheries heads were meeting under the auspices of Bulgaria’s EU Council presidency.\nDr Fenech Farrugia on Tuesday denied any wrongdoing.\nIn a statement, EU Environment Commissioner Karmenu Vella said he \"strongly condemned\" the malpractices reported in Spanish media and that the EU Commission was in contact with Europol to follow up on them. \nThe Commission also noted that an audit of Maltese fish farms last October had highlighted \"a number of shortcomings\" which it was now discussing with Maltese authorities. \nIt insisted that fishing for bluefin tuna in the Atlantic and Mediterranean \"is often considered as the most controlled fishery in the world\". \nSources close to the case say they suspect this development is \"just the tip of the iceberg\". \nMap: How Malta's fishy business played out\nTimeline:\nMay 4, 2013Times of Malta reports that Andreina Fenech Farrugia will return to the fisheries department as director general, just a few years after she was moved on from the department.Dr Fenech Farrugia.\n June 13, 2018. 3.03pm.Fuentes speaks to “Ramon”\n“Ramon” tells him that he has met with “Andreina” about their 3,000 tonne quota. She said “no problem.”\nBut they overran that quota by 1,500 [kg or tonnes - the transcript is unclear] in the last slaughter, and they now need to destroy that excess if they’re to pass EU quota tests.\n“Ramon” says that there is a total 9,000 limit between three operators, themselves included. If they want their share to rise to 4,000, they need to get the other operators to give up part of their quota.\n“Ramon” says that \"Andreina\" explained all this to her people, and she is “the boss”.\n“We told her we don’t agree,” says Ramon, “Andreina said she will speak to the fishing people.\nJune 15, 2018. 6.58pm.\"Andreina\" calls FuentesFuentes greets \"Andreina\" with “gorgeous”, which prompts her to reply that “the minister and everyone else wants me”.\nShe tells Fuentes he “has to pay” and that (rival tuna firm) Fish & Fish must know of nothing. Fuentes asks \"Andreina\" what she’s doing. \"Andreina\" says she has back pain. Fuentes suggests she gets “a good massage”.\nThe two discuss tuna catches. Fuentes tells \"Andreina\" that he’s told “Ramon” that he would like to start laying out cages next week. \"Andreina\" warns him to keep quiet. She will get “Giovanni” to pressure the politician, she says, so that nobody suspects her. \"Andreina\" says she doesn’t trust Giovanni much.\n“Do you think things will work out?” asks Fuentes. “Yes, because you have me, ok?” \"Andreina\" replies.\nJune 18, 2018Spanish mobile phone operator Telefonica confirms that the phone number being used by “Andreina” belongs to Ricardo Fuentes & Sons. The SIM card was registered on May 23, 2013.\nJune 18, 2018The EU’s Agriculture and Fisheries Council meets in Luxembourg. The meeting brings together ministers and politicians responsible for the fishing sector - Malta is represented by parliamentary secretary Clint Camilleri – as well as EU Environment Commissioner Karmenu Vella.\nTop officials from member states' fishing sectors meet in Bulgaria for an informal meeting three days later.  \nThe Director General of the EU Commission's Maritime Affairs division was also present, but had \"no bilateral meeting with Ms Farrugia\", the Commission said on Wednesday afternoon.  \n June 20, 2018. 12.16pm.\"Andreina\" calls Fuentes“I’m in Bulgaria only for you. You have to pay me, there’s a meeting with the General of Brussels to fix things,” she says. \nFuentes tells \"Andreina\" it’s harder to get through to her than the Minister himself.\nThe two discuss (tuna) cages. Fuentes wants to know if cages have been laid down. \"Andreina\" says no, that tugboats are ready to start introducing fish into them.\n\"Andreina\" asks when he wants to begin. “The day after tomorrow,” Fuentes replies. \"Andreina\" suggests he comes to Malta.\nJune 24, 2018. 1.03pm.Fuentes calls \"Andreina\"\nFuentes tells \"Andreina\" he is coming to Malta for the meeting with the minister on Tuesday. The meeting is to secure a larger (tuna) quota. \"Andreina\" says she is sorting it out herself.\n\"Andreina\" asks if he will be spending a day with her. Fuentes says yes. \"Andreina\" complains that her partner is only interested in football and that she is alone.\nJune 25, 2018. 1.46pm.Fuentes calls \"Andreina\"\"Andreina\" says she has emailed “Marebrun” to inspect all tuna vessels. Brussels wanted to know if all tuna was registered with BCD (codes). \"Andreina\" says she told them it was all marked with BCD.\nFuentes says he will be landing in Malta at 10.30pm and will be there until Thursday. Giovanni has booked him a hotel at the Hilton. He asks her to join him for dinner, but \"Andreina\" says she cannot have dinner with him in Malta. If he’s at the hotel at 11pm she will come see him, if not she’ll see him at 6am.\nJune 25, 2018. 4.57pm.Fuentes calls Fenech Farrugia\nHe is keen to start laying out cages and filling them with fish, but bad weather is complicating those plans. The delays are costing a lot of money, he says, \"Andreina\" says there are plans to lay down a cage on Sunday, but she does not know which one.\nJune 26, 2018. 4am.The operation comes to an end.Jose Fuentes is due to meet “the Maltese minister” the following day, to obtain permission to increase his company’s quota of tuna to 4,000 from the 3,000 he is permitted. Investigators say \"Andreina\" helped smooth that meeting.\nOctober 16, 2018 79 people are arrested in an EU-wide operation Europol dubs Operation Tarantelo. Authorities seize more than 80,000kg of bluefin tuna.\nThe volume of this illegal trade is double the annual volume of the legal trade, which is estimated to be 1.25 million kilos,” Europol says.\nThe international mission was conducted by the Spanish Guardia Civil with the support of the French, Italian, Maltese and Portuguese authorities.\n‹›-+Page:  /", "comment_count": 125, "id": 1140}, {"keywords": "", "author": "", "article_body": "Updated 10.10am\nFormer Nationalist MP and long-serving family doctor Lino Gauci Borda has died at Mater Dei Hospital, aged 82.\nLino Gauci Borda.\nDr Gauci Borda served in the House from 1976 until 1994 when he resigned.\nBorn in Sliema, Dr Gauci Borda lived most of his life in Fleur-de-Lys, a locality about whose history he later wrote a book.\nHe graduated as a doctor in 1961 and served as a general practitioner.\nHe stood for election as a PN candidate in 1971 and was elected for the first time in 1976. He also served on the Executive Committee of Commonwealth Parliamentary Association.\nDr Gauci Borda is remembered by hundreds of car enthusiasts for his love of vintage cars. He was president of the Old Motors Club for 16 years and subsequently honorary president. He promoted the hobby and was instrumental in acquiring a property for the club in Mosta.\nTributes poured in on Wednesday morning, with PN general secretary Clyde Puli and former PN deputy leader Beppe Fenech Adami describing him as ‘a true gentleman'. An official statement in his memory was also issued by the Nationalist Party. The Labour Party paid tribute to the long years he had served in parliament and the time he had spent serving the community as a doctor.\nHe is survived by his wife Louise Ann Gauci and daughter Annabelle.", "comment_count": 0, "id": 1141}, {"keywords": "", "author": "Keith Micallef", "article_body": "An application for a nine-storey hotel next to the Valyou supermarket in Mellieħa is being recommended for refusal on grounds it would exceed the height limitation for the area.\nSpread over a plot of land with a footprint of 3,600 square metres, the proposed development incorporates 120 residential units, shops, a hotel and two underground levels for parking and garages.\nThe application was filed in 2017 by Gozitan development company J. Portelli Projects, who are also behind Mercury Towers, in Paceville, together with Agius Projects and DTX Projects.\nThe site, which occupies an entire block surrounded by Triq l-Iżbark tal-Franċiżi, Ħalq iċ-Ċawl, Il-Fortizza and Triq in-Nases, was government-owned until 2015 when it was sold following a public call. Though the selling price was never made public, the conditions stated that only bids of at least €2.5 million would be considered.\nThe decision had dealt a fatal blow to the local council’s plan to acquire the land to build a community centre complete with an indoor pool.\nThe proposal had been floated in January 2014 in a presentation delivered by Mellieħa mayor John Buttigieg during a special Cabinet meeting held in the locality.\nFrom the very beginning, the application for a hotel and apartments was met with objections from residents and, later, also from the council which is insisting that such a development would be “too insensitive and, hence, incompatible” with the surroundings.\nConcerns had also been raised on the increase in traffic the complex would generate and the visual impact such a massive block would have on its surroundings.\nThough the application is still pending, the Planning Authority’s case officer is recommending the planning board to reject the proposal.\nHe noted in his report that the height limitation for the area was three floors plus basement, with the maximum height of the building envelope being 16.3 metres from the highest street level.\nHowever, the application qualified for two additional floors in view of the height limitation adjustment policy for hotels, meaning 23.8 metres in total, including one receded floor.\nIn view of this, the case officer concluded that, in order to be compliant, a number of proposed residential apartments in the fifth and sixth floors had to be eliminated, while others in the fourth, fifth and sixth floors had to be redesigned to have a recess.\nSimilarly, in the hotel section, the eighth floor had to be eliminated completely while the seventh would be redesigned to incorporate a recess.\nThough the developer was notified about these issues, he refused to comply, insisting the submitted plans were in line with the policies.\nConsequently, the case officer is recommending the board to refuse the application on grounds that the proposed building fronting Triq Ħalq iċ-Ċawl and Triq in-Nases would exceed the maximum local plan height limitation and corresponding height in metres.", "comment_count": 25, "id": 1142}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Wednesday’s newspapers.\nTimes of Malta says that according to sources close to the case phone intercepts between the head of the fisheries department and a Spanish tuna rancher linked to a multimillion-euro racket were “just the tip of the iceberg”. In another story, the newspaper says fresh data shows the southern harbour region has the highest number of patients receiving assistance because of mental health problems.\nMaltaToday also leads with the case of the head of the fisheries department and carries excerpts of tapped conversations.\nThe Malta Independent says Sec revision classes yieled a pass rate lower than 30% in 2018.\nIn-Nazzjon says the government lacks a plan to deal with the problems it created due to an increase in the population.\nL-Orizzont quotes the Justice Minister telling the European Parliament Malta was willing to continue to improve its judiciary system.", "comment_count": 0, "id": 1143}, {"keywords": "", "author": "Ivan Martin", "article_body": "Phone intercepts between the head of the fisheries department and a Spanish tuna rancher linked to a multimillion-euro racket were “just the tip of the iceberg”, sources close to the case said on Tuesday.\n“This case is about to start unravelling in the Spanish court and will expose just how dirty the tuna industry can be and the extent of the irregularities taking place in Maltese waters,” a Spanish source familiar with the Madrid court proceedings said.\nFisheries Department director Andreina Fenech Farrugia was on Tuesday suspended on full pay in the wake of allegations that she had demanded money off a Spanish tuna kingpin.\nShe denies the claims made in her regard.\nDr Fenech Farrugia had already been removed from her post by a Nationalist administration in 2010 and transferred to the Malta Competition and Consumer Affairs Authority. She was reinstated at the Fisheries Department when Labour returned to government in 2013.\nShe was suspended after phone intercepts published by Spanish news outlet El Confidencial suggested she was involved in the tuna corruption racket.\nRead: Malta's fishy business mapped out\nAccording to the transcripts of telephone conversations between her and Josè Fuentes Garcia, Dr Fenech Farrugia is quoted as saying: “I am in Bulgaria just for you. You have to pay me because I have a meeting with the [director] general of Brussels.”\nThe documents, which form part of a Spanish court case due to begin in the coming days, date that conversation as having taken place last June 20, when EU fisheries heads were meeting under the auspices of Bulgaria’s EU Council presidency.\nQuestions sent to European Fisheries Commissioner Karmenu Vella on Tuesday remained unanswered at the time of writing.\nDr Fenech Farrugia said in a statement she had “always observed and employed the highest standards of diligence and professionalism in my work. I always took the necessary legal steps against all operators, at all times, when any illegalities were detected”.\nShe later told Times of Malta she had never demanded or received any irregular payments.\nInvestigators both in Malta and in Spain are working on the theory that contacts in Malta helped the Fuentes Group import undeclared tuna into Spain, bypassing quota restrictions.\nAndreina Fenech Farrugia\nThe authorities suspect the illegal trade amounted to up to €25 million.\nMr Fuentes sits at the top of a multinational empire that covers more than 40 different companies. Tuna, however, is the family crown jewel and the Grupo Fuentes is the world’s largest seller of Atlantic bluefin tuna.\nThe company has a Maltese subsidiary firm, Mare Blu Fishing, the only local tuna farming operator not to form part of the Maltese fish farming lobby. In a statement, the lobby – the Federation of Maltese Aquaculture Producers – welcomed Dr Fenech Farrugia’s suspension.\n“We need to ensure that the industry’s reputation is safeguarded,” CEO Charlon Gouder said.\nThe government said it was collaborating with the authorities in the ongoing investigations to establish all the facts of the case, even in the best interest of the fisheries and aquaculture sector.\nTuna fished illegally from Maltese waters in tapas bars, fish markets in Spain\nThe Maltese police, it said, had involved Europol to receive information from Spain.\nRead: Meanwhile, other investigations by the Malta police were continuing and an inquiry led by Magistrate Gabriella Vella was ongoing.\nPolice sources said the magisterial inquiry was looking into the operations of a number of Malta-based offshore fish farms.\nThey also said that central to the case was the theory that “a fisheries official” had made a dubious request to raise the island’s tuna export quota “dramatically” from 3,000 to 4,000 tons.\nSuch requests would normally require a series of top-level signatures. However, it was suspected that, in this case, things were speeded up. The request was eventually blocked and the sources indicated more evidence related to this matter could emerge.", "comment_count": 47, "id": 1144}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Labour Party could be set to take in a fortune from the lease of the former Raffles Discotheque, a property in a prime site in St Andrew’s, which it had acquired through a controversial expropriation deal 40 years ago.\nIn a request for expression of interest published on Sunday, the PL said it was receiving proposals for the lease or emphyteusis and commercialisation of this site.\nHowever, the terms of reference are only available on request from the party headquarters in Ħamrun, and the closing date for submissions is March 29.\nThe building, dating back to colonial times, was part of a deal through which the PL was given properties in St Andrew’s, a factory in Marsa currently used as the party’s television and radio station,  the historic Maċina building in Senglea which served as Labour’s headquarters until 1994, and €40,500 in cash.\nAll this was given in exchange for Freedom Press in Marsa, which was taken over by Malta Shipbuilding.\nThe properties had been transferred through a parliamentary resolution on August 7, 1979, which had been rushed through on the very last day before the House had risen for the summer recess.\nIn the case of St Andrew’s, the properties which had an overall footprint of 14,000 square metres comprised the Australia Hall, which at the time was still a fully equipped theatre, Hook House and the Junior Ratings Club.\nA yearly ground rent payment of €47,000 had been imposed, and the PL was obliged to keep the properties in a good state of repair.\nDuring the parliamentary debate, Nationalist Party leader Eddie Fenech Adami had criticised the deal saying that the properties in St Andrew’s alone were twice the size of Freedom Press.\nMoreover, he had raised doubts on government’s decision against imposing any condition to oblige the PL use these properties exclusively as its new headquarters.\nDr Fenech Adami had branded such deal as government’s present to the PL, saying these properties at the time had a commercial value of almost €500,000.\nAs a matter of fact, a few years down the line, it transpired that the PL never used its St Andrew’s properties as headquarters. Instead, it moved to the Maċina in Senglea until 1994 when it migrated to its present premises in Ħamrun. Meanwhile, Australia Hall was left abandoned, and one of the other two properties was leased to the sons of former Labour Minister Joe Grima. The latter turned the building into Raffles Discotheque.\nIn 1992, three years after the discotheque had been closed down, parts of the building were gutted by fire. Six years down the line, Australia Hall also suffered the same fate, and has been left in ruins ever since.\nIn 1997, the Labour government has passed a parliamentary resolution to barter €549,000 in ground rent arrears which the party owed to the State.\nIn return, Labour dropped its claims against payment of arrears which the government owned it on the former Freedom Press. Moreover, the government relinquished its right to terminate the concession to the PL over breach of contract.\nThough the PN at the time had challenged this resolution in court, the case was later withdrawn.\nIn 2010, the Lands Department took the PL to court to reclaim ownership of these properties, but the case was dropped when Labour was elected to government in 2013.\nA year later, the party sold Australia Hall to Tamarac Ltd – owned by the proprietors of furniture business Fino and Chris Gauci from Big-Ben. Though the property was sold for €582,343, no money exchanged hands in view of Labour’s pending debts with this company. However, through this deal the PL repossessed all rights over Raffles Discotheque, which is the most expensive site of them all.", "comment_count": 23, "id": 1145}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The former Labour mayor of Rabat, Frank Fabri, was investigated over serious corruption claims in 2010, the police have told The Sunday Times of Malta, but he was never charged as “the prime witnesses against him were undergoing criminal charges in court”.\nFrank Fabri\nLegal sources said that the police’s reasoning for not pressing charges against Mr Fabri – who today is Permanent Secretary at the Education Ministry – was “odd” and not in tune “with the usual practice adopted by the police in similar cases, where they allow the court to decide whether or not corruption exists after they have filed the charges”.\nLight on corruption claims against Mr Fabri was indirectly shed last week in a court sentence that acquitted John Borg, the owner of a cleaning services company, over charges brought against him by the police in 2010, of corrupting Mr Fabri back in 2006.\nAccording to the proceedings of this case, which were never reported in the media, in 2010 the police had accused Mr Borg of corrupting Mr Fabri over a public cleansing contract when he was mayor of Rabat.\nThe proceedings show that Mr Borg had told the police and other parties that he used to pay Lm150 (€345) a month to Mr Fabri in connection with a contract he had been awarded by the Rabat local council.\nMr Borg, who had also provided the police with recordings of telephone conversations in which he had recounted his dealings with Mr Fabri, also claimed that Mr Fabri had afterwards asked him for an increase and to start paying him LM250 (€575) a month. According to Mr Borg, after he refused, Mr Fabri terminated his contract.\nHe used to pay Lm150 a month to Mr Fabri\nWhen Mr Fabri was confronted in court over these claims, he chose not to reply to questions.\nLawyers explained that normally this right is given to witnesses when, through their evidence, they could be incriminating themselves.\nIn the same court case, which found Mr Borg not guilty of corrupting Mr Fabri on technical grounds, another witness, Noel Agius, confirmed that Mr Borg had told him about corruption involving Mr Fabri.\nCriminal lawyers told The Sunday Times of Malta that once the police were so convinced they should charge Mr Borg of corrupting a public officer (Mr Fabri) they couldn’t understand why no charges had been brought against Mr Fabri.\n“As far as we know, corruption needs two people to take place,” they commented.\nIt is up to the police to decide whether or not to press charges in court.\nAsked by this newspaper to state whether he had received any bribes from Mr Borg when he was mayor of Rabat, as claimed in court, Mr Fabri did not reply. Neither did he say whether the police had investigated him.\nHe said only that “the court judgment confirms the unfoundedness of the allegations and my innocence”.\nOn their part, the police confirmed that “Mr Fabri was interrogated and investigated,” but never charged.\nIt is not known whether the Attorney General will be appealing the case against Mr Borg. The police said they had passed on the case file for the AG’s final decision.\nMr Fabri, a teacher by profession, was a popular mayor of Rabat but he resigned suddenly in 2007 to take up a directorship post at the Education Ministry.\nThe alleged case of corruption took place in 2006.\nFollowing Labour’s return to power, in 2013, Mr Fabri was promoted to Director General at the Education Ministry and then to Permanent Secretary.\nWhat resulted from the court’s decision?\nIn 2010, the police accused Mr Borg of “corrupting Frank Fabri – mayor of Rabat” in connection with public cleansing tenders.\nAccording to the prosecuting officer (Angelo Gafa), in telephone recordings given to the police by Mr Borg of conversations with Noel Agius (found guilty of trading of influence in a separate through similar case), he (Mr Borg) is heard saying that “during the time when he (Borg) was doing work for the Rabat local council, (mayor) Frank Fabri asked for payments (bribes) of Lm150 (a month) and that he had accepted and that after a while he (Fabri) started asking for Lm250 a month.”\nMr Agius told the court that “Mr Borg told him about mayor Fabri, and that Fabri was asking him for Lm150 a month which Mr Borg started paying and that afterwards Borg refused to pay Fabri an extra Lm50 – 100 a month”.\nMr Agius told the court that “according to Mr Borg, after he refused to pay more money to Fabri, the Rabat council terminated his contract”.\nMr Agius said Mr Borg had told him “he was ready to confirm all he was saying under oath in the presence of Mr Fabri. However this was never done as Fabri resigned from the local council”.\nNoel Cini, at the time acting executive secretary of Rabat local council, told the court that he had “issued default notices against Mr Borg’s company to stop his contract due to bad workmanship on the orders of mayor Fabri”.\nMr Fabri chose not to reply to questions on the case in court and no other witness was produced by the prosecution to give evidence on the alleged corruption of Mr Fabri by Mr Borg.\nThe prosecution exhibited an audio recording with Mr Borg recounting how he had corrupted Mr Fabri but according to the court “no proof was produced to confirm that the person in the audio recording was Mr Borg himself”. \nivan.camilleri@timesofmalta.com", "comment_count": 116, "id": 1146}, {"keywords": "", "author": "", "article_body": "The Armed Forces of Malta have rescued 8,559 people from the sea since 2013, 2,731 of which were in 2018, according to the Home Affairs Minister Michael Farrugia.\nReplying to a parliamentary question by Labour MP Byron Camilleri, Dr Farrugia said that there were 359 rescue missions in all.\nThere was one mission this year so far, when one person was rescued\nThe PQ did not indicate how many of the missions involved local boats and how many were international.", "comment_count": 3, "id": 1147}, {"keywords": "", "author": "", "article_body": "The number of people with a disability who are employed almost doubled between 2013 and 2018, according to Education and Employment Minister Evarist Bartolo.\nReplying to a parliamentary question by Labour MP Byron Camilleri, he said that the number had increased from 1,797 in 2013 to 3,508 in October 2018.\nThe National Statistics Office figures for that month show that there were 232 persons with a disability who were registering for work with JobsPlus, 63 fewer than the previous year.", "comment_count": 10, "id": 1148}, {"keywords": "", "author": "", "article_body": "The Foreign Ministry had taken action to tighten up procedures for the issue of visas to Algerians well before the shortcomings were flagged by the National Audit Office, minister Carmelo Abela said on Tuesday.\nResponding in Parliament to a question by MP Carmelo Mifsud Bonnici, Dr Abela said that his ministry would continue to analyse the parts of the report relevant to his ministry which were “not speculative”, so as to improve consular operations.\nThe NAO report, ‘An Investigation of Visa issued by the Maltese Consulate in Algiers’, was commissioned by the Public Accounts Committee in November 2015, after an Algerian travel agent had alleged that irregular payments were made by visa applicants for preferential treatment.\nRead: Algeria 'visa scam' : Beppe Fenech Adami insists on getting explanation\nRead: Visa vetting at Malta's Algiers consulate was 'less than optimal', NAO finds\nNo evidence was provided in support of these claims and following referral to the Algerian Police by the travel agent, nothing illegal was established. The alleged wrongdoing did not involve the consul.\nThe investigation covered the period between March 2014 and September 2015. During this period, 14,640 applications were received, of which 6,779 were issued a visa while 7,589 were refused.\nDr Abela said that the NAO report itself had said the ministry acted appropriately when allegations of wrongdoing surfaced, and that a September 2016 report by the European Commission had only found some operational irregularities.", "comment_count": 3, "id": 1149}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The co-owners of a prominent seafront property leased to St Julian’s Band Club 90 years ago, have been awarded €300,000 as compensation for moral and pecuniary damages over a breach of their property rights.\nThe decision was taken by the civil court in its constitutional jurisdiction at the end of a 19-year court saga sparked off by one of the owners, Anna Galea and taken up by her successors in title, the Galea Salomone family, together with Mercury Investments Ltd.\nThe owners successfully argued that their fundamental right to the full enjoyment of their property had been breached.\nThe premises situated along St George’s Road had been rented by the original owner Antonio Ellul to the St Julian’s band club in February 1927 against an annual rent of Lm43, equivalent to €100.16.\nPart of the premises was eventually sub-let to third parties to be run as a bar and restaurant, prompting Mr Ellul’s successors in title to attempt to put an end to the situation which was effectively depriving them of their right to the full enjoyment of the property.\nAs from March 2000, they refused to accept payment of the rent, whilst filing proceedings before the Rent Regulation Board seeking termination of the lease on the grounds that both the sub-lease and the change of use of the tenement had been effected without their’ consent.\nHowever, in 2005 the Board rejected the claim, a decision which was confirmed a year later when the court of appeal threw out the landlords’ appeal.\nThe landlords instituted constitutional proceedings against the attorney general in February 2013, claiming that the fact that they were barred at law from terminating the lease or revising the rent payable amounted to a breach of their property rights as safeguarded under the European Convention.\nThe Convention provides that: ”Every natural or legal person is entitled to the peaceful enjoyment of his possessions. No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.”\nThe landlords argued that amendments to letting laws had not ameliorated the conditions of owners of leased commercial premises who were still bound to renew the lease and could not change letting conditions unless authorized by the Board.\nIn this case, not only had the Board and the Appeals Court rejected their claim, but the band club’s decision to sublet the property as a bar and restaurant to third parties had been allowed to stand, thereby allowing the tenants to reap considerable benefits at the expense of the landlords, who received a pittance.\nThe First Hall, Civil Court in its constitutional jurisdiction, presided over by Chief Justice Joseph Azzopardi, observed that a private architect had concluded that the current market value of the property stood at €2,600,000, whilst its rental value as a commercial premises in 2010 was calculated at some €152,000.\nThree additional court-appointed experts in 2015 had assessed the property’s market value as €1,500,000, with a rental value exceeding €1 million.\nOn the basis of all evidence, the court concluded that the rental value of the property over a 30-year span between 1987 and 2017, after which the property was sold to third parties, was €978,194.\nThrowing out the attorney general's plea regarding a lack of juridical interest on the part of the landlords, the court declared that although the property had been transferred to Heritage Hotels Ltd in March 2018, litigious rights had been retained by the applicants “in full.” (Heritage Hotels Ltd transferred by deed of exchange the ground, first and second floors to St Julian's band club in March last year.)\nOnce the State deemed clubs to have a great social-cultural importance, therefore the State itself ought to help them and invest in them, rather than shift the burden solely onto the private citizen- Court\nAs for the argument that the lease served “a general interest,” the court declared that “Once the State deemed clubs to have a great social-cultural importance, therefore the State itself ought to help them and invest in them, rather than shift the burden solely onto the private citizen.”\nIn the light of all considerations, the court declared that the landlords’ property rights had been breached, awarding them €15,000 by way of moral damages “to make good for the frustration and state of uncertainty placed upon them.”\nA further €285,000 were awarded by way of pecuniary damages, the Court observing that there was “a truly substantial difference” between the lease in terms of law and the rental value of the property as determined by the technical experts.\nThe court ordered the Attorney General to pay the applicants €300,000 in damages, together with 8% interest from date of judgment.\nLawyer Paul Cachia assisted the applicants.", "comment_count": 25, "id": 1150}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A 20-year old father was granted bail on Tuesday after having been accused of assaulting his pregnant former partner on Monday.\nThe incident allegedly broke out at around 6pm when the couple were involved in an argument over access to their 18-month old daughter.\nThe man allegedly pulled the woman by the hair, dragging her in front of their child. The episode took place at the home of the accused’s mother, who witnessed it all, but allegedly failed to restrain the young man.\n“My client is not a punching bag,” lawyer Edward Gatt,  who appeared for the victim, remarked. “Not only is the accused quick to strike, but his mother did not help either. This was brought about by the accused who ought to know better. Domestic violence is a reprehensible crime.”\nProsecuting Inspector Roderick Agius explained how there had allegedly been similar incidents in the past.\nAppoġġ officers had assessed the situation, gauging the woman’s condition as being one of ‘high risk’ whilst concluding that the man’s risk was ‘very low.’\nThe man was arrested and charged with having slightly injured and threatened his ex. He pleaded not guilty.  \nDuring the proceedings, Magistrate Aaron Bugeja called the accused's mother and before asking her to leave the courtroom, so as not to compromise her position as a possible future witness, warned her to calm down and “bite her tongue” if she truly loved her son.\n“Right now, in the heat of the moment, you might say many things you’ll regret later on,” advised the Magistrate, after being told by Dr Gatt had, earlier int he day,  called her son’s ex, warning her to place a policeman on guard outside her home since she would cause trouble once the court hearing was over.\nOnce the woman was outside, the hearing proceeded with a request for bail by defence lawyer Yanika Bugeja. The prosecution objected and argued that there was a real fear of tampering with evidence since the injured party was still to testify.\nDr Bugeja said that although the accused’s mother had caused problems, the person facing prosecution was her son.\nAfter a brief suspension of the hearing, Magistrate Bugeja summoned back the accused’s mother, asking her whether she was willing to step in as guarantor for her son’s release from arrest, explaining the full import of her undertaking. \nThe court upheld the request for bail against a deposit of €1,000, a personal guarantee of €4,000 and a third party guarantee of €5,000.\nThe accused was ordered to sign the bail book on a daily basis, to abide by a curfew and not to lay foot at his ex’s hometown.\nHe was further placed under a Temporary Supervision Order and a Protection Order which limited his contact with his ex to the “minimal” degree necessary for access to his daughter as regulated by the Family Court.", "comment_count": 0, "id": 1151}, {"keywords": "", "author": "Ivan Martin", "article_body": " \n\nMalta's tuna ranching industry has been thrust into the international spotlight following revelations of irregular payments to a senior official.\nAccording to leaked transcripts, fisheries chief Andreina Fenech Farrugia told rancher Jose Fuentes Garcia: “You have to pay me, because I have a meeting with the [director] general of Brussels.”\nBrowse the interactive graphic above to see how the story unfolded, or click here to see it in full screen. \n ", "comment_count": 4, "id": 1152}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Nationalist Party is not opposed to land reclamation in principle, but is insisting that any projects are not driven solely by the amount of construction waste being generated.Environment spokesman Jason Azzopardi said on Tuesday that environmental considerations should be paramount in any eventual project, and that the government should first focus on better measures that reduce and manage the construction waste crisis. Land reclamation has risen up the agenda as the construction industry has sounded increasingly urgent warnings about the lack of facilities available for waste disposal. The Times of Malta has reported that one embryonic plan had earmarked an area off the Xgħajra coast as most suitable to a large-scale reclamation project. Addressing a press conference, Dr Azzopardi called for a long-term national strategy on construction waste, based on thorough studies including environmental impacts. He said a series of short-sighted decisions on construction waste had led to the industry and the environment both suffering.\nThe government opened the floodgates without considering where the waste would go“The government opened the floodgates by making a conscious decision to base the economy on the construction industry without considering where the waste would go,” Dr Azzopardi said.Putting forward the party’s proposals, MEP candidate Michael Briguglio called for more schemes to conserve and restore existing buildings and measure to encourage greater reuse of demolition material. He also said developers needed a national facility where construction waste could be resold without undue burden, and schemes to encourage reconstituted stone which could then be exported as an economic resource. “Construction waste should be a resource not a burden,” he said. “This is a sector in which we should be creating green jobs.”Dr Briguglio added that studies would have to determine whether such measures could reduce construction waste to the level where existing landfill capacity would be enough to cope with the remaining disposal needs.\nLabour welcomes agreement on land reclamation\nIn a reaction, the Labour Party said it welcomed the PN's comments on land reclamation.\n\"This is a step forward, it means there is broad agreement in the country on an issue of major importance,\" the party said. \nIt hoped that when the country needed to discuss the next steps in this direction, the PN would participate constructively rather than sit on the fence as it had done in the debate on waste management. ", "comment_count": 15, "id": 1153}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Activist and blogger Manuel Delia said on Tuesday that he was perplexed at how his direct interest in a court case over the removal of candles and banners from the Daphne Caruana Galizia makeshift memorial in Valletta was being questioned.\nMr Delia had instituted the case against Justice Minister Owen Bonnici, claiming a breach of his freedom of expression.\nOn Thursday, the minister's lawyers argued that other people, rather than Mr Delia, had personally placed mementoes at the Great Siege monument, which is being used as the Caruana Galizia memorial.\nMr Delia in his reaction on Tuesday, said he had never expected to have to prove that he actually protested in front of the Great Siege memorial, and the lawyers' reaction “lacked all trace of truth, logic and practicality”.\nReferring to his sworn affidavit presented in the acts of the case, Mr Delia cited salient parts where clear reference was made to his presence at the protests and the placing of items at the memorial.\nHe could not understand how the minister's lawyers had reached the conclusion that such items had only been placed by other people, basing their arguments on the testimony of Dr Karol Aquilina and Ms Ann Demarco, when he too could produce evidence showing he had actually paid for the banners at the memorial.\nMoreover, he had participated actively in the protests and had in fact been acknowledged as the lawful owner of the items which, after having been removed from the memorial, had been returned to him under police instructions.\nIt was true that there were other activists making the same form of protest as him, including Karol Aquilina and Ann Demarco, Mr Delia said, but, he was perplexed at how a group of people sharing the same interest could detract from his juridical interest in the case. This was an argument “deprived of all form of logic.” \nLawyers Therese Comodini Cachia, Eve Borg Costanzi, Jason Azzopardi, Karol Aquilina and Paul Borg Olivier are counsel to Mr Delia.\nLawyers Victoria Buttigieg and Chris Cilia are counsel to the respondents.\n ", "comment_count": 15, "id": 1154}, {"keywords": "", "author": "", "article_body": "Registering a total of 99.8mm of rainfall, the first month of the year was three times as wet as the previous month, making it the wettest January the Maltese islands have experienced since 2011.\nThe second week of January saw its fair share of precipitation, given that 12.6mm of rain fell on the 9th day, amounting to over 12% of the month’s above-average total rainfall.\nMalta was also rattled by six thunderstorms during January, five of which were reported between the 19th and the 28th. Hail was observed on four days, twice in the first week and twice in the last. This is double the climate norm.\nDespite the stormy spell, January recorded a lower-than-average mean cloud cover, allowing the islands to enjoy an average of 5.6 hours of bright sunshine per day.\nCharacterised by a total of 174.5 hours of bright sunshine and a below-average mean air temperature of 11.6°C, the first month of 2019 was sunnier than expected, but started the year off on a cool note.\nRainfall in January was above average.\nMalta didn’t escape the Polar air mass, which descended on continental Europe during the first week of January. A look at January’s weather pattern shows that the first half of the month was relatively cooler than the second.\nThe lowest air temperature to be recorded was a crisp 4.1°C on January 5, while the grass minimum temperature dropped to a frigid 0.1°C two days later.\nHalfway through the month, air temperatures gradually started to rise, reaching a maximum of 17.8°C on January 18. At 14.4°C, the mean maximum temperature was over one degree cooler than the norm of 15.6°C.\nThe mean minimum temperature was also lower than the climate norm of 9.9°C, dropping to 8.8°C.\nIn contrast with cooler air temperatures, the mean sea surface temperature for this month rose by 0.3°C to 16.1°C.\nJanuary was not only colder but also windier than expected, recording an average wind speed of 10.7 knots - 1.5 knots higher than the climate norm.", "comment_count": 1, "id": 1155}, {"keywords": "", "author": "Denise Grech ", "article_body": "The University Students' Council (KSU) has complained University staff informed it too late of ongoing works, leading to an increase in parking problems at the iniversity.\nThe council was informed by some university staff members that the car park at the gateway entrance would be closed because of ongoing construction work a few weeks ago, council president Carla Galea said .\nAnother four projects, including a new sports complex, were also taking shape concurrently, the KSU president added.\nHowever, information on the ongoing works reached the council at a very late stage, not leaving it with enough time to prepare for \"the drastic change\" in parking, Ms Galea said.\nTo make matters worse, the parking closure also happened during exam time, Ms Galea added.\nMeetings were immediately held with the University administration to postpone the works until after the examination period to avoid any further confusion during the stressful period, Ms Galea said.\nThe situation also highlighted the mobility problems, not just at university, but across the country, the council added.\nThe council appealed to the university to increase communication and for authorities to prioritise alternative means of transport.", "comment_count": 22, "id": 1156}, {"keywords": "", "author": "Denise Grech ", "article_body": "European Parliamentarians on Tuesday called on the European Commission to further monitor cash-for-passports schemes, saying EU citizenship \"should not be reduced to a commodity\".\nIn a report by the Committee on Constitutional Affairs, endorsed by the European Parliament, member states were called upon to abandon the sale of residence and nationality.\nMalta has received backlash for its scheme, with Justice Commissioner Vera Jourova insisting the Commission did not endorse Malta's sale of passports.\nBut Prime Minister Joseph Muscat has insisted a former European justice commissioner had agreed with Malta’s passport sales programme and endorsed it in writing.\nGolden visas and investor programme schemes carried a \"high risk of corruption, abuse and misuse of the Schengen area for criminal purposes\", the report warned. It called on the Commission to consider closely national schemes for granting EU citizenship to investors.\nThe Commission should also emphasise the procedures that member states were required to follow in exercising their power to grant citizenship in a manner consistent to EU law, the European Parliament said.\nIt reiterated its call on the Commission to come forward with a proposal for implementing Parliament’s recommendations on an EU mechanism on democracy, the rule of law and fundamental rights.\nRead: Cash-for-passport schemes slammed in international report\nSpeaking to Times of Malta following the vote, MEP Francis Zammit Dimech said one report after the other reconfirmed that lack of transparency in the scheme was harming Malta's reputation.\n“It is deplorable that the Maltese government persists with selling passports,” he said.\nThe government knew about the damage the sale of passports was creating and was attempting to legitimise the need of the scheme by using funds raked from selling passports for social housing, Dr Zammit Dimech said.\n“Do we need to sell passports to offer Maltese people such services? Is this the strong economy [Prime Minister Joseph] Muscat speaks of,” asked Dr Zammit Dimech.", "comment_count": 16, "id": 1157}, {"keywords": "", "author": "", "article_body": "Malta has been steadily increasing its share of energy from renewable sources, but it is still one of the laggards in the EU.\nIt only got 7.2% from these sources in 2017, the third lowest after Luxembourg (6.4%) and the Netherlands (6.6%).\nThe EU as a whole has seen considerable improvement, with the percentage reaching 17.5% in 2017, up from 17% in 2016 and more than double the share in 2004 (8.5%), the first year for which the data are available.\n\nThe EU's target is to obtain 20% of energy in gross final consumption of energy from renewable sources by 2020 and at least 32% by 2030. According to Eurostat, 11 member states have already achieved their national targets, which take into account the different starting points, renewable energy potential and economic performance. Malta’s target is 10% – still 2.8% from its 2017 percentage.\nSince 2004, the share of renewable sources in gross final consumption of energy grew significantly in all member states. Compared with 2016, it has increased in 19 of the 28 member states. Leading the pack is Sweden, which has more than half (54.5%) of its energy coming from renewable sources.\n\n ", "comment_count": 14, "id": 1158}, {"keywords": "", "author": "", "article_body": "Flimkien għal Ambjent Aħjar has filed an appeal against the Planning Commission’s decision to permit the commercialisation of a boathouse at Dwejra in San Lawrenz, Gozo.It said in a statement the approved development would threaten this unspoiled protected area of unparalleled natural beauty.\nEncouraging such \"an incompatible use\" would lead to the piecemeal degradation of Dwejra’s ODZ, setting a precedent for future commercial development in this remote pristine rural area, the NGO said. The site is designated as an area of high landscape value and also listed as a special area conservation of international importance falling within the San Lawrenz Natura 2000 site.\nAs such, it should have been protected against such damaging uses, the e-NGO said.FAA said that the Environment and Resources Authority, in its official capacity as consultant to the Planning Authority, had stated that the development was of \"environmental concern\": “The introduction of commercial uses within a site that is outside the development zone and in an ecologically protected site is unacceptable. ERA considers that the proposed use for commercial purposes is inappropriate given the site context and cannot be justified in view of its genuine need.”\nBut ERA’s concerns were completely ignored by the Planning Commission, FAA said.It added that the decision went contrary to the Planning Commission’s stance against a similar application in Ħondoq, where it had refused a request to convert an agricultural store into a souvenir shop.\nFAA maintained that the same logic should have been applied to Dwejra, even more so given its designation as a Natura 2000 site.", "comment_count": 18, "id": 1159}, {"keywords": "", "author": "Ivan Camilleri, Ivan Martin ", "article_body": "Pre-fabricated classrooms are more comfortable than many of those in Malta’s existing schools, Education Minister Evarist Bartolo said on Tuesday.\nMr Bartolo's defence of the mobile classrooms echoed that of the State agency responsible for the public school building programme.\nReiterating that the use of mobile classrooms at St Paul’s Bay Primary will cease by next September when a new school in Qawra should open its doors, a spokesman for the Foundation for Tomorrow’s Schools (FTS) described the mobile facilities as “first-class in both quality and equipment”.\n“One can even argue that the fact that they are air-conditioned makes them better than classrooms in other schools,” the spokesman insisted.\nFielding questions from reporters on Tuesday, minister Bartolo said these mobile classrooms had first been introduced around four years ago in some institutions and the government had received “very positive feedback”. “There are whole schools built using these prefabricated facilities in other countries,” he said.\n'First class'\nThe FTS said that a tender issued last week to procure more mobile classrooms and place them at St Paul’s Bay’s Primary was to replace existing ones, and not for new units.\nAsked to explain why the current mobile classrooms need a replacement, once the FTS is describing them as “first class” and a new school will open in September, the spokesman did not reply.\nInstead he said: “Some of the pre-fabricated classrooms at St Paul’s Bay Primary School might need to be replaced.”\n'No more space,' principal says\nLast week, following a report by this newspaper that the government is planning to place more mobile classrooms in St Paul’s Bay, college principal Patrick Decelis said that this will not be the case.\n“We have no more space for mobile classrooms at St Paul’s Bay and this won’t be a solution if the new school is not ready on time,” he said.\n“If this happens, and I hope it won’t, we’ll have to find other alternatives, including that students will start attending schools in other areas,” he said.\nPressed to explain why the government issued a tender for more classrooms at St Paul’s Bay at the same time as saying that the new school will be ready this September, Mr Decelis said that most probably this was to replace some mobile offices.\nMinister Evarist Bartolo has defended prefab classroom plans. Photo: Chris Sant Fournier\nHowever, he did not explain why offices will be replaced with classrooms.\nGovernment sources told this newspaper that the tender is the government’s ‘Plan B’ in case the new school misses its completion target once again “as it will probably be the case”.\nAnnounced by Education Minister Evarist Bartolo in 2015, the new Qawra School had to be completed in 2017.\nHowever, its opening has been postponed from one scholastic year to the other as the agency was engulfed in corruption scandals and repeated changes at its top echelons.\nApart from St Paul’s Bay, the government is now also planning to introduce mobile classrooms at Żejtun’s secondary school until an additional two floors are added to the current building.\nAlso in this case, the completion of works is not on target.\nRising immigration has been putting a strain on State facilities in certain localities experiencing phenomenal growth.\nBetween 2015 and last year, the residential population of St Paul’s Bay grew by 26 per cent, mostly through migration.\nPN: This is an admission of the crisis in education\nThe Nationalist Party said the declaration by the Foundation for Tomorrow’s Schools that the classes in mobile homes were better than some school classes was confirmation of the crisis in the education sector caused by under-investment and poor allocation of resources.\nShadow minister Clyde Puli said pupils at St Paul’s Bay School were being made to follow class in containers because of the government’s lack of long-term planning. Instead of opening a new school every year, as the PN governments had done, this government was postponing a school every year. \nThis was also a consequence of the government’s lack of planning when it embarked on growing the economy by growing the population instead of raising production.\nThe PN insisted that the government needed to seriously invest in education and the safety and welfare of pupils and teachers.", "comment_count": 19, "id": 1160}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated with ministry's reaction\nHow did Justice Minister Owen Bonnici's claims to MEPs on Monday stack up against the facts? Jacob Borg looks at four key claims. \nCitizenship\nClaim: “In its commitment towards transparency, Malta is one of the few European countries that publishes the names of individuals who obtain citizenship. The nature of the due diligence checks is also public.”\nFact: The government publishes a general list of all people who became naturalised citizens over a one-year period, not a specific list of people who bought Maltese and EU citizenship under the cash-for-passports scheme.\nThe scheme’s regulator has endorsed a call by local lobbyists to remove the names of passport buyers from this annual list. The regulator instead suggested that MPs should be given access to the data under an oath of secrecy.\nPanama Papers\nClaim: “In Malta we have a functioning rule of law. We have judges, we have police, we have investigations. The two major inquiries stated there were no legal grounds upon which to proceed against the people who are allegedly corrupt.”\nFact: Dr Bonnici uses two inquiries instigated by politicians as a blanket clearance of any wrongdoing in the Panama Papers case.\nHe gave the committee the impression that inquiries were started during the normal course of investigations. In fact, cases only began because former Opposition leader Simon Busuttil took to the courts due to the lack of police action.\nDr Busuttil presented leaked FIAU reports which the police had declined to act upon to the courts.\nRead: What the Justice Minister told the EP's financial crimes committee\nThe Justice Minister did not tell the Committee that the police failed to act on an April 2016 request by the FIAU to begin an immediate investigation into the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nExtent of his powers\nClaim: “It would be dangerous if the Justice Minister knew the details of an investigation. I hope investigations come to a close expeditiously.”\nFact: The Justice Minister was given full access to the 1,400 page Egrant inquiry, providing legal counsel to the Prime Minister.\nOnly selected conclusions from the inquiry were published. It recommended further investigations into a number of people, and key characters like Nexia BT’s Karl Cini, ex-FIAU manager Jonathan Ferris and Adrian Delia aide Pierre Portelli have been called in for questioning.\nThe government has refused to publish an unredacted copy of the Egrant report, citing privacy concerns.\n\nVenice Commission\nClaim: “Work is also under way on Constitutional reform particularly, but not only, in the light of the Venice Commission Opinion of last December, which we asked for and we welcomed.”\nFact: Dr Bonnici gave the impression that the Venice Commission report was solicited by the government, when it was the Council of Europe which first requested an opinion on Malta.\nThe very preamble to the Venice Commission’s December report clearly shows that the CoE made the initial request, on October 10.\nThat same preamble shows that the government request for an opinion came three days after the Council of Europe’s.\n\n'I gave no wrong information' - minister\nIn reaction, the minister said the article above \"misses the point\" on every matter raised.\n\"I gave no wrong information to the TAX 3 Committee despite your efforts to disseminate misinformation to the contrary.\"\nThis is his reaction in full:\nCitizenship: Why does the fact that the names of persons acquiring Maltese citizenship through the IIP programme are not published in isolation but in a list of all persons who acquired Maltese citizenship during the year make a difference as to whether such names are published or not? Such persons become Maltese citizens like all the rest. The fact remains that Malta publishes the names as distinct from what goes on in other countries.\nPanama Papers: It was obviously not to the liking of some politicians that the courts have found that the information submitted to them by former Opposition Leader Simon Busuttil in support of his claim to start a magisterial inquiry did not meet the requirements of the law. That is nevertheless a fact resulting from two court decisions which are well known to all in Malta and obviously also to the MEP’s on the TAX 3 Committee. Are you suggesting that the MEPs do not follow the local scene and are gullible? Furthermore, the Egrant inquiry was initiated following a request by the Prime Minister himself. Again, MEPs are not gullible.\nExtent of the powers of the Justice Minister: Unlike the situation in a substantial number of other European countries, the Ministry of Justice in Malta has no residual or exceptional powers with regard to prosecutions. This is all the more so with regard to investigations. Access to the Egrant inquiry report for the purpose of advising the Prime Minister as Minister of Justice was only given after that report was concluded, its main conclusions were made public and a copy had been released to the Prime Minister. That fact has nothing to do with any access by the Minister of Justice to ongoing investigations. There is no such right of access as I correctly informed the TAX 3 Committee accordingly.\nVenice Commission: Irrespective of the three-day gap between the request of a Committee of the Parliamentary Assembly of the Council of Europe to the Venice Commission and that of the Government of Malta, the fact remains that the Government itself invited the Venice Commission to express its opinion on Malta.\nThis happened following a meeting with an EP committee, where this suggestion was mooted from the side of MEP Sophie in ‘t Veld. The government subsequently requested an Opinion from the Venice Commission.\n ", "comment_count": 88, "id": 1161}, {"keywords": "", "author": "Bertrand Borg, Ivan Martin", "article_body": "Updated at 4.30pm \nThe director of Malta’s fisheries department has been suspended following allegations that she demanded money off a Spanish tuna kingpin.\nAndreina Fenech Farrugia was asked to step aside after phone intercepts published by Spanish news outlet El Confidencial suggested she was involved in a tuna corruption racket.\nA top government source told Times of Malta that a new department director is expected to be appointed later on Tuesday. The decision was later confirmed by Environment Minister Jose Herrera.\nIn transcripts of telephone conversations between Andreina Fenech Farrugia and Jose Fuentes Garcia, published by El Confidencial, the Maltese fisheries boss tells Mr Fuentes “I am in Bulgaria just for you. You have to pay me, because I have a meeting with the [director] general of Brussels”.\nThe documents date that conversation as having taken place on June 20, 2018, when EU fisheries heads were meeting under the auspices of Bulgaria’s EU Council presidency. \nDr Fenech Farrugia categorically denied the allegations, saying in a statement that \"I have always observed and employed the highest standards of diligence and professionalism in my work\". \n\"I always took the necessary legal steps against all operators, at all times, when any illegalities were detected,\" she added. \nInvestigators are working to the theory that Malta helped the Fuentes Group import undeclared tuna into Spain, bypassing quota restrictions. Authorities suspect that the illegal trade reached up to €25 million.\nMaltese connection\nMr Fuentes sits at the top of a multinational empire which covers more than 40 different companies. Tuna, however, is the family crown jewel, and the Grupo Fuentes is the world’s largest seller of Atlantic bluefin tuna.\nThe company has a Maltese subsidiary firm, Mare Blu Fishing. According to Mare Blu’s audited accounts, the tuna ranching company made a €7.5 million loss in 2017 – with a gross profit of €26 million wiped out by other costs.\nRead: Malta's fishy business mapped out\nMare Blu is the only local tuna farming operator to not form part of the local fish farming lobby. \nIn a statement, the lobby - the Federation of Maltese Aquaculture Producers - welcomed Dr Fenech Farrugia's suspension. \n\"We need to ensure that the industry's reputation is safeguarded,\" FMAP CEO Charlon Gouder said. \nIn a statement, the government said it was collaborating with the authorities in all ongoing investigations to establish all the facts of the case, even in the best interest of the fisheries and aquaculture sector.\nThe Maltese police, it said, had involved Europol to receive information from Spain. Meanwhile other investigations by the Malta police were continuing and an inquiry led by Magistrate Gabriella Vella was ongoing.\nOperation Tarantella\nLast October, The Sunday Times of Malta had reported that Spanish and Maltese authorities were untangling a web of shell companies and distributors used to funnel illegal tuna catchers from Malta-based tuna farms to Spanish tapas bars and fish markets. Sources had described the operation, codenamed Tarantella, as the largest-ever crackdown on illegal tuna trading in EU history. At the time, they had hinted that a senior official at Malta’s fisheries department could have been facilitating the process.Suspicions had first been roused after a tuna company’s request to increase its export quota by 33 per cent had been waved through by the department without the necessary checks. It was only halted “at ministerial level”, the sources had said.\nSpanish arrests\nSpanish authorities had arrested 79 people across six different regions last June, and their investigations had led them to Malta. El Confidencial’s sources were not very complimentary about Malta.“Activists, high-ranking officials and entrepreneurs in the sector have long described the archipelago as a good place to launder tuna,” the news outlet wrote. “These investigations are lending credence to those rumours”.\nSecond time out\nThis is the second time Dr Fenech Farrugia has been booted from the top fisheries position. She was first removed from the post in 2011, after EU fisheries officials warned that administrative shortcomings could spell the end for Malta’s fisheries sector.\nDr Fenech Farrugia was instead given a plum post within the Competition and Consumer Affairs Authority, where she served as director of enforcement, according to a 2012 government press release.But just two years later, weeks after Labour assumed power, she was reinstalled in the top fisheries department job. That decision had caught several stakeholders by surprise, Times of Malta had reported back in 2013.\nSpeaking later on Tuesday, Nationalist Party MP Jason Azzopardi alluded to her first sacking, asking why the Labour administration had reinstated her. \nDr Fenech Farrugia's suspension was positive, he said, but it begged the question why other officials had not been treated similarly. \n\"It's impossible not to compare her to the corrupt Keith Schembri and the corrupt Konrad Mizzi,\" he said, referring to the two top officials caught with offshore companies. \n\"The Panama Papers went far beyond allegations. Joseph Muscat is applying two weights and two measures\".\nAs director general of the fisheries department, Dr Fenech Farrugia also led the fisheries board, which is tasked with advising the minister on the sector.\nShe also serves on the board of Malta Marittima, a government agency created in 2016 to bring fishing sector stakeholders together.\nIn March 2015 she was made Deputy Chairperson of the Administrative Board of the European Fisheries Control Agency (EFCA).\nOne year later, the French government made her a Chevalier of the National Maritime Order by the President of France.", "comment_count": 227, "id": 1162}, {"keywords": "", "author": "", "article_body": "The Metsola Report establishing a new law which will better protect the Union’s external borders has been approved by the Civil Liberties, Justice and Home Affairs Committee.\nThe approval follows weeks of negotiations with different political groups, as well as stakeholders in the sector, both in Malta and across Europe.\nMEP Roberta Metsola will now lead, on behalf of the European Parliament, the negotiations on the law with governments of EU states. It is expected to be formally passed before May’s EP election.\nDr Metsola, Parliament’s rapporteur on this new law, said: “Malta and Gozo’s location at the southern border of the European Union makes it vulnerable to challenges such as cross-border crime and irregular migration.\n\"Europe has a real-added value in this area. The new law which I guided through the European Parliament will tackle this. In all of this, my guiding principle has been to be fair with those in need of protection, firm with those who do not, and harsh with those who seek to exploit the most vulnerable.”\nThe new revamped European Border and Coast Guard will have a budget of €11.3 billion during the upcoming EU budget period between 2021 and 2027.\nThe new law will see the introduction of 10,000 new border and coast guards who will have the power to fight cross-border crime and deal with individuals who are not eligible to enter the EU’s borders.\nTechnical equipment will also be provided to stop any possible criminal actions taking place at the external borders.\nCrucially, the agency will also be able to introduce antenna offices in member states, such as Malta, to make it easier for the agency to run its operations in the respective member states.\n“This will mean that challenges faced by Malta could be addressed in Malta, and not in an office 3,000 kilometres away, in Warsaw,” Dr Metsola, who is also the EPP Group coordinator within the committee said.\n \n ", "comment_count": 10, "id": 1163}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A new drug dubbed ‘the Trojan Horse of cancer’ has moved on to the final trial phase after proving effective against six types of cancers as part of research led by a Maltese doctor.\nPatients with no other options left, over a quarter with cervical and bladder tumours, nearly 15% with ovarian, oesophageal and lung tumours, and seven per cent with endometrial cancer, responded well to this new treatment.\nThe results of the initial clinical trial of the drug, known as tisotumab vedotin (TV), which was led by a team at the London Institute of Cancer Research and the Royal Marsden, were published in The Lancet Oncology.\nLead author Johann de Bono told Times of Malta that the drug specifically targets cancerous tumours, sparing the ‘good cells’.\nThe treatment does this by combining a chemotherapy agent with an antibody, and just like a Trojan Horse is drawn inside the tumour.\nMechanism targeting the protein tissue factor is novel\nProf. de Bono describes it like a mine that sneakily binds itself to a tumour cell and then blows it up but avoids binding to normal cells.\n“This mechanism targeting the protein tissue factor is novel and it has the potential to treat multiple types of cancers with very poor survival rates,” he said.\nIn his 25 years of experience, he has not seen any treatment working so positively on cervical cancer, Prof. de Bono added.\nAdditionally, its side effects are less aggressive than the typical effects associated with chemotherapy.\nThe results have been so promising that there has now been investment in the next stage of international research trials to take the drug to registration phase, he said.\nTV is now being trialled in other cancer types, including pancreatic, bowel, head and neck, and the research will also look at the drug as a second-line treatment for cervical cancer.\nLast year, Prof. de Bono, who spearheaded a breakthrough in the fight against prostate cancer, was awarded a prestigious professorship by Queen Elizabeth.\nThe professorship celebrated Prof. de Bono’s world-leadingresearch in the clinical development of cancer treatment.\nLondon’s Institute of Cancer Research, where he heads the clinical studies division, was one of only 12 across the United Kingdom to be awarded the Regius Professorship, marking the Queen’s 90th birthday.\nThe award fell on the 10th anniversary of the news that a team of British researchers, headed by Prof. de Bono, had made a dramatic breakthrough following drug tests that began at the Royal Marsden Hospital.", "comment_count": 27, "id": 1164}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says that according to a Council of Europe report, there is a “notable lack of credible indications” that the Maltese authorities are diligently investigating who could have planned and commissioned the killing of Daphne Caruana Galizia. In another story, the newspaper says a new drug dubbed ‘the Trojan Horse of cancer’ has moved on to the final trial phase after proving effective against six types of cancers as part of research led by a Maltese doctor. \nThe Malta Independent says Transport Minister Ian Borg is expected to receive the fuel stations policy review soon.\nL-Orizzont quotes Malta Hotels and Restaurants president Tony Zahra saying Malta should be a quality and not a mass tourism destination.\nIn-Nazzjon leads with a meeting PN leader Adrian Delia had with the Malta Union of Teachers.", "comment_count": 0, "id": 1165}, {"keywords": "", "author": "Denise Grech ", "article_body": "There was a “notable lack of credible indications” that Maltese authorities were diligently investigating who could have planned and commissioned the killing of Daphne Caruana Galizia, a Council of Europe report on the media said.\nThe first annual report assessing media freedom threats to Council of Europe member states is being published on Tuesday. It was compiled by partner organisations of the Council of Europe’s Platform for the Protection of Journalism and Safety of Journalists. The partner organisations include Reporters Without Borders and the International Federation of Journalists.\nThe report warned that, despite three suspects being detained in December 2017, there were no “credible indications” that those who commissioned Ms Caruana Galizia’s killing were being investigated.\nThat task, the report argued, called for a thorough and impartial examination of leads arising from the journalist’s reporting on high-level financial crimes and other forms of wrongdoing.\nMurders raised public and official awareness in the EU\nMs Caruana Galizia’s work often implicated leading political and business figures, the report added.\nThe report also noted Ms Caruana Galizia was facing over 30 defamation lawsuits at the time of her death, many of which remain pending.\n“The continued pursuit of many of those cases by the plaintiffs, including government officials, illustrates a deep structural injustice,” the report warned.\nMs Caruana Galizia’s murder and the assassination of Slovak journalist Jan Kuciak “dramatically raised public and official awareness in the EU of the twin crisis of journalist safety and impunity that has already taken root within the bloc, as well as in other parts of the Council of Europe area”.\nIt added that, while Malta’s decision to repeal its criminal defamation law was positive, other journalists in Europe were still facing jail sentences for defamation, or for insulting the head of state.\n“Public officials and politicians must display a greater degree of tolerance toward criticism,” the report added.\nData on media freedom alerts sent to Council of Europe member states was also published.\nThe state was the source of the threat to journalists in 57% of the alerts received last year.\nOf the remaining threats, 21% originated from non-State actors, and 22% of them originated from an unknown source, figures showed.", "comment_count": 40, "id": 1166}, {"keywords": "", "author": "Sarah Carabott", "article_body": "\"The devil’s daughter\", \"spawn of Satan\", \"bitch\", \"slut\"… these are just a few of the salacious adjectives used to describe Lara Dimitrijevic by some online commentators.\nOthers claim they are ready to shoot or burn the director of the Women’s Rights Foundation, who recently came under fire after calling for worldwide-recognised reproductive rights in Malta.\nRead: Women should have access to abortion in at least four circumstances - paper says\nThis is just one of the issues that the WRF speaks out about - the organisation raises awareness about human trafficking and also provides free legal advice and initial legal representation to survivors of domestic violence and sexual assault.\nBut this does not seem to go down well with all, including one man who believed Dr Dimitrijevic and others like her are \"in the same category as Isis”.\nDr Dimitrijevic’s reaction to this hate speech? She believes that while everybody had a right to express their opinion, when their message became one of hatred they were neither doing any good to themselves nor anyone else.\nDr Dimitrijevic is among those featured in the Times of Malta #stophate campaign, which sees personalities reading out the hate messages levelled out at them on social media.\nRead: Malta has highest online hate speech in EU - Eurobarometer\nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com\nWatch: ‘I wish migrants would rape your wife’ - Peppi\nWatch: ‘You will go down like Daphne’ - Godfrey Farrugia\n ", "comment_count": 225, "id": 1167}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat has had talks about Brexit with UK Prime Minister Theresa May in London.\nThe two prime ministers discussed the latest developments on the United Kingdom’s exit from the European Union, the Malta government said. \nDr Muscat was in London to meet a number of potential investors who are considering Malta as a destination for their business.\nREAD: 'You have nothing to worry about': Muscat's Brexit reassurance to Britons in Malta", "comment_count": 15, "id": 1168}, {"keywords": "", "author": "", "article_body": "Sea-Watch e.V, operators of the Sea Watch migrant rescue ship, have filed a constitutional application demanding compensation from the government after their vessel was held in Grand Harbour for four months last year.\nThe NGO said Transport Malta's action was illegal and abusive. It happened at the same time as another two rescue ships were also held by Malta, showing that Transport Malta's action was only taken to assist the government in its efforts to stop the operation of migrant rescue missions by NGOs.\nWhen the Sea Watch was eventually allowed to leave, nothing had changed in its legal status since the day it was blocked in harbour, NGO observed. \nIt therefore demanded compensation for having been denied enjoyment of its property.\nLawyers Cedric and Catherine Mifsud signed the application.", "comment_count": 8, "id": 1169}, {"keywords": "", "author": "", "article_body": "Various studies concerning a gas pipeline connecting Malta to the European gas network via Sicily are progressing, Energy Minister Joe Mizzi told parliament on Monday. \nReplying to a question by Labour MP Rosianne Cutajar, he said that a marine survey commissioned to consider the route which the pipeline would take was close to being concluded.\nhttps://www.timesofmalta.com/articles/view/20181110/local/three-new-studies-on-malta-sicily-gas-pipeline.693906\nThe gas pipeline project is being carried out by the Maltese government in collaboration with Italian authorities.\nProjected to cost around €350 million, the pipeline will supply the Electrogas power station with LNG, replacing the temporary floating storage bunker currently berthed in Marsaxalokk. It will be approximately 160km long starting in Gela. \nIdentified as a European “project of common interest,” under a plan to improve North to South gas connections in the West of Europe, the project is slated to be concluded in 2024, and will have a capacity far exceeding the power station's current fuel requirements.\nAccording to the Energy and Water Agency, the project would “end Malta’s isolation from the Trans-European gas network,” contributing to the country’s security of energy supply. ", "comment_count": 2, "id": 1170}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 9.25pm - \nThe European Parliament committee tasked with monitoring the rule of law in Malta has called on the government to stop its passport sales contract with Henley & Partners and to publish the Egrant inquiry report in full.\nThe call was made at a meeting of the European Parliament’s Civil Liberties, Justice and Home Affairs committee (Libe) in Strasbourg on Monday evening.\nIn a resolution, the committee said it also considered of “utmost importance” a solution for a memorial site in Valletta for Daphne Caruana Galizia so as to allow unhindered remembrance.\nThe use of the Great Siege monument as a memorial to the slain journalist has been an ongoing tussle between activists and the authorities.\nThe committee said a solution, reached in association with the Caruana Galizia family and civil society, would be an important step in healing the rift in society,\nDutch MEP Sophia in't Veld who presented the draft resolution, reiterated the committee’s call on government members to withdraw libel cases being faced by the mourning Caruana Galiza family. They have enough grief to deal with, she insisted.\nAddressing the debate about the resolution, PN MEP Roberta Metsola said she “has never and will never be shut up by little populists banging their fists to try to intimidate us into silence.”\nThe resolution, she said, gave a stark picture of the situation under the current government.\nShe also backed a call for the implementation of the Venice Commission proposals for constitutional changes to improve the rule of law in Malta.  \nDr Metsola called for an annual rule of law mechanism that put all member states under the same scrutiny.\nPL MEP Miriam Dalli also referred to the Venice Commission, noting however, that the resolution seemed to disregard the fact that the commission itself had called for a public discussion about the recommendations.\nReacting to the call for a public inquiry into the murder of Ms Caruana Galizia, Dr Dalli said the government had never dismissed this possibility, but a public inquiry could not be held while a magisterial one was under way.\nMeanwhile, the main conclusions of the Egrant inquiry had been published - the non-publication of the whole report was in line with advice given by the Attorney General, she added. ", "comment_count": 204, "id": 1171}, {"keywords": "", "author": "", "article_body": "Updated 9pm \nJustice Minister Owen Bonnici on Monday hit back at claims that the rule of law is failing in Malta when he replied to questions from MEPs at an exchange of views in the financial crimes committee known at Tax3,\nDr Bonnici said the government was committed to a continuous process of reform and would maintain open dialogue with the European Commission and other institutions.\nIn his opening remarks, Dr Bonnici also hit back at concerns about money-laundering and tax evasion in Malta.\nHe said €12.5 million had been recovered through the Inland Revenue Department’s Swiss Leaks investigations and five million euro from its Panama Papers investigations. The department also recovered a further four million euro in penalties.\nFacing questions by firebrand MEP Ana Gomez about the “corrupt” Keith Schembri and Konrad Mizzi, Dr Bonnici said two major inquiries had concluded there were no grounds to proceed against these people.\nMr Schembri and Dr Mizzi were revealed in the Panama Papers as having formed offshore companies that were set to receive up to $2 million from a mystery Dubai company called 17 Black.\nOne MEP pointed out during the committee meeting that Ms Caruana Galizia was killed a few months after first naming 17 Black on her blog.\nThe Justice Minister assured that the government would continue to seek the mastermind behind Daphne Caruana Galizia’s murder.\nSwedish MEP Gunnar Hokmark expressed his exasperation at Dr Bonnici’s attempts to portray a message that there were no problems in Malta.\n“In spite of all these events about golden visas, money-laundering, problems with tax evasion...don’t you think it is a problem that people under investigation can be granted government contracts. Isn’t this a problem for Malta?\n“Is that your message? It makes me concerned that you are not concerned. The whole worl is looking at Malta”, Mr Hokmark said.\nDr Bonnici hit back by saying he did not believe in absolutes.He said he believed in Malta’s institutions and had provided facts about what was being done to improve them.\nReuter’s special correspondent Stephen Grey said no one had yet been indicted for Ms Caruana Galizia’s murder and one was no closer to knowing who the masterminds were.\nMr Grey said information identifying power station investor Yorgen Fenech as the owner of 17 Black had been passed on to the local police in spring 2018.\nMs Caruana Galizia’s son Matthew told the committee that his mother was killed while working full-time on investigations into Mr Schembri, Dr Mizzi, Prime Minister Joseph Muscat, Mr Fenech and countless others.\nMr Caruana Galizia said the power station selection committee was personally chaired by Brian Tonna, Mr Schembri’s personal accountant.\nHe said the Electrogas deal had been described to him in private briefings with foreign intelligence services as “completely corrupt”.\nMr Caruana Galizia said Azerbaijan’s state-owned energy company Socar pocketed millions from the Electrogas deal for merely playing the role of a middle-man.\nThe former journalist said he was working with his mother before her death to receive a huge data leak from Electrogas by a whistleblower.\nMr Caruana Galizia said the three unemployed men who had been arrested for his mother’s murder had gambled over €500,000 in Mr Fenech’s casinos\nHe said government officials’ sole mission now was to cover up corruption and his mother’s death in Malta.\nMr Caruana Galizia’s called for the setting up of a Europol team to investigate Azeri corruption across Europe.\nDuring question time, MEP David Casa said a leaked FIAU report had clearly called for a money-laundering report into Dr Mizzi.\nHe also questioned if there was any link between Ms Caruana Galizia’s death and the 17 Black scandal.\nWatch the proceedings on video above.\n ", "comment_count": 83, "id": 1172}, {"keywords": "", "author": "Keith Micallef", "article_body": "A half-baked attempt by the Armier campsite administrator to remove illegal structures backfired spectacularly after the authorities learned this was just a ploy to shift them to another part of the complex.\nThe Planning Authority ordered the administrator to reverse the action taken that same day and put the caravans back in their original spot at his own expense.\nKnown as mobile homes, the structures are the subject of a pending enforcement notice issued last October, which comprised a long list of breaches. The site is administered by Vince Vella, director of Adventure Camping and Leisure Limited.\nWhen the static caravans became “fixed residences”, the enforcement notice was issued on grounds that a number of structures had been placed outside the site’s footprint in breach of the planning permit issued in 2004.\nOther issues flagged were irregularities with respect to the approved plan, which stated that a quarter of the site had to be dedicated to camping facilities, a fifth for mobile caravans and one sixth had to be landscaped. In reality, over the years the complex gradually morphed into a conglomeration of mobile homes crammed close to each other.\nAround 70 people have claimed they were 'conned' into buying one of the mobile homes.\nThough the administrator had filed an appeal, which is still pending, Times of Malta was alerted last Wednesday that an operation to remove mobile caravans located outside the complex’s footprint was taking place.\nThe large structures, some of which were about 10 metres in length and three metres wide, were laboriously hoisted by a large crane and then towed away.\nHowever, rather than being removed, these mobile homes were being relocated to another part of the complex. The plot thickened when, in the afternoon, the structures were returned to their original spot.\nRead: Armier campsites being 'used as fixed addresses'\nThough by the time of writing no explanation was given by Malta Campsite, the planning watchdog confirmed it had intervened.\nA spokesman told the Times of Malta the campsite administrator had taken the initiative to start complying with one of the infringements listed in the enforcement notice, placing structures beyond the permitted boundary.\n“Instead of completely removing these structures from within the site to another permissible location, the contravener simply opted to move the structures within the same site area, thus breaching the existing enforcement notice,” the spokesman said.\nHe said that, in the circumstances, the PA informed the administrator the notice obliged him to completely remove the structures from on the site and not simply shift them to another area there, he added.\nThe Sunday Times of Malta reported in November that over 70 ‘tenants’ were claiming to have been “conned” into buying the expensive mobile homes costing about €30,000 each. Caravan enthusiasts reported they had been sold the structures through a written agreement, which specified a yearly payment of about €20 per square metre of leased land. They claimed they the only learned that such a deal was not allowed when the enforcement notice was issued.\nMr Vella denied the claims, saying he always acted in good faith.\nThe PA confirmed it had stepped in after getting wind of the homes being moved.", "comment_count": 20, "id": 1173}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta’s drivers are not particularly known for their sense of courtesy. A scientific study sought to identify the best and the worst of them, writes Philip Leone-Ganado.\nIf you have ever got the feeling that certain types of drivers are nicer to you on the road than others, you may now have the science to back you up.\nAccording to a study published in the latest edition of the Maltese scientific journal Xjenza, men in luxury cars, trucks or vans are the least likely to show courtesy to other drivers – while men over 40 driving family saloons are the nicest group on the road.\nStudy authors Edward Attard-Montalto from Bath University and Simon Attard-Montalto from the University of Malta spent 88 schooldays driving towards a congested roundabout from a feeder road, where they did not have right of way, and noting whether drivers on the main road let them pass.\nIn their analysis, carried out during morning rush-hour over a six-month period, they recorded the car’s make and model, the driver’s gender and estimated age, and whether any passengers were in the car, as well as the weather conditions at the time.\nTo standardise the test, they used the same car each time: a beat-up 1998 Opel Corsa. The occupants, described as a middle-aged male driver and teenage passenger, were also the same throughout.\nWhat the authors found was that out of 185 interactions they analysed, just 43 drivers – less than a quarter – allowed what they call “courteous access”.\nLuxury car, truck and van drivers were the least likely to afford courteous access\nDrivers’ gender, weather conditions and the presence or absence of other adults or children in the car all seemed to have little bearing, with statistically similar results in all cases.\nBut vehicle type pointed to some significant differences: drivers of medium-sized saloons tended to be more likely to let the testers pass than those in small-sized cars, luxury vehicles, trucks or vans.\nOf the 48 saloons in the study, 18 drivers – 37.5 per cent – allowed access and 30 did not. By comparison, small cars gave way just 22 per cent of the time, and luxury or work vehicles just 11 per cent.\nCombining vehicle type with the drivers’ gender and age revealed even starker differences. Men older than 40 in medium-sized saloons let the other car through more than 40 per cent of the time, while male drivers of large and work vehicles fared worst: just two from 28 showed courtesy.\n“This study confirms objectively the previously subjective impression that, in Malta, some drivers are more courteous than others,” the authors said.\n“The key finding that males over 40 years driving family saloons were the most courteous, whilst luxury car, truck and van drivers were the least likely to afford courteous access, was in line with the previous subjective personal experience of the driver.”\nThey also acknowledge that the results may have been varied with a different location, time of day, or if a flashier car had been used, and suggest a wider study that could analyse more driver-car combinations.\nSo are Maltese drivers the hot-headed sort they are often perceived as?\n“Although this study does not support or refute this bold and rather negative generalisation, it also suggests a lack of courtesy on Malta’s roads,” the authors conclude.\n“In this regard, in contrast to Malta’s general reputation for friendliness and hospitality, there appears to be room for improvement.”", "comment_count": 49, "id": 1174}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The government is seeking to purchase an anti-cervical cancer vaccine that may offer less protection than one placed recently on the market, according to pharmaceutical industry sources.\nThe State provides protection against HPV (human papillomaviruses) to girls aged 12 through what is known as a bivalent vaccine.\nThe jab protects against infection with two types of HPV. However, the sources pointed out, there is another vaccine that covers four types of HPV and an even newer one – known as nonavalent – protecting against infection from nine different types.\nA call for tenders for the procurement of the vaccine, issued last month, only demands that the vaccine supplied is licensed to be administered according to a two-dose schedule among 12-year-old children.\nThis means, the sources pointed out, that the currently-administered bivalent vaccine can be chosen in the tendering process, as could the nonavalent vaccine. However, the former is cheaper and going for it could risk vaccinating Maltese girls with an older generation jab that offers less protection, they added.\nThe sole tender award criterion is the price, the sources noted.\nThey said the nonavalent vaccine has been adopted by several countries, including most European ones such as Croatia, Italy, Belgium, Bulgaria, Denmark, Estonia, France, Germany, Cyprus, Greece, Hungary, Ireland, Liechtenstein, Lithuania, Luxembourg, Portugal, Slovenia, Spain, Sweden, Switzerland and the UK.\nVaccine with a coverage rate of 82.5 per cent\nThe topic of HPV vaccination and whether it is time for change came up during last year’s Malta Medical School Conference.\nOne of the presentations made during the event questioned whether the national immunisation programme should change from bivalent to nonavalent vaccine.\nWhen contacted, a Health Department spokesman said there were plans to procure the nonavalent HPV vaccine, however it was unclear when this would take place.\n“The HPV vaccine was introduced in the national schedule in 2013. Last year, the vaccine had a coverage rate of 82.5 per cent,” a Health Ministry spokeswoman said, adding that, along the years, the advisory committee on immunisation policy worked on various changes to the national schedule in line with evidence and local epidemiology of vaccine preventable diseases.\nThe advisory committee is working on changes “for the near future”, among them the introduction of the pneumococcal vaccine and amendment of the HPV vaccination.\n“In fact, the Health Department intends to procure the nonavalent HPV vaccine for inclusion in its vaccination schedule,” she said.\nAsked to specify when the nonavalent vaccine would be included in the schedule, whether through the current tender or in 36 months’ time, when it is time for a new one, Times of Malta was told that a clarification would be issued.\nStill, no clarification specifying that the tender is calling for nonavalent vaccines has been issued so far.\nThe spokeswoman said the department’s intention is to abide by clinical recommendations as to which specific type of HPV vaccine to procure.\nAsked whether this meant the department would, therefore, be going for the cheaper vaccine, in line with the tender criteria, the spokeswoman repeated the same reply.", "comment_count": 2, "id": 1175}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A school's assistant head described in court on Monday how a man entered her school and \"rained punches\" on a boy who had allegedly been involved in a brawl with another pupil.\nThe assistant head tried to stop the man but was thrown off her feet and suffered a fracture in her lower back.\nThe incident broke out in Pembroke school last week.\nFeliciano and Alexander Camilleri, the father and uncle of one of the pupils have been accused of assaulting members of staff and a 15-year-old boy.\nThe tall, 15-year-old Arab boy himself was warned by a magistrate to seek legal advice before testifying since he is likely to also face charges over his alleged attack upon a fellow-student, the son of one of the accused. \nREAD: Boy in hospital with head injuries after attack at Pembroke secondary school\nA number of school officials took the witness stand to recount the events of the day.\nOne of the school’s assistant heads said she heard shouting outside her office.\nSuddenly, the door banged open and a number of people spilled inside including the co-accused.\n“I saw Alexander Camilleri hold a person in a headlock under his right arm. I realised it was a student because I spotted the orange uniform,” the woman explained, adding that all the while, the man was raining blows with his left fist upon the student held tightly under his right arm.\n“You don’t touch my boy,” she heard the man telling the boy under his grip.\nAs the teacher moved forward to break up the two, the man suddenly grabbed a heavy-duty puncher and swung it round, striking a male learning support assistant who happened to be standing right behind him.\nThe assistant head went on to explain how the man lifted her off her feet, causing her to fall backwards landing on the floor in a heap. He returned to her feet, attempting to calm down the angry man who, however, would have none of it.\n“Leave me alone. X’nikkalma nikkalma,” he replied. “They can call me a criminal and a racist. I hate Arabs,” he shouted while his brother, Feliciano, guided his 13-year old son away from the scene. \nThe woman said she suffered a fractured bone in her lower spine and a bump on the head, as certified under medical examination later in hospital.\nThe learning support assistant who had been knocked on the forehead by the puncher-wielding uncle, recalled how he had first spotted the two men entering the school close to the main staircase.\n“What are you doing here?” he had asked.\n“Something happened to our boy,” was the reply, prompting the school official to lead the men to an assistant head’s office at first floor.\nA while later, shouts from the direction of the clerks’ office could be heard. Looking inside, he saw an assistant head and a student on the floor.\nAs he moved forward to grab the metal puncher out of the man’s hand, he was hit on the forehead and could not recall much else because \"I was in a state of shock.” He recalled blanking out and suffering headaches which kept him away from work for the rest of the week.\nUnder cross-examination, the LSA said he had observed the Arab boy saying something to the two men outside the clerks’ office. The boy had also made a gesture as though to take off his jacket.\n“Was he going to attack the parent?” lawyer Franco Debono asked.\nThe LSA explained: “It could be. From what I saw yes. They didn’t start fighting. I was looking from a distance,” the teacher explained, adding he had been walking away when loud shouting from the office had brought him rushing back.\nAsked by lawyer Arthur Azzopardi to confirm how he had been hit by the puncher, the witness said the man’s action had not been intentional.\nAnother assistant head explained how towards the end of school break, close to 11am, he had been approached by the health and safety teacher with the names of two pupils just involved in a fight.\nOne boy, aged 13, was being treated medically after being punched in the face by an older student whom the witness called out from a Physics class, taking him to clerks’ office to await the arrival of his mother who had been alerted over the punch up.\nThe younger boy, who had allegedly suffered the punches, was also present, the witness went on, explaining how three men suddenly turned up, two of them (the co-accused) in a temper, approaching the injured boy, asking: “Who was it? What happened?”\nIn spite of efforts by school officials and the third man to calm down the evidently angry men, the matter soon escalated as the Arab student made as though to remove his jacket. “He did not seem scared. Rather than stand back, he stood his ground,” the witness explained.\nIt was then that Alexander Camilleri allegedly rushed towards the defiant boy, seizing him in a headlock, with both of them tumbling to the ground, while the third man did his best to calm matters.\nSchool staff managed to direct the boy into a kitchenette adjoining the office and close the door to distance him from the uncle and father.\nThe witness acknowledged that schools were currently facing racial difficulties, since same nationality students tended to show solidarity whenever one of them happened to be involved in some argument, rallying around “to lend a hand.”\nThe witness finally recalled how one of the co-accused had vouched that “Ma jibqax wieħed iswed go din l-iskola. (we'll get rid of all black people in this school)”\nA clerk recalled how she had phoned 112 for help, giving directions to the person on the other side of the line, when she suddenly found herself facing the angry man and trying to wrestle the metal puncher from his grip.\nAt the end of the lengthy hearing, the court upheld a fresh request for bail ordering the accused to sign the bail book once a week and strongly warning them to steer clear of the school or “that boy.”\nFeliciano Camilleri was granted bail against a deposit of €2,000 and a personal guarantee of €3,000, while Alexander Camilleri was bailed against a deposit of €2,500 and personal guarantee of €2,500.\n“Don’t make matters worse,” was the court’s final warning.\nLawyers Franco Debono, Arthur Azzopardi, Alfred Abela and Rene Darmanin were defence counsel.\nLawyer Joseph Giglio appeared parte civile for the injured assistant head.", "comment_count": 0, "id": 1176}, {"keywords": "", "author": "Ivan Martin", "article_body": "Measures to increase security in schools were finally being taken but only after two serious incidents were reported in the media, the Teachers’ Union said on Monday.\nSpeaking during a meeting with the Nationalist Party, MUT President Marco Bonnici said he was informed that the government was finally moving to commission a plan to increase school security, but this had come long after the union first called for it.\nIt was also not enough to address teachers' fears as only around a dozen of Malta's schools would be covered through this call, he said.\n“We have been insisting on the need for this plan for years. Now after two serious incidents were reported in the media, the government is waking up to this,” Mr Bonnici said, adding that another two incident had occurred but had not been picked up by the media.\nToday’s meeting was called after two men were arraigned last Wednesday in connection with an incident at the Pembroke secondary school that allegedly occurred after a 15-year-old boy had to be hospitalised following an assault by another student.\nREAD: Man held pupil in head lock and rained blows on him in school office, court told\nA student and a school official were involved in a fight at St Ignatius College secondary school, in Qormi, the day after.\nOn Monday morning, Education Minister Evarist Bartolo took to social media to launch a direct appeal to parents to stop aggression against teachers. \nTeachers have also warned in recent days that understaffing and trickle-down of institutional frustration was leading to growing tension between students.\n“These are issues that we have long been flagging, but we were told we were exaggerating. Unfortunately the authorities seem to prefer being reactive rather than proactive. Do we have to wait until something really serious happens before we really wake up?” Mr Bonnici said.\nHe said the union was informed that the government was currently carrying out a security audit of a number of schools, but condemned what he described as “crisis management” by the education authorities.\nPN concerned over lack of planning\nOn his part, PN leader Adrian Delia said he was concerned about the government’s apparent lack of planning for the sector.\n“The government’s plan, if it even has one, when it comes to education, it simply not good enough. It is also alarming that educators are clearly not being involved in a holistic manner,” he said.\nThe PN, Dr Delia said, hoped it would not have to witness a “worst case scenario” play out at one of Malta’s schools, due to a lack of security.\nThe party was also concerned about the number of teachers opting to drop out of the profession due to poor conditions.\nTeachers have said they dread going back to school.\nNine in 10 teachers experience aggression\nMeanwhile, Mr Bonnici said the teacher’s union had warned of these problems months ago when it released a study suggesting around 90 per cent of teachers had experienced aggression at the work place.\nThe figure emerged from an anonymous survey of 183 respondents. \n“Again we were told it was not true, that the figures were blown out of proportion, but we are being proven right,” he said.\nTeachers’ union officials met with Education Minister Evarist Bartolo last week and made a series of proposals. These included stepping up security at schools, reviewing physical access and ensuring concrete intervention in situations caused by mental health issues and substance abuse, among other things.\nThe government has said it would be fast-tracking the introduction of harsher penalties for violence in schools. Fines could be as high as €5,000.", "comment_count": 8, "id": 1177}, {"keywords": "", "author": "", "article_body": "Education minister Evarist Bartolo has appealed directly to parents to stop aggression towards educators, after a series of violent incidents in recent weeks.“The upbringing and education of our children is the responsibility of both parents and educators. It is unacceptable that what we accomplish on one side is undermined on the other,” Mr Bartolo said in a video message uploaded to the ministry’s Facebook page on Monday. “As parents, it is your duty to work hand-in-hand with educators. It is unacceptable for parents or other relatives to step into schools displaying aggressive or violent behaviour and we will take all necessary measures against such behaviour.“Otherwise, instead of educating our children, we will be exposing them to scandalous behaviour.”The minister’s appeal follows at least two violent incidents involving students, parents and school officials last week.It is unacceptable that what we accomplish on one side is undermined on the otherTwo men were arraigned after allegedly injuring two school officials and a boy in an incident at a Pembroke secondary school last Monday, following a fight between two students, one of whom was hospitalised. A day later, a student and a school official were involved in a fight at the St Ignatius College secondary school in Qormi. Nobody was injured or arrested.The Malta Union of Teachers said a further two cases had also been reported to the authorities.The union has said teachers are dreading going to work as such incidents go from rare to common occurrences. MUT officials have called for stepping-up of school security, reviewing physical access and ensuring concrete intervention in situations caused by mental health issues and substance abuse, among other things.The Education ministry said it would be fast-tracking the introduction of harsher penalties, potentially including fines as high as €5,000, for violence in schools.", "comment_count": 26, "id": 1178}, {"keywords": "", "author": "", "article_body": "Updated 7.45pm - Some 150 migrants have been picked up by the Libyan Coastguard from a drifting boat and are being taken back to Libya, from where they had departed, Italian Home Affairs Minister Matteo Salvini said on Monday evening.\nEarlier, the NGO Alarm Phone expressed its concern over the migrants and said the Maltese and Italian maritime rescue authorities have been alerted about them.\nThe boat, which Alarm Phone said was believed to be carrying “50-60 women and 30 children”, was drifting after its engine stopped working.  \nAn Armed Forces of Malta representative said that they had been alerted to the boat and were keeping tabs on it. It was however not in Malta’s area of jurisdiction, the spokesperson said.\nNo migrant rescue vessels are currently operating in the Mediterranean. The Sea-Watch 3, which was the last remaining ship carrying out rescues, is currently stuck in Catania. Another vessel, the Alan Kurdi – formerly Sea-Eye- is expected to resume operations in a few weeks.\nWith no NGO vessels currently in operation and no sign of a coast guard vessel coming to the rescue, Alarm Phone said the situation further disproved the “pull factor myth”.\nEuropean governments have often suggested that having NGOs running sea rescue operations in the Mediterranean only serves to attract further migrants to undertake the dangerous crossing.\nItaly’s deputy prime minister, Matteo Salvini, has gone as far as calling the NGOs “taxis for human traffickers”.\nFigures released by UNCHR last month revealed that while the number of people crossing the central Mediterranean has declined from previous years, the journey is more dangerous than ever, with an average of six people dying while trying to cross the sea every single day.", "comment_count": 0, "id": 1179}, {"keywords": "", "author": "", "article_body": "The number of housing units went up by 26,000 between 2011 and 2018, according to an analysis by the Central Bank of Malta which tried to assess the present housing stock.\nAt 250,000, the stock is double the amount reported in 1985, although the growth rate is still not as high as that seen before the crisis period of 2008/2009.\n\nHowever, there may be another story hidden within the figures: the 2011 census had found 71,080 vacant properties, of which 41,232 were not being used either seasonally or as second homes.\n“Little is known on the status on these units today, yet a booming property market with rising rents and a number of incentives introduced by the government to rehabilitate buildings in urban core areas have introduced strong incentives on owners to put such properties on the market,” the report said.\nThe analysis was put together by the bank’s principal research economist William Gatt, who stressed that he had to make a number of assumptions which imposed a degree of uncertainty on the findings.\nStarting from the 2011 census, when 223,850 units were logged, he used Planning Authority data to estimate the number of units added to the stock, taking into account not only new builds, but also conversions and re-development.\n\nHe noted that demand had grown considerably but that there was usually a time lag before the sector reaction. Since 2013, there was a strong pick-up in permit approvals, with construction itself tending take an average of one year, which added to the delay in the provision of properties.\n“The growth in the housing stock accelerated only after 2015,” the report says.", "comment_count": 6, "id": 1180}, {"keywords": "", "author": "", "article_body": "A Nadur woman suffered foot injuries when she was hit by her own car on the Coast Road on Monday morning. \nThe police said the woman, 32 of Nadur, was standing outside her Peugeot 807 when the vehicle suddenly rolled forward, hitting her and causing her foot injuries.\nThe woman was given medical assistance on site before being taken to hospital.\n ", "comment_count": 0, "id": 1181}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The Gozo Ministry is drawing up environmentally-sustainable plans to shelter the only surviving Roman catacombs in Gozo, the Times of Malta is informed.\nThe land around and above the paleochristian hypogea, known as Għar Gerduf, is being expropriated and the remains will be opened to the public following rehabilitation.\nWhen contacted, a Gozo Ministry spokesman noted that, as committed in its electoral manifesto, the government was investing in the restoration and upkeep of Gozo’s natural and cultural heritage. Għar Gerduf was among such sites.\n“The Gozo Ministry is now preparing environmentally sustainable plans that will be submitted to the Planning Authority for the sheltering of historical remains in the premises and for the creation of minimal amenities to strengthen its touristic value,” he said. Further research on the natural aspect of the site is also being considered.\nRead: 'Unrecorded historical remains in Gozo is worrying'\nTwo of the initial designs presented to the government for consideration at this early stage of the project show a pathway leading to the catacombs, situated in caves surrounded by fields. In the meantime, different funding options for the project are being analysed.\n\nThe area, measuring about 766 square metres in all, is being expropriated at a cost of more than €400,000, according to a notice in The Malta Government Gazette.\nHowever, Gozitan NGO Wirt Għawdex is still concerned that the area in front of the catacombs will remain in private hands and, therefore, development attempts could be made there in the future.\nWirt Għawdex had called for the expropriation of the area in the past and its efforts were boosted in 2017 after excavation works started on foundation trenches for a two-storey house planned to be built in front of the catacombs.\nThe area around the catacombs was spared development after the Planning Authority revoked the planning permission that same month.", "comment_count": 1, "id": 1182}, {"keywords": "", "author": "Ivan Martin", "article_body": "Upgrades to the reverse osmosis trains in Pembroke will reduce the amount of electricity required to run the plant, resulting in annual savings of €421,596.\nThis is one of the projects being undertaken by the Water Services Corporation, which is also laying around 3,000 tonnes of pipework and fittings through the subterranean tunnel that will upgrade the island's water supply ensuring uniform quality across the island. \nEnergy Minister Joe Mizzi and EU Funds Parliamentary Secretary Aaron Farrugia on Monday visited the 9.5km tunnel being drilled from the Pembroke Reverse Osmosis plant to the Ta’ Qali Reservoirs.\nThe project aims to improve the overall water quality in many parts of Malta and improve operational efficiency and environmental sustainability.\nUpdates on this project’s progress were given by Water Services Corporation chief executive Richard Bilocca.\nRead: Tap water to be same quality everywhere  \nThe subterranean tunnel will house two pipelines, one to deliver water to Ta' Qali and the other will be used to supply high quality blended water to the central part of the island through a centralised hub feeding mainly via gravity – no need of pumps.\nThe production and supply of the large diameter glass fibre reinforced plastic pipes inside the tunnel is entrusted to Turkish company Superlit Boru Sanayi A.S which has vast experience in the field. \nWatch: Tap water revolution in the pipeline\nTap water will be the same quality all across the island\nTunnel boring works are being carried out by Bonnici Bros. Services Ltd.\nThe tunnel will link the largest reverse osmosis plant in Pembroke to the Ta’ Qali group of reservoirs via large diameter 1.2-meter mains.\nRead: Malta has one month water supply in case of emergency\nThe pipeline will increase water blending potential and reduce the amount of energy required to pump water across the island to the \"barest minimum\".\nThe significant reduction of pumping losses will also mean crucial savings in electricity used for pumping as well as hundreds of tonnes of CO2 per year.\n ", "comment_count": 10, "id": 1183}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A foreigner living in Malta illegally attempted to steal goods from a Mellieħa supermarket to feed himself and his pregnant girlfriend.\nSerbian-born Alb Aleksandar, 33, who had been living illegally in Malta for the past two years, was stopped last Saturday afternoon by staff at the supermarket after he was caught trying to leave without paying.\nProsecuting inspector Godwin Scerri told the court that the police had been called in after the customer was stopped and confronted by supermarket staff. The value of the goods amounted to €167, the court was told.\nThe man was later arrested, admitting to the police that he has been trying to steal because he had no money left, was jobless and had a pregnant girlfriend to sustain.\nInvestigations revealed that the accused had been residing illegally in Malta for the past two years, with no traces of his presence being registered on official records.\nInspector Scerri informed the court, presided over by magistrate Natasha Galea Sciberras, that the man was to be deported once the proceedings were over.\nIn view of the man’s guilty plea, bearing in mind that no items had actually been stolen, that the man had fully cooperated with the police and that he was to be removed from the island, the court declared him guilty and condemned him to a 1-month jail term suspended for one year.\nLawyer Martha Mifsud was defence counsel.", "comment_count": 0, "id": 1184}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Spending on social benefits has dropped by €24 million since the introduction of the benefits tapering scheme four years ago, according to government figures. Around €55.5 million was spent last year on social benefits, compared to €79.6 million in 2014, a drop from 0.94 per cent of the GDP to 0.45 per cent.The benefit tapering scheme provides support to people who enter the employment market after having been on unemployment assistance, social assistance or single parent benefits. New employees receive 65 per cent of their previous benefits in their first year on the job, which tapers down gradually over three years. Jobsplus executive chairman Clyde Caruana said that in the four years since the scheme was introduced, the number of people relying on social benefits had dropped by around 39 per cent overall. These figures, he said, were close to what had been achieved in the UK over a much longer time-frame, since the introduction of similar measures back in 1999.Society is facing new risks that the welfare system is not equipped to care forMr Caruana said the scheme’s introduction followed research into what would constitute a so-called reservation wage, the minimum that a person would accept to take up a job. For a 30-year old with one child, the research found that this amounted to €10,921, which is €1,600 higher than the national minimum wage. Mr Caruana added, however, that society was facing new risks that the welfare system was not equipped to care for, such as technological change, social exclusion and the rise of single-parent households. “Welfare change must be ongoing to prevent unnecessary hardship,” he said.Social solidarity minister Michael Falzon said the scheme had led to tangible benefits in people’s lives, with those receiving unemployment benefits down from around 4,000 to 800. Women made up more than two-thirds of those benefitting from the tapering scheme, he said. Education and employment minister Evarist Bartolo said the research opened doors for further study, including the scheme’s effects on children’s school performance and aspirations.", "comment_count": 9, "id": 1185}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The environment watchdog is set to get new powers to protect threatened habitats or species and also to raise the penalties for breaches.\nChanges to the Flora, Fauna and Natural Habitats Protection Regulations, newly published for public consultation, will allow the Environment and Resources Authority to issue protection notices it said would allow conservation measures to be put in place in a timely manner.\nProtection notices can include conditions or restrictions such as a prohibition on carrying out certain activities or works on the threatened site and even the control or eradication of invasive species.\nSimilar notices can also be applied to species with unfavourable conservation status or whose status is in decline.\nNew guidelines are put forward in the proposals for the regulator to propose ecologically-important sites for additional protection status. This designation, as well as the issuing of protection notices, can be appealed by landowners.\nList of protected species is being updated\nThe amendments also introduce additional penalties for offences, particularly those carried out within protected sites.\nUnder the proposals, the fine for breaches of a site’s management plan provisions will be between €2,500 and €60,000, with the possibility of a two-year jail term if the offence persists for more than three months.\nNew safeguards will also be put in place for a number of species, including butterflies, orchids, corals and sharks, with different protection levels added to other species.\nThe list of protected species is being updated in line with the provisions of United Nations conventions on species and habitat conservation as well as recent scientific advances.\nMoreover, the proposals are intended to strengthen provisions concerning invasive alien species, including the possibility of removal orders to facilitate the removal, uprooting or eradication of detrimental species.\nThe proposed amendments have been published in the ERA website and public consultation is open until March 8.", "comment_count": 6, "id": 1186}, {"keywords": "", "author": "Ivan Martin", "article_body": "Foundation works on the first two of seven flyovers at the Marsa junction are under way and both should be up and running by this summer, Infrastructure Minister Ian Borg said on Monday.\nThe first two flyovers will connect traffic flowing between Triq Aldo Moro and Triq Garibaldi. \nAddressing a press conference to give updates on the €70 million project, Dr Borg said the third and final stage of the revamp to the thoroughfare was well under way.\n“While we are busy laying foundations for the final stage of the project, much of this work is not visible to the public so there might be the impression that the project has stalled. This, however, is far from the case,” he said.\nOnce completed, the Marsa junction project will be home to the tallest, widest, and longest flyovers on the island.\nThe tallest part of the intersection will be around four storeys high climbing above another lower flyover. The two longest sections, extending over 400 meters, will connect Triq Garibaldi to Vjal Sta Lucija and Triq Aldo Moro. The widest of the seven structures will include four lanes, forking into two different flyovers each with two lanes.\nAt four storeys high, the junction will boast the island;s tallest flyover\nThe flyovers, which are expected to be fully installed by the end of next year, cover around 12 km of either new or completely restructured lanes and will create new northbound and southbound connections between Triq Aldo Moro and Vjal Sir Paul Boffa, Vjal Sta Lucija, Triq Giuseppe Gaibaldi and Triq il - Marsa.\n460 concrete piles, 46 pillars\nInfrastructure Malta chief executive Frederick Azzopardi told reporters how contractors were currently excavating and casting the first clusters of around 460 concrete and steel piles that will support the flyover structures’ 42 pillars.\nRead: Marsa lane changes introduced\nThese will in turn support 350 horizontal beams, roughly 30 meters long each, upon which the new lanes will rest, replacing the junction’s old traffic light system.\nA render of how the Marsa Junction will look once finished by the end of next year\nHe explained how once the foundations were laid, Infrastructure Malta would oversee the casting of concrete platforms upon which the pillars will be constructed. The first two flyover structures will include 14 pillars.\nThe contractors are also busy excavating and building over two km of walk-through culverts, which will host new high-voltage power cables as part of an upgrade to the area’s energy grid.\nAn additional 13.5 km of water, sewage, storm water, electricity, internet and other telecommunication underground networks are also being installed beneath the road surface as part of the project.\n“This means that when there is a fault or when new services need to be installed, we won’t have to rip up the tarmac like in the past,” Minister Borg said.\nThis final stage of the project will also be when the 1.6 km of new footpaths and cycle lanes are added to the junction. Three pedestrian bridges, four new bus laybys, new bus lanes, and a 380-space park and ride facility will also be completed in this final part of the project.\nChanges for motorists\nAround 100,000 vehicles pass through the Marsa intersection every day.Mr Azzopardi said the installation of the seven flyover structures would require reworking of the traffic flows and lane system.\n“The first of five changes for motorists passing through this intersection will come in a few months once the first structures are laid. These changes are based on studies of the traffic flow in and around this junction and are meant to cause the least congestion and disturbance,” he said.\nThe major changes to traffic flows, he said, would come in between the second and fifth phase of the installation of the flyover structures.", "comment_count": 41, "id": 1187}, {"keywords": "", "author": "Denise Grech ", "article_body": "Rising rent prices and family breakdowns are leading YMCA to turn down five times as many homeless people as it used last year, The Sunday Times of Malta has learnt.\nYMCA CEO Anthony Camilleri had started to turn down one person every day last year but was now turning away five referrals every day.\nMany of those seeking help are aged 20 to 35, but Mr Camilleri said the number of homeless cases involving people over 65 was increasing.\nThe organisation used to run two shelters but had to shut down one of their premises which housed unattended minors due to a lack of funds. Its remaining shelter can host 30 people daily.\nThe shelter runs two main programmes, including a residential one based on a maximum 18-month stay. It also runs an emergency admission programme targeting people who become stranded during the night and have nowhere to go. People using the shelter are offered a care programme and counselling.\nMassive foreign presence\nBoth Maltese and foreign nationals were turning up asking for help every day, Mr Camilleri said. However, the organisation has been inundated with foreigners over the past year, data shows. A third of its foreign clients are EU citizens, while nearly a half are migrants, according to the latest figures.\nRead: Homelessness is Malta's 'best kept secret', says researcher\nThough some referral cases were unemployed, Mr Camilleri warned of the rise in the working homeless: those who had a job but still could not afford a roof over their heads.\nMeanwhile, Anthony Gatt, CEO of Caritas Malta, told a conference on Thursday those working at emergency shelter Dar Papa Franġisku were “scrambling” to find more places for people.\nA spokeswoman for Caritas, which runs both Dar Papa Franġisku and Dar Maria Dolores, said the number of people in the emergency shelters was constantly fluctuating.\nHowever, she said the situation worsened over the past few months as the weather got colder.\nShe also noted many foreigners would come to Malta and seek refuge in the shelters until they found their feet.\n“We have a lot of foreigners who come to Malta and stay at the shelter until they get their first or second pay cheque and can afford to move out,” the spokeswoman said.\nDar Papa Franġisku and Dar Maria Dolores are emergency shelters, where a person can spend the night, wash their clothes and have a warm meal. While food is given to anyone who turns up at the shelters, the number of beds are limited, so a spot has to be reserved at 6pm for each night.\nPeople can stay there for a maximum of six weeks, while a third shelter, called Reach, provides residential services.\nAnyone who would like to help YMCA can get in touch at their head office, 178, Merchants Street, Valletta, on 2767 4278 or info@ymcahomeless.org, or their Facebook page called YMCA Valletta.\nCaritas Malta can meanwhile be reached at 5, Lion Street, Floriana, or on 2590 6600. Log onto https://caritasmalta.org for more information or to make a donation.", "comment_count": 89, "id": 1188}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The case of two customers challenging the manner in which electricity bills are calculated by ARMS Ltd is expected to continue in court after a judge rejected preliminary submissions made by the company.\nDarren Cordina and Melvin Polidano accused the authorities two years ago of breaching subsidiary legislation calling for the calculation of bills to be based on actual cumulative annual consumption and providing for a refund if the customer has overpaid.\nTheir lawyer, Maxilene Ellul, argues that the method of computation breaches at least three directives that call for transparency and fair treatment, among others.\nShe said that the manner in which the bills were issued did not allow her clients to reap the full benefits of the underfloor heating system they had installed in their house. They were even threatened with having the provision of electricity suspended, forcing them to settle the excessive bill under protest, Dr Ellul said.\nHowever, ARMS (Automated Revenue Management Services Ltd) deemed their application “null”, insisting it was confusing and contained different and conflicting actions.\nUnfair way utility bills are worked out\nThe First Hall of the Civil Court, however, ruled otherwise. Madam Justice Anna Felice rejected the preliminary pleas raised by ARMS, meaning the case would now continue in court.\nThe judge noted the applicants’ insistence that ARMS was calculating their bills in a way that did not respect the law.\nTheir aim was clear and ARMS appeared to have understood this so well that the evidence already produced addressed the complaints raised by Mr Cordina and Mr Polidano, Madam Justice Felice said. Moreover, she continued, the court found nothing conflicting in their requests.\nFears that customers are overpaying on electricity due to the billing method were last year flagged on social networks and picked up by the media.\nThe Consumers’ Association of Malta has long received complaints about the unfair way utility bills are worked out and had told The Sunday Times of Malta customers were being cheated out of lower tariffs.\nAssociation president Benny Borg Bonello argued that consumers should be billed for cumulative consumption or else any overpayments should be refunded at the end of the year.\nHowever, the Regulator for Energy and Water Services maintained that current legislation did not allow for reconciliation.\nHow bills are computed\nARMS Ltd uses a staggered system to bill consumers. The first 2,000 units of electricity are charged at one rate and further consumption at higher rates.\nThus, for every kWh of the first 2,000kWh consumed in a year, residents should be charged 10.47c and then pay 12.98c for every kWh for the next 4,000kWh, 16.07c per unit on the next 4,000kWh and so on.\nHowever, ARMS splits up this allocation pro rata according to the number of bills a consumer receives in the same year.\nThis means that if a residence is billed every two months, the first 2,000 units are split between six bills, amounting to an allocation of 333 units per bill at 10.47c per unit.\nIf a residence consumes fewer than 333 units in a two-month billing period, the remaining units at the cheaper rate are not brought forward to the subsequent bills. The allocation is lost and cannot be used in the subsequent months, with the same method being applied to the higher bands.", "comment_count": 0, "id": 1189}, {"keywords": "", "author": "Jacob Borg", "article_body": "A proposal by the Electoral Commission to give political parties uncontrolled access to scans of votes cast during the election process has raised fears among some quarters that the data could be misused.\nA spokesman for the Office of the Prime Minister told the Times of Malta the proposed amendments to the electoral law were still being studied by the government.\nIt is being proposed, among other things, that political parties will be given access to scans of all valid votes cast, along with their interpretation by the e-counting software. The data can be held by the parties “for verification purposes” for a three-month period, after which it has to be deleted.\nInvalidated votes will not be given to the parties to “protect voter secrecy”, it is being proposed.\nA veteran election observer pointed out that what was being proposed meant shifting from a system where votes were held under lock and key by the Electoral Commission to giving political parties unmonitored access to scans of the electorate’s ballot papers.\n“This opens up the system to corruption. A family on a particular district can all agree on a unique vote preference pattern that is easily distinguishable from a ‘normal’ voting pattern in exchange for money or jobs.\nInvalidated votes will not be given to the parties\n“Political parties can then easily verify that the unique, pre-agreed voting preference pattern is adhered to by the family because the scanned votes will also include details about which ballot box they came from,” the observer warned.\nSources close to the Electoral Commission said the proposal was supported by delegates of both the Labour and Nationalist parties.\nDemocratic Party leader Godfrey Farrugia told the Times that the present system already gave political parties a clear indication of which party, and even candidate, each street in Malta and Gozo had voted for.\nThe proposed changes, he added, would give valuable additional intelligence to both big political parties that had the experience and the resources to do so.\n“It is evident that an unspoken, binding agreement exists between the PN and the PL in this regard. They want to elbow third parties out of the political system,” Dr Farrugia said.\nThe Electoral Commission said in a statement last month the new e-counting system that would be used for the upcoming MEP elections in May guaranteed the correct result, reflecting the electorate’s vote.\nQuestions to the commission on why it felt the need to offer the ballot data to political parties for three months remained unanswered at the time of writing.\nReplying to questions by the Times of Malta, a spokesman for the Data Commissioner played down privacy concerns under the proposed amendments.\nHe said that, save for the names and surnames of the candidates contesting the elections, the ballot papers would not contain any other personal data and could not be linked or otherwise be attributed in any manner to a voter.\nThe spokesman said while in the manual electoral counting process the political party representatives already had access to physical ballot papers and related documents where issues might arise and as set out by law, it followed they would also have a right to see the same ballot papers now saved electronically.\n“This being the case, no data protection issues should arise and the Commissioner sees no reason why he should be consulted for this specific amendment,” the spokesman said.", "comment_count": 39, "id": 1190}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nThe Times of Malta main story deals with the government considering whether to give data on votes to the political parties. It also reports on a cancer vaccine and doubts over its use.\nIn-Nazzjon features the calls for the direct orders given at St Vincent de Paul residence for the elderly to be investigated, made by Opposition Leader Adrian Delia on Sunday.\nThe Malta Independent reports on the fact that the NGO rescue vessel Sea Watch 3 is being held in Catania, and also reassured that there is no danger to people from 5G networks.\nL-Orizzont features the main message given by Prime Minister Joseph Muscat on Sunday, in which he lambasted the Opposition for its outdated approach, and also carries a report by a woman who calls for more empathy for her son with epilepsy - and for others with disabilities.", "comment_count": 0, "id": 1191}, {"keywords": "", "author": "Terence Mirabelli", "article_body": "“The Body of Christ” is a phrase Roman Catholics are familiar with when receiving Holy Communion. We do not question the host’s provenance but accept it for what it is after the transubstantiation.\nCommunion hosts do not ‘just happen’, they are produced by someone, somewhere. And that ‘someone’ has traditionally been nuns as part of their ora et labora (pray and work) ethic.\nNowadays, only two convents manufacture hosts in Malta – the Missionary Sisters of Jesus of Nazareth at their Żejtun mother house and the Franciscan Sisters of the Heart of Jesus at their convent in Msida.\nThe Missionary Sisters have been producing hosts – from the Latin hostia, meaning sacrificial victim – for some 70 years, while the Franciscans have been at it since the early 1970s.\nRegardless of which order wins the longevity race, the manufacturing process is identical and amazingly simple. Sift fine wheat flour, 600gms according to the Missionary Sisters’ recipe, and whisk it in 900ml of cold water until a pancake-like batter is formed. The Church requires that its communion bread be unleavened. (The nuns of both orders make several batches of the mixture on production days.)\nThe mixture is then ladled, a spoonful at a time, on to what looks like a waffle maker. The lid is engraved with crosses or the Christogram IHS. The griddle is closed and the mixture bakes for no more than two minutes.\nThis age-old industry is facing competition\nThe result is a cream-coloured, wafer-thin – literally – sheet. These are then stacked and placed on shelves in a cupboard for drying.\nThis process may take from one day to a week, after which the sheets are placed in a cutting machine and punched into individual disks of 3.1cm diameter each – the finished communion wafers. These machines can cut up to 42 hosts at a time; others punch larger, single hosts measuring 7.5cm each that are used by priests when celebrating Mass.\nBefore packing and consigning, the hosts are checked for flaws and ‘dents’. Damaged hosts, like the offcuts from the sheets, are bagged and sold to shops for children (and adults) to enjoy.\nSheets drying\nHosts that ‘make the grade’ are placed into plastic boxes and sold to parishes by weight. Each weighs about 0.25gms, that’s some 4,000 communion hosts per kilo.\nRead: How can the Church boost interest in its message?\nAmounts bought depend on a parish’s size; for instance, Manikata buys 300gms of hosts a month, Rabat acquires 4kgs and Attard parish buys 5kgs. Institutions such as St Vincent de Paule Residence order 4kgs a month.\nAnd the cost? Each convent has its own pricing structure that varies from €23.29 to €27.95 a kilo.\nThis age-old industry, a cottage one at best, is now facing competition. Firstly, neither convent has a daily production line; the Missionary Sisters bake hosts on two days a week and employ two lay helpers. In Msida, two Franciscan nuns produce their communion bread three days a week, sometimes four.\nForeign competition\nDwindling church attendance is one contributing factor to the drop in demand for convent-produced hosts.\nThe other is that many parishes are now buying foreign-made hosts. And the major importer is the religious shop Emmaus, run by the Conventual Franciscans at their Centru Animazzjoni u Komunikazzjoni in Birkirkara.\nAlthough they import from various sources, the Italian manufacturer Ostificio Domus appears to be Emmaus’s principal supplier.\nAvailable from the Birkirkara outlet are packs of 500 hosts, measuring 3.5cm each at €2.40 – that’s €19.20 for a kilo, considerably cheaper than convent produced communion bread. Tins of 3,000 are price-tagged at €19.\nEmmaus also sell gluten-free hosts – something the nuns do not produce – and say the demand is growing. Packs of 25, 3.5cm hosts retail at €2.40 and are also available in containers of 50 at €4.50.\nIt is not only the Roman Catholic church that buys sacramental bread, many other Christian denominations also partake of communion and acquire their hosts locally. Because their communities are so much smaller, quantities are miniscule in comparison. For example, St Paul’s Pro-Cathedral in Valletta use about 200 hosts a week, bought from a religious goods shop in the capital.\nAlthough other denominations help keep the ‘hosts business’ alive, we are unlikely to see a reversal of fortunes for the convents that produce the communion bread.", "comment_count": 13, "id": 1192}, {"keywords": "", "author": "Ivan Martin", "article_body": "The proposal for an underground train system for the island has captured the public imagination. Ivan Martin speaks with the architect behind the idea of a Malta Metro.\nImagine entering a metro station beneath Valletta’s Triton Square and coming out at the airport in 15 minutes or the bus station in central Victoria Gozo in just half an hour.\nAn opinion piece in last week’s The Sunday Times of Malta mapping out such a Malta Metro system went viral. \nKonrad Xuereb, a director at KonceptX, an architectural and structural engineering firm with offices in Malta and London, believes that his proposal is not only feasible, but could solve many of the island’s traffic related problems.\nHe is proposing a national metro system to be carried out in three phases. Based on the use of two tunnel boring machines, the first phase of the proposed metro could take just five years to be completed. The second and third phases would be anticipated to take a further two and three years respectively.\nThe first phase could be approximately 25km long, connecting Mellieħa to Birżebbuġa, with a loop at the end to the airport.\nThis metro line, he says, could stop in dense urban centres including St Paul’s Bay, Pembroke and Paceville, St Julian’s, Sliema, and Msida with stops at the University of Malta and Mater Dei Hospital). Valletta, Paola and Żejtun could also have stops.\nThe second phase would be approximately 10km long, connecting the airport to St Paul’s Bay in the north, allowing the metro to form a loop.\nThis second part of the metro could link other dense urban centres including Qormi, Birkirkara, possibly Mrieħel and Mosta.\nThe third and final stage would be approximately 15km long, extending between Mellieħa and Gozo, connecting Xewkija, Rabat and Marsalforn on the sister isle Gozo.\nIt would take merely half an hour, Dr Xuereb said, for someone to board the metro at Victoria in Gozo and arrive at the University, Valletta or the airport.\nIs this a realistic timeline? Dr Xuereb said that, to put things into perspective, construction work on the 118km long Crossrail underground metro in London (more than double the length of that proposed for Malta) started in mid-2009 and is planned to open later this year. \nWhat to do with the rubble?\nAnd what about the debris that digging a Malta metro would generate? Dr Xuereb anticipates that the excavation for the whole metro system, including the 20 metro stations proposed for across Malta and Gozo, could generate between three to four million cubic metres of earth in waste.\nIn the Crossrail underground line in London over three million tons of earth from tunnel excavation were used to create a new nature conservation area at Wallasea Island on the River Thames Estuary, transforming it into a thriving wetland teeming with bird and marine life.\nSubject to detailed environmental studies, most of the inert waste from the construction of the proposed Malta metro could be strategically used for land reclamation to form an offshore nature reserve or an offshore wind farm, Dr Xuereb said.\nTravelling by metro from Valletta to the airport would take 15 minutes\nAn offshore windfarm could also be complemented by an offshore solar farm, with the solar panels connected to the national grid.\nThe London Array offshore wind farm, for example, is a 175 turbine 630 MW windfarm in the Thames estuary meeting the electricity needs of 750,000 homes and cutting annual carbon emissions by 900,000 tonnes, equivalent to that generated by 300,000 passenger cars.\nWould tunnels destroy archaeological remains?\nAnd as for the impact digging a tunnel could have on the island’s geology, Dr Xuereb said the Malta metro tunnel would predominantly be located at a depth of approximately 25 metres below ground level, dipping gently under the channel.\nThis would ensure that the construction of the tunnel would not disturb the superficial soils and top geological strata where any yet undiscovered archaeological remains may be lying. Notwithstanding this, detailed environmental and archaeological studies would be required before the final metro route and station locations could be fixed.\nThe location of most large cities close to waterways like rivers entails that new metro projects typically encounter complex ground conditions during construction of the tunnels.\nIllustrating this further, Dr Xuereb said the construction of the Crossrail underground line in London entailed boring through varying, challenging, ground conditions including London Clay and Thanet Sands, which necessitated assessment of ground movements and mitigation strategies like ground stabilisation to limit damage to the buildings lying along the metro alignment.\n“By comparison, the anticipated geology of Malta along most of the proposed metro route is likely to make tunnelling for an underground metro less challenging, with a smaller risk of damage to overlying buildings during tunnelling,” he said.\nHow much could it cost?\nWhat about the cost? Well, Dr Xuereb said that for a metro to be feasible in Malta it would need to capture the largest number of people with the shortest length possible.\n“I would calculate that the capital expenditure to build a national underground system would easily reach €3 billion to €4 billion, which is nearly four times the anticipated cost of a vehicular tunnel between Malta and Gozo,” he said. \nHowever, the revenue generated from a national metro system would be much higher than a vehicular tunnel given the much larger population it would attract, including the millions of tourists visiting the islands every year.\nAdvertising on the trains and in the metro stations could also bring in revenue and the government could obtain further cash from leasing spaces within the metro stations for retail outlets.\nThe Crossrail project in London is nearly two-and-a-half times the length of the proposed Malta metro, tunnelled through more complex ground conditions and requiring more than double the number of metro stations that would be needed in Malta. Crossrail is anticipated to cost nearly €17 billion, but annual ticket revenues are forecasted to exceed €900 million annually in 2020 to 2021 and over€1 billion annually after that.\nA national metro system would also drastically reduce the number of cars on the road – cutting down on pollution from vehicles, with significant cost savings in healthcare and increased quality of life.\n“There is a strong need for Malta to address the public transport system holistically with a permanent connection to Gozo forming part of such a system. An underground metro will turn the nation’s current transport challenges into an opportunity,” Dr Xuereb said.", "comment_count": 158, "id": 1193}, {"keywords": "", "author": "", "article_body": "A 12-year-old girl was grievously injured on Sunday morning when she was hit by a car in Naxxar, the police said in a statement.\nThe young girl was on 21 September Avenue at around 9am when she was hit by a Misubishi L200 pick up truck being driven by a 51-year-old Mosta man.\nShe was rushed to Mater Dei Hospital by ambulance, where doctors certified her as being grievously hurt.\nPolice investigations are ongoing.\n ", "comment_count": 0, "id": 1194}, {"keywords": "", "author": "Claire Caruana", "article_body": "Students at State schools struggling with traditional teaching methods will from September be able to take subjects that focus on hands-on learning.\nIn a major shift of the education system away from a purely academic approach, successful students in these “applied” subjects will earn a SEAC – Secondary Education Applied Certificate.\nThe SEAC will be the applied equivalent of the SEC certificate awarded to students who pass their ‘O’ Levels. It will entail passing two applied options as well as the core subjects Maths, English, Maltese and Science – but these could also be taken in the new, applied versions.\nApplied subjects will be taught hands-on in workshops rather than through the traditional theory-based techniques.\nSubjects include IT, media literacy, retail, hospitality and agribusiness, among others (see below). \nEducation Ministry officials tasked with overseeing the changes said they were set to improve the standard of the country’s education system, placing it alongside the best in the world. The government had invested significantly in the building of state-of-the-art workshops to cater for the new subjects in colleges all over the island.\nWhile syllabi for the applied versions of the four core subjects are also being drafted, it will be up to individual schools to decide whether their students will be able to choose these options.\nThe officials said students in Year 8 (formerly known as Form 2) are currently in the process of selecting subjects they wish to focus on next scholastic year, and the list of subjects will now include the nine that are ‘applied’. These will then be rolled out one year at a time.\nRead: Teachers look at Finnish education system\nThis means that, for the first time in the history of the country’s education system, those in Year 9 next year will eventually be able to eschew the Year-12 SEC exams, opting instead for a SEAC certificate awarded by the Matsec board.\nThey will still be able to follow courses at levels one, two or three at either Mcast or ITS, depending on the results obtained, but not at sixth forms like Junior College or Higher Secondary.\nExam importance lessened\nAssessment will also be significantly different, with 60 to 70 per cent of students’ evaluation being “school-based assessment” and only 30 to 40 per cent in the form of exams.\nYear 2 students have until the end of this month to make their choices.\nThe Education Ministry said that it expects each school to have at least one group for every subject on offer next year.\nThe Malta Union of Teachers has warned that there may not be enough educators to cater for all the new subjects, given that staff shortages have persisted and that four additional vocational subjects will also be introduced.\nBut the ministry officials have dismissed these concerns. They said 60 teachers in possession of a teaching warrant are to undergo a 10-day training course in the coming weeks to make the shift to the applied subjects.\nConfident that there would be enough educators\nAsked how many teachers will be needed to cater for all the students choosing applied options, the officials envisaged requiring about 29. While it was still “too early” to talk numbers, they were confident that there would be enough educators by September.\nRead: Is co-education working? Students like it, teachers less so\nPressed to say what would happen if not enough teachers were available, and whether they would then consider dropping some of the subjects or limit the number of students, they said these decisions would be taken in March, when they would have more precise numbers.\nThey insisted the revamp would take place in September “come what may”. While teachers were being given the opportunity to have a direct say in the drafting of the new syllabi – something the officials said was a first – the roll-out of new subjects would not be postponed, the said. The ministry would ensure all discussions would be concluded ahead of the new scholastic year.\nWere parents aboard, given that the new subjects were unconventional? According to the officials, many were happy with the changes and parents often wept when they found out their children would have “other options”.\nThe new subjects\n‘Applied’ Option Engineering TechnologyInformation TechnologyHealth and Social CareAgribusinessHospitalityMedia LiteracyHairdressing and BeautyTextiles and FashionRetail\nMathsEnglishMalteseScience\nVocational Options (new)Media LiteracyHairdressing and BeautyTextiles and FashionRetail\nMUT and Church react\nMalta Union of Teachers president Marco Bonnici said the union was not against providing new subjects but its concerns were related to how reforms were being introduced, particularly “the lack of planning”.\nOn the number of teachers needed, Mr Bonnici said that “realistically speaking the numbers look very strange”, especially since the government envisioned having one group for each subject at every school.\nThe union has often complained that the government is failing to address the lack of teachers in State schools.\n“It is difficult to make a prediction without knowing the number of students who will apply for each of these new subjects. However, given the promotion being made, the demand will most probably be substantial.\n“The projection should not be for next year only since students choosing a new subject will have it for three years (Year 9 to Year 11). Just projecting what is going to happen next year is outright lack of long- term planning,” Mr Bonnici said.\nThe MUT does not have any information on the type of training being provided to the teachers.\n“The ministry is also assuming that the teachers doing the crash course will accept to teach the new subjects, and in that case it would also mean that the issue of lack of teachers will become even greater in many of the traditional subjects where these teachers will be shifting their load,” Mr Bonnici pointed out.\nMeanwhile, a spokesman for the Church told this newspaper that representatives from Church schools had met “a few times” with Education Ministry officials on the matter, pointing out that the initiative was mostly targeted at State schools.\n“Church schools will continue providing the education for which they are renowned. Church schools are continuously evolving and will take on-board any feasible developments that benefit learners as indicated by their ethos.\n“At the moment, the government is focused on introducing these applied subjects in State schools. We are confident that in the future there may be collaboration and support between State and Church schools also with regard to these developments,” the spokesman said.\nclaire.caruana@timesofmalta.com", "comment_count": 20, "id": 1195}, {"keywords": "", "author": "", "article_body": "The census on Sunday Mass found declining attendance that could go as low as 10% in 20 years’ time. How is the Church to react to this trend? Three priests with popular masses were asked what they offer their congregations and what could make the religion more meaningful.\nRead:Church targets poor to tackle Mass attendance\nFr Martin Cilia\nPeople come from all over Malta to the Mass celebrated by Fr Cilia, director of the MSSP Oratory in Birkirkara.\n “As people come because they want to come that helps the atmosphere to be one of expectation, of involvement and commitment,” he says.\n“We offer a sense of community; people come to know each other and share not only the ritual of the liturgy but their own lives.\n“We offer a well-prepared homily as we believe that the Word of God needs to be explained in a simple yet profound way and in this regard we have quite a good feedback.\n“We offer children’s ministry as we try to create a safe space for them and explain to them in their own way, sometimes through clips, paintings, songs or games, the gospel of the day. This also gives parents the time to listen to the homily in peace.\n“We also offer a renewed space which is inductive to communion and which gives a modern and contemporary dress to the faith that we try to live.”\nHe said the Pope spoke about priests being closer to the people, knowing their language and being closer to their pain. With even non-church goers wishing for the presence of a priest in difficult moments of their lives, this could be a “real entry point”.\nThe Church also needed to move from the legal and moral language to offer more of “the freshness of the life and teachings of Christ”.\nFr Hilary Tagliaferro\nFr Hilary, founder of the Millennium Chapel Community in Paceville, says the chapel offers practical ways of living a Christian life of faith.  \n“The Mass on Sunday is not an aim in itself but helps us to live fully our faith by serving others and helping those in need, both in soul and body.  Attending Mass on Sunday is not enough but living the Word of God in the commandment of love as soon as we come out of Mass is most important.”  \nHe proposed that less clericalism, in the footsteps of Pope Francis, would “bring the Church out to the people”.  \n“Space must be given to lay people and to women to take an active part and feel part of the Church as much as priests and religious.”\nHe said Maltese Christians were still waiting for the Bishops and priests to tell them how to regulate their consciences: “The relationship of the lay people with the Church is still vertical!”  \nPastoral work, he said, was still focused on religiosity and church decoration. “We are missing the boat. Pope Francis has appealed to all priests and lay people to find new ways of evangelisation!\n“Why is the sound system in many churches in Malta not good enough? Why is modern technology – big screens etc. – not in use in all Churches? How can the Word of God be heard properly? Is there lack of preparation for the Mass? What is the music and singing like during Mass?” \nHe said his chapel has recently installed an electronic screen outside on the pavement, so that positive messages and the Word of God was transmitted to all, day and night.\nFr Rene Camilleri\nFor Fr Camilleri, a professor of theology and the former Episcopal Vicar for Evangalisation, says the Church offers its congregations by and large what it has been offering for ages, but the problem is that audiences are today much more complex than they used to be.\n“We have mixed audiences with very mixed motivations. It is difficult to cater for personal needs in a big church where the right motivated would want mainly to reconnect with themselves and go back home with some more inner peace and harmony.\n“That explains why parallel with what is happening in our parishes, there are so many other sacred spaces where people feel they belong. It is because there is a sense of belonging that ‘ritual’ makes more sense. So the issue is belonging, perhaps a remedy for stress, solitude, and other charateristics of the age.”\nAnd little can be done to make religion more meaningful to the ordinary person if the starting point is the Sunday congregation, says Fr Camilleri, a weekly contributor to this newspaper’s Christian Spirituality page.\n“The main issue with religion is not Mass attendance on Sunday. That can only make sense in a context. As long as religion remains a question of obligations, the decline will be guaranteed.”\nIn his view, what is needed is a “rebranding of religion and a re-inventing of the Church”.\n“Religion is about the heart, not the mind and doctrines. The more we address the heart, the more meaningful it becomes.”\n“Besides, unfortunately we continue to dish out to grown-ups and intelligent people the same they used to have in childhood. For many, religion stopped with the basics they received in childhood and adolescence and that is really a major drawback. Religion is about interiorising what they are participating in.”", "comment_count": 38, "id": 1196}, {"keywords": "", "author": "", "article_body": "Volunteers from 14 European volunteer civil protection teams took part in a 24-hour simulation exercise modelled on the eventuality of a Maltese earthquake.\nThe 70 volunteers wrapped up the Simulex19 simulation, which was organised by the Emergency Fire and Rescue Unit, on Sunday morning.\nMaltese and foreign rescuers worked together to rescue victims from different locations.\nBy the end of the exercise, 25 victims had been identified and rescued successfully using urban search and rescue and rope rescue techniques. \nThrough this simulation exercise, member teams will be able to support the Maltese authorities in case of a local disaster.\nAll participating teams, hailing from Malta, Italy, Portugal, UK, Greece, Cyprus, Hungary and France are members of the European Association of Civil Protection Volunteer Teams – of which EFRU is a founder member.\nThe association aims to have a European group of volunteer teams that train together in various civil protection disciplines, thus being able to deploy as a single group to assist fellow members of the organisation in the event of a major disaster as necessary.\nIt is currently made up of 15 member teams from 10 countries. In spite of speaking different languages, the volunteer rescuers work together, combining their efforts in effective teamwork to refine their skills to be able to assist whenever and wherever they are needed.\nSimulex19 is one of the activities of a project funded by the Malta Community Chest Fund Foundation focusing on volunteer rescue team preparedness in emergency response.\nThe teams made use of rapid deployment tents for incident command which also doubled up as sleeping and mess quarters, increasing the efficiency of local response teams.\nAt the end of the exercise, certificates were handed to all participants by Home Affairs Minister Michael Farrugia.\n.", "comment_count": 3, "id": 1197}, {"keywords": "", "author": "", "article_body": "Three people were arrested on Saturday night by the Drugs Squad.\nA 43-year-old man and a 40-year-old woman from Żejtun, together with a 21-year-old-man from Żabbar were found in possession of cocaine.\nThe 43-year-old had sachets containing the suspected drug which were not for his personal use.\nThe man and woman were arrested at a place of entertainment in Żejtun, while the youth was arrested in Żabbar.\nAll three will be taken to court in the coming days, the police said in a statement.", "comment_count": 0, "id": 1198}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated at 6.50pm with government reaction\nOpposition leader Adrian Delia on Sunday blasted what he described as the government’s lack of respect towards children and teachers.\nHe said the fact that children were now being taught in “containers” pointed towards a total failure of the education sector.\nTimes of Malta reported on Friday how ten prefabricated classrooms were installed in the playground of the St Paul’s Bay government school to cope with the demand.\nRead: School head insists that more mobile classrooms are useless\nSpeaking during an interview on NET FM, Dr Delia reminded how PN administrations had built a new school every year. Education, he said, was a priority for the PN.\n“The PN guarantees respect and investment in education. We do not want our children in containers. We want them in the best possible environment. We need an education system where children are excited to wake up in the morning to go to school”, Dr Delia said.\nRead: Mobile classrooms under consideration for some overcrowded state schools\nThe Opposition leader also announced the Opposition would be formally asking the Office of the Auditor General to investigate the award of a long series of direct orders in favour of one particular contractor to carry out cleaning services at Saint Vincent de Paul Residence.\nThese direct orders were not given in the public interest but were awarded to favour the select few, he said, adding they were also not in the interest of other business operators, who are being denied the opportunity to tender for these works.\n\"What was meant to be a temporary bridge-gap solution, spanning over a few months, ended up becoming a long-term permanent practice with one contractor benefitting from direct orders to the value of €9 million,\" he said.\nThe Opposition leader criticised the government for “stealing money” by over-billing consumers on their energy bills.\nDr Delia said the PN was in a position to prove the government was stealing from people, after having analysed thousands of bills.\nHe said a court decision this week instituted by private individuals had paved the way for evidence to be presented about how consumers were being short-changed.\nDr Delia said a PN government would pay back the money “stolen” from families.\nDuring his radio interview, Dr Delia questioned where the surplus often heralded by the government had gone.\nHe said the government had admitted its failure by saying that without foreigners coming to Malta there would be no pensions.\n“Where is the surplus? What of those who worked all their lives for their pensions?”\nOn declarations by the government that the controversial land deal with Corinthia would be going back to the drawing board, Dr Delia hoped that the new process would be more transparent and fair.\nHe accused the government of trying to sneak an agreement with Corinthia through Parliament over the Christmas season.\nThe deal, he said, would have seen prime land worth over €700 million being given away for a mere €51 million.\nDr Delia said that while the Opposition was in favour of improving Malta’s tourism product, it could not endorse giving land away on the cheap for speculative purposes.\nHe said the deal was also an attack on other businesses as well as established tendering procedures.\n'Completely transparent' - secretariat\nThe secretariat for active ageing reacted by saying it had no problem with the Auditor General investigating claims of impropriety in the way cleaning contracts for St Vincent de Paul home were awarded.“This process is completely transparent, fully documented and in line with public procurement regulations,” the scretariat said in a statement on Sunday evening.\n“Any allegation otherwise is incorrect, deceiving and untrue”.", "comment_count": 102, "id": 1199}, {"keywords": "", "author": "Keith Micallef", "article_body": "The 1,300 social housing units under construction will only be given to those genuinely in need, the Prime Minister said on Sunday adding it would not be distributing them 'like a Father Christmas'.\n“We have to be clear on this matter, even at the cost of losing votes,” he remarked.\nRead: Social accommodation targets - Michael Falzon\nJoseph Muscat was addressing a political activity at Mġarr during which he spoke at length on government’s plans to address the housing problem.\nHe remarked that for many years a “free entitlement” mentality prevailed whereby successive governments would distribute flats to applicants, which the latter would keep for life, if not from one generation to the next.\nDr Muscat said the government wanted to inculcate a new mentality whereby only those who could not afford to buy or rent a house would be offered social housing. However,  the solution was not to construct more housing estates as used to happen in the past, he said..\n“People with problematic backgrounds cannot be grouped together as this would result in a ghetto. The time of housing estates is over,” he said.\n“Had we opted for such model we could have constructed more with less, but we did not want to create problems which would have to be faced in 20 years’ time,” Dr Muscat added.\nThat why the 500 dwellings being financed from the passport scheme were being constructed in 22 localities, so as not to group them together, the Prime Minister said.\nHe pointed that from now on, tenants moving in the new social housing apartments would be monitored including by social workers who would provide support for them improve their quality of life. The ultimate objective would be for them to eventually have the necessary means to move out and make way for those in need.\n“Handing over the keys of an apartment will be just the start of a process,” he said.\nThe Prime Minister insisted that whoever would be given social housing would not enjoy perpetual lease as used to happen in the past. \"This is why these apartments will be rented out and not sold,\" he added.\n“The current situation of free entitlement for social housing has to stop,” Dr Muscat said.\nHowever, he pointed out that for such measure to be successful, future governments had to follow suit.\nThe Prime Minister said the government would be taking decisions in the near future on the way forward in the housing sector.\n“I cannot convey a message that the government will use these 1,300 homes and give them away like tokens as used to happen in the past. The government could not dish out flats as if it was Father Christmas,” he said.\nRead: Government giving up on social housing - Delia\nSuch an approach would be completely unfair for those hard-working couples who had to toil to buy their property, he added.\n“Social housing was there for those who really need it. One could not expect to save money at the taxpayers’ expense by abusing the scheme,” Dr Muscat noted.\nIn his address, the Prime Minster also referred to the forthcoming European and council elections, saying the party had to keep its feet on the ground.\nRubbishing predictions that Labour could even win five of the six seats up for grabs, he said that a repeat of the 2017 general election – Labour’s largest ever margin of victory since Independence – would still yield three seats to the PL due to the electoral mechanism in place.", "comment_count": 71, "id": 1200}, {"keywords": "", "author": "Anthony Manduca", "article_body": "Repubblika, the NGO that promotes the rule of law, has lodged a formal complaint with the European Commission demanding action over the failure of the Maltese government and State institutions to apply EU money laundering law effectively in relation to people in high positions of power.\nIn its written submission to the EU’s executive, Repubblika said that since February 2016 all the national authorities in Malta have “collectively and persistently failed” to investigate specific allegations of corruption and money laundering exposed in the Panama Papers relating to people in high positions of power, namely a Cabinet Minister, Konrad Mizzi, and the Prime Minister’s chief of staff, Keith Schembri.\nIt said the failure of the Maltese State to ensure the proper application and implementation of the relevant EU law is a breach of Malta’s commitments under the Treaty.\n“Three years since the publication of Panama Papers, no investigation has started in Malta, no charges have been brought in court, no resignations have been tendered and the people concerned are still in public office. Along with the relevant EU law on money laundering, this also constitutes an unacceptable breach of the EU values of democracy and the rule of law,” Repubblika said.\nThe NGO said that several attempts were made to instigate the national competent authorities to investigate the specific allegations of corruption and money laundering.\n“Repeated public calls were specifically made on the Attorney General, the Commissioner of Police and the FIAU, all of which are responsible for law enforcement in Malta. To date none of these national authorities have moved to investigate the allegations and although it is believed that the FIAU did investigate, it is clear that if anything, it fell short of ensuring that its reports were duly followed up.\nRepeated public calls were made to the AG\n“In July 2018, the FIAU was already found to be in breach of EU law by the European Banking Authority (EBA) in the EBA’s first decision of this nature. The case related to the bank known as Pilatus Bank,” it said.\nRepubblika also said that recourse was made on more than one occasion to the national courts demanding the opening of a magisterial inquiry into the case in accordance with national law that enables citizens to report any alleged criminal offence and request that it is investigated by an inquiring magistrate.\n“Despite the known facts, even the courts have incredibly rejected calls for an investigation. It is precisely because all national institutions in Malta appear to be unable or unwilling to investigate this case, as required by the letter and the spirit of EU law that we are now turning to the EU institutions to look into this matter. Other attempts will be made before the national courts to instigate the start of an investigation. However it transpires clearly that Malta’s national institutions are unwilling or unable to investigate this case because it involves people in high positions of power who are protected by the Prime Minister,” it said.\nRepubblika has also submitted a petition to the European Parliament on the same lines as the complaint sent to the European Commission. The petition is currently undergoing vetting by the Parliament’s vetting committee.\nIt is also preparing a petition for Maltese citizens to support its appeal to the European institutions on an individual basis.\n“The more of us that raise their voice in protest against this delinquency, the better chance we have of ensuring that European laws written to protect us are enforced,” it said.", "comment_count": 1, "id": 1201}, {"keywords": "", "author": "Denise Grech ", "article_body": "Major upgrades are required at four tunnels across the island to ensure that fire safety standards are in line with EU directives and international best practices.\nPreliminary studies found fire exits need to be upgraded at the Kirkop, Santa Venera, Tal-Qroqq and Ta’ Giorni tunnels to ensure they conform to higher safety standards, Kylie Ann Borg Marks, a leading architect at Infrastructure Malta, has told The Sunday Times of Malta.\nThe international directives apply to all tunnels and most specifications are meant for tunnels that are longer than the ones in Malta. However, a planned €10 million upgrade will make sure the tunnels, some of which date back to 1967, are on a par with best practices internationally.\nSite visits found that, while the tunnels are structurally sound, fire exits need to be clearly marked and escape route markers readily visible.\nThe tunnels are safe, Ms Borg Marks reassured the newspaper, but more needs to be done to ensure all fire safety targets set by several international guidelines are kept.\nInfrastructure Malta has therefore issued a call for tenders for a €10 million upgrade which would include fire hydrants, fire alarms, escape route markers, fire doors and emergency call stations.\nFire exits need to be upgraded\nAt the Kirkop tunnels, the fire safety concerns include multiple passageways between the two tunnels needing to be shut down.  “With the current number of openings, the connections between the two tunnels could be dangerous in cases of a fire, since the chances of the blaze spreading across the two tunnels increases,” Ms Borg Marks said.\nAir quality levels will also be monitored after the upgrade, with the agency looking to install sensors detecting abnormally high air pollution.\nData published in a study by the European Environment Agency (EEA) showed the island has the highest levels of air pollution compared to other Member States. Vehicle emissions continue to be the biggest source of pollution.\nArtist’s impression of a new-look tunnel.\nAnother of the upgrades in the tunnels will be to paint the walls with specialised compounds so that soot can be removed more quickly and easily, Ms Borg Marks said. Geo-radar scans will identify any cavities to establish the extent of work needed.\nAlso, CCTV cameras will be installed to alert the authorities when an accident takes place. A control room adjacent to the tunnels will be manned so that power can be cut off in case of emergencies.\nThe cameras and sensors will be linked to the national Traffic Control Centre for constant monitoring. They will also be connected to an incident detection system that can automatically alert the authorities of any difficulties, such as fires or stalled vehicles.\nWork is set to start later this year.", "comment_count": 4, "id": 1202}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Advanced plans have been put in place for hundreds of Turkish construction workers to be flown into Malta to work on major private construction projects across the island, The Sunday Times of Malta has been informed.\nThe plans include fast-track approvals by the government’s employment agency Jobsplus and the conversion of a large site next to the airport where these workers will live in makeshift mobile homes similar to those used by refugees in Ħal-Far.\nA spokesman for Jobsplus declined to confirm ongoing talks with TACA Construction, the Turkish company involved, and their Maltese agents on the importation of hundreds, possibly thousands of workers.\n“We do not divulge any information on specific companies,” was Jobsplus’s response when asked specifically about TACA Construction’s plans.\nHowever, the newspaper is reliably informed that TACA told Jobsplus that it intends to bring in up to 2,500 construction employees to work on major projects on the island.\nA subsidiary, called TACA Insaat Ve Ticaret AS, was registered in Malta last September.\nTurkish sources told the newspaper that so far, TACA Construction has already entered into a multi-million deal with the Seabank db Group over the construction of the City Centre development in St George’s Bay.\nOffering very low construction prices\nOn this site, formally occupied by the ITS which the government sold for a controversial €15 million, the Seabank db group is planning to develop a massive hotel and a 38-storey residential tower.\nThe sources said that the Turkish construction mega company, which has built many towers in Istanbul and Ankara, is also in advanced discussions regarding other major projects including the building of large edifices for the Fortina Hotel in Tigné and an extension of the St Vincent de Paul long-term residential facility in Luqa which the government has also assigned to a subsidiary of the Seabank DB Group and James Caterers through another controversial deal.\nIt is understood that TACA is offering very low construction prices compared to the current market prices.\nA spokesman for the Seabank Group declined to comment on their negotiations with TACA Construction.\nJobsplus CEO Clyde Caruana has been harping on the need to import thousands of foreign workers to the island in order to sustain economic growth.\nLast week, addressing concerns expressed by many Maltese over the government’s policy of encouraging inward migration, Prime Minster Joseph Muscat warned that without an influx of foreign workers social benefits would not be increased.\nDr Muscat warned: “If you want to enjoy the meat you need to take the bone too”, when referring to foreign workers.\nCurrently, there are some 2,000 third country nationals registered with Jobsplus as construction workers. However, industry sources estimate that there are many more thousands working illegally.\nIndustry sources told the newspaper that while due to the ongoing building boom “there is a need for more construction workers” Malta also needed to look at quality.\n“It is also imperative to make sure that workers are not abused and that the market is not flooded with ‘cheap labour’ as this will eventually hurt us,” they added.\nThe minimum wage in Turkey stands at €380 a month, half Malta’s. However, according to local laws, foreign workers on the island have to be paid at least Malta’s minimum wage.", "comment_count": 322, "id": 1203}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Installing more mobile classrooms to cope with the influx of students, mostly migrants, at St Paul’s Bay government primary school was no solution, according to Maria Regina College principal Patrick Decelis.\n“There is no place for more mobile classrooms at our school as we are full up. We have no intention of putting more children in mobile classrooms and, if the new school is not ready by this September, we will have to find another solution,” Mr Decelis told Times of Malta.\nThe college he heads incorporates 12 schools, including the one at St Paul’s Bay.\nThe newspaper reported earlier the Foundation for Tomorrow’s Schools issued a call for tenders to install new mobile homes that would serve as classrooms at St Paul’s Bay primary and Żejtun’s secondary.\nMr Decelis declared publicly on Thursday there would be no more mobile classrooms at his school. When contacted and told about the call for tenders, he stuck to his stand.\nIf the school misses its deadline, we have to find other solutions\n“Originally, we were thinking of having extra mobile classrooms for the February intake. However, this is no longer necessary,” he said.\nAsked whether the call for a new tender indicated that a new school, promised for 2015, would again miss the deadline come September, Mr Decelis insisted that “mobile classrooms will not be the solution”.\n“While I hope the new school will be available this September, mobile classrooms will not be an alternative. If the school misses its deadline, we have to find other solutions, possibly the transfer of children from our area to other schools,” he said.\nMr Decelis was optimistic that the new school, located in Qawra, will be ready by September. However, it is evident the new building is far from completion.\nA number of mobile classrooms already exist at the 1956 St Paul’s Bay school. Installed about three years ago, they host tens of primary students in a locality with a bursting population. Over the past three years, the locality’s population grew by 26 per cent, mostly through immigration, becoming the island’s largest town.\nEducation Minister Evarist Bartolo had promised a new school in the locality would open in 2015. However, problems at the FTS, including the resignation of top officials, corruption claims and delays in the tendering process, led to delays, with the latest target date being September 2019.\nAsked to give more details on the placing of mobile classrooms in St Paul’s Bay and Żejtun schools, both the Education Ministry and the FTS did not reply by the time of writing.\nSome parents whose children were accommodated in mobile school rooms said the temporary classrooms were comfortable but others complained they were inadequate, cold and very claustrophobic.\nTeachers who spoke to the newspaper commented that, in this day and age, such classrooms were not ideal for educating children. “We should have never arrived at this pitiful situation,” a seasoned educator told this newspaper. “It shows our systems are failing,” she added.\n ", "comment_count": 13, "id": 1204}, {"keywords": "", "author": "", "article_body": "These are the main stories in Sunday’s newspapers.\nTimes of Malta says students at State schools struggling with traditional teaching methods will from September be able to take subjects that focus on hands-on learning. In another story, the newspaper says hundreds of millions of euros in suspicious transactions linked to an international diesel smuggling racket were discovered at Paceville’s Satabank.\nThe Malta Independent says the Corinthia controversy has exposed questionable National Bank debts.\nMalta Today says the toll income from the Gozo tunnel will not cover the investment that needed to be undertaken to build it.\nIt-Torċa says Anthony Formosa’s murder in Somalia had been planned and port insiders assisted in its execution.\nIllum says Gozitan Nationalists were being pushed aside by their party.\nKulħadd says 99% of school children are being served by free transport.\nIl-Mument says the government has failed in the pensions sector.", "comment_count": 0, "id": 1205}, {"keywords": "", "author": "", "article_body": "Tunisian State visit\nTunisian President Beji Caid Essebsi arrived in Malta for a two-day State visit where he held talks with President Marie-Louise Coleiro Preca, Prime Minister Joseph Muscat and Opposition leader Adrian Delia. During his visit Mr Essebsi addressed the Malta-Tunisia Business Forum and a conference entitled ‘Empowering Gender Equality’. In an interview with the Times of Malta prior to arriving in Malta, the Tunisian President said he believed there was an opportunity for the Maltese private sector for the recruitment of skilled and qualified Tunisian youths.\nWhat made the headlines\n40-week waiting time at Mater Dei outpatients: Lengthy waiting times for outpatient appointments were singled out by the European Commission, with a new report saying Maltese were waiting an average of 40 weeks for a first appointment at the national hospital.\nOlaf asked to probe SVDP ‘corruption’: Reports of alleged abuse of EU public procurement rules in the provision of multi-million direct orders for cleaning contracts at St Vincent De Paul have reached Brussels in a formal request for an investigation, the Times of Malta revealed. Sources in Brussels confirmed to the newspaper that a number of documents claiming abuse were sent anonymously to the President of the European Commission Jean Claude Junker and also to OLAF, the EU’s anti-fraud office.\nPaul Anthony Formosa\nTerrorists shoot dead Maltese port manager in Somalia: Gunmen from the terrorist group Al-Shabaab shot dead a Maltese port manager in Somalia on Monday morning. Paul Anthony Formosa, 52, from Marsascala, was killed in Bosaso Port, in the semi-autonomous Puntland state, where he worked at P&O Ports, a subsidiary of the Dubai-based global operator DP World, from August 2017. One of the gunmen was shot dead by security forces, while the second was captured after having been injured while trying to escape. Unconfirmed media reports say the second killer later died in captivity. Mr Formosa worked at the Malta Freeport until 2011 before taking up the post of operations manager at Lattakia in Syria. Al-Shabaab the killing was “part of broader operations targeting the mercenary companies that loot the Somali resources”.\nChurch fund to tackle inequality: A new Church fund, the Voluntary Solidarity Fund, will help tackle the growing economic inequality on the island, Auxiliary Bishop Joseph Galea Curmi announced. Former Central Bank Governor Josef Bonnici, who will oversee the new fund, said the fund will focus on helping get people back on their feet through interest-free loans for business start-ups, training and further education.\nMobile classrooms as State schools can’t cope: Children in some State schools may have to attend lessons in mobile classrooms because no more space is available to accommodate increasing student populations, the Times of Malta revealed. Sources said the “growing crisis” hitting the State education system led to arrangements being made to install mobile classrooms at St Paul’s Bay primary and Żejtun’s secondary schools as from next academic year.\nMinisters should not invite only selected journalists: Inviting selected journalists to events attended by ministers did not amount to good practice and should be discouraged, the Commissioner for Standards in Public Life, George Hyzler, said in his first decision. Dr Hyzler was responding to a complaint made by the Times of Malta last November that Tourism Minister Konrad Mizzi failed to inform it and, possibly, other media houses, about an event at the Malta Film Commission where he gave interviews only to One News and PBS.\nMalta’s freedom ranking downgraded: Malta’s freedom ranking has again been downgraded by Freedom House, a Washington-based democracy monitor, with researchers blaming the “inefficacy of the country’s anti-corruption institutions”. According to its latest report Malta’s score dropped one point to 91 out of 100. The country’s score has been on a downward trend for the past couple of years, dropping to 92 points in 2018 from 96 in the previous year.\nPN leader proposes ‘stalwarts’ for President: PN leader Adrian Delia has proposed three Nationalist ‘stalwarts’ for the post of President, the Times of Malta revealed, namely Lawrence Gonzi, Tonio Borg and Louis Galea. Press reports, however have indicated that former Labour minister George Vella will be President Marie-Louise Coleiro Preca’s likely successor.\nNew Corinthia deal ‘in coming days’: A draft deed proposing to give the Corinthia Group the right to use public land for speculation purposes was temporarily withdrawn. Tourism Minister Konrad Mizzi told Chris Fearne, chairman of the parliamentary National Audit Office Accounts Committee, that a new draft deed would be submitted “in the coming days”. The original draft was met with harsh criticism by the Opposition and business community. Sources said the government was seeking ‘legal avenues’ to rewrite the deal, avoiding State aid complications.\nWhat trended\nChurch attendance\nChurch attendance levels have reached historic lows and are set to fall even further, a census released recently suggests.\nComing just days after statistics indicated that civil marriages have overtaken the number of Church ones, the news came as a tough pill to swallow for parishioners and the faithful.\nReaders had several suggestions to make.\n“Let me set out a very simple pastoral plan,” suggested Lauren. “It’s the one Jesus used; sell all you have and give to the poor”.\nSell all you have and give to the poor\n“The Church must move with the times,” argued John, who called for women and married people to be allowed to become priests. “If the Church does not change some of these restrictive rules, it will keep losing people left and right,” he warned.\nBut for every John, there was one J.\n“A sure recipe for extinction,” he snapped back. “That’s exactly what the Anglican and many protestant denominations did, follow your suggestions to the letter, and they have become as dead as doornails”.\nJoseph felt the Church’s response to the critical Mass attendance figures – which involves more assistance to society’s vulnerable – was “altruism gone mad”.\n“Ayn Rand would have a lot to say about this,” he wrote.\n‘Useless’ 1c and 2c coins\nIs it time we bid farewell – or even good riddance? – to 1c and 2c coins?\nIt’s a question the Times of Malta asked this week, in an article which prompted lively discussion online.\n“1 cent is still money, 100 of them are rather significant,” noted Stefania, who suggested a different way of cutting down on coins. “How about €1 and €2 in paper money instead? It would make your purse a whole lot lighter”.\nMany others were more keen to ditch the coins, arguing that they were “useless”.\nBut not everyone was impressed by retailers’ suggestion to round prices up to the nearest 5c.\n“If a 4c difference is minimal to the consumer, it should be minimal to retailers too,” argued S.\nCharles was also a rounding-up sceptic, saying that while most people would round €1.41 or €1.42 down to €1.40, retailers had different ideas.\n“And then they complain that people purchase directly online from abroad,” he muttered.\nWhat they said\n“We are nationalists. We do not sell citizenship. We create. We have faith in our people. We are capable of selling services and talent, not our country’s citizenship.”\nNationalist Party leader Adrian Delia, speaking at a political activity in Valletta, where he criticised the Maltese government’s sale of passports.\n“There is no such thing as an ‘Arab Spring!’”\nTunisian President Beji Caid Essebsi, answering a question by the Times of Malta about democracy in the Arab world, and why Tunisia is the only success story of the ‘Arab Spring’.\n\n“Human life is so precious that we wish the very best for the child when it is still in the womb even when it is only a mass of cells. It is not the number cells that determines whether it is a human life or not.”\nAuxiliary Bishop Joseph Galea Curmi speaking during Mass at St John’s Co-Cathedral on the occasion of the International Day of Life.\n“Malta’s heritage, including Valletta’s landscape, is being destroyed for cursed money. I beg all Maltese, especially the younger generations, to remain attached to our rich cultural heritage.”\nArchbishop Charles Scicluna speaking during the launch of a book on a collection of 18th century statues adorning the Mdina Metropolitan Cathedral museum.\n\n“Bottom line: when I said that Konrad Mizzi is corrupt, I was damn right.”\nFormer PN leader Simon Busuttil standing by his accusations of corruption against Konrad Mizzi as the minister dropped libel cases against him and other MPs and the Times of Malta. The cases related to allegations of money laundering in connection with the Panama Papers.", "comment_count": 1, "id": 1206}, {"keywords": "", "author": "", "article_body": "An 86-year-old woman from Ħamrun was grievously injured in a traffic accident on Sunday morning.\nThe woman was a passenger in a BMW 520 that was being driven by a 74-year-old man from Attard. Another passenger, a 62-year-old woman from Marsa, was slightly injured.\nThe police said the accident happened in Triq Mikiel Anton Vassalli, St Julian's, at 1.30am.\nThe BMW was involved in a collision with a Ford Fiesta that was being driven by a 30-year-old Romanian man who lives in Valletta.\nA medical team was called on site to assist the women. They were taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1207}, {"keywords": "", "author": "Ivan Martin", "article_body": "“Hundreds of millions of euros” in suspicious transactions linked to an international diesel smuggling racket were discovered at Paceville’s Satabank – considerably more than investigators had originally expected to uncover, The Sunday Times of Malta has learnt. \nThe Maltese Police and Financial Intelligence Analysis Unit are both combing through a network of “dozens” of shell companies linked to Maltese, Sicilian, and Libyan diesel smugglers, and their associates, often concealed behind minority shareholdings, which were discovered as having held accounts at the beleaguered bank.\nThey believe the Paceville bank could have been the primary avenue through which the bulk of funds from the international criminal operation were being laundered.\nLast month, The Sunday Times of Malta had reported how billions of euros in suspicious transactions through Satabank were under investigation, with ties to a cornucopia of criminal activity. \nAll 12,000 of Satabank’s accounts were effectively frozen by the Malta Financial Services Authority last October, with EY (formerly Ernst and Young) appointed to administer the bank’s assets in “the best interests of depositors”.\nThe move came after a joint inspection and audit by the Malta Financial Services Authority and FIAU last year found shortcomings in the bank’s anti-money laundering procedures.\nMeanwhile, The Sunday Times of Malta is informed that the Police’s Economic Crimes Unit and the FIAU are both trying to make sense of the complex web of accounts that they believe were used to conceal and launder the proceeds of the multi-million fuel smuggling racket.\n“White collar criminals” who are believed to have facilitated the crime, and possible ties to other smuggling operations – particularly linked to cigarettes and narcotics, are also being probed on the periphery of this investigation, sources said.\n“It isn’t as straightforward as opening an account and putting the money from the criminal activity into it. This is a deliberate concealing exercise called layering that makes it very difficult to unravel.”\nExercise called layering\n“To make matters worse, the more we dig, the more links to other criminal activity we discover that appears to have been going on through this bank,” a senior source said. \nThey added that Italian financial investigators had also started digging into the “mess” of corporate and client accounts that were used at the bank to move questionable funds.\nThe fuel smuggling operation, which had started following the 2011 collapse of Libya’s Gaddafi regime, evolved into a large criminal organisation coordinated by Maltese smugglers, Libyan militia and Sicilian businessmen with ties to the Mafia.\nThe Sunday Times of Malta has published several reports on the criminal activity, including collaborative reporting as part of the Daphne Project which has seen 18 media organisations in 15 countries team together.\nIn October 2017 former Maltese footballer Darren Debono and his business partner Gordon Debono – a fuel trader – were both arrested separately in Lampedusa and Catania as part of an Italian crackdown on fuel smuggling ring.\nSicilian fish trader Nicola Orazio Romeo, who has alleged links to the Mafia, and Libyan militia chief Fahmi Ben Khalifa had also been identified by Italian authorities as being major players in the operation.\nAccording to Italian investigators, Libyan fuel was smuggled out of Libya with the help of armed militia. It was moved from oil refineries near the port city of Zuwara in Libya’s northwest corner, with tankers full of refined diesel sent to Libyan ports for irregular shipping.\nA fleet of mostly fishing boats with large storage tanks would then carry the fuel out to sea where small tankers owned by Maltese businessmen and Sicilian gangsters would be awaiting for ship-to-ship transfers.\nThe shipments were then transferred onto larger tankers bunkered at Malta’s Hurd’s Bank. And they grew more audacious, even emptying their loads directly at sites in Grand Harbour or into privately-owned fuel storage tanks in Birżebbuġa.\nOnce the fuel was laundered using falsified certificates, it would be sold on to mainland Europe and end up in the cars of motorists at pumping stations all across the continent. The racket it believed to have generated several hundred million euros over a period of around five years.\nSources said the local players involved were considered to be “connected and dangerous” – describing the operation as the “Wild West” in and around Maltese territorial waters. \n“These aren’t good guys – far from it,” one source privy to details of the investigation said.  \nAs for Satabank? Tens of billions of euros in transactions passed through the Paceville bank during its four years of operation and investigators believe as much as half of these were “high risk and highly suspicious”. \nInvestigations by the authorities as to whether or not the bank’s management should bear any criminal responsibility were still at an early stage, sources said.\n ", "comment_count": 97, "id": 1208}, {"keywords": "Environment", "author": "", "article_body": "December 1900 marked the first ever ‘Christmas Bird Count’ in the US. Its aim was to get people counting bird species rather than killing them, and it’s now an annual tradition.\nParticipants in a Green House orchid survey in Malta, which started this month. Citizen scientists are the key source of data collection in surveys aiming to contribute invaluable data needed to assess the country’s diverse and beautiful orchid species (bottom), their distribution and status across the islands.\nEvery year on a specific day between December 14 and January 5, thousands of ordinary citizens gather together in more than 2,000 locations across the Western hemisphere to count birds. The data these volunteers collect is given to conservation biologists who use it to assess bird populations’ health and observe long-term trends.\nThis was probably the earliest recorded example of ‘citizen science’. This term is used in many ways. In its broad sense, citizen science is about scientists collaborating with members of the public in scientific projects. This gives people who are not traditionally involved in science and gathering data, the opportunity to become active contributors to real science.\nSuccessful scientific studies rely on evidence collected in research. This is no less so for biodiversity conservation projects. Scientists need to understand where the species they want to protect lives, how and when it reproduces, what it eats and where it migrates to before we can find a way to protect it.\nCitizen science provides an opportunity to gather large amounts of information that would otherwise be impossible to collect because of time constraints and limited resources. Citizen science thus gives scientists the ability to expand research taxonomically, geographically and temporally.\nAlthough citizen science currently has a supportive role in conservation and ecology, an increasing number of researchers are recognising its benefits and are working with citizen scientists.\nThis is just as true in Malta as it is elsewhere in the world. More and more people in Malta are becoming citizen scientists, and the benefits are huge both for them as individuals and for science on the islands.\nCitizen science [is] a vital step towards democratising science\nIn Malta, Green House volunteers monitor and record data on orchids and bees while out on nature walks. They also monitor and record bat sightings by going on night walks in towns and villages or simply from the comfort of their own backyard by using specially provided bat detectors. Data from these citizen science projects are actively contributing to local biodiversity databases and distribution maps.\nBut the contribution of citizen science goes beyond just gathering or unravelling data. Enthusiastic volunteers also bring their own computer equipment and technological skills to assist with number crunching and data analysis. They fill in knowledge gaps by providing scientists with extra hands, eyes, computers, cameras, smartphones and vehicles.\n\nHowever, like any scientific tool, there are limits to what citizen science can accomplish. Citizen science can get complicated when there are large groups of people involved and it requires a considerable amount of management from organisation to skills training. Not surprisingly, criticism of this kind of collaborative scientific research normally revolves around the accuracy or quality of data collected by people who are not experts in a scientific field.\nInclusivity is also a particular challenge when it comes to citizen science projects. It can be difficult to involve people who don’t have their own transport or access to smartphones, computers and internet.\nYet despite its challenges and limitations, citizen science plays an important role in global conservation initiatives. It can inspire people to take an interest in science and enthuse young people about careers in science. It is also a practical, hands-on way of engaging the public in science which directly affects their physical environment, bridging the gap between society and the scientific community.\nBy giving the wider society the opportunity to be part of the scientific process, citizen science serves as an educational tool for people to become more scientifically literate. This creates more knowledgeable and constructive dialogue between experts and non-experts; which is what makes citizen science, above all, a vital step towards democratising science.\nAnyone can start contributing to the conservation of Malta’s flora and fauna by joining any of the research projects being conducted by Green House. To stay informed about its various volunteering opportunities and for more information, visit its Facebook page below or e-mail green.uom@gmail.com.\nhttps://www.facebook.com/greenhouse2008", "comment_count": 0, "id": 1209}, {"keywords": "Environment", "author": "", "article_body": "One of the key culprits for the mounting plastic pollution problem is the staggering amount of single-use plastic we still consume and throw out daily. From bottles to straws to plastic bags, the world produces and consumes roughly one trillion tons of plastic each year, only half of which is disposable.\nThat’s nearly two million pieces of plastic thrown away every minute. This plastic usually finds its way into a landfill, where it will be buried for years or get thrown or blown into the sea where it has a deadly effect on marine life.\nThings are looking more positive, however, as people everywhere wise up to the urgent need to reduce plastic use. Moreover, scientists recently accidentally discovered bacteria that have naturally evolved to eat plastic. This could lead to teams of scientists creating a mutant enzyme which will break down plastic bottles. A breakthrough like this could help solve the global problem of plastic.\nA team of researchers at the University of Malta has also jumped onto this eco bandwagon and a university-led research programme is looking at possible ways to accelerate the deterioration of plastic sold commercially in Malta, with a special emphasis on plastic bottles, containers and shopping bags. \nUniversity lecturer and research scientist Gabrielle Zammit is leading the team of both undergraduate and postgraduate students in concentrating their efforts on single-use plastic packaging that is in use for a very short time, and which subsequently lingers indefinitely in the environment.\nThis research, which is being funded by the Gasan Foundation, aims to find a way of reducing the lifetime of plastic in the environment after it is discarded, by breaking it down completely to leave only harmless molecules as a by-product. The team is currently working with microbes that are naturally occurring and have not been genetically modified.\nApart from the experiments conducted using these aforementioned promising micro-organisms the team is also investigating how single-use plastics break down in soil and sea water, which will give a clearer understanding of the  deterioration processes that occur due to naturally occurring microbial communities.\nWhile the research has already yielded some positive results for simple plastic polymers, the challenge remains in breaking down the plastic that is sold commercially due to the additives added during the manufacturing process that make superior quality materials useful as packaging products.\nThe Gasan Foundation is supporting this initiative, which will ensure the completion of the initial phase of the research.", "comment_count": 0, "id": 1210}, {"keywords": "Gozo", "author": "", "article_body": "The oldest surviving windmill in Gozo is being given a much-needed facelift after the Planning Commission approved restoration works on the historic building.\nCommissioned by Grand Master Perellos in the beginning of the 18th century, the windmill at Xewkija is the only one with a tower based on an octagonal base.\nThe windmill’s mechanism is also being reconstructed by the Gozo Ministry workers.\nThe windmill, on the way to Victoria, started operating in 1710 by miller Ġanni Scicluna. Later on, the windmill was operated by his son Michele.\nThe windmill consists of a large entrance hall, two large parallel rooms and a kitchen at the back. In the middle there is the winding staircase leading up to the roof of the tower. Above the entrance hall is a birth room.\nIn 1956, the windmill served as the first location of the Xewkija Band Club. The band club’s committee used the site until 1965. Since then the windmill has remained empty and unused.", "comment_count": 0, "id": 1211}, {"keywords": "Education", "author": "Carm Cachia", "article_body": "The demand for IT professionals is growing consistently. In 2019, it was estimated that the demand for IT professionals was just under 6.2 million, while there was a supply of just under six million.\nThere has also been a corresponding increase in demand for IT professionalism in the sector. This is not a coincidence especially with the advancement in technology and emerging technologies in artificial intelligence, robotics, Internet-of-Things, big data, high-performance computing, nano-technology and others.\nCybercrime and fraud have also increased at the same pace, perhaps the same technology has presented them with more opportunities. Business and government have responded with the emerging of standards and practices like the EU General Data Protection Regulation (GDPR), cybersecurity, ethical hacking, the blockchain, process analysis, and so much more.\nBut is this enough? Arguably the most important and probably the most unnoticeable aspect against all technology malpractices is the ethical behaviour of IT professionals. IT professionals have an important responsibility of exercising their profession in the right and correct manner. During their career they will surely be faced with many challenging situations where they will put ethics into practice.\nEthics are usually defined as a set of principles that govern a person’s behaviour or the conducting of an activity. It is therefore common and very important that professions have a set of principles, usually entitled as a ‘code of ethics’ that are public and mandatory for members of the profession.\nThe older professions are very well established and are regulated by law. But for the ICT sector, a coherent ethical framework is lacking when compared with medicine, law and engineering, which have codes of ethics and penalties in place for non-compliance.\nEmerging technologies increase the need for compliance to a common set of European code of ethics\nHowever, it must be also recognised that ICT has many associations, with members obliged to uphold a specific code of ethics during their practice. These include professional bodies like the British Computer Society, the Association for Computing Machinery, the Institute of Electrical Engineers, the Computer Society of Malta, the Chamber of Professional Engineers (Malta) and others. But only a proportion of IT professionals and practitioners belong to these bodies, also because they need a high level of qualifications and experience to be members.\nIn 2016, as part of the launch of the European Framework for IT Professionalism, a set of ethical guidelines were released to serve the interests of the public and society, employers, clients, the informatics profession and its practitioners. These are also a value proposition for organisations to develop a code of ethics as guidelines for their ICT practitioners.\nNow is the right time to develop the ICT profession further. The implementation of the emerging technologies mentioned earlier increases the need for compliance to a common set of European code of ethics.\nIt was, therefore, opportune that the European Committee of Standardisation (CEN), through its TC428 technical committee, started work on such a project. Through the eSkills Malta Foundation, on behalf of the Malta Competition and Consumer Affairs Authority, the Maltese standards organisation, Malta is working on these ethics together with other European counterparts in the CEN TC 428. The Foundation looks forward to the further development of the Maltese IT profession and hopes to bring it on par with other European countries.\nCarm Cachia is chief administrator, eSkills Malta Foundation.\nhttps://eskillsalliancecms.gov.mt/en/pages/home.aspx\nhttps://www.facebook.com/eskillsmalta/", "comment_count": 0, "id": 1212}, {"keywords": "Gozo", "author": "", "article_body": "The feast of St John Bosco was celebrated at the Don Bosco Oratory in Victoria last Sunday. Gozo Bishop Mario Grech concelebrated Mass with the participation of the Chorus Urbanus, followed by the blessing of animals by Mgr George Tabone at St Augustine Square. The procession with the statue of St John Bosco, accompanied by La Stella Band, was held in the evening. The festivities were concluded with a concert by the Gozo Youth Wind Band under the direction of Mro Joseph Grech.", "comment_count": 0, "id": 1213}, {"keywords": "Education", "author": "", "article_body": "The theme of the forthcoming session of Kids Dig Science is circuits. Although they are everywhere in phones, washing machines or even in our own bodies, for the lay person they usually remain hidden and unnoticed throughout the day.\nKids Dig Science will be combining theory with practice by allowing children to experiment with circuits in a safe and exciting way, thereby teaching them the how, why and where of circuits. This series of monthly events are aimed at educating children by breaking down scientific concepts into bite-sized pieces of information and displaying them in fun ways that children can relate to. By bringing together education and fun, the organisers prompt their young audiences’ curiosity in an entertaining fashion.\nThe next session will be held on Saturday from 3 to 5pm at Spazju Kreattiv, St James Cavalier, Castille Place, Valletta.\nTo book tickets, visit www.kreattivita.org.", "comment_count": 0, "id": 1214}, {"keywords": "Gozo", "author": "", "article_body": "The Gozo College celebrated the second edition of the multicultural week. The motto of the celebration was ‘Equal Respect for Cultural Diversity’. Throughout the week, the students took part in various events in their classrooms, led by College Principal Denise Mifsud. The week came to a close with a multicultural celebration at Għajnsielem Primary School. Various schools presented items representing different countries, with the participation of the Gozo College Band. Fifteen per cent of the Gozo student population is made up of foreign students coming from 42 countries. The performance was attended by parents, Gozo Minister Justyne Caruana, Gozo Bishop Mario Grech and Dr Mifsud. The show was compered by Nathan Sanchez and Melissa Pretenjak.", "comment_count": 0, "id": 1215}, {"keywords": "Education", "author": "", "article_body": "Heads of schools recognise that positive relationships between teachers, students and their parents are important for the success of the school, but in the absence of this, the energy of school leaders shifted from teaching and learning – the core task of school leadership – to solving hitches and conflicts. This was the main finding of a PhD thesis entitled ‘Enhancing positive relationships for effective leadership in Maltese schools,’ undertaken by David Debono for which he was recently awarded a PhD by the University of Sheffield.\nDavid Debono\nDr Debono’s PhD thesis adopted a case-study approach in a State college in Malta and used semi-structured interviews, focus groups and questionnaires, and offers practical insights for educational leaders to enhance school leadership through positive relationships.\nThe major outcome of Dr Debono’s research study is a conceptual framework presented in a cyclical model, showing clearly that communication, trust, motivation, sense of community, and the fact that people matter, all result from positive relationships\nThe data confirmed that these themes all contributed to enhancing school leadership, and Debono’s PhD thesis referred to the term ‘Leadership that loves’ to describe a focus on leadership in schools that features care, respect and love. The research findings indicate that the link between positive relationships and the emerging themes is highly dependent on how a school leader goes about nurturing all of these qualities.\nDr Debono’s examiners said his thesis was “very strong” and addressed a gap in knowledge – that of positive relationships of school leaders with teachers and students, adding that the concept of ‘Leadership that loves’ made the study significant for the society we are living in, which is characterised by a constantly changing and turbulent world, where school leaders were being faced with an environment that includes issues such as migration, fragmented families, injustices and acts of terrorism, extreme politics and divisions.\nThey also commented that the use of appropriate methods, concepts and thorough analysis in Dr Debono’s thesis ensured its rigour and potential to foster changes in practice and policy, also in the Maltese context.\nDr David Debono holds a BEd (Hons) in Mathematics from the University of Malta and an MSc in Educational Leadership from the University of Leicester. His PhD research study at the University of Sheffield was partially funded by the Endeavour Scholarships Scheme.", "comment_count": 0, "id": 1216}, {"keywords": "Gozo", "author": "", "article_body": "An exhibition of hand-made crafts and other art products produced by Gozitan grandparents was inaugurated by Gozo Minister Justyne Caruana and Parliamentary Secretary Anthony Agius Decelis (pictured) at the Gozo Ministry’s exhibition hall. The exhibition was part of an evening’s programme of song and dance organised by Nanniet Malta (Gozo branch), together with the Nanniet Malta Foundation, at the ministry in Victoria. Dr Caruana, Mr Agius Decelis, Diocesan Vicar General Mgr Tarcisio Camilleri and Nanniet Malta founder-president Philip Chircop addressed the gathering, which included a group of grandparents from Malta.", "comment_count": 0, "id": 1217}, {"keywords": "Education", "author": "", "article_body": "Auxiliary Bishop Joseph Galea Curmi recently visited St Paul’s Missionary College, Rabat, the school that he himself used to attend.\nThe visit started with Mass in the Senior School to celebrate the Conversion of St Paul. Concelebrating the Mass were members of the Missionary Society of St Paul, including Fr Bernard Mangion, who was the rector during Mgr Galea Curmi’s school days. \nMass was said to celebrate the Conversion of St Paul\nAfter Mass, together with the present rector Fr Clinton Farrugia and acting headmaster James Aquilina, Mgr Galea Curmi spent the rest of the morning visiting the school premises, rekindling memories of past lessons and teachers, and to see the changes that have taken place to school grounds and its surroundings since he left.\nHe met members of the senior staff and blessed the recently renovated staff room. He expressed his gratitude for the individual attention and holistic formation that he and his fellow students received at the school and expressed the hope that this practice would continue.\nMgr Galea Curmi later met the Junior School pupils for a moment of prayer and to take part in a question and answer session which enabled them to come to know the bishop better.", "comment_count": 0, "id": 1218}]