[{"keywords": "Court, Politics, Adrian Delia", "author": "Edwina Brincat", "article_body": "Lawyers for Opposition leader Adrian Delia are calling for three ministers to explain under oath how they obtained information from the Egrant report which had clearly not formed part of the published conclusions.\nThis call was made on Monday morning at the first hearing of the appeal proceedings filed by Dr Delia after the First Hall, Civil Court in its constitutional jurisdiction had turned down his application to have a full copy of the report drawn up by former magistrate Aaron Bugeja.\nLawyer Vincent Galea said government Ministers Edward Scicluna, Chris Cardona and Konrad Mizzi, when testifying in separate proceedings, had cited a paragraph from the Egrant report that had not been included in the 50 pages of published conclusions.\nThe lawyer requested that these ministers should be summoned to testify about this fact.\nThe request was immediately rebutted by Attorney General Peter Grech who said that these amounted to facts extraneous to the appeal proceedings.\nHowever, Dr Galea insisted that after being told that the AG had given a copy to the Prime Minister, the Justice Minister, the head of government communications Kurt Farrugia as well as lawyer Pawlu Lia, it had emerged that three other ministers obviously had information drawn from the report.\nThis fact had come to light after the Opposition Leader had filed his appeal, Dr Galea argued.\nIn the light of this request, the court, presided over by Chief Justice Joseph Azzopardi, and Mr Justices Giannino Caruana Demajo and Noel Cuschieri, directed Dr Galea to file a written application, to which the AG would file a reply.\nFinal oral submissions on the request would be made at the next hearing, after which the Court would deliver its decision on the matter.\nThe case was adjourned to July 15. Lawyer Victoria Buttigieg was also assisting the AG.", "comment_count": 0, "id": 1619}, {"keywords": "Accident, Construction", "author": "", "article_body": "A 20-year old construction worker suffered grievous injuries when he fell from scaffolding during works at a school.  \nIn a statement, the Police on Monday said that the man, from Guinea, had fallen from a height of around a storey and a half during works at a school in Fgura. \nIt was not clear why the man had fallen, but the police said he was being treated at Mater Dei Hospital. \nInvestigations are ongoing. ", "comment_count": 0, "id": 1620}, {"keywords": "Society, Human rights, Gender", "author": "Claire Caruana", "article_body": "The Commissioner for Children has chosen to stay out of the controversy over protection of the unborn, saying the United Nations Convention on the Rights of the Child does not outline when life is considered as having started.\nPauline Miceli was answering questions from Times of Malta after a newly-formed group of doctors against abortion called on her to take “an unequivocal stand to protect the unborn child”.\nAbout 670 doctors, including President George Vella, joined forces to form a group called Doctors for Life last month to declare their stand against abortion, insisting life starts at conception.\nThey challenged the Commissioner to “fulfil her statutory role and unambiguously state her position in defence of the life of the pre-born child”.\nThe Office of the Commissioner for Children was set up in 2003 to promote the welfare of children in compliance with the Convention, ratified by Malta in 1990.\nThe UN Convention on the Rights of the Child is a human rights treaty which sets out the civil, political, economic, social, health and cultural rights of children.\nAsked on her position by Times of Malta, Ms Miceli said the Convention was vague on the definition of “child” and it referred only to the age of 18 as the point when children are no longer considered as minors.\nThe Convention does not outline when life is considered as having started, she said, and despite 30 years of discussion on the issue, the matter had not yet been resolved.\n“There are those who believe the child starts enjoying rights at conception, others say at some point throughout the pregnancy and others when the baby is born. The Office believes it should not be part of this controversy and follow the Convention.”\nShe also referred to the rules outlined by the International Court of Justice. “On the issue of which life should be protected, whether that of the pregnant girl or the baby that is growing inside of her, the International Court of Justice states that [the life] of an adolescent girl is above anything else,” Ms Miceli said.\nHer office, she added, insisted on the importance of sexual and reproductive education “from a young age” and this should be mandatory in order to avoid such situations.\n“Apart from this, the services provided to pregnant children and their families should also be strengthened.”\nLast month, the Commissioner said in a statement that unborn children should be better protected by introducing better antenatal health and social services and stronger family units rather than through changes to the law.\n“Heavy-handed approaches which risk making the pregnant woman feel like or actually reduce her to the status of a quasi-surrogate mother are not conducive to the child’s best interest,” her office declared.", "comment_count": 39, "id": 1621}, {"keywords": "Politics, Gozo", "author": "Ivan Camilleri", "article_body": "The overwhelming majority of procurement of goods and services by the Gozo Ministry last year was carried out through direct orders despite strict EU rules dictating this method should only be used as a last resort.\nInformation published recently and analysed by Times of Malta shows that in 2018, the Gozo Ministry procured services, paid through taxpayers’ money, for over 90 per cent of the cases.\nA total of 146 direct orders were issued for goods and services costing over €7.4 million over 12 months.\nGoods and services procured without any competitive process range across all types of supplies and services, including hiring people to drive to fuel for Gozo Channel’s vessels.\nMinister for Gozo Justyne Caruana\nRecipients of direct orders include a range of beneficiaries, from church institutions to football clubs.\nMinistry officials, who spoke on condition of anonymity said that while some direct orders were justified, most of the time, this was a case of “Gozo politics”.\n“Gozo is very particular and the ministry acts like a large local council distributing funds to keep everyone happy,” said the official, who has been working at the ministry for many years. Gozo Channel made the most use of direct orders, some of them worth hundreds of thousands.\n“Under the PN, everyone used to criticise Giovanna Debono for running the island like a fiefdom. Now [under Minister Justyne Caruana] it’s much worse as tenders have become a rarity and direct orders the rule. It has gone to an extreme,” he said.\nTimes of Malta is informed that despite various ‘informal’ warnings by the Finance Ministry to adhere to procurement rules and avoid as much as possible the use of direct orders, the Gozo Ministry continued to dish out contracts.\nQuestions sent to the Gozo Ministry asking for an explanation remained unanswered by the time of writing.\nMinistry acts like a large local council distributing funds to keep everyone happy\nThe list shows that Gozo Channel made the most use of direct orders, some of them worth hundreds of thousands.\nIn one particular case, Gozo Channel paid directly Falzon Fuel Services over €1 million for fuel, which can be supplied by other suppliers.\nGozo Channel also paid hundreds of thousands in direct orders for many of the services needed, including personnel for security, mooring and seamen.\nMost of the recipients of these lucrative contracts were given to security companies, including one owned by Stephen Ciangura, the driver of Malta Council for Science and Technology (MCST) chairman Jeffrey Pullicino Orlando.\nIn its procurement of legal services, which last year was compounded by the issue of a fast ferry tender, currently under scrutiny by the court and the Public Contracts Review Board, it issued numerous direct orders to Ganado Advocates for the procurement of legal services.\nFootball club Kerċem Ajax was given a €36,704 contract to provide yoga classes for the elderly while the Franciscan Friars, a religious order, was paid €700,000 to rent the Gozo Ministry a villa in Birkirkara to start hosting Gozitan students while studying in Malta.\nSome of the highest-paid direct orders\n\n\n\nDirect Order\nTask\nValue\n\n\nDavid Spiteri Gingell\nChange management at Gozo Channel\n€75,747\n\n\nExecutive Security Services\nSecurity at Gozo Ministry\n€65,889\n\n\nHealth Services Gozo Ltd\nTwelve long-term care beds at Villa San Lawrenz\n€133,152\n\n\nGrange Security Malta\nSecurity officers for Gozo Channel\n€82,000\n\n\nSecurity First Ltd\nSeamen, cleaning and mooring men for Gozo Channel\n€291,000\n\n\nGanado Advocates\nLegal services\n€145,000\n\n\nFalzon Fuel Services\nSupply of marine oil for Gozo Channel\n€1,060,000\n\n\nSignal 8 Security Services\nMooring men for Gozo Channel\n€130,000\n\n\nExecutive Services Security Ltd\nSeamen services for Gozo Channel\n€130,000\n\n\nFranciscan Friary\nRent of Villa Lauri for 15 years\n€700,000\n\n\nGNI Ltd\nPlans and permits for Notatorium\n€70,000\n\n\n2CeeMedia\nInstallation of crash barriers\n€66,050\n\n\nWirt Għawdex\nPersonnel for Ċittadella \n€107,726", "comment_count": 8, "id": 1622}, {"keywords": "Finance, Economy", "author": "", "article_body": "Bank of Valletta has said that it is already taking action to meet the reforms laid down by the European Central Bank, and that it is committed to investing to ensure this was done.\nThe Sunday Times of Malta reported on a letter received by the bank from its local regulator, the MFSA, which recommended a number of actions to the bank, pointing out shortcomings at board and management level.\nThe bank was given until Friday to confirm what action it would take. Although the ECB only made recommendations, the bank’s rating could be downgraded if it fails to take action, which would have profound implications.\nRELATED STORIESBOV given until Friday to agree to hefty overhaul\nIn a company announcement on Monday, the bank said it has already submitted to both the ECB and to the MFSA a multi-year transformation programme aimed at addressing all of the issues raised by the regulators.\n“The bank is fully committed to this programme. It has already engaged the services of experienced global consultants that will assist the bank in conducting its transformation programme to strengthen the bank’s overall infrastructure, governance and controls and the risk culture at all levels of the bank,” it said.\nThe bank blamed “higher regulatory demands which are forcing banks with international operations to de-risk aggressively”.", "comment_count": 47, "id": 1623}, {"keywords": "Environment, Comino", "author": "Philip Leone Ganado", "article_body": "Updated 4pm with ERA response\nSemi-permanent camping tents have reappeared at Comino’s Santa Marija bay, with the blessing of the authorities, just months after they promised an end to the environmentally-damaging practice.\nLarge tents have been erected on an agricultural field adjacent to the old camping area, which was cleared in January after the Environment and Resources Authority (ERA) said camping would be strictly limited to a new site in the area known as Tal-Ful, close to Blue Lagoon.\nThe tents are covered by permits issued by ERA, which specifically designated the field for camping after meetings with campers together with environment minister José Herrera, one of those present for the meetings told Times of Malta.\nThis despite ERA having said in January that “such activities adversely impact on the integrity of this Special Area of Conservation” and put up notices around the area specifically banning camping, and despite the opening of the Tal-Ful campsite in recent weeks.\nRELATED STORIESWorks on new camping site in Comino set to start\nIn a statement on Monday, ERA confirmed that camping outside the designated zone at Tal-Ful was being allowed, but only with specific authorisation and subject to strict conditions. The authority insisted its statements in January referred only to \"unregulated\" camping at Santa Marija. \nThe authority did not respond to questions on its meetings with campers, and how its decision to issue camping permits for Santa Marija tallied with the Comino Natura 2000 management plan, which has for years required camping at the site to be immediately halted. \nThe Santa Marija site, part of the Comino Natura 2000 zone, is a former marshland and reed bed, scheduled for its scientific and ecological importance.\nUnder the management plan, the camping area should be cleared and the site rehabilitated, allowing for the habitat of salt-resistant trees by the beach to move into the area it now occupies, and for a dune area to be extended. \nConcerns had risen recently over the number of semi-permanent structures, often equipped with generators, occupying the area for months on end even when the owners are not on the island, leading to warnings of a developing shanty town.\nThe new campsite at Tal-Ful, close to the Blue Lagoon, opened in recent weeks\nSilvio Buttigieg, one of the farmers working the field where the tents have been set up, and a relative of Comino’s last permanent residents, told Times of Malta the field had been in active use and that residents had not been consulted over plans to use it as a campsite.\nHe insisted the field was not an appropriate site for camping and that while he was not opposed in principle to camping taking place at Santa Marija, it required better management and planning.\nMr Buttigieg, who has in recent years also been responsible for organising the Comino festa, said this year’s edition had to be cancelled as a result of the decision, as organisers had previously used the field for activities under an agreement with ERA, and had not had time to find an alternative.\nHowever, Pierre Said, who has camped at Santa Marija for years and who was part of the meetings with ERA over the ban, said the new site at Tal-Ful was not suitable as it was not easily accessible, particularly due to the need to transport camping equipment.\nMr Said insisted campers were eager to cooperate with the authorities and would welcome increased enforcement, but did not see the need for a total ban at Santa Marija.\nMeanwhile, Birdlife Malta CEO Mark Sultana said he would be immediately seeking clarification from ERA and Ambjent Malta over their intentions with regards to Santa Marija.\n“We believe Comino needs a proper management plan, in consultation with a range of stakeholders, to be implemented immediately,” he said.\nPermits issued under specific conditions - ERA\nIn a statement on Monday, ERA said no camping was allowed outside Tal-Ful - \"unless authorised by the authority\". \n\"ERA’s statements in January [that camping would not be allowed] are related to enforcement action taken in the vicinity of Santa Marija Bay and refer to unregulated activity that was being held indiscriminately,\" the authority said. \"Such unregulated activity was leading to the degradation of the important habitats in the area.\"\nERA said permits for camping at Santa Marija bay were issued \"under specific conditions\" which included precautions to prevent environmental harm and to \"respect the protection status of the area\". \nFurther conditions include limits light and noise generation, conditions for holding barbecues, as well as prohibitions of generators, liquid fuel and other combustible material, according to the authority. ", "comment_count": 126, "id": 1624}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Monday's newspapers:\nTimes of Malta shows aerial footage to prove that tents are being set up in Comino in spite of a decision for the campground to be cleared. It also reports that the Childen's Commissioner is avoiding the controversy over the 'preborns' rights.\nThe Malta Independent carries an interview with MHRA president Tony Zahra in which he says that a tunnel to Gozo would deter tourists, not attract them to the sister island. It also reports on a tweet by Nationalist MP Jason Azzopardi warning Justice Minister Owen Bonnici that he knew what the government knew about Daphne Caruana's Galizia's assassination and that the truth would eventually emerge.\nMore soon.", "comment_count": 0, "id": 1625}, {"keywords": "Aviation, Unions", "author": "", "article_body": "Last updated 4.23pm with reaction by pilots' union\nA request by Air Malta for a court to temporarily stop industrial action by the airline's pilots was upheld on Monday.\nThe pilots launched their industrial action at midnight, delaying several flights by half an hour. The industrial action was called off following the court's decision.\nPilots are reportedly angry that their collective agreement is not being respected, as well as aggrieved by a government decision to strike a deal with Ryanair to create a new airline, Malta Air. They are also insisting that the government, as the airline's shareholder, should guarantee that even if the airline folds, they would get an early retirement scheme of almost €700,000 if they retire aged 55. The government has described the claims as 'ridiculous'.\nThe airline said in a statement it had requested the court to stop the union, ALPA, \"from taking any further illegal action which is prejudicial to thecompany and its rights\". \n\nRetirement scheme packages\nOn Sunday, minister Dr Mizzi had suggested that Air Malta pilots were unhappy because they wanted the government to assure them that an early retirement scheme that allowed them to quit aged 55 with a €700,000 golden handshake would be retained “regardless of what happened to Air Malta”.\nThat scheme had been introduced by the previous Nationalist administration, he said, adding that if pilots wanted guarantees about the future, the only solution would be to work together with airline management to help the company grow.\n“We are committed to making Air Malta a success but we will not be giving out any gifts to the company’s detriment,” he said.\nRELATED STORIESAir Malta forecasts loss for 2019\nAir Malta also mentioned disagreement over retirement schemes in its statement announcing the industrial action. \n\"The interest of one section of the company must not undermine the sustainability and operation of the airline to the detriment of the company and all its employees,\" the airline said. \nIt remains unclear whether EU state aid rules would allow the government to accede to pilots' requests concerning early retirement packages even if it wanted to. \nPilots' union claims threats, intimidation\nIn a reaction, Alpa, the pilots' union, said Air Malta seemed intent on distorting indisputable facts, as well as painting a false and unclear picture of the prevalent and current state of affairs.\n\"It is now clear that Air Malta’s management team has decided to resort to half truths and measures, as well as to blatant and capricious lies, in order to cover the ineptitude and mismanagement which has become prevalent within the higher tiers of the company,\" the union said, without, however, going into specifics.\n\"Air Malta’s professional flight crew is entrusted by the airline’s passengers to safely carry out the daily core operations of the company. This is done diligently and to the utmost and best of our members’ ability, who have, on many occasions, unwillingly agreed to forego their legal rights and entitlement when faced with threats and intimidation by the airline’s management. As a necessary consequence, ALPA has had to resort to industrial action in response to the management's numerous attempts to deploy crew illegally against the stipulated procedures, as well as in response to the company’s persistent failure to address concerns relating to the safety and well-being of its members.\"\nThe union said that following the court decision, it had temporarily withdrawn industrial action until the merits of the case are considered by the court (on Friday).\nIt insisted however, that it would not be intimidated by the tactics being adopted by the airline and would, by no means, detract from its obligations towards its members, as well as its responsibilities relating to safeguarding the safety of the airline’s passengers.\nIn December 2017 Times of Malta had reported that a government idea to offer pilots a tax-free option on part of their salary had set off state aid alarm bells in Brussels.  The government had subsequently denied that it was considering the tax-free idea. \nHave you been affected by the flight delays? Tell us your story on mynews@timesofmalta.com\n ", "comment_count": 145, "id": 1626}, {"keywords": "Migration, Maritime", "author": "", "article_body": "Twenty four migrants were rescued off a small dinghy by the Armed Forces of Malta on Sunday, an AFM spokesperson has confirmed.\nThe group had come relatively close to the Maltese shoreline when a local fishing vessel spotted them and alerted authorities. An AFM vessel was dispatched to intercept them and bring them to shore.\nThe 24 migrants will be disembarked at Hay Wharf, an AFM spokesperson said.\n ", "comment_count": 0, "id": 1627}, {"keywords": "PN, Adrian Delia", "author": "", "article_body": "Five Nationalist Party members leading the charge to force a confidence vote on Adrian Delia’s leadership have accused party insiders of leaking private information to the media.\nIn a statement issued on Sunday evening, the five – Ivan Bartolo, Emma Portelli Bonnici, Mark Anthony Sammut, Emvin Bartolo and Martin Musumeci – said people \"close to the leadership\" were resorting to “divide-and-rule” tactics in an attempt to pit nationalists against nationalists and \"protect the status quo\".\nOn Sunday, newspaper it-Torċa published a list of names of people it said were among the 200 who had signed a petition calling for Dr Delia to face a confidence vote.\nRELATED STORIESDelia supporters launch counter-petition and slam 'certain' MPs\nThe newspaper claimed that it had obtained the names by speaking to PN councillors.\nThe five members indicated otherwise, saying councillors’ personal data had been “leaked to the media... with the aim of harassing and intimidating them and others who share the same opinion”.\nOn Saturday, Times of Malta reported that Dr Delia was meeting with PN councillors in an effort to drum up support ahead of a potential confidence vote, and pledging to get rid of some members of his inner circle if he were to be reconfirmed as party leader.", "comment_count": 0, "id": 1628}, {"keywords": "Crime, Swieqi, Drugs", "author": "", "article_body": "Four people are under arrest after police found several kilogrammes of suspected cocaine and heroin in a Swieqi apartment on Saturday night.\nThree men and one woman, all aged between 33 and 46 and living in Mosta, St Paul’s Bay and Ħamrun, were taken into police custody following an anti-drug operation revealed 1kg of suspected cocaine and 3.5kg of suspected cannabis, as well as a “substantial” amount of cash in the Swieqi apartment.\nMagistrate Neville Camilleri is leading an inquiry into the case.\nOne of the suspects, a Mosta man, is likely to be arraigned in court on Monday.", "comment_count": 0, "id": 1629}, {"keywords": "Family", "author": "Victor Paul Borg", "article_body": "Victor Paul Borg explores the new thinking on whether children should be cared for jointly or singly by parents following separation. This suggests that Malta’s Family Court decisions are causing unnecessary harm to public health.\nOne of the world’s foremost specialists in children’s wellbeing after marital separation has told The Sunday Times of Malta that “family law needs to evolve” to protect children’s health after family breakdown.\nWilliam Fabricius, a psychology professor at Arizona State University in the US, was speaking after publication of his latest research paper last week by the UK’s Oxford University Press. \nThe paper – ‘Equal Parenting Time: The Case for Legal Presumption’ – builds on research carried out over the past 20 years into the post-separation living arrangements for children and the ramifications on their health.\nIt has long been established that children of broken families are at higher risk of mental illness, educational underachievement, social maladjustment and poor health. These effects have become a public health concern given the soaring rates of family breakdowns worldwide – in Malta, extrapolation of statistics shows that now, more than a third of marriages split.\nThe latest wave of research shows that, rather than the separation itself, it is the post-separation living arrangements enforced or facilitated by family courts that are largely to blame for potential deleteriousness on children. Those arrangements include the placement of the children with one parent, normally the mother, technically known as SPC (sole physical custody).\nLeading scientists now maintain that JPC (joint physical custody) – popularly known as shared parenting or shared care – is itself a ‘buffer’ against the impact of separation on children’s health.\nThe scientific underpinnings of JPC and its design were detailed in a 22-page blueprint drafted by 110 leading experts and published by the American Psychological Association in the journal Psychology, Public Policy, and Law five years ago. It has been endorsed by the Council of Europe, which passed a resolution calling on member states, including Malta, to make shared parenting the foundation of family law.\nIn shared parenting, each parent, post-separation, gets more or less equal care-time with children and each remains integrally involved in the children’s upbringing.\nThis has now spawned a social and celebrity movement, as well as apps, under the buzzword of ‘coparenting’.\nMalta’s Agenzija Appoġġ has been holding courses in coparenting for separated parents since 2017.\nOutdated family courts\nConsultations with specialist lawyers show that Malta remains behind the curve: joint physical custody remains an anathema for Malta’s family courts. The law allows wide judicial discretion and case-law has evolved to strongly favour sole physical custody assigned to mothers.\n“The Family Court feels that children should be with the mother,” says Marion Camilleri, a lawyer with 15 years of experience in that court. “So unless something is faulty with the mother, the mother gets to raise the children and the father has access.”\nThe standard “access” is set at two hours on two weekday afternoons and a cycle of 24 hours on the weekend. That amounts to 16 per cent of the time, less than half the 35 per cent threshold set by social scientists for the secondary or nonresident parent in the JPC model (see box).\nIn much of the Western world most children still get similarly assigned to the mother. But the momentum towards shared parenting in recent years has made Malta a laggard.  \nThe countries leading the way have forged a variety of models. Australia pioneered a decade-long process that has fostered JPC. Canada last year tweaked the law to make it more parent-neutral, excising terms such as “access” that encourage litigation, and the courts have begun to assign equal parenting time. Half of US states now have laws in effect or in draft that favour JPC. In Europe there is currently a JPC law in the works in Italy, and German courts are more equitable towards the parents and scientific in their procedures, often involving social workers in decision-making. \nMichel Grangeat, professor at France’s University Grenoble Alpes, told The Sunday Times of Malta that the “latest survey shows that the rate of equal shared parenting has doubled from 2010 to 2016”. It now stands at almost one in five post-separation arrangements, which “demonstrates a strong momentum in shared parenting dissemination in France”. \nMichael Lewkowicz of the NGO Families Need Fathers said that although the law in the UK pronounces that shared parenting is best for children, “we have a very high rate of single parenting and that is partially because of the deficiencies of family justice and social justice”.\nFamily law needs to evolve\n“The chances of getting an equal placement order in court is less than 20 per cent,” Mr Lewkowiczsaid. “Many judges still operate on the traditional idea of the mother providing care and the father financial means. We need a presumption in law on shared care.”\nLegal ‘presumption’\nScientists and campaigners have made the ‘legal presumption’ their destination: to legally oblige family courts to impose JPC on couples litigating for custody unless contraindicated by circumstances of any particular case. It is also known as the “rebuttable presumption” because SPC would remain the fallback option if one of the parents is abusive, negligent, violent or suffers from mental or other incapacity that could damage the child.   \nLegal presumption has been entrenched in law in Belgium and Sweden in Europe, and in four US states. Yet many legislators remain opposed to the legal presumption, fearing that it would restrict courts’ leeway in cases that fall in the grey area.\nMany fathers seem resigned to the fact that it’s the mother who’s going to get the children.\nEdward Kruk, professor of social work at Canada’s University of British Columbia, last year made an exhaustive case for legal presumption in a paper in the Journal of Divorce and Remarriage. It was also adopted by 12 expert panelists last November at the International Conference on Shared Parenting held under the auspices of the Council of Europe.\nRELATED STORIESWhat defines an 'unfit parent'?\nProfessor of psychology at Cambridge University and prolific researcher Michael Lamb had said that “on the basis of this evidence, social scientists can now cautiously recommend presumptive shared parenting to policymakers.”\nIn last week’s paper, Prof. Fabricius wrote that “failure to enact presumptions of equal parenting time risks unnecessary harm to children’s emotional security with their parents, and consequently unnecessary harm to public health in the form of long-term stress-related mental and physical health problems among children of divorce.”\nMalta’s cultural drag\nProf. Fabricius wrote that family law tends to reflect cultural sensibilities on parenting. This may partly explain Malta’s laggardness – parenting roles remain traditionally binary across wide swathes of Maltese society.\nIn his expanded comments, Prof. Fabricius clarified that “valuing fathers’ importance in daily childcare is one of the big cultural attitude changes in our generation. Public opinion is in favour of equal parenting time, and it’s the family law that needs to evolve.”\nDr Camilleri says that “when fathers ask me to represent them – and I do represent many fathers – I ask them if they want to take care of the children. Many respond that ‘it’s the mother who always took care of the children and accept that this arrangement shall endure. Many fathers also feel that the family court is biased against fathers, and seem resigned to the fact that it’s the mother who’s going to get the children.”\nCouples are legally obliged to go for ‘mediation’ at the Family Court before escalating to a full-scale lawsuit. The mediator’s role is to hold the ring and lead the couple to amicable settlement, but according to specialist lawyers the spirit of mediation is often marred by temporary court orders on child maintenance and access.\n“Many times one of the parties files an application requesting rulings during the mediation process itself, sometimes even before the mediation starts, and judges make provisional rulings on child maintenance and access,” Dr Camilleri said, adding that these judicial decisions create bearings or points of reference in the mediation.\n\n“It’s a double-edged sword,” she says. “On the one hand mediation can run for months and even years, and judges feel compelled to make interim rulings so as not to disadvantage any of the parties. On the other hand these provisional decrees set parameters that interfere with the spirit of mediation, which is to allow the parties themselves to freely reach agreement.”\nIn these “provisional” rulings, the Family Court tends to lay the parameters for SPC assigned to the mother even before anyone files a lawsuit.\nThe judiciary even remains sceptical of JPC agreed directly between the parents, and reluctant to endorse JPC contracts for young children.\n“Judges tend to be wary of contracts in which there is no assigned residence, no child maintenance provisions, and no defined access,” Dr Camilleri said, “although recently I have heard other lawyers say that judges have begun to accept shared parenting contracts.”\nThe caseload in Malta’s Family Court keeps swelling; a third full-time judge was appointed last year.\nBy contrast, Sweden’s downward rate is often attributed to the entrenchment of JPC. Less than two per cent of couples that split now litigate in Sweden.\nSweden’s rate of shared parenting – upward of 40 per cent – is the highest in the world. Yet in another sense, this demonstrates that one of the parents still opts out of involved parenting, or moves away, in half of separations.\nScience-law chasm\nThere is a disconnect between social science and the legal profession in Malta. Like her peers, Dr Camilleri expresses scepticism towards the practicality of shared parenting. The prevailing idea in the family law community is that living out of two homes is chaotic, impractical and does not engender stability in children’s lives.\nIn contrast, scientists hold that children’s emotional security or stability is served in JPC. This was illustrated in a Swedish study involving 172,391 children titled Fifty Moves A Year. The study found no statistical difference in mental health manifestations of children in intact families and JPC, but more psychosomatic symptoms in SPC children.\nProf. Fabricius, who was involved in the development of America’s first shared-parenting law in 2013, wrote about the legal profession’s evolution from initial scepticism to eventual embrace of JPC. He wrote that although the law doesn’t specify JPC – it states that “absent evidence to the contrary, it is in a child’s best interest to have substantial, frequent, meaningful and continuing parental time with both parents” and that “the court shall adopt a parenting plan that maximizes respective parenting time” – it has decidedly fostered JPC in Arizona’s family courts. \nAsked by The Sunday Times of Malta what shifted attitudes in the legal profession, he said: “I think education made the difference. The family law community in Arizona was kept informed about new research findings for several years, and by the time the new law was proposed there was essentially no resistance.”\nWhat the science says\nJohn Bowlby’s 1969 theory of monotropy, which held that children form a primary attachment to their chief carer, created the understanding that children would be harmed if they spend extended periods away from the mother, particularly overnights. Bowlby later said that the primary attachment could be to any of the parents. \nLater research found that children develop equal simultaneous attachments to the two parents at around six months of age.\nAt the same time, studies of the initial wave of children who grew up in SPC showed that meaningful father absence can mar children’s development and psychological outcomes. \nScience now holds that marital breakdown threatens children’s “emotional security”, and that maintaining post-separation quality relationship with both parents is a buffer to emotional insecurity. \nQuality relationships – a measure of parental warmth, involvement in children’s activities and effective discipline – can only develop if the parent has sufficient time with the child. The scientific threshold of ‘sufficient time’ has been fixed at 35 per cent of the time.\nThe least-involved parent in  the JPC model has to have at least 35 per cent of the parenting time, including overnights (essential for development of quality relationship).\nLinda Nielson, a US professor of Adolescent and Education Psychology who last year reviewed all 60 studies that compared JPC and SPC, concluded that “independent of family income, the level of conflict between the parents, the quality of their relationships with each parent, and quality of the parenting skills, JPC children are still generally more advantaged.”", "comment_count": 1, "id": 1630}, {"keywords": "Accident, Marsaxlokk, Beach", "author": "", "article_body": "Updated at 9.40pm\nA man was found floating in the water at St Peter’s Pool on Sunday afternoon and pronounced dead at the scene, the police said.\nThe man was spotted by bathers at the popular Marsaxlokk seaside spot at around 4pm. Sources later said he had been identified as being a 69-year-old Żejtun resident. \nHis limp body was carried to shore, where paramedics sought to revive him using CPR before they certified him as having passed away. They subsequently took the man away by ambulance.\nPolice initially believed the victim to be a swimmer who ran into trouble while out at sea but have now launched an investigation to understand what precisely led to his death, as they have yet to identify any eyewitnesses who saw the incident unfold. \nThere were no marks on his body indicating violence, sources said, with investigators believing the man may have suffered a heart attack while in the water. An autopsy has been scheduled for Monday morning. \nMagistrate Joseph Mifsud is leading an inquiry into the case. \nIt was the second sea-related incident of the day. \nEarlier on Sunday morning, a 45-year-old man was hospitalised after getting caught in high waves while swimming Sliema. Doctors originally said his condition was life-threatening, but sources subsequently said he had taken a turn for the better.\n ", "comment_count": 0, "id": 1631}, {"keywords": "Politics, Joseph Muscat", "author": "Jacob Borg", "article_body": "Azeri and Russian MPs tried to remove a damning clause in a Council of Europe report detailing how Prime Minister Joseph Muscat personally protected his top aide, a government minister and a private accountant.\nEyebrows were raised within the human rights’ watchdog last Thursday after MPs from Azerbaijan consistently voted in favour of amendments put forward by the government in an unsuccessful attempt to water down the report.\nOne of those amendments endorsed by Azerbaijan sought to delete a paragraph highlighting how Keith Schembri, Konrad Mizzi and Brian Tonna seem to enjoy impunity, under the personal protection of Dr Muscat.\nThe paragraph called for the Prime Minister’s functions to be subject to effective checks and balances, ensuring judicial independence and the strengthening of law enforcement and other rule of law bodies.\nManuel Mallia, who tabled the change, voted against it\nInstead of these conclusions, the Azeri MPs, together with a coterie of other MPs from Russia, Hungary and Armenia, pushed an amendment merely stating that the Maltese authorities should start a process that would examine the need for constitutional reform, along the lines suggested by the Venice Commission.\nWhile government MP Rosianne Cutajar voted in favour of this amendment, Manuel Mallia, who tabled the change, actually voted against it on Wednesday night.\nBoth MPs represent the government in the Council of Europe.\nAzeri MPs push back Caruana Galizia murder probe concerns\nThe Azeri MPs called for an amendment to a passage in the report raising “serious concerns” about the way the investigation into journalist Daphne Caruana Galizia’s assassination was conducted.\nJoseph Muscat and President Ilham Aliyev shake hands during a 2014 trip to Azerbaijan.\nAnother paragraph that found  itself in the MPs’ crosshairs was a demand by the Council for Dr Muscat to halt judicial appointments until recommendations by the Venice Commission, which raised concerns about the independence of such appointments, have been implemented.\nThese two proposed amendments were shot down by a majority of MPs.\nThe block of Azeri MPs also supported an amendment which sought to wipe out a reference about how Economy Minister Chris Cardona had not been interrogated by investigators, despite reported contacts with some of the suspects charged with carrying out the October 2017 bomb plot on Ms Caruana Galizia.\nReferences to “inflammatory and misleading statements” made by people close to Dr Muscat in connection with Ms Caruana Galizia’s murder also came in the glare of the Azeri spotlight, though once again, the proposed amendment was voted down.\nWhat are Malta’s links with the former soviet republic?\nAzerbaijan’s state-owned energy company Socar is a major partner in the power station project spearheaded by the Labour Party on its return to power in 2013.\nJoseph Muscat had held a secretive meeting with Azerbaijan’s President Ilham Aliyev together with Keith Schembri and Konrad Mizzi. No civil servants attended this meeting.\nAn investigation by the Daphne Project revealed how Socar made millions from the power station deal.\nA study of leaked documents by The Guardian flagged how Socar, which has no experience in producing or trading LNG, acted as an agent to buy the gas on behalf of the Electrogas consortium which it forms part of.\nMs Caruana Galizia was working on a leaked cache of data from Electrogas prior to her death.\nSubsequently, a joint investigation by Times of Malta and Reuters revealed how a company owned by one of the local business partners in the consortium was named as one of the main sources of income for the offshore structures set up by Mr Schembri and Dr Mizzi.\nA leaked financial intelligence report detailed how an Azeri national, who would later turn out to be a security guard, sent $1.4 million to 17 Black, the company owned by businessman Yorgen Fenech.\nAnother Daphne Project investigation revealed how Azeri elites used the now defunct Pilatus Bank to move millions around Europe.\nRELATED STORIESMalta 'losing millions' from poor Azeri deal\nEarlier this month, Ms Caruana Galizia’s family filed a suspicious transaction report with the Latvia anti-financial crime office.\nThe report raises the possibility that the Iranian-owned bank was “possibly part of a larger money-laundering network for Azeri and Maltese government officials and their associates and family members.”\n‘Appalling human rights record’\nAzerbaijan has long been criticised by the international community for what Human Rights Watch an NGO, terms as its “appalling” human rights record.\nAt least 43 human rights defenders, journalists, political and religious activists remain wrongfully imprisoned, while dozens more were detained or under criminal investigation, faced harassment and travel bans, or fled Azerbaijan, according to the NGO.\nHuman Rights Watch says all mainstream media remain under tight government control, and people who publicly criticise the authorities face arrest and threats aimed at silencing them.\nAzerbaijan is viewed as a strategic energy partner for the EU, and many countries continue to engage with it.", "comment_count": 107, "id": 1632}, {"keywords": "PN, Construction", "author": "", "article_body": "New construction rules should be revised to better protect the rights of neighbours who end up bearing the brunt of building site mishaps, the Nationalist Party said on Sunday.\nIn a statement, the PN listed a series of changes it wanted to see in regulations, which were revised last week to considerable uproar.\nThe PN wants the law to clearly specify what forms of financial, logistical and psychological support people who end up homeless due to construction site incidents are entitled to. Victims of such incidents have told Times of Malta that while they received temporary accomodation, their lives remain on hold and they have no idea of when things will get back to normal.\nThe PN also wants the government to consult openly with architects – something it did not do in the four-day consultation period before the revised regulations were passed – and accelerate work to introduce a registered of licenced constructors, which would clearly list their skills.\nRegulatory bodies like the Building Regulations Office and Occupational Health and Safety Authority also needed significantly more resources if they were to properly do their work, the PN said.\n“The government’s rushed decision-making has set nobody’s mind at ease,” the party said in a statement released by its MPs Marthese Portelli, Claudette Buttigieg and Toni Bezzina. ", "comment_count": 8, "id": 1633}, {"keywords": "Construction, Planning Authority, Interview", "author": "Vanessa Macdonald", "article_body": "The legal notice on third party properties drawn up by government adviser Robert Musumeci has generated a fair amount of controversy. He sat down with Vanessa Macdonald to explain the rationale.\nIsn’t the law a knee-jerk reaction? Entities have been asking for laws to be revised for years.\nThere was a process under way to consolidate the building codes, and meetings were already being held. After the third collapse, we got the 2013 legal notice on third party properties…\nWhy did you wait till the third building collapse? Why didn’t you do something after the first?\nWe were already reviewing the law but then we accelerated the process to do – in one week – what had to be done. This stop-gap measure is not meant to be the final document but the government wanted to tackle the issues that emerged from the 2013 legal notice.\nThe main issue was the method statement, which was not previously clearly defined as it is now. It is now much more onerous – I think too onerous and maybe should be toned down if it emerges that some clauses are not necessary. A site manager was required by law (in terms of third party rights) to ensure that the method statement – which is by its very nature very complicated – was followed.\nWe are now being much more prescriptive about their role and responsibilities. Until last Monday, anyone could be a site manager.\nAnd now you have gone to the other extreme and said it could only be an architect…\nThe government is already on record as saying that at any point in time the minister could consider other competences, and engineers could be included.\nThere are thousands of construction projects under way at the moment. Are there enough architects and engineers to do this, or will we effectively end up with less on-site surveillance? Will it actually make things safer?\nNot all projects require a site technical officer (STO). The schedule in the legal notice makes it very clear where they are required: when there is excavation, demolition or construction that impacts third parties.\nThe site manager was there to look after the developer/owner’s interest. That was changed and the contractor now appoints the STO. Yet, they are the ones most likely to take shortcuts. Isn’t there a conflict of interest?\nThe STO will be a warranted person and their first loyalty is to the warrant. And the contractor is already bound by other health and safety regulations to have a set-up, to have well-trained workers, certified lifting equipment, a risk assessment in place and so on. I see this as a way to make contractors more aware of their obligations.\nJust as there are lawyers and notaries who are bad apples in spite of their warrant, there could be architects who might succumb to pressure from the person who is appointing them…\nThere are bad apples in all sectors in every level in society. You need to draft the law on the assumption that all warrant-holders are acting in good faith. There are fora where if there is negligence or, worse, voluntary commission, then procedures will be put in motion. An STO is now obliged by law to halt works if the method statement is not being followed, it is very clear.\nIf an STO closes their eyes to something, the implications are much more serious, which is why we put in much harsher deterrents. An omission would previously have carried a €500 fine, now increased to €10,000.\nUntil last Monday, anyone could be a site manager\nIf works persist in spite of an enforcement notice, the fine has shot up from €1,200 to €50,000. You have to see the law in a wider dimension. But I reiterate that the Kamra tal-Periti [Chamber of Architects] is right on this point: contractors should be aware of their obligations from the Health and Safety Act and they must have a competent person on site to monitor what is going on.\nThe abrupt introduction of this legal notice caused havoc, bringing everything to a halt. Was it necessary?\nWe could have had a repeat of what happened a few weeks ago, and who would then take responsibility for delays? It had to be seen in the context of public safety. Is any other conclusion possible?\nAnd what about the tremendous increase in costs? Are they justified?\nIt is – theoretically – possible that some of the method statements already done were not sufficient to ensure safety. So they now need to be standardised. And architects need to submit them to the Planning Authority, rather than to the Building Regulation Office.\nRELATED STORIESThe periti go marching on - Sandro Spiteri\nThe BRO was supposed by law to publish them on its site but never did so.\nIndeed, there was no traceability. Now the method statement has to follow the rules and must be published so that all stakeholders have access to it and have two weeks in which to object. This is a new concept.\nI can’t say this will guarantee that there are no accidents in the future but I think it is a step in the right direction. You cannot eliminate risks but you have to minimise them.\nWhat happens to the current site managers? Are they all out of a job, unless they happen to be architects or engineers?\nBe careful to distinguish between STOs dealing with complex method statements and project managers. The latter are there to make sure that works are delivered on time… They are not affected by this law.\nLecturer Ruben Paul Borg had said in a recent Times Talk edition that concrete buildings should be assessed as concrete has a lifespan of 35-40 years.\nIn fact, the schedules actually say that a range of tests must be done before construction commences, reflecting what he said. This assessment is now an obligation.\nAny project is only as strong as its weakest link. Masons have to be licensed. The list has finally been published. There is no ID card given. And do you know that there are people on that list who are dead?\nVery good point. Before I could authorise the start of works, as an architect I had to certify that it would be overseen by a licensed mason, who had to sign the commencement notice. It would be my obligation to ensure that they have a valid licence.\nThe Kamra tal-Periti rightly insisted on the list being made public… in reality, I agree with many of its arguments and they are definitely acting in good faith, even if we remain at odds over some points.\nI want to make it clear that I salute the current president who is a very dedicated, decent and competent woman.\nI agree that some of the details on that list need to be improved. There are even people on that list who got licensed some time ago but did not renew it. Infrastructure Minister Ian Borg already decided to look into this.\nIt is good to see that awareness is improving and that something good will come out of this.\nAgain, a law is only as good as its enforcement. The people in Ħamrun had flagged problems weeks before but the BRO did not react. The BRO’s budget of €150,000 is considerably less than that for carnival...\nThe government is on record saying that by the end of the year a new authority would be in place to take things forward. At the moment, the BRO’s enforcement directorate has merged with that of the Planning Authority, which is much stronger and more visible.\nSo you believe that neighbours can now sleep easier?\nFor the first time, they are at the centre of the law. Method statements are now admittedly costlier – but that is because they must be more comprehensive. And third parties have two weeks in which to check them and to object, and the BRO has to weigh their arguments.", "comment_count": 9, "id": 1634}, {"keywords": "Sliema, Accident, Beach", "author": "", "article_body": "Updated 2.44pm \nA 45-year-old man from Sliema was hospitalised on Sunday after finding himself in difficulty while swimming because of high waves.\nThe police said the man was swimming at a bay close to Tower Road in Sliema at 9am.\nHe was helped ashore by people on site and an ambulance transferred him to Mater Dei Hospital.\nDoctors initially said that the man had been critically injured, but on Sunday afternoon sources said that his condition had improved and that his life was no longer in danger.\nThe police are investigating and an inquiry is being held.", "comment_count": 0, "id": 1635}, {"keywords": "Properties", "author": "Ivan Martin", "article_body": "After more than two years in the making, the highly-anticipated rental market reform was announced last week. Ivan Martin goes over the main changes for landlords and tenants alike.\nThe rent reform seeks to incentivise landlords to enter into long-term rental agreements by offering them hundreds of euros in tax credits. This, the government hopes, will help provide more security for tenants, in a market that is characterised by widespread abuse and skyrocketing prices.\nThe reform will introduce a mandatory one-year minimum contract for long-lets, with financial incentives for landlords who provide a two-year and a three-year-or-more agreement.\nAnnual rental increases will be capped at five per cent, but only in multi-year contracts.\nNothing, however, will stop landlords from entering into one-year contracts and drastically increasing the rental price for the next one-year agreement.\nWhile the price will still be set by the free market, landlords will now be bound to provide tenants with at least three months of notice if they plan to evict them.\nIf a tenant is not informed of the landlord’s wishes prior to this period then the contract will be automatically extended for another year.\nOn the flipside, tenants will now have to meet a mandatory minimum period of rental before being able to leave a contract.\nFor one-year contracts this will be two months, for two-year agreements it will be four months, and for three-year contracts it will be six months. \nTenants will also be required to provide a notice period should they wish to vacate the property before the termination of the contract.\nShort-let contracts, which will be set at a six-month maximum duration, can only be provided to non-resident workers and non-resident students. No fiscal incentives will be available for these landlords.\nThe reform is currently being discussed in parliament and the government expects it to come into force by January. However,  a transitory amnesty period will allow for the sector to get used to the new system. \nRegistering rent contracts\nAll residential rental agreements will have to be registered with the authorities, in a bid to cut down on black market abuse that pervades the industry.\nThe register, which will also be online and run on blockchain, will be overseen by the Housing Authority. \nFailure to register will mean a fine ranging from €2,500 to €10,000\nLandlords will have to submit the contractual agreement, the inventory of the entire property, and the deposit paid, into the new system.\nShould an agreement not meet the necessary criteria, it will not be registered, and will instead be flagged.\nCracking down\nAccording to the team that drafted the reform, to date Malta’s rental market is characterised by widespread black market abuse. Under the new system, if a landlord fails to register their property, they will be subject to a fine ranging from €2,500 to €10,000. \nTenants will also be encouraged to flag irregularities or suspicions to the Housing Authority.\nA beefed-up Housing Authority will be empowered to investigate the market. The authority will also be able to take a case before a new Rent Regulation Board on behalf of the tenant and demand an imposition of three-year leases at 75 per cent of the property’s market value. This would provide security for tenants who to date fear being made homeless if they report landlords who rent on the black market.\nA new adjudicating panel for residential rentals will be set up and composed of legal and technical experts.  It will deal with disputes related to deposits or maintenance fees of no more than €5,000.\nClaims will be resolved within five working days.\nProtection for landlords\nThe courts will be empowered to announce an eviction on its first hearing, putting an end of the endless delays landlords sometimes have to put up with before they get their property back.\nLandlords will also have the right to demand compensation for any additional months the tenant might stay beyond a contract, without having to open fresh court proceedings.\nUtilities\nTenants will now be given access to water and electricity bills to ensure that they only pay for the amount they consume.\nLandlords will be duty bound to provide access to the billing information for the provision of utilities so that tenants will no longer have to take the property owner’s word on how much was due. \nAlso utility providers will no longer suspend the provision of water and electricity in cases were either tenants or landlords are disputing the amount due. \nAirbnb and tourist rentals\nThis reform does not have anything to do with the holiday rental market and tourism rentals such as Airbnb, which will be covered in another law being drafted.", "comment_count": 10, "id": 1636}, {"keywords": "Crime, Court, Family", "author": "", "article_body": "A 31-year-old man from Qormi was remanded in custody on Sunday after pleading not guilty to assaulting his parents during a row that got out of hand.\nThe court, presided over by Magistrate Joe Mifsud, heard how the altercation between Keith Agius and his parents happened at their Qormi residence on Saturday. The man was charged with assaulting his parents, injuring his father and harassing his mother.\nHe was also charged with relapsing.\nSources close to the police said the man had a drug addiction problem and that police investigations into the case were still under way. There was the possibility that criminal action would be taken against the father for violence against his son.\nThe court heard defence counsel Victor Bugeja request bail for his client. However, the prosecution vehemently objected since the father was still in hospital and in view of the pending investigations and testimonies.\nMagistrate Mifsud noted that Mr Agius had 13 previous convictions and also saw a report by state welfare agency Appoġġ which classified the accused as being “high risk”.\nIn view of the lack of reliability, the court turned down the request for bail and the man was remanded in custody. \nPolice Inspector Kylie Borg prosecuted.", "comment_count": 0, "id": 1637}, {"keywords": "Construction, Joseph Muscat", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat on Sunday played down concerns about the role of architects and the expenses involved in the new construction rules pushed through by the government last week.\nSpeaking in an interview on ONE radio, Dr Muscat said architects themselves had acknowledged that the construction industry was in crisis following a spate of building collapses linked to adjacent construction works.\nThe Prime Minister said the new rules simply specified procedures that were already meant to be adhered to.\nRELATED STORIESWatch: Building collapses in MellieħaWatch: Building collapses in Gwardamanġa, residents out in the streets\n“We are making sure everyone is shouldering responsibility, not just simply signing off on a piece of paper”.\nDr Muscat said the main point of contention was the role of the site technical officer.\nHe dismissed concerns that this would mean architects had to be on site all the time.\nArchitects, he continued, would only have to be on site when crucial decisions and actions were taken, such as the tearing down of a building.\nOn the complaints about the expenses involved to comply with the new law, Dr Muscat said many of the requirements in the method statement were already meant to be complied with prior to the regulations brought into force last week.\n“One wonders what method statements were being produced prior to this”.\nDr Muscat clarified that other qualified personnel, such as engineers, could also occupy the role of site technical officer.\nRent reforms\nTurning to the government’s proposed rent reforms, Dr Muscat said the law would offer more stability to tenants.\nRental contracts will now have to be drawn up for a minimum one-year period at a pre-agreed price, offering more stability to tenants.\nLandlords wishing to exit the contract would be able to do so as long as they gave tenants three months’ notice.\nIf such notice was not given, the rental contract would remain in force, Dr Muscat said.\nLandlords, he said, would be encouraged to enter into longer-term contracts with an in-built index-linked increase in the rent.\nDr Muscat said landlords who entered into such agreements would be offered tax credits.\nAnother reform will see the obligatory registration of all rental contracts.\nLandlords who failed to register their contracts would be liable to “hefty” fines.", "comment_count": 13, "id": 1638}, {"keywords": "Aviation, Industry, Unions", "author": "Ivan Camilleri", "article_body": "Air Malta pilots have warned the national carrier to expect industrial action from next week if the government fails to start discussions with them over their collective agreement, The Sunday Times of Malta is informed.\nThe overwhelming majority of members of the pilots’ union agreed in a secret vote to call industrial action if no headway is made with the airline’s shareholder, sources said.\n“The pilots have a number of pending issues with the management and the government – as the airline’s shareholder – as many feel the conditions of the collective agreement are not being respected,” a senior pilot said.\nThe pending items include working schedules, the lack of pilots amid an increase in flights during the summer schedule and vacation leave issues.\nHowever, other sources said that while it was collective agreement issues that were mainly sparking the threat of action, the straw which broke the camel’s back was the government’s recent agreement with Ryanair to set up a new airline.\nRyanair is set to open a Malta-based subsidiary that will start operating with six aircraft under the brand name Malta Air.\n“Malta Air is a direct hit at Air Malta and it is clear that the government has unwritten plans for Air Malta,” a senior Air Malta official said.\n\n“This is obviously making pilots and other employees very tense, they want guarantees from Tourism Minister Konrad Mizzi and the Prime Minister,” the source said.\nLast week, Times of Malta reported growing tension among the unions representing Air Malta employees following the Ryanair announcement.\nThe other airline unions, including the General Workers’ Union, which represents the majority of workers, has kept silent over the deal despite mounting internal frustrations.\nUnion members are pressing their representatives to ask the government for “written guarantees” on their future in case Air Malta folds up.\nThe government is insisting that despite their green light to strengthen Ryanair’s presence in Malta, the new airline will not compete head-on with Air Malta.", "comment_count": 134, "id": 1639}, {"keywords": "Accident, Police, St Paul’s Bay, Fgura", "author": "", "article_body": "A 40-year-old man from Fgura was seriously injured on Saturday in an accident at St Paul’s Bay.\nThe police said the accident happened in Triq Burmarrad at 5.30pm. The man was riding a Piaggio Vespa when he lost control and fell.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1640}, {"keywords": "Media", "author": "", "article_body": "Matthew Pace refuses to resign: Planning Authority board member Matthew Pace told Times of Malta he would not resign despite a court decision which found he had a conflict of interest when voting on the db City Centre project in Pembroke. A day after he said he would not resign, Prime Minister Joseph Muscat said Mr Pace should step down.\nConstruction ‘at a standstill’: The construction industry came to an almost complete halt mid-week as most contractors downed their tools and sent employees home, after new rules were hurriedly introduced one day prior. Architects also warned clients of additional costs as a result of the new regulations. On Friday, Infrastructure Minister Ian Borg said construction projects were slowly trickling back to life.\nTownsquare project gets the green light: The Planning Authority board has approved the redesigned 28-storey Townsquare high-rise in Sliema after earlier approved plans were thrown out by an appeals tribunal. The height of the planned tower has been reduced by 11 storeys, or around 37 metres, after the Environment and Planning Review Tribunal last year revoked the original permit issued by the PA in 2016.\n200 sign petition to oust Delia: A petition signed by 200 Nationalist Party councillors calling for a vote on Adrian Delia’s leadership was presented to the party administration, as backers of the embattled leader circulated their own counter-petition seeking to block the vote. A day later PN General Council president Kristy Debono accepted to call an extraordinary meeting of the council which would decide on Dr Delia’s future.\nPrimary benchmark to be phased out: Primary school students will soon no longer be made to sit for their benchmark exams as the education system shifts towards a more ‘informal’ way of assessment. By 2021 students in their final year of primary schooling will undergo ‘informal college exams’ or ‘informal national exams’.\nOver 52,000 properties approved by PA in five years: The Planning Authority approved 52,448 properties in the past five years, until the end of 2018, according to published figures. If the number of permits in 2019 remains the same as the previous year, a further 9,500 properties would have been approved by now.\nCouncil of Europe demands Daphne inquiry: A damning report adopted by the Council of Europe demanded that an inquiry into the murder of journalist Daphne Caruana Galizia be conducted within a three-month window. It also noted “serious concerns” about the investigation into her death. Reacting, Prime Minister Joseph Muscat did not expressly rule out the setting up of such an inquiry.\nOne-year minimum set on rent contracts: Minimum one-year rental periods and a price-increase cap of five per cent on multi-year contracts were among the main reforms to the rental market announced by Prime Minister Joseph Muscat.\nWhat they said\n“You’ll be amazed how many experts come out of the woodwork.”\nPrime Minister Joseph Muscat reacting on ONE Radio to the criticism of the government’s new construction rules.\n“I have no time to waste to explain anything.”\nNeville Gafà, the controversial official employed by the Office of the Prime Minister, refusing, when asked by Times of Malta, to explain his presence in a government delegation to Tripoli last week.\n\n“If we do nothing, there is a risk that there will shortly be no party – or democracy – left to save. We would have lost both and ended up with a one-party State.”\nPN councillor and former election candidate Ivan Bartolo speaking as he presented a petition signed by 200 PN councillors which called for a vote on Adrian Delia’s leadership.", "comment_count": 2, "id": 1641}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories in Sunday’s newspapers.\nThe Sunday Times of Malta says the Malta Financial Services Authority has given Bank of Valletta until Friday to agree to a hefty overhaul. In another story, the newspaper says the Nationalist Party leadership is mulling the option of discarding a petition aimed at a vote on Adrian Delia’s leadership on grounds that several signatories were not eligible.\nThe Malta Independent on Sunday says Satabank clients are still awaiting funds eight months after the bank’s accounts were frozen.\nMalta Today says pilots are on the warpath over their retirement scheme.\nIllum says €28 million are being invested in the Marsa Race Track.\nKullħadd says there are more vacancies than there are people registering for employment.\nIl-Mument says there were two currents working against each other at Castille.\nIt-Torċa reports about US investment in passport printing at De La Rue.", "comment_count": 0, "id": 1642}, {"keywords": "Court, Justice, Family", "author": "Matthew Xuereb", "article_body": "A man has been ordered to return his mother’s life savings after a court found he had deceived her into signing a document that gave everything to him.\nThe signing took place without her knowledge of its contents and also behind the backs of his four siblings, the court heard.\nThe son and his wife had even placed the woman in a home for the elderly against her will and without telling anyone else.\nDetails of the shocking case emerged in a case instituted by 88-year-old Giuseppa Camilleri against one of her five children, John Camilleri, a former police officer, and his wife Antoinette.\nThe First Hall of the Civil Court, presided over by Mr Justice Joseph Zammit McKeon, found that Mr Camilleri had deceived his elderly mother into signing a contract of donation by inducing her to believe that he was taking her to a notary to confirm the inheritance agreement she had signed with her late husband.\nBy virtue of the deed, Mr Camilleri acquired all his mother’s immovable property. The court heard that just a month after the woman had moved into her son’s home, he informed his siblings that their mother had given him full power of attorney to manage her estate.\nCourt ordered rescission of the contract of donation on grounds of deceit and the return of the funds with interests\nHis siblings found it strange since their mother had always wanted two of them to manage her estate, to ensure there was an element of control.\nThe court heard how Mr Camilleri carefully planned the signing of the deed of donation to ensure the fewest possible hurdles. He contacted the notary a while before and prepared all the groundwork for the signing to proceed as smoothly as possible.\nMs Camilleri told the court that she never intended to donate all her property to her son since she loved her five children equally and wanted all her estate and life savings to be distributed equally.\nShe said her son had told her that he needed to take her to the notary to confirm the will she had signed with her late husband. She said she had specifically asked whether the inheritance agreement would still stand and had been given assurances.\nThe court found that the version of events given by Giuseppa Camilleri was credible as it was also corroborated by other evidence including the testimony of psychiatrist Joseph Vella Baldacchino.\nHe testified that when Mr Camilleri had taken his mother to his clinic for an examination just before the contract, the deed of donation was never mentioned.\nIt also resulted that soon after the contract of donation, Mr Camilleri had gone to the local HSBC branch and used the power of attorney to withdraw practically all his mother’s savings leaving her with a balance of only €33 in her bank account.\nThe court found that the Camilleri couple gave conflicting versions, including on why the money had been withdrawn.\nThey claimed that this was to compensate them for services rendered but it resulted that they were already in receipt of the mother’s pension. Furthermore, nobody is entitled to compensate himself unilaterally without court approval, the court noted.  \nThe Court of Appeal presided over by Chief Justice Joseph Azzopardi, Mr Justice Tonio Mallia and Mr Justice Joseph Micallef rejected the appeal filed by the son and his wife, also throwing out their plea that their mother was not in a mental position to fight the court case.\nThe court ordered the rescission of the contract of donation on grounds of deceit and the return of all the elderly mother’s funds with interests and costs against the defendants. \nSeparate proceedings against the couple filed by Catherine Pace, who suffered the same fate as her sister Giuseppa Camilleri, are still pending.\nLawyer Paul Cachia represented Giuseppa Camilleri. ", "comment_count": 0, "id": 1643}, {"keywords": "Banking, Finance", "author": "Ivan Martin", "article_body": "The financial services watchdog has raised “serious concerns” about Bank of Valletta’s operational and managerial processes, giving it until Friday to agree to implement a hefty overhaul, a leaked letter has revealed.\nIn a stern letter sent to BOV by the Malta Financial Services Authority last week, the bank’s senior management was taken to task for not showing the “required sense of urgency” to get its house in order. \nThe European Central Bank reviewed BOV back in March, and officials were in Malta last week for a follow-up, however the result of these visits has so far remained under wraps.  \nThe Sunday Times of Malta is informed that an onsite inspection by the ECB had flagged around a dozen cases of “operational risk” at Malta’s biggest bank, four of which were deemed critical.\nThe MFSA letter warns BOV that the European Banking Authority could potentially move to downgrade it if remedial action is not taken soon.  \n“Despite various interactions, [the bank] is perceived as lacking in effectively addressing the spirit as well as the actual concerns raised, and does not show the required sense of urgency expected in these circumstances to address the issues at hand,” the letter reads.\nThe MFSA told the bank’s management that BOV had issues when it came to taking on new clients, and “major deficiencies” when it came to the effectiveness of its internal governance. This included the effectiveness of the bank’s board in providing strategic and governance oversight, the letter reads.   \nThe authority urged BOV to change the way it operated, particularly when it came to risk management and internal controls.\nIts management also fell short of the level expected in European and international banking circles, the correspondence reads, urging the bank to address this immediately (see below).     \n“The bank needs to embed risk and compliance into its structures, systems and processes, in particular in the way risk is managed, understood and addressed,” the letter reads. \nWeighing in on the situation facing BOV, industry insiders told The Sunday Times of Malta that banks the world over were facing increased pressure to minimise their risk. \nBank of Valletta, they said, could be viewed as a ‘risky’ bank to do businesses with, mostly due to its sheer size in comparison to the Maltese economy. Minimising this risk was described as “healthy” for the bank and for the island as a jurisdiction.\nBank’s strategic importance could impact rating\nThe authority warned that given the bank’s strategic importance to the Maltese economy, it was critical that the concerns raised were addressed right away.\nIf it failed to do so, it not only put itself at risk but could even have an impact on the island’s credit rating as a jurisdiction, the MFSA warned. \nBOV confirmed earlier this month that its last remaining provider of US dollar transactions would be pulling the plug as part of a de-risking exercise.\nThe MFSA flagged this as one of its main concerns though Prime Minister Joseph Muscat had said the withdrawal of the US correspondent bank was a result of BOV’s growth and success.\nThe letter was signed by MFSA chief executive Joe Cuschieri\nThe authority also raised concerns about a cyber-attack on the bank in February. The bank had to temporarily shut down all its operations after hackers broke into its systems and moved €13 million into foreign accounts. The money was eventually tracked down.\nRELATED STORIESPlan B and Plan C for Bank of Valletta – CEO\nIn its letter, the MFSA said this incident had been “partly facilitated by weak IT systems and infrastructure”.  \nIn closing, the authority calls on the bank to say whether or not it will be appointing a “transformation team” by Friday.\n“While we understand that the bank is plagued with legacy issues and cultures, it has now become critical that a new three-year plan of action is requested to strictly abide by the timelines given by the onsite inspection and reports of the ECB,” the letter reads. \nContacted on Saturday, BOV chairman Deo Scerri said the MFSA letter was a list of recommendations that the bank may wish to consider.\n“We believe that our current programme to exit higher risk business lines and strengthen our anti-money laundering controls satisfy the MFSA’s requirements for a stronger, safer bank,” he said.\nBOV was undergoing a two-year transformation programme, with the assistance of global consultancy firms, which would guarantee its long-term future, Mr Scerri said.\n“In the meantime, BOV continues to perform strongly and profitably, in accordance with the high expectations of all its stakeholders,” Mr Scerri said.\nWhen contacted, MFSA chief executive Joe Cuschieri said:\n“The authority is working closely with BOV to address the challenges and legacy issues which developed over many years to ensure the bank puts together a strong transformation plan so that areas of higher risk are addressed in the shortest time possible. Such a process will ultimately be beneficial to the bank and will ensure its long-term sustainability, enabling it to meet the highest standards of compliance, risk management and governance.”\nRecommendations to Bank of Valletta:\n▪ Strengthen its executive senior leadership by engaging “experienced and credible individuals, with significant international banking experiences.”\n▪ Appoint new non-executive directors, a mix of Maltese and foreign nationals.\n▪ Provide fortnightly updates to the MFSA and ECB on regulatory transparency.\n▪ Ensure risk culture is at the heart of the organisation.\n▪ Create a new transformation office and install a new international interim management team within the next three months.\n▪ Transformation needs to be managed by a team of international specialised professionals.", "comment_count": 0, "id": 1644}, {"keywords": "Crime, Sliema", "author": "Claire Caruana", "article_body": "Elderly people’s fears that crime is on the rise are not backed up by statistics, Home Affairs Minister Michael Farrugia has said, dismissing concerns that some were scared to the point of refusing to leave their homes.\nSuch fears, he said, were only being fomented by media reports on mugging and burglaries and people sharing their experiences on social media.\nLast month, an elderly Sliema couple mugged and injured in broad daylight told Times of Malta they never leave their apartment any more because they do not feel safe enough to walk in the streets alone. Since then, a number of other elderly people have come forward with similar concerns, saying they lived in fear every day.\nAsked about this, Dr Farrugia said the “thing he looked at most was statistics”.\n'I look at the statistics': Michael Farrugia. Video: Matthew Mirabelli\n“During the MEPs’ election campaign, criminality in Sliema was brought up. When we looked into it, we found that this was untrue,” Dr Farrugia said.\nWhen Times of Malta pointed out that a number of people who have been mugged or whose houses had been burgled had come forward with their concerns, Dr Farrugia reiterated “the reality is what it is”.\nWhen you look at statistics, you see the reality of the situation\n“You get the reality from the reports on the number of robberies that take place. If one looks at the number of reports, so that you can see certain waves, that is where you get a reaction from the police.\n“The police have arrested a number of people who were not involved in just one burglary but in a series of thefts,” Dr Farrugia went on.\nRELATED STORIES'I don't belong to this country any more'\nPressed to say whether he believed there was a problem when people were saying they were too scared to leave their houses, because they were afraid of being mugged or attacked in the street, the minister again referred to the numbers.\nThe crime rate in Malta, he said. was among the lowest in the European Union.  The local crime rate per 100,000 citizens was half that of the EU, he added.\n“When you look at the statistics, you can see what the reality of the situation is,” he argued.\n“Obviously, if you have a person constantly saying that there is a problem with criminality and if you have news reports identifying certain cases, without comparing like with like to show what is happening on a larger scale, then it would not be realistic.\n“Nobody can challenge statistics. It is what it is and I appreciate that newspapers deliver the message. But to have someone, Sunday after Sunday or week after week, repeating the same things… the reality is what it is,” Dr Farrugia repeated.\nHe observed with with the presence of social media and greater freedom of the press, people were more likely to publicly share what happened to them.", "comment_count": 54, "id": 1645}, {"keywords": "Accident, Automotive, Police", "author": "", "article_body": "A 32-year-old woman from Żabbar was injured on Saturday when the car she was driving overturned in Tarxien.\nThe police said the accident happened at 5pm in Triq San Anard.\nThe accident happened when the woman lost control of the Hyundai Getz she was driving. \nShe was taken to Mater Dei Hospital by ambulance.\nHer condition is not yet known.", "comment_count": 0, "id": 1646}, {"keywords": "Planning Authority, Construction, Properties", "author": "Vanessa Macdonald", "article_body": "If you feel like Malta has become one huge construction site, it is with good reason: the Planning Authority has approved 52,448 properties in the past five years, according to published figures.\nAnd there is still no end in sight with only 26,827 properties already built.\nThe figure of 52,448 only applies until the end of 2018.\nAssuming that the number of permits in 2019 remains the same as the previous year, a further 9,500 properties would have been approved by now.\nAnd there is no indication that the boom has slowed down.\nBetween 2017 and 2018, the number of permits shot up by 48%, and if that growth has continued into this year, then the number of new property permits by the end of the year could add as many as 28,300 units to the total.\nThis would bring the total number of new properties up to 80,000.\nJust 26,827 have been built\nThe figure takes into account the number of permits as well as the net increase in units. For example, if a villa is replaced by six flats, it would mean a net increase of five units.\nThis multiplier effect has been more noticeable in recent years, with 2.7 properties replacing an existing one in 2015, rising to 3.7 by 2018.\nThe figure of 52,448 has to be taken in the context of an increase in population of 36,000 by 2017, with the figures for 2018 due to be released within two weeks.\nIf this figure alone were not an eye-opener, then consider that the Planning Authority has no indication of how many of them are already built.\nRELATED STORIES'Don't spit into the well - you might drink from it later' - Muscat tells construction industry\nOnce a permit is in hand, the owner/developer is given five years in which to complete it. Which leads to the next question: how many of those 52,448 properties have actually been completed, and how many of them are yet to start?\nThe only indication comes from the number of new Water Services connections, which installed 26,827 water meters between 2014 and 2018, with a further 3,954 this year, according to a spokesman.\nIn the worst case scenario given above, that means that there could still be another 50,000 projects still under construction or yet to be started.\nThe Central Bank last February reported that there were 223,850 residential units in 2011, as per the last census, which had gone up to 250,000 by 2018.\nThe 2011 census had found 41,232 vacant homes (once seasonal or second homes were deducted).", "comment_count": 54, "id": 1647}, {"keywords": "Banking", "author": "", "article_body": "Updated 6.05pm\nTechnical issues affecting Bank of Valletta's point of sale terminals and ATM systems on Saturday afternoon have been rectified and the systems were now up and running, the bank said.\nEarlier, the bank informed clients it was encountering technical issues and its systems were down as a result.\nThe bank apologised for the inconvenience caused.\nRELATED STORIESHow BOV hackers got away with €13 million\nThis has not been a good year for Bank of Valletta. It fell victim to a massive cyberattack that saw hackers make away with €13 million. \nThe bank's website went offline a few days later, with the bank blaming internet connectivity issues.\nRELATED STORIESPlan B and Plan C for Bank of Valletta – CEO\nThe banks last correspondent bank for US dollars transactions is also pulling the plug on its relationship with the Maltese bank in December. \n ", "comment_count": 51, "id": 1648}, {"keywords": "Health, Research, Science, Industry", "author": "", "article_body": "A cutting-edge technology which allows for further cancer prevention and management has been discovered by scientists at the University of Malta’s Laboratory of Molecular Oncology at the Department of Pathology.\nTheir findings were discussed on Saturday during a dissemination event at Esplora Interactive Science Centre in Kalkara.\nThe study, led by Godfrey Grech, and including Chrisitan Scerri (clinical lead), Shawn Baldacchino, Jeanesse Scerri, Ala Petersons, Maria Pia Grixti, Martina Spiteri, and Claudine Grech Spiteri (industry partner - Applied Biotech), was made possible through FUSION, the fund of the Malta Council for Science and Technology (MCST).\n\nThe findings have provided knowledge to better classify tumours into particular sub-groups with unique properties.\nThe improved techniques enable sensitivity to measure cells and cell capsules shed by solid tumour in blood through a liquid biopsy to follow up standard tissue biopsies, moving towards less invasive tests.\nTargeted therapy is a type of treatment that uses drugs to target specific proteins found in cancer cells and related to cancer growth, different from traditional chemotherapy, as the active drug selects between the healthy cells and cancerous ones.\nThe next challenge is to support screening for early detections improving cancer patient care across hospitals worldwide. Prof Grech said that “the next hurdle is the transition to the clinic for patient benefit, hence the fruitful collaboration with the industrial partner in this project”.\nMs Grech Spiteri, the CEO of Applied Biotech Ltd, stated that the innovative method is very versatile and provides the possibility to develop and innovate various products. The first oncology product is planned to be launched in September at the European Congress of Pathology.\nThe company has been active in engaging young scientists to expose them to the laboratory methods and to provide ideas for dissemination and communication of science to the public.\nDuring the dissemination event, an animated video of ACT “Detecting the undetectable” was launched.\n€135,000 were donated to Prof Grech’s team by the Research & Innovation Development Trust through its collaboration with the Alive foundation, which as been raising funds for cancer research since 2013.\nMaltese cyclists will be raising funds for the foundation cycling more than 1,200km from Oslo – through Hamburg and finishing in Amsterdam between July 14 and 21.", "comment_count": 13, "id": 1649}, {"keywords": "Swimming (sport), Waste, Civil society", "author": "", "article_body": "Eleven months ago, Neil Agius spent almost 22 hours swimming around Malta to raise awareness about marine pollution.\nOn Saturday he revisited that feat, swimming the 38km around sister island Gozo to keep the momentum going for the #waveofchange movement he started.\nMr Agius made it around the island in 10 hours and four minutes, reaching the Ħondoq ir-Rummien point he and three others had started at early in the morning just before 1.30pm.\nThe 33-year-old swimming coach and former Olympic athlete was joined by four other swimmers out to circumnavigate Gozo and raise plastic pollution awareness.\n\nAndrew Azzopardi, Hannah Cutajar, Steven Grech and Richard Zerafa also took part in the round-Gozo challenge and were still powering their way around the island at the time of writing.\nMr Zerafa was among those who joined Mr Agius during his 70km round-Malta swim in 2018. The five athletes swimming around Gozo for the #waveofchange initiative.\nThe #waveofchange initiative encourages people to pick up three items of plastic waste from local beaches or seas, post a photo of the items and pass the challenge on to three other people. \nThe swimmers were accompanied by support boats to keep a watchful eye on their progress and keep them fuelled with food and water.\nThe round-Gozo swim was sponsored by the QLZH foundation and Yachting Malta.  ", "comment_count": 11, "id": 1650}, {"keywords": "Food and drink, Health", "author": "", "article_body": "A chilli powder available for sale in local shops could contain salmonella and should not be consumed, health authorities warned on Saturday.\nOne kg packets of Heera extra hot chilli powder marked with a durability date of 30 April 2021 were found to be potentially contaminated with Salmonella Newport, the Environmental Health Directorate said.\nThe warning about the India-sourced product was issued through the EU-wide Rapid Alert System for Food and feed.\nFor more information, contact the Health Inspectorate Services between 8am and 2.30pm on 21337333, by emailing mhi@gov.mt or call at its offices at Continental Business Centre, Old Railway Track, Santa Venera.", "comment_count": 0, "id": 1651}, {"keywords": "Gozo, Planning Authority, Civil society", "author": "", "article_body": "Dwejra’s bid to become a UNESCO World Heritage Site remains “nothing but a pipe dream” following a “disastrous” decision to allow a restaurant to crank up its investment at the Natura 2000 site, environmentalists have warned.\n“Malta is shooting itself in the foot,” Nature Trust Malta said one day after it emerged that a tribunal had overturned a Planning Authority decision to refuse embellishment works at the restaurant.\nThe tribunal’s decision to overturn the PA ruling means objectors will now have to file a case in court if they are to halt the works.\nLocal activist Camilla Appelgren, who ran on a PD ticket during last month’s MEP elections, has challenged Environment Minister Jose’ Herrera to help fund that case, after Dr Herrera tweeted his disapproval of the tribunal decision.\nIn its statement, Nature Trust said the tribunal members were “not fit for purpose” and “unable to put environmental considerations before commercial interests”.\nIt urged authorities to step in and stop the restaurant’s bid and prevent what it called a “travesty of justice” that would inflict permanent harm on the environment and Malta’s tourism offering.\n\nDwejra's dark heritage\nDwejra is a designated Special Protection Area under the EU Birds Directive and is a key site for local astronomers, who use its dark skies to observe the stars. Local scientists had warned that allowing the restaurant works to go ahead would be \"madness\".\nA study of the area by the University of Malta's Institute of Space Sciences and Astronomy had found that the restaurant's artificial lighting was \"effectively more than doubling the night-sky brightness\" and always switched on. \nMalta’s small size, coupled with its dense population, means the country is starved of dark sky areas. A 2016 paper found that light pollution made it impossible to observe the Milky Way from 89 per cent of the country.\nIt is the second time in two weeks that the Environment and Planning Tribunal has made headlines for controversial reasons: earlier this month, a court said it was perplexed that the tribunal had allowed a member with a direct interest in the db Group’s €300m City Centre project vote on it, and nullified the project’s permit as a result.  ", "comment_count": 128, "id": 1652}, {"keywords": "Society", "author": "", "article_body": "Giving birth in a tiny spare toilet; opening up about autism after a late diagnosis; working in AI against the rise of the machines – these are some of the stories of the women in Pink, out with The Sunday Times of Malta this week.\n“I am human. I am not meant to live alone. I want to interact, but I don’t know how,” says one autistic woman, who bravely faces any stigma and adverse repercussions at her workplace, explaining her dream to set up a much needed home for teenagers with mental health problems at the most crucial time of their lives.\nBehind the scenes of the Pink ShowStopper photo shoot, shot by photographer MarieClaire Portelli.\nMount Carmel breaks you, she insists, adding that she wants to see a total change in the mental health sector.\nThe June issue of Malta’s top magazine for women also gives a blow-by-blow account of an unexpected and dramatic birth in a tiny spare toilet; and how the family coped with the panic situation as they brought a new life into this world without any medical background and midwifery skills.\nArtificial intelligence [AI] – the ‘new revolution’ – can also be very dangerous and regulation is needed to ensure the safe use of this technology.\nAn IT lawyer talks about a national strategy for the safe development of AI to not only prevent the apocalyptic predictions of sci-fi movies at the hands of machines, but also be a tool to enhance human life.\nPink is also the leading fashion magazine, and hot off the heels of The Pink Fashion Show, the June issue showcases the brands on the catwalk, the sponsors and who was wearing what.\nFashion also takes centre stage with a look inside iconic Iggy Fenech’s wardrobe to reveal his first offbeat outfit and the many others that followed, highlighting the power clothes have to communicate; while local designer Maria Cutajar’s latest collection depicts the pain and strength beneath beauty; and the June photo shoot keeps things fresh and cool in all shades of green.\nPink is a monthly magazine, produced and published by Allied Newspapers Ltd.", "comment_count": 0, "id": 1653}, {"keywords": "Waste", "author": "", "article_body": "Recycling bring-in sites across the island are being turned into veritable pigsties by litter louts dumping rubbish there with no fear of being brought to justice.\nThe lack of enforcement has gotten so bad, that a company with plans to install CCTV cameras to catch waste dumpers is now having second thoughts about the idea.\nWaste management firm GreenPak, which operates iBiN sites across Malta and Gozo, says that its investment in the smart recycling bins is being laid to waste by government reluctance to enforce its own rules.\n“The lack of enforcement is severely undermining our investment and our work.  GreenPak made a huge investment in the iBiN project and now it is being laid to waste by government’s apparent intransigence,” said company CEO Mario Schembri.\nThe San Ġwann site before illegal waste dumpers turned it into a pigsty.\n“Although GreenPak has been sending images and footage of abusive actions to both ERA and LESA to take action against the abusers, no decrease in littering has been noticed - if anything, littering is on the increase at an alarming rate.”\nThe company is now not sure whether it will go ahead and install CCTV cameras at all remaining iBiN sites, saying the lack of enforcement is making it \"doubt the wisdom of such an investment\". \nERA insists it is cracking down\nPeople who dump rubbish bags at bring-in sites are slapped with a €150 administrative fine if caught. \nERA has 14 officers who tour Malta and Gozo 'at least twice a week' during the day and night\nThe Environment and Resources Authority issued 45 such fines during January and February of this year, and on Saturday insisted it could do nothing if ERA officers did not catch wrongdoers red-handed. \n\"For fines to be administered, ERA must actually witness individuals in the act,\" the authority said in a statement which highlighted its enforcement efforts. \nThe authority has 14 officers who tour Malta and Gozo \"at least twice a week\" during the day and night to look out for waste contraventions, the authority said. Local community officers - previously known as wardens - also enforce such matters. \nThe bulk of ERA waste-related enforcement is related to people taking out domestic waste on the wrong days or well before collection time: ERA officers caught 117 such people red-handed during the first six months of the year, with most being in Qawra and Buġibba (55) and Marsascala (26). \n'Sending the wrong message'\nThose enforcement efforts, however, appear to pale in comparison to the scale of the problem.\nPhotos posted to social media suggest that waste dumping remains rampant across the country, despite new recycling laws, threats of fines and multiple bring-in sites created in towns and villages across Malta and Gozo.\nInstead of emphasising a crack-down on dumping louts, authorities are focusing efforts on cleaning up the mess they leave behind.\nEarlier this week, a large-scale emergency clean-up saw the Cleansing Department sweep up 10 tonnes of rubbish from St Paul’s Bay and Buġibba. That clean-up was organised after Times of Malta gave voice to residents who said the litter situation in the seaside towns was becoming unbearable.\nBags of rubbish illegally left at recycling sites.\nFocusing on such clean-ups is completely misguided, GreenPak fears. “The idea that Government spends money in cleaning up the mess left behind by irresponsible individuals is sending the wrong message. Money should be spent on effective, strong and decisive enforcement of the littering regulations,” Mr Schembri said.\nInstead, the company suggested creating ‘rubbish police’ tasked with catching illegal dumpers. The company has already raised the suggestion with the Finance Ministry, it said in its statement.\nDespite growing litter problems, proper use of iBiNs is on the increase: the company has seen a 40  per cent uptick in use of the smart recycling bins, which can detect when they are full and divert users of the iBiNs app to the nearest available bin.", "comment_count": 40, "id": 1654}, {"keywords": "Construction", "author": "Claudia Calleja", "article_body": "Residents of two apartment blocks that collapsed following excavation works are calling on the authorities to be more sensitive when dealing with people who lose their homes in these circumstances. All they want is to find their way back to the life they once knew. They spoke to Claudia Calleja about their struggles and fears.\n“I lost all rights over my own home”\nAnthea Brincat is tired of seeing workmen in her living room when she, and her family, are not allowed into their own home.\nRealising that some valuables had gone missing was the last straw for the 24-year-old who is insisting that something needs to be done to monitor who is allowed in and out of the property. So far, her calls have fallen on deaf ears.\n“There is a massive lack of sensitivity,” she said as she stood across the road of the Guardamangia apartment block in St Luke’s Road. The building suffered extensive damage when a wall collapsed on June 13.\n“This is our home. We have a right to know who is in our home… They take away all your rights over your home, any say over your belongings. I only want to know who’s in my house,” she said passionately, flanked by her neighbours.\nAnthea’s plight was initially flagged in a Facebook post issued by Moviment Graffitti.\nSpeaking to Times of Malta she said that, earlier this week, she was sitting outside her home and, once again, saw strangers in her home – where her belongings had gone missing. She suddenly realised: this is not right.\nShe headed to the police station and asked them to search the workmen before and after they entered the site. Police told her she was expecting too much.\nSo she went on site and asked the architect to stop the works so the police could search. She was told that only the government-appointed architect could stop the works. When called, the government architect told her to stop wasting his time, she claimed.\nAnthea Brincat on life since the collapse. Video: Matthew Mirabelli\nAnthea, her brother Nicholai and their father Raymond have been living in a government housing apartment in Żabbar since the wall collapsed. These have been a tough couple of weeks on many levels.\nApart from losing their home, they have been struggling to come to terms with the situation.\nAnthea Brincat (second right), her brother Nicholai (centre background) and father Raymond (centre front) with neighbours Alfred (left) and Emma Attard (right) and Janet Walker.\n“I have not been able to sleep well,” her brother said as Anthea added: “Tensions are high. We’ve been arguing a lot, which is not normal for us.”\nSince the incident they have only been allowed to enter their home on two occasions.\n“People don’t understand this. They think you can just go into your home when you want. But we can only go with the court’s permission,” she said.\nThe morning after the incident they were allowed in for five minutes. “When you see your home has been destroyed, your mind freezes. You would have been planning what to take out but, there and then, you get blocked. Just imagine, I grabbed my winter clothes,” she said. Her brother added: “I got my laptop but left the charger there.”\nRELATED STORIES'We no longer have a voice'\nSome days later they were allowed to go in for half an hour – but they had to take it in turns. It was then that Anthea noticed that some cash and jewellery had gone missing from a bureau that ended up crashing out of the building.\n“The odd thing is that we were allowed in. But our architect could only go in once the area was fixed. This doesn’t make sense. I want my architect, who I trust, to have a complete picture and not see the damage when it has been concreted over,” she said.\n“They are saying the building is safe and we can eventually move in. But, with all due respect, these are the same people who told us it was safe when we pointed out the cracks in the walls before it collapsed. We just want to feel safe in our home.”\n“I get startled with every noise I hear”\nIt’s been over two months since Robert and Edward Muscat’s Guardamangia home collapsed – and they still have no clue what the future holds.\n“There should be a central point of contact where people can call if they are facing this situation. We have no idea what to do and where to go. We had been promised a meeting with the contractor, the site owner and insurance representative but it never happened. We’re being ignored,” said Robert Muscat as he sat in the bare living room of the Ħamrun apartment being rented out for them by the owner of the construction site.\nWorks on the site, located on Guardamangia hill, resulted in the collapse of the apartment block, where the brothers lived, on April 24.\nSince then the brothers spent two nights in a hotel before being relocated to the Ħamrun apartment – where they’ve been trying to figure out their next steps – and their rights.\nRELATED STORIESErr, where's my garden wall? - Kristina ChetcutiA surplus of callousness - Claire Bonello\n“We lost all our belongings. We lost our clothes and so many irreplaceable things of sentimental value. We had been living in that apartment with our mother since 1993. She died eight years ago. It was filled with memories.\n“The bedroom furniture that our mother had inherited from her mother is destroyed. Inside it, there were also jewellery and other items that belonged to her,” Robert said.\nThe brothers managed to dig out a couple of picture frames from the rubble. Apart from coming to terms with their material losses, they are also struggling psychologically.\n“When you go through something like this your life stops. I wouldn’t want anyone to have to go through it,” Edward said, his eyes welling up.\nHis brother added: “I get startled with every noise. I don’t walk under balconies. I’m always scared something happens.”\nThe brothers just want to be able to settle and move forward.\n“We want to know what’s going to happen,” Robert said, acknowledging that they had received support from the government and local council while adding that it would be helpful to have a contact number for further guidance.\n“We are focusing too much on the buildings. When these things happen, we need to concentrate on the people – they are alive and need to get on with their lives. We need help rebuilding our lives,” Robert said.", "comment_count": 53, "id": 1655}, {"keywords": "Media", "author": "", "article_body": "These are the articles making front page headlines in this Saturday’s local newspapers.\nTimes of Malta reports that PN leader Adrian Delia is meeting with party councilors in a bid to shore up support, with a petition calling for a confidence vote in his leadership looming.\nThe newspaper also writes that the Planning Authority has approved 52,000 properties in the past five years alone.\nThe Malta Independent quotes Justice Minister Owen Bonnici, who challenged PN MP and lawyer Jason Azzopardi to ‘speak to the authorities, not throw mud’ if he knew something about Daphne Caruana Galizia’s murder. Dr Azzopardi had told the Council of Europe on Wednesday that the murder was ‘planned by people with access to the highest corridors of power’.\nL-Orizzont highlights Planning Minister Ian Borg’s declaration that 318 construction sites around the country have resumed works. The newspaper also reports that Caritas is worried that synthetic drugs are becoming cheaper.\nIn-Nazzjon writes that construction rules are to be altered for the second time in a week, with minister Ian Borg having told architects he is willing to consider their suggested amendments to the revised laws.\n ", "comment_count": 1, "id": 1656}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "Nationalist Party leader Adrian Delia is meeting members of the General Council face to face before it is convened with the prospect of a vote of no confidence taken on his leadership, Times of Malta is informed.\nSenior PN sources have also raised the possibility that the beleaguered leader is playing for time to enable him to meet as many members as possible before the extraordinary council meeting is held.\nThe petition calling for the meeting has not so far been included on the agenda of Monday’s gathering of the parliamentary group and nor for a meeting of the Executive Committee scheduled for Thursday. According to a party statement earlier this week, it is the executive committee that will decide when to hold the General Council.\nSigned by 200 council members, 50 more than the minimum stipulated by the party statute, and presented to the party last Tuesday, the petition indicated the council should be convened within a week.\nDelia promising a clean sweep\nThe issue is however expected to be raised by members within both the parliamentary group and executive committee, sources said.\nTimes of Malta is informed that Dr Delia is promising members that if he is re-confirmed, certain people within his coterie “would be forced out”.\nOn Thursday, members of the council are due to elect new presidents of the party’s administrative and executive committees as well as a new treasurer, following recent resignations.\nThe first two positions will be contested. For the post of treasurer, only Charles Selvaggi, director of a private consultancy group, is contesting.\nThe position is hardly one that is sought after given the party’s dire financial position, as reported earlier this year, and the fact that banks would consider the treasurer as a Politically Exposed Person.\nRichard Muscat, a former parliamentary secretary under PN administrations who is known to be a Delia sympathiser, has been appointed to lead an independent electoral commission.\nHe is being criticised by some quarters over his refusal to let some members of the executive vote early because they will be abroad on Thursday.\nWhile the statute is silent on this possibility, such requests have been accepted in the past, sources said.\nEligibility questions\nWithin the upper echelons of the party, attention has now shifted to the list of PN councillors eligible to vote in the crucial General Council meeting.\nCartoon: Islanders.\nThe PN administration has said that according to its lists, some 23 of those who signed the petitions and were councillors until a few months ago were not considered councillors any longer.\n“I was a councillor until a few months ago and no one ever informed me,” one of the petition signatories complained.\nRELATED STORIESYou're weaker divided. So is the country - Michela SpiteriThe PN has a sense of entitlement - Martin Scicluna\n“I cannot understand what changed. Perhaps because I wrote on Facebook that it is in the interests of the PN that Delia should resign!”\nAccording to the party, 55 of the signatories have not paid their membership card (tessera).\nOne councillor described this as “strange”: “The party has been saying that the number of tesserati has risen over the last two years, yet according to their lists, a quarter of the signatories are not tesserati anymore.”\n“If that’s true it’s alarming,” another councillor said.\nBreakdown in trust\nPN insiders spoke of a complete breakdown of trust in the present party administration, including in the way databases of councillors and members are compiled and kept.\nMany of Dr Delia’s critics point a finger at the PN’s political coordinator Jean Pierre Debono for alleged “manipulation” but Times of Malta is informed that the databases are ultimately the responsibility of the office of the general secretary, managed by Clyde Puli.\n“This is a crucial vote for the PN’s survival and no stone will be left unturned to verify who should be on that list or not, why councillors were struck off without notice and who are the new ones replacing them,” another PN insider said.\nAsked to explain why lifetime councillors have just found out that they were recently struck off the lists, the reasons for these changes and how many councillors have been replaced since Dr Delia became PN leader were not answered by the PN’s spokesman before going to print.", "comment_count": 123, "id": 1657}, {"keywords": "Accident, Police", "author": "", "article_body": "A 31-year-old man who lives in Mellieħa was grievously injured on Friday when he fell as he was going down the stairs.\nThe accident happened in Triq Sant’Anton Abbati in Mosta at 2pm.\nThe police said the man, who is British, was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1658}, {"keywords": "Culture, Government", "author": "", "article_body": "Festivals Malta Agency has been set up.\nThe agency, chaired by Norman Hamilton, will implement the objectives and perform all those functions established to create, maintain, organise, administer and oversee the organisation and implementation of a portfolio of national and international cultural and artistic events, festivals and cultural infrastructural projects. \nCulture Minister Owen Bonnici said that this step fully encapsulated the strategy brought forward by the government when it came to the culture sector.\nFestivals Malta, which until now operated as a brand, will now have a distinct legal personality and will achieve its objectives by performing functions such as providing the right platform to sustain growth and development of the existing festivals portfolio.\nIt will deliver levels of excellence in the execution of events and festivals, build on the current festivals and events portfolio with new ideas and innovation, and dial up audience engagement and participation, the minister said.\nFestivals Malta is also tasked with developing the festivals portfolio into an ongoing creative platform for Maltese and international artists and creative practitioners through the commissioning of new work in partnership with national and international arts organisations and festivals, and whilst also increasing participation locally through outreach activities and develop distinctive strategies for each festival to increase engagement.\nThe agency will encourage a national arts and culture calendar, offering a consolidated programme and driving greater synergies, impact and alignment across public and private cultural organisations.", "comment_count": 6, "id": 1659}, {"keywords": "PN, Politics", "author": "", "article_body": "Former Nationalist MP Louis Refalo, known in Gozo as tal-qaddis, has passed away, aged 69.\nThe Nationalist Party said in a statement, Mr Refalo will be remembered as a humble gentleman who was always ready to serve the people with a smile. He worked endlessly in the best interests of Gozo and Gozitans.\nMr Refalo served as an MP between 1981 and 1996, following in the footsteps of his father Carmelo, who also served in Parliament as a Nationalist MP.\nMr Refalo was director of Sea Malta and the Freeport.\nThe Nationalist Party offered its condolences to his family.", "comment_count": 9, "id": 1660}, {"keywords": "PN, Politics, Elections", "author": "Keith Micallef", "article_body": "PN executive committee members are upset that their request to hold early voting for a July 4 election to choose who will lead the party's committee and administrative council was denied. \nParty sources told Times of Malta that the demand was made because some members will not be able to cast their vote as they will be abroad. \nIn the past, similar concessions for early voting had been made, they noted. \nMoreover, sources said the decision against holding early voting may cast a shadow on the outcome of these elections if the result will be very tight, possibly down to a handful of votes.\nAlex Perici Calascione and Graziella Attard Previ are contesting the post of executive committee president while Carmelo Mifsud Bonnici and Graham Bencini are running to become the PN's next administrative council president.\nThe elections were triggered by the unexpected resignations of Mark Anthony Sammut as president of the executive committee and that of David Stellini, whose position as Administrative Council president automatically ended when he resigned from Parliament. \nBoth resignations were announced following the PN’s double electoral drubbings suffered last month. \nThe PN did not reply to questions about the request to allow early voting.", "comment_count": 11, "id": 1661}, {"keywords": "Gozo, Environment, Planning Authority", "author": "Ivan Martin", "article_body": "Malta's best-remaining site for astronomical observations is set for increased light pollution after a tribunal decided to grant a restaurant permission to light up more bulbs.\nA Planning Authority ruling to refuse embellishment works on the restaurant in Dwejra, Gozo, was overturned this week by the Environment and Planning Review Tribunal.\nWhen the proposal was first filed, astronomy experts had insisted that the introduction of lighting at the site would be “madness” and NGOs had said it threatened the entire area’s ecology.\nIn November of 2017 the PA had refused to grant permission to install a canopy, lights and sign and place tables and chairs at the site.\nIt had found that the proposal would negatively affect an important area and jarred with a Strategic Plan for Environment and Development meant to safeguard and enhance biodiversity.\nThe list of objectors included the Department of Physics at the University of Malta, Light Pollution Awareness Group, Birdlife Malta, Friends of the Earth Malta and Nature Trust Malta.\nEnvironment Minister Jose Herrera indicated he disagreed with the Tribunal decision and encouraged objectors to appeal \"for the best interest of the environment\". \nWith their PA avenues exhausted, objectors must now file an appeal in the law courts if they are to try and block the development - something they told Times of Malta would cost them a lot of money. \n\nMalta's Milky Way heritage\nDwejra is designated as a dark sky heritage area according to Mepa’s Gozo and Comino Local Plan, meaning that the installation of lighting that is not related to aerial or maritime navigation should be strongly discouraged.\nBefore the decision was taken in 2017, a spokesman for the Institute for Astronomy and Space Sciences had noted that Malta was one of only five countries where the possibility of observing the Milky Way from home was precluded to all of their inhabitants.\nThe other four countries were Singapore, San Marino, Kuwait and Qatar.For the Astronomical Society of Malta, further development, particularly with regard to lighting at night, was “disastrous”.\nAccording to Front Ħarsien ODZ, the area is a very ecologically sensitive one, given it falls within a Natura 2000 site and a designated special protected area under the Wild Birds Directive.\nIt is also an important nesting site for the Scopoli’s shearwater and the Yelkouan shearwater, birds which are particularly sensitive to light and noise, the heritage NGO Din l-Art Ħelwa maintains.", "comment_count": 97, "id": 1662}, {"keywords": "Court, Justice, Family", "author": "Edwina Brincat", "article_body": "A woman swindled her mother out of her life savings and left her without enough money to move into a residential home, a court found on Friday. \nAloisia Mifsud Grech, 53, withdrew more than €30,000, sold her mother's bonds and stocks and racked up bills at beauty salons, supermarkets and a hotel.\nShe was jailed and ordered to return the cash and valuables.\nThe case began when an elderly lady turned up at Birkirkara police station and claimed that one of her daughters, who she had entrusted with a general power of attorney, had withdrawn over €30,000 from her bank accounts.\nThe mother-of-eight, together with four of her adult children, subsequently reported that Ms Grech had also arbitrarily sold stocks and bonds belonging to her parent, while refusing to return the family’s gold heirloom entrusted into her possession following a rise in charges on bank safety deposit boxes.\nThe suspected swindler had persisted in her ways even after being informed that her mother had ordered the “immediate” revocation of the power of attorney, five days before being turned out of her mother’s home where she had resided together with her husband up to 2015.\nCriminal action was instituted against the woman for misappropriation over a 12-month period between 2014 and 2015.\nConflicting versions of events\nIn the course of the proceedings, two conflicting versions emerged.\nOn the one hand, the accused insisted that she had always acted on her mother's instructions, that she had withdrawn money to be shared among all siblings and that the valuables were being held in exchange of personal belongings she had left behind at her mother’s home when ordered out.\nOn the other hand, there was the testimony of other witnesses, including the damning proof put forward by the \"lucid and eloquent\" elderly lady.\nThe accused’s version, riddled with inconsistencies, “lies and tales”, was far-stretched and lacking in credibility, the Court, presided over by magistrate Donatella Frendo Dimech, observed.\nWhile insisting that she had handed over the money to her mother to be divided between all siblings, the latter had not received “a single penny”.\n“She took the bonds and everything,” the mother had testified, “She did not borrow, she stole.”\nHer elderly parent had never given the accused a “carte blanche” to do as she pleased with the money, the Court remarked, adding that the accused had not brought a single piece of evidence that payments at various supermarkets, a hotel, a beauty salon and other retail outlets had been with her mother’s blessing.\nOver €25,000 had been withdrawn in 48 hours, while there had been regular withdrawals varying between €100 and €500 from the ATM at the Birkirkara Civic Centre, making up a lump sum of €30,466.25, the Court went on.\nRepeated calls by her mother and siblings to return the general and special power of attorney, had gone unheeded, the Court noted.\nThe evidence showed that the accused had taken over her mother’s bank accounts, made free use of her bank card to fuel her personal expenditure, arbitrarily sold her mother’s stocks and bonds, subsequently withdrawing the funds and kept refusing to hand over the family valuables even when asked to do so by the Court.\nSuch wrongdoing had landed her elderly mother in a situation where she could not afford to seek care at a home, where she had wished to spend the final years of her life, the Court observed, taking this into consideration when meting out punishment.\nDeclaring the daughter guilty of misappropriation, the Court condemned her to a four-year effective jail term and ordered her to return the €30,466.25 as well as the gold items, stating that the punishment was to serve as a deterrent to those who sought to exploit vulnerable persons who, in old age, were constrained to turn to their trusted ones for help.\nThe Court also called upon the Police Commissioner to investigate one of the accused’s brothers for possible perjury after concluding that his testimony had been “totally fabricated” in an attempt to corroborate the accused’s version.", "comment_count": 0, "id": 1663}, {"keywords": "Court, Justice", "author": "", "article_body": "A man with ‘no fear of the law’ saw his sentence reduced by two months as a result of efforts to reform himself.\nJulian Cucciardi, 26, was in 2015 charged with driving an unlicensed car without insurance and without a licence, not wearing a seatbelt, refusing to give his particulars to the police and relapsing. He had admitted the charges before the court of magistrates in 2016 and was jailed for 12 months.\nThe prosecution, led by Police Inspector Maria Stella Attard, had also asked that the court to disqualify him from driving.\nMr Cucciardi appealed the sentence, arguing that the punishment was excessive. He argued he had reformed since the incident and a fine would be a better punishment for the crime.\nMr Justice Giovanni Grixti presiding the Court of Criminal Appeal, decided that the punishment was within the parameters laid down by law.\nThe court noted that the first court had observed that this was the third time that Mr Cucciardi had been found guilty of the same offence. It had ruled that the accused had “no fear of the law and no reason to obey it” and that other courts had made similar observations.\nMr Justice Grixti highlighted the fact that constant jurisprudence had established that a first court’s decision on punishment should stand unless it was not within the parameters or form set down in the law.\nThe judge said he saw no reason to re-calibrate the discretion exercised by the first court. But having heard the appellant make several arguments about how he had reformed and had used the vehicle in an emergency, despite having brought no evidence to sustain his claims, Mr Justice Grixti saw a window of opportunity to keep the man on the right side of the law.\nThe court said it hoped that the accused was truly trying to reform himself, and added that it would reduce his punishment, not because it was too harsh, but for him to understand that the court was also helping him reach his goals.\nAs a result, Mr Cucciardi’s 12-month jail term was reduced to 10 months.", "comment_count": 0, "id": 1664}, {"keywords": "Construction, St Julian’s", "author": "Matthew Xuereb", "article_body": "Objections are flowing in over the proposed development of a massive residential block of almost 40 luxury apartments, including pools, close to the scheduled 17th century Mensija Chapel in San Ġwann.Concerns were expressed by the Superintendence of Cultural Heritage and the Curia over potential damage to the chapel in Triq is-Santwarju in the area known as Mensija.The chapel, built in the 1650s, was built over a large cave adjacent to the plot of land currently being earmarked for this development.Application PA/04214/19 is proposing the demolition of existing dilapidated structures and the excavation and construction of underlying parking, a Class 4A Office, duplex residential units with gardens and pools, and overlying residential apartments, including a receded floor.The site is located along the ridge overlooking Wied Għomor valley, which is an Area of Ecological Importance. The area has a high cultural and historical value,characterised by a cluster of buildings forming a hamlet already visible in 1908, which is marked by the Mensija Sanctuary and the Lanzun Tower, both scheduled at Grade 1.According to the Superintendence of Cultural Heritage, the site is located just 200 metres from the Mensija cart ruts, another site of archaeological importance.“There is a risk that development in the area may pose a threat to known and unknown cultural heritage. The Superintendence notes the location of an existing cave and the distance set from the excavation within the site footprint. The nature of the cave requires further assessment. No proper survey of the cave, showing its extension and actual distance from the limit of the excavation have been submitted,” the superintendence said, as it called for more clarifications on the matter.The superintendence also noted with concern the scale of the development, the extension of the excavation and the impact it might have on the cultural landscape, including views and vistas to and from the scheduled sanctuary.The Archdiocese of Malta also objected to the proposed development because of the possible impact on the historic chapel and the underlying cave.“This original chapel, which encompasses protected and fragile caves, is a scheduled Grade 1 building and will be negatively affected by the proposed development, in particular with excavation works, not to mention the negative visual and environmental impact this project will have on Mensija. The proposed development also goes against several policies,” the Curia said in its objection filed with the Planning Authority.A photomontage of the proposed development\nDozens of residents also filed their objection to the proposed development.One angry resident said in a representation to the PA: “Undoubtedly, a development of this proportion in a location like this will inevitably destroy the tranquil locality of this Mensija hamlet and will impact the environment heavily and negatively from all perspectives. It will create unprecedented traffic, noise, worsen the parking issues and change the social fabric of the neighbourhood from a tranquil local hamlet to one led by speculation and concrete.”Objections to the proposed development close on Friday.", "comment_count": 55, "id": 1665}, {"keywords": "Childcare, Civil society, Society", "author": "", "article_body": "Thirteen organisations working with children have united under one umbrella network to serve as a united voice for children and to ensure their rights are enshrined in the law.\nCalled the Malta Children’s Associations Network (MaltaCAN), this new platform was inspired by Eurochild president Marie-Louise Coleiro Preca and is being set up to promote, foster and support children’s rights and child participatory mechanisms in Malta.\n“This is the first network of its kind in Malta and I believe it will open up new possibilities for the effective implementation of children’s rights at a local level. It will also consolidate the efforts of all these 13 organisations – and others who wish to join – to achieve meaningful child participation in all sectors of our society,” President Emeritus Coleiro Preca said.\nThe network is being facilitated by the Malta Foundation for the Wellbeing of Society as part of its fifth anniversary celebrations. It will be aligning its work to the UN Convention for the Rights of the Child, which celebrates its 30th Anniversary this year, and prioritising child participation through an integrative and collaborative approach.\nThe founding members include: the Malta Foundation for the Wellbeing of Society, Assistance to Children in Care Association (ACICA), Birdlife Malta, Fondazzjoni Sebħ, Karl Vella Foundation, Church Schools Children’s Fund, Malta Dyslexia Association, Malta Girl Guides, MGRM, National Foster Care Association Malta (NFCAM), Right2Smile, Early Childhood Development Association Malta (ECDAM); Salesians of Don Bosco together with the Salesians Pastoral Youth Services.\nInterested NGOs who would like to join MaltaCAN, are to get in touch with the network via e-mail on maltachildrensnetwork@gmail.com or contact MaltaCAN on Facebook.", "comment_count": 2, "id": 1666}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A man, who admitted to stealing from a Marsa dance school last week, was handed a suspended sentence and advised to seek help rather than make his personal situation worse.\nJoseph Buttigieg, a 45-year old Marsa resident, was charged with breaking into the school during the night of June 21, stealing, damaging third party property as well as relapsing.\nAfter consulting his legal aid lawyer Yanika Bugeja, the man confirmed his guilty plea, stating that he was certain of his admission.\nThe court, presided over by magistrate Doreen Clarke, declared the accused guilty, handing down an 18-month jail term suspended for three years.\n“If there are problems, solve them. Don’t create more. There is help available for you,” was the Court’s final word of advice, further warning the man of the consequences he would face if court conditions were to be breached.", "comment_count": 0, "id": 1667}, {"keywords": "Crime, Court", "author": "Edwina Brincat", "article_body": "One of a gang of four, who allegedly robbed a man at Marsa, was found with the loot in his pocket, after the victim put the police on his tracks.\nIsak Ali Adan, a 24-year old Somali national, currently jobless and living at the Ħal Far tent village, was marched to court on Friday pleaded not guilty to theft aggravated by violence on account of the fact that the perpetrators had been more than one. The theft was also aggravated by value and time, while he was further charged with recidivism.\nNo request for bail was made since the man had no fixed address.\nHe was remanded in custody while police investigations continued.\nInspector Robert Vella prosecuted. Lawyer Yanika Bugeja was legal aid counsel.", "comment_count": 0, "id": 1668}, {"keywords": "Environment, Government, Local councils", "author": "", "article_body": "Approximately 10 tonnes of waste is now being collected daily from Buġibba and St Paul’s Bay after the government was forced to step in to deal with the accumulating backlog.\nThe Cleansing and Maintenance Division offered additional cleansing and upkeep services to the Buġibba and St Paul’s Bay Local Councils as part of an emergency cleansing campaign which started on Monday. The campaign is being made in collaboration with the Ministry for Finance.\nRELATED STORIESLitter making life miserable in St Paul’s BaySt Paul's Bay area to get clean-up 'blitz'\nEight employees from the Cleansing and Maintenance Division will carry out additional waste collection at 5pm, doing hot power-washes of the roads, and also upkeep and maintenance of street furniture on a daily basis.The Parliamentary Secretary for Consumer Rights, Public Cleansing, and Support for the Capital City Deo Debattista promised that public cleansing was to be a priority for all local councils, admitting that some localities required extra help - and saying CMD would help where necessary.", "comment_count": 28, "id": 1669}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A man allegedly involved in the violent mugging of an elderly Sliema couple in May, was remanded in custody upon his arraignment on Friday.\nSimon Camilleri, a 52-year old unemployed Cospicua resident, was also charged as one of a suspect group of armed robbers involved in a hold-up at a Paola convenience store in April.\nThe man pleaded not guilty to complicity in armed robbery, unlawful arrest and recidivism.\nHe was further charged of assaulting and robbing the elderly couple on Sliema on May 18, leaving the 91-year old man with grievous injuries.\nRELATED STORIESElderly Sliema couple mugged in broad daylight\nAlthough no bail was requested at the arraignment, defence lawyers Alfred Abela and Rene Darmanin requested that any civilian witnesses be summoned without delay.\nBack in 2014, the man, said to be “living a life of crime,” was jailed for four years after being convicted for a mugging of two elderly sisters, when he snatched their gold necklaces.\nPolice Inspectors Fabian Fleri, Lydon Zammit and Oriana Spiteri prosecuted.", "comment_count": 0, "id": 1670}, {"keywords": "Architecture, Construction, Court", "author": "Ivan Martin", "article_body": "Updated 12.50pm\nConstruction works have continued at more than 300 building sites after architects submitted newly introduced paperwork, Infrastructure Minister Ian Borg said on Friday.\nAddressing a press conference, Dr Borg said that to date around 318 declarations that works at sites did not present any danger to neighbouring property had been submitted by architects online.\nAlthough he had no definitive number, Dr Borg said there were around 2,500 construction sites on the island.\nNew regulations for the sector, requiring architects to declare that planned works are safe, came about after a spate of building collapses linked to adjacent construction works and were introduced after a brief five-day consultation period.\nDr Borg said that a number of method statements for demolition and excavation works - another of the new requirements introduced - had also started trickling in.\nThis, he said, proved that it was not true that these method statements took months to be drafted.\nRELATED STORIESConstruction 'at a standstill' as confusion reigns over new rules\nThose who wished to submit a method statement and get on with works, he said, were doing so. And, complaints that government had effectively blocked construction through these new requirements were simply not true, he said.\nProjects on the back-burner\nSeveral property owners contacted Times of Malta in recent days to lament how the changes meant they would have to put their projects on the back burner.\nThe minister said he had held a meeting with the Kamra Tal- Periti on Thursday evening to discuss the reform and “neither side held back”.\nIan Borg said he expected the KTP to make their amendment proposals. Photo: Chris Sant Fournier\nHe said he expected the KTP to consult with its lawyers and come up with possible amendments to the reform in the coming days.\nArchitects promised legal backing\nThe minister's declaration came soon after architects sued by angry developers were promised legal backing by their regulatory body.\nThe Chamber of Architects and Civil Engineers said on Friday that it would enter any cases brought against architects in a civil capacity and “put all its resourcesto defend its members against cowboy operators”.\n“The Kamra will also be writing to the Chief Justice to request that such lawsuits are dismissed on a prima facie basis in the interest of public safety,” it added.\nWorks have ground to a halt on most construction sites across the country following a sudden change in regulations prompted by a spate of building collapses.\nRELATED STORIESProperty owners are bearing the brunt of legal changes\nTo circumvent the regulations, architects must certify that works will not affect third party property – something many are unwilling to do, arguing that much depends on the professionalism of contractors and their workers, who remain unregulated.\nTheir reluctance to sign such declarations has puts many under “immense pressure” from angry developers, who want works to proceed without delay, the Chamber said.\n“The Kamra has received multiple reports from members of the profession who received personal threats as well as threats of crippling and vexatious lawsuits if they do not sign such declarations.”\nAsked about this, Dr Borg said he had already urged the KTP to raise the issue with the police.\nRELATED STORIESConfusion and clarity - differing views on new construction site rules\nThere were some architects, he said, who had read the details of the reform and sought legal advice. And there are others who needed more clarifications.\nThe government will shortly be releasing a Q&A on the matter.\nThe minister, who was flanked by Property Market Parliamentary Secretary Chris Agius, said the government had met with the head of engineering at MCAST, and discussed whether engineers could be considered site technical officers.\nPart of the reform saw the introduction of site technical officers who have to be warranted architects. The government was now considering opening this up to engineers too.", "comment_count": 31, "id": 1671}, {"keywords": "Health, Food and drink", "author": "", "article_body": "A brand of palm oil that originates in Ghana should not be consumed because it contains an unauthorised dye unsuitable for consumption, health authorities have warned. Plastic bottles of Ghana Best palm oil with a durability date of 30 April 2021 contain Sudan IV, the Environmental Health Directorate said. Sudan IV is a reddish brown dye often used to stain oils, waxes, greases and various hydrocarbon products. The International Agency for Research on Cancel has classified it as a category 3 carcinogen. For further information, contact the Health Inspectorate Services between 8.00am and 2.30pm on 21337333, by emailing mhi@gov.mt or by calling its offices at Continental Business Centre, Old Railway Track, Santa Venera.", "comment_count": 6, "id": 1672}, {"keywords": "Gender", "author": "Claudia Calleja", "article_body": "Political parties should place quotas on men if they want to ensure that only the best candidates from both sexes are chosen, according to a gender studies senior lecturer.\n“We need to have a ceiling on men. If we push for quotas on women, those women would have to constantly legitimise their position. We need to curtail men’s over-representation in politics because we’re bringing in mediocre men,” JosAnn Cutajar said, quoting French gender politics expert Rainbow Murray. I know women who take off their wedding rings to ensure they are not treated as potential mums\nShe was speaking during a business breakfast titled ‘Equality is not a women’s issue alone, it’s a men’s issue too’. The event was organised by Women Directors in Malta, an organisation that seeks to help women make the right connections to get to board level. \nI know women who take off their wedding rings to ensure they are not treated as potential mums\nDr Cutajar – who is also the chair of the Consultative Council for Woman’s Rights within the Ministry for European Affairs and Equality – was sharing insights from her current project that involves an audit of political parties.\n“If parties don’t change, we won’t have change. It’s the party, the leaders, that push candidates. When we speak about quotas for women, people say it’s not meritocratic. We are saying: push the best men and women forward. With too many men the talent pool is affected,” she said stressing that this applied to all minority group representations. The result of this misrepresentation, she cautioned, was alienating voters.\nJust 10 out of Malta’s 67 MPs are women, making the country an EU laggard when it comes to gender parity in political participation. In March, the government unveiled plans to increase women’s participation in politics. Rather than direct gender quotas, the government is proposing to raise the number of MPs by up to 12 more seats to ensure gender parity. The proposed measure is gender-neutral and applicable to any gender with less than 40 per cent representation.\nTransparent selection criteria\nDr Cutajar elaborated that, as research showed, men start out at an advantage in politics: They benefit from the assumption that they are competent because they are men, criteria for access are based on previous male role models, and their traits and qualifications are seldom subject to close scrutiny. \n“We need transparent, objective criteria that constitute good representation,” she said. At the moment, when selecting candidates, political parties are more interested in how much time the candidate has, how much money they have to run a campaign, their charisma, ability to woo the crowd and party loyalty. The qualities of a good politician should include intelligence, honesty, keeping promises, compassion, integrity, confidence and adaptability.\nHowever, she said, the reality is that women are questioned on a lot of things men are not: When they have children, what they wear, and so much more. \n“Women still face different questions in the interview room. They are still asked about their potential procreative side. I know women who take off their wedding rings to ensure they are not treated as potential mums,” she said prompting a comment from a woman in the room who said she was once asked: “But now that you are responsible for another human being, how do you expect to cope with this role?” \nRepresentatives of the community \nThe figures, she added, show there are more women in local councils (22 per cent) than serving as MPs (13.1 per cent) and ministers (10.1 per cent). These women are living in the grass roots and have a lot to offer.\n“We need the input of women because they have another stand on health, economy and many issues. They are often part of the grass roots and the community – these are the people we want in Parliament. Politicians need to be representatives of the different groups in society,” she stressed.\nAlso speaking at the event, journalist Josanne Cassar said she was concerned that quotas on women would not work without “a huge support structure”. The reality is that women still take on the bulk of the child caring role and, juggling this with their job and a political career may not seem worth it without the right support.\n“The government talks about having more women, but what is stopping it from putting more women on boards?” she said. \nSilvan Agius, director of Human Rights and Integration Directorate within the Ministry for European Affairs and Equality, said the government was working on a strategy and the next step would be to transpose it into every government ministry and directorate. \n“The only way forward is adopting a systematic approach and having the same rules apply across the government. This needs to become something obligatory,” he said.", "comment_count": 20, "id": 1673}, {"keywords": "Crime", "author": "", "article_body": "A passenger arriving in Malta from Tunis found himself under arrest - and some €24,000 poorer after he was found to be carrying more cash that the €10,000 allowed.\nIn the early morning hours, Customs officials from the Anti-Money Laundry Team discovered nearly €34,705 in undeclared cash on the passenger at the Malta International Airport.\nThe passenger passed through the Green Channel, signifying that he had nothing to declare. However, upon inspection of his personal belongings, the money was found, with €10,000 returned to him and the rest being seized pending investigation.\nThe Police Anti-Money Laundering Section was duly informed and placed the passenger under arrest.", "comment_count": 19, "id": 1674}, {"keywords": "History", "author": "Stephanie Fsadni", "article_body": "A restored painting thought by some experts to be a long-lost masterpiece by Caravaggio and estimated to be worth over €100 million has been bought for an undisclosed sum by an unnamed buyer two days before it was due to be auctioned.\nDiscovered five years ago under an old mattress of a private home in Toulouse, southwest France, the 1.44 by 1.75-metre canvas depicts the beheading of Assyrian general Holofernes by the widowed Judith in the biblical Book of Judith. \nSpecialists determined it was painted circa 1606, two years before Caravaggio painted another beheading, that of St John, which graces the Oratory of St John’s Co-Cathedral in Valletta. \nThe artist came to Malta in 1607 after fleeing Naples where he was condemned to death for stabbing a man in a street brawl in Rome. He sought absolution from the Knights of St John, but after a few months, he was imprisoned for yet another brawl with a knight. He eventually managed to escape from the island.\nThe unexpected sale has raised eyebrows in the art world, especially among those experts, including a Maltese professor, who dismiss claims the oil painting was by the Renaissance master.\n“It is a very fascinating picture that was surely depicted in the period and in the context of Caravaggio. But despite the close proximity, I do not believe it is his work because of a number of incongruencies,” Keith Sciberras, head of the University’s Art and Art History department, told Times of Malta.\n“The creative power of the narrative and technique used fail the mark,” he pointed out.\nHis view is certainly opposed to that of Eric Turquin, considered France’s leading authority on Old Masters paintings, who has staked his reputation on the assertation that the painting is the fiery Italian artist’s second version of Judith Beheading Holofernes. \nThe other version, rediscovered in the 1950s, is located at the Galleria Nazionale d’Arte Antica at Palazzo Berberini in Rome. \nMr Turquin not only believes that the life-size canvas is a Caravaggio but has called it “one of the great pictures” of all the known Caravaggios. \nHe is adamant it is the original painting whose existence was first noted in letters between Italian dukes and art dealers four centuries ago. He estimated the painting to be worth between €100 million and €150 million.\nProf. Sciberras had the opportunity to observe the painting closely during two separate scholars’ days held at the Pinacoteca di Brera in Milan in February 2017 and at the Louvre Museum in Paris, four months later. He was one of the few international experts on Caravaggio and 17th-century art who were invited to both workshops.\nThe creative power of the narrative and technique used fail the mark\n“The painting remains a milestone discovery for Neapolitan Caravaggism but I do not believe that it has the qualities to be called an autograph work,” he said.\n“I made my views very clear on both occasions and there were others who shared my opinion,” he reiterated.\nThe Louvre Museum had the opportunity to buy the work for around €100 million but rejected the offer as not all scholars agreed on its authenticity. It was then announced in February that the painting would go under the hammer on June 27.\nProf. Sciberras believes that whoever painted this work could have possibly seen Caravaggio at work or had access to his works.\nSome connoisseurs have, in fact, suggested that the painting could have been a copy of one of his Franco-Flemish disciples, Louis Finson.\nFinson was a recognised artist in his own right, who both owned and reproduced Caravaggio’s work. He was also an art dealer who may have had an ulterior motive in making Caravaggio duplicates and then selling them off to wealthy merchants in his native Bruges and Amsterdam. \nHe is known to have had at least one reproduction of the missing tableau, which now hangs at the Palazzo Zevallos in Naples.\nProf. Sciberras is, however, not entirely convinced about this claim either.\n“We don’t know who the artist was… but, you know, people want names,” he said. \n“Some also suggested that it could have been done by two hands, meaning that is was started by Caravaggio and continued by someone else, but I find that improbable,” he remarked.\nThe painting was sold in Toulouse by Marc Labarbe, the provincial auctioneer who discovered the work after a local family asked him to value some “old things in the attic” of a house they were clearing. The family − who have not been named − believe it may have been brought to France by one of their ancestors, an officer in Napoleon’s army.\nMr Labarbe said he could not reveal the name of the buyer or the price paid because of a confidentiality agreement. He only revealed that the foreign buyer was a collector “close to a major museum”.\nFrench art expert Eric Turquin (left) showing the painting Judith Beheading Holofernes to visitors at the art gallery Kamel Mennour, Paris, after it was restored. Photo: François Guillot/AFP", "comment_count": 8, "id": 1675}, {"keywords": "Education, Unions", "author": "Claire Caruana", "article_body": "Updated at 3pm with UPE statement\nProposed changes to the way students are assessed at the end of their primary education are \"rushed\" and being implemented without \"consideration, direction and with inconsistency\", the teachers' union has charged.\nIn a statement on Friday morning - a day after the government announced plans to phase out the current benchmark system - the Malta Union of Teachers said that the Education Ministry had announced another reform to the education system \"out of the blue\". \n\"While the reform was never discussed with the MUT during sectorial agreement talks and therefore it is not included in the agreement, the union observes that there seems to be two different currents within the ministry that are not working together.\n\"This is because this year, a process to have continuous assessment, apart from exams, was introduced. This is being introduced gradually and will continue year after year so that students in their third year of primary school, who will be in their final year by 2021/2022, will be able to experience this new system, which includes sitting for the so-called benchmark exam,\" the MUT explained.\nThe Union for Professional Educators also criticised the way the changes were announced and insisted they had not been informed about them.\nIn a statement, the UPE expressed shock at the news, which it said, had learned about through media.\nIt also said it had not seen the 25 proposals mentioned by the minister. This, it said, was a wily strategy by the Education Department to introduce changes which would drastically affect teacher’s load.\nSince teachers had not been consulted, it was probable that the change would mean a lot of work and much more stress on educators at primary level, who already had a lot to deal with.\nThe union said it was convinced that the continuous changes that were taking place would increase the teachers’ load and would not be beneficial to students. It would also discourage young people from taking up teaching at primary level.\nReform to remove exams\nEducation Minister Evarist Bartolo on Thursday said the education system will shift towards what will be called 'informal college exams' or 'informal national exams' by 2021.\nHe presented a report with 25 recommendations drawn up by the Benchmark Review Board, set up in 2017 to review the national end-of-primary assessment, more commonly referred to as the benchmark exam.\nThe reform announced on Thursday would remove the final sixth-year examination in 2021 and would affect a group of students who were not part of the gradual assessment that had been embarked on at primary level.\nThe MUT, however, is not convinced by the proposal. \n\"The MUT insists that the proposals are not a reflection of the teachers' beliefs and they do not conform to the National Curriculum of 2012, which states that exams should be held during the sixth year of primary school,\" the MUT went on.\nIt also deemed the move by the ministry \"contradictory\".\nThey said education authorities had first insisted students should still sit for their Maths and Maltese exams, despite an industrial dispute affecting the two subjects, only to announce a few days later that it would be removing exams for these two subjects as well as English. \nThe MUT also questioned the timing of the reform's launch, saying the report published on Thursday was dated \"June 2018\". This suggested it had been \"sitting on a shelf\" for a year, it said.\nThe union also criticised the decision to unveil the proposals after the school year had ended, saying this \"conveniently\" meant teachers had fewer opportunities to discuss the proposals.\nIt also denied ministry claims, made in response to a question by Times of Malta, that it had been consulted about the changes. ", "comment_count": 6, "id": 1676}, {"keywords": "Accident, Mellieħa", "author": "", "article_body": "A 25-year-old from Mellieħa was grievously hurt on Thursday afternoon after crashing his motorcycle in Naxxar. The young man was riding his Keeway motorcycle on Triq is-Salina at around 3.45pm when he collided with a Fiat Uno being driven by a 23-year-old Attard resident. An ambulance was called to the scene and paramedics took the man to Mater Dei Hospital. The police are investigating further.", "comment_count": 0, "id": 1677}, {"keywords": "Migration, Human rights, Poverty", "author": "Denise Grech ", "article_body": "The food bank has seen a rise in human trafficking victims showing up at its doors for help, administrator Rev. Kim Hurst has warned.\n“We are seeing a rise in people who are being promised work in Malta, often seasonal work or work in care,” she told Times of Malta. \nThe food bank has been working with the human trafficking department to provide victims with food until they go back to their home country or manage to get a work permit.\n“They hand over their passport, come to Malta, pay for their trip and then do not get a work permit when they are here… They end up in Malta with no way of managing to survive,” Rev. Hurst added. \nRev. Kim Hurst said that the numbers of those relying on the food bank are on the increase.\nThe food bank, which was set up four years ago, has helped over 6,000 people this year alone. The total value of food handed out in the first five months of this year reached €86,826, Rev. Hurst said.\nWhen it first opened in 2015, the food bank distributed 240 packs of food, which more than doubled to 832 packs in 2016. The numbers continued to increase to 2,125 in 2017. Until the end of August of 2018, 2,150 packs of food had been handed out. \nA low minimum wage and rising rent costs all led to more people who were not able to afford food every day, Rev. Hurst said.\nThey end up in Malta with no way of managing to survive\nMalta’s national minimum wage of €762 is below the European Union average of €922.\n“Each year the number of people coming to us has increased and in May the number went up again. We are now handing out between €4,000 to €5,000 worth of food a week,” Rev. Hurst said.\n“If, for the rest of this year, we remain constant, we will feed an excess of 16,500 people handing out food to the value of €225,000,” she said.\nRev. Hurst said the food bank had originally started out planning to be an emergency crisis centre, however, the numbers grew far beyond what she originally imagined.\nPresident Emeritus Marie Louise Coleiro Preca, who recently became part of the food bank foundation’s board, thanked Rev. Hurst for having a vision to help the poor.\n“The authorities can address the issue of rising rents, but there were more causes that needed to be dealt with,” she said.", "comment_count": 12, "id": 1678}, {"keywords": "Construction", "author": "Philip Leone Ganado", "article_body": "Property owners are facing uncertainty and thousands of euros in additional fees as all construction works remain effectively suspended after the hurried introduction of controversial new regulations on Tuesday. \nNumerous owners carrying out alterations on their properties told Times of Malta their architects had warned them of new costs as fresh reports need to be drawn up and approved for all works, insurance premiums revised and other new requirements which will take weeks to address. \nRELATED STORIESConfusion and clarity - differing views on new construction site rules\nMoreover, controversy over the new role of ‘site technical officer’, which architects say forces them to shoulder contractors’ responsibilities, means it is unclear when and how many works will be able to resume. \n“I did everything by the book, I got all the reports and insurance, and now my architect is telling me everything needs to be done over,” one woman carrying out internal alterations at her flat in Sliema said. \n“It’s all going to cost me at least €5,000 more. The contractor isn’t going to absorb the cost; the architect isn’t going to absorb the cost. It’s all going to fall on me. I was two weeks away from having my project completed; now nobody can even tell me when works can continue.”\nAnother woman, carrying out internal works at a farmhouse in Żebbuġ, said the new rules meant she had to fork out an additional bank guarantee of €12,000 before she could continue. \n“I’ve spent a year saving up and trying to do everything properly, so why should I be the one to suffer? I’ve come to a point where I’m considering selling,” she said.  \n“I’ve wasted a year on all the reports that now have to be done from scratch. I don’t even know if the builders are going to be available for the works when I’m able to start again.”\nThe new regulations came about after a spate of buildings collapses linked to adjacent construction works and were introduced after a brief five-day consultation period.\nThe Chamber of Architects and Civil Engineers has opposed the regulations, which it says will fuel confusion and do little to improve public safety, and on which it says it was not consulted as required by law. \nIn a statement yesterday, it said it had issued a directive “instructing all members of the profession to strictly abide by the regulations”.  “Until all the provisions are adhered to, all works are in effect suspended,” the Chamber said.  \nOne architect who spoke to Times of Malta on Thursday said it would take weeks of work for fresh method statements and condition reports to be drawn up, and a further two weeks for them to be approved.  \n“The only way to bypass this limit is for the architect to declare that the works will not cause damage to third parties. This is an impossible reassurance to give let alone certify. The few who did are insane,” he said.  Architects, he said, were now having to deal with anger and “threats” from their clients for “standing their ground” over the changes.\n“We are also concerned about losing our clients to unscrupulous architects who are trying to move in on halted sites,” he added.\nBuilding industry needs ‘soul searching’\nJacob Borg\nMalta’s building industry had a lot of soul searching to do in order to raise the bar of quality, ethical standards, health and safety and respect for the environment, Chamber of Commerce president David Xuereb said during a dialogue event with Prime Minister Joseph Muscat. \nMr Xuereb said the industry must restore its reputation with people, who most definitely demanded and deserved better. \n“These latest unfortunate accidents have mobilised a positive change in mindset that has motivated the beginning of an improvement programme that should have many stages yet to come,” Mr Xuereb said of a recent spate of building collapses linked to adjacent construction works. The Chamber, he said, commended the Prime Minister for stepping in to impose a temporary moratorium on demolition and excavation work, as well as new regulations on excavation and demolition. \nThe Chamber also noted that while the news rules were a step in the right direction, the matter was being tackled in a piecemeal fashion in relation to the wider operational and regulatory needs of the industry.\nHave you been directly affected by this sudden change in construction rules? Tell us your story on mynews@timesofmalta.com", "comment_count": 159, "id": 1679}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nTimes of Malta delves into the impact of the introduction of a new legal notice for the construction industry, which has left many projects at a standstill. It also says that the prime minister has not yet taken a clear stand on whether he will start a murder inquiry into the assassination of Daphne Caruana Galizia, as recommended by the Council of Europe earlier this week.\nThe Malta Independent has the same two topics on its front page, with the same angle taken on the prime minister. On the legal notice, the newspaper says that there are not enough architects to cope with the new role of site technical officers imposed on them.\nL-Orizzont also features the Council of Europe recommendation on an inquiry but quotes the prime minister pointing out that this could prejudice any court case. It also reports Infrastructure Minister Ian Borg saying that the legal notice is about safety first and foremost.\nThe Council of Europe vote was also featured on the front page of In-Nazzjon, which has Opposition Leader Adrian Delia saying it confirms that the culture of impunity is a threat to democracy, as well as pointing out that only Azerbaijan was the only country to defend Joseph Muscat's position.", "comment_count": 0, "id": 1680}, {"keywords": "Health, Accident, Transport", "author": "Claudia Calleja", "article_body": "Adrian Darmanin was 13 years old when a stranger, whom he refers to as his “guardian angel”, drove him to hospital after he suffered life-threatening leg injuries when he jumped off a slow-moving bus.\nTwenty-three years later Mr Darmanin, now 36, is searching for that man to thank him.\n“He saved my life. I had bad internal bleeding and could have lost my right leg. I’ve always wanted to be able to thank him.\n“The reason I’m trying harder now is that I became a dad. Thanks to him I can enjoy the greatest gift of life,” he says, his eyes glistening as they drift towards his one-year-old daughter, Zoe Jane, who is babbling in her pushchair.\n“I have vague memories of him. All I remember is that he was driving a white Ford Escort van and must have been in his late 30s,” he adds.\nThe accident happened on Sunday, June 23, 1996. Mr Darmanin had gone to watch a football match on television in Marsascala with his friends. The boys caught the last bus home to Żabbar at about 9.45pm.\nI don’t know who the guy is, but I call him my guardian angel\nWhen the bus approached Sanctuary Street, a main road, they rang the bell for the bus to stop.\n“The old buses didn’t have doors. The bus slowed down and pulled into the bus stop. Two metres before it stopped, I jumped out. I slipped and fell face down. People on the bus started screaming and the driver stopped the bus. The bus was on my leg.\n“My right leg was caught between the double wheel and the tarmac,” he recounts.\nMr Darmanin remained conscious. The driver ran off the bus and asked the passengers to disembark. He then reversed the bus off Mr Darmanin’s leg.\n“With the rush of adrenalin I stood up and started walking home. Then my friend started shouting: ‘where do you think you’re going?’ When I looked down at my leg I saw a big hole in my right thigh and fell to the ground. I saw that the jeans I was wearing were ripped off,” he recalls adding that on that day he was wearing a black Kurt Cobain  T-shirt.\nMeanwhile, a man who was sitting on the steps of his house called the ambulance. Soon after, another man driving a white van stopped.\n“He must have been driving behind the bus. He told me he was going to take me to hospital. He put the front passenger’s seat down and helped me in. All I remember is that he was talking to me, in Maltese, all the time to keep me awake. I don’t remember what he said,” he says.\nWhen Mr Darmanin arrived in hospital his parents were called.\nHis mother, Mary Grace, recalls talking to the man. All he told her was that he had driven her son to hospital. Then he left.\nMr Darmanin suffered internal bleeding and had to undergo five operations within a month to repair his crushed muscles. This was followed by a month of rehabilitation and three skin grafts.\n“Throughout the years I tried to find that man. I’ve looked at the police report but he is listed as an unidentified person,” he said.\n“I don’t know who the guy is, but I call him my guardian angel. He saved my life. I just want to say thank you.”", "comment_count": 18, "id": 1681}, {"keywords": "Politics, Aviation, Unions", "author": "Ivan Camilleri", "article_body": "Unions representing Air Malta employees are insisting on holding direct talks with the government and want written guarantees on their members’ future, Times of Malta is informed.\nThe reassurances are being sought after the announcement two weeks ago that the government has teamed up with Ryanair to create a new airline, Malta Air.\nEmployees from various sections of the company, ranging from administration to pilots, are exerting pressure on their unions to ‘force’ the government to give them assurances that Air Malta will not eventually fold.\nPrime Minister Joseph Muscat and Tourism Minster Konrad Mizzi have said Air Malta will not be impacted through this deal as the airline will be investing in a different direction from the low-cost airline.\nHowever, the verbal assurances did not go down well with those on Air Malta’s payroll.\nDespite the assurances, employees want to get guarantees in writing that their future is still safeguarded\n“Basically, employees are very concerned about their future following the announcement on Malta Air. Despite the assurances, employees want to get guarantees in writing that their future is still safeguarded in the eventuality that Air Malta flounders,” said a senior official of one of the airline’s main unions.\nAnother senior union official said: “The writing is on the wall. Air Malta is being wrongly managed and it’s a crisis every day. Although the government will never admit that Air Malta is on a downhill slide, the latest deal with Ryanair will surely mean another blow, and this time it may be fatal.”\nSo far, the government has not officially met the airline’s trade unions though Air Malta’s chairman, Charles Mangion, and managers have met union members to try to quell employees’ concerns.\nStill, the unions are not satisfied, especially after the chairman admitted during meetings that he was not involved in the Ryanair deal and he got to know about it just 24 hours before the government signed the agreement.\n“The government accepted that Ryanair starts using the name of Air Malta inversed – Malta Air – for its new airline, uses the same logo and livery and also sells our flights on its website,” a member of Air Malta’s management said.\n“All this will undoubtedly impact our business no matter what the powers that be may say,” he said.\nTimes of Malta is informed that a number of unions have already made official requests for talks with the government and industrial action is not being ruled out.\nMeanwhile, sources said that while Air Malta increased its schedule by some 30% this summer, it failed to increase personnel and is experiencing a shortfall of pilots and cabin crew to operate the new schedule.\nA delay in the arrival of two new planes, Airbus NEO, which were to join the fleet this month, is also forcing Air Malta to wet-lease two aircraft, adding to the already stretched operating costs of the airline.\nSo far, the government has kept the agreement signed with Ryanair under wraps, including details of whether it has agreed to give the low-cost airline more subsidies for additional routes, the facilities it is making available to the new airline and whether there are any guarantees that Ryanair will not compete directly with Air Malta on the same flight destinations.\nSince its entrance into the Maltese market, Ryanair has gone from strength to strength, becoming the island’s main carrier.", "comment_count": 74, "id": 1682}, {"keywords": "Banking, Finance", "author": "Keith Micallef", "article_body": "Stricter terms for home loans have been introduced across the board as a result of a recent Central Bank directive aimed to establish “minimum standards and create a level playing field” for banks.\nThough the measure targets both first-time buyers and those seeking to acquire a second property for real estate, tougher conditions apply for the latter.\nSources in the banking sector told Times of Malta that this move could be a sign that the regulators are worried about the increasing exposure to a particular sector, in this case the construction industry, as this could threaten financial stability in the case of an economic downturn. \nThey added that the introduction of stricter terms regulating the minimum deposit to be eligible to apply for a home and maximum monthly payment with respect to the applicant’s income could have two major effects. While housing may become less affordable for some buyers, in the longer term this may result in property prices going down, which in turn would negatively affect sellers.\nHowever, a Central Bank of Malta spokeswoman told Times of Malta that the objective was “a preventive one” and not prompted by “expectations of unfavourable economic developments or potential downturns in the real estate markets”.\nShe also pointed out that the directive, introduced last March, sought to consolidate banking practices to achieve minimum binding standards and a level playing field.\nYet, according to the Central Bank, the move was not triggered by concerns that voluntary practices in place before were not sufficiently prudent. \nStrengthen resilience of both borrowers and lenders\nThe directive differentiates between first-time buyers and those seeking to acquire their second property or to rent it out (residential real estate).\nIn the case of first-time buyers these also include borrowers who have already owned a primary residence which has either been sold or on which a promise-of-sale agreement has already been signed, and cases whereby there are pending proceedings before the Civil Court (Family Section) which hinder the sale of the primary residence.\nThe Central Bank said that the objective of this measure was to strengthen the resilience of both borrowers and lenders against potential build-up of vulnerabilities which could result in financial losses for both, in case of unfavourable economic developments or downturn in the real estate markets.\nThe Central Bank stands ready to act when market conditions require measures to address changing circumstances, the spokeswoman said.\nWhat are the new terms?\nFirst-time buyers\nBorrowers need to have at least 10% of the sum to be loaned to be eligible.\nThe value of the monthly instalment cannot exceed 40% of the applicant’s monthly income.\nThe loan has to be paid within 40 years or upon reaching retirement age, whichever comes first.\nBorrowers purchasing a property for the value of up to €175,000 are not subject to the restrictions of this directive. \n10% speed limit – this allows banks to have some leeway on the minimum deposit required whereby it may request a lower amount in 10 out of every 100 loans issued.\nResidential Real Estate\nBorrowers need to have at least 15% of the sum to be loaned and by the second year they must pay 25% of it.\nMonthly instalment cannot exceed 40% of applicant’s monthly income.\nLoan has to be repaid in 25 years or at retirement whichever comes first.\n20% speed limit – banks can request a lower deposit in 20 out of every 100 loans issued.", "comment_count": 45, "id": 1683}, {"keywords": "Court, Justice, Drugs", "author": "Edwina Brincat", "article_body": "A man who was acquitted after a 17-year court trauma awaiting criminal proceedings over an alleged drug-trafficking conspiracy was awarded €10,000 in damages payable by the Attorney General.\nAntonio Gatt, 70, was subjected to years of anxiety after his trial by jury was adjourned indefinitely upon a request by the prosecution insisting this was necessary pending the termination of criminal proceedings against a third party who was to testify at the trial.\nMr Gatt had been arrested in April 2001 in a controlled delivery operation which led to the seizure of a parcel containing just over two kilograms of cocaine, mailed from Canada.\nThe man was charged with drug trafficking conspiracy and was granted bail two months later, under strict conditions of house arrest save for two hours a day when he could venture outdoors.\nAlthough placed under a bill of indictment in 2002, two years later the Attorney General had requested the indefinite adjournment of the trial by jury until proceedings against a third party witness reached an end.\nEleven years down the line, the Criminal Court upheld an application by the accused for him to be tried before the Magistrates’ Court whereby, in July 2018, he was finally acquitted.\nHowever, the 17-year-long wait had spelt great anxiety and suffering for the man and his family who watched their relative live uncertainly with a possible jail term hanging above his head like the sword of Damocles.\nSuch delay prompted the man to institute proceedings for damages, claiming that 17 years had not been a reasonable time and that consequently his right to a fair hearing had been breached.\nThe First Hall, Civil Court in its constitutional jurisdiction, observed that although bail conditions had been relaxed, up to 2016 Mr Gatt was still bound by a curfew and a weekly signing of the bail book.\nMoreover, for some years he had been suspended on half pay and all his money and assets had been frozen.\nOn the basis of all evidence put forward, the court, presided over by Mr Justice Robert Mangion, observed that there was none of the “enormous complexity” alleged by the prosecution and no expected evidence from Canada, from where the parcel had allegedly originated.\nThe delay had been caused by the prosecutor who had insisted upon the adjournment of the trial until the third party could testify when, indeed, this witness had already testified against the other co-accused in spite of being cautioned about possible self-incrimination.\nMoreover, the prosecutor had failed to inform the Court when proceedings against the witness had been concluded and had requested authorisation to put forward other witnesses five months after concluding the evidence stage before the Magistrates’ Court.\nAll this delay, particularly when criminal proceedings were involved, caused great anxiety for the accused whose right to a fair hearing within a reasonable time had been breached.\nFor this reason, the man was awarded €10,000 in non-pecuniary damages payable by the AG.\nLawyers Joseph Giglio and Sarah Mifsud assisted the applicant.", "comment_count": 0, "id": 1684}, {"keywords": "Court, Prison, Drugs", "author": "Edwina Brincat", "article_body": "A woman was cleared of trafficking drugs into the Corradino Correctional Facility almost nine years ago when her brother was an inmate.\nSandra Spagnol, 47, had accompanied her mother and sister on a visit to her brother Patrick, an inmate at Division 4, in October 2010.\nShortly after the three women had taken their leave, a rub down search of the prisoner had yielded a cigarette packet containing a brownish substance wrapped in foil, suspected to be cannabis resin.\nThe inmate was questioned, releasing a statement which led to the arrest of his sister who was also interrogated and subsequently charged with drug trafficking, possession of cannabis resin and smuggling the drug into prison.\nA court-appointed scientific expert reported that the substance amounted to 1.45 grams of cannabis resin with a 10% purity, stuffed in the same packet containing tobacco, filters and cigarette papers.\nIn the course of criminal proceedings against the woman, the court, presided over by magistrate Natasha Galea Sciberras, observed that the accused’s statement was not admissible in evidence since it had been released without due legal assistance.\nThe accused’s brother, who had testified before the inquiring magistrate, had first chosen not to testify in the proceedings against his sister and two months later had again chosen not to testify to avoid self-incrimination, in view of criminal proceedings still pending against him.\nThis meant that the accused’s brother could not face cross-examination, the court said, adding that once the statements of both siblings were declared inadmissible, nothing was left to link the accused to the cannabis resin found in her brother’s pocket.\nThe police officers testifying in the case had not personally witnessed the prison visit, which meant that their testimony was hearsay, based on what they had been told by prison officials.\nMoreover, the correctional officers who testified about the search, could not tell who the visitors had been.\nThis scarcity of evidence meant that the prosecution had failed to prove its case beyond reasonable doubt, the court concluded, thereby clearing the woman of all charges and urging all public officers to do their utmost to preserve all evidence in fulfilment of their strict duty and responsibility towards society.\nScanty and somewhat incorrect testimony by prison officials undermined public trust in such institutions thereby causing an undesirable effect.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 1685}, {"keywords": "Politics, Construction", "author": "Jacob Borg", "article_body": "Malta's building industry had a lot of soul-searching to do to raise the bar of quality, ethical standards, health and safety and respect for the environment, Chamber of Commerce president David Xuereb said during a dialogue event on Thursday with Prime Minister Joseph Muscat.\nMr Xuereb said the industry must restore its reputation with people, who most definitely demanded and deserved better.\n“These latest unfortunate accidents have mobilised a positive change in mindset that has motivated the beginning of an improvement programme that should have many stages yet to come,” Mr Xuereb said of a recent spate of building collapses linked to adjacent construction works.\nHe vowed the Chamber would support all actions and legislation aimed at improving quality, delivery and respect for the industry players, the neighbours and the public at large.\nThe Chamber commended the Prime Minister for stepping in to impose a temporary moratorium on demolition and excavation work, as well as new regulations on excavation and demolition.\nMr Xuereb said the Chamber had noted that while the new rules were a step in the right direction, the matter was being tackled in a piecemeal fashion in relation to the wider extended operational and regulatory needs of the industry.\nHe said the Chamber was happy to champion the regeneration and growth of the building industry in the area of safety, quality, excellence and respect for others.\nMr Xuereb reminded how the Chamber had already championed the promotion of a considerate contractor scheme with the authorities.\nHe said the scheme was intended to bring about an improvement in standards within the construction industry.", "comment_count": 5, "id": 1686}, {"keywords": "Construction, Accident, Guardamangia", "author": "", "article_body": "Valuables have gone missing from the apartment of a woman who lost her home following excavation works. \nAnthea Brincat told Times of Malta money and jewellery had gone missing from the Guardamangia home, which was substantially damaged on June 13, sparking nationwide anger. She did not specify the value.\nActivists' group Moviment Graffitti revealed the woman's anger and frustration after police allegedly told her they do not have the authority to search the workers in the adjacent construction site where works are continuing.\nThe government-appointed architect refused to stop works until police could search the workers, telling the woman she \"should not waste his time\", the NGO alleged in a Facebook post.\nThe residents – some of whom have been homeless for two months – have been ignored by virtually everyone.\nThe apartment wall was substantially damaged because of excavation works being carried out next door. The previous week a three-story apartment block collapsed in Mellieħa, just days after another apartment block, adjacent to a building site, collapsed in Guardamangia.\nGraffitti said the woman informed them she had filed a report but police “angrily told her she was expecting too much”.\n“Workers on the nearby construction site (works are ongoing, despite the risk of ulterior collapses) were not searched or interrogated about the matter because the police weren't given the authority to do so. Returning to the site and asking for works to be halted until the police arrived, the architect appointed by the courts phoned her up and told her that he was the only one who could give orders and told her “not to waste his time.” The residents’ architect was forbidden from carrying out onsite inspections; he will be allowed onsite tomorrow, after the contractor built a wall and poured concrete over the underlying rocks to hide the cracks,” Graffitti wrote.\nGraffitti expressed disgust at the state of affairs.\n\"It seems there’s no limit, not even the slightest hint of shame, when it comes to the construction industry. The authorities have let the storm subside before issuing a rushed, nonsensical reform and went on as if nothing had happened. The residents – some of whom have been homeless for two months – have been ignored by virtually everyone.\"", "comment_count": 70, "id": 1687}, {"keywords": "Crime, Police, Politics", "author": "Jacob Borg", "article_body": "Finance Minister Edward Scicluna on Thursday announced the setting up of a new agency geared towards combatting financial crime.\nAddressing a conference about Malta’s efforts to fight money-laundering and terrorism financing, Prof. Scicluna said the government was committed to creating an agency that was genuinely feared by financial criminals.\nHe said Malta’s success as a financial centre naturally opened it up to various risks, just as was the case in other financial centres like New York, London and Paris.\n\nProf. Scicluna said countries should be judged by their efforts to stamp out financial crime.\nHe said convictions for such crimes were the key metric to show systems to combat money laundering and terrorism financing were working.\nThe Finance Minister assured the government was committed to a number of reforms concerning investigations and prosecutions of money-laundering and terrorism financing.\nProf. Scicluna said the new agency would not end up competing with the police, who are also tasked with investigating financial crime.\nSuitable model for Malta being decided upon\nDetails about the new agency were still being ironed out, as a suitable model for Malta had to be decided upon, he said.\nThe Finance Minister said investigating organised financial crime required different tools and expertise when compared to low-level fraud cases.\nThis required a specialised agency to tackle high-level money-laundering cases, with people equipped with the necessary expertise to see through prosecutions, the Finance Minister said.\nHe said intelligence between all the agencies tasked with fighting these crimes would be shared.\nAnother of the reforms announced by Prof. Scicluna was an increased emphasis on the money-laundering element in tax evasion cases.\nHe said the system of just focusing on recovering lost tax revenues through administrative fines would be refined, to place more emphasis on the criminal element.\nWhy are financial crime prosecutions so low?\nQuestioned by Times of Malta why cases were not being successfully prosecuted by the police, Prof. Scicluna acknowledged this was the question on everyone’s lips.\n“This is our question. How is it that the amount of convictions do not correlate with Malta’s economic profile. This is why you need to test and find out why,” the Finance Minister said.\n\nSeveral high-level profile cases involving politicians have placed the spotlight on the police’s reluctance or inability to prosecute financial crimes.\nThe Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi were both found to have opened up secret companies in Panama, through which they planned to receive up to $2 million in deposits.\nMultiple FIAU reports about the two men’s activities landed on the police’s desk, though no apparent action was ever taken against them.\nMr Schembri has been the subject of two separate money-laundering inquiries that have been ongoing for over two years.\nThe inquiries were sparked after the FIAU reports sent to the police were leaked.", "comment_count": 64, "id": 1688}, {"keywords": "European Union, Finance, Economy", "author": "", "article_body": "If EU funds come with strings attached, then it could increase the administrative burden associated with their management and stifle economic growth, Parliamentary Secretary for European Funds Aaron Farrugia said.\nHe was speaking during the General Affairs Council (GAC) on Cohesion Policy held in Luxembourg, where he criticised a recommendation that new conditionalities should be imposed on the implementation of EU funds.\n“The aim behind enabling conditions is to ensure that the right framework is in place at the national level, to enable the effective implementation of funds — and certainly not to increase obligations that may actually not be linked to the objectives of the funds, or that may result in increasing the administrative burden in the implementation of the funds,” he said.\nThe objective of the GAC meeting was to take stock of the package for 2021-2027 and to debate the future challenges.\nMalta is in favour of the speedy adoption of new funding regulations to avoid delays whose ripple effect could ultimately affect citizens.\nConcerning the challenges envisaged for the 2021-2027 programming exercise in light of the 2019 country specific recommendations, the parliamentary secretary said the main challenge to ensure that what the Commission was recommending would actually match the needs on the ground.\n“As for the challenges that may occur during the mid-term review exercise in 2025, we consider it is important that there will not be disruptions in the programming of the funds and we should avoid making the system so complex that it will lead to an excessive administrative burden,” the parliamentary secretary said.\nWith regards to how to reconcile economic governance and the convergence objective Dr Farrugia acknowledged that the link was necessary, but also that a one-size-fits-all approach would not work, with tailored solutions required to ensure effective convergence on the ground.", "comment_count": 51, "id": 1689}, {"keywords": "Sliema, Drugs, Crime, Court", "author": "Edwina Brincat", "article_body": "A mother-of-two facing a three-year jail sentence for drug trafficking pleaded with the court for mercy, saying her daughter had her Holy Communion on Friday.\nSabrina Grech, who has two children aged six and 10, sobbed: “I have only been using drugs for 2 years.\"\nShe was one of the four people arrested after a raid by the Drugs Squad at a property in Amery Street, Sliema on Tuesday.\nGlenn Busuttil, 42, from Attard and 29-year-old Grech from Sliema were arraigned separately before magistrate Rachel Montebello on Thursday by police inspectors Mark Mercieca and Justine Grech.\nUnemployed Busuttil was charged with trafficking cocaine, heroin and cannabis, while Grech was charged with trafficking those drugs as well as aggravated possession. She was also charged with possession of false currency and breaching bail.\nInspector Mercieca informed the court that Busuttil was trafficking small amounts of drugs in order to sustain a drug habit.\nBusuttil pleaded guilty, confirming his admission after being given time to reconsider. The magistrate sentenced the man to three years in prison plus a fine of €2,500. He was also placed under a treatment order for four years and will be given help to overcome his drug addiction, explained the court.\nBail was not requested for Ms Grech at this stage.\nLawyer Joseph Bonnici appeared as legal aid for both of the accused.", "comment_count": 0, "id": 1690}, {"keywords": "Accident, Police, Health, Maritime", "author": "", "article_body": "Updated 5.30pm, adds Palumbo statement\nTwo men were grievously injured on Thursday, in an accident at Palumbo Shipyards.\nThe police said a 48-Romanian man was driving a forklift truck on the quayside at around 9am when he lost control of the vehicle and ended up in the sea, dragging his colleague with him. They were pulled out by other workers.\nAn ambulance was called and they were transferred to Mater Dei Hospital.\nThe police are investigating.\nIn a statement later, Palumbo said it was monitoring the condition of two sub-contracted workers.\nA spokesman said the shipyard abided by the highest international safety standards and the welfare of its employees was always its top priority.", "comment_count": 0, "id": 1691}, {"keywords": "Crime, Court", "author": "Edwina Brincat", "article_body": "A seven-year-old confided to her school counsellor that a relative had sexually abused her, uncovering events that led to the arraignment on Thursday of a 52-year-old restaurant worker from Valletta.\nThe counsellor lodged a police report about the abuse, more or less at the same time that her parents did.\nPolice inspector Joseph Busuttil charged the man with the violent indecent assault of his cousin’s daughter, participation in sexual activities with a minor, corrupting the seven-year-old girl and possession of child pornography. He was also accused of recidivism.\nThe charges are aggravated by the fact that there are family ties between the alleged abuser and his victim, who lives in the same block of flats.\nThe court, presided over by magistrate Rachel Montebello, explained that the charges carried a potential punishment of up to 20 years in prison.\nThe man admitted the abuse during interrogation, Mr Busuttil said, although his defence lawyer Malcolm Mifsud entered a plea of not guilty.\nBail was not requested. The child is expected to testify via videoconferencing in a future sitting.\nThe court imposed a ban on the publication of the accused’s name and that of the minor.", "comment_count": 0, "id": 1692}, {"keywords": "Education", "author": "Claire Caruana", "article_body": "The benchmark exams that every student has to sit for at the end of primary school are being phased out, the government announced on Thursday afternoon. \nInstead, by 2021, the education system will shift towards what will be called 'informal college exams' or 'informal national exams'. \nThe announcement was made by Education Minister Evarist Bartolo after he was handed a report with 25 recommendations following the review of the benchmark examinations process, first introduced in 2011. \nThe 25 recommendations were drawn up by the Benchmark Review Board, set up in 2017 to review the national end-of-primary assessment, more commonly referred to as the benchmark exam. \nOutlining a series of measures that need to be taken in order to bring about the change, the recommendations include calls for the \"phasing out\" of the benchmark \"in its present format\", the introduction of more informal assessment, the shift of weighting of assessment, increased use of digital technology and the introduction of different levels of assessment for students with different abilities. \nAsked by Times of Malta, to explain what this would mean for students, Mr Bartolo said that essentially, not much would change because students were already being subject to different ways of assessment and there were various ways to carry out such assessment. He did not give any examples on what this would entail. \nOn whether teachers had been consulted on the changes that were being proposed, board chairperson Mark Borg said the recommendations stemmed from feedback from all stakeholders and while, as expected, feedback varied, most were in agreement with what was being proposed.   ", "comment_count": 14, "id": 1693}, {"keywords": "Migration, Conflict", "author": "", "article_body": "Updated 4.20pm, adds migrants' arrival\nA group of 64 migrants arrived in Malta on Thursday afternoon after being picked up from a boat in the island's rescue region.\nThe small boat was intercepted by a patrol boat late on Wednesday. The migrants are all men and in relatively good health, an Armed Forces of Malta spokesman said.   \nMalta has seen a surge of migrant arrivals in the past few weeks, the most recent arrivals being last Sunday when a group of 37 was brought in.\nNearly 400 migrants were brought to Malta on June 5 after four simultaneous rescues. A group of 75 migrants were found stranded on a tuna pen on May 29.\nA total of 216 were brought in on May 25 after being rescued in two operations after 85 were brought in two weeks earlier.\nThe number of migrants arriving in Malta by boat skyrocketed last year following unrest in Libya, with the number reaching 1,455 last year compared to 23 in 2017.\nAlmost a quarter of the arrivals were children (23 per cent), with 65 per cent of those arrivals being unaccompanied minors, data provided by immigration police showed.\nThe surge comes after Italy's right-wing deputy prime minister Matteo Salvini closed Italian waters to NGO rescue vessels, leaving several boats stranded at sea for weeks.\nAccording to data from the UN International Organisation for Migration about 3,200 people have reached Italy and Malta from north Africa since the beginning of 2019. Almost 350 have died en route. The death rate for those crossing along the central Mediterranean route stands at about 11%.\n ", "comment_count": 0, "id": 1694}, {"keywords": "Joseph Muscat, Politics", "author": "Jacob Borg", "article_body": "Updated 3pm with video clip\nPrime Minister Joseph Muscat on Thursday confirmed that Neville Gafà is contracted by the government, but said he did not know which ministry he works for.\nMr Gafà showed up for a meeting in Libya last week, where he was pictured holding talks with the Libyan government.\nVideo: Chris Sant Fournier\nWhen asked, both Mr Gafà and the Prime Minister’s office failed to explain to Times of Malta what he was up to in Libya.\n“I have no time to waste in explaining anything”, Mr Gafa had said.\nQuestioned about Mr Gafà's trip on Thursday, Dr Muscat said he was part of a team of people who went to Libya. Mr Gafà had used his contacts in the country to represent the government.\nRELATED STORIESNeville Gafà fired by Health Minister Chris FearneMystery official ‘bumped into’ Libyan militia leader during controversial visit\nAsked which specific ministry employs Mr Gafà, Dr Muscat retorted that he is “employed by the government”.\n“I do not know what his contract says and I don't have it on me at the moment,” the Prime Minister said.\nLast year, the government was forced to deny Mr Gafà was acting as a special envoy to the Prime Minister during a December trip to Libya, during which he met a militia member.\nA Labour Party activist, Mr Gafà  has been hitting the headlines since Labour was returned to power, and was soon put on the government’s payroll as a person of trust.\nHis name had cropped up in investigations connected to the issue of medical visas to Libyan refugees though he never faced criminal charges.", "comment_count": 38, "id": 1695}, {"keywords": "Daphne Caruana Galizia, Joseph Muscat", "author": "Jacob Borg", "article_body": "Prime Minister Joseph Muscat on Thursday did not rule out the appointment of a public inquiry into whether journalist Daphne Caruana Galizia’s murder could have been prevented.\nHe was reacting to a resolution by the Council of Europe calling for such an inquiry within three months.\nThe Caruana Galizia family also reacted to the resolution, (see below) saying it was a step closer to the truth that Daphne would still be alive today if corruption in Malta were properly investigated. It also insisted that Dr Muscat \"has nothing to fear but the truth.\" \nDr Muscat said he would be seeking fresh advice on the matter. He pointed out that the Attorney General had already clearly advised against such an inquiry due to ongoing court proceedings against the three people accused of carrying out the bomb plot.\n\n“I will not be the one responsible for a public inquiry destroying the case against the three accused,” he said.\nDr Muscat expressed his reservation about the Dutch rapporteur who steered through the Council of Europe report.\nHe said an Opposition member played an active role in drafting the report.\nThe Prime Minister said he would be engaging with the Council of Europe about the report.\nDespite strong lobbying efforts by the government against the report over the past few months, an online register of the votes show government representatives Manuel Mallia and Rosianne Cutajar did not actually vote against its final adoption.\nAsked why they did not vote against the final resolution, Dr Muscat simply replied: “I think this is a case in point.”\nMany of the amendments to the report pushed by the government, which were largely shot down, found support from Azerbaijan. Azeri MPs also voted against the adoption of the final report.\nCaruana Galizia family reaction\nThe Caruana Galizia family in a reaction to the Council of Europe resolution said this was a step closer to the truth: \"that Daphne would still be alive today if corruption in Malta were properly investigated and prosecuted by the authorities, if Malta’s institutions functioned as they should, and if Malta were a properly functioning democracy.\n\"We have done everything we could as a family for this basic truth to emerge.\n\"We now ask for the support of the international community to actively monitor Malta’s implementation of the resolution's most important recommendation: that the Maltese Prime Minister set in motion an independent and impartial judicial public inquiry into the circumstances of Daphne's assassination. He has nothing to fear but the truth,\" the family said.", "comment_count": 162, "id": 1696}, {"keywords": "Court, Maritime, Gżira", "author": "Edwina Brincat", "article_body": "A group of boat owners, facing the prospect of losing their berths at the Gżira marina, have cried foul over the tendering process for the yacht marina privatisation.\nFifteen yachtsmen from Berth Holders Ltd, a company forming part of the Island Group JV Consortium, filed a judicial protest expressing concern over the “independence and impartiality” of the members on the selection board, after failing to win the tender for the concession which would cover rehabilitation, operation, and management of the marina.\nThe tender was announced by Transport Malta in November 2017, almost a decade after it first announced its intention to privatise it.\nThe 25-year concession will cover 25,000 square metres, including a capitanerie in the garden and the stern-to berthing along the quay.\nThe concession envisages a two-year period during which the operator would upgrade the area and install pontoons, after which fees can be raised according to a schedule set at the operator’s discretion.\nAt the time, Transport Malta had said that the winning bidder would have to accommodate the 54 boats berthed there.\nThe unsuccessful bidders had first submitted two requests for information (RFI) under the Freedom of Information Act, explain their suspicion of irregularities in the tender-awarding process. They wanted to obtain, from Transport Malta and the Contracts Department, a copy of the concession contract, if this had already been signed, and if not, an explanation for why this had been delayed.\nThe boat owners had also requested information regarding the technical specifications of the winning tender.\nRELATED STORIESWanted: operator for Gżira marinaBerth holders unite in bid to run Ta' Xbiex marina\nOnce the 20-day legal limit for a reply to RFIs lapsed, over a fortnight ago, the boat owners felt they were left with little option but to take their grievance before the courts, thus filing a judicial protest before the First Hall, Civil Court.\nThe protesting parties pointed out that not only had Transport Malta increased their berthing fees, but, meanwhile had also issued a letter informing them that they would lose their berths.\nMoreover, the transport authority had notified them in writing that their information would be relayed to the successful bidder who would contact them. However, this move was objected to by the berth holders on the basis of data protection laws.\nThe protesting parties also argued that Transport Malta had no right to force their eviction since their berthing rights at the Ta’ Xbiex Yacht Marina were the subject of pending proceedings. The berth holders are claiming that there is a valid contractual relationship with the authority.\nFinally, the non-disclosure of all information regarding the appointment, dismissal, possible conflicts of interest and remuneration of members on the selection board, “seriously impinged upon the independence and impartiality” of the board and consequently failed to guarantee a fair hearing, the protesting parties concluded.\nLawyers David Camilleri, Joseph Gatt and Lorna Mifsud Cachia signed the judicial protest.", "comment_count": 0, "id": 1697}, {"keywords": "Sliema, Environment", "author": "Philip Leone Ganado", "article_body": "The Planning Authority board has approved the redesigned 28-storey Townsquare high-rise in Sliema after earlier approved plans were thrown out by an appeals tribunal.\nThe new permit was approved by a majority of seven voted to three. The objectors were chairman Vince Cassar, Environment Resources Authority chairman Victor Asciak and NGO representative Annick Bonnello. Matthew Pace, whose place on the board has been mired by controversy after it transpired that he had a conflict of interest in the db project, was not present.\nThe hearing went smoothly, in stark contrast to the original hearing three years ago.The height of the planned tower has been reduced by 11 storeys, or around 37 metres, after the Environment and Planning Review Tribunal last year revoked the original permit issued by the PA in 2016. That decision followed appeals by the Environment and Resources Authority (ERA), Sliema local council, Din L-Art Ħelwa, Flimkien Għal Ambjent Aħjar (FAA) and other eNGOs.Most of these objections were dropped for the revised proposal and the application had been recommended for approval ahead of Thursday's public hearing by the PA board. The revised plans feature the same number of apartments, 159, as the original proposal, but a reduction in the amount of floor-space for offices, retail and food and drink outlets.\n'Largest pedestrian zone in Sliema centre'\nThe development will be built on the former Union Club site near the scheduled Villa Drago, which will be restored.\nIt will include an unchanged 7,500 square metres of public open space, which the developers say will become the largest pedestrian zone in the town centre and has been redesigned to include more greenery and a landscaped rear garden. Developers also say the changes to the tower’s design - including the height reduction - will “dramatically reduce” its visual impact, a major point of objection in the first application process.\nVisual, community impacts remain concerns\nNevertheless, ERA (which is not objecting to the project as a whole) expressed reservations over this impact, especially when seen from the Sliema and Gzira waterfronts, Valletta and Bighi, and said that given the scale being proposed, the effect was difficult to mitigate.\n\nSociological studies carried out as part of an Environment Impact Assessment on the new proposal also found that public perception to the project remains “generally negative” despite the changes, and that fears over its effect on the community had actually intensified among Tigné residents.At the same time, the studies found that reactions to the project were more positive among young people and recently-arrived foreign residents. Traffic, meanwhile, is expected to increase by around 21 per cent over current levels, with an average of 2,569 additional car trips along Qui-si-Sana on weekdays, down from 3,500 with the earlier plans. Approval has been recommended against a €266,314 planning gain and €50,000 artistic fund contribution. \nThe developers, Townsquare Sliema, welcomed Thursday's  decision by the Planning Authority Board.\nTownsquare CEO Peter Diacono said: “We have gone to great lengths over the past year to address, and go beyond, the revisions requested by the Environment and Planning Review Tribunal and are delighted that the Planning Authority has acknowledged these efforts.\nTownsquare will be a project of the highest quality, and our team are excited to begin this next chapter to create a new dynamic space that Sliema can be proud of- Developers\n“We have brought together the very best local and international talent and will now start working to make our vision a reality. Townsquare will be a project of the highest quality, and our team are excited to begin this next chapter to create a new dynamic space that Sliema can be proud of.” \n“As we now focus on delivering the project, we also look forward to playing an active role in the local community and making a positive contribution to Sliema,” Mr Diacono said.\nThe saga so far\nThe original project had been approved by just a single vote margin when it came before the PA board in 2016, with ERA chairman Victor Axiak (who had raised serious criticisms over the plans) absent due to illness. Objections at the time had highlighted the excessive visual impact, traffic and congestion problems in Qui-Si-Sana and the negative impact on nearby residents’ quality of life.The appeal decision, which annulled the permit and sent the developers back to the drawing board, had primarily cited the inadequacy of impact studies carried out for the project, all of which have since been conducted anew.", "comment_count": 15, "id": 1698}, {"keywords": "Employment, Economy", "author": "", "article_body": "The employment gap between men and women is narrowing dramatically with the 25-34 year category showing that in terms of percentages, there are actually more women working than men.\nThere were 39,574 men of that age working in the first quarter of 2019, representing 27.7 per cent of the working population, and 31,190 women representing 31.6 per cent.\nThis is in stark contrast to the situation among older cohorts, where the amount of women working is less than half that of men. There were 8,853 people unemployed at the end of March 2019\nThe National Statistics Office reported on Thursday that employment stood at 241,468 – more than half the population aged 15 or over.\nMeanwhile, tax incentives to keep people in the work force after the age of 65 are having an impact, with 3,811 in the first quarter of 2018 going up to 5,041 this year.\nThe report said that there were 8,853 people unemployed at the end of March 2019, presenting an unemployment rate of 3.5 per cent (2018: 3.9%).\n\nThe NSO also revealed that of the 165,235 people who do not form part of the workforce, 50.4 per cent were aged 65 or over. There is also a gender gap, with the number of inactive women rising dramatically from the 45-54 group (9,836) to 55-64 (19,689). Out of the 25-34 age group, only 7,620 are not active in the workforce, 14,301 of whom are women.\nOf those who are not working, 17.5 per cent cited personal or family responsibilities, 15.8 per cent education or training, and 40.3 per cent retirement.\n\nOther facts:• 14% have a part-time job• The average number of hours worked is 41.9 for a full time job• The average salary was €19,390, up from €18,802 a year earlier• Financial and insurance activities pay best, at €25,783 down from €26,609 in 2018• The largest cohort – 61,574 – work in public administration, defence, education, health and social services and get an average of €20,016• The average wage for men (€20,839) is 18% higher than that for women (€17,540)", "comment_count": 1, "id": 1699}, {"keywords": "Youth", "author": "", "article_body": "While most 11-year-old boys relish spending their school break playing football, Denilson Long spends his with his friend playing billiards.\nHis friend has a medical condition in his eyes that makes it impossible for him to participate in any activity that could result in him bumping his head, so the young Denilson spends most of his time at school making sure he is safe and happy.\n\nThis also includes helping his friend with school work and other day-to-day struggles he might face. \nThis effort has earned Denilson this year's Pope John XXIII Award for Kindness, awarded to those children who through their actions are deemed kind and who promote inclusion, justice and peace. \nPresident George Vella, who presented Denilson with a gold medal, said ahead of the presentation that sometimes adults wrongly believe children and young people have no values, but they do. \nIn order to promote these good values, Dr Vella said, one did not necessarily have to be involved in \"some big project\" but even little acts of kindness go a long way. ", "comment_count": 2, "id": 1700}, {"keywords": "Politics, PN, Adrian Delia", "author": "", "article_body": "Updated 3.10pm with PN statement\nA total 84 of the 200 signatures in a petition to force a vote of confidence in Adrian Delia were invalid, the Nationalist Party insisted on Tuesday, adding that these included three of the five people who presented the petition.\nThe PN statement followed a statement by Emma Portelli Bonnici, Mark Anthony Sammut, Emvin Bartolo and Martin Musumeci, and Ivan Bartolo, in which they disputed claims by council president Kristy Debono that some of those who had signed the petition were not eligible to do so.\nThey insisted that there were no invalid signatures among the 200 who signed the petition, spearheaded by Mr Bartolo.\nHowever, they welcomed the go-ahead to hold an extraordinary meeting of the Nationalist Party general council to discuss responsibilities following the heavy electoral defeats.\nThe electoral results put the very future of the PN in jeopardy, but thanks to the petition, things were moving and the needed changes could take place, they said.\nRELATED STORIESAdrian Delia to face vote of no confidence as petition hits targetPetition to force PN vote on Delia moves to the next stage \nThey also disputed the claim that 23 members of the council who signed the petition did not have the right to vote. None of them had ever been told anything about this, he said, and they would be enquiring with their section committees as to how and when they became no longer eligible. \n\"Once the meeting of the general council will go ahead anyway, there is no need at this stage to raise the issue as to who compiles the list of council members.\" \nAs for members of the council who, it was claimed, were not up to date in their membership dues, such people had up to the end of the year to pay their membership and there was, therefore, no reason why somebody within the party could arbitrarily decide that they could no longer be members of the council. \nWe are disappointed only that a legitimate request made in terms of the party statute ended up being used by senior party officials to try to discredit party members who have given years of service to the party.- Ivan Bartolo\nFurthermore, many of these people had already produced receipts to prove that their membership payments were actually up to date.  \n\"This further confirms how the PN's lists and data are in a disorganised state which gives rise to abuse, with nothing having been done to address the situation in the past weeks despite complaints,\" the statement  said. \n\"We are disappointed only that a legitimate request made in terms of the party statute ended up being used by senior party officials to try to discredit party members who have given years of service to the party.\"\nMr Bartolo and the other co-signatories said he expected the party executive to meet with urgency to establish the date for the extraordinary council meeting so that a serious discussion could be held and a vote taken as requested in the petition. \nPN statement\nIn a statement in the afternoon, the PN insisted that 84 of the 200 signatures were invalid.\nThe statute clearly stated that a meeting of the council could be called through a  written request from not less than 150 members.\nThe party said that 55 of the signatories last paid their membership in 2017 or 2018. These included three of the five members presenting the petition and insisting that all signatures were valid.\nThe statute, the PN said, was clear that when one did not remain a member, he automatically his position within the party.\nThe party also said that another 23 people did not have the right to sign the petition because they were not members of the council. Five signatures were not valid because the people who signed had refused to pay their membership fee and there was a case where the name and surname of a person did not match the ID number given.\nFollowing the necessary verifications, the party said, the council president passed the petition to the executive committee of the party as required by the statute.\nWhile the PN continued to uphold the values of democracy, rule of law, justice and freedom of expression, it looked forward to a debate based on true facts, the party said.\n ", "comment_count": 89, "id": 1701}, {"keywords": "Education, University, European Union", "author": "", "article_body": "The University of Malta has been included in the first 'European Universities' alliance, just announced today by the European Commission.\nUM submitted an application as part of a six-member consortium, led by the University of Cádiz, Spain, and comprising the University of Kiel, Germany; Western Brittany, France; Split, Croatia; and Gdansk, Poland. All six are coastal universities, deeply involved with the sea: indeed, the consortium’s focus is on marine and maritime matters.\nThe six institutions came together to form the European University of the Seas. This project, which was competing with 54 other proposals involving some 300 higher education institutions, was given the green light by the European Commission following an evaluation carried out by a team of independent external experts including rectors, professors and researchers specifically appointed for this task.\nThis is the first project of its kind that will form alliances among European universities. The University of Malta will benefit from increased mobility of students and staff as the initiative will enhance the quality, inclusiveness and competitiveness of European higher education.\nUniversity of Malta Rector, Prof. Alfred J. Vella, welcomed the news that UM has been successful with its proposal at its first attempt and has thus been selected to form part of this prestigious platform of 'European Universities'.\n\"The announcement comes at the time when the University of Malta is celebrating the 250th anniversary since its foundation as a public university. Furthermore, it also demonstrates that the University of Malta can pitch in with its own expertise and research acumen to match top educational institutions across the EU,\" the university said. \nThe alliance which has been named Sea-EU, The European University of the Seas, will receive up to €5 million over the next three years. The Commission has voted €85 million for these 17 pilot projects. ", "comment_count": 1, "id": 1702}, {"keywords": "Politics, Gaming", "author": "Ivan Camilleri", "article_body": "The Malta Gaming Authority (MGA) has appointed Adrian Hillman to manage its reputation despite the fact that he is currently the subject of a magisterial inquiry on claims of money laundering.\nSources close to the MGA confirmed to Times of Malta that Mr Hillman has been doing this job at the government agency for the past two years as a result of a direct order given to him on the instructions of the Office of the Prime Minister.\nThis was confirmed earlier this week through the Malta Government Gazette, in which details about Mr Hillman’s direct order were revealed.\nAccording to the government publication, Mr Hillman, the former managing director of Allied Newspapers, is being paid €48,000 a year from public coffers to give the MGA consultancy for “strategic communication services, reputation management and public relations”.\nMGA sources said that Mr Hillman is rarely seen at the authority and has no office at the organisation. They also said that Mr Hillman has been living in the US for long periods of time.\nIf he works, he does this remotely\n“If he works, he does this remotely,” a senior official said.\nAsked to state how the MGA expects to manage its reputation through the services of a person who is facing money laundering accusations, a spokesman for the MGA did not reply. Instead, the spokesman confirmed that Mr Hillman is spending much of his time abroad.\n“Mr Hillman had duly notified the MGA with his temporary travelling plans, which in no way had interfered with his ability to fulfill his contractual obligations.\nHis appointment is in line with procurement regulations and has thus obtained the necessary approvals,” the government agency’s spokesman said.\nMr Hillman, 54, resigned his post as managing director of Allied Newspapers, publishers of Times of Malta, soon after his name surfaced in the Panama Papers leaks.\nDocuments showed that Mr Hillman owned secret companies in the British Virgin Islands, similar to the ones set up in Panama by Nexia BT’s Brian Tonna for the Prime Minister’s chief of staff Kith Schembri and Tourism Minster Konrad Mizzi.\nThe leaks also revealed transactions of some €650,000 between Mr Hillman’s secret bank accounts and those associated with Keith Schembri.\nA financial services company owned by Matthew Pace – the Planning Authority board member at the centre of the db project controversy – was also involved in investing hundreds of thousands in funds for Mr Hillman.\nAn FIAU investigation on the dealings between Mr Hillman and the Prime Minis- ter’s right-hand man found that there was “reasonable suspicion” that Mr Schembri was involved in money laundering activities after transferring hundreds of thousands to Mr Hillman.\nThe two deny any wrongdoing but two separate magisterial inquiries opened twoyears ago on the FIAU findings have still not been concluded.\nDocuments show that Adrian Hillman owned secret companies in the British Virgin Islands, similar to the ones set up in Panama by Nexia BT’s Brian Tonna for the Prime Minister’s chief of staff Keith Schembri and Tourism Minster Konrad Mizzi.\nThe FIAU findings have still not been concluded.\nApart from the MGA contract, Prime Minister Joseph Muscat last year appointed Mr Hillman as his representative on the Board of Trustees at the American University of Malta.\nDuring the official inauguration of the Cospicua University in March, Dr Muscat said that he had “no problem with Mr Hillman”.", "comment_count": 69, "id": 1703}, {"keywords": "Accident, Traffic", "author": "", "article_body": "A man and a woman were seriously injured when their car went out of control and crashed into a pole at Triq id-Daħla ta’ San Tumas, Marsascala.\nThe injured were a 20-year-old man from Siġġiewi, who was driving the VW Golf, and a 20-year-old woman from Għaxaq.\nThe accident happened at about 11pm.\nThe same street was the scene of another serious accident last week when four Italians were injured in a car crash.\nPillion rider injured on the Birkirkara bypass\nIn a separate accident, a pillion rider was seriously injured when the motorcycle she was riding on went out of control and crashed on the Birkirkara bypass on Wednesday afternoon.\nThe police said on Thursday that the motorcycle was being driven by a 58-year-old man from Birkirkara, who was unhurt. \nBut the 31-year-old woman from Valletta, who was a passenger, needed hospital treatment.  ", "comment_count": 1, "id": 1704}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in the Maltese newspapers on Thursday.\nTimes of Malta, the Malta Independent and l-orizzont lead with the rent reform announced on Wednesday, where the government is setting a minimum one year contract, capping rent rises during the term of contracts and establishing notice periods.\nIn other stories, Times of Malta reports that the construction industry is at a standstill amid questions on the new regulatory package announced on Tuesday.\nThe Malta Independent features the approval by the Council of Europe of a damning report on the murder of Daphne Caruana Galizia and the rule of law in Malta.\nl-orizzont says new regulations on the avoidance of damage to third party properties have clarified questions about constructions site rules. \nIn-Nazzjon, however, reports that the new rules have complicated a situation which was already chaotic, and pushed property prices up. In another story, the newspaper also quotes the director of Caritas voicing opposition to the legalisation of the recreational use of Cannabis.", "comment_count": 0, "id": 1705}, {"keywords": "Politics, Economy, Żabbar", "author": "Jacob Borg", "article_body": "The proceeds from the sale of a property listed in past asset declarations by Economy Minister Chris Cardona have gone missing from his latest declaration.\nIn a declaration filed in 2018, Dr Cardona said he owned an apartment and garage in Żabbar, among other property holdings.\nHe also declared €129,000 in bank deposits, unspecified debts of €392,000 and a 25 per cent shareholding in a property development company.\n\nIn this year’s filings, the Żabbar property was not in the minister’s asset declaration, without, however, any apparent improvement in Dr Cardona’s level of bank deposits or debts, which would have been expected given the property sale.\nThe declaration for 2019 shows Dr Cardona as having €135,000 in deposits and €375,000 in debts. Replying to questions by Times of Malta, the minister said the property had been sold by the company he owns shares in.\nProceeds from sale went to the company, banks\n“The money didn’t disappear. There is a company called Sapmac, and normally, in our legal world, the company would represent the immovable property that has been sold,” Dr Cardona said.\nHe said the proceeds from this sale had gone to the company “and the banks as well”.\nEconomy Minister Chris Cardona says the property in question was sold by a company in which he owns shares. Photo: Matthew Mirabelli\nAttempts to trace the financial flows into Sapmac led to a brick wall, as the real estate development firm has been flouting company law for over a decade by not filing audited accounts. When Times of Malta had in 2015 flagged Sapmac’s repeated failure to file accounts, the Economy Minister had vowed to solicit the company directors, including his former chief of staff, to present audited accounts to the Malta Financial Services Authority.\nThe last accounts for Sapmac were filed in 2008 for the year 2006. Auditor Brian Tonna, of Panama Papers fame, signed off on these accounts.\n“Proceeds from sale went to the company, banks”\nA search of recent properties bought or sold by the company in 2017 shows that one of the apartments in the block was sold for €79,000 in 2017.\nThis is possibly the same apartment that was in Dr Cardona’s asset declaration. The buyer was the daughter of Carmel Penza, a Sapmac director. The following year, a garage in the same apartment complex was sold for €13,500.", "comment_count": 41, "id": 1706}, {"keywords": "Mellieħa, Beach, Accident", "author": "", "article_body": "Swimmers came to the rescue of a woman who got into trouble while in the sea at Għadira, pulling her out of the water.\nThe 83-year-old French woman was reported by the police to be in a serious condition at Mater Dei.\nThe incident occurred at 6.15pm.\nPolice investigations are under way.", "comment_count": 0, "id": 1707}, {"keywords": "Daphne Caruana Galizia, Politics, Joseph Muscat", "author": "Denise Grech ", "article_body": "Updated 9.40pm\nA report condemning the state of rule of law in Malta and raising concerns on the investigation into Daphne Caruana Galizia's murder was overwhelmingly approved at the Council of Europe.\nThe report's recommendations call on the government to establish a public inquiry into the assassination of Ms Caruana Galizia within three months.\nThey also call on Prime Minister Joseph Muscat to refrain from appointing more people to the judiciary before fully implementing Venice Commission recommendations.\nBoth resolutions were criticised by Labour MP Manwel Mallia. In his intervention, Dr Mallia argued the public inquiry could not run parallel to the ongoing criminal inquiry. He also argued against calling for an end to further appointments to the judiciary, saying some could be retiring, causing an inconvenience in the court.\nHe also insisted an amendment calling out inflammatory comments made by people close to the Prime Minister on Ms Caruana Galizia’s death to be changed to reflect the “Southern European tone” in Malta.\nThe government had recently revved up attempts to water down the report, with Dr Mallia presenting over 40 amendments seeking to remove passages critical of the government.\nThe Council of Europe headquarters.\nDr Mallia’s amendments were roundly rejected by a Council of Europe committee.\nThroughout the debate prior to the vote, only Maltese Labour MPs and Azeri MPs spoke out against the draft resolution.\nIn her intervention, Labour MP Rosianne Cutajar said that the criticism pointed out in the draft resolution go far beyond the scope of the Council of Europe assembly. The resolution also made “serious errors” about comments by the Interior Minister that the masterminds behind Ms Caruana Galizia’s assassination were close to being apprehended.\nMurder suspects potentially out on bail\nShe also criticised comments by Dutch MP Pieter Omtzigt that the three suspects arrested in relation to Ms Caruana Galizia’s murder were close to being released.\nMr Omtzigt said in the report that the three suspects would be released in two months unless the Attorney General does not file a bill of indictment. But Ms Cutajar said this was “misleading”, as they will simply be \"entitled to bail” in two months.\n“Please, you cannot accept this as reliable and accurate,” she told the Council of Europe assembly.\nAzeri MPs also heavily criticised the report, saying that some were clearly using Ms Caruana Galizia's murder “for their objectives”. In his report, the rapporteur was trying to insult Azerbaijan and the name of its president, they said.\n“It’s unacceptable when sensitive issues are used for issues of manipulation,” Azeri MP, Sevinj Fataliyeva charged, adding this was a clear attempt to blackmail her country.\nThe report outlines allegations that offshore company 17 Black received large sums of money from an Azerbaijani national.\n‘When you’re in a hole, stop digging’\nPN MP Jason Azzopardi told the assembly that Ms Caruana Galizia’s murder was planned “months in advance, with people with access to the highest corridors of power”.\nThe report, he insisted, was based on objective truths. The Labour Party continues to dehumanise Ms Caruana Galizia, he insisted, adding that, until yesterday, the government had cleared the memorial to the journalist more than 500 times.\nOther MPs, said Ms Caruana Galizia’s murder is a “stain” on Europe. British MP George Foulkes called for effective action and a “far more energetic” pursual of the masterminds\nIrish MP Paul Gavan encouraged the government to collaborate with the Council of Europe, telling the government “when you’re in a hole, stop digging”. “Stop defending and start working with us,” he said.\nReport details\nThe report also insists that chief of staff Keith Schembri and Tourism Minister Konrad Mizzi enjoy Prime Minister Joseph Muscat’s \"personal protection\", despite a series of allegations of money-laundering and wrong-doing. \nIt also highlights how the three men suspected of setting off the bomb that killed Ms Caruana Galizia in October 2017 have still not been put on trial, with their custody limit close to expiring.\nThe government has said the report was \"riddled with inaccurate and gratuitous statements\". The report exposed a biased agenda which was not based on the true picture of the matter, the government had said.\nThe draft resolution was overwhelmingly approved at the Council of Europe.", "comment_count": 285, "id": 1708}, {"keywords": "Crime, Politics", "author": "Luke Scicluna", "article_body": "A prostitute was forced to work even while pregnant and shortly after giving birth, working non-stop from 8am to 5pm and throughout the night, Opposition MP Claudette Buttigieg told Parliament on Wednesday.\nCautioning the government against the relaxation of legislation prohibiting prostitution, she said that the prostitute had borne two of her pimp’s children, who made her keep her phone switched on while she attended to clients, so that he could hear what she was saying and doing.\nMs Buttigieg said the woman had said: “My water broke when I was with a client. I phoned my pimp, but he wouldn’t take me to hospital.”\nShe likened these conditions to those of chained dogs, which had been given protection by the government, and questioned how this state of affairs could persist in Malta.\nMs Buttigieg intervened during a debate on amendments to the law on domestic and gender-based violence which resulted from the Istanbul Convention last year. The amendments are being moved by Equality Minister Helena Dalli.\nThe amendments would increase the fines which could be levied on perpetrators and prohibit the filming of sexual acts without the consent of the person being filmed, among other changes. They would also allow for the gradual payment of damages, in order to allow the victim to receive compensation without financially crippling the perpetrator.\nMs Buttigieg made reference to Germany where brothels were “as large as supermarkets” and clients had a “menu” of services to choose from. Germany had 400,000 legal sex workers who serviced over a million clients every day, and many of these sex workers were treated “no better than animals”.\nThe vast majority of women in prostitution were groomed from as tender an age as 12 or 13, and many started engaging in sex work before they were 18. Most prostitutes came from dysfunctional families, and were targeted by pimps and groomed by family members, boyfriends, or pseudo work agents.\nThe Opposition would be voting in favour of the amendments, she said, but lamented that domestic and gender-based violence laws were failing to be put into practice due to reasons which had to do with the composition of Maltese society.\nThe media was failing to draw sufficient attention to the fact that domestic violence was not just “women’s problem” but a social problem which was undermining Maltese society.\nMs Buttigieg referred to a recent interview with lawyer and activist Lara Dimitrijevic, which had shown that reports of domestic violence had increased, and that women continued to be the most affected. Victims were told not to file reports because these would ultimately backfire on them, Dr Dimitrijevic had said, as she recounted one particular case where a victim was scolded by the police for “exaggerating”.\nThis showed that, in spite of a law passed in 2018, the police were not sufficiently prepared to deal with issues of domestic violence.\nIt did not help that it took so long to bring perpetrators to justice, intensifying the victimisation of those who were already suffering.\nOther Opposition MPs discussed various aspects of the amendments. Opposition MP Kevin Cutajar addressed the phenomenon of revenge pornography, arguing that it could not be addressed simply through legislation but that there was a need to provide training and appropriate technology to police working to combat such crimes.\nDr Cutajar and Opposition MP Therese Comodini Cachia both questioned the decision to separate the stages of assessment and investigation in response to allegations of domestic or gender-based violence. \nDr Cutajar and Dr Comodini Cachia both questioned whether adding a person with disability to the Gender-Based Violence and Domestic Violence Commission would have practical results, or whether this representative would simply be a token figure. The requirement that those suffering from disability be represented on the Commission should be accompanied with the proper support for the representative in question.\nOpposition MP Edwin Vassallo objected to an amendment which defined gender as “the socially constructed roles, expectations, activities, behaviours and attributes that society at any given time associates with a person of any sex, assuming any form of gender identity or gender expression.\" This represented a departure from a natural understanding of gender, he said, allowing the state to determine and define the meaning of gender.\nThe government should respect the natural difference between the sexes, he said. The logic which it was currently adopting was destroying what used to be known as the “family,” which was no longer defined in legislation as the union of man and woman. To this extent, the “genderist” law which was before the House was itself carrying out a form of sexual abuse.", "comment_count": 3, "id": 1709}, {"keywords": "Adrian Delia, PN, Politics", "author": "", "article_body": "A move to force an extraordinary general council meeting of the Nationalist Party has been accepted by the party’s general council president, Kristy Debono.\nIn a statement, Ms Debono said that she was referring the request to the party’s executive for it to begin the process to summon a general council, despite alleged irregularities tainting 84 of the 200 signatories behind the move.\nThe general council meeting was forced by a petition demanding a secret vote on party leader Adrian Delia, which was presented to the party’s leadership on Tuesday afternoon.Kristy Debono said she was referring the request to the the party's executive. Photo: Facebook\nDebono questions signatories\nAccording to the PN statute, a petition must be signed by at least 150 members of the party’s general council for it to trigger a general council meeting.\nThat petition featured 200 signatures, PN executive member and former electoral candidate Ivan Bartolo, who handed in the petition, had told the press.\nOn Wednesday, Ms Debono revised that figure downward: 28 out of the 200 signatories were invalid, she said, adding that 23 were not among the PN general council’s 1,500 general council members, while another five were invalid because they had refused to renew their party membership when requested to do so.\nThat would bring the total number of signatories down to 172 – a number still higher than the minimum 150 required according to the party statute.\nMs Debono also raised questions about another 56 of the signatures featuring on the petition: 55 had memberships which were expired, while one more signatory had signed using a name which did not match that on their ID card.\nPetition moves forward\nNevertheless, the PN statement said that Ms Debono was moving forward with the petitioners’ request and calling for a general council meeting.\nDuring an eventual general council meeting, PN councillors will be asked to vote on whether they want Adrian Delia to remain as party leader, despite two bruising electoral defeats last May.\nSources within the PN told Times of Malta that councillors who have expired party memberships will have to pay their dues before they are able to cast a vote at the eventual council meeting.", "comment_count": 49, "id": 1710}, {"keywords": "Human rights", "author": "Philip Leone Ganado", "article_body": "Women living in domestic violence shelters and open centres in Malta feel they are struggling to achieve self-sufficiency and often feel unsafe in their centres, according to the results of a new research project. \nResearch carried out by six women who had themselves lived in institutional settings found that the overall living situation for women in these centres had actually worsened in recent years, and highlighted challenges ranging from financial troubles to lack of support and security, and psychological turmoil.\nThe project, led by the Jesuit Refugee Service and the Women’s Rights Foundation, was based on focus groups conducted in five shelters and open centres, with the goal of uncovering realities faced by residents and engaging with policymakers.\nAccording to a report of the research published this week, there are an estimated 114 women living in institutional settings and open centres around Malta. \nMany of these women were driven out of their homes as a result of domestic violence, while others sought refuge after escaping war and persecution in their countries of origin.\nThe report, entitled In This Together, found that the most prevalent issue among these women was the challenge of achieving self-sufficiency, including the difficulty in transitioning to living in their own home. \n“As a result of the continuously increasing and unaffordable rent prices in the country, many are left with no choice but to apply for government housing,” the report points out, noting that some women had been on a waiting list for 15 years. \nWomen also highlighted financial difficulties: while some received social welfare benefits, these were often not enough to support children, and certain shelters imposed regular contributions which were considered too high in relation to the women’s benefits. \nMoreover, women said they felt limited by the lack of training or educational courses to allow them to develop or better themselves, while those in open centres spoke of the lack of information on the different systems in Malta. Lack of hygiene and security were prominent issues among women living in open centres, with residents reporting rooms full of cockroaches and many without windows. \nWomen who complained spoke of being “punished” by being moved to even smaller rooms. \n“Some women also expressed that they do not feel safe in the presence of certain male guards and fear leaving their rooms at night, even to go to the bathroom,” the report notes, adding that many women were reluctant to speak up for fear of repercussions. \nWomen also highlighted the lack of support to help them heal and grow from their experiences, which was often offered only in the most critical cases. \nThe report highlights the need for better psychological therapy as well as child care: “While the government offers free childcare services for working mothers, this is only offered once a woman has a promise of work,” it observes. \nMoreover, women in shelters felt that staff members were not adequately trained to provide emotional support to victims of domestic violence, mainly due to a lack of understanding and knowledge of domestic violence issues.\nRecommendations\n■ Ensure clear standards for shelters and open centres and ensure that staff are trained to understand residents’ specific issues and support their recovery and wellbeing.■ Provide better in-home courses – including language training, job skills and budgeting – and child-minding services.■ Revise the rules on entitlement to social assistance to better assess individual needs and waive fees on residence and work permits and other essential documents until a women is self-sufficient.■ Help women transition to independence by providing a sheltered housing programme with heavily subsidised rent for two or three years. ■ Speed up court processes for domestic violence and asylum procedures to allow women to achieve closure, and train legal aid lawyers to better support clients in these cases.", "comment_count": 0, "id": 1711}, {"keywords": "Construction", "author": "Vanessa Macdonald", "article_body": "The government released the new Avoidance of Damage to Third Party Property Regulations, 2019, which seeks to protect neighbours from damages resulting from any excavation, demolition or construction work. Vanessa Macdonald explains the main points of this law.\nWhat laws cover the sector?\nThe Periti Act of 1999 outlines the qualifications of architects and their warranting but does not go into their responsibilities. That falls partly under the Civil Code, Article 1638, which lays the responsibility for a building of not only the architect but also the contractor. The responsibility is valid for 15 years from completion and covers any defect in construction. How the responsibility would be shared between the architect and the contractor was basically left up to the courts to decide – and will now be even harder to determine\nThe Development Planning Act says that applications can only be submitted by an architect, while the Building Regulation Act (2011) gives them the duty to sign off on completion of projects as being compliant with regulations. \nThe Building Regulation Act provides for the registration and authorisation of those working for the sector or supplying materials for it. The Building Regulation Office (BRO) was given this task and could also suspend, withdraw or delete any licence or registration it has issued. \nWide-ranging categories of workers required licensing with a register meant to be held by the BRO and to be available to the public – but this was until now not done in full. Former Chamber of Architects and Civil Engineers (KTP) president Alex Torpiano complained that the information registered was incomplete – for example, without a validity period or ID card number for identification.\nHowever, the laws referred to above did not delve into the role of the site manager beyond explaining how they would be involved in the case of notifications.\nSo from where does the concept of a site manager emerge? \nThe site manager was originally the person who would protect the owner’s interest, there to ensure that the contractor was doing what they were supposed to do.\nUntil now, the role was defined by the Environmental Management Construction Site Regulations, 2007, which says that the site manager could be (a) the owner himself; (b) the project supervisor as construed in the Minimum Health and Safety Requirements for work and construction sites regulations of 2004; (c) an architect; or (d) any other competent person. \nIn the absence of a nominated site manager, the owner would by default be given that role. The law saw the role of the site manager as complementing that of the architect, making them responsible for ensuring that permits, certifications, authorisations or approvals were in place.\nThe new law would make architects the site technical officers\nWhere do third party rights come into the picture?\nThese are encapsulated in the Avoidance of Damage to Third Party Property Regulations of 2013, which make the site manager the sole person responsible for compliance with this set of regulations and which make the developer the default site manager if no one is formally appointed.\nThe KTP has been asking for years for the complex web of different laws to be reviewed as it was too cumbersome to work with. However, the new regulations seem to create even more anomalies by changing clauses in one Act without clarifying their impact on other laws.\nMoreover, instead of being nominated by the owner to look after their interests, the site technical officer will be nominated by the very contractor that they are meant to be monitoring. \nIf the law already envisaged that architects could be site managers, what is all the fuss about?\nThe new law would make architects the “site technical officers”, which poses logistical problems. Does an architect have time to go to each site to ensure that the contractor does what they were told to do?\nPerhaps the best analogy would be that of a nurse and a doctor. A doctor would decide on the medication to give a patient and would instruct the nurse, assuming that they had enough knowledge and experience, to carry out those instructions. The new law is a bit like saying that doctors actually have to be there whenever the nurse does so, which is clearly not feasible. \nIt is also not clear what happens to the current appointed site managers and whether they are all out of a job as of today.\nIs the role of the STO the only issue?\nAlas, no. For example, the KTP frets that too much emphasis is being put on the geotechnical considerations of the ground below the site.\nMany of the regulations also need to reflect the fact that we are no longer talking about two-storey terraced houses with a basement, and that multi-storey buildings with multi-storey underground car parks require a fresh approach. \nFor example, Flimkien Għal Ambjent Aħjar pointed out that the minimum distance of 76cm from a neighbouring wall has not been increased. \nThe regulations might only be a knee-jerk reaction at best, but what is worse is that they are only a knee-jerk reaction to one aspect: third party properties. They do not address the shocking increase in occupational accidents, many of which have resulted in tragedies.", "comment_count": 11, "id": 1712}, {"keywords": "Crime", "author": "", "article_body": "Customs officials seized thousands of illicit cigarettes and bottles of beverages during routine searches in towns around Malta. \nIn a statement, the Customs Department said it had confiscated 3,740 cigarettes, 21.6 kilos of tobacco, 3,727 bottles of non-alcoholic beverages, 217 bottles of wine, and 53 bottles of spirits, including whiskey, vodka, rum, grappa and liquers. \nThe goods were seized due to excise duty not having been paid. Officials also seized 443 unused excise stamps.\nCustoms said the goods had been discovered on sale in several shops during routine searches in Rabat, Dingli, Mosta, St Paul's Bay, Sliema, Balluta, St Julian's, Paceville, Balzan, Lija and Marsaxlokk.\n\"The Customs Department’s Enforcement Unit has been clamping down on the sale of illicit goods, in an effort to hamper contraband operations and collect the taxes owed, which is being charged to the end consumer,\" the department said. ", "comment_count": 4, "id": 1713}, {"keywords": "Construction, Planning Authority", "author": "Ivan Camilleri", "article_body": "Updated at 5.20pm with architects' statement\nThe construction industry came to an almost complete halt on Wednesday as most contractors downed their tools and sent employees home, after new rules were hurriedly introduced one day prior.\nConfirming reports received by Times of Malta during most of the day, MDA President Sandro Chetcuti confirmed that at the moment some 80 percent of the construction industry including tens of contractors are “at a complete standstill”.\n“Unfortunately we have a problem which is emanating from confusion over the new rules,” Mr Chetcuti said.\n“Currently the industry is almost at a standstill as there are differences over the interpretation of the new rules issued by the government”.\nMr Chetcuti said that the MDA would be holding an urgent meeting for all contractors next Monday to try to “come out with a solution.”\nRELATED STORIESConfusion and clarity over new construction rules\nTimes of Malta has been inundated with calls from concerned clients stating that contractors had told them they will stop working on their projects as they have no architect overseeing the work.\n“My contractor told me that the new government rules will also mean that I will have to fork out another €60 an hour so that an architect can do the monitoring. I am just doing some internal refurbishment,” an angry client said.\nHowever, Mr Chetcuti said that this was the wrong interpretation by contractors, as an architect is only necessary when third parties are involved.\nWhile stating that the MDA does not even agree that a site supervisor should necessarily be an architect, he admitted that there is confusion on the new rules.\nThe new rules make architects responsible for ensuring excavation and demolition works follow proper procedures and alter site manager rules to instead require construction projects to be coordinated by 'site technical officers'. \nThe new regulations came about after a spate of buildings collapses linked to adjacent construction works. \nAbide by regulations, architects told\nArchitects are unhappy about the changes, which they say put the onus of responsibility for temporary works on them instead of contractors. \n\"This, coupled with the fact that the requirement for registration and licensing of contractors has not been brought into force, results in a situation where effectively the site technical officer is being made to bear the shortcomings of the government to regulate the sector,\" the Chamber of Architects and Civil Engineers has said. \nOn Wednesday, the Chamber told its members that all existing sites which bordered third parties would have to adhere to the new rules before works could continue. \n\"This includes the preparation of fresh condition reports of third-party properties, fresh method statements, revised insurance policy premia, and the appointment of an STO [site technical officer] by the contractor, or by each individual contractor present on site\". \nAccording to the new rules, neighbours have two weeks to review and contest method statements. \n\"Until all the provisions are adhered to, all works are in effect suspended,\" the Chamber concluded. ", "comment_count": 51, "id": 1714}, {"keywords": "Politics, PN", "author": "Philip Leone Ganado", "article_body": "Nationalist Party MP Ivan Bartolo is tired of people praising or condemning him for calling for a vote on party leader Adrian Delia's future - mostly because he hasn't called for anything of the sort. \nIt was his namesake, a member of the PN general council and former election candidate, who presented a petition calling for the vote at the party headquarters on Monday, but the distinction between the two Ivan Bartolos appears to have been lost on many. \n\"I am not the Ivan Bartolo you're referring to,\" Mr Bartolo, the MP, wrote in an impassioned Facebook post on Wednesday. \"I have written no articles in the Times and signed no petitions. Whenever I have had to raise my points, I've done so privately and directly.\"\nSteadfastly refusing to express any view on the current controversy within the party, the MP said he had been getting on with his parliamentary work. \n\"I'm not looking for praise, but neither should I be continuously threatened by those in favour or against, when I've always acted prudently and spoken out only in those moments where I truly needed to,\" he said. \n\"Please let me get on with my work. I don't deserve this pressure from all round.\"\nIt is perhaps best if nobody brings up the PN local councillor in Paola - Ivan Bartolo. ", "comment_count": 25, "id": 1715}, {"keywords": "Environment, Fire, Mellieħa", "author": "Ivan Martin", "article_body": "Updated at 7.50pm\nThe fire which engulfed the Miżieb woodland last weekend affected around a quarter of the green area, much more than initial estimates had indicated, according to an internal report seen by Times of Malta.\nConducted by the Environment and Resources Authority in collaboration with Ambjent Malta the damage report found that an estimated 180,000 square metres of the forested area was impacted by the massive blaze that broke out last Saturday and was still smoldering on Monday morning.\nThe Hunters’ Federation, which claims to have rights to use the woodland as a hunting reserve, had issued an estimate that around 55,000 square metres – an area six times the size of the Floriana Granaries – had been burnt.\nAccording to the team of experts from the two government environmental agencies, the scorched area was actually far larger.\nA map of the affected area in the expert report.\nIt could have been even worse. Sounding a warning for the future, the experts say that the fire could have spread much deeper into the woodland had a few dirt roads and paths not acted as barriers to contain the rising flames.\nWhich species burnt down?\nThe report does not quantify how many trees were lost, saying only that a “large number” were burnt down.\nThese were mostly Aleppo Pine, invasive Olive Trees, Gum Trees, and Blue-leaved wattle, - an invasive species known locally as l-Akaċja.\nAside from burnt trees, some over-turned ones were also found during an onsite inspection.\nThese trees, the experts report, probably lay horizontally as they had been planted on shallow garigue, and may have assisted in the rapid spread of the flames.\nWhy did the fire spread?\nThese however, were not the leading cause of the extent of the blaze.\nAccording to the report, it was the presence of “highly flammable species”, such as pines and eucalyptus, the large extent of combustible pine needle cover on the ground, and significant amounts of human litter dumped throughout the wooded area which are considered to be the main factors in assisting the spread of the blaze.\n“The combination of trees, besides not being natural, includes some of the most flammable species in the world,” the report reads.\nIt later adds that the planting of highly flammable alien species, not only “considerably reduced biodiversity”, but also posed a major fire hazard.\nThe document does not get into what caused the fire to spread, which is currently the subject of a police investigation.\nMeanwhile, sources involved in policing the island’s green outdoor spaces have told Times of Malta that the likeliest cause was the burning of pruned branches in nearby fields.\nThe blaze left a large number of scorched trees. Photo: Chris Sant Fournier\nIn their report, the ERA and Ambjent Malta team say that garigue and certain species of beloved local shrubs (including the Mediterranean Thyme), were also impacted by the fire.\nOne of the largest fires in years\nEmmanuel Psaila, who heads the Civil Protection Department told Times of Malta that the inferno was one of the largest he had come across in his 20 years of firefighting.\nIt was, without a doubt, the largest he had seen in recent years after taking over the department, he added.\nIn all, 16 firefighters battled against the flames in the Miżieb area around the clock between Saturday and Sunday morning, as little pockets of scorched earth kept re-igniting under the blaring heat of the June sun.\nFirefighters present said that had they not remained on site to ensure the fire was contained, the damage to the woodland would have been far greater.\nPrevention and cure recommendations\nMinister José Herrera, together with Parliamentary Secretary Clint Camilleri and officials from the Environment and Resource Authority, AmbjentMALTA, and FKNK visited Miżieb after ERA and AmbjentMALTA had concluded an extensive analysis of the fires which engulfed the area.\nThe report found that the lack of biodiversity made it easier for the fire the spread out, recommending a mixture of native fire-resistant species, backed up fire ecology principles and fire management including access to water from the pipeline passing through the Miżieb area.\nIt also advised that the pine tree saplings should be given time to regenerate on their own, protecting new saplings, while olive trees should be allowed to resprout from their buds. It also recommended that invasive alien species should be controlled and eradicated.ERA and AmbjentMALTA will now be drawing up a management plan for the area, which will incorporate passages, more rubble walls and indigenous trees that are more resistant to fire.", "comment_count": 6, "id": 1716}, {"keywords": "Drugs, Crime, Police, Sliema", "author": "", "article_body": "A police raid in Amery Street, Sliema has busted a suspected drug trafficking ring, with four people being taken into custody.\nPolice swooped down on the apartment at Tuesday evening, and arrested two men and two women, all Maltese nationals.\nSachets of white powder believed to be cocaine and heroin were ready for sale, while and other paraphernalia were also found there.\nA magisterial inquiry is under way. The police said the four would probably be arraigned in court in the near future.", "comment_count": 0, "id": 1717}, {"keywords": "Sliema, Planning Authority, Construction", "author": "Philip Leone Ganado", "article_body": "The redesigned 28-storey Townsquare high-rise in Sliema is expected to be approved by the Planning Authority on Thursday, after earlier approved plans were thrown out by an appeals tribunal.The height of the planned tower has been reduced by 11 storeys, or around 37 metres, after the Environment and Planning Review Tribunal last year revoked the original permit issued by the PA in 2016. That decision followed appeals by the Environment and Resources Authority (ERA), Sliema local council, Din L-Art Ħelwa, Flimkien Għal Ambjent Aħjar (FAA) and other eNGOs.Most of these objections have been dropped for the revised proposal and the application has been recommended for approval ahead of a public hearing by the PA board. The revised plans include the same number of apartments, 159, as the original proposal, but a reduction in the amount of floor-space for offices, retail and food and drink outlets.\n'Largest pedestrian zone in Sliema centre'\nThe development will be built on the former Union Club site near the scheduled Villa Drago, which will be restored.\nPhoto: Google Maps\nIt will include an unchanged 7,500 square metres of public open space, which the developers say will become the largest pedestrian zone in the town centre and has been redesigned to include more greenery and a landscaped rear garden. Developers also say the changes to the tower’s design - including the height reduction - will “dramatically reduce” its visual impact, a major point of objection in the first application process.\nVisual, community impacts remain concerns\nNevertheless, ERA (which is not objecting to the project as a whole) expressed reservations over this impact, especially when seen from the Sliema and Gzira waterfronts, Valletta and Bighi, and said that given the scale being proposed, the effect was difficult to mitigate.Sociological studies carried out as part of an Environment Impact Assessment on the new proposal also found that public perception to the project remains “generally negative” despite the changes, and that fears over its effect on the community had actually intensified among Tigné residents.At the same time, the studies found that reactions to the project were more positive among young people and recently-arrived foreign residents. Traffic, meanwhile, is expected to increase by around 21 per cent over current levels, with an average of 2,569 additional car trips along Qui-si-Sana on weekdays, down from 3,500 with the earlier plans. Approval has been recommended against a €266,314 planning gain and €50,000 artistic fund contribution.\nThe saga so far\nThe original project had been approved by just a single vote margin when it came before the PA board in 2016, with ERA chairman Victor Axiak (who had raised serious criticisms over the plans) absent due to illness. Objections at the time had highlighted the excessive visual impact, traffic and congestion problems in Qui-Si-Sana and the negative impact on nearby residents’ quality of life.The appeal decision, which annulled the permit and sent the developers back to the drawing board, had primarily cited the inadequacy of impact studies carried out for the project, all of which have since been conducted anew.", "comment_count": 19, "id": 1718}]