[{"keywords": "Gozo", "author": "", "article_body": "• Today, Xagħra celebrates the feast of St Anthony the Abbot. Gozo Bishop Mario Grech will celebrate Mass at 9am. The Victory Band will play marches at 10am. The saint’s statue will be taken out of the church at 10.15am to St Anthony Square, where horses will be blessed. A horse défilé will follow in St Joseph and Church streets. Activities will be held in the square at 11am. The procession will leave the parish church at 4.30pm. Mgr Grech will bless animals in the square at 5pm.\n• A blood donation session will be held at Xewkija District Health Centre today from 8am to 1pm.\n• The Gozo Philatelic Society is holding its annual general meeting at Il-Ħaġar in Victoria today at 9.30am. There will be the distribution of prizes (Malta Post as main sponsors), as well as medals and certificates for all participants in the November’s annual GPS exhibition.\n• Johnny English Strikes Again (U) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n• The feast of St Francis de Sales, patron saint of journalists and writers, will be marked with Mass celebrated by Gozo Bishop Mario Grech at the church of the Franciscan Sisters, Palm Street, Victoria, on Thursday at 5pm.\n• Fr Marcello Ghirlando will celebrate Mass and a healing service at St Anthony church, Għajnsielem, on Friday at 7pm. There will be adoration of the Blessed Sacrament from 6 to 7pm. All are welcome.\n• A new council to govern the Gozo NGOs Association for 2019-2021 will be elected during the association’s annual general meeting to be held at the Gozo NGO Centre, Xewkija, on Friday.\n• The Oasi Foundation will be organising a Fitness Class by Leo from the Ben Hersey’s Fitness Club of Għajnsielem. All proceeds will go to the foundation. The activity is being held at the Sacred Heart Seminary Fitness Centre in Victoria on Saturday between 1.15pm and 2.15pm. Booking is recommended by calling 2156 3333 during office hours until Thursday.\n• The annual conference of the Gozo Diocese Family Commission will be held at Villa Fiorita, Marsalforn, on Saturday between 5pm and 8pm. The theme for this year’s conference is X’ikissirha l-familja? Kif naffrontaw l-isfidi ta’ llum. (What are the causes of family break-ups? How to face today’s life challenges). The key speaker will be Carmen Delicata, a family therapist and lecturer at the Institute of Family Therapy (Malta). A child-minding service will be provided.\n• The first Gozo Model Car Association Mega Event for this season is being held at Ta’ Xħajma Track next Sunday. The mega event will consist of two classes, Buggy and Truggy. Qualifications will be held in the morning, while the finals will take place in the afternoon.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1719}, {"keywords": "", "author": "", "article_body": "Children gave prospective MEP candidates a hard time on Friday when they questioned them on various issues as they sought to find the right contender to champion their rights in the European Parliament.\nDuring a Children’s Roundtable organised by the President’s Foundation for the Wellbeing of Society at San Anton Palace, prospective EP candidates were quizzed about immigration, accessible healthcare, environmental concerns and bullying, among many other issues.\nIn all, 13 prospective MEP candidates accepted the invitation to take part in this event – the first such event being held with EP contenders – and the children were well prepared to ensure their concerns were aired.\nThey said in the case of stranded immigrants at sea politicians should act first and discuss later, and they expected MEPs to stand up against the unfair negative portrayal of immigrants.\nPoliticians should act first and discuss later\nImmigrant children, they believed, should have equal and meaningful access to education and their right to freedom of religion respected.\nThey also questioned the island’s overdevelopment, the felling of trees, single-use plastics, securing safe public spaces, encouraging renewable energy, having less cars on the road, better teaching methods and banning animal cruelty.\nBullying was also tackled and the children said this affected the victims deeply, eroding their self-confidence and self-esteem. Bullying should be tackled quickly and not ignored by parents and teachers, otherwise it will just get worse.\nThe children raised the importance of civic education for 16-year-olds who would be voting for the first time, called for a reduction in political partisanship, and stressed the need for better mental health support at a community level.\nThey also called for efforts to reduce political partisanship, the promotion of objective and un-biased information and keeping children informed as to what is happening in Malta through an accessible media news update targeting the younger generations.\nThe youngsters contended that educators needed to look at the individual needs of each student and teach children in more creative ways rather than just in a classroom and that subjects taught at school should be more closely tied with real-life situations that children will come across in their lives.\nPresident Marie-Louise Coleiro Preca has recently been nominated to be an honorary member of Eurochild for her commitment to children’s rights.\nThe event comes just weeks after the EP President appointed Anna Maria Corazza-Bildt as its new coordinator for children’s rights, a move that was welcomed by the foundation as it ensured the promotion, respect and safeguarding of children’s rights in all EP policy and legislation.", "comment_count": 10, "id": 1720}, {"keywords": "", "author": "", "article_body": "An estimated 170 people have died or went missing in two separate shipwrecks in the Mediterranean Sea, according to reports.\nSome 53 people have died on the Alborán Sea, western Mediterranean, according to information from NGO sources, the UNHCR said in a statement.\nOne survivor is understood to have been rescued by a passing fishing boat after being stranded for more than 24 hours at sea and is receiving medical treatment in Morocco. Moroccan and Spanish rescue vessels have been searching for the boat and survivors for several days to no avail.\nThe Italian Navy are also reporting an additional shipwreck on the central Mediterranean. Three survivors were taken for treatment on Lampedusa, and reported that 117 people, who are currently dead or missing, were on board with them when they departed from Libya.\nUNHCR said it has been unable to independently verify the death tolls for both shipwrecks.\n“The tragedy of the Mediterranean cannot be allowed to continue,” said Filippo Grandi, UN High Commissioner for Refugees.\n“We cannot turn a blind eye to the high numbers of people dying on Europe’s doorstep. No effort should be spared, or prevented, from saving lives in distress at sea.”\nMigrants, part of a group of 49, disembark from one of Malta's AFM Protector-class coastal patrol boats on January 9, 2019 after being transfered from the Dutch-flagged rescue Vessel Sea Watch 3 to Haywharf in Valletta,\nIn 2018, 2,262 people lost their lives attempting to reach Europe via the Mediterranean Sea.\nWatch: ‘Please don’t leave us out at sea in the storm’\nThe UNHCR said it is concerned that actions by states are increasingly deterring NGOs from conducting search and rescue operations, and is calling for these to be lifted immediately.\n\"At the same time, greater efforts are needed to prevent refugees and migrants from taking these desperate journeys in the first place. More safe and legal pathways to access asylum in Europe are needed for those fleeing war and persecution so that no one feels they have no other choice than to put their lives in the hands of unscrupulous traffickers and smugglers.\"\nSea-Watch 'rescues 47 from drowning'\nMeanwhile, on Saturday, the Sea-Watch 3 NGO vessel said it had saved 47 people from drowning, including eight unaccompanied minors.\nOn Friday evening, the reconnaissance aircraft Moonbird overheard communication about a distress case with a half-sunken boat and people in the water.\nThe Italy rescue centre refused to give Sea-Watch information about the case, claiming MRCC Tripoli to be responsible, which in turn was not able or willing to communicate, the NGO said. \n ", "comment_count": 0, "id": 1721}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Planning Authority has confirmed that it will no longer be insisting on enforcement action against the asphalting of an ‘illegal’ road in an environmentally sensitive area in Wied Qirda, limits of Siġġiewi, as it has now decided to lift the enforcement notice it issued 12 years ago.\nThe planning regulator, which in 2007 issued an enforcement notice “for the deposit and levelling of concrete in a valley without permit”, has now reversed its decision.\nAsked to explain how something which was illegal in 2007 and was left for “pending direct action” by the authorities for such a long time suddenly became legal, a PA spokesman said: “The access existed prior to 1968 therefore it is committed and not illegal.\n“Consequently, no action can be taken against the resurfacing of an existing access and so the enforcement notice has been withdrawn,” the spokesman said.\nIt is not yet known why it took the authority 12 years to lift its enforcement notice and why the ‘sudden’ change of heart.\nThe latest decision taken by the PA on this ‘illegality’ arrived after the Times of Malta asked the authority for an update on the unlawful tarmacking by Transport Malta of the illegal stretch of the valley pending enforcement.\nLast summer, Times of Malta reported that Transport Malta had laid asphalt on a stretch of the valley bed at Wied Qirda, near Siġġiewi, formalising an ‘illegal’ road that had been subject to an enforcement notice since 2007.\nThe stretch of the valley, which forms part of a designated special area of conservation, was illegally covered in concrete around 2007, blocking a natural watercourse and forming a driveway from the connecting Triq tal-Għaqba to a nearby field.\nIt had also reported that, incidentally, the driveway leads to a house occupied by Judge Consuelo Scerri Herrera, sister of Environment Minister José Herrera and her partner, OPM and Planning Authority consultant Robert Musumeci.\nRead: The architect, the judge, the house and the illegal driveway\nThe farmhouse occupied by the couple was legally considered as an olive and wine production facility when an application was submitted in 2015 by the owner at the time (with Dr Musumeci as architect) for an “extension to dwelling and construction of swimming pool”.\nDespite that the permit was recommended for refusal, the PA gave its green light. Although the formation of the ‘illegal’ road was made prior to Dr Musumeci’s acquisition of the farmhouse, the tarmac was laid only a few months ago.\nWhen contacted, Dr Musumeci had told the Times of Malta that he had absolutely nothing to do with the tarmac works.\n“I had no contact whatsoever with any Transport Malta official regarding any road works,” Dr Musumeci insisted.\n“The works in question were presumably visible to all and sundry.”", "comment_count": 18, "id": 1722}, {"keywords": "", "author": "Jacob Borg", "article_body": "Finance Minister Edward Scicluna has justified what PN MP Chris Said dubbed as an “explosion” in the FIAU 2018 budget, which mushroomed from the original approved amount of €1.6 million to €10.6 million.\nThe FIAU has been in the spotlight over the past few years after handling high-level money-laundering investigations involving politicians, including the Prime Minister’s chief of staff Keith Schembri, Tourism Minister Konrad Mizzi and Opposition leader Adrian Delia.\nRead: Casa publishes FIAU report showing €1.3m 17 Black transactions\nIn July, the European Banking Authority demanded action by the FIAU after it deemed that the unit had breached EU anti-money laundering laws over its supervision of Pilatus Bank.\nThe bank’s licence was withdrawn by the European Central Bank last November.\nThe Finance Minister informed parliament that additional funds were needed by the FIAU for a number of reasons.\nUnit’s human resources boosted\nProf. Scicluna said security improvements were made to the way the FIAU handled data, as well as improvements to the building’s security and its staff.\nThe Finance Minister said the unit’s human resources had been boosted and other changes implemented according to an established plan.\nMoney was also spent on the employment of “international skilled persons” to assist the FIAU in its anti-money laundering and terrorist financing obligations.\nAssistance was sought in the drawing up of an action plan and for preparations for a moneyval inspection and other reviews, Prof. Scicluna continued.\nHe said this had all been done to strengthen the unit’s operations and help it meet both current and future obligations.\nThe minister said the FIAU could not give more detailed about its operations due to confidentiality requirements.\nRead: Ferris sues government after being denied whistleblower status\nFormer FIAU manager Jonathan Ferris was denied whistleblower protection last year following claims that his dismissal soon after the June 2017 election was politically motivated.\nWhile Mr Ferris has said he was dismissed as his investigations worried those at the top echelons of power, the FIAU said he was told to clear his desk during his probation period after falling short of expectations.", "comment_count": 30, "id": 1723}, {"keywords": "", "author": "", "article_body": "David Liniker Micallef.\nThe 31-year-old man sought by the police since Thursday has been found. \nDavid Liniker Micallef was arrested on Saturday morning and was being detained at the Corradino Correction Facility, the police said. \nA nationwide appeal for help to track down the man was made on Thursday.\nIn a statement, the police thanked the public for its cooperation. \n ", "comment_count": 0, "id": 1724}, {"keywords": "", "author": "", "article_body": "Malta-based Indian pharmaceutical firm Aurobindo, will invest €3 million in oncology research, the Prime Minister has announced. \nAurobindo has been operating in Malta for more than 15 years. \nJoseph Muscat was taking part in a meeting for businesses during the Vibrant Gurajat summit in India. \nThe cooperation between the pharmaceutical sector in India and Malta came about as a result of the Malta Medicines Authority, which carries out inspections in Gurajat in connection with quality certificates. \nUnderlining his government's \"pro-business\" approach, Dr Muscat pointed out that Malta is the ideal location to infiltrate other markets, especially European ones. \nEconomy Minister Chris Cardona also addressed the participants. \n ", "comment_count": 9, "id": 1725}, {"keywords": "", "author": "Ivan Martin", "article_body": "Police are investigating the reappearance of suspicious symbols marked on the facades of homes that they believe may be linked to an organised gang of burglars, the Times of Malta has learnt. \nPolice sources working on the case said they had received a handful of reports in recent weeks from home owners who were concerned when they found odd symbols near their front doors.\nThe markings may form part of a code used by organised crime groups to stake out a building that they plan on robbing. \nThe phenomenon last hit the headlines in 2014 when a spate of robberies, mostly around the Sliema-St Julian’s area led the police’s Criminal Investigation Department and district officers to increase surveillance in the neighbourhood. \nWatch: How burglars are breaking into our homes - Times Talk 2014\nA gang linked to the crimes was later arrested and specialised tools, master keys and several stolen items were discovered by officers on the case.\nPhotos of the doodled symbols sent to Times of Malta by concerned readers in recent weeks have also started making the rounds on social media and police sources said that while they were taking the matter seriously, it was still too early to say with absolute certainty what the symbols meant and whether they were the handiwork of an organised crime group or not.\nThe sources said that the symbols discovered on homes between the end of 2013 and throughout 2014 were meant to indicate whether a house had already been burgled or was worth targeting. They could also indicate whether a woman lived alone – a preferred target, if the residents were easily alarmed or whether there was a dog on the property. It could also indicate that the resident was a public official, or had a security alarm system. \nRead: Attard now targeted by criminal code markings\nThe symbols are similar to a system developed in the US during the 19th century by migratory workers, known as the hobo code. To cope with uncertainties, vagabonds would leave a coded symbol in chalk or coal to give directions and warnings to others in the brotherhood, seeking shelter, or on the lookout for somewhere to rob. \nPolice who spoke to Times of Malta urged any resident who discovered one of the symbols on or near their property to report it to the police.\nKeeping doors and windows locked, and being vigilant were also advised by officers contacted this week.", "comment_count": 40, "id": 1726}, {"keywords": "", "author": "", "article_body": "Malta Freeport Terminals on Saturday showcased a €31 million investment in new equipment and infrastructural works during a visit by Tourism Minister Konrad Mizzi.\nDr Mizzi was shown 15 newly-acquired Kone Rubber-Tyred Gantry Cranes (RTGs) – that stand over 27 metres high and will be fully operational in March – as well as other yard equipment including 67 new tractors and trailers that have all been ordered over the past 12 months.\nThe new cranes, which complement another 50 already in use at the Freeport, were acquired from world-leading manufacturers KCI Kone Cranes. As well as being faster than conventional RTGs, they are also safer to operate – featuring an anti-collision system – and more energy efficient.\nThey are also fitted with safety alarms that are considerably quieter than the beeper alarms currently in use on older cranes and the Freeport is planning to install this new technology throughout its fleet of RTGs, which will have significant benefits for Birżebbuġa residents.\nSpeaking at a joint press conference with the minister, Malta Freeport Terminals CEO Alex Montebello said: “This investment comes at a time when the Terminals are operating at elevated capacity in a difficult and highly competitive environment.\n“Despite these challenges, the Freeport once again broke records again in terms of throughput in 2018, handling 3.31 million TEU containers. This is also thanks to the dedication of our committed personnel – without whom the results we’ve registered would not have been possible.\n“Since we are already operating at high capacity, the next step is to ensure our terminals are able to accommodate four million containers. We are seeking to achieve this objective in a number of ways, including extending the Terminal Two North Quay which is currently at tendering stage.\n“We strongly believe that investment is a catalyst for growth and is necessary to ensure we are able to meet the ever-growing challenges and maintain our position as a major transshipment hub.”\nDr Mizzi highlighted the importance of the Freeport's contribution towards Malta’s economy and competitiveness.\nThe minister stressed that such investment has been carried out not only to improve the Freeport's performance, but also to improve the air and noise level in Birżebbuġa.\nDr Mizzi said the new high-tech state-of-the art cranes are energy efficient and operated with low-emissions. He added that to reduce sound levels as much as possible, new cranes have been purchased equipped with rubber wheels and white noise sounders that were gentler on the ear, compared with conventional beeper alarms.\nDr Mizzi also discussed additional corporate social responsibility initiatives with the Freeport to embellish Birżebbuġa.\nThe Freeport currently handles 20 weekly mainline services, providing network links to 130 ports around the world, and received more than 2,200 vessels over the past 12 months.", "comment_count": 6, "id": 1727}, {"keywords": "", "author": "Claire Caruana", "article_body": "Irked students awaiting scholarships are questioning the government’s claim that the outcome is currently in the “appeals stage” in light of the fact that the results have yet to be published.\nSeveral students who spoke to Times of Malta expressed their frustration that while they were still waiting to find out whether they were awarded the scholarship, the government’s official reply was that the appeals process was still ongoing.\n“This is ridiculous. How can the government say that there is an appeals process when we do not even have the results in hand,” an angry student told the Times of Malta.\nHe explained that while he had started his course, he had yet to pay his fees as he was waiting for the outcome of the scholarship application, saying that as a result the future of his studies remained unclear despite the course starting last year.\n“How can you appeal if you don’t have a position which you can appeal? In the meantime, students are forking out or going into debts of tens of thousands of euros to further their education for themselves and ultimately their country,” another applicant told this newspaper.\nApart from course fees, the scholarships offered under the Tertiary Education Scholarship Scheme (TESS) also offers “additional allowances”, including grants for those studying abroad, students having children as well as those who are married or who have a disability.\nNo reply from the Education Ministry was forthcoming when Times of Malta asked for information on the so-called “appeals stage” and whether students were the ones expected to appeal even though they had yet to receive the results.\nStudents who tried to contact the government’s scholarships unit said they were told in December the results would be announced “in the coming days” but no additional information was given.\nOthers were simply not provided with any information and have been met with closed doors whenever they tried to ask about the delay.\nAccording to the government website, the scheme is aimed at supporting “quality tertiary education” from MQF Level 7 (Master’s degree) upwards and “to seek to contribute towards the Maltese labour market with the right skilled individuals”.", "comment_count": 1, "id": 1728}, {"keywords": "", "author": "Jacob Borg", "article_body": "Planning Minister Ian Borg told Parliament this week that he only found out a Planning Authority board member had been flown in to vote on the controversial Db Group development in St George’s Bay from online news portal Newsbook.\nBoard member Jacqueline Gili was flown to and from Malta on a private jet last September so that she should be present for a vote on the project.\nThe Ombudsman’s office last week said the decision amounted to “unwarranted influence” on Ms Gili.\nThe investigation came after a complaint by former Alternattiva Demokratika chairman Arnold Cassola, who asked the Ombudsman to examine whether the decision was a case of maladministration and whether it was discriminatory towards applications and objectors in other cases when no such measures were taken.\n“Neither the Authority or even more the executive should intervene so that members of the PA Board are present for meetings,” the Environment Commissioner said.\nMinistry had no say in the decision taken by the independent and autonomous authority\nAnswering a series of questions in Parliament this week, Dr Borg reiterated that his ministry had no say in the decision taken by the “independent and autonomous authority”.\nShortly after the incident, the authority head, Johann Buttigieg, had told the Times of Malta he would be an “idiot” to repeat the decision to fly in a member by private jet due to the lack of political backing.\n“The minister and Prime Minister made their position very clear [that they disagreed with the decision], so I’d be quite an idiot to go against that opinion,” Mr Buttigieg had said.\nThe decision to fly in Ms Gili by private jet cost taxpayers over €8,000. She voted in favour of the project, which was approved by 10 votes to four.\nIt is extremely rare for all members of the PA board to be present for a vote. In 2017, Ms Gili was absent for 29 of 75 votes. The following year, there was not a single hearing for which all members were present. ", "comment_count": 48, "id": 1729}, {"keywords": "", "author": "", "article_body": "Malle W. Trusseaur branded stainless steel oil and vinegar containers must not be used as they contain a high level of lead which could migrate into the food when used, the health authorities said.\nThe containers can be seen in the photo above.", "comment_count": 0, "id": 1730}, {"keywords": "", "author": "", "article_body": "President Marie-Louise Coleiro Preca has been made an honorary graduate by the University of Leicester.\nThe university bestowed the honorary degree at its graduation ceremony on Friday at De Montfort Hall in Leicester.\nDuring her acceptance speech, President Coleiro Preca thanked the University for the honour saying “this is a truly memorable moment in my life, which I will treasure forever”.\nThe President also commended the University of Leicester for being an inclusive university which promotes the most important values of humanity, such as human dignity.\n“These are values which I treasure so much. Through this, I truly feel connected with this wonderful university, and, in fact, I feel so honoured to have been chosen to be connected to this university. I am also proud of you, as the University of Leicester is an example of what our human family should stand for. I truly look forward to an even better connection by exploring further collaboration with the University of Malta.”\nPresident Coleiro Preca dedicated the honour to all the children in Malta and the United Kingdom, and all over the world, but in particular to the 264 million children around the world who did not yet have access to education.", "comment_count": 30, "id": 1731}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Foundation for Medical Services, which falls under the direct responsibility of Health Minister Chris Fearne, is refusing to adhere to an order by the Information and Data Protection Commissioner to give Times of Malta access to the contracts of employment of its CEO, Carmen Ciantar, and its Projects Director, Neville Gafà, according to the Freedom of Information Act.\nInstead, through its lawyer, the FMS has filed an appeal against the decision of the commissioner, arguing among other things, that both Ms Ciantar and Mr Gafà are not involved in politics.\nIn her written submissions to the Appeals Tribunal, FMS lawyer Katrina Borg Cardona – herself a political appointee on various government entities – argued that it was not true that public interest should prevail in this circumstance as “the commissioner did not bring a valid proof on what is the public interest of the employment contract of private persons who are not in the public or political arena”. \nTimes of Malta had asked FMS – a public entity – under the Freedom of Information Act to provide the employment contracts of Ms Ciantar and Mr Gafà.\nAfter a refusal by the FMS, the Information and Data Protection Commissioner upheld a complaint by the newspaper and asked the FMS to hand over the contracts.\nNot true that public interest should prevail\nDr Borg Cardona is also arguing that a confidentiality clause in both contracts preclude their publication.\nBoth Ms Ciantar and Mr Gafà were given their public jobs without a public call and on the direct instructions of members of the government.\nIn Ms Ciantar’s case, her appointment was made by Health Minister Chris Fearne as a person of trust.\nShe currently sits on the national executive of the Labour Party’s women’s section – Nisa Laburisti – and also was campaign leader of Mr Fearne’s efforts to be elected deputy leader of the Labour Party.\nPreviously married to former Nationalist MP Jeffrey Pullicino Orlando, Ms Ciantar was given a remuneration of over €100,000 a year paid from public funds.\nNeville Gafà, until a few months ago a member of Labour’s national executive and a staunch party supporter, was given a contract as projects director at the FMS by Mr Fearne’s predecessor, Minister Konrad Mizzi on a person of trust basis.\nAlthough he was paid over €45,000 for his FMS job, Mr Gafà was seconded to the Office of the Prime Minister and worked in the customer care office on affairs which had nothing to do with the FMS.\nWhen Times of Malta contacted Mr Gafà at Castille and asked how come he was working at Dr Muscat’s office while receiving a salary from the FMS, Mr Gafà did not reply.\nA few weeks ago, after embarrassing news that Mr Gafà met various Libyan government ministers and a leader of a militia while on “a holiday” in Libya, Mr Fearne terminated his contract at the FMS.\nIt is not yet known where Mr Gafà is currently working and whether he is still employed by the government.\nThe Prime Minister had publicly contradicted his Deputy Prime Minister on Mr Gafa’s employment status stating that he was in the process of being transferred and not terminated.\nDr Muscat had also praised Mr Gafà for doing a good job.\n ", "comment_count": 87, "id": 1732}, {"keywords": "", "author": "", "article_body": "These are the main stories in Saturday's newspapers.\nTimes of Malta says the government has confirmed Mater Dei Hospital is operating very close to full capacity as it deals with a swine flu outbreak and an influx of patients with the seasonal influenza. In another story, it says police are investigating the reappearance of suspicious symbols marked on the facades of homes that they believe may be linked to an organised gang of burglars.\nThe Malta Independent says the Maltese government is to pronounce itself on plans for a possible no deal Brexit in the coming days.\nIn-Nazzjon quotes PN leader Adrian Delia saying there was a need for a serious investigation about where the people’s money was going.\nL-Orizzont says Malta was on track to register another surplus in finance for 2018.", "comment_count": 0, "id": 1733}, {"keywords": "", "author": "Claire Caruana", "article_body": "Mater Dei Hospital is operating “very close to full capacity”, the government has confirmed as the hospital deals with a swine flu outbreak and an influx of patients with the seasonal influenza.\nOn Friday, Times of Malta reported that more than 30 patients were being treated for the potentially deadly H1N1 strain of influenza – more commonly known as the swine flu. The number, sources have said, is expected to increase further in the coming days.\nThe sources, who spoke to the newspaper on the condition of anonymity, also said that there were currently no empty beds at Mater Dei since the hospital was also dealing with higher numbers of patients being admitted as a result of the seasonal influenza peak.\nBy Thursday, at least 18 patients from St Vincent de Paul Residence were suffering from the highly-contagious influenza, while a further 15 new cases were reported at Mater Dei in the morning.\nContacted about this, a spokeswoman for the Health Ministry confirmed to Times of Malta that “the hospital is operating very close to full capacity”.\nRead: Swine flu outbreak - what happens now?\n“The number of patients visiting the Accident and Emergency Department and requiring admission to a ward has been particularly high during the last five days. Staff in all areas of the hospital have been working around the clock to give the best possible service to all our clients,” the spokeswoman said.\nThere are currently no empty beds at Mater Dei\nShe also confirmed that “at some point  during the last few days” a small number of patients were kept for some hours at the Emergency Department until a bed was made available in appropriate wards.\nNo information on the number of patients who had to wait at the A&E department was supplied. The spokeswoman also did not specify for how long patients had to wait before being placed in “appropriate wards”.\nThe sources who spoke to the newspaper said that some had waited for over six hours before being placed in a ward.\nOn patients being moved from Mater Dei to other hospitals and facilities, the spokeswoman said that this was a “daily occurrence”.\n“For example some of the patients that are admitted to Mater Dei require rehabilitation after their acute phase. These are transferred to Karin Grech Rehabilitation Hospital. Similarly, Mater Dei works with other entities or private facilities that provide post-acute care support to patients so as to ensure a seamless care pathway that benefits most the individual,” she said.\nRead: When the flu turns into a pandemic\nOn the swine flu, the health ministry said in a statement on Friday that patients with the H1N1 virus that were currently at Mater Dei contracted the virus “from the community” and were admitted to hospital for the management of respiratory complications.\nThe strain H1N1 was also included in this year’s seasonal influenza vaccine offering protection to those vaccinated, the ministry said.\nUp to now there were some 85,687 persons who took up the flu vaccine. This is still available for free in all health centres.\n ", "comment_count": 76, "id": 1734}, {"keywords": "", "author": "", "article_body": "By 2018, €242 million of EU funds were invested in Malta’s infrastructure, security, creation of jobs, skills, and better standard of living.\nParliamentary Secretary for European Funds and Social Dialogue Aaron Farrugia said on Friday that the proper management of EU funds played a significant part in the economic success achieved by the country in recent years.\n“What this effectively means is that Malta invested all the funds allocated to it on time and will not be sending any funds back as stipulated in the automatic decommitment principle,” he said.\nHe stressed that this achievement would place Malta’s negotiating team in a stronger position to get a fair deal in the next Multiannual Financial Framework (MFF), for which the negotiations are expected to come to a close by autumn of this year.\n• The programmes for which the cumulative total financial target was reached are the Regional Development Fund (€104.8 million), the European Social Fund (€33.8 million), Cohesion Fund (€65 million), the European Agriculture Fund for Rural Development (€20.9 million), the European Maritime & Fisheries Fund (€5.9 million), Internal Security Fund (Borders) (€5.3 million), Internal Security Fund (Police) (€2.1 million) and the Asylum, Migration and Integration Fund (€3.4 million).\n• Key infrastructure projects iinclude the Kappara Junction, the Marsa Junction Super Structures, the Marsa-Ħamrun Bypass, significant investments in water, the regeneration of Lower Valletta, and the extension of the Xewkija Industrial Park in Gozo. Another significant investment was the recently opened National-Community Art Museum – MUZA.\n• Projects aimed at improving the standard of living include the regeneration of social housing units and the MCAST Campus Master Plan.\n• Soft funds were used on developing knowledge, skills, and competences of different segments of the population, through projects such as the One Tablet Per Child, the Access to Employment Scheme and the ENDEAVOUR Scholarships Scheme.\n• In security, major projects include the procurement of a new Offshore Patrol Vessel and the purchasing of a Passenger Name Record System among others.\n• The development of the Marsaxlokk breakwater is in hand,as well a training project devised specifically for fishermen, along with other schemes.\n• Millions of euros were also invested in the agriculture sector, including the modernisation of farms, purchase of equipment, regeneration of rural roads and rubble walls, and assistance for young farmers.", "comment_count": 20, "id": 1735}, {"keywords": "", "author": "", "article_body": "Opposition leader Adrian Delia has dropped a libel action against media house LovinMalta after the claims were dropped.\nLovin Malta had published an article saying that Dr Delia was going around with €500 notes \"that might be coming from donations made to the party\", a claim he denied.\n\"Lovin Malta has since tried to verify the claim made an unnamed PN MP. However, we have been unable to do so. In fact, there seems to be no evidence that Dr Delia is going around with €500 notes, nor that these might be coming from party donations,\" the media house said.\nThe PN said in a statement that it was fully in favour of freedom of the press but that the media should not allow itself to be used by third parties for \"character assassination\".", "comment_count": 12, "id": 1736}, {"keywords": "", "author": "", "article_body": "Updated 9.45pm\nRescue NGO Sea Watch has dispatched a vessel to a rubber dinghy believed to be sinking to the south of Malta, saying that there were already people floundering in the water, while the Italian Navy has also sent a vessel to the area and recovered some corpses.", "comment_count": 0, "id": 1737}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who had been acquitted of charges of incitement to racial hatred, after targeting a Maltese Muslim girl through a foul-mouthed post has been handed a suspended sentence by the court of criminal appeal.\nBrandon Bartolo, 28, had reacted to an article by social inclusion campaigner Sara Ezabe who had commented about a foreign court’s decision banning the hijab at the workplace. The accused was writing on the anti-migrant Għaqda Patrijotti Maltin’s Facebook page.\nMs Ezabe, a 21 year-old Muslim student who had founded the #RedefiningUs movement and who is also a commissioner of the National Youth Council in Malta, had contacted the police after reading racist comments made in her regard on Facebook.\nRead: Maltese anti-hate speech activist listed among Forbes Top 30\nMr Bartolo had resorted to foul language, saying among others “they’re (migrants) guests, they have to abide by our laws and if they don’t like it f… off back to your country,” thereby promoting a complaint by Ms Ezabe to the police.Some of the racist insults posted on Facebook.\nMr Bartolo was duly prosecuted, admitting in the proceedings, that the comments had been posted by him. The alleged victim was never summoned to testify in the proceedings before the Magistrates’ Court, nor was her report exhibited in the acts of the case.\nIn a judgment delivered in January last year, the court had concluded that the accused’s comments were to be analysed in context, in the light of other comments by third parties as well as the place where such remarks were made.\nWhile declaring that “the right of commentators to comment may surpass the limits of mediocrity, but never those established in the law,” the court had concluded that the accused had expressed his opinion on a previous post and that such an expression of opinion “did not result in damage, annoyance or offence to others.”\nYet, when handing down judgment on Thursday, upon an appeal by the Attorney General, the court, presided over by Madam Justice Consuelo Scerri Herrera, observed that “unfortunately, racism was a phenomenon that was rearing its head in several countries,” prompting the international community to pass laws so as to counter such offences which damaged the fabric of society.\nIn this case, no intention to insult needed be proved by the prosecution, the court said, adding that it sufficed to prove the publication of such comments which, in the mind of a reader of average intelligence, would lower esteem vis-à-vis those targeted by such comments.\nNor was there any need for the alleged victim to testify in such a case, the court continued, pointing out that the assessment of such comments was an exercise to be performed by the court itself.\nIn this case, there was no doubt that the comments had been posted by the accused, as admitted by the man himself. Nor was there doubt as to the “offensive nature” of his words which incited to violence and racial hatred, the court declared.\nEven the charge of misuse of electronic equipment had been proved since “computers and Facebook were not intended to be used to offend and insult others.”\nConsequently, the court upheld the appeal, revoked the judgment and declared the accused guilty condemning him to a six-month jail term suspended for two years.", "comment_count": 0, "id": 1738}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Three top executives at Italy’s second largest online gambling company, Malta-registered SKS365, left suddenly, the Times of Malta is informed.\nAs the Italian police and judiciary continue to probe suspicions of mafia money being laundered through a Maltese-registered gambling company, SKS365 announced that its CEO, Ian McLoughlin, its general counsel Angela Gemma and its chief financial controller, Aaron Meli, resigned.\nNo reasons were given for the sudden departure although a spokesman said they had moved to pastures new.\nThe Malta-registered company, operating through a licence issued by the Malta Gaming Authority, was last November implicated in a high-profile anti-mafia operation by the Italian police.\nA number of mafia bosses from southern Italian regions were arrested in connection with the running of illegal gambling operations across the regions, particularly Sicily, through the use of gaming parlours operating under the ‘Planetwin 365’ gambling mark, owned by SKS365 Malta Holding Ltd, registered two years ago in Swieqi.\nAccording to the Malta Financial Services Authority’s registry, the gambling company is owned by three Dutch companies, including one registered in the offshore territory of Curacao, who bought it after the activities that are being investigated\nThe ongoing investigations, which have not yet produced any convictions, are seeking to establish whether the Malta-registered company and another four Italian operators had their sites used to conduct money laundering by the mafia, processing over €4.5 billion in bets using laundered funds.\nThe Italian investigators accused the operators of “knowingly acting” as money-laundering vehicles for the mafia network connected directly to three criminal clans.\nIn a statement immediately following news of the Italian anti-mafia operation, SKS365 clarified that the police were investigating operations that were carried out before the company was bought by new owners.\nDutch investment firm Ramphastos had confirmed its full support and collaboration with the authorities in the fight against illegal gaming and made it clear the new owners of Planetwin365 had replaced all key managerial roles within the new set-up by new members of management that respected regularised corporate values.\nThis was also confirmed by the Italian judicial officials. The office of Reggio Calabria’s prosecutor’s office said that their investigations into SKS365 “concerned only the property/management that guided the company until 2017, before its sale to new owners, against whom no elements of responsibility have emerged”.", "comment_count": 14, "id": 1739}, {"keywords": "", "author": "", "article_body": "Work started on Friday to remove tons of illegally dumped construction material and abandoned structures from a large site in Ta’ Qali.\nThe direct action is being taken by the Planning Authority’s Compliance & Enforcement Directorate.\nThe site, which measures over 48,000m2, is adjacent to the Ta’ Qali National Park and within a recreational area frequented by many locals during the weekend.\n\"The area has not only been turned into an eyesore but has become dangerous and unsafe for the public,\" the PA said.\nDue to the large quantity of illegal material, the enforcement operation will be carried out over a number of days. Truck loads of this dumped material will be removed and transported to a licensed landfill. Machinery used in the concrete industry and other scrap material is also being removed.\nThe PA will then rehabilitate the site, and has already placed concrete barriers to seal off the site and make it inaccessible for trucks to enter and dump waste. The area is also being monitored by surveillance cameras.  ", "comment_count": 14, "id": 1740}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "A young Dutchman accused of killing his former girlfriend had moved into a small apartment metres away from where her body was found just days before the murder.\nThis fresh snippet of information emerged on Friday as the compilation of evidence continued against 22-year old Jelle Rijpma, a former boyfriend and work colleague of co-national Shannon Mak, whose lifeless body was found early one August morning in Triq il-Mastrudaxxi, Santa Venera, her neck slit almost from ear to ear.\nThe detail was revealed under oath by the landlady who had rented out her flatlet on Triq l-Istampaturi to the Dutchman, whose identity she confirmed when taking the witness stand today.\nRead: Shannon Mak's body was unrecognisable, court told\n“Jelle was living there for a few days,” the woman explained before magistrate Simone Grech. “He was recommended to me by a colleague of his. He came to me. He was there for less than 15 days.”\nAsked by prosecuting inspector Kurt Zahra to explain further, the witness confirmed that Mr Rijpma had approached her towards the end of July. “It was the third or fourth week of July. We had a sort of preliminary agreement,” the woman recalled, adding that she still had a copy of that agreement which she would willingly make available to the court.\nDuring Friday’s sitting, a Human Resources manager at Evolution Malta Limited, a local gaming company where both Mr Rijpma and Ms Mak had worked, was also summoned by the prosecution to confirm that both the accused and his former girlfriend had been employed by the company.\nAt the start of the sitting, the court delivered a decree authorising the transfer of a particular exhibit to a laboratory for DNA testing. This exhibit consisted in a piece of glass allegedly containing traces of blood.\nIn the course of Friday’s sitting, CID Inspector Fabian Fleri, who had testified in October about the identification process of the victim and the ultimate arrest of her alleged murderer, was asked to repeat his deposition on account of a technical hitch in the court’s recording system during the earlier sitting.\nThe case continues next month.\nInspector Kurt Zahra prosecuted. Lawyer Leontine Calleja was defence counsel. Lawyer Stefano Filletti appeared parte civile.", "comment_count": 0, "id": 1741}, {"keywords": "", "author": "", "article_body": "A dead protected duck was picked up from a nature reserve on Friday morning, \"probably\" forming part of a flock photographed earlier by the Parliamentary Secretary who is responsible for their wellbeing. \nSix shelducks forming part of a flock of eight had landed at Salina after were earlier observed flying over Valletta on Wednesday, Birdlife Malta said.\nBirdwatchers on site noticed that out of the flock of six resting at Salina, two shelducks appeared to be injured. One of them had a visible injury to its left wing while the other had blood on its right wing.\nThe Parliamentary Secretary took a picture of the birds.\nIronically, the flock of shelducks had been photographed by the Parliamentary Secretary for Animal Rights Clint Camilleri during a Cabinet meeting at Auberge de Castille on Wednesday. Mr Camilleri, who is himself a hunter, went on to post the picture on social media. Birdlife said the dead duck picked up on Friday was \"probably\" part of the flock captured flying by the parliamentary secretary.\n\n\n\nThe following day, only three shelducks were left at Salina, while in the following hours all the birds appeared to have left. On Friday morning, one of the injured shelducks was found dead in the water.\nIt was sent to the government vet to certify that it succumbed to gunshot injuries it sustained. \nShelducks are a protected duck species with various specimens still migrating through January, avoiding the colder winter further North in Europe. Natura 2000 sites and bird sanctuaries like Salina offer the necessary shelter for such species as they migrate.\nRead: Protected ducks 'massacred' at sea\nTwo days before the flock of shelducks landed at Salina, two similar ducks were found during a clean-up operation in Qajjenza. They were both dead. \nAnd in a separate incident, over 10 shelducks from a separate flock of 23 were shot down at sea. Though the Administrative Law Enforcement unit was immediately alerted, it was did not dispatch a sea vessel, allowing the culprits to have enough time to escape, Birdlife said.\nThe owner of the boat in question was identified, but it was not clear whether police gathered enough evidence to prosecute him. The \"massacre\" led BirdLife Malta to call on the government to close the hunting season at sea - but the proposal at Ornis Committee was voted down.", "comment_count": 84, "id": 1742}, {"keywords": "", "author": "Ivan Martin", "article_body": "Mediterranean governments on Friday pledged to cooperate in the war against human traffickers and called for efforts to counter the threat of racism and xenophobia.\nA declaration on the matter and other issues of concern was signed by the five Mediterranean countries of Malta, Italy, France, Spain and Portugal and the North African countries of Libya, Tunisia, Algeria, Morocco, and Mauritania during a summit held in Floriana on Friday.\nKnown as the 5+5 dialogue, the meeting saw Foreign Affairs Ministers from all these countries call for the applicable migration and human rights laws to be respected and for operations of the relevant national authorities both on land as well as by vessels at sea not to be hindered.\nThe plenary session. Photo: DOI\nMinisters also agreed on the importance of migration policies to be adopted on “evidence-based analysis and a balanced narrative” and said reinforcements were needed.\n“While the challenges raised by citizens’ concerns and perceptions about migration in countries of destination must be acknowledged and taken seriously, they must be balanced by messages that avoid any attempt of racism or xenophobia and the contributions of migrants and refugees to social, economic, scientific and cultural development,” the 11-page declaration signed on Friday reads.\nThe ministers also agreed that addressing the root causes of irregular migration required the intensification of efforts to eradicate poverty, create jobs, cope with the current and future impacts of climate change, enhance good governance, prevent and resolve conflicts, consolidate peace and counter terrorism.\nAddressing a press conference to mark the end of the meeting, Foreign Affairs Minister Carmelo Abela, who co-chaired the meeting, said the governments agreed that the solutions to this problem were multi-faceted. Improving the wellbeing of those who lived in the North African region was a good step towards tackling outward migration.\nCo-chair Algerian Foreign Minister Abdelkader Messahel told the Times of Malta that the link between economic measures and migration was clear.\nIllustrating this, he explained how in his home country tour guides used to take tourists on tours of the Sahel region in the desert. Today, these were instead working with human trafficking rings because they knew the area well and could find no other work. Finding employment solutions for these people could help fight trafficking in the area, he said.\nIt was solutions like this, he added, that needed to be agreed upon between countries in the region.\nOther matters raised in the declaration included the situation in Libya - in which the governments reiterated their support for the internationally recognised government there. The Middle East peace process, and the Sahel were also discussed.", "comment_count": 3, "id": 1743}, {"keywords": "", "author": "Keith Micallef", "article_body": "A unanimous declaration of support for Nationalist Party leader Adrian Delia by the administrative council followed a show of hands by the members, Times of Malta has learnt.\nSources said the statement was drafted after a lengthy debate on Wednesday evening, following which those present were first asked if they had any objections and, then, whether they approved the declaration.\n“Nobody raised their hands when asked if they were against or were abstaining,” the sources said.\nTimes of Malta sought official confirmation from the PN on the matter but no reply was received by the time of writing.\nContrary to what Dr Delia had said, the four-hour meeting focused almost entirely on his future at the helm of the party, the sources noted. “The approval of a group of local council candidates for next May’s election was just a formality,” they said.\nDuring the meeting, Dr Delia made a short presentation, denying all claims levelled against him regarding domestic violence, money laundering and issues related to his personal finances.\nThe four-hour-long meeting focused on his future at the helm of the party\nThough the long debate and explanations  by Dr Delia failed to quell certain doubts and concerns raised, even his most vociferous critics ended up toeing the party line and expressing their support, the sources said.\nAn administrative council member who spoke to this newspaper on condition of anonymity confided that he reluctantly endorsed the declaration because he felt that “trying to start a rebellion at this point in time would be political suicide”.\nHowever, the same member acknowledged that the decision not to rock the boat meant that, after the meeting, he faced a backlash from those who had pinned their hopes on him for the party to take some sort of action.\n“Calling for Dr Delia’s head, without having a plan on the way forward as to who would take over at least till May’s European and council elections, would have been madness,” he insisted. “Such a move would have meant going back to square one. While scoring points and garnering support with the PN leader’s critics, such gains would have been eclipsed by a backlash from his supporters,” the council member remarked.\nAdmitting he was tempted to call it a day and resign from the party, he told Times of Malta that doing so would be tantamount to capitulating. “For the time being, the only option is to wait till May’s elections and have another go but only if the PN did badly. A good result would kill any lingering dissent against Dr Delia unless fresh allegations crop up in due course,” he said.", "comment_count": 76, "id": 1744}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man was handed a 10-year effective jail term and a €25,000 fine after pleading guilty to his involvement in a cocaine-trafficking conspiracy two years ago. \nDavide Castillo Rafael, the holder of a Venezuelan passport, was facing compilation proceedings relating to the drug-trafficking conspiracy, as well as the importation and aggravated possession of cocaine, in November 2016.\nHowever, after a plea bargaining exercise between the prosecution and the defence, the accused admitted his guilt before the Magistrates’ Court last December, so that the case went before the Criminal Court.\nAfter taking cognisance of a joint application filed by the parties on December 20 and observing that the accused had a clean criminal record “with no trace of any contravention or crime,” the court, presided over by Madam Justice Consuelo Scerri Herrera, condemned him to a 10-year jail term and a €25,000 fine.\nA court-appointed scientific expert had confirmed that the accused had been in possession of 1.1kg of cocaine of 35% purity, with an estimated value of €75,824.\nThe court also ordered the accused to pay €4,273.70 by way of court expenses, further ordering the confiscation of the drug, as well as of all property, movable and immovable, of the accused.", "comment_count": 0, "id": 1745}, {"keywords": "", "author": "Claire Caruana", "article_body": "Students who applied for a grant under the tertiary education scholarship scheme are still awaiting selection results, despite the regulations saying courses should have started by the end of last year.\nSpeaking to Times of Malta on condition of anonymity, affected students said that while in previous years the results were published in September, this year’s deadline for submission of applications was moved forward to October.\nAccording to the scholarship regulations, published on the government’s website, students had to also submit a letter of acceptance from the University they planned to attend by September 5.\nYet, it has now emerged that the results have still to be released, with those unable to fork out the money for the course, especially those who were relying on the scholarship to attend a university abroad, having to either drop out or postpone their studies.\nIf a student decides to forge ahead with study plans, they risk not being selected for the scholarship, thus having to pay fees that often amounted to thousands of euros, one student pointed out.\nApart from course fees, the scholarship also offers “additional allowances”, including grants for those studying abroad, students having children as well as those who are married or who have a disability.\nIn a terse reply to questions by Times of Malta, a government spokeswoman said “the appeal stages of the process is still ongoing”.\nThe scholarship office would publish the results once everything was finalised, she added. Questions on what had caused the delay remained unanswered.\nStudents who tried to contact the government’s scholarships unit said they were told in December the results would be announced “in the coming days” but no additional information was given.\nAccording to the government website, the scheme is aimed at supporting “quality tertiary education” from MQF Level 7 (Master’s degree) upwards and “to seek to contribute towards the Maltese labour market with the right skilled individuals”.", "comment_count": 0, "id": 1746}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Magistrate Joe Mifsud played a song of a popular Maltese singer before delivering his final judgment in a criminal case to the amusement of legal operators, police officers and members of the public present.\nSome of those present inside the Gozo courtroom on Wednesday told Times of Malta they could not believe their eyes when the magistrate, sitting at the bench, used his tablet to play Mike Spiteri’s song before he proceeded to read out the judgment in which he quoted part of the lyrics.\n“We were all eager to hear the magistrate’s judgment on a case involving an alleged fight between two groups in Marsalforn. Just before he started reading the conclusions, the magistrate played the popular song Fejn tħobb il-qalb (Wherever the heart loves). When it reached the chorus he started reading his sentence,” one of those present said.\nAnother said those present at first thought the magistrate had pressed the wrong key on his tablet when they heard the music coming out from the direction of the bench. It was only when they realised the magistrate was following the song and making sure those present were also listening to the music and the lyrics that everyone started smiling and wondering what was going on, he added.\nThe reason why the magistrate decided to do so became clear when he quoted the lyrics of the song in his judgment.\n\nThe case involved an alleged fight sparked off by a love affair that went wrong. Dr Mifsud pondered over the way relationships could end, quoting the lyrics Fejn tħobb il-qalb jimxu r-riġlejn (Where the heart loves, there the legs walk).\nPointing out in his judgment that trouble brewed when parties refused to accept that a relationship had ended, the magistrate insisted that such a reality can have “serious consequences that bring a lot of pain, as stated by singer Mike Spiteri fejn thobb il-qalb jimxu r-riglejn”.\nThis episode, deemed “unprecedented” by court observers, was widely discussed in the corridors of the court in Malta yesterday. Legal operators who contacted Times of Malta expressed concern that such behaviour risked eroding the respect both the court and the judiciary should command.\n ", "comment_count": 56, "id": 1747}, {"keywords": "", "author": "", "article_body": "House prices in Malta increased by 3.1% in the third quarter of 2018, compared with the previous quarter, Eurostat said.\nIn a release on house prices, the EU’s statistical arm said that house prices, as measured by the House Price Index, rose by 1.6% in the euro area and by 1.5% in the EU in the third quarter of 2018, compared with the second quarter of 2018.\nWhen compared to 12 months prior, house price increases during the third quarter of 2018 were more significant, at 4.3% in both the euro area and the EU.\nAmong the member states for which data was available, the highest annual increases in house prices in the third quarter of 2018 were recorded in Slovenia (+15.1%), the Netherlands (+10.2%) and Ireland (+9.1%), while prices fell in Sweden (-2.1%) and Italy (-0.8%).\nCompared with the previous quarter, the highest increases were recorded in the Netherlands (+3.3%), Malta (+3.1%) and Croatia (+2.8%), while decreases were observed in Italy (-0.8%), Romania (-0.7%), Finland (-0.4%), Slovakia (-0.3%) and Hungary (-0.2%).", "comment_count": 34, "id": 1748}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 11.30am\nMediterranean countries were all in the migration crisis together and needed to find a solution together, EU High Representative Federica Mogherini said in Malta on Friday.\nSpeaking during the opening of the 5+5 meeting, Ms Mogherini who is the European Commission vice-President, said countries in the region faced many similar challenges, whether they be social, economic, or of a security nature. Many of these challenges required solutions that no one country could provide.\n“It is only natural that we would shape these answers together,” she said during an informal working breakfast to mark the opening of the day-long meeting.\nMalta is hosting the 15th Meeting of the Ministers of Foreign Affairs of the 5+5 Western Mediterranean Dialogue.\nThe 5+5 dialogue sees five European-Mediterranean countries; Malta, Italy, France, Spain and Portugal and the North African countries of Libya, Tunisia, Algeria, Morocco, and Mauritania, hold high-level talks across a spectrum of themes.\nDuring the plenary session shortly after the working breakfast, Ms Mogherini said the meeting was unique in that it saw countries that were destinations, points of transit, and points of departure for migration, all talking together.\n“We may speak different languages and follow different religions, but our interests on a number of matters converge,” she said.\nExperience, she said, had thought these countries that working together was the only way to find a lasting and effective solution.\nForeign Affairs Minister Carmelo Abela said the meeting, which Malta is co-presiding along with Algeria, was an opportunity for a frank discussion on pressing matters across the Mediterranean.\n“The Mediterranean remains at the essence of our external relations dossier, with the overall objective of bringing peace, stability, and sustainable growth in the region,” Mr Abela said.\nThe aim of the 5+5 dialogue, he said, was to secure closer cooperation between southern European and Maghreb countries.\nThe solutions, he said, would not only be north to south, but also north countries helping each other, and southern countries helping their neighbours too.\nThe Algerian Foreign Affairs Minister Abdelkader Messahel, who is the co-chair, said the main challenges that needed to be discussed were economic development, migration, climate change, and sustainable development.\nEconomic prosperity, he said, was pivotal to achieving solutions on all these.\nThe stark differences between northern and southern countries in the region, was a leading factor in the ongoing migration crisis, he said.\nLast week the government had said it hoped the meeting would be an opportunity for a “frank” exchange of views on important regional matters that were of mutual and common interest.\nThe situation in Libya, the Middle East peace process, and the Sahel, as well as issues such as migration and climate change are expected to be on the table today.\nThe delegations include the Secretary General of the Arab Maghreb Union, the President of the Anna Lindh Foundation, the Secretary-General of the Union for the Mediterranean, and the President of the Parliamentary Assembly for the Mediterranean as observers, along side foreign affairs ministers from all of the 10 countries.", "comment_count": 10, "id": 1749}, {"keywords": "", "author": "", "article_body": "Democratic Party leader Godfrey Farrugia has written to Commissioner of Public Standards George Hyzler requesting an investigation of all parliamentary backbenchers.\nIn a statement on Friday, PD said MPs' code of ethics was being taken lightly and nothing seemed to happen when it was breached.\nPD hoped that the Office of Public Standards would strengthen the integrity and enhance the nation’s trust in its MPs.\n“The duty of the backbench, which includes the non-executive members on the side of government, is to scrutinise the workings of the executive. Parliament is dysfunctional. We have a broken system to fix,” MEP candidate Martin Cauchi Inglott said.\nMEP candidate Anthony Buttigieg added the country cannot have the highest institution of the state carrying out its objectives by part-time MPs who depend on a salary which is boosted by the executive or government entities.\nMEP candidate Camilla Appelgren said a number of backbenchers had various conflicts of interest and that was why the environment was in such a poor state.\nWhile the Speaker had fostered a culture of an open parliament to society and made its administrative procedures autonomous from government, parliament was still hijacked by the dictated agenda of the executive.\nMoreover, standing orders required considerable fine tuning. These issues were further compounding the broken system where representative democracy was not delivering.", "comment_count": 4, "id": 1750}, {"keywords": "", "author": "Bertrand Borg ", "article_body": "Nationalist Party MP Jason Azzopardi has downplayed tensions between himself and party leader Adrian Delia, saying people were “making a fuss when I said nothing extraordinary”.\nDr Delia spoke directly about the MP during an interview on Net TV on Thursday, saying that Dr Azzopardi had some soul-searching to do.\n“If he really thinks that, then he must see whether his position within the PN is tenable,” the party leader said when asked about a cryptic Facebook post Dr Azzopardi had uploaded on Wednesday.\nIn that post, Dr Azzopardi had mused about the “advice” some “supposed opponents” were offering Dr Delia.\n“Have you ever heard in football, say, the Roma coach giving advice or defending his Lazio counterpart? Or the Manchester United coach defending/advising the Liverpool coach?” he asked his Facebook followers.\n\n“Of course not. Not unless they have a hidden agreement to safeguard their common interests...”\nDr Azzopardi shared that post a few hours after government consultant and Dr Delia’s self-professed “friend” Robert Musumeci told Times Talk that the PN leader had to act quickly and be decisive if he was to stymie ongoing dissent within his own party.\nOn Friday, Dr Azzopardi told Times of Malta that his football-themed Facebook post was directed towards “Labour loyalists”.\n“All I said was that the PN should make up its own mind. Advice from opponents is worthless,” he said.\nDr Azzopardi urged people not to misconstrue Dr Delia’s words, and insisted his party leader’s words had to be taken in context.\n“Adrian didn’t take it badly at all,” he insisted with Times of Malta.\n“He was quite clear in saying that it all depended on what I meant. I’ve just clarified that.”\nDr Azzopardi and Dr Delia have regularly failed to see eye-to-eye, with the PN MP having also been one of the biggest opponents to Dr Delia's PN leadership bid back in 2017. \n\nIn a post on Facebook, former Nationalist rebel MP Franco Debono said Dr Azzopardi was right.\nThere should be respect and cordiality between adversaries but it was abhorrent and weakened one considerably to take advice from them.\nFiorentina respected Milan but would not take advice from them, he said.\n ", "comment_count": 52, "id": 1751}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Reductions in travel time and vehicle emissions as a result of the planned Central Link road upgrade project will be largely cancelled out by increases in the number of cars in the coming decades, environmental studies show.\nAn environmental impact assessment, seen by Times of Malta, concludes that the €55-million project between Ta’ Qali and Attard will prevent total gridlock and “alarming” levels of emissions within the next 10 years.\nInfrastructure Malta says the project will halve travel time and improve air quality but data shows that, with thousands of additional cars added to the stretch of road in the same time period, the upgrade alone will not be enough to improve on the current state of affairs, merely to maintain the status quo.\nTraffic studies forming part of the EIA found that if the upgrade was not carried out, peak morning travel times would increase nearly three times over by 2030 and more than eight times over by 2045.\nRead: Three-quarters support Central Link project, minister says\nEven with the project in place, travel times will not be reduced below 2019 levels and will, in fact, increase marginally.\nSimilarly, air quality studies indicate that pollutant levels in the area will increase substantially if the project is not implemented – 40 per cent for particulate matter (PM10) and 30 per cent for nitrogen dioxide by 2045 – due to massive low-speed queues increasing fuel consumption.\nThe proposed network upgrade should not be considered as a final solution\nIf the upgrade is carried out, current emission levels, which already exceed threshold limits, will remain largely stable until 2045, the data shows. “With a present rate of 33 new cars being introduced on Maltese roads every day, the capacity of the upgraded roads will eventually be reached unless the availability and use of alternative/public modes of transport is amplified,” the study points out.\n“The proposed network upgrade should not be considered as a final solution for existing traffic needs in the area but should be seen in parallel with other initiatives that aim to encourage the use of alternative/public transport, leading towards long-term sustainable solutions.”\nRead: 1,400 submissions on controversial Central Link project\nThe assessment also references various scientific articles citing “clear evidence that new or expanded roads rapidly fill with displaced or induced traffic, offsetting any short-term gains in eased traffic flows”. If approved, the Central Link project will see the authorities rebuild 13 junctions, removing four traffic lights systems and adding over seven kilometres of new lanes along a 4.3-kilometre road corridor.\nAccording to the EIA, construction is planned to start in March and last 18 months.\nThe project also introduces facilities for alternative modes of travel, including safe pedestrian footpaths, improved bus lay-bys and the longest segregated cycle track in the Maltese Islands.\nOverall, the EIA concludes that the project’s beneficial impacts far outweigh its negative outcomes, particularly in terms of accessibility and air quality, as traffic bottlenecks will be reduced and the efficiency of the public transport system improved due to shorter travel times.\nWatch: Traffic in Mrieħel justifies Central Link project - Transport Minister\nIt notes that a large area of agricultural land – nearly the size of three football pitches – will be permanently lost to cater for the new and widened roads, although it adds that this is 57 per cent less than what originally envisaged in the 2006 local plan.\nLong stretches of rubble walls will be disassembled and reused as cladding in the border walls, while large amounts of soil will be excavated, causing “a permanent destruction of ecological features”, the study adds.", "comment_count": 34, "id": 1752}, {"keywords": "", "author": "", "article_body": "A 63-year-old man from Marsascala is in a critical condition after he was hit by a car in Għaxaq on Friday morning as he was crossing the road.\nThe police said the accident happened in Triq Dawret Ħal-Għaxaq at 6am.\nThe man was hit by a Ford Transit driven by a 64-year-old man from Gudja. He was taken to Mater Dei Hospital by ambulance where he was found to be in danger of losing his life.\nAn inquiry is being held.\nThe police are investigating.", "comment_count": 0, "id": 1753}, {"keywords": "", "author": "", "article_body": "These are the main stories in Friday’s newspapers.\nTimes of Malta says an outbreak of swine flu has been reported at Mater Dei Hospital and St Vincent de Paul Residence. In another story, it says a unanimous declaration of support for Nationalist Party leader Adrian Delia by the administrative council followed a show of hands by members.\nThe Malta Independent says a mega sports village hotel is planned for the abandoned Flower Power site.\nIn-Nazzjon says 32 workers at AstraCast have lost their job.\nL-Orizzont says foreign affairs ministers from the Mediterranean are in Malta for the 5+5 dialogue meeting.", "comment_count": 0, "id": 1754}, {"keywords": "", "author": "Claire Caruana and Matthew Xuereb", "article_body": "An outbreak of swine flu has been reported at Mater Dei Hospital and St Vincent de Paul Residence, Times of Malta has learnt. All corridors at Mater Dei are being taken up.\nRead: Swine flu outbreak - what happens now?\nSources said more than 30 patients were being treated for the potentially deadly H1N1 strain of influenza, more commonly known as the swine flu. Overcrowding at both the hospital and the home for the elderly in Luqa was acting as a catalyst for the strain to spread, even with a simple sneeze, the sources added.\nThey said there were at least 18 patients from St Vincent de Paul who were suffering from the highly-contagious influenza. A further 15 new cases were reported at Mater Dei on Thursday morning, Times of Malta was told, with the numbers expected to increase in the coming days.\nAccording to the sources, the first patients to be diagnosed with the swine flu came from the home for the elderly and, within days, a number of other patients were diagnosed at Mater Dei.\nRead: When the flu turns into a pandemic\nThe sources said efforts were under way to contain the outbreak by cordoning off areas where the swine flu patients were being treated. The hospital management vacated the endoscopy unit to use the space as a quarantine zone for swine flu patients, they added. However, they remarked, this was no easy feat because there were no empty beds at Mater Dei since the hospital was also dealing with an influx of patients suffering from bouts of the seasonal influenza.\nWe have run out of beds and are leaving patients on stretchers\n“We have simply run out of beds and we are leaving patients on stretchers now. To make matters worse, we are also running out of space, so all corridors are being taken up,” the sources said.\nWhen contacted, a spokeswoman for the Health Ministry said: “From the hundreds of samples analysed for the influenza virus, there were no cases of H5, that is bird flu. There are no cases of patients at Mater Dei Hospital who resulted positive to H5. Influenza cases for this season were influenza type A subtypes H1N1 and H3,” she noted.\nNo reply was forthcoming when the spokeswoman was asked to specify how many patients had been diagnosed and what precautions were being taken at hospital.\nA spokeswoman for the Family Ministry, which is responsible for the homes for the elderly, said the cases at St Vincent de Paul were “epidemiological strains of seasonal influenza as those in the rest of the Maltese islands and the rest of Europe”.\nHealth Ministry statement\nIn a statement on Friday, the Health Ministry said the influenza A (H1N1) virus, which emerged in 2009, was more of a threat then as it was a new virus and people had not been previously exposed to such a strain.\nSince then, it became the predominant circulating strain in many European countries for seasonal influenza. Since “herd immunity” for H1N1 in the community was high across Europe, the risk of a pandemic was now very much reduced.\nThe strain H1N1 was also included in this year’s seasonal influenza vaccine offering protection to those vaccinated. Up to now 85,687 persons took up the vaccine, which is still available for free in all health centres.\nPatients with H1N1 currently at Mater Dei contracted the virus from the community and were admitted to hospital for the management of respiratory complications, the ministry said.", "comment_count": 112, "id": 1755}, {"keywords": "", "author": "", "article_body": "Updated at 11.30am\nPrime Minister Joseph Muscat held a bilateral meeting with his Indian counterpart Narendra Modi during the Vibrant Gujarat 2019 summit in Ahmedabat, Gurjarat.\nDuring the meeting, the two premiers discussed several points of interest for the two countries including in the pharmaceutical sector, which, in Malta, already had a presence of Indian companies. \nSpeaking at the summit, Dr Muscat told his audience that several UK-based Indian companies are eyeing Malta as a potential European base for their operations. \nDr Muscat also pitched Malta as a centre of excellence within the blockchain sector and highlighted the country's strong economy in his pitch to Indian investors. \nEarlier, during his talks with Mr Modi, Dr Muscat discussed the Malta Medicines Authority's good reputation in India. The authority carries out inspections in India, especially in the state of Gujarat, which is known for its pharma sector, enabling companies there to receive a seal of quality helping them export  products.\nThey discussed the aviation sector and the possibility of cooperation with Air Malta, which planned to continue to grow and expand.\nThe main ideas included that Malta would be able to offer a place from where Indians would be able to reach other European and north African countries from different cities in different states in India which lacked connectivity.\nThe two premiers discussed the innovation sector and the information technology sector and the possibility of cooperation in the blockchain area.\nDr Muscat addresses the conference. Photo: DOI/Clodagh Farrugia O'Neill", "comment_count": 10, "id": 1756}, {"keywords": "", "author": "", "article_body": "Updated on Friday at 9.50am with MIA, Ryanair statements\nTwo passenger planes collided at Malta International Airport on Thursday night, though nobody on board was injured. \nRyanair said on Friday one of its aircraft was taxiing to stand at Malta Airport  when its winglet scraped the tail of a Turkish Airlines aircraft.\nBoth aircraft were under the instructions of Malta Air Traffic Control at the time.\nRyanair's Boeing 737 had landed while the Turkish Airlines Boeing 737 was bound for Istanbul.\nMIA said the impact between the wing tip of the Ryanair aircraft and the tail stabiliser of the Turkish Airlines aircraft resulted in minor damage.\n\nPassengers were seen leaving the Turkish Airlines aircraft shortly after the incident, witnesses said.\nEngineers were swiftly on the scene to establish the extent of the damage.\nRyanair said that to minimise delay, customers were transferred to a replacement aircraft, which departed to Bari shortly afterwards, while the minor damage to the wingtip was repaired.\nThursday's Turkish Airlines evening flight had still not left Malta on Friday at 10am and no estimated time of departure was being given.\n\nMIA said it was now supporting the authorities in their investigations. It regretted any inconvenience caused to passengers on board the aircraft but said the circumstances were outside its control.\nThe MIA website showing the flights delayed as a result of the incident.\n ", "comment_count": 55, "id": 1757}, {"keywords": "", "author": "", "article_body": "Although constitutional redress proceedings were an effective remedy in theory, they were not so in practice, the European Court of Human Rights ruled in two cases involving requisitioned properties in Paola and Qormi.\nIn the circumstances, it noted, such proceedings could not be considered as an effective remedy for the purposes of the European Human Rights Convention with regard to arguable complaints on requisition orders which, though lawful and seeking legitimate objectives, imposed an excessive individual burden on the owners.\nThe relevant provision of the convention says: “Everyone whose rights and freedoms as set forth in [the] Convention are violated shall have an effective remedy before a national authority notwithstanding that the violation has been committed by persons acting in an official capacity.”\nThe cases were about a 20th-century corner townhouse in Nazzarenu Street, Paola, and a property situated in an alley in St Francis Square, Qormi. The first had been requisitioned in April 1986 and the other in December 1992.\nThe four owners of the Paola house – Mary Grech, Christopher Mintoff, Stephanie Mintoff and Lilian Wismayer –instituted constitutional redress proceedings in May 2007, asking for the requisition order to be annulled, that the property be returned to them and that compensation be awarded for any damage suffered as a result of the occupation of the premises and the breach of their right to property.\nThe Civil Court (First Hall), in its constitutional competence, found, four years later, that the owners’ right to property had been violated. Being unable to annul the requisition order, as it had been withdrawn during the proceedings, the court ordered that the property should be returned free and unencumbered to the owners, who were awarded €7,535 as compensation.\nThe sums did not constitute adequate redress\nBoth the government and the owners appealed and, in 2014, the Constitutional Court found that the compensation awarded was too low. A few months later, the keys were returned to the owners and the property given back in a poor state. The owners claimed the house was not habitable, pointing their fingers at the government, and took their case to Strasbourg.\nThe European judges, including Chief Justice Emeritus Vincent De Gaetano, decided that the redress provided by the Constitutional Court did not offer sufficient relief to the owners.\nThe European Court awarded the owners a total of €13,400 in moral and material damages as well as to cover expenses.\nThe house in Qormi, belonging to Edward Zammit Maempel and Cynthia Zammit Maempel, had been granted on emphyteusis for 21 years to a couple in late 1986 and was eventually requisitioned on the last day of 1992 and allocated to another couple. No reason for the requisition was given.\nThe two owners of the house instituted a constitutional case in 2009 claiming their right to property was violated. The court decided in their favour in the first quarter of 2013 and both the government and the Housing Authority appealed.\nThe Constitutional Court confirmed that the requisition order violated the owners’ rights but revoked the first court’s order to evict the couple occupying the premises as well as the annulment of the requisition order. It also reduced the compensation due as moral damages from €50,000 to €12,000. The owners were also to pay one-fifth of the costs of the appeal.\nThe Constitutional Court commented in its judgment that constitutional redress proceedings should not serve as a replacement to ordinary remedies available to the owners. It observed that the owners took a long time before proceeding to protect their fundamental rights, about 17 years after the violation of their rights first occurred.\nThe European Court concluded that, under Maltese law, aggrieved owners could seek constitutional redress. However, when assessing whether such a remedy could prevent an alleged violation or its continuation, it found that although the courts of constitutional jurisdiction could annul an order and evict a tenant, it was clear from the case-law brought to its attention that in situations such as this case, where a lawful requisition imposed an excessive burden on an owners leading to a violation, the courts of constitutional jurisdiction, particularly the Constitutional Court on appeal, did not take such action.\nThe court also noted it had repeatedly found that the sums awarded in compensation by the Constitutional Court did not constitute adequate redress. Moreover, awards often failed to include moral damages and/or burdened owners with an order to foot the bill for the relevant costs.\nThe two owners of the Qormi house were awarded €33,000 in material damages and €3,230 in respect of costs and expenses.", "comment_count": 3, "id": 1758}, {"keywords": "", "author": "Keith Micallef", "article_body": "Pledges of a rebuilding of the Marsalforn breakwater are being taken with a pinch of salt as successive governments fail to deliver.\nThis sentiment was palpable a few days ago when restaurant owners and residents of the Gozitan seaside village watched helplessly as huge waves swept away everything before them along the seafront in tsunami-like fashion.\n“For the fifth consecutive day, Marsalforn seafront is in pitch darkness because, apart from the flooding, the waves are also damaging the street lighting system,” Żebbuġ deputy mayor, Daniel Cordina, wrote on his Facebook page.\nHis comment was backed by footage taken on Monday evening showing restaurant patrons with their feet immersed in water due to the waves gushing in at regular intervals.\nFinance Minister Edward Scicluna announced in the 2019 Budget speech in October this year would see “the conclusion of plans to finally rebuild the Marsalforn breakwater”.\nYet, this commitment was met with scepticism as, too many times in the past, promises to address the situation were made only for such pledges never to materialise.\nThe absence of a breakwater in Marsalforn is leaving the popular Gozitan locality completely exposed to the elements.\nPlans to reconstruct the breakwater go back to 2010, shortly after inclement weather completely destroyed an old jetty on the Qbajjar side of the bay, which had the dual function of safeguarding the port from northwesterly and northeasterly rough seas.\nIn 2011, the Ministry for Resources and Rural Affairs issued a proposal for public consultation on the strength of a number of studies. At the time, it had been proposed to construct a submerged breakwater across the bay, extend the small sandy beach to a width of 20 metres, build a sea wall along the west side of the bay to prevent further erosion and upgrade storm water channels.\nSeafront is in pitch darkness\nUnder this plan, work would have started in the summer of 2012 and completed the following year. For some reason, however, these plans remained on paper and were seemingly shelved following the change of government in 2013, even though the Labour Party had pledged to construct a breakwater.\nRestaurant owners who spoke to this newspaper but preferred to remain anonymous expressed frustration about the government’s lack of urgency on the matter.\n“We have now resigned ourselves to a situation whereby we are at the complete mercy of the elements,” they said.\nOn his part, Mr Cordina questioned the reason why the Gozo Ministry put the plan back on the drawing board, thus further delaying the project.\n“It seems money spent on the studies carried out in 2011 has gone down the drain,” he remarked.", "comment_count": 15, "id": 1759}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A father-of-12 was granted bail on Thursday after pleading not guilty to slightly injuring his wife in the course of one of the couple’s reportedly frequent quarrels.\nThe man, 46, whose identity is not to be revealed in the interests of his children, pleaded not guilty to the aggression as well as to having caused his wife to fear violence during the heated argument which allegedly took place in a Cospicua residence that was not the couple’s matrimonial home.\n“I love my family,” the man blurted out at the start of the hearing, interspersed with frequent questions and remarks. His primary concern appeared to be his 4-and-a half-year-old daughter whom he claimed to have nurtured from birth.\n“Her mother just gave birth to her. I brought her up, I take her to school every day and see to all her needs while her mother goes to work,” the father explained to the court, presided over by Magistrate Claire Stafrace Zammit.\nWhen briefing the court about the circumstances of the arrest, prosecuting Inspector Eman Hayman explained how the police, answering a call for help found the woman with a blooded face.\nLuckily however the alleged victim had only suffered slight injuries, the court was told.\n“I wish to make up. I love her. We’ve been together for 28 years,” the man replied when asked by the court whether he wished to make amends.\nHusband and wife had supplied conflicting versions of what happened, Inspector Hayman went on, saying that the woman had claimed to have been pushed down the stairs, whereas the husband had insisted that he had accidentally hit his wife while gesticulating during the argument.\nAfter hearing submissions on bail, the court upheld the request, making it very clear that the man was to strictly abide by the terms of a Protection Order, which meant that he was to steer clear of his wife and take up residence elsewhere.\n“What about my pets?” the man once again queried, showing reluctance in leaving his “dog, parrots and greenfinches” behind.\nThe court explained that the accused was to sign the bail book three times a week, abide by a curfew between 11pm and 7am and bind himself under a personal guarantee of €8,000. Moreover, he was to observe a Protection Order which, if breached, could land him with a maximum fine of €7,000 and/or a jail term.\nLawyer Graziella Tanti was legal aid counsel.", "comment_count": 0, "id": 1760}, {"keywords": "", "author": "", "article_body": "A man wanted by the police, David Liniker Micallef, 31,is missing\nHe is usually seen around Bilrkirkara.\nThe police said anyone having information about him should contact them on  21 224001 or 119. People may also call anonymously. ", "comment_count": 0, "id": 1761}, {"keywords": "", "author": "", "article_body": "The Nationalist Party has criticised the finance minister for having played down serious concerns on the Vitals Global Healthcare (VGH) deal.\n\"Rather than protecting the taxpayer as he is duty bound to do, Edward Scicluna yet again opted to protect his Cabinet colleagues, particularly Minister Konrad Mizzi,\" shadow finance minister Mario de Marco said in a statement.\nKonrad Mizzi, he said, had transferred three of Malta's state hospitals to a company, Vitals, that had no experience in the health sector.\nAfter failing to honour its obligations, Vitals sold the concession to another company making hundreds of millions of euros profits in the process, behind the people's back.\n\"Minister Edward Scicluna at the very least should have taken steps to suspend the sale of the hospitals, pending an investigation into the matter. However, as happened in the case of Pilatus Bank, Minister Scicluna played the three monkeys game and refused to talk or listen to the serious concerns being raised,\" Dr de Marco said. \nThis was why, he added, Opposition leader Adrian Delia has taken this matter to court in a bid to recoup the hospitals and to safeguard the interest of the Maltese taxpayers.", "comment_count": 27, "id": 1762}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Nationalist Party’s consultative committee on ethics and proper conduct was not reconstituted after Adrian Delia was elected leader, the Times of Malta has learnt.\nThis newspaper asked the PN for the names of the five members sitting on the committee, as stipulated by the party statute, and whether the allegations against Dr Delia were referred to it, but the questions remained unanswered.\nSenior PN sources said the members of the former ethics committee relinquished their post when the new leader was elected but they were not substituted.\nAccording to the PN statute, the ethics committee, which would operate as an internal disciplinary mechanism, is nominated by the administrative council every year on the recommendation of the party leader.\nThere were aspects which were not clear\nThe committee should consist of a chairman and four other members, including the administrative council president, an office currently occupied by MP David Stellini.\nThe last time the committee was functioning, it had investigated money laundering and other allegations against Dr Delia prior to the PN leadership race.\nAt the time it was chaired by former PN secretary general Louis Galea and included former ambassador Joe Cassar, since deceased, University professor Maryanne Lauri and accountant Franz Wirth. MP Karol Aquilina, who at the time was president of the administrative council, also sat on the committee as an ex-officio member.\nThe PN ethics committee had concluded that with regards to claims of money laundering about Dr Delia, there were aspects which were not clear and required further explanation. These aspects included an alleged Barclays offshore account in Dr Delia’s name in Jersey and the source of funds in the same account.\nEndorsing the committee’s conclusions, the PN administrative council had asked Dr Delia to reconsider his position while allowing the leadership election to proceed.\nDr Delia insisted the ethics committee had found absolutely nothing against him and accused PN officials of twisting the committee’s findings in an attempt by ‘the establishment’ to tarnish his name.\nWhat the PN statute says:\n• There should be a consultative committee for ethics and proper conduct composed of five members.\n• The president of the administrative council shall be an ex-officio member of the consultative committee. The administrative council should nominate a chairman and three other members on the committee on the recommendation of the party leader for a term of one year.\n• The chairman and members of the consultative committee should be nominated from among people enjoying the respect of the public and are known for their integrity and honesty. At least three of the committee’s members should be party members.\nivan.camilleri@timesofmalta.com", "comment_count": 59, "id": 1763}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta International Airport reached a record 6.8 million passengers in 2018, a 13 per cent increase on the previous year, the company announced on Thursday.\nThe results complete a 47 per cent increase over the last three years, with the airport projecting a further increase to 7.2 million in 2019.\nCEO Alan Borg said the airport’s growth meant it was significantly outpacing the average for airports in its size category, and followed a year in which its two main airlines, Ryanair and Air Malta, had both registered strong growth with several new routes.\nHe noted that the most popular markets - the United Kingdom, Italy, Germany, France and Spain - all experienced growth following the introduction of better connections in the last year.\nThe UK, which constitutes around a quarter of the total market, saw growth among both legacy and low cost carriers, for a total of 13.4 per cent.\nSpain, meanwhile, experienced a record growth of more than a third, following Ryanair shifting its Barcelona route to the city’s main airport and further connections by Vueling.\nMr Borg said nine airlines had either extended routes originally introduced in summer into the present winter season or else increased flight frequencies on certain routes.\n“While our 100-destination summer schedule was an important contributing factor to these numbers, it is encouraging to see that, for the fifth consecutive year, our shoulder and winter months have outpaced the peak summer months in terms of growth,” he said.\nSummer 2019, he said, would feature 18 new developments, including the start of daily flights to Doha by Qatar Airways.\nMr Borg said MIA would continue its infrastructural investment in 2019, including work on €20 million parking village project, which will introduce 1,300 covered parking spaces on the airport campus by 2020, as well as a recent call for the submission of design concepts for the €40 million SkyParks 2 development.\nMeanwhile, work is expected to continue on ambitious long-term plans to expand the terminal building, as well as the multi-million euro development of Apron 10, an additional aircraft parking area to increase the airport’s capacity.", "comment_count": 8, "id": 1764}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A former notary facing the prospect of a term behind bars over misappropriation and fraud, has had his conviction quashed on appeal over a defect in the format of the judgment. However, appeal proceedings will continue on the merits of the case.\nPierre Falzon, the 58-year old former notary who had voluntarily renounced his warrant in 2015, had been condemned to a five-year effective jail term and ordered to refund more than €100,000 to a number of former clients, after being declared guilty in October 2018.\nDr Falzon had faced 37 charges revolving around misappropriation of funds which never made it to public coffers.\nInvestigations had kicked off after the police were inundated with reports and complaints by clients of the former notary, claiming that deeds he had drawn up had not been registered, since the relatives taxes had never been paid.\nTwenty-seven cases of suspected misappropriation had eventually come to light, prompting the police to press charges.\nThose proceedings had resulted in a lengthy judgment – some 62 pages of evidence, juridical references and reasoning – wherein the Magistrates’ Court had concluded that the prosecution had proved its case, thereby declaring the accused guilty of misappropriation and ordering him to refund €112,769 to his former clients.\nYet upon appeal, the accused’s lawyers contended that the judgment was defective since the first court had failed to expressly indicate the charges upon which it pinned its finding of guilt.\nThe Court of Criminal Appeal, presided over by Madam Justice Consuelo Scerri Herrera, acknowledged the in-depth and detailed analysis of the charges conducted by the first court when explaining which of those charges had been proved and those in respect of which the accused was to be acquitted.\nHowever, in the final part of the judgment, the first court had failed to expressly indicate the charges upon which the accused was being found guilty, a failure which sufficed to vitiate the judgment.\nSuch a defect of form rendered the judgment null and made it obligatory for the Appeals Court to determine the merits of the case anew, declared Madam Justice Scerri Herrera, quoting the relative provision of the Criminal Code.\nFor this reason, the Court upheld the appeal, quashed the judgment and ordered the continuation of appeal proceedings on the merits of the case based on the grounds indicated in the appeal application.\nLawyers Michael Sciriha and Franco Galea were defence counsel.", "comment_count": 0, "id": 1765}, {"keywords": "", "author": "", "article_body": "The junction at Vjal il-Labour, next to the Mosta Technopark, is to be given a €1 million upgrade to reduce accident risks as a number of roads converge in the area.\nThis Infrastructure Malta project includes the construction of a new roundabout to facilitate safer connections between Vjal il-Labour, to and from Naxxar, Triq Franġisku Pisani, towards the Santa Margerita area of Mosta and Triq l-Awstralja, in a nearby residential area of Naxxar.\nThe new junction will help reduce collision risks for road users turning to or from these residential and arterial roads.\nThe junction had claimed the life of motorcyclist Johanna Boni, who was crushed by a cement mixer as she was riding her Kawasaki ER6N to work one morning two years ago.\nInfrastructure Malta will also introduce three new pedestrian crossings, footpaths and pavements to help pedestrians walk through this busy junction. The project also includes new boundary walls and a new street lighting system. The new design of the roundabout junction will also incorporate a landscaped area with several new trees. As part of the ongoing works, the existing electricity and telecommunication services distribution networks in this area will be replaced and upgraded as well. Overhead lines on poles in the area will be removed once the new underground networks are in place.\nBeneath the new roundabout, Infrastructure Malta is also building a new reservoir collecting rainwater from the area. A new storm water culvert is also being developed to collect surface runoff rainwater from Vjal il-Labour, and reduce flooding difficulties. This culvert will be connected to the underground tunnel system built several years ago to collect rainwater from different localities.\n\nTo ensure the safety of workers and road users, part of Triq Franġisku Pisani, between Vjal il-Labour and Triq il-Ħtajriet, will be closed on Friday morning until the ongoing works are completed. Road users travelling through this road from Mosta or Naxxar to get to Vjal il-Labour will be diverted to an alternative route through Triq il-Ħtajriet.\nAccess to and from Vjal il-Labour from Triq Valletta and Triq Mosta, the two roads connecting Lija and Mosta, will remain open in both directions. Residents of Triq l-Awstralja and other nearby roads are encouraged to follow the signposted diversions to reach Vjal il-Labour, until the project is completed.For more information or for assistance, contact Infrastructure Malta on 2334 1000 or info.im@infrastructuremalta.com.", "comment_count": 14, "id": 1766}, {"keywords": "", "author": "", "article_body": "The Armed Forces of Malta has awarded a contract to an Italian shipbuilder for the construction of its biggest patrol vessel to date.\nThe building of the new 75m offshore patrol vessel, which will have pennant number P71, will start in the coming weeks.\nThe vessel has been designed and is to be built to Maltese requirements by Cantiere Navale Vittoria. Commissioning is expected in the second half of next year. The project cost is some €35m, of which €26m will be contributed by the EU.\nBrigadier Jeffrey Curmi, commander of the AFM, said the requirement was for a vessel with more endurance, better sea-keeping and better living conditions for the crew.\n\"Furthermore, we wanted this new Offshore Patrol Vessel to have improved life-cycle costs in order to ensure that its operations could be sustained in an efficient and effective manner along the years, including better fuel consumption and maintenance costs.” \nThe new vessel will have a beam of 13m and a draught of 3.8m. Displacement will be 1,800 tons.\nIt will have two engines and two propellers and will be capable of operating and refuelling a helicopter from its flight deck, although it will not have a hangar.\nThe new patrol vessel will eventually replace the 65.2-metre former Irish Navy P62, which was handed to the AFM in 2015. \nThe AFM's fleet also includes a 53-metre modified Diciotti class offshore patrol vessel with pennant number P61. It was delivered to the AFM in 2005 and two years ago underwent a €7 million refit including replacement of its engines.", "comment_count": 14, "id": 1767}, {"keywords": "", "author": "", "article_body": "Attempts have been made to hack Adrian Delia's Twitter account, the Nationalist Party said on Thursday.\nIt said attempts were made from different parts of Europe by unknown persons.\nImmediate action was taken to thwart them.\nThe PN said this was the latest of a series of attacks on the Nationalist Party leader and it was clear that such malicious attacks were coordinated.\n\"This cyber attack was to be carried out at a time when the PN leader was speaking strongly about the way the government was giving public land for speculation and for construction and as he was speaking about the sale of the three hospitals.\"\nThe party said Dr Delia was determined to continue defending the rights of the people.\n ", "comment_count": 13, "id": 1768}, {"keywords": "", "author": "Edwina Brincat", "article_body": "One of five men arrested during a raid at Marsa at the weekend, has been remanded in custody.\nJosef D’Amato, a 24-year old Marsa resident, pleaded not guilty on Thursday to trafficking cocaine, heroin and cannabis, as well as to possession of the drugs under circumstances indicating that the drugs were not for his own personal use.\nThe man was further charged with breaching earlier bail conditions.\nHe was one of five suspects arrested in last Sunday’s raid carried out by members of the Drugs Squad, the Special Intervention Unit, the Dogs Section and the District Police on stables in Triq it-Tiġrija.\nThe court, presided over by magistrate Claire Stafrace Zammit, remanded the man in custody.\nLast Tuesday, another man arrested in the same raid, 34-year old Lee Jonathan Borg, was handed an 8-month effective jail term and a €500 fine after pleading guilty to similar drug-related charges upon his arraignment.\nInspector Mark Anthony Mercieca prosecuted. Lawyer Alfred Abela was defence counsel.", "comment_count": 1, "id": 1769}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Proceedings over drug-related charges against a now 61-year-old man have been declared time-barred by a Magistrates’ Court, 34 years after they started.\nRaymond Walsh had been 26 when charges were first instituted against him in April 1984 over the alleged possession and cultivation of cannabis after a search at the man’s Sliema home.\nDuring the search, officers had discovered a small potted cannabis plant, cannabis seeds, a small set of weighing scales and other drug paraphernalia.\nScientific experts had reported that some 1,600 cannabis seeds, weighing 19.8 grams, had been handed over to them for testing.\nFollowing a sitting on June 20, 1984, the accused never appeared in court, prompting an arrest warrant in August that same year. But the warrant could not be enforced since the accused had absconded from the island.\nThirty-four years later, the man was traced and brought back to Malta to face justice in terms of an extradition request originally issued in December 1984.\nWhen proceedings continued before the court, presided over by magistrate Caroline Farrugia Frendo, it was observed that as the law had stood prior to 2002, prescription would continue to run in respect of pending cases. The law has since been changed in this respect.\nHowever, as the law stood in 1984, the prescriptive period of two years was interrupted when the arrest warrant was issued, only to run afresh.\nIn spite of a request for Mr Walsh’s extradition in February 1985, the court stated that it had received no evidence that such proceedings had ever kicked off or followed up, nor that there had been another arrest warrant in the accused’s regard.\nConsequently, declaring the criminal proceedings to have been time-barred since February 1987, the court threw out the case.\nLawyer Stefano Filletti was defence counsel.", "comment_count": 0, "id": 1770}, {"keywords": "", "author": "Ivan Martin", "article_body": "Farmers who refused to take precautionary measures risked pesticide poisoning, according to agriculture expert Malcolm Borg.\n“Just like in other professions, there are amateurs and professionals. Farmers who do not follow the safety precautions will be at risk when spraying pesticides,” he said.\nMr Borg, who heads the farmers’ lobby Għaqda Bdiewa Attivi, was contacted after Times of Malta reported on Wednesday that more than a dozen people had been treated for overexposure to pesticides in the air over the past five years.\nAccording to the National Hospitals Information System, 13 people required medical treatment at Mater Dei Hospital between 2013 and 2017 for a variety of symptoms linked to overexposure to pesticides.\nRead: Excessive pesticide levels land 15 farmers in court\nMr Borg said farmers undertook training courses on pesticides and were instructed to always wear protective masks. It would appear, however, that a few reckless farmers were not heeding the authorities’ warnings and poisoning themselves in the process.\nRespiratory physician Martin Balzan said cases of organo-phosphate poisoning were not common but were taken very seriously at the State hospital. “The chemicals in pesticides can be highly toxic if inhaled in large quantities,” he said.\n“In a nutshell, they can cause paralysis of the respiratory muscles and system, leading to serious problems.”\nThe figures about the cases of exposure, which were tabled in the House by Health Minister Chris Fearne following a parliamentary question by Opposition environment spokesman Jason Azzopardi, show they ranged from one-offs to acute sufferers.\nRead: Most overused pesticide linked to brain conditions in children\nDr Balzan said the acute cases usually consisted of farmers who had been exposed to the chemicals over years and not taken the necessary precautions.\nPatients treated by emergency response teams sent to farms or nearby homes but not taken to hospital were not included in the data provided. Information on the number of cases last year was still binge compiled by the authorities.\nJeffrey Bonnici, from the hospital’s casualty department, said that although only a few cases were known to be reported every year, it was rather difficult to speak about chronic cases.\nFruit and vegetables sold in Malta are regularly among the worst scorers in the EU when it comes to excessive pesticide levels.\nAccording to the European Food Safety Authority, more than one in 10 local greens taken to the lab in 2016 were sprayed with chemicals over the legal limit.\nThe European average was five times lower.", "comment_count": 8, "id": 1771}, {"keywords": "", "author": "", "article_body": "Activists supporting the call for justice following the assassination of Daphne Caruana Galizia have found a way to leave their mark at the Great Siege monument by attaching padlocks to the surrounding fence.\nFor the past year, all the candles, plants and photos left at the site have been cleared away almost immediately, over 200 times. Just hours after the monthly vigil on Wednesday, the tributes and calls for justice were once again cleared up. The issue has even ended up in court, and has generated a number of aggressive outbursts.\nRead: Daphne portrait returned to Great Siege Monument, hours after official ceremony\nRead:Caruana Galizia activists incensed as Great Siege monument is blocked for 'restoration'\nRead: Another layer of defence added to Great Siege Monument\nBut the activists from Occupy Justice and il-Kenniesa, who held their monthly vigil in Valletta on Wednesday to mark the 16th month since the gruesome murder also left their messages on padlocks attached to the fencing around the monument.\nOne  activist wrote on Facebook: \"Shout out again to Il-Kenniesa, padlocks are a brilliant idea and there are so many creative things that have been done to them. All tributes from yesterday's vigil are gone. This is now #daphnecaruanagalizia#occupyjustice.\"", "comment_count": 215, "id": 1772}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A heated argument between two groups last summer at Marsalforn over a relationship that had fizzled out prompted a Magistrates’ Court to deplore such ‘time-wasting’ proceedings, while quoting a local songwriter who sang about the workings of the heart.\nSteven Vella, 27, Adrian Vella, 21, and Jason Pace, 24, all three from Gozo, had ended up in a heated altercation with a group at a Marsalforn car park one July evening.\nA common factor linking the two factions had pointed in the direction of a young woman and the argument appeared to have sprung from a relationship which had broken down.\nShaun Farrugia, a 22-year-old San Ġwann resident, forming part of the group, was also separately charged over his alleged involvement in the same incident.\nWhile concluding that the prosecution had failed to prove the accusations of breach of peace, slight injuries and voluntary damage to third party property in respect of the three Gozitan men, the court, presided by magistrate Joseph Mifsud, remarked that the courts were not to be reduced to a ‘nursery school’ where parties sought to solve such disputes at the expense of precious time lost for the courts and the police.\nPondering over the way relationships could end, magistrate Mifsud cited lyrics from local singer Mike Spiteri who sang Fejn tħobb il-qalb jimxu r-riġlejn, pointing out that trouble brewed when parties refused to accept such a reality and serious consequences arose when third parties became involved.\nThe three co-accused were cleared of all charges, save for one minor charge and were each given a reprimand and admonition.\nIn the other case, Mr Farrugia was acquitted of having allegedly harassed the other three men, pushing two of them in the scuffle.", "comment_count": 0, "id": 1773}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Pietà local council decided unanimously to oppose the massive development project proposed in the locality and is raising a petition objecting to it.\nPart of the proposed development lies on a Grade 1 scheduled site, according to the National Protective Inventory for the Maltese Islands.\n“We discussed it at council level and decided to oppose it and file as formal objectors. We are also circulating a petition among residents and other people who love Malta’s heritage,” mayor Keith Tanti said on Wednesday.\nThe proposed project will see the demolition of two villas and a farmhouse and the building of a residential block spread over six floors with underlying shops and garages in a spot adjacent to the Fatima church.\nDevelopment is totally out of context with the rest of the road\nThe applicant, Stephen Falzon, is proposing to demolish Villa Gauci and The Orange Grove as well as a dilapidated farmhouse in Triq Santa Monika and Triq id-Duluri to construct an office, three retail outlets, 114 one, two and three-bedroomed apartments, including penthouses, a botanic garden, a communal pool and 44 garages over three levels, 25 car spaces, an electricity substation and a refuse area.\nThe petition being raised by the council says that the scale and design of the proposed development is “totally out of context” with the rest of Triq Santa Monika and, therefore, goes against the principles of the Strategic Plan for Environment and Development.\nIt notes that the Planning Authority has already refused another three proposed developments in the same street because they were incompatible with the context of the road.\nThe bungalow and the villa, although not scheduled, have become iconic buildings in Pietà and should be restored and retained within the setting of the scheduled gardens, the petition adds.\nIt complains that the proposed development will increase the parking problem in the area, noting that 44 garages and 25 parking spaces are not enough for the 114 apartments being proposed.", "comment_count": 14, "id": 1774}, {"keywords": "", "author": "", "article_body": "A 56-year-old woman from Kalkara was seriously injured on Wednesday when she was hit by a car in Żabbar.\nThe police said the woman was hit by a Toyota Vitz that was being parked in Triq in-Nevew at 6pm.\nThe car was being driven by a 28-year-old woman from Żabbar.\nThe victim was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1775}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says that according to Eurostat, a quarter of those aged over 65 are at risk of poverty, the highest rate in more than 10 years. In another story, the newspaper says all Nationalist Party MPs bar one were on Wednesday tight-lipped when asked to publicly declare if embattled leader Adrian Delia still enjoyed their trust in the wake of allegations levelled at him.\nBoth The Malta Independent and In-Nazzjon says the PN administrative council has declared unanimous support for Dr Delia.\nL-Orizzont leads with a story on the industrial actions the General Workers' Union has ordered at Astracast.", "comment_count": 0, "id": 1776}, {"keywords": "", "author": "", "article_body": "Updated 12pm with BirdLife statement\nThe season for hunting at sea will remain open until the end of January in spite of Birdlife Malta's plea to the Ornis Committee following a \"massacre\" of protected ducks.\nThe shooting down of the ducks took place while the Ornis Committee meeting was in session on Wednesday.\nBirdLife said over 10 of these protected ducks from a flock of 23 were observed being gunned down.\n\"Although the culprits escaped, the owner of the boat in question was identified and investigations are ongoing. Photos and footage of this illegal act were collected,\" it said.\nBirdLife Malta requested that Ornis recommends on the spot the closure of the hunting season at sea but the motion put forward was voted down.\nThe hunters’ federation said in a statement the BirdLife proposal would have constituted a collective punishment which was in itself illegal, as were the three similar actions in recent years.\nBirdlife’s proposal to the Ornis Committee was shot down thanks to the votes of the hunters’ federation, the three government representatives as well as with the abstentions of the Environment Resources Authority representative and chairman, the federation said.\nIn spite of the rejection, BirdLife said it is nonetheless appealing to the government to take action and \"show for a fact that the rampant illegalities are not tolerated, by closing the season\".", "comment_count": 9, "id": 1777}, {"keywords": "", "author": "", "article_body": "All Nationalist Party MPs bar one were on Wednesday tight-lipped when asked to publicly declare if embattled leader Adrian Delia still enjoyed their trust in the wake of allegations levelled at him.\nThis wall of silence was put up despite constant leaks within the parliamentary group about what some elements within are describing as the “PN’s winter of discontent”.\nNone of the MPs who had previously confided to Times of Malta their lack of confidence in Dr Delia were ready to go on the record when approached on Wednesday.\nThe party said last night the administrative council, which includes some MPs, unanimously expressed confidence in Dr Delia.\nThe PN leader has been facing calls to resign for a number of weeks following allegations of domestic violence, money laundering investigations and issues related to his personal finances.\nSo far, the only pronouncements made on the matter were by PN executive committee president Mark Anthony Sammut and MEP candidate Michael Briguglio who called for an internal debate within the party structures.\nNo date has been set yet for the next parliamentary group meeting amid internal criticism that Dr Delia was trying to avoid confronting his own MPs in an attempt to quell a “rebellion”.\nTimes of Malta was told last week a petition was being circulated among Nationalist MPs to secure enough signatures to force Dr Delia to step down.\nHowever, the momentum behind the move appears to have faded because nothing of the sort materialised so far. This fuelled comments that Dr Delia’s critics had opted to sit on the fence rather than stand up and be counted.\nIt was against this background that Times of Malta on Wednesday asked each Nationalist MP, its three MEPs and the two Democratic Party MPs whether they had confidence in Dr Delia as Opposition leader.\nThe only clear response received by the time of writing was from Mario Galea who expressed his full support to Dr Delia.\nThe PN’s winter of discontent\nThe majority did not reply at all.\nFormer Opposition leader Simon Busuttil replied with a “no comment” as did Stephen Spiteri, who said such an issue had to be discussed at party level.\nMarlene Farrugia and Godfrey Farrugia were the only Opposition MPs who said they had no confidence in Dr Delia.\nIronically, they were elected on the PN ticket under the defunct Forza Nazzjonali coalition agreement.\n“I did not have confidence in him from the day he called Daphne [Caruana Galizia] a biċċa blogger. That comment already showed contempt for free expression,” Marlene Farrugia said.\nDemocratic Party leader Godfrey Farrugia pointed out he had declared losing trust in Dr Delia prior to the domestic violence allegations that had surfaced around Christmas.\nThe party’s administrative council on Wednesday unanimously expressed confidence in Dr Delia, expressing its support and condemning “the coordinated and malicious attacks” against him and the party, the PN said last night.\nDr Delia said on his way to the meeting earlier he believed he still enjoyed the council’s support, adding he had not been told anything that could indicate otherwise.\nThe PN deputy leader for party affairs, Robert Arrigo, said the allegations about Dr Delia were not on the agenda.\nWhen asked whether he thought Dr Delia still enjoyed the backing of the administrative council, David Agius, the party’s deputy leader for parliamentary affairs, replied: “Now we will speak and we shall see.”\nMP Kristy Debono said she believed Dr Delia did have the committee’s support.\nShe said the matter was “definitely” not on the agenda though it could be raised by a committee member.", "comment_count": 113, "id": 1778}, {"keywords": "", "author": "", "article_body": "Three banners depicting three crumbling pillars of democracy were unfurled opposite the parliament building in Valletta on Wednesday evening by activists of #occupyjustice who were marking the 15 months since the assassination of  journalist Daphne Caruana Galizia.\nThe banners showed three collapsing columns symbolising the executive (the government); the legislature (parliament) and the judiciary (law courts).\n“With each day that passes, we look around us and we see that the very foundations of our democracy are being heavily eroded by corruption and the deep-set culture of impunity”, #occupyjustice said.\nIt said the government was actively supporting corrupt practice. Parliament, instead of upholding the rights of freedom of speech, was revelling in the 'bullying tactics of the government MPs and an ineffective navel-gazing opposition,' with both sides trying to shut up anyone who questioned them.\nThe law courts had also let the Maltese nation down when Mr Justice Giovanni Grixti declared that he could not consider the Panama Papers as legal grounds for an inquiry to investigate Minister Konrad Mizzi and the Prime Minister’s Chief of Staff Keith Schembri, because the Panama Papers were obtained by international journalists by hacking. \n\"It is very clear that this country is not functioning as it should, and that the erosion of democracy is happening right under their watch,” #occupyjustice said.\nFifteen months after the murder of Daphne Caruana Galizia there was 'not even a semblance' of a search for an answer, the group said. ", "comment_count": 42, "id": 1779}, {"keywords": "", "author": "", "article_body": "Updated - Adds GRTU statement announcing deadline  - The GRTU has set a deadline for the end of this week for the conclusion of talks with the government on its demand for a raise in the profit margins of petrol station owners from the sale of fuel.\nThe decision was taken after the government said it had rejected the claim made by the association but has made an alternative proposal.\nThe station owners, represented by the GRTU, are calling for a raise in their margins in view of improvements they need to make to their establishments.\nThe GRTU said that should no agreement be reached by the end of this week, it would call a general meeting of the petrol station owners on Monday.\nThe GRTU warned last week that fuel stations would stop operating unless an agreement was reached over an increase in their margin of profit.\nIt said that talks with the government have been dragging on since 2014, and operators are expected to refurbish fuel stations by next year – an expense that can reach half a million euro.\nCEO Abigail Mamo told the Times of Malta that in 2011, the GRTU had presented the government with a study carried out by independent auditors about the increase, in cents, in the margin of profit for fuel stations.\nThe last increase, which was a marginal one, was made nine years ago, she noted.\nIn a statement on Wednesday, the government said talks had been held between Energy Minister Joe Mizzi and a GRTU delegation. \nIt pointed out that in 2011 the Resources Authority had allowed a raise in profits from the sale of fuel as long as the station owners covered investments in their stations up to 2020.\nThe government said it could not accept the GRTU's demand as the price of fuel would rise for consumers beyond the international price.\nIt said, however, that it had proposed a raise in the profitability margin beyond that decided in 2011 in a way that would not, at the moment, impose a burden on motorists.\nNo details of either proposal were given, but the government said it remained open for further talks.\n ", "comment_count": 28, "id": 1780}, {"keywords": "", "author": "", "article_body": "Updated 9pm with council's statement, new video \nThe Administrative Council of the Nationalist Party said on Wednesday its members had unanimously declared their backing for leader Adrian Delia.\nThe council also condemned what it described as \"coordinated and malicious attacks being made against Dr Delia and the party.\" \nThe council's statement was read out by PN general secretary Clyde Puli at the end of a four-hour meeting. He said the grassroots had spoken and from now on, it was business as usual in the PN. He did not take questions, including whether allegations against Dr Delia had been discussed. \n\nBefore the council's meeting, Dr Delia told reporters that his personal issues were just that, and they should not be a concern to his party colleagues for as long as they did not impinge on his duties.\n\"My personal issues are certainly not impinging on my duties. I am working every day, harder and with more commitment, and there should therefore be no concern for those around me,\" Dr Delia said in reply to questions.\nHe said he believed he enjoyed the full support of the council and no one had told him otherwise.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down\nAsked when the PN parliamentary group would be convened again, Dr Delia said the group met regularly according to issues raised in parliament and when matters need to be discussed in detail such, citing the last meeting on December 27, which was called after the government, over the Christmas period, tried to dispose of a large tract of land by stealth. He did not know when the group would meet again.\n\nTimes of Malta reported on Tuesday that the PN's executive committee is to meet on Thursday to discuss allegations being made against Dr Delia.\nAllegations of domestic violence were made by his wife in separation proceedings.\nA defiant Dr Delia has vowed to stay, branding the accusations part of a plan to oust him by exploiting “private life” issues.\nIn its statement on Wednesday, the Administrative Council also said that it had a number of new candidates approved for the local council elections.\n\n ", "comment_count": 48, "id": 1781}, {"keywords": "", "author": "", "article_body": " \nThe owners of the Gianpula nightclub were fined on Wednesday for playing loud music which disturbed people living in Rabat, Tal-Virtu' and Dingli five years ago.\nThe court fined Roger Degiorgio and his son Matthew €120 each. Under Maltese law, playing loud music which disturbs the neighbours is considered as a contravention not a crime.\nThe case goes back to June 23, 2013 when complaints were made to the police about loud music from the establishment.\nThe accused had been acquitted by the Magistrates' Court which said that it had not been proven that the music was disturbing the neighbours. Only one person was called as a witness, the court had observed. Furthermore, was also not proven to the first court that the Marrakech disco, where the music was allegedly being played, formed part of Gianpula.\nThe Attorney General filed an appeal.\nIn its considerations, the Appeals Court said the establishment was licensed to open up to 4am but this did not mean it could play loud music until that time.\nThe court said the police investigations showed that loud music was being played at the establishment on the date and time of the complaints. The music could be heard at Tal-Virtu', Rabat and Dingli.\nThe police had carried out a thorough investigation and a police constable had testified that the music was so loud as heard at Tal-Virtu, it was as if they were on the roof of the disco.\nThe Appeals Court, therefore, disagreed with the Magistrates' Court that there was insufficient evidence about the music disturbing the neighbours. \nThe court said that although the Gianpula owners argued that their establishment was surrounded by fields, the law did not specify a necessary distance from residences and the houses at Rabat at Tal-Virtu had to be considered as neighbours who should not be disturbed in the hours reserved for rest.\nThe court was presided by Madam Justice Edwina Grima.", "comment_count": 0, "id": 1782}, {"keywords": "", "author": "", "article_body": "An Italian man is €1,000 out of pocket after having threatened and insulted a police inspector and a sergeant.\nDavide Demuro, a 39-year-old Sicilian, got into an argument at the airport on Tuesday after arriving late and finding his boarding gate closed, thus missing a flight.  \nOn Wednesday he admitted the charges brought against him in court and was sentenced to a three-month prison term suspended for a year and a fine of €1000.\nInspector Silvio Magro prosecuted.", "comment_count": 3, "id": 1783}, {"keywords": "", "author": "", "article_body": "Brexit is a soap opera that has become rather dreary, Labour MEP, former prime minister and author of novels Alfred Sant told the European Parliament on Wednesday.\nSpeaking in a debate in Strasbourg hours after the Brexit deal between the UK and the EU was struck down by British law-makers, Dr Sant argued that the negotiations between the EU and the UK were flawed.\nThe UK should have been asked first to clear as a matter of principle and policy what future relationship it sought, he said. And the EU should have indicated what relationship it found acceptable. Agreement would then have been sought on this. Negotiations between the EU and the UK would have been about proceeding from the status of membership to that of the proposed new relationship.\n\"Instead another episode is being played in a soap opera that frankly has become rather dreary,\" he said. \nDr Sant said the impasse that faces the EU and the UK results from the deeply flawed method by which the Brexit negotiations had been conducted.\nThe negotiations had been designed in two sequences: first to establish the conditions for an orderly withdrawal; then those of a future relationship. Aggravated by huge political fractures on the British side, and the steely determination to maintain unity on the EU side, this approach had been driving both sides towards a brick wall.\n“A divorce process can only be well managed if not just the terms for a separation but also those of any alternative future relationship are mapped out. The two sets of terms are interdependent, as is shown by the ongoing controversies within the British political system regarding whether Brexit should be hard or soft,” he said.", "comment_count": 53, "id": 1784}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The owner of a Żejtun bar has been cleared of grievously injuring a customer for lack of evidence.\nAlbert Mifsud, 60, had been charged with seriously injuring and threatening an off-duty bus driver who had visited his bar in the early hours of August 12, 2017.\nThe driver recounted in court how he had wandered around the streets before ending up at the Żejtun bar at around 5am. He said he had two vodka and cokes, turning down further drinks which he passed on to a patron at the bar. He had also refused an offer of “something” else at the bar, seemingly implying that he had been offered some illicit substance.\nJust as he had been about to leave, he claimed that Mr Mifsud, the bar owner, had walked in and began to hit him “left right and centre,” with a knuckle duster-clad fist, inflicting serious facial injuries.\nMr Mifsud then ordered his barman to wipe up the mess and close shop. \nThe part-time barman gave a totally different version of events, stating that the driver, a complete stranger, had been a nuisance to other patrons at the bar.\nHe had asked him to leave, and when he refused he called Mr Mifsud for assistance.\nThe brawl broke out when Mr Mifsud turned up and asked the driver to leave. The driver pushed Mr Mifsud to the floor and had to be pulled away by other people before being “thrown out”.\nMagistrate Doreen Clarke observed that the only certain fact was that there had been a brawl at the bar and that two or three others had intervened.\nIt had also been determined that one of the men had suffered facial injuries.\nHowever, what had truly happened before the arrival of the accused and what had actually sparked off the fight, had not been determined with certainty.\nThe court therefore declared that the prosecution had failed to prove its charges beyond reasonable doubt and Mr Mifsud was acquitted.  \nLawyers Arthur Azzopardi and Rene Darmanin were defence counsel.\n ", "comment_count": 0, "id": 1785}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man facing a possible jail term over a sexual assault in the early hours of Christmas Day 2015, will have to be re-sentenced after a court of appeal annulled the first judgment.\nNajm Fahd, a 23-year old Syrian national, had been declared guilty by a Magistrates’ Court of having engaged in sexual acts with the 16-year old Maltese girl, held her against her will, assaulted her and ran on the streets creating a possible menace to third parties.\nThe assault had taken place close to 2am on Christmas Day when the teenager was returning home on foot after a private party at Baystreet.\nWalking in the vicinity of Pembroke, the girl had described how she had sensed someone following her, hearing the clinking of some keychain in the background, before being grabbed from her coat by a stranger wearing a blue and white striped jumper.\nHe had first asked for directions to Ħamrun but had suddenly pushed her against the porch wall of a private residence and tried to force himself upon her, kissing and groping her before he was shoved backwards by the girl who managed to run away home.\nThe girl’s mother, upon hearing of the assault, had gone in search of the suspect, alerting the police when she finally came across a man who matched her daughter’s description chatting to another girl close to the former ITS premises.\nThe man, who told the mother that he was cold and wanted to get back to Ħamrun, had fled before the arrival of the police.\nThe alleged victim and her mother had later stepped forward when the girl said she recognised the suspect on television when his arraignment over separate charges had been covered by the media.\nMr Fahd had been charged over the Christmas Day incident and was ultimately declared guilty and condemned to a jail term of four years six months and placed under a two-year Protection Order.\nHowever, the Court of Criminal Appeal, presided over by Madam Justice Consuelo Scerri Herrera, upheld the first argument raised by accused’s defence lawyer and declared that the first judgment was null owing to a technical error by the Magistrates’ Court.\nThe first court had cited the wrong disposition of law, quoting article 339(c) of the Criminal Code when it clearly meant to refer to article 339(cc) of the Code, an error which vitiated the judgment though not the entire proceedings before the Magistrates’ Court, stressed Madam Justice Scerri Herrera.\nConsequently, the Appeals Court, whilst declaring that “the entire proceedings before the judgment were to stand”, sent the case back before the Magistrates’ Court so that Mr Fahd might be placed in the same position he had been before the judgment was delivered and ordered his re-sentencing under the correct disposition of law.\nInspectors Joseph Busuttil and Matthew Spagnol prosecuted. Lawyer Jason Grima was defence counsel.", "comment_count": 0, "id": 1786}, {"keywords": "", "author": "", "article_body": "Maltese Globigerina limestone has been granted international designation as a Global Heritage Stone Resource (GHSR), together with six other stones from as many countries.The designation recognises stones that have been in historic use for a significant period of time and have common recognition as a cultural icon.The other new designated stones are Lioz from Portugal, Lede stone from Belgium, Jacobsville stone from the USA, Kolmården serpentine marble from Sweden, Welsh slate from Wales, and Piedra Mar del Plata from Argentina.Managed by the International Union of Geological Sciences, the designation follows a long and detailed review by experts in the field.The nomination for global recognition was led by the University of Malta’s Department of Conservation and Built Heritage, and also involved the Department of Geosciences of the University of Malta.The GHSR designation was set up in 2008 to seek international recognition for natural stone resources that have achieved widespread utilisation in human culture.It aims to promote greater prominence for natural stone that has been used in artistic and architectural masterpieces, and heritage buildings, as well as routine historic stone applications.It also aims to enhance recognition of natural stone amongst geologists, engineers, architects, heritage professionals, stone industry managers and other groups that work with stone.The other designated stones are: Portland Stone (UK), Petit granite (Belgium), Larvikite (Norway), Podpêc limestone (Slovenia), Hallandia gneiss (Sweden), Carrara marble (Italy), Villamayor Stone (Spain) and Estremoz marble (Portugal).", "comment_count": 11, "id": 1787}, {"keywords": "", "author": "Keith Micallef", "article_body": "While refusing to comment on the controversial Vitals Global Healthcare deal, Finance Minister Edward Scicluna played down the issue on Wednesday saying government concessions always stoked controversy.\n“Looking back, these concessions have always been controversial,” he said citing the case of the Mater Dei Hospital agreement, as well as the BWSC and Electrogas power plant deals.\nThe Finance Minister was asked on the matter after addressing an event at the National Statistics Office.\nRead: Vitals found ‘novel ways to pocket taxpayer money’\nDoubts about the controversial €2.1 billion VGH deal, which had been given a 30-year concession to manage three state hospitals (St Luke’s, Karin Grech and the Gozo General Hospital) have resurfaced recently, following a series of reports by The Shift News.\nThe latter said that in December 2017 when VGH transferred its concession to Steward Health Care of the US after less than two years, millions had changed hands behind closed doors.\nIt was also claimed that VGH was involved in financial manoeuvring including a €5 million takeover of a local medical firm called Technoline, which was given exclusive rights to handle procurement for the three State hospitals, which are part of this concession.\nAsked what action he took to ensure that taxpayers would get full value of the €50 million given to VGH, Prof. Scicluna declined to comment on grounds that the agreement was subject to a pending court case instituted by the Opposition.\nThe finance minister insisted that a new government agency was in the pipeline as part of an effort to monitor such concessions.\nAsked if he was concerned about the manner in which the VGH deal had been handled, Prof. Scicluna said he “worried on everything every day”.\n“There are institutions that examine such matters, such as the auditor general and the courts,” he said.\n“What I am interested in is to have the structures in place to ensure that what has been promised is delivered,” he said.\nHowever, when asked specifically to outline the commitments honoured by VGH during its brief stint, the minister refused to answer and cut the interview short.", "comment_count": 50, "id": 1788}, {"keywords": "", "author": "", "article_body": "An Environmental Impact Assessment into a contested large-scale road project between Ta’ Qali and Attard has found that the plans would lead to improved air quality in the area, Infrastructure Malta said on Wednesday.\nIn a statement, Infrastructure Malta said that an EIA – which has yet to be published – had also found that the route would end up in complete gridlock within 10 years if it remained as it is, without being upgraded.\nAuthorities’ plans for the route, dubbed the Central Link Project, have run into staunch opposition from residents and environmental lobbies, who say procedures have been short-circuited to push through a project of dubious benefit.\nRead: Three-quarters support Central Link project, minister says\nInfrastructure Malta, on the other hand, says the €55 million project will halve travel times through the congested area, improve air quality and add facilities for alternative means of transport.\nThey say the new road would follow the same route as the four-lane bypass planned in 2006, but would use less than half the land originally earmarked for its development.\nIn a statement on Wednesday, Infrastructure Malta said it had submitted the independently-drafted EIA studies to environmental and planning authorities, which are considering the Central Link Project application.\nIt highlighted some of the EIA findings, saying it had found that plans would require 57% less agricultural land than the amount originally earmarked in a similar road upgrade proposal planned 13 years ago.\nPhoto: Infrastructure Malta\nThe EIA, Infrastructure Malta said, found that if the road network was not upgraded, morning and afternoon travel times in the area would increase by 2.8 times and 4.4 times respectively by 2030, and by 8.1 and 7.8 times in 2045.\nThe air quality study, based on 2018 air monitoring in several locations along the route, showed the effect of this gridlock situation on the area’s air quality.\nRead: 1,400 submissions on controversial Central Link project\nIf the project was not implemented, particulate matter (PM10) and nitrogen dioxide (NO2) emissions in the area, including Attard and Balzan, would increase by 104% and 35% in 2030 and by 229% and 86% 15 years later.\nPM10 and NO2 are the two main pollutants linked to road transport emissions. By eliminating existing bottlenecks and congested junctions, the project would lead to average PM10 reductions of 42% by 2030 and 60% by 2045, even when considering future transport demand. NO2 emissions would be lowered by 15% in 2030 and 30% in 2045, the infrastructure authority said.\nIf approved, the Central Link Project will see authorities rebuild 13 junctions, removing four traffic lights systems and adding over seven kilometres of new lanes along a 4.3 kilometre road corridor. The project also introduced facilities for alternative modes of travel, including safe pedestrian footpaths, improved bus lay-bys and the longest segregated cycle track in the Maltese Islands.\nPhoto: Infrastructure Malta\nWatch: Traffic in Mrieħel justifies Central Link project - Transport Minister\n ", "comment_count": 14, "id": 1789}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two men who had been jailed and fined for their involvement in a cigarette smuggling racket had their conviction overturned on appeal.\nMichael Borg, 43, from Paola, and Shannon Cauchi, 29, from Ħamrun, had been charged in 2013 alongside three others with conspiring to smuggle thousands of contraband cigarettes into Malta, thereby evading thousands of euros owed to the public coffers.\nLast June, they had been given a three-year jail term and fined €488,000 each.\nTwo of the alleged conspirators had been acquitted by a Magistrates’ Court which found insufficient evidence linking them to the illegal shipment. The other three had been convicted and all filed an appeal.\nWhen delivering judgment in respect of Mr Borg and Mr Cauchi, the court of criminal appeal, presided over by Madam Justice Consuelo Scerri Herrera, observed that such a case would have called for a magisterial inquiry to ensure that experts would be tasked to preserve the evidence.\nIn this case, no inquiry had been called and no expert had been nominated to actually determine the contents of the illegal shipment, the Court pointed out, adding that the prosecution, although exhibiting the master cases in court, had only presented photos of the boxes wherein the alleged contraband cigarettes had been stacked.\nIn spite of several witnesses summoned by the prosecution, no photos of the actual cigarettes had been exhibited and no expert had been nominated to determine the contents of the boxes, labeled ‘Business Royals’ and ‘Tradition,’ the Court went on.\nHad this been determined, it would have been for the co-accused to prove whether the relative duty and taxes had been paid, the Court observed.\nMoreover, the testimony of an Indonesian sailor who had worked on board the vessel, allegedly employed in the smuggling operation, was declared inadmissible - not on the basis of a lack of credibility - but because he had been considered by the first court as an accomplice, since he used to work on board and this indicated his participation in the alleged smuggling.\nIn two judgments numbering 140 and 122 pages respectively, the Court concluded that the prosecution had failed to prove its case beyond reasonable doubt, thereby upholding the appeals and acquitting Mr Borg and Mr Cauchi, confirming only that part of the judgment which had ordered the confiscation of the items “which the first court had referred to as cigarettes”.\nThe case dated back to July 11, 2013 when sea patrols had caught sight of the Blue Dolphin I, a long-liner registered in the name of Michael Borg, captain of the vessel, heading from Gozo to St Paul’s Bay.\nOnce berthed at Għajn Fekruna, the patrols looked on as the ship’s crew unloaded boxes from the vessel onto a Toyota Dyna van, assisted by two others who were waiting on shore and who sped away as soon as the police stepped in.\nThe van, driven by Anthony Cremona with Mr Cauchi seated as passenger, was later tracked down in Santa Venera, with its load of boxes covered in black plastic, still stowed away inside.\nInside the boxes were 1,030,800 cigarettes, Business Royals and Tradition brands, valued at €29,870 with an Import Duty of €17,205 and liable to an Excise Duty of €145,487 and €34,661 by way of VAT.\nThe appeal judgment in respect of Mr Cremona is still to be delivered.\nAssistant Commissioner Ian Abdilla and Inspectors Yvonne Farrugia and Anne Marie Micallef prosecuted. Lawyers Franco Debono, Marion Camilleri, Veronique Dalli, Dean Hili, Arthur Azzopardi and Alfred Abela appeared for the accused.", "comment_count": 0, "id": 1790}, {"keywords": "", "author": "Ivan Martin", "article_body": "Pig breeders were not being given the EU funding help they needed to survive fierce competition from oversees, MEP hopeful Peter Agius said.\nHe was reacting to a report in The Sunday Times of Malta, which said that the industry in Malta was collapsing under mounting pressure from European competitors and the spread of new food fraud.\nThe problem is primarily one of economies of scale.\nForeign pork is far cheaper to produce than it is in Malta because farmers here have to shell out a bomb to import the cereal feeds that fattens pigs before slaughter, according to the breeders’ cooperative.\nMaltese operations are also tiny compared to the mammoth factory-scale ventures on the mainland, meaning the cost per pig is much higher than it is for, say, Dutch farmers to rear a sow.\nLocal sellers are also opting for the cheaper foreign produce.\nWe have to help Maltese farmers\nSupermarket fridges and butcher displays, the cooperative said, were being stuffed with cheaper foreign roasts, chops and sausages but sold to consumers at the same price as Maltese pork, with sellers turning a hefty profit.\nTo make matters worse, some unscrupulous sellers were labelling foreign meat as local producer to cash in on many buyers’ preference for Maltese products, it added.\nDr Agius, a Nationalist Party candidate for the forthcoming European elections who has been holding regular meetings with the cooperative, said the sector was going through “the worst period ever”.\nTons of imported meat, he noted, was flooding the market. However, other European breeders enjoyed financial incentives their Maltese counterparts did not.\nA recent EU directive on animal welfare, was enforced locally via a series of legal notices that effectively added more restrictions.\nGovernments in other member states had tied the new requirement to financial incentives, which not only encouraged breeders to be compliant but also acted as a form of indirect assistance that did not qualify as State aid, Dr Agius pointed out.\nSimilar solutions, he said, could be found when it came to the higher feeding costs Maltese farmers faced.\n“If we want to see this sector continue to feed our families, we have to help Maltese farmers,” he said.\nHow bad is the situation for the local pig breeding industry?\nPrior to joining the EU, practically all the pork sold on the island was local, however, the market share dropped from more than 90% to less than 30%, with overall sales taking a major hit too, according to the cooperative.\nSome breeders  had already decided to call it quits and most others were struggling to make ends meet, it warned.", "comment_count": 26, "id": 1791}, {"keywords": "", "author": "", "article_body": "The former Institute for Tourism Studies in St Julian’s, a scheduled property which will now give way to the massive db project, has been left exposed to the elements, risking damage to its interior.\nWhen a newspaper crew visited the site on Friday, they found windows and doors of the former St George’s Barracks gaping open.\nThe db Group’s 37-storey tower will be built on the site of the former ITS campus.\nThe condition of the historic building is the subject of an application filed to the Environment and Planning Review Tribunal, which has accepted the request for a site visit to assess whether measures need to be taken to protect the property.\nThe application was filed by lawyers of appelants against the db project. One of them, Claire Bonello, described the building as being of enormous historical importance and a lasting example of British military architecture. \n“We would want to avert a situation where the interior is left exposed to the elements so that eventually developers can say it is in a dilapidated state and that is why we asked for immediate urgent access on site. As appellants we find it repugnant to see how there is an attempt to obliterate a whole locality's historical memory,” she said yesterday.We want to avert a situation where the interior is left exposed to the elements so that developers can say it is in a dilapidated state\nThe foundation stone for the barracks was laid by the Prince of Wales and they served as a hospital in World War I. “Vera Brittain served here and it inspired her pacifism and her writings. Sister Mary Martin also served here and it inspired her to start her order,” said Dr Bonello.\n“Yes, the barracks are living proof of conflict and service and history and it is sickening to see that they are being demolished and a pathetic little remnant left in front of the [db property] pool, completely devoid of context and integrity.”\nAccording to law, whoever is found guilty of wilfully damaging or destroying property of cultural value could face a fine of between €1,164 and €116,468 or to imprisonment not exceeding six years.\nDb’s €300 million City Centre project was approved by 10 votes to four last September, despite an unprecedented 4,500 objections from the public, local councils and NGOs over the scale and impact on residents, as well as traffic generation and adherence with planning policy.\nIn an article in The Sunday Times of Malta, Arnold Cassola writes that prior to even being granted a permit, the db Group had “nonchalantly” stripped the scheduled ITS building.\nThe db group on Saturday denied Prof. Cassola’s assertion that the Planning Authority had imposed a condition that all apertures be boarded up. His piece was already in print when the denial was received.", "comment_count": 10, "id": 1792}, {"keywords": "", "author": "", "article_body": "These are the main stories in Wednesday’s newspapers.\nMost newspapers in Malta lead with Tuesday evening’s vote against British Prime Minister Theresa May’s Brexit deal, which was defeated by a massive margin, triggering a no confidence vote that could bring down her government.\nIn other stories, Times of Malta says the majority of inequality complaints by people with a disability were against the government and its entities.\nThe Malta Independent quotes the Association of General Retailers and Traders, GRTU, saying that a decisive meeting on petrol stations is to be held on Wednesday.\nMalta Today says Adrian Delia’s leadership is not on the agenda as the Nationalist Party’s administrative council meets on Wednesday.\nIn-Nazzjon says Dr Delia is determined to continue defending the people’s interest in the case against Vitals.\nL-Orizzont says there is an increase in the number of stolen cars that are not driven.", "comment_count": 0, "id": 1793}, {"keywords": "", "author": "", "article_body": "A motorcyclist was grievously injured on Tuesday in a traffic accident in Għajnsielem.\nThe police said the accident happened in Triq l-Imġarr at 7.50pm.\nThe 36-year-old Italian motorcyclsit, who lives in Xewkija, was riding a Kymco Agility that was involved in a collision with an Opel Corsa that was being driven by a 67-year-old man who lives in Għajnsielem.\nThe motorcyclist was taken to Gozo General Hospital.", "comment_count": 0, "id": 1794}, {"keywords": "", "author": "Ivan Martin", "article_body": "Thirteen individuals were treated for overexposure to pesticides in the air over the past five years, official figures show.\nAccording to the National Hospitals Information System, they required medical treatment at Mater Dei Hospital between 2013 and 2017 for a variety of symptoms linked to overexposure to pesticides used in farms across the island.\nThe figures, tabled in Parliament by Health Minister Chris Fearne while replying to a written question tabled by Opposition environment spokesman Jason Azzopardi, indicate there were both one-off cases and acute sufferers.\nPatients who were treated by emergency response teams sent to farms or nearby homes but not taken to hospital were not included in the data provided. Information on the number of cases last year was still being compiled by the authorities, the minister said.\nFruit and vegetables sold in Malta are among the worst in the EU in terms of excessive pesticide levels.\nThe European Food Safety Authority reported that more than one in 10 local greens taken to the lab in 2016 were sprayed with chemicals that exceeded the legal limit. The European average was five times lower.\nRead: Excessive pesticide levels land 15 farmers in court\nWhile the sampling methods used by the Maltese authorities testing chemicals in local and imported produce was found to be deeply flawed in some instances, it also emerged that some tests did show worrying overuse by some farms in Malta.\nThe Times of Malta reported last year that one contentious pesticide linked to potentially-irreversible neurological impairments had the highest readings of all the overused chemicals on the island.\nThe chemical, chlorpyrifos, is legal and commonly used in the EU but has just been banned in a number of US states after they appealed to reverse a decision made by the Trump administration to clear it.\nRead: Most overused pesticide linked to brain conditions in children\nIt is widely used on food crops in Malta and has repeatedly been shown to negatively impact proper development and functioning of the central nervous system and brain following prenatal exposure.\nIn 2014, an awareness group conducted tests to establish whether residential proximity to agricultural pesticides during pregnancy was associated with autism spectrum disorders or developmental delay. It found about one in three pregnant women who lived within 1.5 kilometres of a farm spraying chlorpyrifos and other chemicals had an increased risk of bearing a child with some form of autism or developmental disorder.", "comment_count": 27, "id": 1795}, {"keywords": "", "author": "Keith Micallef", "article_body": "A Planning Authority decision to withdraw an enforcement notice issued years ago following the unauthorised opening of a road in Baħar iċ-Ċagħaq has left residents fuming and raised eyebrows.\nThe controversy revolves around what was previously a 100-metre walkway on garigue land linking Triq Qalet Marku to a country road leading to Magħtab. In 2010, unauthorised works had been carried out to convert this passageway into a road, by laying fresh concrete on virgin land.  \nSuch development had prompted the Planning Authority to issue an enforcement notice on the grounds that inert material had been dumped and a country lane covered in concrete without a permit. However, the PA has recently withdrawn this notice, leaving irked residents fuming.  \nThe latter had long been complaining that this quiet area had turned into a busy thoroughfare following the opening of the road.\n“Apart from having been widened to allow trucks to pass through it, the road has attracted traffic as it is the shortest way to access the Coast Road from areas around Mosta, Naxxar and Għargħur,” was a common complaint levelled by residents who spoke to the Times of Malta. \nIn turn, this led to speed-ing offences in a residential area, pollution and late-night disturbances, they added.\nAction had also been taken by the Naxxar council, which had blocked the road with bollards and concrete blocks. Yet, such measure proved insufficient as these obstacles were removed after some time.\nSuch decision does not bode well for the environment\nAsked for an explanation over its change in position, a Planning Authority spokesman said that the enforcement notice was withdrawn on the grounds that this road had already been “established” in 1968. He added that no permit was required as the area in question had “only been improved and maintained” thereby not requiring permission, in line with a 2016 legal notice. The latter states that no permit is needed in case of widening, improvement or maintenance of existing roads.\nMoreover, the authority distanced itself with the decision of allowing cars and heavy vehicles going through this road, saying use or otherwise of the road was regulated by Transport Malta and the council.\nHowever, Naxxar mayor Annmarie Muscat Fenech Adami told this newspaper that the council had objected to this decision but, at the same time, admitted it had been left no option. She said that traffic access to the road was opened on the instructions of Transport Malta.\nMeanwhile, the timing of the decision to withdraw the enforcement notice, which happened very recently, and the justification behind it raised eyebrows.\nBaħar iċ-Ċagħaq resident Charlot Sultana, insisted that contrary to the authority’s reply, this was not a case of a road being widened.\n“I have been living here for many years and prior to these illegal works, this was not a road but a lane wide enough for a person to go through,” he said.\nSatellite images from both the Planning Authority server and Google Earth, indicate this was indeed a footpath and not a road open to traffic.\nMr Sultana also claimed that the enforcement notice was withdrawn soon after he had personally flagged the matter to Transport Minister Ian Borg and Environment Minister José Herrera through an e-mail.\nAn aggrieved Mr Sultana expressed concern that such a decision could set a precedent for every country lane to be covered in concrete and turned into a road.\n“Such decision does not bode well for the environment,” he said.", "comment_count": 19, "id": 1796}, {"keywords": "", "author": "Ivan Martin", "article_body": "A new €14 million waste sorting facility will help the island process larger volumes of recycling in a bid to improve Malta’s poor track record on waste management, according to a new tender agreement.\nThe Multi-Material Recovery Facility will be run by State waste management firm WasteServ on land next to an existing bring-in site in Ħal Far.\nA tender for the construction of the facility was issued last year and the winning bidder, BS Joint Venture, was announced by the government yesterday.\n“The proposed facility aims to expand the waste types processed locally,” the tendering documentation reads.\nIt adds that the facility will be constructed by the bidder to accept a variety of waste streams that would otherwise be disposed of at the island’s landfill.\nRecycling has been repeatedly highlighted as a major failing in Malta’s waste management efforts over the years, and the island recycles the smallest quantity of municipal waste in the EU.\nLast year, the Times of Malta reported how the island’s main landfill was expected to reach full capacity within two years, triggering the government to hold a public consultation on the matter. \nWhat followed was the announcement that a hazardous waste dump would be converted to be used for routine dumping of regular waste as an emergency, stopgap solution. The announcement preceded that of a controversial waste-to-energy project, which will see a less polluting version of incineration process for a large chunk of the island’s waste.\nIntake of variety of waste streams\nThe Times of Malta has since reported that this plant will be located next to the Magħtab landfill.\nMeanwhile, recycling levels continue to fall drastically short of expectations.\nAccording to the tendering documentation, the Ħal Far facility will form part of a process in which waste streams are segregated and pre-treated, packaged and dispatched for export.\nUnsorted flat glass, wood, electrical and electronic equipment waste (WEEE), tyres, polystyrene, gypsum, mattresses and a variety of other textiles will all be processed at this new site.\nTrucks entering and exiting the facility will be weighed using one of two weighbridges to get an accurate picture of the weight of material dumped. Multiple drop-off points will enable trucks carrying different waste streams to unload material in distinct areas, the tender document reads.\nOnce the material has been processed or “containerised”, it will be moved to an underground level via an array of loading elevators for temporary storage.\nWaste electrical and electronic equipment will be palletised before it is stored and tyres will be processed by a tyre baler to maximise density for logistical benefits.\nWood and mattresses will also be downsized via shredding by means of a mobile multi-material shredder. Polystyrene will be compressed and baled, as will gypsum and textiles.\nThe materials will then be transported to the Freeport for export. Any rejected materials will be taken to the landfill.\nWasteserv chief executive Tonio Montebello said the site was not meant to replace the Sant’ Antnin plant, which burnt down in 2017.\nAccording to the documentation, a daily penalty of €15,000 will be imposed if the project for this new facility is delayed, and it must be finalised and delivered within 24 months.", "comment_count": 9, "id": 1797}, {"keywords": "", "author": "", "article_body": "An elderly Polish man caught the wrong Ryanair flight at Leeds Airport and ended up in Malta, 1,000 miles from home. He only realised he was in the wrong country when the taxi driver didn’t understand him, according to the Daily Mail.\nThe incident happened on January 6.\nPawel Lawreniuk, 75, had been due to fly to Gdansk after visiting his daughter in the UK.\nHe somehow boarded the wrong plane but only realised he had landed in the wrong county when he asked a taxi driver at the airport to take him home only to discover he did not speak a word of Polish. \nA Polish-speaking woman overheard the conversation and helped him to contact his daughter and book the correct flight that same day. \nThe newspaper said Mr Lawreniuk told his family that he showed the plane ticket to staff on the flight who directed him to his seat - and as far as he was concerned he was on his way to Poland.\nHis daughter Lucyna Lawreniuk, 34, said she had double checked the ticket, printed it and it said Gdansk. \n'I cried, I was scared - he was in a different country, a different place. I don't know how it is possible for him to make it all the way to Malta.\n'I spoke with him about everything and he's had bad dreams - I'm worried about him, but hopefully everything will be OK.\n'If someone didn't come forward, I'm not sure what would have happened - he had no money, no phone, he can't really do anything alone.\n'My father told me he doesn't want to come to me next year. He doesn't want to fly anymore. I would like to speak with a lawyer about what happened.'\nA spokesman for Swissport, the handling agency for Ryanair at Leeds airport said the passenger had undergone all airport security screening before boarding the flight and had a valid passport which had been checked.\n'We are investigating how this occurred and we are re-briefing all staff on procedure. We would like to apologise to Mr Lawreniuk for the inconvenience caused.'", "comment_count": 51, "id": 1798}, {"keywords": "", "author": "", "article_body": "A 78-year-old man from Birkirkara was grievously injured on Tuesday evening when he was hit by a car at the junction of Dun Filippu Borg Street with Cane Street in Birkirkara.\nThe man was hit by a Honda Fit driven by a 42-year-old man from Birkirkara at about 6.45pm.\nAn ambulance team assisted the man and took him to Mater Dei Hospital for treatment.", "comment_count": 0, "id": 1799}, {"keywords": "", "author": "", "article_body": "The Nationalist Party administrative committee is to convene a meeting on Wednesday, with a discussion expected to revolve around leader Adrian Delia, according to party sources. \nA separate meeting for the executive committee is scheduled for Thursday.\nThe PN’s executive committee, its second-highest decision-making body, is set to tackle allegations being made against Dr Delia.\nThe development comes days after allegations of domestic violence, made against Dr Delia by his wife in separation proceedings, went public after the leak of court documents.\nA defiant Dr Delia has vowed to stay, branding the accusations part of a plan to oust him by exploiting “private life” issues.\nRead: ‘I will not resign” – Delia rejects claims he’s pulling PN down", "comment_count": 30, "id": 1800}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man is being held behind bars after allegedly stealing from a number of rooms in two hotels in Gzira. \nChristopher Sammut, 47, from Lija, was arraigned on Tuesday and pleaded not guilty to having made off with electronic equipment and cash belonging to hotel guests, as well as with attempting to rob a betting shop and also with the theft of two wallets.\nInvestigators homed in on the man after CCTV footage and stills of the man were posted on social media.\nA request for bail was strongly objected to by the prosecution in view of the fact that the suspect had proved difficult to trace. In fact, the man had only supplied an address during his arraignment.\nLegal aid lawyer Dustin Camilleri countered that not only had the accused supplied a fixed address, but moreover, he was willing to abide by bail conditions, although he lacked the means to pay a bail deposit.\nMagistrate Gabriella Vella turned down the request for bail in view of the man’s lack of trustworthiness, pointing out that he had only supplied a fixed address during the arraignment.\nInspectors Saviour Baldacchino and Colin Sheldon prosecuted.", "comment_count": 0, "id": 1801}, {"keywords": "", "author": "", "article_body": "A man wanted by the Bulgarian police has been arrested in Malta and is expected to face extradition proceedings.\nThe police said the man, 30, was arrested after days of observation by the Criminal Intelligence Unit.\nHe is wanted for allegedly causing wilful damage, harming several people and other public order offences.\nThe arrest was made on the strength of a European Arrest Warrant. ", "comment_count": 1, "id": 1802}, {"keywords": "", "author": "Ivan Martin, Jacob Borg", "article_body": "Updated - Adds video of press conference by Opposition leader Adrian Delia. \nThe government is duty-bound to look into the alleged financial manoeuvring of the people behind Vitals Global Health Care (VGH) and news reports into questionable deals, Opposition leader Adrian Delia said on Tuesday.\nThe Shift News revealed on Monday how VGH funded a €5 million takeover of a local medical firm called Technoline, which was then given exclusive rights to handle procurement for the three State-owned hospitals entrusted to VGH.\nAccording to the media reports, VGH sold the three public hospitals it managed to Steward Healthcare for just €1 in 2017, but “millions” changed hands behind closed doors.\nThese payments included a €1 million payoff to a Dubai company called Mount Everest General Trading LLC, whose involvement in the ownership structures was previously unknown.\nThe government has repeatedly refused to release documents related to the due diligence carried out on VGH and its owners.  It pays the concessionaires around €70 million annually to make use of bed space and medical services provided by the company at the three hospitals.\nThe government announced that VGH was selling the government concession to Steward Healthcare in December 2017.  \nA memorandum of understanding between the government and some of the investors behind VGH was signed six months before Projects Malta, which falls under Tourism Minister Konrad Mizzi’s control, issued a request for proposals for the running of the three hospitals in April 2015.\nHealth Minister Chris Fearne on Tuesday said he was not involved in the talks between the two companies, and the deal was being investigated by the National Audit Office.\nAddressing a press conference, Dr Delia said Mr Fearne was effectively blaming fellow minister Konrad Mizzi for what had happened while disclaiming any responsibility.  \nRules and even laws had been sidelined or even evaded for this deal to have gone through, and someone had to be held accountable.\nIn comments to the Times of Malta, MEP David Casa said these deals took place with the full complicity of the government and its “star negotiator” Konrad Mizzi.\n“We have known that this deal is rotten to the core for some time now. But we are only now beginning to find out just how rotten it really is,” Mr Casa said.He added the use of hidden companies and secret agreements for “devious ends” was not new.\nMr Casa said these seemed to be the modus operandi with any deal involving Dr Mizzi. “17 Black’s purpose is now well known in relation to the other project for which he is notorious, the Electrogas power station. So far, the purpose for Macbridge continues to remain a mystery,” Mr Casa said.\nBoth the Dubai-based companies were mentioned in a leaked e-mail as the main sources of income for the Panama structures opened by Dr Mizzi and the Prime Minister’s top aide Keith Schembri.\nMr Schembri had admitted to having “draft business plans” with both 17 Black and Macbridge, yet he says he has no idea who owns these two companies.Dr Mizzi insists he has no link to either company.\nVGH had promised to invest over €200 million in regenerating the hospitals, though there was little evidence of much change during their short time as concessionaires.", "comment_count": 58, "id": 1803}, {"keywords": "", "author": "", "article_body": "It may have been only the second parliamentary sitting of the year, but any backlog built up over the Christmas recess did not stop Prime Minister Joseph Muscat from providing a spot of lighter information on Tuesday: the most popular baby names of 2018.In answer to a question by government whip Byron Camilleri, the Prime Minister told Parliament that Emma was the most popular name for baby girls last year, retaining the spot it has held for four years, followed by Mia and Valentina.Noah was the most popular boy’s name, despite not featuring in the top three last year. It was followed by Luca, which dropped from first to second, and Liam rounding off the top three.There was no room in the top three for Ella, which had featured among between 2013 and 2017, or for Ben, last year’s second most popular boy’s name.", "comment_count": 16, "id": 1804}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A road rage argument between two strangers on Monday morning has landed one of them in court where he was granted bail after pleading not guilty to seriously injuring the other driver.\nConstantine Borg, a 51-year old self-employed Birkirkara resident, was arraigned on Tuesday and charged with having grievously injured the alleged victim in the punch up which broke out over a right of way argument in Attard.\nThe man was further charged with having breached the public peace.\nProsecuting Inspector Elton Taliana explained that the heated argument at the traffic lights shortly before 8am had escalated to such an extent that the accused had punched the other driver in the face, causing him injuries which had been medically certified as serious.\nHowever, defence lawyer Franco Debono, explained that his client had supplied a totally different version of the incident. He made a request for bail.\nThat request was objected to by the prosecution primarily in view of the fact that the accused’s brother, who happened to be with the accused and who had witnessed the whole episode, was to testify in the proceedings.\nDr Debono promptly rebutted that the accused’s version had already been recorded in his statement and that he was still presumed innocent.\nAfter hearing submissions by both parties, Magistrate Gabriella Vella upheld the request for bail against a deposit of €500, a personal guarantee of €3,000 and an order to sign the bail book twice a week.\nLawyer Amadeus Cachia was also defence counsel.\nLawyer Maxine Gatt appeared parte civile.", "comment_count": 11, "id": 1805}, {"keywords": "", "author": "", "article_body": "The Social security Department is carrying out a regular exercise to verify that parents are eligible to receive children's allowance where the allowance is paid at the flat rate for those whose income exceeds €25,045 annually.\nIn a statement, it pointed out that as of three years ago, parents did not need to re-apply for the allowance every year, but the department was currently updating its information. Parents were therefore being sent a form where they were being asked to fill in their data. \nTimes of Malta reported on Tuesday that a number of families had been struck off the children’s allowance list after being told that the department did not have their full details. \nThe department said on Tuesday that those parents who did not receive their children's allowance in December would receive it once their form was filled in and returned.\nIt also pointed out that some people had moved house and had not informed it of their change of address. Hence they did not receive the form. It was the duty of all beneficiaries to inform the department of any changes in their circumstances, it said. \nThose who did not receive the form may fill an application online or call at one of the department's district offices. \nMore information is available on freephone 153.", "comment_count": 5, "id": 1806}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man arrested in a drugs raid in Marsa at the weekend was handed an 8-month effective jail term and a fine after admitting to aggravated drug possession upon his arraignment on Tuesday.\nLee Jonathan Borg, a 34-year old unemployed Ħamrun resident, was charged with having been found in possession of cocaine, cannabis and heroin in circumstances denoting that the drugs were not for his own personal use.\nProsecuting inspector Mark Anthony Mercieca explained how members of the Drugs Squad, acting upon confidential information, had swooped upon a residence at Triq it-Tiġrija, Marsa where drug trafficking and drug abuse activities were allegedly taking place, so as to execute a search and arrest warrant.\nPolice said in a statement on Monday that the drugs squad had been monitoring the premises throughout the day. A raid by drugs squad officers, assisted by the special intervention unit and traffic police, revealed sachets containing substances believed to be cocaine, heroin and cannabis, all ready for distribution. The amount recovered was not disclosed.\nPolice also found electronic scales and other equipment used for drug consumption or trafficking was also found.\nThe raid led to the arrest of three men: Mr Borg, a 46-year old living in Msida and a 29-year old Libyan living in Marsascala.\nUpon the accused’s guilty plea, legal aid lawyer Dustin Camilleri informed the court that his client needed help to battle his drug addiction.\nInspector Mercieca further pointed out that the accused had collaborated in the investigations, which were still ongoing.\nIn the light of these submissions, Magistrate Gabriella Vella declared the accused guilty upon his own admission and condemned him to an effective jail term of eight months and a €500 fine, payable in €25 monthly instalments once the man had served his prison term.", "comment_count": 0, "id": 1807}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "The way forward in civil proceedings calling for a hospital privatisation deal between the government and Vitals Global Healthcare to be rescinded will be definitively decided upon in March.\nThis was the outcome of a sitting before the superior court of appeal on Tuesday.\nThe suit was filed by Nationalist Party Adrian Delia against Prime Minister Joseph Muscat, the Attorney General, Malta Industrial Parks and VGH, calling for Karin Grech, St Luke’s and Gozo hospitals to be 'given back to the people' because contract conditions had not been fully abided by.\nDr Muscat, the AG and the Lands Authority had raised a preliminary plea claiming that the suit was inadmissible since it could only have been filed up to the date when the final deed was signed.\nThe case, described by the First Court, presided over by Mr Justice Silvio Meli, as one of “great importance” had, however, ground to a halt after the court had upheld a request by the respondents to appeal against an earlier decree whereby the court was to deliver one judgment rather than settle individual issues in separate judgments.\nIn the light of that decision, Mr Justice Meli had put off the case indefinitely pending the outcome of the appeal proceedings.\nWhen the appeal was called on Tuesday before the court, presided over by Chief Justice Joseph Azzopardi and Mr Justices Joseph R. Micallef and Tonio Mallia, lawyers on either side of the fence put forward their final arguments.\n“The original application was not for the rescission of the property transfer but the transfer of shares,” Dr Victoria Buttigieg from the AG’s Office pointed out, adding that since this case dealt with a very sensitive sector, namely healthcare, the court would be “inundated with evidence” and proceedings would take long if the case was not partitioned.\nLawyer Stefano Filletti, assisting the Lands Authority, insisted that Dr Delia could never have filed the action and had no juridical interest.\n“This was to be decided upon from the start rather than have such doubt dragged throughout the proceedings,” Dr Filletti argued.\n“If a case ever merited that preliminary pleas be heard, it is definitely this,” added John Bonello appearing on behalf of Malta Industrial Parks, pointing out that there was no jurisprudence on this matter. “The only similar case was PM vs Mark Gaffarena,” Dr Bonello continued pointing out that it would be useless for the court to hear voluminous evidence, rather than decide piecemeal upon individual pleas.\nCountering these arguments, applicant’s lawyer Edward Debono recalled the words of the first court which had defined the suit as one of “great importance,” and hence deserving to be handled in one judgment.\nThere were basically two vital issues to be considered by the court on appeal, Dr Debono observed, firstly whether the respondents could have appealed Mr Justice Meli’s decree in the first place.\nHaving the case dealt with piecemeal would protract the case, Dr Debono argued. “This is not right and this is not justice.”\nSecondly, every MP, as representative of the people, had a right to safeguard public property, Dr Debono argued. “When the AG or Lands Authority were not performing their duty, a Member of Parliament had a right to act on behalf of the people and this right did not stop once the deed had been signed.”\nWinding up today’s arguments, Jason Azzopardi, also assisting the Opposition Leader, pointed out that this was probably the greatest lawsuit, in monetary terms, before the Maltese Courts since the value of the deed at issue was €2 billion.\n“It’s absurd to state that if there is a change in the conditions of the transfer, an MP could not go to court to safeguard public property,” stressed Dr Azzopardi, pointing out that “logic and law were to go hand in hand.”\nThe decision on the appeal is expected in March.", "comment_count": 5, "id": 1808}, {"keywords": "", "author": "", "article_body": "A board has been appointed by the government which will establish the priorities for housing – providing financial support to NGOs in line with these priorities.\nThe government said that the board, to be chaired by Rachael Scicluna, will meet for the first time by the end of this week.\nThe board is meant to establish best practice and support for the NGOs that provide non-profit services – in particular housing – for vulnerable members of society, those with mental health issues, former prison inmates and those who require sheltered housing, among others.\nThe board was allocated funds in the last Budget to be able to provide financial help as well as space.\nThe Parliamentary Secretary for Social Accommodation, Roderick Galdes said: “Not all problems are solved by giving someone a house and closing the door. We are looking at housing with a more holistic slant and with these programmes are addressed social challenges for those who need specialised help.”", "comment_count": 2, "id": 1809}, {"keywords": "", "author": "", "article_body": "Whoever happened to visit the Grand Harbour area or looked out from the Upper Barrakka Gardens on Monday was greeted by a different sight than the usual cruise liners.\nThe US Navy vessel USS Arlington moored at Pinto Wharf in Valletta on Sunday afternoon for a scheduled courtesy visit during its second deployment.\nCommissioned in 2013, the USS Arlington (LPD 24) is one of three ships built to commemorate the victims and first responders of the September 11, 2001 attacks, the other two vessels being the USS New York and the USS Somerset.\nCaptain Todd Marzano (left)\nThe San Antonio-class amphibious transport dock ship pays tribute to those lost in the attack on the Pentagon, as well as those who served in its aftermath and is named after Arlington, Virginia, where the headquarters of the US Department of Defence is located.\nShe transports and lands Marines, their equipment and supplies by embarked landing craft air cushions (LCACs) or conventional landing craft and amphibious assault vehicles (AAV) augmented by helicopters or vertical take-off and landing aircraft.\nArlington, whose personnel counts 400 sailors and 700 marines, can support amphibious assault, special operations or expeditionary warfare missions and can serve as secondary aviation platforms for amphibious ready groups.\nPays tribute to the victims and rescue personnel of Arlington County\nThe ship is a member of the Kearsage Amphibious Ready Group (ARG) and has components of the 22nd Marine Expeditionary Unit (MEU) embarked.\nA 9/11 Tribute Room includes displays describing the events in Arlington on that fateful day and honours the 184 victims and thousands of emergency, fire and rescue personnel of Arlington County and neighbouring localities who provided critical emergency assistance.\nAmong the exhibits is a piece of recovered metal from the Pentagon.\nUnder the command of Captain Todd Marzano, the ship left its home port, the Naval Station Norfolk in Virginia on December 17, 2018. Before sailing to Malta, the vessel participated in a training exercise titled Alexander the Great 2019, with the Hellenic Marines in the Pagasitikos Gulf, Greece. It leaves the Grand Harbour on Tuesday.\n\nGeneral characteristics, San Antonio Class LPD\nBuilder: Huntington Ingalls Industries\nPropulsion: Four sequentially turbocharged marine Colt-Pielstick diesels, two shafts, 41,600 shaft horsepower.\nLength: 208 metres\nBeam: 32 metres\nDisplacement: Approximately 24,900 long tons (25,300 metric tons) full load\nDraft: 7 metres\nSpeed: In excess of 22 knots (38.7kph)\nCrew: LPD 17-27 crew: Ship’s company: 383 sailors and three Marines. Embarked landing force: 699; surge capacity to 800. LPD 28/29 crew: ship’s company: 383 sailors and three Marines. Embarked landing force: 650.\nArmament: Two Mk 46 30mm close-in guns, fore and aft; two rolling airframe missile launchers, fore and aft; 10 .50-calibre machine guns\nAircraft: Launch or land two CH-53E Super Stallion helicopters or two MV-22 Osprey tilt rotor aircraft or up to four CH-46/SH-60.\nLanding/attack craft: Two LCACs or one LCU and 14 amphibious assault vehicles.", "comment_count": 0, "id": 1810}, {"keywords": "", "author": "Jacob Borg", "article_body": "Health Minister Chris Fearne announced on Tuesday a drive to promote blood donations in Malta’s towns and villages.\nAddressing a press conference, Mr Fearne said the government was signing a memorandum of understanding with local councils to aid this drive.\nMr Fearne said demand for blood donations was on the increase with 50 bags needed daily.\n“Every bag of blood saves lives. It is one of the biggest acts of generosity by a person”, the minister said.\nHe said around 40 local councils had already signed up to the initiative.\nThe Health Minister said the aim was to generate 1,000 additional bags of blood through the community effort.\nMr Fearne said the government would also be encouraging employees of state and private entities to donate more blood.\nHe also announced that the mobile blood bank, which was out of action due to repairs, was now back in use and would be in Birkirkara this Sunday.", "comment_count": 6, "id": 1811}, {"keywords": "", "author": "", "article_body": "Sea transport between Malta and Gozo registered increases in the last three months of 2018 when compared to the same period a year before.\nThe National Office of Statistics said 1,321,429 passengers travelled between Malta and Gozo during the fourth quarter of 2018, up by 5.4% when compared to the corresponding quarter in 2017.\nThe highest number of passengers was recorded in October – 494,964 or 37.5% of the total for the quarter.\nThe number of vehicles increased by 8.9%, totalling 398,596.\nThe number of trips amounted to 5,820, an increase of 7% over the same quarter in 2017. Most trips took place in October – 2,088 or 35.9% of total trips for the quarter.\nAnnual perspective\nOverall, the number of trips between Malta and Gozo throughout the year went up by 1,090 or 4.8% over 2017. Vehicle movements between the islands increased by 115,880 or 7.5%, over the previous year, while the number of passengers went up by 374,478 or 7%.\nAs in previous years, August recorded the highest number of trips, 2,292 or 9.7% of the total.\nRead: Increase of 8.3% in passengers between Malta and Gozo \nAugust also registered the largest share of vehicles and passengers crossing between the two islands, 172,120 and 620,042, respectively.\nPassenger traffic originating from Ċirkewwa was busiest on Fridays and Saturdays, whereas the highest volumes from Mġarr were recorded on Sundays and Saturdays.", "comment_count": 5, "id": 1812}, {"keywords": "", "author": "Jacob Borg", "article_body": "Health Minister Chris Fearne on Tuesday provided few answers as to where the millions paid by the government to Vitals Global Healthcare (VGH) went.\nDespite a concession agreement which tied the government to forking out around €70 million annually to the company, questions have been raised about what VGH actually did with the money.\nThe local companies behind VGH have never posted any accounts with the MFSA.\nAsked what became of all this money, Mr Fearne said the payments to VGH were “transparent”.\nHe said the National Audit Office was investigating the deal.\nRead: Financial scrutiny of Vitals to remain secret\nVGH was supposed to invest over €200 million in the Gozo, St Luke’s and Karin Grech hospitals.\nThe company pulled out of the concession in December 2017. It was taken over by Steward Healthcare, in what Mr Fearne had heralded as “the real deal”.\nRead: €80m have to be given to VGH for return of two hospitals\nMr Fearne said on Tuesday that Steward had invested €20 million but answers about what VGH had done with taxpayer’s money were in short supply.\nThe deputy Prime Minister walked off when asked further about the matter.\nThe Shift News said last week that millions changed hands behind closed doors when Steward bought the concession from VGH for €1.\n ", "comment_count": 104, "id": 1813}, {"keywords": "", "author": "", "article_body": "Public land and sea are being administered as if Malta were governed as a fiefdom, with no laws to limit government, the Democratic Party (PD) has lamented.“Public assets are being misused and our natural heritage is being squandered. The latest mega-project by Corinthia Group has all these hallmarks,” secretary general and MEP candidate Martin Cauchi Inglott said in a statement.Environmental activist and MEP candidate Camilla Appelgren added that coastal shores and seas rightfully belonged to the people, and the concessions for land reclamation therefore indicated that this government \"is steamrolling on our natural public domain assets”.The party highlighted a “megalomaniac frenzy” of ongoing development projects at Tigné Point, the Fortina in Sliema, Manoel Island and St George’s Bay, all of which it said had been executed through undervalued deals that went against the public interest.This, it said, had become the hallmark of a “senseless government” that did not support Malta’s sustainability.The party said the situation was made worse as people had no access to government-held information, with no sign of the “open government” promised by Prime Minister Joseph Muscat before his election.“These mega projects are increasing the supply of up-market apartments and not coming anywhere near to solving the housing crisis,” Mr Cauchi Inglott said. “Such developers, who are privileged with concessions, should be made to pay social tax, even in the form of affordable housing elsewhere on the island.”", "comment_count": 17, "id": 1814}, {"keywords": "", "author": "", "article_body": "The Planning Authority has given planning permission for a new footbridge to be constructed across Vjal l-Avjazzjoni in Luqa.\nThe 11-metre bridge will ensure a safer environment for passenger movement around Malta International Airport and for students attending the new ITS campus sited at the former head office of Air Malta, the PA said in a statement. \nThe bridge will also reduce traffic accumulation which results in the frequent use of the existing pelican lights in the area.\nThe bridge will have two helical ramps on either side built out of reinforced concrete and spanned over with a steel structure. The visual aim is to have a continuous ribbon emerging from the terrain leading to the bridge structure.\nThe concrete will be given a white smooth finish. The structure spanning the road section will be tubular in light yellow, with the final aim being to create a \"landmark\".\nThe bridge and ramps will be divided to house pedestrian and cyclist traffic, thereby ensuring the safe passage of both. The ramps will have quarter landings to ensure mobility for persons with special needs.", "comment_count": 10, "id": 1815}, {"keywords": "", "author": "Claire Caruana", "article_body": "There were more than 500 complaints filed to the Commission for the Rights of Persons with Disability (CRPD) in 2017, it was announced on Tuesday.\nAddressing a press briefing, the Commission’s compliance unit manager, Bernard Busuttil, told journalists that between October 2016 and September 2016, 522 complaints were received.\nOf these, 319 were pending from the previous years while 203 were “newly-placed”.\nAccording to Dr Busuttil, a drop of 45 complaints over the previous year was registered. He also added that the CRPD worked on 20 requests received from the public for consultancy or advice.\nThe compliance unit manager also noted that the accessibility sector remained the area most-frequently complained about, with 86 new complaints received. On problems in the education sector, the CRPD received 42 complaints throughout the period reviewed, up from 13 in the previous year.\nThe highest number of new complaints for another year were made against the government (89 reports), surpassing the number of reports against the private sector (61 reports).\nSpeaking during the briefing, Commissioner Oliver Scicluna noted that accessibility remained the biggest problem that those with disability faced, pointing out that a recent exercise by the CRPD found that of 300 shops in Valletta, only 33 were accessible to everyone.\nMeanwhile, Parliamentary Secretary Anthony Aguis Decelis, who was presented with the Commission’s report, said that increase in the number of complaints meant that people trusted the CRPD to deal with their problems and so did not hesitate to come forward.", "comment_count": 0, "id": 1816}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Comino hotel and bungalow complex were listed for sale by Engel and Volkers for €100 million, but the company said the listing was a fictitious one created for training purposes and mistakenly published.The listing, which appeared on Monday and immediately raised a storm on social media, appeared to offer a 70,000 square metre site “to be demolished and rebuilt into exclusive development of bungalows / hotel on this exclusive location”.\nHowever, the advert disappeared from the Engel and Volkers website moments after an inquiry by Times of Malta on Tuesday, and director Benjamin Tabone Grech later said the listing had been a mistake by a new employee.“The details in the advert were made up for training purposes and mistakenly published,” Mr Tabone Grech said.\n“The ‘property’ was made up, and none of the directors or certainly any owners gave authorisation for such a post.”\nRead: Minister rules out Comino development\nAccording to the Natura 2000 management plan, issued in 2015, the owners of the hotel and bungalow complex, Kemmuna Ltd, had had been seeking to redevelop the properties for several years and were then in the process of formulating a development plan for the area.The plan warns: “Further development can affect the protected habitats and protected species and if it is to be considered at all needs to take very strong cognizance of the location of these properties and great importance of the surrounding protected land and the impacts that urban development may have on such sites and on the wider SAC / SPA [Special Area of Conservation / Special Protection Area].”Nevertheless, the plan does not rule out further expansion of the hotel or bungalow complex footprint, requiring only that the environmental and planning authorities that the necessary studies are carried out to protect habitats and species.", "comment_count": 58, "id": 1817}, {"keywords": "", "author": "", "article_body": "A man doing cleaning work at Daniel’s Shopping Complex in Ħamrun fell two storeys to his death on Tuesday morning.\nThe police said that the 65-year-old man from Żebbuġ fell to the ground by the entrance to the underground parking at 8am.\nThe victim, a Maltese national, died on the spot, according to the police.\nDaniel's said the man was a private company employee and not a Daniel's complex worker.\nInvestigations are still underway. An inquiry is being held. ", "comment_count": 0, "id": 1818}]