[{"keywords": "", "author": "Edwina Brincat", "article_body": "Two men allegedly involved in a violent mugging last Sunday afternoon were remanded in custody after pleading not guilty to the charges upon their arraignment on Tuesday.\nAddie Magri, 47, and Jurgen Vassallo, 21, both unemployed, from Cospicua, were jointly charged with the violent theft as well as with having slightly injured the victim of the alleged attack.\nMr Vassallo was also separately charged with breaching a probation order handed down a year ago by a Magistrates’ Court.\nProsecuting Inspector Eman Hayman explained how a 63-year-old Cospicua man had been going about his business at his hometown at around 4pm on Sunday, when he was allegedly pounced upon by two men.\nHe was beaten and robbed out on the street, with the two muggers making off with his money and mobile phone. The victim filed a report at the local police station, describing his suspect aggressors as “the son of…” and the “husband of….”, both familiar faces to the man.\nAs a result of the incident, the victim suffered slight injuries and needed treatment in hospital.\nMeanwhile, the police received an anonymous phone call from a person claiming to have been an eyewitness to the mugging perpetrated by the two suspects.\nWhen the men were later rounded up and taken for police questioning, the younger of the two admitted, stating however that his role had merely been one of assistance, while his older partner in crime had allegedly beaten up the victim.\nDuring Tuesday’s arraignment, both pleaded not guilty, with legal aid counsel Christopher Chircop bringing to the notice of the court the particular situation of the younger man who had character problems, as attested by a probation officer who was asked to report on her ward during the arraignment.\nIn fact, the officer confirmed that the young man had intellectual difficulties, although he seemed to have been showing signs of progress lately, keeping regularly to his appointments.\nA request for bail was turned down by the court in view of the premature stage of the proceedings and the fact that the alleged victim was still to testify.\nUpon a request by the defence, the court, presided over by magistrate Claire Stafrace Zammit, recommended that the younger man be detained at the Forensic Unit, in view of his particular predicament.\nAs the hearing reached an end, the elder of the accused was led out of the courtroom, while the younger man wept inconsolably.", "comment_count": 0, "id": 2419}, {"keywords": "", "author": "", "article_body": "The Maltese government joined the European parliament in recognising Venezuelan Opposition leader Juan Guaidó as the rightful president of the country.\nAll Western governments on Monday recognised Mr Guaidó as interim leader, after President Nicolas Maduro rejected an ultimatum to call early voting, following an election last year that is widely seen to have been rigged.\nAfter a Cabinet meeting, the Maltese government said in a statement it supported a European Union declaration issued last month urging Mr Maduro to take the necessary legal steps for democratic presidential elections.\nAfter noting Mr Maduro failed to take the necessary steps, the Maltese government said it joined other member states in acknowledging Mr Guaidó as President ad interim of Venezuela.\nThe decision jars with what Labour MEP Alfred Sant had earlier said in a statement. Dr Sant abstained on the European Parliament resolution, insisting the European Parliament held no legal standing to recognise the status of governments.\n\"It is meaningless for this parliament to express definitive judgements on a situation as complex as in that country,\" the former prime minister insisted.\nThe Nationalist party had also expressed its support for Mr Guiadó in a statement last week, condemning the \"dictatorship\" of Mr Maduro.\nMr Maduro’s leadership brought about corruption, poverty and division, the party said.\nAround two million Venezuelans had sought refuge in nearby countries because of Mr Maduro’s leadership, the Opposition had noted.", "comment_count": 27, "id": 2420}, {"keywords": "", "author": "", "article_body": "Two-thirds of marriages between Maltese couples and couples where one of the spouses is Maltese are still Church marriages, the Curia said on Tuesday.\nIn an analysis of marriages in Malta (excluding Gozo) last year, the Curia said the number of Church marriages in 2018 was 1,192 including 62 marriages where couples married civilly and then also got married at the altar. \nThe Church issued its analysis in the wake of limited information given in parliament in reply to a parliamentary question. \nIt said that the total number of Church marriages between foreign nationals was 73. If the number of marriages between foreign nationals was deducted, the number of Church marriages between Maltese nationals and between couples with one Maltese party was 1,119.\nThe number of civil marriages in 2018 was 1,423. That included marriagesbetween a man and a woman, same-sex marriages, second marriages and marriages between foreign nationals.\nThe total number of civil marriages between foreign nationals was 850. If the number of marriages between foreign nationals was deducted, the number of civil marriages between Maltese nationals and between couples with one Maltese party was 573.\nTherefore, the Curia said, the total number of civil and Church marriages in Malta in 2018 was 2,614 and the total of marriages between Maltese couples and between couples with one Maltese party was 1,692.\n\"The statistics for 2018 also indicate that from the total number of marriages in Malta between Maltese couples, and Maltese nationals with foreign nationals, 66% (equivalent to 1,119) chose a Church marriage, and 34% (equivalent to 573) married civilly. This means that two-thirds of marriages held between Maltese nationals and between Maltese with foreign nationals are Church marriages,\" the Curia said. ", "comment_count": 29, "id": 2421}, {"keywords": "", "author": "", "article_body": "Alternattiva Demokratika has revived proposals for amendments to the Electoral Law to introduce strict proportionality, subject to a national threshold of 2.5%.\nAt present, strict proportionality between votes cast and seats in parliament is only enforced when two political parties are elected to parliament. Should there be successful candidates from more than two parties, parliamentary seats are allocated according to the results in each electoral district, independently of the number of No1 votes which the parties would have won nationally.\nThe AD proposal would extend the current system to apply even when more than two parties make it to parliament, but a party would only make it to parliament if it achieves at least 2.5% of the national vote. That avoids the possibility of a successful single-candidate party becoming 'kingmaker' after election from just one district.\nSimilar proposals were made at meetings of the so-called Gonzi Commission in the early 1990s but no agreement was reached. \nAD representatives outlined their proposals for constitutional change at a meeting with the Constitutional steering committee chaired by President Marie-Louise Coleiro Preca. \nAD also proposed that changes to ensure parliamentary gender balance should also be inclusive of people who identify themselves with neither genders.\nThe party said that since Malta was a lay state the Constitution should no longer be linked to one religion but should spell out its respect for all religions compatible with the democratic state. \nThe party also felt that the President should be elected by an electoral college that would be broader than parliament and include local councils. \nCarmel Cacopardo, AD leader, also emphasised that the Constitution needs to protect the environment.", "comment_count": 0, "id": 2422}, {"keywords": "", "author": "", "article_body": "Updated 3.30pm with ministry reaction\nOnly 0.2 per cent of children under 16 are in poor or very bad health in Malta, compared to 0.8 per cent in the EU as a whole, according to official statistics. \nA total of 95.9 per cent of children in the European Union (EU) were considered to be in 'good' or 'very good' general health, with a further 3.4 per cent in ‘fair health’ in 2017, Eurostat reported on Tuesday.\n\nOn the other hand, in Malta, a total of 98 per cent were in 'good' or 'very good' health, and a further 1.8 per cent in 'fair' health.\nThe situation in Malta is even better when it comes to children under five, with the rate being 99.6 per cent having fair, good or very good health, and only 0.3 per cent having bad or very bad health.\nChildren’s health declined with age for the EU average, however, while those in poor health increased from 0.6 per cent to 0.9 per cent, in Malta, the average remains 0.3 per cent, with no children aged 5-9 years old in this category.\n\nWelcoming the results, the Children's Rights Ministry said that it would continue to look at children's rights in a wider context, noting in particular the imminent enactment of a law for their protection, currently in second reading in Parliament.\nIt said that its aim was to ensure that each boy and girl were able to live in a safe and decent environment, and far from the risk of poverty.", "comment_count": 19, "id": 2423}, {"keywords": "", "author": "", "article_body": "Updated at 4.30pm with MTA comments\nMalta welcomed 2.6 million tourists last year, an increase of 14.3 per cent over 2017, official figures issued on Tuesday show.\nArrivals in December reached 122,759, an increase of 11 per cent when compared to the corresponding month in 2017. While 105,766 were inbound trips for holiday purposes, the remaining were for business and other purposes.\nArrivals from EU member states in December went up by 8.9 per cent to 101,792 when compared to the corresponding month in 2017. Most inbound tourists were aged between 25 and 44 (40.1 per cent), followed by those within the 45-64 age bracket (33.5 per cent). Total bed nights went up by 10.1 per cent to 870,538 nights. The largest share of guest nights (49.3 per cent) was spent in hotels. Tourist expenditure was estimated at €78.3 million, an increase of 1.1 per cent over the corresponding month in 2017.\nAnnual arrivals increase of 14.3%\nTourist arrivals for the whole of 2018 rose by 14.3 per cent to reach nearly 2.6 million.\nTotal nights spent by inbound tourists went up by 12.5 per cent, reaching nearly 18.6 million nights. Expenditure was estimated at €2.1 billion, 8.0 per cent higher than that recorded for 2017. Total expenditure per capita stood at €809, a decrease of 5.5 per cent when compared to 2017. \nTourism has doubled in eight years - MTA\nIn a presentation held later on Tuesday, Malta Tourism Authority deputy CEO Leslie Vella said tourist arrivals had doubled since 2010, when 1.3 million people visited Malta. \nGrowth in new markets was accelerating and the overall growth curve continued to strengthen with time, he added. \nTourism Minister Konrad Mizzi said Malta needed to attract more high-end tourists.\nLast year, Malta had improved its standing in core markets as well as introduced new routes that were not part of the island’s traditional tourism strategy, Dr Mizzi said.\nHe said the USA had for the first time made it into the top 10 tourism arrival markets.\nDr Mizzi said the investment in core markets would continue in 2019 with new routes from Cardiff, Exeter, Verona, among others.\nFrom April, new non-traditional routes from Amman, Cairo and Doha would also open up, he said.\nThe minister spoke of the need to continue investing in Malta’s infrastructure. He said the government planned infrastructure improvements in Paceville, Sliema, Valletta, Marsaxlokk and Birżebbuġa.", "comment_count": 13, "id": 2424}, {"keywords": "", "author": "", "article_body": "A man who was told at the end of a 10-year prison term that he would still be kept in detention while deportation procedures were completed, flew into a rage, assaulted detention offices and was sentenced for a further two years as a result.\nThe prosecutors said Jason Feilazoo had injured several officers and threatened to kill them.\nThe court heard how Mr Feilazoo himself was injured in his struggle with the officers, and pepper spray was used twice. \n\"The court understands that the accused was really frustrated when he got to know that he was going to be kept in detention for a further period of time after having been released from prison after serving a ten-year term,\" Magistrate Joe Mifsud said.\n\"The way the Immigration Department handled this case in the sense that it only started working on the deportation procedures on the 1st April 2018, merely nine days before the accused's release from prison cannot be possibly lauded. \n\"This court is not the competent court to decide whether the accused’s rights were breached as a result of the way the Immigration Department handled this case. However, notwithstanding this scenario, the accused was not justified to act as he acted,  more so when he was fully aware of how to seek redress bearing in mind that he already had other pending cases regarding alleged mistreatment in his regards,\" the magistrate said. \nDuring the proceedings, Mr Feilazoo argued that he had come to Malta from Spain using normal travel documents. He said he had a residence permit in Spain and he was not an illegal immigrant.\nRead: The struggles of foreign inmates who want to serve time back at home\nProsecutors said his residence permit in Spain had expired and Madrid had refused to have him back, meaning that he had to be deported. \nIn his sentence, Magistrate Mifsud said the accused had not only disobeyed orders, but he had behaved aggressively, refusing to be handcuffed and keeping up the struggle even when taken into a van. CCTV footage showed the detention van “swaying from one side to another,” a far cry from the “mere verbal resistance” as claimed by him in his version of events.\nThe court also observed that two officers had suffered injuries before the pepper spray was used, meaning that the injuries could not be “considered as a reaction to the use of pepper spray.”\n“Bearing in mind this scenario, the use of force as well as the use of the pepper spray was legitimate and aimed to reign in the accused and limit his aggressiveness,” the court observed.\nThe court found Mr Feilazoo guilty of all charges and condemned him to two years imprisonment and a fine of  €5,000.\nHe was also declared an illegal immigrant to be deported once he has served his term.\nBack in 2012, Mr Feilazoo had petitioned the authorities to allow him to serve time behind bars in Spain or Nigeria. \n“I don’t want to be here or be a burden on the Maltese government. And Malta doesn’t want me here either. I’ve done everything I was told to do but am still in the dark,\" he had told Times of Malta at the time. ", "comment_count": 0, "id": 2425}, {"keywords": "", "author": "Denise Grech ", "article_body": "Justice Minister Owen Bonnici was curt on Tuesday when asked about Law Commissioner Franco Debono’s comments regarding Prime Minister Joseph Muscat, saying they were part of \"freedom of expression\".\nDr Debono did not mince his words in a blog post last week, describing the Prime Minister as \"the most corrupt politician\" in Malta’s history.\nAsked about the comments, Dr Bonnici said he had \"nothing to add to what had been said\".\nDr Debono had also said the “time had come” to speak out on the Prime Minister, saying he would be able to speak better “tomorrow”.\nHe has not elaborated on his comments since.\nDr Bonnici echoed comments made by the Prime Minister, who also cited freedom of expression when asked about the Law Commissioner's comments. ", "comment_count": 52, "id": 2426}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Reports of alleged abuse of EU public procurement rules in the provision of multi-million direct orders for cleaning contracts at St Vincent De Paul have reached Brussels in a formal request for an investigation.\nSources in Brussels confirmed that a number of documents claiming abuse were sent anonymously to the President of the European Commission Jean Claude Junker and also to OLAF, the EU’s anti-fraud office.\nAccording to the sources, the documents gave details on how X-Clean Ltd, of Naxxar, was awarded repetitive direct orders by the government even before the company was registered.\nREAD: St Vincent de Paul cleaning company set up after getting contract of works\nThe documents also refer to details of €9 million in transactions through direct orders during the past three years, which according to the documents were given abusively and in breach of procurement regulations.\nWhile confirming that the reports have indeed reached the European Commission’s offices, sources close to OLAF said that it was still not known whether the office will commence a full-blown investigation.\n“So far we can only confirm that OLAF is aware of these claims and that we are trying to establish the facts. However, it is still too early to say whether OLAF will investigate further,” the sources said.\nWe are trying to establish the facts\nAsked whether OLAF can open an investigation once the sources of the claim are anonymous, the sources confirmed that this can still be done.\n“Yes, OLAF investigates independently from the source. Once someone passes information to OLAF, the office is duty bound to start gathering information to establish the facts. It is only at that stage that it is decided whether to step up an investigation or not.”\nDespite that in this case no EU funds are directly involved in the procurement of cleaning services at the government’s largest old people’s residence in Luqa, the anonymous report claims that EU procurement rules, which Malta is obliged to follow strictly, were breached by government officials.\nThe Times of Malta has reported that in 2015, instead of issuing a new public tender for cleaning services at St Vincent De Paul, the Family Affairs Ministry, at the time headed by minister Michael Farrugia, decided to award the cleaning contract to a company from Naxxar, which was registered just a few days before.\nAlthough originally the contract was a temporary solution for a few months, until a new tender was issued, the same contract kept being renewed every six months for more than four years and no new competitive tender was issued.\nIn the meantime, while the original tender, in place until March 2015, was costing taxpayers less than €100,000 a month for cleaning services, the direct order resulted in surging bills surpassing the €300,000-a-month mark.\nApart for cleaning, X-Clean started billing and receiving payments for a raft of other services, including hairdressers, technicians, secretaries and gardening, among others. Contracts Director General Anthony Cachia said that his office did not approve such services.\nAt the same time, X-Clean Ltd was also awarded other cleaning jobs through direct orders by the same ministry to provide services at various government residential homes for the elderly across the island.\nFollowing various reports by the Times of Malta, last December the government published a new call for tenders.\nThe call, which asked for companies with a turnover of €12 million over the past three years, is expected to close later this month.\nivan.camilleri@timesofmalta.com", "comment_count": 76, "id": 2427}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man and a woman, who pleaded not guilty last week to their alleged involvement in an attack upon a woman’s car at Żabbar, were spared preventive arrest when the Attorney General lost his bid to revoke their bail.\nNatasha Bugeja, 20 and Ismael Magro, 19, both from Vittoriosa, were arraigned on Wednesday alongside Tyson Bugeja, 23, all three pleading not guilty to having allegedly been involved in the violent episode targeting Tyson’s ex-girlfriend.\nShortly before the incident at Żabbar, the woman reported to the police that she had been receiving threatening phone calls from her ex who, later turned up outside her home, together with a man and a woman and allegedly proceeded to smash the rear windscreen of her parked car.\nThe other man, later identified as Ismael Magro, had allegedly walked about during the attack, while the woman, identified as Natasha Bugeja, sprinkled the contents of a jerry can onto the victim’s car.\nCCTV footage from the scene of crime had led to the arrest of the trio.\nTyson and Natasha Bugeja were jointly charged with causing voluntary damage to third party property and breach of bail, with the former also being separately charged with misuse of electronic communications equipment, threats against the alleged victim and causing her to fear violence.\nMr Magro was charged as an accomplice and driving without a valid licence and insurance cover.\nWhile Mr Bugeja was remanded in custody, the other co-accused were granted bail.\nHowever, following the arraignment, the Attorney General filed a request before the Criminal Court asking for that bail to be revoked, mainly because the alleged victim was still to testify, thus implying a real risk of tampering with evidence.\nMoreover, the gravity of the alleged offences did not merit bail, while the accused could not fulfil the necessary guarantees.\nThe defence lawyers countered that the prosecution had not objected to bail during the arraignment and that adequate bail conditions had been imposed to allay the fear of tampering with evidence.\nThe Criminal Court, presided over by Madam Justice Edwina Grima, declared that there was no reason for varying the discretion exercised by the Magistrate’s Court which had assessed all the circumstances of the case and more so since the prosecution had raised no concern regarding such risk of tampering.\nIn her decree, Madam Justice Grima also observed that adequate bail conditions had been imposed, in addition to a Protection Order in favour of the alleged victim.\nMoreover, so far, both Natasha Bugeja and Ismael Magro appeared to have abided by the set conditions, the Court observed.\nApart from such considerations, the Court noted that the AG’s application in respect of Mr Magro lacked certain legal formalities essential for its validity, namely the AG’s signature was missing and the act of the arraignment had not been duly stamped.\nIn the light of all such considerations, the court turned down the AG’s request, decreeing that bail was to stand.\nLawyers Franco Debono, Amadeus Cachia and Arthur Azzopardi were defence counsel to Ms Bugeja, while Dr Azzopardi also assisted Mr Magro.", "comment_count": 0, "id": 2428}, {"keywords": "", "author": "", "article_body": "The Democratic Party said on Tuesday that it is against the introduction of gender quotas in Parliament, as it will set the progress women have made backwards, rather than promote their success.\n\"This form of positive discrimination is unjust, will further demean women, and is fundamentally undemocratic,\" it said in a statement.\nThe government has unveiled plans for quotas to raise the number of women in parliament. The idea is reportedly to increase the number of seats in the House, reserving them for women.\nWomen are not tuna and should not be the subject of quotas. It is degrading to women to introduce quotas, as if they cannot succeed on their merits- Marlene Farrugia\n\"We have said it before and we will say it again. Women are not tuna and should not be the subject of quotas. It is degrading to women to introduce quotas, as if they cannot succeed on their merits,\"MP Marlene Farrugia said.\nShe said the PD believed in equality between men and women, which meant that it opposed wasteful gender quotas in parliament, which though a form of positive discrimination, were a form of discrimination nonetheless.\n“If a government really wanted to fix things it would start by addressing the gender pay gap which is in real life the gender ‘pain’ gap, being so rife and blatant and a major weapon used to blast any possible chance for effective emancipation of women,” she said.", "comment_count": 42, "id": 2429}, {"keywords": "", "author": "", "article_body": "An MP has complained that parking bays reserved for MPs at Mater Dei Hospital are being taken up, and suggested security personnel to prevent abuse. \nThe issue was raised in a parliamentary question by Nationalist MP Mario Galea to Health Minister Chris Fearne: \"Can the deputy prime minister and minister of health kindly ask the hospital administration to ensure that the parking bays reserved for MPs are not used by other people, including consultants, because it has become impossible to find a vacant parking spot allocated for MPs?\"\nHe asked why there was no security personnel to ensure the bays were only used by those entitled for them.\nMr Fearne replied that the parking bays reserved for members of parliament were continuously monitored by parkers and action was taken whenever anyone parked abusively and without need.  \nThere are four parking bays reserved for MPs at Mater Dei.\nParking at Malta's general hospital may be a headache for the thousands who visit daily. ", "comment_count": 74, "id": 2430}, {"keywords": "", "author": "", "article_body": "A suspected burglar was seriously injured early on Tuesday when he jumped or fell a height of two storeys, apparently to avoid the police.\nThe incident happened at about 1.30am when the police were alerted to a suspected burglary in a shop in Duke of Edinburgh Street, Ħamrun. A police patrol found the shop closed but heard noises inside.\nThe Rapid Intervention Unit was called to assist. Officers searched the area and entered a building behind the shop, in St Vincent Street.\nThe officers heard a noise of breaking glass and later found the man, a Romanian, injured in the yard of a garage behind the shop. An amount of cash was found in his possession.\nHe was taken to hospital where his injuries were described as serious. ", "comment_count": 17, "id": 2431}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Replete with expletives, the insults aimed at Godfrey Farrugia are often sexist and portray him as a henpecked man who should give up on politics.\nThe Democratic Party leader is often in the line of fire by many who resort to chauvinistic rhetoric, saying he should be wearing a skirt, or doing chores some believe should only be associated with women. \nThe Democratic Party MP and former Health Minister shared some of the hate speech messages he often receives as part of a new Times of Malta #stophate campaign.\nThe campaign is aimed at tackling the proliferation of hate speech and the dangerous discourse that has swamped social media.\nWatch: ‘I wish migrants would rape your wife’ - Peppi Azzopardi\nThe project also seeks to raise awareness on the impact hate speech can have on its recipients and the responsibilities that come with freedom of speech.\nDr Farrugia and his partner MP Marlene Farrugia are continuously at the receiving end of insults or threats in various forms, including letters, photo montages and Facebook messages.\nHowever, some messages are more sinister.\nIn one letter, the couple was told that although the murderers of slain journalist Daphne Caruana Galizia were behind bars, the Farrugias should be on their guard as there were several people who were \"willing to kill their mother for money\".\nIn one image, Dr Farrugia was depicted with a noose around his neck, while in a separate message he was urged to hang himself.\n\"There is nothing wrong with having different opinions, however, we are all obliged to respect each other's opinions,\" the MP said.\n\"Threats and insults do not only harm the victim, but also the perpetrator, as the insults erode their own dignity.\"\nThe Times of Malta campaign will feature other personalities reading out the hate messages levelled out at them on social media.\nRead: #Stophate project aims to clamp down on Malta's online hate speech\nHave you been a victim of hate speech? Send us an email on mynews@timesofmalta.com", "comment_count": 177, "id": 2432}, {"keywords": "", "author": "", "article_body": "The European Parliament has no legal standing to recognise the sovereign and diplomatic status of governments, Labour MEP Alfred Sant told the European Parliament as he abstained on a resolution - later overwhelmingly approved - calling for the recognition of the Opposition leader in Venezuela as the rightful president.\n“Nor should it seek to achieve such a standing, despite the empty and absurd claim that it will have been the first EU institution to take a definitive stand on Venezuela. It is meaningless for this parliament to express definitive judgements on a situation as complex as in that country,” the former prime minister said.\nAll Western governments on Monday recognised Juan Guaido as interim leader, after President Nicolas Maduro rejected an ultimatum to call early voting after an election last year widely seen to have been rigged. \nDr Sant said the current Venezuelan regime descends from the first democratic government of Hugo Chavez that introduced social and economic reforms against a no-holds-barred opposition from right wing forces, all out to defend their vested interests.\nDuring the resulting struggle, the Chavez and then Maduro governments committed huge mistakes, became unacceptably authoritarian, delivered for a while on their social promises, but ran the market-based economy into the ground. Allegations of corruption abounded.\n“I cannot endorse such an administration. Neither though, can I bless an Opposition that has been over the years, thoroughly intransigent, ready to sabotage the actions of a legitimate government, and now openly trades with President Trump for his help to take over the state,” Dr Sant said.\nThe resolution passed with 439 votes in favour, 104 against and 88 abstentions.", "comment_count": 19, "id": 2433}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday.\nTimes of Malta reports how Somali terrorists shot a Maltese port manager. It also says OLAF the EU anti-corruption agency, has been called to investigate the award of contracts at St Vincent de Paule home.\nThe Malta Independent says the prime minister dismissed Franco Debono's comments about him as 'freedom of expression'. It also says the government has refused to publish Corinthia contracts. \nIn-Nazzjon leads with the murder of Maltese port works manager Paul Anthony Formosa.  It also reports that a man died in Gozo after being admitted to hospital with an infection in his face and being made to wait for hours. \nl-orizzont says Maltese port worker Paul Anthony Formosa was being watched by the Somali terrorists for some time.  It also reports that the government is extending the list of free cancer medicines. ", "comment_count": 0, "id": 2434}, {"keywords": "", "author": "Keith Micallef", "article_body": "Establishing the number of vacant properties owned by the State seems to be a long shot, as a request for the Lands Authority to furnish such information was rejected on the grounds that this was “humanly impossible”.\nThe issue came to light in Parliament, when Nationalist MP Ryan Callus, who is also the Opposition’s representative on the Authority board, asked Planning Minister Ian Borg to table a full breakdown of vacant dwellings by location.\nMr Callus also asked for the list of complaints which the Authority received over illegal placing of tables and chairs in public places and the number of pending applications for ground rent redemption of agricultural land.\nA fourth parliamentary question was filed for the list of architects engaged to make valuations for all transactions carried out and those in the pipeline since the Authority’s establishment three years ago.\nNone of the questions were answered. Dr Borg justified himself saying that such requests, “demanded a large amount of human resources and time” and consequently were deemed as “humanly impossible” to be entertained.\nThis was the second time in less than a year that Dr Borg gave this reason for refusing to divulge information. Last July, he had also deemed it impossible to table all planning documents related to the decision to narrow part of Mellieħa Bypass.\nAsked for his reaction by the Times of Malta, Mr Callus on Monday accused the Planning Minister of trying to hide the “complete failure” of the Lands Authority on various fronts.\n“Listing the number of complaints over chairs and tables is no impossible task. If this were true it would be an admission that the Authority it turning a blind eye to people’s complaints,” he said.\nAs for the architects engaged, Mr Callus pointed out that he had raised the issue in Parliament, as the authority had not been forthcoming when he had made the request during a board meeting.\nEstablished in the summer of 2016, the Lands Authority was part of a government reform to overhaul the management of State properties and bring about more transparency on issues like expropriations.\nSuch pledges had been made in the aftermath of the so-called Gaffarena scandal, which involved the acquisition of part of a Valletta property by the defunct Lands Department for €1.65 million. The deal had fuelled controversy after it transpired that the vendor, Marco Gaffarena, had bought it a few weeks before for a fraction of that price.\nThis led to the resignation of Michael Falzon from the Cabinet, on the strength of a National Audit Office investigation which concluded that there had been collusion between the Lands Department and Mr Gaffarena.\nIn April last year, a court rescinded the controversial expropriation deal.", "comment_count": 43, "id": 2435}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Opposition MP Simon Busuttil vowed to take the government before the European Court of Justice should his efforts before Maltese courts fail to kick off investigations into Tourism Minister Konrad Mizzi and OPM chief-of-staff Keith Schembri.\nFor the second time in just a few weeks, the courts last week turned down a request for a magisterial investigation into the Tourism Minister and the Prime Minister’s top aide in the wake of the Panama Papers revelations.\nThe latest ruling against him only served to certify the dismal state of the Maltese judiciary and of Maltese democracy more generally, he said in Parliament on Monday, as he quoted extensively from the Venice Commission report into the rule of law in Malta.\nAmong its findings, the Venice Commission concluded that the Maltese justice system fell short of ensuring the independent functioning of the judiciary. Furthermore, Dr Busuttil added, it had argued for the separation of the roles of attorney general and chief public prosecutor, due to the conflicts of interest which could arise when members of the government merited prosecution by the government’s attorney.\nThe report also stated that the Prime Minister had too much power, and called for additional powers to be given to the President and for the role of President to be filled with the approval of an absolute majority of MPs. It also cautioned that Parliament was too weak to serve as a sufficient check on the executive, calling for the empowerment of the country’s highest democratic institution and for an end to the practice of appointing backbenchers to Government boards.\nDr Busuttil took Maltese institutions to task for failing to move against Dr Mizzi or Mr Schembri. In doing so, they were failing to uphold legal obligations which emanated from various EU directives concerning the prevention of money laundering, he said.", "comment_count": 98, "id": 2436}, {"keywords": "", "author": "", "article_body": "The process to select a new judge to sit on the European Court of Human Rights has started but very little official information has been issued even if the Council of Europe’s Parliament Assembly demands a “fair and transparent” procedure.\nThe nine-year term of office of the incumbent, Chief Justice Emeritus Vincent De Gaetano, expires on September 19 and the government has been invited to submit a list of three candidates by March 6. It is the Parliamentary Assembly that makes the final choice, which is expected to happen some time in April.\nA call for applications from candidates “possessing the necessary qualifications and expertise” was made in The Malta Government Gazette in late November. The deadline was December 21.\nThe notice, which was also carried in a Sunday newspaper in early December, referred to article 21 of the European Convention of Human Rights, which lays down that the judges “shall be of high moral character and must either possess the qualifications required for appointment to high judicial office or be jurisconsults of recognised competence”.\nThey must be able to actively engage in either the English or French language and also be able to listen, read and understand the other.\nThis would be Malta’s fifth judge to sit on the Strasbourg-based Court. Chief Justice Emeritus John Cremona served between 1965 and 1992. He was followed by chief justice emeritus Giuseppe Mifsud Bonnici, human rights lawyer Giovanni Bonello and then by Dr De Gaetano.\nTo ensure gender balance at the European Court of Human Rights, the Parliamentary Assembly expects that at least one of the three nominees should be from “the under-represented sex”. \nThey must be able to actively engage in either the English or French language\nAbout a third of the Court judges are women.\nThis condition had caused problems for the Maltese government in 2009 when its list of was rejected three times because none of the candidates was a woman.\nLegal profession sources said interviews with applicants had either just started or were about to. It is not known whether the selection committee will be interviewing all applicants or just the ones it shortlists.\nThe government has made no official announcement so far about the selection process, apart from the call for applications. \nWhen asked about the matter by Times of Malta, a Justice Ministry spokesman, however, said the process to draw up a shortlist of three candidates was ongoing, adding that, thus, some of the questions made by the Times of Malta could not be “met”.\nAmong other things, the ministry was asked who appointed the selection committee and who were its members, arguing that since viva voce sessions were to be held the applicants would, in any case, know their identity.\nLegal sources said they hoped the government would at least adopt the same kind of transparent process followed by other member states and announce both the composition of the selection committee and the three nominees, and their CVs, once these are decided and the Parliamentary Assembly was informed.\nMalta first acknowledged the jurisdiction of the European Court of Human Rights on May 1, 1987, just over three months before the European Human Rights Convention became part of Maltese law. \nAll people living in Malta had also been granted the right to petition organs of the Council of Europe in Strasbourg.\nLast year, 30 new cases involving Malta were registered with the European Court of Human Rights. This was the highest since 2015 (24, 25 and 22 respectively).", "comment_count": 9, "id": 2437}, {"keywords": "", "author": "Ivan Martin", "article_body": "Land reclamation is “not on the table” as part of a proposed Corinthia Group mega-development project in St Julian's, Tourism Minister Konrad Mizzi said on Monday.\nLast month Times of Malta reported that the government had granted unlimited rights to the Corinthia Group to reclaim the seabed around the peninsula it occupies at St George’s Bay and build on it.\nAccording to a draft deed, which has still to be approved by Parliament and signed, the Corinthia Group can reclaim land and then use the newly claimed area to build apartments, offices and retail space for purely commercial purposes.\nOn Monday, Dr Mizzi told parliament's Environment Committee that both sides had agreed that land reclamation was not on the cards. It would not be considered for the duration of the emphyteusis, he said.\nDuring Monday's session, Dr Mizzi gave an extensive overview of the ongoing discussions between Corinthia and the Government.\nThe project, which will include a six-star hotel as well as various apartment blocks on the St George’s Bay peninsula, has been a bone of contention with several stakeholders decrying the deal.\nRead:Corinthia MOU signed in 2015 remains hidden\nThe project had been proposed by the Corinthia Group as an alternative to intensifying touristic development on the site, which was permissible under the previous agreement.\nThe hoteliers, he said, wanted the ground rent agreement and certain development conditions (the exclusion of real estate development) to be waived.\nAt least 50 per cent of the area would be dedicated to touristic development, while the rest would be soft and hard landscaping available to the public, the minister said.\nRead:Corinthia to pay just €17m for peninsula\n \nMinister assures real estate sector\nDr Mizzi also highlighted how the Developers’ Association had raised concerns that the flooding of the real estate market with apartments could negatively affect the market leading to price fluctuations.\nOn this, he said that Corinthia Group was ready to commit to not putting any more than 25,000 square metres of real estate on the market at any time.\nThis would be staggered in a system of phasing over a period of 25 years, so that the market was not affected.\nAnother bone of contention was the possibility of the foreshore being declassified, which would allow construction up to the water’s edge - something that Dr Mizzi said was not on the cards either.\nCorinthia would not be allowed to sell any part of the project during the period of the emphyteusis, and once this had expired the land – excluding the residential development – would pass back to the public.\nPrime Minister Joseph Muscat (right) with Corinthia chairman Alfred Pisani.\nA joint monitoring committee would be set up to oversee the various stages of the projects.\n“I am sure the project will be a success and Pisani family [the investors behind the project] are committed to having their flagship hotel here and seeing this through,” he said, later adding that he was sure that the country would one day look back and say what a success the project had been.\nOpposition demands copy of MOU\nThe session was triggered by a request by lawyer Claire Bonello who wrote to Chairman Alex Muscat on behalf of residents, local councils, NGOs and other stakeholders.\nThe start of the lengthy and heated session saw the Opposition members insist on being given a copy of the preliminary Memorandum of Understanding reached between the government and Corinthia – a request which was repeatedly shot down.\nWhile declining to publish the MOU, Dr Mizzi said the final contract would be made public.\nShadow Environment Minister Jason Azzopardi put forward a series of questions. Had traffic impact assessments been carried out? Were as many as 12 tower blocks being considered, as had been reported in the media? And, why was the land being transferred at much less than it was valued?\nAlternattiva Demokratika’s Arnold Cassolla said some people needed a reality check. A six star hotel was all well and good, but the surrounding neighbourhood was far from six star.\nResidents are concerned about how the proposed project will impact their lives.\nVeteran environmentalist Alfred Baldacchino said the Minister’s presentation had given a lot of financial information, but not so much on the environment.\nThere would certainly be a negative impact for residents, and tourists who visit during construction period.\nDin l-Art Ħelwa’s Maria Grazia Cassar said her greatest concern was the apparent lack of planning.\nThe authorities appeared to be reacting to developers and not the other way around.\nLocal plans had not been updated and yet the project appeared to be going forward, she said.\nThe session is ongoing.  ", "comment_count": 28, "id": 2438}, {"keywords": "", "author": "Edwina Brincat", "article_body": "One of four youngsters charged with regards to an arson attack upon a vehicle at Mellieħa last Monday evening will stay out on bail, in spite of an attempt by the Attorney General to have this revoked.\nPaul Farrugia, a 28-year old Siġġiewi resident, was arrested on Wednesday, alongside Joel Falzon, 23, from Safi, siblings Danica and Silvan Cilia, 22 and 20,from Rabat after leading the police on a movie-like car chase after allegedly setting fire to a vehicle at Selmun.\nAll four were granted bail against a deposit of €1,000 and a €10,000 personal guarantee each, under orders to sign the bail book and to abide by a curfew.\nThe following day, the Attorney General filed a request before the Criminal Court asking for bail to be revoked in respect of Mr Farrugia, since proceedings were still at an early stage, there was a real risk of tampering with evidence and the accused failed to satisfy the legal requisites for bail.\nThe man’s defence lawyers, Roberto Montalto and Joseph Giglio, countered that the facts of the case had not been contested, with their client admitting to most of the charges. Moreover, the magisterial inquiry guaranteed the preservation of evidence, thus eliminating the risk of tampering.\nWhen delivering its decree on Monday, the court, presided over by Madam Justice Edwina Grima, declared that there was no reason for varying the discretion exercised by the Magistrate’s Court which had imposed stringent bail conditions.\nMoreover, so far, the accused appeared to have been abiding by the set conditions, the Court observed, adding that still contested facts were to be resolved on the basis of court expert reports and the testimony of police witnesses.\nFor this reasons, the court turned down the AG’s request, decreeing that the bail was to stand.", "comment_count": 0, "id": 2439}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Paul Anthony Formosa, a Maltese operations manager killed in Somalia, has been described by former colleagues as a lively man always looking for ways to improve and challenge himself.“Paul was a family man and a delight to speak to. Even if you disagreed with him, you’d enjoy the argument,” Stephen Calleja, who worked with Mr Formosa for 18 years at the Malta Freeport, told Times of Malta.The 52-year old was killed by gunmen from the terrorist group Al Shabaab in the Somali port of Bosaso on Monday. He was attacked while at work for P&O ports, a subsidiary of the Dubai-based global operator DP World.Mr Calleja said his former colleague, with whom he had remained in touch and who regularly visited the Freeport on his trips back to Malta, had always been an ideas man who would look for ways to improve any situation he found himself in.\n\n\n\nThe Malta Freeport also paid tribute to its former employee.“Paul was a hardworking employee, lively, open-minded and loved by his colleagues,” CEO Alex Montebello said in a statement. “We are extremely shocked to learn of this attack and our thoughts are with his family during this most difficult time. “Paul had a very good relationship with the freeport and he visited the terminal regularly whenever he came to Malta. He will be missed.”", "comment_count": 13, "id": 2440}, {"keywords": "", "author": "Ivan Martin", "article_body": "Lengthy waiting times for outpatient appointments have been singled out by the European Commission, with a new report saying the Maltese were waiting an average of 40 weeks for a first appointment at the national hospital.  \nAccording to the European Social Policy Network – a Brussels body that provides the Commission with independent research – outpatient waiting times in Malta were “long and have been increasing”. \nJust over a year ago, the National Audit Office had found that the average patient waited more than eight months for their first outpatient appointment at Mater Dei.\nOn average, patients across 18 departments at Mater Dei Hospital had to wait 10 months before being granted a first outpatient appointment. Similarly, data on pending unscheduled and scheduled interventions in the different specialities also suggested long waits, especially in the orthopaedics department, where patients waited an average of 220 days for treatment. \nLong and increasing waiting lists for some radiological investigations were also highlighted at the hospital’s medical imaging department. On the other hand, the report on inequalities in access to healthcare concludes that waiting lists for inpatient care for a number of procedures, such as cataract surgery, had reduced substantially in recent years. \nInpatient care is best secured by consulting specialists in the private sector first\nOnly 0.1 per cent of respondents reported unmet needs for medical examination due to long waiting lists. \nOverall, the population coverage of the public healthcare system was ranked as “high”, comparing very favourably with other EU countries as documented through the EU statistics on income and living conditions. \nBetween 2005 and 2015, the public share of health expenditure increased by more than a third. \nDespite this, in 2015 health expenditure in Malta remained below the EU average – both in per capita terms and as a share of the island’s GDP.  Challenges arise primarily because the same health consultants and specialists are allowed to provide services in both the island’s public and privately run hospitals and clinics\nThe island’s small size meant that citizens enjoyed a good distribution of health services with regional healthcare centres and other smaller clinics scattered around the country.\nAnd just as there was no incidence of inability to access free healthcare as a result of geographical limitations – a serious concern in some other member states, unmet needs for dental examination were also considered “very low”.\nMalta’s challenges concerning healthcare access arise primarily because the same health consultants and specialists are allowed to provide services in both the island’s public and privately run hospitals and clinics.\nThis “severely limited” the ability of health authorities to extend outpatient opening hours and is partially responsible for long outpatient waiting times, the report concludes. \n“As a result, many believe that inpatient care in public hospitals is best secured by consulting specialists in the private sector first. This helps patients who can afford to pay for private consultations to by-pass, or at least minimise, their waiting times for inpatient care,” the report authors conclude. \nThis, however, also created pressures for pensioners and families on low incomes who were in need of specialist care and were often unable to afford a private fee-paying consultation. \nWhen these vulnerable people were prescribed medicines that are not listed in the government formulary, their challenges become harder. \nA lack of research into this field meant it was “very difficult” to assess how big this group was: although out-of-pocket expenses were reported to be on the high side, taking up 28 per cent of total health spending, nearly double the EU average of 15.3 per cent.\nThis put Malta among the top third of countries with the highest rate of out-of-pocket spending on healthcare.", "comment_count": 35, "id": 2441}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Aaron Bugeja, the magistrate hearing the compilation of evidence against the daughters of former EU Commissioner John Dalli, has expressed frustration that the case has stalled once again, after the prosecution said that 'superiors' did not want to separate the proceedings against the six co-accused.\nA year since criminal charges were first issued against Louise Dalli and Claire Gauci Borda, alongside foreign nationals Eloise Marie Corbin Klein, Charles Ray Jackson, Elizabeth Jean Jackson and Robert Mitchell McIvor, little progress had been registered.\nAll six co-accused were charged over allegations of money laundering, misappropriation of funds, fraud, making a false declaration to a public authority and the falsification and use of documents.\nMs Gauci Borda stands separately charged with breaching the Money Laundering And Financing Of Terrorism Act and with failing to carry out her professional duties as an accountant and auditor. The court granted the prosecution one week to regulate its position, pointing out that such a decision was a prerogative of the Attorney General\nDuring the previous hearing in the compilation of evidence over money-laundering allegations, the court had approved that the sitting could take place at the private residence of three of the co-accused, so as to circumvent logistical difficulties. This followed the declaration by lawyer Arthur Azzopardi, assisting Eloise Marie Corbin Klein, Charles Ray Jackson and Elizabeth Jean Jackson, that his clients were not fit to plead, due to advanced dementia.\nDuring the previous hearing, the court was also informed that Mr McIvor had since passed away.\nOn Monday morning, prosecuting Inspector Yvonne Farrugia said: “At this stage I’m not saying the AG does not want to separate proceedings, but that the superiors had taken that stand.”\nThe court granted the prosecution one week to regulate its position, pointing out that such a decision was a prerogative of the Attorney General.\n“Quite frankly, when in the decree of December 15, I had accepted to hear the case at the Jacksons’ residence, the idea was so as not to stop the proceedings,” the magistrate remarked.\nOn Monday, Dr Azzopardi explained in court that his clients were not entitled to care in Malta and had presented a note claiming that the prosecution was “obstinately refusing to play ball” in view of his clients’ medical problems.\nLawyer Stephen Tonna Lowell, assisting the Dalli sisters, said the strategy adopted by the prosecution, be it the Attorney General or the police, was wrong: “That the police come here after a year of having pressed charges and the Attorney General was not allowing the separation of the cases is unacceptable.”\nLawyer Stefano Filletti, who is also appearing for the Dalli siblings, argued that there was a right to justice within a reasonable time. The court was being practical in its efforts to solve the impasse, he said, but despite its best efforts there was a problem.\nTwo of the persons charged, namely Elizabeth Jean Jackson and Eloise Marie Corbin Klein, have so far never appeared in court.\nFrom the very start Dr Azzopardi had informed the court that one of the women had survived a stroke, while the other had mobility problems which impeded her from being physically present in court. Now it appears that their health had worsened.\nThe case continues later this month.", "comment_count": 0, "id": 2442}, {"keywords": "", "author": "", "article_body": "Firms’ poor conduct and prudential arrangements may often lead to AML/CFT shortcomings, the Malta Financial Services Authority said on Monday, saying this conclusion was drawn from its regulatory activities.\nThe MFSA’s remit is to support national anti-money laundering and terrorist financing supervision by ensuring that all regulated firms have in place broader, overarching systems and controls to counter potential money laundering activities, working closely with the FIAU – the national AML/CFT supervisory agency.\nA recent National Risk Assessment highlighted that money laundering and terrorist financing may represent a threat to the stability, profitability and integrity of the financial services sector but also to the jurisdiction.\nThe authority said in a statement that as Malta establishes itself as a leading global player in remote gaming, e-money, digital currencies and FinTech innovations, it was critically important for the MFSA to strengthen its regulatory setup to mitigate any current and future risks which jurisdictions like Malta may face in the future.\nThe MFSA on Monday published its Anti-Money Laundering/Countering Financing of Terrorism (AML/CFT) supervisory strategy articulating its plans of how AML/CFT supervision will be fused within its conduct and prudential supervisory activity.\nThe strategy is focused on enhancing the MFSA’s approach towards its role in AML/CFT supervision but also to enhance its supervisory standards in order to safeguard the integrity and trust in the Maltese financial services sector.\nThe MFSA also provided guidelines for regulated firms indicating the applicable procedures and controls expected out of them.\nThe MFSA’s AML/CFT supervisory strategy document may be downloaded from here.", "comment_count": 2, "id": 2443}, {"keywords": "", "author": "", "article_body": "Updated 9.30pm\nA 15-year-old boy had to be hospitalised with head injuries, after he was allegedly attacked by another student at the Pembroke secondary school on Monday.\nThe teenager's father turned up at the school later but left the school grounds before police officers arrived. He later turned himself in to the police later in the evening. He has been released on police bail pending further investigations.\nThe violent incident, which drew condemnation from two unions and Education Ministry, was sparked when two teen students - one in form 3 and the other in form 5 - got into a fight. \nShortly afterwards, the younger student's father arrived at the school, accompanied by two other men. Two staff members, understood to be an assistant head and a teacher, were hurt as they tried to break up the fight. \nBy the time police officers arrived, the father and his two accomplices had left the premises. The parents of the other child only came to the school when they were called in.\nLawyer Arthur Azzopardi told the Times of Malta that his client - the 15-year-old's father - had been provoked into a fight. He said the teachers were injured not by his client but by a third person.\n\"On behalf of the family of the assaulted minor we wish to express our regret at the teachers having been injured. We show our full support and solidarity with the teachers and support all calls made by the relative unions to increase security within schools such as CCTV since had such cameras been in place the police would know who the perpetrator is.\"\nMonday's altercation involved a Maltese and Libyan student, and a teacher who spoke on the condition of anonymity blamed the incident on bubbling tensions between students from the two countries.  \n\"It's getting out of control,\" the teacher said. \nUnions point finger at authorities\nThe Malta Union of Teachers condemned the incident, stating it was having to say the “same things over and over”, with instances like this proving the union right.\nThe MUT said it was currently in contact with the respective authorities and would continue to look into the issue at this school and assist members accordingly.\nIt reiterated its appeal \"for the umpteenth time\" to the government to equip schools with adequate security measures to ensure that similar incidents were avoided.\nThe Union of Professional Educators also slammed education authorities, saying their 'lack of foresight' had led to such situations.\nThe ministry had failed \"multiple times\" to protect education sector workers despite several pleas, the UPE said. \nIn a separate statement, the Education Ministry said that the government would be fast-tracking the introduction of harsher penalties for violence in schools.\nThose proposals would see fines in such cases reach €5,000.\nThe victims in Monday's case would be offered all the support they needed, the ministry added. ", "comment_count": 0, "id": 2444}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Labour MEP Marlene Mizzi insisted in court on Monday that while she was using an office in Valletta which belonged to her daughter, she was doing so free of charge and not 'pocketing' any EU funds allocated for the purpose.\n“I’m a person of integrity. No one ever pointed a finger at me,” the MEP said during libel proceedings against Nationalist MEP David Casa.\nThe proceedings were instituted after comments given by Mr Casa to Malta Today wherein he said that the PL MEP was leasing office premises from her daughter “payment free, necessarily implying these funds are pocketed.”\nAnswering questions by her lawyer Edward Gatt, Ms Mizzi explained how she had been offered the premises, owned by her daughter, in Strait Street, Valletta, to be used as an office.\n“It was vacant. MEPs are duty bound to have an office in Malta, separate from any organization, including their political party. I don’t have an office at the PN headquarters, unlike Mr Casa,” Ms Mizzi said.\n“I don’t rent it. I use it for free,” she insisted, saying that her daughter would not accept money. Moreover, the rules of the EU Parliament did not favour money handed over by MEPs to family members.\n‘Pocketing,’ she said, had a very specific meaning in the English language. It meant taking something that was not yours.\nShe pointed out that barely one week before publication of the article, a European Parliament vote on the general expenses account had called for more transparency.\nIn his article Mr Casa failed to say that she had voted in favour of transparency while criticising others who had not.\n“He said I was leasing the premises and pocketing funds, but failed to say that I too had voted for transparency. He only mentioned me as he pleased.”\nTaking the witness stand, Mr Casa said that he made his comments in reply to an email by newspaper editor Saviour Balzan. He had asked him to publish his reply in full,  but he chose to do otherwise. Mr Casa said that in his email he had not mentioned Ms Mizzi by name, but had made reference to “an MEP.”\nMoreover, he had based his statement on what MEP Mizzi had already said in comments reported by Times of Malta. Dr Gatt asked whether Mr Casa had taken steps against Mr Balzan.\n“No. I take steps when I choose to,” came the reply.\nThe case continues in March.\nLawyers Edward Gatt and Mark Vassallo assisted MEP Mizzi.\nLawyers Jason Azzopardi and Kris Busietta assisted MEP Casa.", "comment_count": 0, "id": 2445}, {"keywords": "", "author": "", "article_body": "An Air Malta flight from London declared a medical emergency over France and diverted to Geneva.\nAviation websites reported the emergency close to the Swiss border, just under half-way through the flight from Heathrow to Malta.\nA spokesman for Air Malta said a passenger aboard the plane needed medical attention and that the plane would land shortly in Geneva.\nThe passenger was given emergency treatment by a doctor who happened to be on board. \nNo further details were available.\n ", "comment_count": 2, "id": 2446}, {"keywords": "", "author": "Ivan Martin", "article_body": "A new Church fund launched on Monday will help tackle the growing economic inequality between the ‘haves’ and ‘have-nots’ in Malta, said former minister and Central Bank governor Josef Bonnici. \nThe Voluntary Solidarity Fund aims to address “socio-economic decay” that has started to take hold in Malta.\nProf. Bonnici, who will oversee the new fund, told reporters that as the island’s economy developed further, the disparity between the successful and those struggling to make ends meet would continue to grow.\nThe fund, he said, would not give hand-outs to those on the lower end of the ladder, but would instead be focused on helping get people back on their feet by investing in them.\nOur approach is going to be based on the principle of teaching a man to fish\n“Our approach is going to be based on the principle of teaching a man to fish,” he said.\nThe fund will, for instance, offer financial assistance in the form of interest-free loans for people aspiring to set up their own business, or looking to undertake training or further their education, he said.\nThe Archdiocese of Malta made the first contribution to the fund with a €5,000 donation. A board will start reviewing applications for assistance as they come rolling in.\nAuxiliary Bishop Joseph Galea Curmi said the solidarity initiative would not be taking the place of any existing Church organisations such as Caritas, but would work in tandem with them, complimenting their work.\n“We hope, through this fund, to help people get back into a more productive and dignified life,\" he said.\nThe fund is part of an international initiative based on a call by Pope Francis for solidarity to be put into practice.", "comment_count": 15, "id": 2447}, {"keywords": "", "author": "", "article_body": "Marsamxett residents have been given two extra months to apply for a scheme which will fully refund them the cost of restoring their balconies. The Planning Authority scheme, which will now end on March 31, offers a 100 per cent refund of costs related to fixing traditional timber or wrought iron balconies for homes in the Valletta neighbourhood. Most balconies in the area are traditional closed Maltese balconies ranging in size from small three-panel ones to a massive one featuring a staggering 28 panels.\nAround €2 million was made available for Marsamxett balcony restorations when the scheme was launched late last year by the PA and parliamentary secretariat for EU funds. 80 per cent of the grant scheme will be paid for by EU funds, while the remaining 20 per cent will be covered by the Planning Authority's Irrestawra Darek initiative.\nApart from restoration or replacement costs, funds can also be used to cover architects’ fees up to €500, scaffolding costs and the costs of installing double glazing windows.\nTo date, over 65 applications have been submitted for residential properties in Marsamxett to benefit from this funding initiative. Most of the balconies (92) are closed while just over a third (38) open. The traditional closed balconies vary in size with the smallest having not more than 3 panels on the front and the longest one having a staggering 28 panels.\nWorks undertaken must be backed by receipts to be reimbursed and must have been undertaken after November 1, 2018.", "comment_count": 0, "id": 2448}, {"keywords": "", "author": "", "article_body": "The Transport Ministry has allocated €10 million for a revamp of Malta's four main road tunnels, Roads Minister Ian Borg said on Monday.\nHe said the revamp will involve the tunnels at Kirkop, Sta Venera, Tal-Qroqq and  Ta’ Giorni.\nWhile the tunnels are structurally sound, the works will focus on maintenance and making them safer for motorists, the minister said.\n\nThe works will include cleaning, repairs and installation of modern lighting, CCTV, fire alarms, fire hydrants and air quality monitoring sensors.\nEmergency escapes will be improved and equipped with call stations, new signage and protective doors.\nA control room will be set up to monitor all four tunnels. \nThe tunnels will be lined with new material for ease of cleaning and better visibility.   \nWorks will start later this year once all contracts are awarded.  \nAn impression of how the Kirkop tunnels will look.", "comment_count": 36, "id": 2449}, {"keywords": "", "author": "Sarah Carabott", "article_body": "There is an imbalance between the high number of girls at risk of female genital mutilation and the low prosecution rates in Malta, according to the EU's centre on gender equality, which is calling for higher awareness.\nIn October it was reported that between 39 per cent to 57 per cent of girls in Malta who originate from countries that practice this severe form of violence are at risk.\nThis percentage is the highest among the six studied countries, which include Belgium, Greece, France, Italy and Cyprus. \nIn Malta’s case, girls at risk mostly originate from Somalia, Eritrea, Ethiopia, Egypt, Sudan, Nigeria and Sierra Leone.\n“In Malta prosecution is key. While FGM is criminalised and all laws are in place, there have only been a few prosecution cases, meaning that there is a lot of work to be done when it comes to investigating such cases,” Jurgita Pečiūrienė, EIGE’s Gender expert on gender-based violence told Times of Malta.\n“However there is also lack of awareness in Malta. This is two-fold - the general Maltese population is not aware of what FGM is, while migrants told us they were not aware of where they could seek help and whom to approach.”\nSome, she added, were not even aware that FGM was criminalised in Malta, and that the procedure was criminalised even when committed abroad.\nThe European Institute for Gender Equality (EIGE) is highlighting its findings ahead of the international day to eliminate female genital mutilation on Tuesday.\nDespite girls continuing to be at risk in the EU, research from focus group discussions showed that communities are starting to turn away from the practice as a result of integration and domestic laws.\nRebecca Muscat from the Women’s Rights Foundation noted that in Malta, most interviewed Nigerians were against the practice, with many stressing that female genital mutilation was not part of their identity.They took everything that makes you feel like a woman\nThe participants emphasised that education and awareness-raising on laws against FGM and accompanying health risks were essential for change. This included engaging men as they were widely regarded as the final decision-makers in FGM-related matters.\nDuring a focus group, a woman from Nigeria who lives in Malta told the researchers: ‘they took everything that makes you feel like a woman.’\nRead: 'Holes in the ground were filled with blood'\nPeople who were at risk of, or had had FGM practiced on them, were reluctant to speak up. In some cultures, the practice was kept secret, while the illegality of FGM might have been a deterrent, she noted.\nOthers believed they would be judged while some felt shame about either having gone ahead, or not, with the practice, Dr Muscat said.\nMore should be done to engage with communities, raise awareness about the practice and the law, provide psycho-social support to those affected by FGM, train stakeholders to identify whether a girl was at risk, and create a data system to monitor birth and prosecution rates, she added.\nAddressing the same press event, Equality Minister Helena Dalli said that through the ratification of the Istanbul Convention, Malta had strengthened the legal framework against the practice.\nThe law criminalising the practice, as well as those failing to report potential or known cases of female genital mutilation to the authorities has been in force since 2014.\nStill, there was a lot to be done, and EIGE’s data and research will prove useful in this regard, she added.", "comment_count": 10, "id": 2450}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who was rescued with his partner on the NGO rescue ship Aquarius and brought to Malta after a lengthy standoff has now found he cannot leave Malta for France, where his partner has been taken.\nHe tried leaving on Sunday but was stopped at the airport by officials who noticed he was using forged documents.  \nCameroon-national Pierre Onana Onana, 33, has lived in a hut in Ħal Far since he was brought to Malta on board the NGO vessel on August 15.\nAt the time, the man had been rescued alongside his partner and mother of his infant child.\nThe woman was relocated to France as part of an agreement for France to take some of the migrants.\nBut, the court was told, since the couple were not married, French authorities refused to acknowledge him and denied him permission to join his partner in France.\nProsecuting Inspector Darren Buhagiar explained in court that the man had tried to fly to France using forged Italian travel documents.  He had claimed that he had no idea the documents were false.\n“In view of the very particular circumstances of this case, some clarifications are called for,” legal aid counsel Charmaine Cherrett told the court, explaining how her client had met two persons who had offered to help him get to France to reunite with his partner.\nHe gave the police the details of the two individuals, Dr Cherrett pointed out, adding, “We’re not excusing what he did but the court needs to be aware of these circumstances.”\n“I humbly plead that he be spared jail,” the lawyer concluded.\nInspector Buhagiar pointed out that the baby was not with the mother in France but was still in Cameroon, adding that the accused had tried to deceive local authorities.\nUpon the man’s own admission, Magistrate Gabriella Vella, declared him guilty of making use of forged documents and, in view of the circumstances of the case, his clean conviction sheet, cooperation and early guilty plea, condemned him to a six-month jail term suspended for two years.", "comment_count": 0, "id": 2451}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated - Adds remarks by Health Minister Chris Fearne below - The Nationalist Party has called for population-based screening for prostrate cancer and for breast cancer treatment to be offered in a specialised unit at Mater Dei Hospital.\nIn a series of proposals to mark World Cancer Day, the PN noted that some 350 Maltese people are diagnosed with breast cancer each year.\nShadow health minister Stephen Spiteri and MEP Francis Zammit Dimech also proposed population-based screenings for prostate cancer, noting that this is the most common form of cancer in men.\nPopulation-based screenings were mulled by the government in its 2017 national cancer plan, where it was pointed out that that cancer screening programmes had been effective in preventing and diagnosing cervical, breast and colorectal cancers.\nDr Zammit Dimech speaking on Monday with former MP Michael Asciak and shadow minister Stephen Spiteri (right).\nHowever, the study had concluded that more scientific evidence was required before procedures for other cancers, including prostate cancer, were cost-effective.\nThe Nationalist Party, however, insisted that screening for prostate cancer should be offered as part of an organised programme after widespread consultation with professionals such as oncologists, nurses and non-profit organisations such as Puttinu.\nThe European Association of Urology has also said it is time to look into population-based screening for prostate cancer, Dr Zammit Dimech observed.\nThe party also called for greater investment in cancer research, pointing out that Malta is third from the last in Europe in the sector.\n“Research is key to overcome cancer and our country should do its part as well,” it said.\nGovernment raises outlay on cancer medicines\nHealth Minister Chris Fearne, speaking about cancer treatment on Monday morning, said that over the past 18 months the number of cancer medicines made available free by the government had increased by eight, at a cost of €8 million per year.\nAnother medicine could be added to the list shortly to treat patients suffering melanoma.\nThe minister told a conference organised by the Office of the President that treatment was also continuing to improve. In three types of cancer, 600 patients were being followed on a personal basis.\nHe said the health authorities' focus, announced in a strategy 18 months ago, was on prevention through healthy eating and diet, early screening,  treatment, rehabilitation and research. \nA campaign on healthy eating and healthy lifestyles will be launched with local councils in the coming months.  \n ", "comment_count": 8, "id": 2452}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Education Minister Evarist Bartolo on Monday testified in criminal proceedings against his former canvasser Edward Caruana, insisting he could not assume the role of prosecutor, judge and jury.\n\"I didn’t want to jump to conclusions on the basis of prejudice,” Mr Bartolo said.\nMr Caruana stands charged with bribery and corruption stemming from his former position as an official of the Foundation for Tomorrow’s Schools.\nThe case goes back to 2016, when according to the claims, Mr Caruana was asking for bribes in relation to various government work contracts on the building of new schools and maintenance works.\nIn his dossier to the police, former CEO Philip Rizzo had claimed that the minister’s canvasser used to falsify invoices while the FTS passed on to him cheques for more than €8 million in payments to contractors, which Mr Caruana insisted on delivering by hand.\nWhen testifying on Monday, Mr Bartolo said that during Mr Rizzo’s time as CEO, Mr Caruana would sometimes complain about the way things were done.\n“I would say that we need to make sure we follow procedure, that we are not untouchables,” said the minister.\nMr Rizzo would also voice suspicions about Mr Caruana, the minister continued. “I would say be just. Bring proof. But all he would say is ‘I have a hunch.’”\nAsked what he had done when he heard that Mr Caruana wanted to pay Gozitan contractors directly and that there were allegations of false invoices, Mr Bartolo replied, “When he alleged that there were falsified signatures, I said we must carry out an investigation and pass it on to the police.”\nAsked to verify the veracity of documents shown in court, the minister recalled that the CEO had been in a hurry to pay invoices, while he had been urging that due process was to be followed.\nThe witness made reference to one email wherein he had directed the foundation to cease using Mr Caruana but to also allow due process to take place.\nCross-examined by defence lawyer Stefano Filletti, about what led to Mr Rizzo’s departure from FTS, the minister explained how on October 23, 2016 he had received a message from Mr Rizzo, complaining that the foundation's chairman was “exceeding all boundaries” by changing office cleaning times.\nMr Rizzo had insisted that the minister was to remove the chairman or else he himself would not go to work.\n“I told him that he ought to tell the Prime Minister himself,” Mr Bartolo recalled.\nMr Rizzo then went on long sick leave.\nFollowing the minister’s testimony, the prosecution declared that it had no further evidence to produce.\nThe case continues in March.\nInspector Rennie Stivala prosecuted.\nLawyer Stefano Filletti and Stephen Tonna Lowell are defence counsel.", "comment_count": 0, "id": 2453}, {"keywords": "", "author": "", "article_body": "Seven adventurers will brave desert, snow and rough terrain to travel a third of the world in a ‘junk’ car in order to help nursing home Dar Bjorn and children’s charity Anita’s Palace.\nThe Mongol Rally will see Paul Buhagiar, Romilyn Desira, Luke Desira, Jennifer Busuttil, Brunella Bugeja, Andrew Cremona and Nicholas Schembri attempt to drive from the Czech Republic to Mongolia in two small vehicles with a maximum engine capacity of 1000cc each.\nThere is no support and no set route – only 12,000km over rough terrain including mountains, desert and steppe, Ms Desira said. \nStarting in July, the participants will be sleeping in camps, washing with wet wipes and rationing food and water, the 33-year-old added. \nIf your car breaks down in the middle of the desert, then you have no help whatsoever\nThe participants are seeking to raise €15,000 for Dar Bjorn and for Anita’s Palace, a non-profit organisation which helps under-privileged children in Kenya. The team is also raising money for Cool Earth, an NGO that supports anti-deforestation communities. \nMany of them had heard about the challenge from before, but it wasn’t until Ms Busuttil approached Ms Desira that the team started to take shape. \n“We decided to choose Dar Bjorn through our admiration of the man himself, Bjorn Formosa,” the group said. \n“Instead of giving up and feeling sorry about his condition, Bjorn decided to act upon it and help others along the process of raising awareness on neurodegenerative disease amyotrophic lateral sclerosis (ALS),” they added.\nOnly around 30 per cent of those who take on the Mongol Rally complete the challenge, with many ending up having their cars break down during the process.\nOne of the cars that will be used by the team to travel 12,000km.\n“The biggest challenge is that you are on your own – if your car breaks down in the middle of the desert, then you have no help whatsoever,” Ms Desira said.\nThe team plans on completing the 12,000km trip in five weeks and preparations are under way to ensure the two cars are ready to take on the challenge. \nThe cars are being equipped with the necessary gear to take on the different terrains and the team is preparing itself for any obstacles they may encounter. \n“We know the biggest challenge will be mental,” they said, adding they were ready to face disagreements and hiccups along the way.\nA fundraising treasure hunt will be taking place on February 17.", "comment_count": 20, "id": 2454}, {"keywords": "", "author": "Joanne Cocks", "article_body": "One in four people deaths in Malta is from cancer. Statistics provided by the National Cancer Platform show that cancer accounts for 27 per cent of all deaths in the country.\nCancer accounts for 29 per cent of all male deaths and 24 per cent of female deaths.\nThe evidence indicates that of all cancer-related deaths, almost 25 to 30 per cent are due to tobacco, as many as 30 to 35 per cent are linked to diet, about 15 to 20 per cent are due to infections, and the remaining percentage due to other factors like radiation, stress, physical activity, environmental pollutants, etc.\nProf. Christian Scerri of the Faculty of Medicine & Surgery at the University of Malta, said lifestyle factors that include “cigarette smoking, diet, alcohol, sun exposure, environmental pollutants, infections, stress, obesity, and physical inactivity” increase our predisposition to cancer. \nProf. Scerri and Marika Fleri, coordinator of the National Cancer Platform, said survival rates in Malta compared well with the survival rates in other countries.\nThe highest five-year survival rate was registered in childhood leukemias – 94 per cent (92 per cent in the UK), followed by prostate cancer, 88 per cent (89 per cent in UK) and breast cancer, 87 per cent.\nProf. Scerri added that 40 per cent of cancers are preventable.\nMalta is today joining other countries to mark World Cancer Day which, with the campaign theme of ‘I Am and I Will’, aimsto highlight the need for urgent action to increase early stage cancer detection, screening and diagnosis.\nWorld Cancer Day aims to inspire and encourage action from individuals. Photos: Chris Sant Fournier\nThe National Cancer Platform, which brings together “all Maltese non-government organisations working in the field of cancer to collaborate together to ensure a holistic, coordinated and sustainable service for all cancer patients and their loved ones”, yesterday organised an outreach campaign at City Gate, Valletta. \nAll 16 organisations within the platform – Action for Breast Cancer Foundation, Alive Charity Foundation, Aurora Support Services, Europa Donna Malta, Dr Klown, Hospice Malta, Karl Vella Foundation, Lumiere Support Group, Malta Community Chest Fund Foundation, Malta Health Network, Malta Male Cancer Awareness, Malta Ostomy Association, Malta Colorectal Cancer Awareness Group, Puttinu Cares, Survivors Malta and Smiling with Jerome Foundation NGOs – were present and showcased their work.\nThe main attraction was a ‘City Workout’ around Valletta’s streets and main squares. Today the NCP is organising a conference titled ‘Courage to change the things I can’ – Living life with cancer. \nMs Fleri explained that spiritual growth and emotional well-being take place when a person takes responsibility for choosing how to live with cancer. \n“Growth happens within a relational context when a person connects with self, other and the moment as he/she grapples with the meaning of love and loss, health and ill-health, life and death,” she said.\n“The fourth cancer conference organised by the National Cancer Platform will be an experiential journey, within this relational context, as patient, family and professional engage in conversation and allow the experience to unfold. \n“Together and each within him and herself, within the experience of our collective humanity, new insights emerge, and are the basis for a strength and serenity that go far beyond the helplessness and desperation that are commonly associated with a cancer diagnosis – allowing the person to make choices with regards to living the cancer experience.”\nMs Fleri said that through the platform members of organisations that offer support to people affected by cancer and their families, become familiar with the work being carried out by other organisations offering similar, or complementary services. The Platform facilitates exchange of information to the benefit of the service users.\nIt operates from an office at Sir Anthony Mamo Oncology Centre. This office offers the concept of a ‘one-stop shop’ for all organisations within the Platform. \n“When a patient or family member visits our office, we identify the organisation which will best suit the patient’s needs at that particular point in time. We also have an inspirational library in this office called Librerija Balzmet ir-Ruħ and we encourage patients to visit us even for a chat,” Ms Fleri said.\n“We are there to listen to what the patient needs and offer help accordingly,” she added.\nThe NCP also has a freephone number – 8007 2388 – which is manned all day, every day.\n\nWhat are the signs to look out for\n• Breast: lumps, nipple discharge, retracted nipple (breast);• Prostate and bladder: difficulty in passing urine, blood in urine (prostate or bladder);• Lungs: persistent cough;• Colon: change in bowel habit; • Leukaemia: infections that are severe and not improving.\nFive-year survival\n• Colon: 58%  (UK 60%);• Breast: 87% – well in the upper part (6th) above France, Netherlands, Belgium, Switzerland, Denmark, Germany, Italy and UK;• Lung: 15% (UK 13%);• Melanoma: 82% (UK 91%)• Prostate: 88% (UK  89%);• Childhood leukemias: 94% (UK 92%);• Adult: 46-62% (depending on type) (UK 49-65%);• Ovary: 28% (UK  36%).\nSource: Concord-3", "comment_count": 6, "id": 2455}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 9.30pm\nA gunman on Monday killed the Maltese manager of the Port of Bosaso, in Somalia's semi-autonomous Puntland state, a local security official said. The attack was claimed by the Islamist Al-Shabaab group.\n\"An armed man shot and killed Paul Anthony Formosa who was the construction project manager for DP World, he was killed inside the port and the security forces also shot the killer on the spot,\" Mohamed Dahir, a local security official, told AFP.\nFormosa, 52 from Marsascala, was manager at Bosaso for P&O Ports, a subsidiary of the Dubai-based DP World, where he had worked since August 2017. \nThe Foreign Affairs ministry confirmed the incident and said it was following the case closely. The ministry said it would issue additional information should there be significant developments.\nThe Nationalist Party urged the government to make contact with any other Maltese nationals in Somalia and to insist on a full and thorough investigation.\nAccording to the Dubai government, three other employees were injured in the incident and are receiving medical treatment. In a statement, it said the circumstances of the incident were being investigated.\nHow the attack unfolded\nMedia reports in Mogadishu said two attackers were actually involved. One was killed and the other captured by security forces, having been injured while trying to escape. \nOne of the assailants had disguised himself as a fisherman before the attack.\nHe was killed “in the fish market as he was going to Bosaso port this morning. The men armed with pistols hit him (with) several bullets in the head,” Yusuf Mohamed, governor of Puntland’s Bari region told Reuters.We are behind the operation ... we had warned him but he turned deaf ear- Al Shabaab\nFormosa, a former Malta Freeport employee, was rushed to hospital where he died of his wounds. \nHis family declined to comment when approached by Times of Malta.\nAl Shabaab said it had carried out the attack and accused Formosa of being in Somalia illegally. The terrorist group said the attack was \"part of broader operations targeting the mercenary companies that loot the Somali resources.\"\n“We are behind the operation ... we had warned him but he turned deaf ear. He was illegally in Somalia,” said spokesman for Al Shabaab’s military operations, Abdiasis Abu Musab.\nWhy was the port deal controversial?\nDP World has a 30-year concession to manage the port. The deal was hugely controversial and sparked protests during which at least one person was killed. Together with a similar deal in the nearby breakaway region of Somaliland, the concession was declared void by the Somali government, which accused the operator of violating the country's sovereignty. \nMohammed Abdallah, a journalist with the non-governmental Somali Broadcasting Company, told Times of Malta that Formosa had been well-respected in the business community and had had good relations with the local government since his arrival. \nHe said the port remained closed and authorities were still investigating the motives behind the attack, including the assailants' links with Al Shabaab and rumours that Formosa had been receiving threats from the local community.\n\n\n\nThe incident immediately prompted debate in a popular Somali internet forum, with users in Bosaso recalling Formosa as a contentious figure who had clashed with locals and received death threats on several occasions.\nBosaso is a city in the northeastern Bari province of Somalia. Located on the southern coast of the Gulf of Aden, the municipality serves as the region's commercial capital and is a major seaport within the autonomous Puntland state.\nMalta Freeport tribute\nMalta Freeport paid tribute to its former employee.\nMalta Freeport Terminals CEO Alex Montebello said: “Paul was a hardworking employee, lively, open-minded and loved by his colleagues. We are extremely shocked to learn of this attack and our thoughts are with his family during this most difficult time.”\nWatch: 'He was always looking for the next challenge', recalls a former colleague\nThe freeport said Mr Formosa was such a capable employee that towards the end of his employment, he had been assigned to commission cranes in other ports that made up the CMA CGM portfolio. \n“Paul had a very good relationship with the freeport and he visited the terminal regularly whenever he came to Malta. He will be missed,” Mr Montebello said. \nLater in the evening, Imam Mohammad Elsadi, on behalf of the Muslim Community in Malta, condemned this criminal attack \"against an innocent person, irrespective of the identity of the perpetrators, their ideology or their motives\".", "comment_count": 60, "id": 2456}, {"keywords": "", "author": "", "article_body": "Melita Italia Srl., a wholly owned subsidiary of  Melita Limited is to provide gigabit broadband in Italy from April 2019.\nHeaded by former Telecom Italia CEO Riccardo Ruggiero, Melita Italia will use Italy’s Open Fibre wholesale network to initially provide services in Catania, Palermo, Milan and Naples. The company plans to expand services to more than 30 cities and 3,000 sales points by the end of 2021. Some 100 new jobs will be created, most of which will be based in Southern Italy.\nThe Malta-based company said its venture will bring innovation to broadband customers in Italy in terms of customer care and product. Following the European launch of Plume by Melita in Malta in 2018, Melita Italia customers will become the second Melita group in Europe to benefit from Plume’s services bundle that provides access to highly personalized in-home experiences.\nPlume membership includes Adaptive WiFi, HomePass guest access, advanced parental controls, the Plume app and SuperPods that combine to learn and adapt to the needs of the home to make WiFi faster, safer and more reliable.\nHarald Roesch, CEO at Melita Limited, said: “This is a significant milestone for Melita, a business built in Malta, which is now expanding into new markets. While our core business will remain in Malta, Italy presents an excellent opportunity for growth as millions of homes gain access to the Open Fibre network. By combining the skills of our team in Malta - where we are innovative leaders in the provision of internet services and customer experience - with the market knowledge of Riccardo and his team, the future for Melita in Malta and Italy looks bright.”\nRiccardo Ruggiero, Executive Chairman at Melita Italia, said Melita has a great opportunity to grow in Italy as the country’s super-fast fibre internet network enters a phase of rapid expansion.  ", "comment_count": 11, "id": 2457}, {"keywords": "", "author": "", "article_body": "A luxury Corinthia hotel is to be built in the heart of Moscow, the second hotel in Russia to be operated by the Maltese hotel chain.\nInternational Hotel Investments, owner of the Corinthia, said on Monday that it had acquired a minority share in a consortium to acquire a landmark property at 10,Tverskaya, Moscow’s principal avenue leading onto the Kremlin and Red Square.\nThe property has a listed façade, and houses the famous 19th century Filippov Bakery, but permits are in hand allow up to 43,000 square metres of development behind the retained frontage.\nThe consortium has plans to create a luxury Corinthia Hotel and brandedserviced apartments for sale. An element of high-end retail will be featured alongside Tverskaya.\nIHI has had a presence in Russia since 2002, when it acquired and redeveloped five historic properties on the main boulevard in St Petersburg, transforming them into the Corinthia Hotel St Petersburg, the Nevskij Plaza Retail and CommercialCentre as well as other commercial property.\nThe old Filippo Bakery in Moscow.\n ", "comment_count": 10, "id": 2458}, {"keywords": "", "author": "Josef Cutajar", "article_body": "An ancient quarry possibly dating back to the Punic and Roman periods was unearthed by workers on the site of the new Gozo Museum in Victoria.\nThe find is being viewed as a unique and extremely intriguing one for Gozo.\n“Given the size and characteristics of the location, this is a first for Gozo,” a source close to the venture said.\n“The excitement is high, considering that such a rare historic asset has been discovered in the heart of Gozo’s capital.”\nThe site of the planned museum is the defunct Ninu Cremona Boys Secondary School in Republic Street.\nLast Christmas Eve, the Gozo Museum announced on its Facebook Page that “The ex-Lyceum site has surprised us with the discovery of a Roman quarry! Stay tuned in 2019 for more updates.”\nThe source said: “From a preliminary look, the quarry seems to be quite extensive, stretching underneath the old school.”\nIt is believed that the mined limestone boulders and slabs were meant for diverse structures.\nAlthough the inoperative school rests on top of the quarry, it is believed that not much damage was done when the school was built.\n“The fact that no cellars or other underground spaces were constructed has left a substantial section of the quarry intact,” a source monitoring the project said.\nThe Ninu Cremona school was built in the 1950s to a design by renowned architect Joseph G. Huntingford, then director general of the Public Works Department.\nAccording to historians who spoke to this newspaper, no documents have so far come to light indicating the existence of such an ancient site.\n\nGiven the size and characteristics of the location, this is a first for Gozo\nThere are two schools of thought among researchers, one saying the quarry goes back to the time of ancient Carthage and another that it relates to the annexation of these islands to the Roman Empire.\nIncidentally, the Times of Malta reported on May 11, 2017 that remains of ancient walls that could date as far back as Punic times were unearthed just outside Victoria’s Citadel, at the site of a proposed car park.\nThe two walls have been tentatively dated to the Punic period (200 BC), however, they continued to be in use into the Roman period right through to Late Antiquity.\nThe Citadel discovery was made in test trenches during controlled monitoring by the Superintendence of Cultural Heritage, as part of a second phase of archaeological excavations. Last month, this newspaper reported on concerns, raised by residents, that ancient archaeological remains have been cleared away during works to pave a ramp off Triq Sant’Ursola in Victoria.\nIn a brief statement, the Ministry for Gozo told The Sunday Times of Malta that “works on the Gozo Museum are proceeding to schedule and the new revelations will be incorporated with the revised designs”.\nThe ministry noted also that the findings are subject to further investigations.\nThe brand new landmark is expected to incorporate a “multi-disciplinary regional museum and cultural centre” showcasing specimens and exemplars related to natural history, folklore and archaeology.\nThis depository is expected to group under one roof several State collections among them one bringing together works of art as currently there is no such collection on the sister island.\nAround €3.7 million have been earmarked for this initiative which is being is co-financed by the European Development Fund.\nHistorical fact\n“In the course of time, the prosperity of Carthage gave umbrage to Rome who challenged and broke the supremacy of her great rival in the Punic Wars between 264-146BC. Livy relates that after the victory of the Roman fleet over the Carthaginians at Lilybaeum (Marsala), the Consul Titus Sempronius sailed to Malta where Hamilcar surrendered to him with about 2,000 men. This is the only record left by a Latin writer of the annexation of Malta to the Roman Empire.\n“It would appear that the Maltese were granted an autonomous government with the privilege of sending ambassadors to Rome to plead their cases when necessary, and later, the island was made a Municipium…\n“It does not seem probable that a numerous Roman colony did ever settle in Malta, not only because the Romans rarely attempted to colonise the countries they conquered but also because Malta had no other attractions but its harbours.”\nSource: Themistocles Zammit in Malta The Maltese Islands and their History. Published in 1952 by A.C. Aquilina & Co. Printed at The Progress Press Co. Ltd", "comment_count": 21, "id": 2459}, {"keywords": "", "author": "Jacob Borg", "article_body": "Five investors have been awarded over €31,000 in compensation after losing money they invested with Crystal Finance at a time when the firm was owned by former Central Bank of Malta deputy governor Alfred Mifsud. \nIn a series of decisions handed down by the financial arbiter last month, Crystal Finance was held responsible for losses incurred by the investors. \nMr Mifsud sold his interests in Crystal Finance 11 months after he was appointed deputy governor 2015. He stepped down from the role in 2017 following allegations published by slain journalist Daphne Caruana Galizia. \nIn one of the cases, the financial arbiter said that Crystal Finance failed to safeguard the interests of two of its clients. \nThe two clients, a security guard and a hairdresser, were classified as having a medium-risk profile yet were sold a medium-high risk investment. They were compensated a total of €14,400 for the money they lost in the investments. \nThe risk the client was exposed to did not tally with her income\nAnother case decided by the arbiter found that Crystal Finance unilaterally raised a client’s risk appetite profile to tally with an investment sold to her. \nThe arbiter found that the client trusted Crystal Finance and would not have proceeded with the investment if the risk was known to her. \nIt was also found that the client had an income of €3,000 and no other assets. \nThe risk the client was exposed to did not tally with her annual income, the arbiter found. \nShe was awarded €10,500 for the money she lost through the Crystal Finance investments. \nYet another client was awarded €600 after it was found that he was not notified about significant depreciations in his bond investment. \nIn another case, the arbiter awarded an investor €6,300 in compensation because Crystal Finance did not inform him about the negative trajectory his investment was taking. \nThe client’s claim that the investment had been miss-sold to him was dismissed by the arbiter. \nJacob.borg@timesofmalta.com", "comment_count": 0, "id": 2460}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports that lengthy waiting times for outpatient appointments have been singled out by the European Commission, with a new report saying the Maltese are waiting an average of 40 weeks for a first appointment at the national hospital. \nThe newspaper also reports that an Audit Office investigation into the granting of visas by Malta's consulate in Algiers was hampered by purged data. \nThe Malta Independent reports that Donald Trump has described sending US troops to Venezuela as 'an option'.\nIn-Nazzjon quotes Adrian Delia saying Malta has the most corrupt government ever, using the yardstick of Transparency International.\nl-orizzont quotes an expert saying that up to 40% of cancers can be avoided. In other stories, it reports Joseph Muscat's warning that the economy will suffer without foreign workers. It also says that Adrian Delia ignored Franco Debono and made no reference to him in his speech on Sunday. ", "comment_count": 0, "id": 2461}, {"keywords": "", "author": "Jacob Borg", "article_body": "Electrogas directors have failed to provide details, in the company’s annual accounts, of an LNG supply deal with Socar Trading SA that has been questioned by multiple energy experts.\nAn analysis by The Guardian estimated that Socar Trading SA made around €32 million from the deal in 2017, as it leveraged differences in market prices and the fixed price at which Electrogas, and ultimately Enemalta, buy LNG from it.\nAccording to notes annexed to Electrogas’ annual accounts, its directors deemed that disclosure of the monetary value of its LNG purchase commitments with Socar Trading SA would not be meaningful in assessing Electrogas’ liquidity and cash flows.\nThese purchases will be offset in the same periods by cash received from the related sales transactions to Enemalta, the notes said.\nDisclosure would not be meaningful in assessing liquidity and cash flows\nOne of Electrogas’ directors is 17 Black owner Yorgen Fenech. A leaked e-mail from the Panama law firm Mossack Fonseca said 17 Black was going to pay up to $2 million into Panama companies formerly owned by the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nElectrogas received revenues of €36 million for gas supply and €93.3 million for electricity it supplied to Enemalta during its first full year of operation. It declared a loss of €23 million in 2017.\nThe role of Azerbaijan’s State-owned energy company as an LNG supplier to Electrogas has raised eyebrows, not least because Socar Trading SA does not have its own LNG supply chain.\nInstead, it buys LNG from suppliers like Shell, then sells it on to Electrogas at a fixed price. The same LNG is then sold on to Enemalta as part of a 10-year contract.\nReluctance to disclose any details about the Socar Trading SA deal is also evident in leaked e-mails and documents from Electrogas. These documents were leaked to slain journalist Daphne Caruana Galizia a few months before her death and later acquired by the Daphne Project. Multiple energy contracts signed in April 2015 bind Enemalta to buy €131.6m worth of LNG from Electrogas yearly.\nThree energy experts who spoke to Daphne Project partners The Guardian said if Malta had dealt directly with Shell, it could have struck a better deal and saved money.\nElectrogas’s own advisers questioned Socar’s involvement in the LNG contracting, the leaked files show.\n“The arrangement is unusual,” UK consultancy Poten noted, “and typically one would expect the LNG supplier, in this case Shell, to contract directly with the project”.\nThe government has said the value of Enemalta’s gas purchase agreement with Electrogas, including the initial five-year fixed price term, became apparent when one considered the volatility in the oil price.", "comment_count": 22, "id": 2462}, {"keywords": "", "author": "Ramona Depares", "article_body": "Last Sunday saw the worlds of fashion and LGBTQI rights come together in mourning for the passing of a trailblazer – transgender model Katya Saunders, known to her friends as Kaka.\nA recent portrait of Katya. Photo: Kris Micallef\nSocial media platforms across Malta were united in tribute to the fashion icon, who was one of the first openly transgender public personas on the island at a time when there was not much awareness about LGBTQI issues.\nThe model was hailed by those who knew her as an inspiration and a source of strength even for the current generation of gay activisits.\nJames Mifsud, one of her closest friends, describes how she “metaphorically laid down the red carpet for today’s LGBTQ scene to be able to safely come out and live their lives”.\nThe two met by chance in the 1990s, at the City of London bar, a favourite hangout of both.\n“I had already spotted her a couple of times before actually meeting her. I couldn’t help wonder who this glamorous woman, who looked like a James Bond star, was,” he reminisced.\nAfter that first meeting, the two became firm friends and would hang out together.\n“Her stories were something else. She had left Malta aged 17, simply so that she could be herself. And, in London, she managed. She modelled, she hung out with stars, she lived a fabulous life,” Mr Mifsud says.\nKatya was, in fact, known for having starred on Vogue and a number of other international magazines in the 1980s, as well as for the star-studded company she kept.\n“She’d hang out with David Bowie, Mick Jagger... the stories I’ve heard are amazing.”\nEventually, Katya returned to Malta, where she is widely credited with starting the LGBTQ scene.\n“This was back in the days where there wasn’t a gay scene in Malta. It was before the days of Gay Pride. I remember, once, we dressed up in costumes and paraded through Paceville, with Katya leading the défilé . We wanted to tell everyone that we are here, we exist.”\nShe’d hang out with David Bowie, Mick Jagger... the stories I’ve heard are amazing\nBut, beyond the flamboyance and eccentricity, Mr Mifsud also remembers Katya’s “heart of gold”. “She never gave up on anything. She was always smiling, and she always looked impeccable, no matter her mood. Her style was very Alexander McQueen. Though, sometimes, she’d also bring to mind Audrey Hepburn, with her classic taste and perfect grooming, especially walking down Republic Street in Valletta, with those big sunglasses of hers.”\nHis parting words are poignant as they are heartfelt.\nA picture of Katya as a young model.\n“She was the foundation of the LGBTQ community in Malta. She is their queen, without even knowing.”\nWords that are echoed by Keith St John, one of the regular DJs at Lollipop parties, possibly the biggest recurring event on the local gay scene.\nHe describes how he had “heard the stories” about her before even meeting her, which had always made him wonder why everyone spoke so highly of her.\n“When I met her, it all made sense. The woman had a strong presence and energy. Yet, she was so kind, not to mention witty. Kaka, as we knew her, is one of those people we should be grateful for, because she was a warrior during a more conservative time,” he says.\nThe camera never stopped loving her, as a recent series of portraits by Maltese photographer Kris Micallef reveals.\nMr Micallef recalls seeing her for the first time back when he was a little boy.\n“I was struck by her aura. Who was she? I wanted to know her. When we were introduced, our connection was beautiful and I’m going to miss our impromptu photo-shoots,” he says.\nA combination of kindness and charm earned Katya the respect of everyone she met, from fashion designers like Charles & Ron – whose creations she wore with pride, and who will be launching a collection in her honour later this month in New York – to television personalities like Peter Carbonaro, who describes how “she would walk into a room and everyone would stop and look at her”.\nMr Carbonaro recounts how, though Katya’s was not an easy life, “from a young age she knew what she wanted and went for it”, adding that she had to overcome “hundreds of obstacles” to be what she wanted to be. \nShe was also responsible for creating fashion designer Joseph Grima’s brand name – to date, everyone knows him by the simple name ‘Mugi’.\nA friend and neighbour, he says that Katya was to have a strong influence on his designs and that he always sought her advice on fashion-related matters.\n“I doubt I will ever meet a human being so complex, so elegant, so stylish,” he reminisces.\nThe rest of the fashion world certainly seems to agree. Meantime, a wake held at her beloved City of London bar, in St Julian’s, was every bit as glamorous as Kaka would have wished.", "comment_count": 0, "id": 2463}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "One of your main priorities has been building new roads. But studies cited in your own reports show that new roads quickly fill up with displaced or induced traffic. Are we going to spend all this money only to end up in the same situation we are in now?\nThe complex challenges we are facing with our roads did not start yesterday. There is no single solution. I do not think it is true that widening roads just brings more cars. The Central Link studies showed that if nothing is done, we are approaching gridlock.\nI would have loved, when I took over this portfolio, to find a fully-fledged underground system, public transport capable of carrying 70 million passengers, and therefore less need for people to own their own private vehicles. But the situation was different.\nWe have to solve the problems people are facing now, but we had 78 new cars added to the road every day in 2018. How are you going to address that?\nThe way to do that is positive measures to encourage people to use other means of transport. If you have 26,000 young people using buses for free, that means they are not using their cars. Some of those may have used the buses anyway, but many of them would probably already have got cars.\nWe have no plans to introduce measures stopping people from getting their own cars, but we want to offer alternatives. At the same time, certain bottlenecks have to be addressed.\nThe Central Link study showed that without the project, we will be facing total gridlock. But even with the project, traffic times still will not go down if the growth in cars remains the same.\nThat is where we have to be intelligent. I criticised the situation we found: no alternative transport solutions and a culture of private car use.\nWe are winning ourselves some time by solving the bottlenecks. In parallel, we will be taking decisions to ensure that by that time we will have people choosing alternative transport.\nIs it worth the cost – in terms of money and in many cases agricultural land – for what is a short-term fix?\nThese decisions are never easy, but they are not taken lightly. The Central Link project has been on the cards since the 1980s. In 2006, under a Nationalist administration, the authorities concluded again that it had to take place. Against that, you have a group of residents who have always lobbied successfully. That does not work with me. I take decisions.\nThe project will happen, not just for the good of the people passing from there, but for the good of Attard, Balzan, Lija and Iklin, towns where narrow roads are constantly blocked with people trying to avoid congestion on the main road. I am not happy that fields need to be taken up, but because the road has not yet been built, other areas have been destroyed. \nAre you happy with the efficiency of the public transport system right now?\nI am tempted to say I am happy, it should always improve because public transport users are the ones truly helping the situation, not the keyboard warriors getting angry at the minister for uprooting a tree.\nHow can you expect the most obese nation in Europe to cycle in 35 degree weather?\nOur numbers show that reliability has got better. We now have to look at capacity, where we have become victims of our own success. Today people are not complaining about the bus not showing up, they are complaining about it being full. \nHow actively are you working on this?\nI have asked Transport Malta to carry out an exercise on optimisation and to establish where we need additional capacity. I expect that when we increase capacity we are going to be criticised for increasing subsidies, but when you see the €30 million we pay for an efficient public transport system, it is relatively small compared to the investment in infrastructure.\nCycling advocates have repeatedly raised the problem of lack of infrastructure. Should this be more of a priority?\nI do not think the criticism is always valid, especially as there have been projects where we are criticised for increasing cycle lines: a 1.5-metre stretch along several kilometres is what then leads journalists to say we have taken up another football pitch of agricultural land.\nI think it is also important that we realise not everyone is ready or able to travel by bike. We should help the portion of the population willing to do so, but we cannot fool ourselves into thinking Malta will ever be Amsterdam. We are not Amsterdam, in climate, culture or geography. How can you expect the most obese nation in Europe to cycle in 35 degree weather?\nDo you not think that simply repeating these limitations is just keeping us where we are?\nThese are facts. If you live and work in Pembroke and St Julian’s, then yes, we should be making it easier for you. But for someone from Mellieħa who works at Smart City, it just does not make sense.\nWe are going to invest in two cycling routes: one from Mosta to Mater Dei and the University, and another from St Julian’s to Valletta. But it is a difficult balance and one section of road users cannot expect the government to discard other methods of transport to focus on theirs.\nYou have implemented several incentive schemes for electric vehicles but there has been nearly no take-up. Do you have any hope this will increase?\nI think it is like smartphones: other than a few early adopters, people are waiting for the technology to improve. A car is a major investment and people are waiting for the product to get better and cheaper. We cannot offer any more generous incentives, although the time will come when we say you cannot import any more diesel and petrol cars.\nIs a phase-out within the next 20 years, as has been suggested, feasible?\nI am told the product is expected to get much better in the coming months and years so I expect people to make that choice of their own accord. What is certain is that when the industry sees governments no longer permitting importation of petrol and diesel cars, they will be speeding up the development of their product.\n“Certain bottlenecks have to be addressed.” Photo: Jonathan Borg\nYou are also responsible for planning. Last year, the Planning Authority approved 13,000 new dwellings, more than ever before. People are looking at that and saying it’s a free-for-all.\nPeople applied for those permits.\nAre too many being approved?\nThis is a country that is growing. We’ve made choices as a country. Today we don’t want to do certain types of work; Maltese people no longer aspire to clean the streets, or to work in construction, or bars and restaurants…\nThere is obviously a construction boom but should the PA be managing or restricting it further?\nCan we agree that we are working with Local Plans from 2006? These are the effects of the Local Plans from 2006.\nSo why don’t we have new ones?\nThey are being worked on. Those Local Plans should be allowed to develop and mature because at the end of the day they also gave new rights to landowners and property owners.\nI think we need to be looking at higher quality projects. This country can take more growth, but it cannot take more low-quality projects. There is space for growth because there is demand for growth. More people are buying homes, more people are investing in property, more people are living and working in Malta. But we need to significantly improve quality.\nAs you said, we are still working on 2006 local plans. Why have the new plans been delayed so long?\nThere was an inundation of submissions. The 2006 exercise saw an area the size of Siġġiewi added to the development zone. I would prefer to do nothing than to do that sort of exercise.\nThis exercise has to be driven by the needs of the country. We need to see how many schools, hospitals, roads, hotels, public spaces, parks, retirement homes we need. This is not something you can do quickly.\nCan you put any timeline on it? This legislature?\nThat would be presumptuous. When it happens it should happen well.\nWithout the local plans, without a masterplan for places like Paceville, it feels like there is no long-term planning. We are seeing major projects all taking place without a holistic vision.\nIn Paceville, we have known for a long time that it was designated for the sort of projects we are seeing. What we need, and Transport Malta is working on it, is a transport plan. I am sure Enemalta and Water Services are doing their homework too.\nSo are you not worried about the consequences of assessing projects one at a time?\nI understand that somebody who suddenly finds themselves living next to a construction site will be upset, but the country has chosen to grow\nIt is happening within the framework of the existing policies. When the PA issued its thoughts on the Paceville masterplan there was not enough engagement with the community and we know how that ended up. Perhaps the public also is not ready for certain difficult decisions.\nOn a lot of major projects, thousands of objectors, NGOs, local councils will all say their concerns are being ignored. Is the planning process helping the ordinary citizen or only the big developers?\nI think the numbers you quoted earlier show that families who want to build or change their home are finding the planning process a help not a hindrance. Obviously someone who has a development happening next door to them will object. But people object for many reasons, even to small projects, and we cannot have a situation where everyone gets their way just because they object.\nWhen you have such a mass of people, even local councils, shouldn’t that carry some weight?\nWe have given local councils a vote on major projects, and we have seen projects, including tall buildings, that were not approved.\nI understand that somebody who suddenly finds themselves living next to a construction site will be upset, but the country has chosen to grow. People do not want to go back to how they were in 2008.\nDo you worry that quality of life is going backwards even as the economy grows?\nI think there are many areas in which we are not taking advantage as we should be. We kick up a storm when three trees are removed from the middle of the road where they should never have been but then we have, as a country, stopped planting forests. Not everyone can have a garden in front of their door, but let’s make gardens where there’s space for them. Quality of life is having more spaces like Buskett, not having a tree in the middle of the road.\nThere has been controversy over your own applications for a house and swimming pool on ODZ land. Was this a case of salami slicing? Did you apply for the house and swimming pool separately because they wouldn’t have been approved together?\nNo. I think together or separately it was all in line with policy and there have been hundreds of other applications like it. This is all about a single person who is obsessed with me and creating a story about everything I do.\nThe Ombudsman said your decision to file the permit in your project manager’s name was “devious”. \nThere were architects who said the Ombudsman was not technically correct. His issue was that I did not apply in my own name, but now I have an objection from the same person saying I only got the permit because I am the minister responsible.\nAs minister, doesn’t what you do set an example for other developers?\nI would be setting a bad example if I had applied for something that was not in line with policy.\nAs for your own future, with the Prime Minister having said he will step down before the next general election, do you see yourself as a contender for that role?\nIt is a hypothetical question. The Prime Minister is still there and people, including me, want him to stay.\nI am nearly 33, I am a minister with a very large portfolio and when the Prime Minister has shown so much faith in me, it would be wrong of me to concentrate on the future rather than what is in front of me. People expect me to get things done, and that is what I’m going to continue to do.", "comment_count": 35, "id": 2464}, {"keywords": "", "author": "Jacob Borg", "article_body": "The European Commission has contradicted the claim made by Prime Minister Joseph Muscat that it had given its “written endorsement” to Malta’s cash-for-passports scheme.\nDr Muscat’s statement last week came on the back of comments by European Justice Commissioner Věra Jourová, who told the European Parliament that the Commission does not endorse any such schemes.\nThe Prime Minister hit back by saying that Malta’s Individual Investor Programme (IIP) had received a written endorsement for the sale of EU citizenship from then Justice Commissioner Viviane Reding in 2014.\n“We stand by what the [European] Commission told us in writing and declared publicly when we reached an agreement with the Commission,” he said.\nMaltese passports are sold to rich foreigners against payments and investments totalling €1 million.\nReplying to questions from The Sunday Times of Malta, a Commission spokesperson said representatives of the European Commission’s services and the government had met in January 2014 to discuss the scheme but it was never endorsed.\nThat same month, Commissioner Reding delivered a strong speech saying that European citizenship must not be up for sale.\nThe Commission spokesperson said that during the meeting, part of the discussion was about legislative amendments aimed at introducing a requirement for applicants to reside in Malta for a period of at least 12 months.\n“After that meeting, a joint statement was issued in which the Commission had welcomed the amendments announced by Malta at the time but the Commission did not endorse the Maltese investor citizenship scheme,” the spokesperson said.\nA Commission report on citizenship and residency schemes across the EU found that although the residence requirement exists in legislation, in practice the requirement for applicants to physically reside in Malta is not verified sufficiently.\nWe did not endorse the scheme\nAs set out in the report, the Commission is examining whether or not such schemes are in line with EU rules, the spokesperson said.\n“This relates not only to the legal framework governing the scheme but also to its application”.\nHenley & Partners, the scheme’s concessionaire, has earned over €28 million between 2014 and 2018 from passport sales.\nPart of the funds paid by foreigners buying EU citizenship are ring-fenced in a national development fund.\nThe fund has been used to buy €21.8 million worth of shares in BOV as well as shares in Lombard bank.\nA large-scale social housing project will also be partly funded from passport sales.\nThe scheme has been beset by controversy.\nMalta’s Financial Intelligence Analysis Unit (FIAU) found that €100,000 worth of funds from passport sales to three Russians had made their way into the bank account of the Prime Minister’s chief of staff Keith Schembri.\nThese funds were transferred by Mr Schembri’s auditor Brian Tonna, whose firm Nexia BT is a licensed agent under the passport sale scheme. Both men deny wrongdoing and a magisterial inquiry is underway.\nHenley & Partners have described Mr Schembri as their main point of contact within the Prime Minister’s office.\nNationalist MEP Roberta Metsola told The Sunday Times of Malta that the government had failed to address long-standing concerns about the scheme, particularly when it came to the very real and well-documented security, secrecy and money-laundering implications.\nDr Metsola said the Commission had clearly stated it did not endorse or support this scheme in any way, belying the Prime Minister’s mantra.\n“They’re telling him clearly to stop making a claim of some inexistent EU endorsement to flog his passports,” Dr Metsola said.\njacob.borg@timesofmalta.com", "comment_count": 71, "id": 2465}, {"keywords": "", "author": "Anthony Manduca", "article_body": "Malta’s main banks have rejected Prime Minister Joseph Muscat’s claim that legitimate people and businesses are sometimes not allowed to open new bank accounts.\nThe banks cited a huge increase in new account holders and pointed to new rules which increase the amount of information that is required from potential new customers. \nOn Thursday the Prime Minister said the banking sector’s reticence when opening new accounts was in breach of EU rules. He said “legitimate” people and businesses were often unable to open new accounts, which was their right, adding that he could not tolerate such a situation.\nCharles Azzopardi, public relations executive at Bank of Valletta, told The Sunday Times of Malta that over the past few years, new rules and regulations, primarily on money laundering and terrorism funding, had impacted the extent of information and documentation required from bank account applicants.\nBOV, he said, had a “clear risk appetite framework and customer acceptance policy”.\nHe said the bank provided services to both domestic corporates and international corporates setting up in Malta. Last November it had introduced the BOV Salary Package, designed to cater for foreign individuals working in Malta, and also offers the Basic Payment Account, which gives consumers legally resident in Malta or the European Economic Area access to basic features, the right to comparability of fees and payment account switching locally and across borders.\nBut while the bank had taken an active role in servicing the banking requirements of corporate and personal clients, these services were provided so long as they fell within the bank’s customer acceptance policy and risk appetite framework, adhering to the ‘know your customer’ and due diligence rules and regulations, Mr Azzopardi said.\nMarcel Cassar, the CEO of APS Bank, said APS fully abided by EU and Maltese laws, rules and regulations.\nThe bank showed “no reticence” in opening new accounts, he said, offering a whole suite of deposit accounts addressed at all segments of society, without distinction.\nThe suite, he added, included the Basic Payment Account, with basic features available to consumers legally resident in Malta or in another EU Member State who did not have other bank accounts in Malta.\nThere is absolutely no truth whatsoever in any suggestion that legitimate people and businesses are being prevented from opening an account\n“There is absolutely no truth whatsoever in any suggestion that legitimate people and businesses are being prevented from opening an account with APS Bank,” Mr Cassar insisted.\nHe said last year had set a record in terms of business growth, lending and deposit raising. It was also a record year for account opening across the board, following on previous years which he said had also shown impressive growth in all segments.\n“The BPA has further widened our reach to more consumers and we have been opening such accounts at an accelerated pace.”\nMr Cassar stressed, however, that the right to a Basic Payment Account also came with obligations on the part of the consumer and an application may be declined where those conditions are not met.\n“The requirements/conditions are fairly straightforward and we also show a great deal of understanding during the on-boarding process. This is why I say that legitimate persons should not find any problem in opening a basic account at APS Bank.”\nMr Cassar added that some applicants for business (less so of the BPA kind) might experience delays in getting approval or might even be declined.\n“There will be good reasons for this, it is never our pleasure to do so – we are out to grow our business! But we must also comply with the law, protect the integrity of the bank, of the financial system and above all our reputation and that of Malta.\n“There is an abundance of good, legitimate consumers and businesses out there and we want to service them. But there is also some very nasty stuff, typically appearing very legitimate. We need to keep away from those, even if they may be strong and vociferous in their complaints,” he said.\nAn HSBC Bank Malta spokesperson said:  “HSBC Malta welcomes all prospective new customers.  Our due diligence requirements are in line with local regulations and bank policy. In January we were pleased to open around 40 per cent more accounts than 2018 as new customers choose HSBC for their banking services.”\nAnother bank, BNF, said: “We welcome new customers to bank with us. Through regular training of our customer-facing employees and information publicly displayed on our website, we ensure that potential customers are aware of the documents that they need to present at the application stage.  This enables BNF Bank to meet its regulatory obligations.”\n‘Politicians should not try to interfere’\nA financial services consultant agrees that everyone has a right to have a bank account – so long as they meet the conditions imposed by regulators on banks that offer such services.\n“So technically, yes, banks cannot discriminate. However, this simplistic statement ignores that fact that banks who do not adhere to EC and ECB directives on the opening of accounts risk heavy penalties and even losing their licence,” said the consultant, who preferred not to be named.\nHe added: “Anti-money laundering regulations are, of course, the elephant in the room in this controversy. Malta has already been pillared for the money laundering allegations against Pilatus Bank and its alleged Venezuela money-laundering schemes.\n“HSBC burned its fingers in countries like Mexico and has decided to be more careful not to lose its banking licence in jurisdictions like the US. BOV is being sued for hundreds of millions of euros for allegedly facilitating criminal activities by an Italian shipping group that had a trust registered in Malta. Satabank has been punished for allegedly not taking its anti-money laundering obligations seriously.”\nThe consultant said that as stated by the IMF and the European Commission in their most recent reports, Malta had adopted an economic model that exposed it to risks of money laundering and financial crime. E-gaming, fintech companies and certain financial services carried a substantial risk that could ruin Malta’s reputation.\n“Banks are right in taking these risks seriously,” he said.\n“Banks are in business to make money as any other for-profits business. They are subject to strict but independent regulation. Politicians should not try to interfere with this regulatory framework.\n“Businesses with sound business plans and fit and proper persons leading them have no problem opening accounts and borrowing money.”", "comment_count": 31, "id": 2466}, {"keywords": "", "author": "Ramona Depares", "article_body": "An ongoing project that is being spearheaded by the Malta Football Association brings Maltese and migrants together on the pitch for the first time. Project co-ordinator Peter Busuttil tells Ramona Depares that it’s all about creating a community.\nIt’s Wednesday evening and the Mqabba football ground is a hive of activity. Some youngsters are warming up quietly in a corner; others are practising their dribbling skills, passing the ball to their peers, giggling and trying to make sure that the ‘rivals’ don’t get their hands – well, feet – on it.\nMqabba FC coach Michael Degiorgio shouts out some instructions, and the whole group moves towards the centre of the ground as one. Some parents look on, quietly sipping a coffee or chattering among them.\nSo far, so mundane, you might say. Only, it’s not, because the Mqabba football club is one of a number of local clubs that opted to be part of a community inclusion programme that was recently launched nationwide by the Malta Football Association (MFA) – which means that a number of migrant children, teens and (in some cases) even adults get to join their Maltese counterparts on the pitch.\nThe ratio, today, is a nice mix between Maltese teenagers and some 20 Syrian migrants who come from nearby BirŻebbuġa. Of course, in an ideal world, this sort of inclusion would be par for the course.\nBut, for now, full inclusion and diversity is still a goal that the majority of the Maltese population is still working towards – and this programme promises to be one of a number of such initiatives that are already making a difference.\nPeter Busuttil is the project coordinator and responsible for Football Social Responsibility at the MFA. He is the driving force behind the project, which is titled Include Me and I will Understand; he tells me it was launched last year and is being co-funded by the MFA and the EU, with some additional funding last year coming through the Uefa Football and Refugees Grant. The project funding has been renewed through 2019.\nThe project, he adds, helps both Maltese and migrants, as the MFA is working hand in hand with local agencies like Leap and Appoġġ to attract the participation of Maltese. To date, Include Me and I Will Understand has attracted some 300 participants.\n“The aim is not simply that of engaging migrants and Maltese who are in a vulnerable situation in social activities and sports, but also to include them within the community. The priority is to enable an environment where they can train and play football together. As part of the project, we also offer language lessons,” he says.\nTo date, the project has attracted some 300 participants\nA nationwide call was issued to football clubs, and a healthy number showed interest in participating.\n“Football is a very social activity, because it’s not just about the game. So many people are involved, from coaches to referees, to parents, teachers, volunteers...” Mr Busuttil says.\nTraining typically brings with it a host of other social events, from picnics to that most famed of all Maltese activities – just hanging out together, having a natter.\n“We are very pleased with the way the programme is working because inclusion is taking place organically. It is heart-warming,” Mr Busuttil continues.\n\nMr Degiorgio echoes these words. The club currently counts 20 to 25 migrants who are taking part in the programme, with ages ranging between seven and 17.\n“Each one of them trains with their relevant age group and there is a very encouraging air of positivity on the pitch and around. Most are from Syria, and our languages are surprisingly similar, so communication has not been a problem. I was very pleased to see them being welcomed by our crowd, and inclusion seems to have happened very naturally,” Mr Degiorgio says.\nThe youngsters themselves have shown an encouraging eagerness to be part of the whole social scene at the club, with not even the most adverse of weather conditions stopping them from showing up for the weekly sessions.\n“You can tell that they are genuinely into it. We had a couple of bad storms, and they didn’t use it as an excuse to skive off training. As it turns out, the weather was too bad to be out on the pitch anyway, but we still chilled at the club and had fun,” he says.\nNow, Mr Degiorgio is working to get the under 15s and under 17s registered so that they will be able to take part in competitive leagues, together with their peers.\nThe programme makes it possible for participants to truly become 100 per cent part of the scene, thanks to a holistic approach that also provides ancillary needs like a full training kit and, when needed, transport to and from the clubs.\nSan Ġwann coach Christopher Sant attests to the efficacy of this holistic approach. His club currently includes about 11 migrant children aged between five and seven.\n“We don’t just play football. We organise regular events, some of them with a cultural or heritage angle, such as outings to the valley, viewing the cart ruts and so forth,” he tells me.\nThe programme has been welcomed by NGOs, with ADITUS director Neil Falzon pointing out the importance of initiatives that  remind us of “our shared humanity”.\n“These activities highlight that we should not be talking about ‘migrants integrating in Malta’ but of ‘communities integrating with each other’. Yes, legal and institutional frameworks that establish integration as a national priority are important, but it is these sort of initiatives that offer the opportunity for human interaction outside the confines of politics.”", "comment_count": 1, "id": 2467}, {"keywords": "", "author": "", "article_body": "The Civil Protection Department has seen red over a tongue-in-cheek story written on a satirical website under the heading \"Civil Protection Department issues AMBER Franco Debono alert\"\nIn a statement on Sunday afternoon, the department said it was dissociating itself from the story on Bis-Serjeta/Serjeta Biss and comments attributed to its director. It is also referring the issue to the police. \nThe story said that the Civil Protection Department had issued an amber Franco Debono warning, 'the second-highest threat level possible'.\nThe amber alert, it explained, meant that a Xarabank appearance was now imminent.\nThe story appeared after Dr Debono returned to the headlines with claims that the prime minister was corrupt.\nIt said authorities 'seem to have been caught unaware by the torrent of blog posts in recent days, which culminated in Debono calling Joseph Muscat a corrupt idiot and claiming “My moment has arrived” like the hero of a third-rate musical.'\n“We should have paid more attention to the signs from the past few months. You should never take your eye off an ego that huge,” CPD director Emanuel Psaila 'was quoted' as saying. \nThe Civil Protection Department was in no mood for a joke, however.\n\"The case has been passed on the Cyber Crime Unit of the Police,\" it said on Sunday.\nThe website reacted in predictable fashion - it said it had reported the CPD post to the police Silly Crimes Unit (see below): \n\n ", "comment_count": 37, "id": 2468}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man, drawn into a 15-year long court saga over his alleged involvement in a drug trafficking conspiracy, wept in relief upon hearing that his only guilt stemmed from his admission to having smoked an occasional joint, which landed him with a €100 fine.\nChristopher Mazzitelli was a man in his early 20s when, a budding football career having been cut short by injuries, he had taken up a job at a mechanic’s garage at Qormi, doing light repair works and selling spare parts.\nTwo sons of the owner of the business frequented the garage, situated beneath the family home.\nTrouble brewed back in 2004 when the police apparently got a whiff of some underhand activity taking place inside the garage, prompting a surveillance operation by the Drugs Squad.\nOfficers keeping watch on the comings and goings at the garage in April 2004 had looked on and taken videos as some individuals, who allegedly had contacted one of the owner’s sons and Mr Mazzitelli, visited the place.\nUpon leaving the surveilled premises, these persons were stopped by the officers, searched and taken in for questioning after drugs were allegedly found in their possession. All five told the police that they had purchased their supplies from the accused who worked at the garage.\nOn that same afternoon, the accused, together with Mark Pace and his brother, were arrested at Luqa when the police zoomed in on a Toyota vehicle that was stopped in the Ta’ Kandja area. All three were held as suspects in a drug trafficking conspiracy.\nMeanwhile, another team of officers swooped down upon the Qormi premises, entering the home overlying the garage, where they eventually arrested the fourth suspect, namely Giovanna Pace, the mother of the two co-accused brothers.\nA scuffle broke out between the officers and the woman who had first allegedly locked herself in the bedroom and then put up a struggle, biting one policewoman on the thigh and pushing over another officer, while setting the family dog upon the police party.\nThe woman had later claimed that she had mistaken the plainclothes officer for a weapon-wielding robber and had also been stunned by pepper spray aimed at her.\nAll four suspects were ultimately prosecuted for their alleged involvement in a drug-trafficking conspiracy, as well as for the aggravated possession and trafficking of heroin, cocaine and cannabis resin.\nFailed to prove existence of drug-trafficking deal\nOne month later, in May 2004, one of the Pace brothers was cleared upon lack of sufficient evidence to be placed under a bill of indictment.\nProceedings continued against the other three co-accused who, though facing the prospect of a trial before the Criminal Court, ultimately had their case heard by a magistrate after the Attorney General issued his direction in January 2015 for proceedings to continue before the Magistrates’ Courts in terms of law.\nIn June 2016, Mr Mazzitelli and the other two accused parted ways as the court directed the separation of proceedings.\nTaking the witness stand in February 2017, Mr Mazzitelli had recounted how at the time of his arrest he used to work at the garage where he met Mark Pace when the latter turned up at the workplace between spells spent behind bars.\nWhilst admitting under oath that in his youth, he used to smoke cannabis joints, the accused had insisted that he had “never touched heroin or cocaine,” nor had he ever trafficked drugs.\nFollowing his arrest, the man claimed to have never returned to the mechanic’s garage.\nTwo witnesses, who had first claimed to have bought drugs from the accused, had years later supplied a “totally different version” in court, stating that they had originally made up the whole story since they had been feeling “sick” owing to their drug dependency and had simply wanted to escape further questioning by the police.\nAnother witness failed to identify the accused in court. Only one of the witnesses identified the accused as “the man in a red jumper” who had sold him the drugs.\nThe court, presided over by Magistrate Audrey Demicoli, observed that all these witnesses had over the years been involved in drug cases and had likely pinpointed the accused so as not to get into trouble with Mark Pace, the real supplier of the drugs.\nTheir testimony was deemed untrustworthy and not credible by the court. After examining both direct and circumstantial evidence, the court concluded that “the prosecution failed to prove that there existed any drug-trafficking agreement between the accused and third parties”. Nor was it proved that the accused had trafficked drugs from the garage where he had been employed.\nAll that turned out to have been sufficiently proved was the fact that at the time of the alleged incident, the accused used to smoke cannabis joints, which, upon his own admission in open court, amounted to simple possession.\nThis offence, coupled with the charge of recidivism over a similar 2002 conviction, landed the accused with a €100 fine.\nIn separate proceedings, Mark Pace was condemned to a 15-month jail term and a €5,000 fine after pleading guilty to trafficking drugs.\nThe other co-accused, Giovanna Pace, was acquitted of all drug-related charges, being found guilty of threatening police officers, slightly injuring one of them, violently resisting arrest and refusing to obey legitimate orders. She was handed a 12-month jail term suspended for two years.\nLawyer Arthur Azzopardi was defence counsel to Mr Mazzitelli and Ms Pace.", "comment_count": 0, "id": 2469}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia on Sunday questioned why the government would not even entertain a discussion about a public inquiry into the assassination of journalist Daphne Caruana Galizia\nSpeaking during a political activity in Valletta, Dr Delia said the government had promised to stop at nothing to identify who masterminded the murder.\nDespite these promises, Malta was no closer to knowing who was behind the assassination, Dr Delia said.\nHe said the Opposition had asked for a public inquiry to see if Ms Caruana Galizia’s murder was preventable, yet the government was too scared to even discuss the motion presented in parliament.\nDr Delia vowed that the PN would stop at nothing in its fight for justice and the truth.\nHe said Ms Caruana Galizia’s murder was not just about the killing of a person but was also a blow to democracy and free speech.\n\nOn Transparency International’s corruption perception index, Dr Delia said Malta’s plummet down the rankings showed that Joseph Muscat’s government was the most corrupt one in history.\nHe said Malta was now ranked in 51st place, behind counties like Rwanda, Bhutan and Botswana.\nPN governments had spent years building Malta’s reputation which had now been dropped to new lows thanks to Muscat, the Opposition leader said.\nHe pointed out how Pilatus Bank was mentioned as one of the reasons behind Malta’s slump on the index.\nDr Delia said the banking sector was suffering because of the government’s actions.\nInstead of trying to solve this, Dr Delia said the Prime Minister was demanding that banks carried out less rigorous checks so as to let in more business.\nThe Opposition leader insisted that the government’s duty was to ensure that Malta’s financial sector was a serious one that attracted serious investors.\nHe said it was typical of Labour to make mistakes then blame others.\nDr Delia appealed to the banking sector to ignore the Prime Minister’s calls for banks to be more lax in their approach.\nTurning to passport sales, Dr Delia lambasted the continued sale of Malta’s citizenship.\n“We are nationalists. We do not sell citizenship. We create. We have faith in our people. We are capable of selling services and talent, not our country’s citizenship”, he said.\nHe said the PN was analysing how the scheme could be replaced with an investment plan to attract serious investments to Malta without selling  citizenship.\nThe Opposition leader also took aim at the government deal with Corinthia.\nHe said land worth €700 million was being “donated” to a private entity.\nWhile the PN was not against six-star investments, it could never be in favour of giving land away on the cheap to big business without even a proper tendering process.\nDr Delia was equally scathing in his views about the government’s €700 million investment in the road network.\nHe said simply widening roads without improving the necessary services and infrastructure would not solve Malta’s traffic problems.\nAt the end of his speech, Dr Delia vowed that the PN would continue to protect the unborn child and would not permit the government to turn Malta into a soulless state.", "comment_count": 48, "id": 2470}, {"keywords": "", "author": "Ivan Martin", "article_body": "Those who didn’t want more foreigners on the island were also turning their back on economic growth and social measures like pensions, Prime Minister Joseph Muscat said on Sunday.\nSpeaking during a political activity in a jam-packed Birkirkara Labour Party club, Dr Muscat said that as far as he was concerned economic growth was a means to an end.\n“Our aim is to spread the wealth. But to do this, you have to have wealth to spread in the first place,” he said.\nOther member states, he said, were facing economic recession, but not here. The government had incentivised work to ensure that all those who could hold a job, did so.\nThen the next step was growing the workforce, bringing in people from overseas to expand the economic output of the country.\n\n“Our model is to open the doors, and embrace the challenges of globalisation. We want to be like that sailor who, at the first sign of strong winds, opens sail and not shies away,” he said.\nIllustrating his vision for the country’s economy, Dr Muscat said that not so long ago hiking up social security contributions was touted as one of the only practical ways to deal with the pensions problems.\nMany had been told to forget a pension if you they were of a certain age, he reminisced.\nBut for the first time in 25 years, this Labour administration had raised pensions for four years in a row, the Labour leader said to cheers of “Joseph!”\nWhen he had first taken up office, women were not being utilised in the labour force.\nSpeaking as a “CEO of the country”, Dr Muscat said it made no sense to have more than half of University students being women, but then not employed.\n“We were wasting more than half of the country’s resources,” he said.\nBut, “thanks to one of the most revolutionary policies for a whole generation” – the government had liberated the working potential of thousands of women.\nThe same was true, he said, of the introduction of in-work benefits, which had seen those dependant on the taxpayer, become active contributors themselves.\nReturning to his views on the influx of foreign workers to the island, Dr Muscat admitted that there were negative impacts of increased population through importing workers.\nThe island also had inherent limitations.\nIf there were 1,000 apartments available for rent, and more potential tenants, then the price of rent would naturally shoot up.\n“I agree with those who say open the doors to foreign workers. But I also agree with those who say rent has climbed too high, and something needs to be done to moderate the situation,” he said.\nHowever, this would not be solved by making foreign workers leave.\n“So then do we go back to that situation we had before? Then we can’t pay for pensions, and have to increase the burden on taxpayers? No. This is not going to be our approach,” Dr Muscat said.\nYou could not cherry pick with economic policies. If you want to enjoy the meat you need to take the bone too, he said.\nThis meant, another solution was needed.\nAround 80 per cent of Maltese, he said, were home owners.\n“We can’t jeopardise their investment. After 40 years of paying the bank back through a home loan, families can’t suddenly learn that the value of their property and their investment has actually dropped, because of some draconian laws passed by a government,” he said.\nThere needed, however, to be planning policies that took into account a growing population and the pressure on tenants.\nThe current administration was the only government to have not decided to redraw the development boundaries.\n“There are confines on Outside Development Zones. And we are building where others told us building could be done when the lines were drawn up in 2006,” he said.\nDr Muscat took a slight dig at the Planning Authority, saying there were some decisions that he simply couldn’t understand. Some developments, he said, were quite frankly ugly.\nThere were some roads lined with two storey buildings only to have a five floor block jutting out.\n“We need to talk about this as a country. There may be loopholes and so on that need addressing,” he said.\nDespite this, Dr Muscat said the government had showed its “social spirit” when it doubled rent subsidies.\nAnd when some asked where this administration’s social spirit had gone, Dr Muscat pointed just a few meters up the road, where a previously dilapidated townhouse would soon offer accommodation for Gozitan students and Gozitan relatives of patients at Mater Dei Hospital.\nGiving the elderly a cheque for €300-a-year over and above their pension, that was where the government’s social spirit lay, he added.\nDr Muscat ended his speech with a plea for party supporters and activists to remain vigilant in the run-up to the 2019 local council and European Parliament elections.\nHe warned of the scourge of complacency, and of the importance of keeping a finger on the pulse of society.", "comment_count": 321, "id": 2471}, {"keywords": "", "author": "Sarah Carabott", "article_body": "James Muscat and Jeffrey Bonnici both have one kidney – although for different reasons.\nMr Muscat donated his second one to a friend 15 years ago while two-time recipient Mr Bonnici received one after eight years hooked to a dialysis machine.\nBoth feel as healthy as ever, with donor Mr Muscat saying that he was “living proof that a person can live with one kidney while saving someone else’s life.”\nSpeaking to Times of Malta as the ‘Life after Drew’ campaign about organ donation picks up steam, Mr Bonnici recalled being diagnosed with kidney failure in 2003 at the age of 25.\n“Just like a silent killer, both kidneys failed all of a sudden. My mum immediately offered one of her kidneys, but the process, which includes tests and ensuring there are no vested interests in the donation, is very rigorous.”\nMr Bonnici spent a year on dialysis until he was given the go-ahead for the transplantation and received his first kidney from his mother Frances Gatt.\nHe believes that his young age allowed him to adapt to the sudden change of his daily routine during the dialysis treatment. The most challenging part for those who need to undergo such treatment was accepting their fate, he added.\nMr Bonnici, who works at Customs, noted that his superiors were very understanding, and he could continue working while receiving treatment.\nBut while Mr Bonnici coped with the situation well, some are not always able to continue with their work because of the nature of their job, while others develop physical or psychological issues, Mr Muscat noted. The renal unit itself provides psychological support to those who need it.\nWe were given only one life and we need to take care of it\nSadly, the kidney that Mr Bonnici received from his mother failed after 18 months.\nGetting back on the dialysis machine was the most difficult thing he had to do. It felt as if all of a sudden he had to start from scratch.\nThe following eight years were the toughest for Mr Bonnici, as he waited for a matching kidney.\nThe good news came in 2014 and in March he received a kidney from a cadaveric donor. His life changed overnight – from the little things such as not limiting his water intake to the larger ones including going abroad for more than three days.\nMr Bonnici’s ordeal convinced those around him, including his friends, to sign up as donors.\nMr Muscat also recalls the day he donated a kidney in February of 2004.\nBack then, several had asked Mr Muscat whether he feared that in the future he might himself need the kidney that he had donated.\n“It was a dream of mine to help the recipient, a father-of-three, and that dream came true through the donation of my kidney. Just like other live donors, I was never scared, but rather looking forward to the intervention.\nHe is still unafraid nowadays, with the only thing that has changed since then being that now he has to be more careful about leading a healthy lifestyle.\n“If something crops up in the future, there might be a kind-hearted and altruistic person who donates his kidney,” he added.\nFor Mr Muscat, organ donation remains the best gift one could give – it not only makes a person’s life better but it could actually save their life.\n“We were given two kidneys – the second one is a spare, however, we were all given only one life and we need to take care of it.\n“After 15 years, I’m living proof of how someone can live with one kidney. Tests have proven that the remaining kidney functions better than it did when I had two... and I feel better than ever before.”\nOn average, more than 20 kidney transplants are carried out a year, some of which are made possible because of live donors, and while around 300 people are receiving kidney treatment, a third of them are on a waiting list for the transplant, he said.\nThose who would like to become live donors like Mr Muscat can get in touch with the Renal Unit at Mater Dei Hospital for more information.\nBe A Hero, Become A Donor\nIn dealing with the tragic loss of their 20-year-old son, Drew Abela, his parents Sharon and Kenneth have funnelled their energy into the ‘Life after Drew’ campaign.\nIn collaboration with the Transplant Support Group Malta, the campaign is raising awareness about the need of organ donation, encouraging others to register as donors and calling for a support structure that guides surviving relatives through the process.\nOne can become a donor in minutes by either registering online using one’s e-ID details, sending the application form by e-mail, or by post.\nLook up the Facebook page called Transplant Support Group – Malta or log onto www.transplantsupport.org.mt for more information on how to become a donor.\nWorld Kidney Day will this year be celebrated in Malta on March 17.", "comment_count": 3, "id": 2472}, {"keywords": "", "author": "", "article_body": "The protection of life is a principle not tied to a mandate given by the people, Auxiliary Bishop Joseph Galea Curmi stressed on Sunday during Mass to mark the International Day of Life.\n\"My appeal today is that we all commit ourselves to the protection of life as a principle we embrace rather than because convention dictates such,\" Mgr Galea Curmi said at St John's Co-Cathedral.\n\"The protection of life, as a principle, is not tied to a mandate given by the people. I shall put it in simpler terms: I am against cruelty to animals on principle. If the people give a mandate for animals to be mistreated, I stand wholeheartedly against it all the same since this is a principle that does not depend on the people’s mandate. The protection of life even at conception is also a question of principle.\"\nThe fact that it was said that Malta was all alone in the protection of human life from conception was not a matter of shame, he added. \n\"It makes us proud that for us, human life is so precious that we wish the very best for the child when it is still in the womb even when it is only a mass of cells. It is not the number cells that determines whether it is a human life or not.\"\nIt is not the number cells that determines whether it is a human life or not\nMgr Galea Curmi said that alongside the defence of life of the child in or out of the womb, the Church wanted to work for a culture in favour of life at every stage of a person’s being.\nA culture in favour of life at every stage of a person’s being\n\"Whenever human life is in danger we should be united to protect it. It may be that someone’s life is in danger at sea struggling to live, waiting for someone to help or risk going under. Another person could be in danger because of the conditions he or she is living in. The life of others could be at risk due to pollution and the destruction of the environment. Someone might be tempted to take drugs and is duped into thinking that these so-called recreational drugs are the gateway to good times without consequences.\n\"It could also be that a person who is old and infirm is anxious that he or she may be considered to be someone whose time is up.\nAs persons of principle, we should have zero tolerance to all threats to life\n\"As persons of principle, we should have zero tolerance to all threats to life,\" he insisted. \nMgrGaleaCurmi said there also needed to be a stronger commitment to help those who were suffering, such as women who faced difficulties about their pregnancy.\n\"We must give our support in every way to those women who endure all the burden and are left alone. Every victim cries out for our help. We must work together so that these women do not find themselves alone, they may find in us the support they need during their hard times.\"\nHe said that even those who had not yet acknowledged God in their lives or those who did not believe in him could understand that life was precious and that the protection of life should not be taboo.\n\"We must all show our gratitude and pray for all those who give witness to life so that, with courage, they will continue to convey this all-important message for our time. Saint Paul tells that love does not rejoice in injustice but rejoices in truth.\"\n ", "comment_count": 18, "id": 2473}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The United States has raised “serious concerns” with the Maltese government over the island’s plans for close collaboration with Chinese telecoms giant Huawei.\nA US senior administration official told The Sunday Times of Malta that in view of intelligence gathered by US agencies over the last few years on Huawei, which they see as a “national security threat”, meetings have been held with top Maltese government officials to “share the information and express our concerns”.\n“During our meetings with senior Maltese figures, we made available our information on Huawei to the Maltese authorities so that they can have a better understanding on who they are dealing with,” said the official, who spoke on condition of anonymity.\nMalta has an agreement with Huawei to use the island as a testing ground for the rollout of 5G. However, the Chinese company is under watch by several governments around the world over fears it is using its technology for espionage. Last week it was charged in the US with violating sanctions on Iran.\nREAD: No change in current relationship with Huawei, government says\nThe official who spoke to the newspaper dismissed the suggestion that the US could take diplomatic or other steps against Malta if it carried on with its collaboration with Huawei.\n“We respect Malta as a sovereign and an EU Member State with a strategic geographical position. We don’t want to impose anything on the Maltese government and it is up to them to decide what they want to do with Huawei,” he said.\n“However, we would not be respecting Malta if we didn’t share the information we have on the Chinese company. That way, the Maltese government can decide its way forward with much more detailed information.”\nThe government has signed two Memorandums of Understanding with Huawei but there has been little by way of public announcements about the collaboration.\nMOUs were never made public\nNot much is happening on the ground.\nDuring the meetings with their Maltese counterparts, US officials expressed a wish for the Maltese government to be “more transparent” about its dealings with the company and to open up the field to fair competition under international procurement rules when it comes to major projects, particularly 5G.\nSoon after taking power in 2013, Prime Minister Joseph Muscat had appointed Tourism Minister Konrad Mizzi’s wife, Sai Mizzi Liang, as his special envoy to China. Later, it was announced that through her intervention, Huawei would enter into an agreement to use the island as a testing ground for its 5G rollout.\nNo further details were given and the government has failed to answer questions on what this collaboration involves. The MOUs between the government and Huawei were never made public.\nIn 2017, the government formed a new company, called Safe City Malta, through which it plans to install CCTV surveillance in Paceville and Marsa in an experimental project with the Chinese company.\nDespite this being a national security project, normally developed and administered by the police, it was assigned to the Tourism Minister.\nSafe City Malta is headed by Joseph Cuschieri, CEO of the Malta Financial Services Authority and a close collaborator of the Office of the Prime Minister. Also involved are David Borg, a former personal assistant to Prime Minster Joseph Muscat when he was an MEP and now chairman of Wasteserv, as well as Jeremy Dalli, a businessman with interests in Paceville and recently appointed chief of staff to Economy Minister Chris Cardona.\nThe government failed to reply to questions about progress on this project, including the planned setting up of a Joint Innovation Centre and whether the Data Protection Commissioner had given the green light to experimental technology which according to the government has already been installed in an unnamed data centre.\nLast week, Huawei hit international headlines again after the US initiated a court case accusing it of bank fraud, obstruction of justice and theft of technology from rival T-Mobile. This case is not connected to the perceived security threats or allegations of spying.\nThe company has found itself in trouble in several countries, including Germany and the UK, after intelligence emerged that it was using its technology for espionage, an allegation which Huawei flatly denies.\nThe man who founded Huawei, Ren Zhengfei, was an engineer in the Chinese People’s Liberation Army in the early 1980s – a fact that has worried businesses and governments.\nHuawei says it has no links to the Chinese government and insists it is an independent company.\nivan.camilleri@timesofmalta.com", "comment_count": 92, "id": 2474}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta reports that the United States has raised “serious concerns” with the Maltese government over the island’s plans for close collaboration with Chinese telecoms giant Huawei.\nThe newspaper also reports that a European Commission spokesman has flatly contradicted the claim made by Prime Minister Joseph Muscat that the commission had given its “written endorsement” to Malta’s cash-for-passports scheme.\nThe Malta Independent on Sunday says the PN is in favour of full-time MPs but Labour has not decided its position. It also reports that the value of the White Rocks complex has been estimated five times more than what a bidder is offering. \nMaltaToday in an opinion survey says Labour leads the PN by 18 points ahead of the European Parliament elections, and PN leader Adrian Delia has lost support. Muscat has a trust rating of 54.8% to Delia's 20.4%, with the difference being sharpest in the south of Malta and in Gozo.\nIt-Torċa recalls the explosion on the tanker Um El Faroud which killed nine at the dockyard 24 years ago. It also reports that Malta Freeport is carrying out a study on ways to raise capacity. In other stories, it reports on an association agreement between the Italian CGIL trade unions and the GWU and also highlights the latest positive credit rating for Malta. \nIl-Mument quotes laws commissioner Franco Debono accusing the prime minister of corruption. \nKullĦadd reports that according to the European Commission and an investigation by the Auditor General, there were no serious failings in the granting of Maltese visas in Algiers. It also focuses on what it says is a dispute between Adrian Delia and former PN official Alex Perici Calascione hinging on the Corinthia deal with the government. \nIllum says a company may make as much as 1.2 million euro a month from dumping into a quarry, for which a permit was issued in six days. The newspaper also focuses on alleged irregularities in the hiring of farmhouses in Gozo by the former owner of the defunct Fantasy Tours. ", "comment_count": 0, "id": 2475}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The long-awaited revision of the fuel stations policy may not ban urban facilities from relocating to land outside development zones, one of the policy’s most controversial aspects, according to Planning Minister Ian Borg.\nA revision of the policy was announced back in January 2018. Introduced in 2015, it allows both new fuel stations and ones relocated from urban cores to be built on up to 3,000 square metres of ODZ land.\nProposals for the revision put forward by the Environment and Resources Authority (ERA) last April called for ODZ development to be restricted to upgrading of existing stations, barring any new or relocated facilities in such areas. \nBut in an interview with The Sunday Times of Malta, Dr Borg hinted at a more permissive approach, saying ODZ developments should be limited to relocations, ruling out only entirely new facilities.\n“If only relocations are allowed, we will know exactly how many more fuel stations we can have in ODZ,” the minister said.\nDr Borg said the current 3,000 square metre size limit would be reduced – the ERA had proposed a 2,000 square metre limit – and that fuel stations should not be allowed to include unrelated facilities.\nHe reiterated the original policy’s justification for ODZ development, arguing that people did not want to see fuel stations in village squares. Asked why the review was still ongoing more than a year after it was announced, and when it would be concluded, Dr Borg said only that discussions were at an “advanced stage” and that the policy was “close to adoption”.\nThe delay has prompted concern as the PA has in the meantime continued to decide on applications, as well as to receive new ones, which will all be assessed under the existing policy.\nActivists twice – in April and September – halted PA board hearings on fuel station applications, and the Opposition has also called on the government to explain the delay.\nMeanwhile, asked about concerns that the ODZ fuel stations were a pretext for future commercial development, Dr Borg said it was up to the PA to impose conditions preventing such a change of use.\n“If the need for a fuel station no longer exists, the land should be restored to its natural state,” he said.\n“It would be a problem if abuse is allowed to take place, but I cannot talk about what might hypothetically happen. What is certain is that, as of today, there is a demand for fuel stations.”", "comment_count": 30, "id": 2476}, {"keywords": "Gozo", "author": "", "article_body": "A new council to govern the Gozo NGOs Association (2019-2021) has been elected during the association’s annual general meeting at its centre in Xewkija. Joseph Camilleri, Adrian Formosa and Saviour Grech who sat on the outgoing council were reconfirmed on the new council, while Francois Deniau, Maria Dimech, Lucian Camilleri and Steve Pace were elected new members. The association’s first official reaction was congratulating Michela Pace for winning the first X-Factor Malta. They wished her luck in her next journey to the Eurovision Song Contest in Tel Aviv in May.", "comment_count": 0, "id": 2477}, {"keywords": "Education", "author": "Ramon Formosa", "article_body": "Physical Education (PE) potentially leads to positive students’ performance and academic achievement in schools. This is indicated by multiple research studies, such as Sibley and Etnier (2003), Bailey et al (2009), Dalziell et al (2015), Bailey (2016), Donnelly et al (2016), Duncan et al (2017) and Marttinen et al (2017).\nRamon Formosa conducted the study as part of an MSc in Physical Education and Sport Pedagogy at the University of Birmingham, from which he graduated in December 2018.\nThese studies support a positive link between PE and other curriculum areas and subjects, such as literacy and numeracy, pointing towards the importance of PE not just as a core subject taught on its own but also PE as a tool to achieve a range of educational outcomes in children and young people.\nResearch by Phillips and Marttinen (2013) and Vazou and Skrade (2017) suggests that the integration of Mathematics and PE helps students to learn new concepts about space, shapes, time and patterns, promotes both autonomous and collaborative work and enhances students’ physical activity and interest in lessons.\nLearning Maths in a practical way makes lessons more understandable, whereby students link acquired skills to everyday life situations and potentially achieve better grades when compared to students who attend traditional Maths lessons. This is inducated by research conducted by DeFrancesco and Casas (2004), Kitchen and Kitchen (2013) and Vazou & Skrade (2017).\nThe present author recently conducted a quasi-experimental research study to explore whether combining PE and Maths for school children would indeed lead to improvement in problem-solving skills and their overall attainment in the subject.\nThe programme had a substantial positive impact on students’ perceptions towards PE and towards Maths, with the majority stating they feel they improved in both subjects\nThe study tried to develop, implement and evaluate a Mathematics and PE programme (MPEP) by integrating Maths and PE and measure its effects on problem-solving and academic attainment in a Maltese boys’ school. This type of integration was defined as “an educational process in which two or more subject areas are integrated with the goal of fostering enhanced learning in each subject area” by Cone and Cone (1998) in Parish and Parish (2016). The study adopted a quasi-experimental research design using mixed-methodology; it combined pre- and post-tests with follow-up (process evaluation) questionnaires, focus group and interviews.\nThe MPEP intervention was tested on a group of 26 students, while another 55 students served as the control group. The study sample included three Year 6 classes from a boys’ school in Malta. The intervention class participated in the MPEP for eight weeks, while the other two classes had regular PE lessons. Student attainment was then assessed through a school-based Maths assessment. Students’ and teachers’ views and perceptions of the impact of the MPEP on problem-solving and Mathematical attainment were also recorded.\nAlthough results showed minimal improvement in problem-solving and general Mathematical scores within the intervention group, results from the post-test questionnaires and focus groups showed that the MPEP had a substantial positive impact on students’ perceptions towards PE and towards Maths, with the majority stating they feel they improved in both subjects. Students also remarked that the MPEP helped them persevere and work harder because they could try things out in a ‘physical’ manner rather than learning mathematical concepts the traditional way.  Indeed, the MPEP also contributed towards better teamwork among the students.\nSince this was a small-scale study conducted in a homogeneous (boys’) school, results cannot be generalised. It would therefore be interesting if such a study is repeated in other schools to explore whether the same or similar results could be obtained (for example, among girls-only schools or among students in a co-ed school).\nThis study could serve as a stepping stone towards further, wider and deeper investigation on how such a new practice and the introduction of such a programme could be beneficial for our students in our schools.\nRamon Formosa conducted the study as part of a Master of Science in Physical Education and Sport Pedagogy at the University of Birmingham, from which he graduated in December 2018. Mr Formosa is a PE teacher in the primary education sector. He undertook the MSc in Physical Education and Sports Pedagogy with the support of a scholarship funded by the Malta Sport Scholarships scheme of the Ministry for Education.", "comment_count": 0, "id": 2478}, {"keywords": "Gozo", "author": "", "article_body": "Various scouts attending the Victoria Scout Group were presented with awards during the annual general meeting at its headquarters in Victoria. Mark Portelli and Nathan Camilleri won the Rover Scouts of the Year, while the Venture Scout of the Year and Scout of the Year went to Samuel Xerri and Darren Paul Cassar respectively. Ludvic Azzopardi lifted the Cub Scout of the Year (Saturday Pack) and the Cub Scouts of the Year (Seeonee Pack) was won by Carlos Tabone.\nCertificates of Merit were awarded to Rover Scout Paul Parnis, Scouts James Mizzi and Michele Terribile and Cub Scouts Mattia Cassar and Paolo Sultana. The Blue Six (Saturday Pack) and the Brown Six (Seeonee Pack), winners of the Mowgli Inter-Six Competition were also presented with certificates.\nThe meeting also included the investiture of two scouts Richard Caruana and Tyler Theuma Scerri.\nThe Thanks Badge was then presented to long-time supporters and sponsors of the Group – Abram Said, Vincent Attard and Carm Cachia, the librarian and author of the book on the 50-year history of the Group.\nFor the second year, the Group, instead of sending Christmas cards, donated a sum of money to a philanthropic organisation. This year, the donation went to the MUSEUM (Boys Centre) in Victoria.\nGuest speaker for the evening was psychologist Fr Joseph Farrugia, who directs the Centre for Family Counselling. Dr Farrugia, who is also a lecturer at the University of Malta, highlighted the importance of safeguarding minors from any type of abuse.", "comment_count": 0, "id": 2479}, {"keywords": "Education", "author": "Aidan Bugeja and Matthew Megrahi", "article_body": "In preparation for the Chinese New Year of the Pig, which starts on Tuesday and ends on January 24, 2020, students at our school learnt about the Chinese zodiac, and conducted research on a Chinese poem in both the Chinese and English languages.\nThe pig is the 12th of all animals in the Chinese zodiac calendar. According to a Chinese legend, the Jade Emperor invited the 12 animals to a party and decided their order in the zodiac according to their arrival to his party. It happened that the pig overslept and was the last to arrive to the party. This is why it is the last animal in the Chinese zodiac calendar.\nThe pig represents luck, good fortune, wealth and honesty\nIn Chinese culture, the pig is a symbol representing luck, good fortune, wealth and honesty. Anyone who happens to be born in the Year of the Pig is considered to be a peace-loving person, truthful, generous, indulgent, patient, reliable, trusting, sincere, giving, sociable and understanding person with a good sense of humour.\nThe research was conducted in the China Corner of St Margaret College, which was founded in 2010 by school teacher Martin Azzopardi in collaboration with the China Cultural Centre in Malta.\nThe authors are students from St Margaret College Senior Secondary School, Verdala, Cospicua, Malta.", "comment_count": 0, "id": 2480}, {"keywords": "Gozo", "author": "", "article_body": "The Bern Hersey’s Fitness Club organised a special class at the Sacred Heart Seminary Fitness Centre in aid of the Oasi Foundation. More than 80 people attended the one-hour session, during which they were given fitness intelligence guidelines by Leo. The aim of the activity is in line with the Oasi Foundation’s preventive approach: sport and physical activity contribute to feeling good and prevent substance use and abuse.", "comment_count": 0, "id": 2481}, {"keywords": "Gozo", "author": "", "article_body": "The importance of developing a sense of “we-ness” and connection, despite today’s materialistic and individualistic society, is one of the qualities that promote couple relationship well-being, said Carmen Delicata (right) during the ninth annual conference of the Gozo Diocese Family Commission at Villa Fiorita, Marsalforn.\n\nWith the theme X’ikissirha l-familja? Kif naffrontaw l-isfidi ta’ llum (What breaks up a family? How to overcome today’s problems) the conference looked at present-day problems leading to potential family break-ups and delved into ways and means how to overcome such problems.\nMs Delicata, a family therapist and lecturer at the Institute for Family Therapy (Malta), said marriage was not a destination, it was a journey along which the partners need to gradually learn how to focus on the relationship rather than on their individual, personal needs. “The quality and quantity of time spent together are both critical as is the balance of couple time versus time spent on individual pursuits. Physical and psychological intimacy as well as accepting that conflict is inevitable and can even be healthy if the partners learn to ‘fight fair’, ‘pick their battles’ and resolve conflicts through good communication are also core aspects of healthy relationships,” Ms Delicata said. “Developing a sense of commitment is also crucial, as committed couples are not anxious of losing their relationship,” she added.\nGozo Bishop Mario Grech stressed that applying Christian values in everyday family life as well as maintaining a close, personal relationship with God can only further strengthen couple relationships.\nFor further details on ongoing marriage preparation courses, parenting skills talks, thematic seminars and other initiatives call the Family Commission on 2155 6513 or e-mail: kdfgozo@gmail.com. One can also contact the Pope John Paul II Family Institute, Fortunato Mizzi Street, Victoria, on 7973 4831 or 9987 7339.", "comment_count": 0, "id": 2482}, {"keywords": "Gozo", "author": "", "article_body": "• The Feast of St John Bosco is being celebrated today at the Oratory in Victoria. Gozo Bishop Mario Grech will lead Mass at the Don Bosco Oratory chapel at 9am, with the participation of Chorus Urbanus, followed by the blessing of pets in St Augustine Square. This evening the La Stella Band will play marches from 4.30pm and then it will accompany the statue of St John Bosco during the procession at 5.30pm. The Don Bosco Grand Concert will be held at 7pm. Entrance is free.\n• A blood donation session will be held at Xewkija District Health Centre today between 8am and 1pm.\n• Today, the residents of San Blas, Nadur, will be celebrating the feast of St Blaise with a march by the Mnarja Band at 9.30am, followed by Mass at 10am.\n• The OASI annual bazaar is being held at St Francis Square, Victoria, Monday to Saturday from 8.30am to 12pm and from 4.30 until 7pm.\n• The Catholic Action Movement (Gozo) will be holding the Liturgy of the Word at Ta’ Pinu Sanctuary on Saturday. Bishop Mario Grech will present babies to Our Lady at 4pm. Parents, who are encouraged to bring a red candle, will be given a memento at the end of the ceremony.\n• The Capuchin Friars will be marking the 150th anniversary of the birth of the Servant of God, Fra Baskal, on February 10. The religious festivities open today with Mass at Żebbuġ parish church at 11am, where Fra Baskal was born. Bishop Mario Grech will celebrate Mass and lead a vigil prayer on Saturday. Fr Provincial Effie Mallia will lead solemn Mass next Sunday, followed by lunch for Fr Baskal devotees.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 2483}, {"keywords": "Education", "author": "", "article_body": "Asma, 25, is from Libya; Samir, 31, is from France; Merna, 25, is from Egypt; Mustafa, 24, is from Jordan; and Jasmine, 21, is from Malta. They are five of the 20 outstanding emerging young leaders from the Euro-Med region who recently participated in a week-long leadership seminar with the ambitious aim of preparing a new generation of dialogue leaders in the Mediterranean. They were selected from more than 500 eligible applications from over 30 countries.\nMaking a point.\nThe seminar was co-organised by the Mediterranean Academy of Diplomatic Studies (Medac) and the Anna Lindh Foundation in collaboration with the World Leadership Alliance – Club de Madrid. Medac was last year contracted to organise the Malta seminars, funded by the European Commission, and this was the first of three seminars that will take place in Malta over the next 18 months.\nThe seminar programme included interactive exercises on cultural intelligence, leadership skills training, training on how to communicate with the media and techniques of storytelling, as well as training on how to advocate effectively. The programme enabled participants themselves to select themes to work on during the week, which were translated during the seminar into stories that resonate with the media and specific policy proposals that the participants then presented to a panel of senior leaders/policymakers. The participants chose the themes of education, sustainable development and clean energy, youth participation, and migration and mobility.\nFormer Greek Prime Minister George Papandreou, was a special guest at the seminar, arranged through the World Leadership Alliance – Club de Madrid, the largest forum of former democratic Presidents and Prime Ministers. His frank conversation with the young participants enabled them to learn advocacy tips and formulate more specific policy recommendations.\nMr Papandreou was also on the final panel that participants presented their proposals to. The panel was moderated by Medac director Prof. Stephen Calleya, and included former Foreign Minister George Vella, under whose tenure the links between Malta and the Anna Lindh Foundation were firmly grounded, as well as Elena Grech, head of the European Commission Representation in Malta, and Gege Gatt, chief executive of ebo.ai and chairman of the Beacon Media Group.\nYMV seminar participants with organisers.\nThe programme included interactive exercises on cultural intelligence\nThe line-up of trainers and speakers included outstanding international journalists from across Europe and the Arab world, including Stephen Cole and Naomi Goldsmith, formerly of the BBC, Saad Hattar, trainer and reporter with Arab Reporters for Investigative Journalism, and Shahira Amin, who is now an independent journalist following her resignation in 2011 from deputy head of State-run Nile TV in Egypt. Other speakers included young policymakers such as MPs Byron Camilleri and Karl Gouder, local and foreign university professors as well as NGO activists, among them Amy Camilleri Zahra and Claudia Taylor-East.\nThe Anna Lindh Foundation was represented by its president Elisabeth Guigou, the first female Minister of Justice in France, and by Nabil Al-Sharif, its executive director. The programme included meetings with Acting President Dolores Cristina and the Speaker of the House Anglu Farrugia to share views and to discuss the participants’ aspirations. During an hour-long exchange on various topics, including migration, with Foreign Affairs Minister Carmelo Abela the latter spoke of the need to “build economies, not walls”.\nDuring the seminar Education Minister Evarist Bartolo announced that Malta will host the first Euro-Mediterranean Youth Debate Championships in July.\nThe highlight of the seminar for participants coming from the western Mediterranean countries represented in the 5 + 5 Dialogue Ministerial Forum – which also took place in Malta at the end of the week – was an exchange with foreign ministers of their country as well as EU High Representative for Foreign Affairs and Security Policy Federica Mogherini. During the meeting, Ms Mogherini said: “The young people involved in the Young Med Voices initiative are a source of inspiration. We are already transforming their ideas into practice. We are determined to continue to work together, to make their aspirations and their proposals reality”.\nThe Malta Leadership Seminars within the Young Mediterranean Voices (YMV) project are a core element of the programme funded by the European Commission, which also involves debating championships in the particular countries of the Euro-Med region, and will now also include the Euro-Med Championships in Malta later on this year. YMV itself evolved from its successful precursor – Young Arab Voices (YAV) – that enjoyed unparalleled impact across North Africa from 2011. The expansion from YAV to YMV was launched by Ms Mogherini at the Anna Lindh Euro-Med Forum held in Malta in 2016.\nFinal panel: Practising advocacy with former Greek Prime Minister George Papandreou, Malta’s former Foreign Minister George Vella, Medac director Prof. Stephen Calleya, Elena Grech, head of EC Representation in Malta, Gege Gatt, CEO of Ebo.ai and chairman, Beacon Media Group.", "comment_count": 0, "id": 2484}, {"keywords": "", "author": "", "article_body": "Regulatory standards for those providing residential services for persons with disabilities were launched on Friday.\nThe standards are set to be a guideline for organisations, entities or companies that provide assistance to those with disabilities.\nThe 19 standards are based on principles such as security, privacy and dignity, seeking to protect the rights of those with disabilities.\nService providers should create a personal plan for those with a disability and staff should support residents in reaching their goals, according to the standards.\nOne of the greatest fears of parents of children with disabilities is that the child will not be able to live independently when their parents pass away, Parliamentary Secretary for Ageing Anthony Agius Decelis told a press conference.\nThese standards will help provide peace of mind to families that their children will not be abandoned, he added. \n“Instead, we are ensuring they will be living at the heart of the community, with regulated services that support them,” Mr Agius Decelis said.\nThe standards also insist service providers should implement a management strategy to ensure that services are continuously updated, and that staff is continuously trained.\nSocial Care Standards Authority Chief Executive Officer Matthew Vella said the standards ensure that there is dialogue between the authority, service providers and those who benefit from the service.\nThe authority worked with different stakeholders to ensure the standards were realistic and feasible, he added.\n“I am certain that we will see a significant improvement in the quality of life of those with disabilities,” Mr Vella said. “In the coming weeks, we will be launching standards that are related with social well-being,” he added.", "comment_count": 0, "id": 2485}, {"keywords": "", "author": "", "article_body": "A motorcyclist sustained grievous injuries following an accident on the Coast Road on Saturday.\nPolice said the 50-year-old victim from Siggiewi, appeared to have lost control of his motorbike when the accident happened around 4pm. \nAn ambulance rushed the victim to hospital.\nPolice are investigating.\n ", "comment_count": 0, "id": 2486}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "An inquiry board set up last July to investigate allegations of “administrative and operational aspects” at the Malta College of Arts, Science and Technology has been given a second extension, the Times of Malta is informed.\nA spokeswoman for Education Minister Evarist Bartolo confirmed that the board of inquiry, chaired by financial adviser Paul Bonello, was now given until the end of March to submit its findings.\nThe board had been tasked with making its recommendations to the minister for possible further action by the end of September. Mr Bonello asked for more time and the deadline was extended to the end of 2018.\nHowever, the board still required more time, sources close to Mcast told this newspaper.\nSerious allegations of irregularities\n“The inquiry, which started after a senior member of the Mcast staff made serious allegations of irregularities and which might also involve political figures, is proving to be complicated,” the sources said.\nThey said it seemed there are many instances where senior Mcast officials and politicians responsible for the college might have looked the other way when reports of ‘abuse’ reached them.\n“It’s a very tricky inquiry,” the sources remarked.\nIn a short statement last July, the Education Ministry had said that allegations “of a criminal nature” made by a senior member of staff had been referred to the police.\nMr Bartolo had also announced he had appointed a board of inquiry to look into administrative and operational aspects raised in the allegations.\nThe Times of Malta had reported that the allegations of a criminal nature included claims of possible sexual abuse by members of the college staff in a programme for psychologically-challenged students. The programme, called Pathway, is the main focus of the allegations made.\nTimes of Malta is informed that the individuals mentioned in the allegations are still employed at Mcast because recommendations to suspend them by another independent inquiry to do so were, for some reason, not implemented.\nThe new investigation had started shortly after a change at the helm of the college.", "comment_count": 2, "id": 2487}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Cleaning services at St Vincent de Paul Complex, in Luqa, cost three times the amount projected in 2011, the Times of Malta is informed.\nA three-year competitive tender issued in 2011 had put the cleaning bill at the government’s old people’s residence at €3.2 million. However, the government has admitted it forked out three times that amount between 2015 and last year, paying a Naxxar firm, selected through a direct order, more than €9 million.\nDetails of the payments to X-Clean Ltd, show that company owner Denis Xuereb, of Naxxar received payments exceeding €9.5 million between April 2015 and last month. The information was given in Parliament by Family Affairs Minister Michael Falzon in reply to a written question tabled by Nationalist MP Jason Azzopardi.\nInitially, Mr Xuereb started billing the government slightly over €120,000 a month for his company’s services at the old people’s residence. However, the monthly bills kept rising, exceeding €300,000 a month by the end of last year. All payments were approved by the old people’s home management.\nExceeded €300,000 a month by the end of last year\nWhen the three-year contract, issued in 2011 after a call for tenders, expired X-Clean Ltd was allocated a direct order, which was extended every six months with the Finance Ministry’s blessing.\nAfter reports appeared on the Times of Malta about allegations of ‘abuse’ in connection with the cleaning services at the Luqa facility, the Department of Contracts, last month, issued a new call for tenders, which, it said, had been three years in the making due to “complications”.\nContracts director general Anthony Cachia told this newspaper his department had only authorised payments for cleaning services. However, the Times of Malta reported that X-Clean was also paid for a raft of other services, including gardening, hairdressing, engineering and secretarial work. The home’s CEO, Josianne Cutajar, failed to say why such services were procured from a cleaning company.\nEarlier this week, this newspaper said industry operators were smelling a rat in the technical requirements issued in the latest public call. According to the specifications, only cleaning companies with a turnover of €12 million are entitled to bid. An identical tender for a much bigger contract, at Mater Dei Hospital, had set the turnover at €1 million.\nIt is known that, in 2015, X-Clean had also been given direct orders for cleaning services at other government residential homes for old people when such facilities fell under the political remit of now Home Affairs Minister Michael Farrugia.\nPayments to X-Clean Ltd\n2015: €1,230,6522016: €2,053,8432017: €2,562,5492018: €3,335,867Total: €9,182,908", "comment_count": 34, "id": 2488}, {"keywords": "", "author": "", "article_body": "The Nationalist Party called for the protection of the unborn by updating the country's laws and also to ensure Malta remains a \"model\" to the EU. \nIn a statement to mark the World Day for Consecrated Life, the PN said it was now clear that there was no place for abortion in Malta and therefore the rights of the unborn should be protected at law.\n\"The Opposition believes in a modern society and progress should be reflected in increasing the rights of the most vulnerable,\" PN spokesman Claudio Grech said. \nIt was also important to eliminate prejudice against those mothers who choose to continue giving protection to their unborn children, despite the difficulties they may encounter. \n ", "comment_count": 13, "id": 2489}, {"keywords": "", "author": "", "article_body": "Updated 5.45pm with new video\nFormer Nationalist MP and current Law Commissioner Franco Debono unleashed a scathing attack against Prime Minister Joseph Muscat on Saturday, describing him as the \"most corrupt politician\" in Malta's history.\nIn a cryptic blog post on Saturday, the criminal lawyer said \"the time had come\" for him to speak out and warned the Prime Minister that: \"tomorrow I would be able to speak better\".\n\"You swallowed it hook line and sinker, because you were always a fool,\" said his undiplomatic post.\nAlso on Saturday, the lawyer uploaded a video on Facebook decrying the government's decision to select Marie-Louise Coleiro Preca to head the constitutional convention after she steps down as President. \n\nThe attack comes just a day after he uploaded another contentious post, saying that from all the facts in the public domain one can argue that given the circumstantial evidence, the secret company Egrant belongs to Joseph Muscat or someone close to him.\n“Muscat should stop playing hide and seek. I’ve known him since Form 2C and I’ve never known him to be particularly brilliant... The Egrant inquiry didn’t find who Egrant belongs to nor did it find who it doesn’t belong to, because it seems as though it excluded no one,” he wrote. \nRead: PM will drop proceedings against Caruana Galizia if family accepts Egrant inquiry conclusions\nThe statement came just hours after the Prime Minister said in court he was wiling to drop libel proceedings against slain journalist Daphne Caruana Galizia if her family accepted the conclusions of the Egrant inquiry. \nIn another post, Dr Debono thanked those who were encouraging him to stand as a candidate in the European elections. \nDr Debono served as an MP for the Nationalist Party between 2008 and 2013 but his term will be remembered for his incessant attacks against his own party's Cabinet led by Lawrence Gonzi. After the 2013 election, he was elected Law Commissioner by the Labour government. \nRead: Gonzi and Debono head for showdown", "comment_count": 287, "id": 2490}, {"keywords": "", "author": "Denise Grech ", "article_body": "With an income of €762, Malta’s national minimum wage is below the European Union average, Eurostat data has revealed.\nAs of this year, 22 out of the 28 member states of the European Union have national minimum wages, Eurostat said. Only Denmark, Italy, Cyprus, Austria, Finland and Sweden do not have a set minimum wage, the EU data bureau added.\nAccording to the data submitted by the 22 countries last month, the average minimum wage across the European Union was €924 – a far cry from the €762 earned by minimum wage earners in Malta.\nBy the end of last month, Bulgaria had the lowest gross minimum wage across the EU – just €286. Eastern European member states had minimum wages between €400 and €600 per month.\n€762 earned by minimum wage earners in Malta\nSouthern European member states, including Malta, Greece, Portugal and Spain, all had minimum wages ranging between €650 and just over €1,000 per month. Malta fared better than Greece and Portugal, but worse than Slovenia and Spain.\nIn the remaining seven member states, all located in the west and north of the EU, minimum wages were above €1,450 per month: the United Kingdom (€1,453), France (€1,521), Germany (€1,557), Belgium (€1,594), the Netherlands (€1,616), Ireland (€1,656) and Luxembourg (€2,071).\nAcross the 22 member states, the highest minimum wage in the EU was more than seven times higher than the lowest, Eurostat said.\nIn 2017, an agreement was signed by unions, social partners and political leaders to increase the minimum wage by €8 per week. That year, just under 4,000 people were on the minimum wage.\nNGO Moviment Graffiti had noted the increase would only kick in once workers completed two years of employment, meaning it did not really raise the statutory minimum.\nBack in 2012, Prime Minister Joseph Muscat had called for the introduction of a “living wage” – a calculation of how much money a person needs to live a decent life – that would be significantly higher than the current minimum wage of €158 per week. Dr Muscat had later said it was “irresponsible” to raise the minimum wage.", "comment_count": 84, "id": 2491}, {"keywords": "", "author": "", "article_body": "Young people have a key role to play in driving society to reduce single-use plastics, MEP Miriam Dalli said on Saturday.\nThe Labour MEP said youths and children were often the leaders in driving environmental change and noted that while legislators were introducing laws to cut single-use plastics, behavioural change would occur even faster if communities took the initiative and got involved.\n“Not all plastic is bad but a lot of that plastic can be replaced. With extra effort, tackling the large generation of plastic waste will become easier as producers and consumers switch to alternative products,” she said.\nShe welcomed plans to introduce a bottle return scheme and applauded outlets which had already introduced their own alternatives to plastic.\nDr Dalli noted that there was a lot of interest from young people in the matter.\n“I see this at every meeting held and activity I attend to. In meetings at schools and other places, students ask how they can do their part in helping to clean up the environment and reduce plastic use”.\nPlastic makes up almost 85 per cent off all marine litter, and just 10 single-use plastic items make up more than 40 per cent of waste found on European beaches.\nThe European Union has plans to ban a number of these single-use plastic items in the near future and introduce strict restrictions on others. Dr Dalli, who is environment coordinator for the Socialists and Democrats Group in the European Parliament, has worked on amendments for such laws.", "comment_count": 7, "id": 2492}, {"keywords": "", "author": "", "article_body": "A former European justice commissioner agreed with Malta’s passport sales programme and endorsed it in writing, Prime Minister Joseph Muscat has insisted.\nDr Muscat said he would be “standing by” what Viviane Reding had “declared in writing” prior to the introduction of the Individual Investors Programme. “We stand by what the [European] Commission told us in writing and declared publicly when we reached an agreement with the Commission,” he said. \nDr Muscat was reacting to comments by the present European Justice Commissioner Vera Jourova who said last week the EU executive was looking at the scheme with concern, adding Brussels did not endorse any cash-for-passports programmes.\nShe cited a Commission report published last week warning member states that “golden visas and passports” could give rise to corruption and money laundering. \nBrussels commented in its report that Malta’s scheme had no actual mechanisms to ensure passport buyers in fact lived on the island or formed a genuine link in other ways.\nWhen the scheme was first launched in 2014, it had initially encountered strong resistance by the Commission, even mulling infringement procedures against the island.\nIt had raised concerns that the island was putting all 28 EU member states at risk if due diligence failed to weed out proper criminals. Ms Reding had warned that the Maltese scheme breached EU and international law, which the government denied.\nEventually, the government agreed to ensure that those buying a Maltese passport established a genuine link with the country through a 12-month residence period prior to becoming a Maltese citizen.\nAt the time, Ms Reding had announced that the EU Commission had reached an agreement with Malta about its proposed citizenship programme. \n\"Glad that thanks to support from European Parliament, constructive cooperation with the Maltese, we found a solution on the Maltese citizenship issue,\" she had tweeted following talks and an official statement on the matter. \nA spokesman for the Parliamentary Secretary for Citizenship, Julia Farrugia Portelli, said the scheme had the Commission’s backing and was yielding economic benefits.\n“The IIP reaps economic benefits of investment migration, a sector that has significantly boosted employment across the EU and beyond. In its report, the EU acknowledges that the decision to naturalise citizens is the sovereign right of each member state. It is also clear from the report that Malta stands out as having a robust programme,” the spokesman said.\nHe added the report also recognised Malta’s commitment towards transparency, being one of few European countries that published the names of individuals who obtained citizenship.\n“Malta’s programme has had a positive impact on the country by attracting a wealth of new talent and foreign direct investment from across the globe. During the first four years, the IIP generated an income of over €700 million, 70 per cent of which will be reinvested in infrastructural and social projects for the benefit of current and future generations,” he pointed out.", "comment_count": 85, "id": 2493}, {"keywords": "", "author": "", "article_body": "Updated at 1.55pm with AD statement\nMalta’s development fever had activists and would-be politicians sounding alarm bells on Saturday, with four separate statements warning against the rush to build tunnels, reclaim land or dump rubble at sea.\nIn four separate statements, Nature Trust, Moviment Graffiti, the Democratic Party’s MEP candidates and Alternattiva Demokratika all expressed concern at various plans being floated by government and construction lobbyists.\nGozo tunnel\nDemocratic Party MEP candidates noted that the Gozo tunnel seemed to already be a done deal, despite a “total lack of public participation” in discussing it.\nTimes Talk: 'Gozo tunnel will be a private sector project'\nIn their statement, PD candidates Camilla Appelgren, Anthony Buttigieg and Martin Cauchi Inglott noted that the Gozo tunnel project seemed to be steaming ahead with little thought or consultation.\n“We cannot allow such projects to be presented as a fait accompli,” warned Dr Buttigieg, who said that the party would be unveiling its policy for Gozo in the coming days.\nFranco Mercieca, who heads a steering committee tasked with overseeing tunnel plans, has completely ruled out the possibility of the tunnel being used for a mass public transport system, insisting that the tunnel will be built and operated by the private sector and used for vehicles.\nPD warnings were echoed by Alternattiva Demokratika chairman Carmel Cacopardo, who on Saturday morning said that the tunnel would be the \"ruin of Malta and Gozo\". \nThe project, he said, would end up damaging the Miżieb aquifer, the Pwales Valley and Simar nature reserve, while encouraging car use between the two islands - contrary to the spirit of a 2016 National Transport Masterplan.  \nXgħajra land reclamation\nAn eventual tunnel will create massive amounts of rubble, and with it a question of what to do with it. \nOne mooted plan, which was first revealed by Times of Malta, is to use the Xgħajra coast for a large-scale land reclamation project. The spot has been earmarked as being the most suitable to a large-scale reclamation project.\nBut that plan, which has yet to be confirmed and is still at its embryonic stages, has already run into opposition. \nOn Saturday, activist group Moviment Graffiti reiterated their objection to any form of large-scale land reclamation in Xgħajra and highlighted concerns others had voiced. \nAmong those warning against developing the seabed in the area was the National Fisheries Cooperative, which warned of a “major socio-economic catastrophe”, and Xgħajra residents themselves.\nMoviment Graffiti said that talk of reclaiming land in the area was part of a larger problem of hyper-development, with plans for massive developments by db Group and Corinthia in St Julian’s and another in Mistra expected to create the tonnes of construction waste which would make land reclamation necessary in the first place.\n“Moviment Graffitti is strongly against these massive projects, which will clearly only benefit the owners, while destroying Malta's precious environment along the way,” the activists said. “The people and the environment must come first.”\nDumping construction waste at sea\nConstruction rubble was also on Nature Trust's mind, which on Saturday took issue with the Malta Developers Association's suggestion that builders be allowed to dump construction waste at a designated site at sea, given that there was nowhere left to dispose of it.\nThe problem had been a long time coming, Nature Trust noted, and developers were now “taking the easy way out” and calling for a quick-fix solution.\nBut a large proportion of Malta’s territorial waters, the NGO noted, had been recently designated a Marine Protected area and globigerina limestone had only recently been designated a Global Heritage Stone Resource.\n“Yet it seems that the MDA deems it fit to dump into the sea,” Nature Trust said.\nInstead of looking for a new dumping ground, it said, pland should focus on reducing the amount of construction waste by encouraging building plans which cut waste, using standard sizes and using any cut-offs for future projects and using waste stone to restore rubble walls or reconstitute building blocks.\n ", "comment_count": 132, "id": 2494}, {"keywords": "", "author": "", "article_body": "Updated 2.15pm with minister's reaction\nMalta’s economy continues to outperform that of many of its peers although growth is likely to taper in the coming years, Fitch Ratings have said in a report which reaffirmed the country’s ‘A+’ rating and stable outlook.\nAnalysts with the rating agency highlighted the country’s “very favourable” debt dynamics, with public debt down to 47.3% of GDP and expected to fall to 41.7% by 2020 an 26.7 per cent by 2028, and GDP growth which has “continued to suprise” and “not led to overheating”.\nThey nevertheless predicted that infrastructure bottlenecks, real estate and labour market constraints leading to higher rents and wages would dampen growth in the years to come.\nThe rating assessment was undertaken by request from the Maltese government, which earlier this week disclosed in parliament that it had paid rating agencies €230,000 last year. The disclosure came in reply to a parliamentary question.\nIn their report, Fitch analysts said they expected tax revenues to fall as a share of GDP due to a one-off impact of a new EU directive on eVAT revenues, and also foresaw a gradual decline in the relative imporance of income from passport sales.\nThat revenue stream provided 2.2 per cent of GDP in 2017 but is now expected to fall to 0.9 per cent this year.\nHigher capital expenditure reflected an increase in the use of EU funds with a focus on roads, environment, health care and education projects, Fitch said.\nFitch analysts noted that a disorderly Brexit could disrupt the Maltese economy, since roughly one in every four tourists – 24 per cent – came from the UK. Four years ago, that figure stood at 32 per cent.\nInflation is expected to rise slightly to 2 per cent in 2020, while the rise in property prices appeared to be moderating, with a 5 per cent increase registered in the third quarter of 2015, when compared to an 8.6 per cent increase three years prior.\nMalta’s small and very open economy left it vulnerable to external shocks, the ratings agency noted, but Maltese banks “remain sound and well capitalised”.\nAnalysts noted that Pilatus Bank has had its licence withdrawn by the European Central Bank and said that the Maltese government was in the process of implementing recommendations made by the International Monetary Fund and European Bank Authority to improve anti-money laundering processes.\nIt was not all good news, though. While Malta outperformed many ‘A’ rated peers, analysts also noted that the country has slipped down the World Bank’s voice and accountability index and did worse than average when ranking the ease of doing business.\nIn a statement, the government said that contrary to the Opposition’s line of argument, Fitch had found that “Malta outperforms the ‘A’ median on the World Bank human development and governance indicators”.\nIn another statement, Finance Minister Edward Scicluna said the ‘A+’ rating by Fitch following Moody’s ‘A3’ grade earlier this week, continue to strengthen our view that the government’s strategic vision for our country is being \"accomplished”.", "comment_count": 63, "id": 2495}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Almost two months after his sacking by Deputy Prime Minister Chris Fearne, Neville Gafà is still listed on an internal government server as working in his private secretariat.\nThe Times of Malta received a screenshot from the government’s online server, which gives details on all public employees, their designation, posts and contact details, showing Mr Gafà listed as still occupying the post of projects director at the office of the Deputy Prime Minister.\nWhen confronted with this information, a spokeswoman for Mr Fearne vehemently denied Mr Gafà was still on their payroll.\n“As stated on different occasions, Mr Neville Gafà is no longer employed with the Ministry for Health or with the Office of the Deputy Prime Minister,” she insisted.\nHe is no longer employed with the Ministry\nThe Office of the Prime Minister is refusing to state in which department Mr Gafà is working. Information reaching Times of Malta indicates that he is still seen at the Office of the Prime Minister, usually at the office of Keith Schembri, the Prime Minister’s right hand man.\nRead: Gafà doing 'voluntary' work at OPM\nMr Gafà has hit the headlines various times over recent years, particularly after allegations that he was involved in the issue of medical visas and because of his close contacts with Libyan officials. He has always denied any wrongdoing.\nFollowing a stint working at the private secretariat of then Health Minister Konrad Mizzi, Mr Gafà, who served as a salesman until 2013, was made projects director at the Foundation for Medical Services, enjoying a financial package of almost €50,000. Investigations by this newspaper, however, showed that, in fact, he was working as a customer care officer at the Office of the Prime Minister.\nFollowing his controversial trip to Libya late last year, when he met government ministers and was also spotted speaking to a militia leader, Mr Fearne instructed the Foundation for Medical Services to rescind his contract.\nWhen asked about his meetings in Libya, Mr Gafà said that he was “on holiday” and that he just happened to meet the militia leader when he “bumped into him on the street”.\nPrime Minister Joseph Muscat defended Mr Gafà, saying he did good work.", "comment_count": 103, "id": 2496}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Saturday.\nThe Times of Malta reports that Malta’s minimum wage is below the EU average.\nThe Malta Independent reports a BirdLife Malta claim that the 75 protected birds found shot during the autumn hunting season were “just the tip of the iceberg”.\nIn-Nazzjon reports that Nationalist Party leadership met with farmers and farming sector representatitves to discuss proposals for sustainable farming and more local produce.\nL-Orizzont quotes parliamentary secretary Silvio Schembri, who said banks should not be “glorified deposit boxes” and had to be willing to offer basic services to customers, even if it involved an element of risk.", "comment_count": 0, "id": 2497}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government is refusing to publish a memorandum of understanding it signed with the Corinthia Group four years ago as plans for a controversial deal transferring St George’s Bay peninsula to the hotel chain for speculation purposes continue.\nIn a joint press conference in 2015, Prime Minister Joseph Muscat and Corinthia chairman Alfred Pisani had said the group would be investing €400 million in its three existing hotels in St Julian’s to develop what was described as “an oasis of excellence” in the tourism industry.\nNo mention of any MOU had been made on that occasion.\nThe existence of a preliminary agreement surfaced last December, when Tourism Minister Konrad Mizzi briefed the parliamentary National Audit Office Accounts Committee on a draft deed enabling the Corinthia to build apartments and offices for sale on public land allocated to it for tourism purposes only.\nEfforts by Times of Malta to obtain a copy of the preliminary agreement proved futile and a request under the Freedom of Information Act has now been made. The government is resisting calls by both the Nationalist and Democratic parties to publish the 2015 MOU.\nAfter the government rejected a call by the PD to “come clean” over the deal, tourism shadow minister Robert Arrigo on Tuesday asked Dr Mizzi to allow MPs to view the MOU but the minister refused. He said the document would be published “later” since the final agreement with the Corinthia was still being negotiated. No dates were mentioned.\nWhen presenting the draft deed to the parliamentary committee a day before Parliament stopped for the Christmas holidays, Dr Mizzi admitted that the parameters of the proposed agreement were based on a similar deal the government had made with the Seabank db Group involving the sale of public land on which the Institute for Tourism Studies stood.\nThe db Group deal is being investigated by the Auditor General.\nThe minister wanted the committee to approve the draft deed that same day but Nationalist MPs Beppe Fenech Adami and Mario de Marco objected and insisted the Opposition wanted more time to study the agreement that was changing the parameters of the whole concession given to the group in the 1990s.\nAccording to the still unpublished draft deed, the whole of the St George’s Bay peninsula, considered the most lucrative real estate on the Maltese islands, would be handed over to the Corinthia under a new 99-year temporary emphyteusis.\nTimes of Malta has reported that, in contrast to the original deed, in which the Corinthia was only allowed to use the public land for tourism purposes, mainly hotels, the government conceded to allow the hotel chain, which has strong foreign shareholding, the possibility to build up to 100,000 square metres of apartments and offices for rent or sale.\nIn return, Corinthia promised to pay a premium of €17 million for public land, which estate agents estimate would fetch at least €700 million in line with present market prices.\nAs part of the deal, the hotel chain also promised to upgrade two of its existing hotels there.\nIn the wake of harsh criticism by the business community, particularly developers and real estate agents, accusing the government of “selling public land for peanuts while distorting the market”, the government decided to re-start negotiations in a bid to mellow the proposed deal and make it more “sellable”.\nSources close to the negotiations described the ongoing talks as “cosmetic” and aimed at eliminating the possibility that the deal would be seen by the EU as breaching state aid rules.", "comment_count": 27, "id": 2498}, {"keywords": "", "author": "Ivan Martin", "article_body": "A Maltese mobile phone gamer is hoping to go pro as he travels to the ‘World Cup’ of a popular strategy game this weekend. \n\nSpending hours glued to your mobile phone, crushing ‘candy’ or catapulting ‘angry birds’ might seem like a bad habit for most, but not for 18-year-old Angelo Vella who is hoping to make a name for himself on mobile gaming phenomenon Clash Royale.\nHis index finger and thumb gliding over his phone’s screen, Mr Vella told the Times of Malta how he spends around five hours a day transfixed to the strategy game that sees players engage in one-on-one face-offs using decks of digital playing cards.\nAfter coming up on top at the Malta qualifiers last year, the gamer will this weekend be representing the country in a worldwide showdown in Germany with a €50,000 prize pool at stake.\nBut his hopes are not limited to bringing home the prize money. Mr Vella says he wants to get noticed.\n“There are professional teams and you can play this game professionally – if you are good enough. That is something I am hoping for. It won’t be easy, but I’m going to try,” he said, from the dining area of his family’s Qawra hotel.   \nMr Vella already forms part of a team of gamers called Qlash Academy, but is still only classified as an amateur. \nYou can play this game professionally – if you are good enough\nThe regular monthly salaries of average professional gamers can range from a modest €1,500 to €6,000, and the highest paid players on platforms like League of Legends can earn up to €15,000 monthly apart from prize money and sponsorships.\nIt is estimated that around 427 million people worldwide will be watching some form of e-sports this year alone, so the market for these competitions is very much alive and kicking.\nMr Vella has a Clash Royale dream. Photo: Shutterstock\nWhether it’s EA’s FIFA football game series or Valve Corporation’s Dota 2, players around the world are lining up for a chance to get their hands on hundreds of thousands of dollars in prize money, in front of millions of viewers watching online and in physical arenas.\nThe competition in Germany will be huge. There will be a total of 36 players, all representing the best their country has to offer, and for Mr Vella to stand a chance of coming on out on top he will have to win against all his opponents.\n“I’m just going to give it my best shot,” he said. ", "comment_count": 8, "id": 2499}, {"keywords": "", "author": "", "article_body": "A recent attempt to portray the annual Christmas party organised by the Central Bank’s social club as a political party activity complete with political chants was “a despicable attempt”, the bank said on Friday, saying that it was not run on politically partisan lines.\nA video clip purporting to show Central Bank employees dancing and singing political chants turned out to have been fabricated, merging scenes from a 2013 YouTube video of a Spanish disco in Barcelona with sound from the counting hall during the last general election.\nThis was later admitted by the person commenting about the clip aired on the NET TV programme Sorsi Infurmati, the Central Bank pointed out.\n“The Central Bank of Malta strongly rejects and condemns any attempt, from within and outside the bank, to cause political division and discord among the bank’s staff,” it said, adding that there was no proof about misconduct which would have merited action.", "comment_count": 46, "id": 2500}, {"keywords": "", "author": "", "article_body": "A 30-year-old Paola man was crushed after the vehicle he was working on slipped, pinning him underneath it.\nThe police said that the incident occurred at 2pm in Triq l-Industrija in Qormi. The Civil Protection Department was called in to assist with the rescue.\nInvestigations are still underway.\n ", "comment_count": 0, "id": 2501}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The banking sector’s reticence when opening new accounts was in breach of EU rules, Prime Minister Joseph Muscat warned yesterday.\nSpeaking at the launch of the Malta Financial Services Authority’s Vision 2021, he said that though he appreciated the banks’ attempts to de-risk, he could not tolerate a situation where “legitimate” people and businesses could not open new accounts. He praised the MFSA recent campaign to remind entities that access to a basic bank account was a right they could insist on.\nIn line with a 2016 legal notice, banks having five or more branches in Malta must offer a payment account with basic features. The MFSA is now putting subtle pressure on the five banks that fall into this category – APS, BNF, Bank of Valletta, HSBC and Lombard – by telling people they had a right to open such an account. This also extended to people with no fixed address, refugees, stateless individuals and asylum seekers.\nSince the MFSA warning, bank branches have started to clearly display posters and MFSA material explaining people's rights.\n“Banks are not supposed to be just safety deposit boxes,” Dr Muscat scoffed, adding that Malta needed more banks to offer more alternatives and make the service more efficient.\nReferring to criticism levelled at the financial services watchdog, the Prime Minister noted it was lambasted both for being too lax and for being too strict, “sometimes by the same people”. The government was convinced it was doing a good job and took appropriate action when necessary.", "comment_count": 85, "id": 2502}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The arraignment on Friday of a man charged with having threatened someone with a knife was marked by loud bouts of his sobbing.\nRenald Baldacchino, a 39-year old salesman from Qormi, pleaded not guilty to having threatened his victim, as well as to attacking and insulting him.\nHe was further charged with breaching bail conditions, committing the wrongdoing while under a suspended sentence, as well as with recidivism. He is facing drug-related charges in separate proceedings.\nA request for bail was turned down by the court, presided over by magistrate Astrid May Grima, after the prosecution argued that civilian witnesses were yet to testify and that the accused had failed to learn from past brushes with the law.\nUpon a request by the defence lawyer, the court recommended that the accused be detained at the Mount Carmel Hospital Forensic Unit so as to be afforded all necessary help to overcome his drug dependency.\nInspector Kylie Borg prosecuted.", "comment_count": 0, "id": 2503}, {"keywords": "", "author": "", "article_body": "So far, only 30 per cent of MEP candidates are women, prompting the National Commission for the Promotion of Equality to urge more women to come forward.\nThe percentage is better than the last general election, when women accounted for only 20% of all candidates but the commission lamented that Malta was still far from reaching gender balance in candidates’ lists.\nThe NCPE said there were several barriers hindering women from their full political participation, but underlined that their representation in the European Parliament would give women a stronger voice and allow them to engage in actions that bring about an equal, just and inclusive society.\nIt said that past elections showed that women have more or less the same chances as men to succeed, as the percentage of women elected is often similar to the percentage of women contestants.\n\"Political parties should also do their utmost to encourage women to participate in the upcoming MEP elections. They should ensure that women have equal access to resources and media coverage, and also review the party structures to address any direct or indirect obstacles to the participation of women in politics in order to move towards a level playing field for all,\" it said.", "comment_count": 12, "id": 2504}, {"keywords": "", "author": "Ivan Martin", "article_body": "New specialised software will help police and customs clamp down on fraud, while cameras will help locate stolen cars and other irregularities on the road, Home Affairs Minister Michael Farrugia said on Friday.\nAddressing a press conference, Dr Farrugia said the law enforcement software, called i2, s designed to help investigators visualise and process complex data to investigate and prevent crime – particularly that linked to fraud and abuse of the EU budget.\nEU Funds Parliamentary Secretary Aaron Farrugia said some €1.5 million had been secured from the European Commission’s Hercules Fund to purchase the software, accompanying hardware, as well as to pay for training for specialised police officers and Customs officials.\nRead: Facial recognition CCTV in Paceville... and then Marsa\nMaltese Police had to put in a bid for these direct funds, competing against bids from other member states.\nSome €20 million worth of project investment was currently being implemented by the police, across a number of different schemes. €6 million of this had come from the last EU funding period.\nNew camera technology \nMeanwhile, Dr Farrugia said over the next year and half the police would be rolling out new camera technology, including in police cars that was meant to help locate stolen vehicles and license plate irregularities.\n“This is all part of our effort to not only combat and solve crime, but also to prevent it from happening in the first place,” Dr Farrugia said.\nHe reiterated statements he has already made in previous weeks, that preliminary data for 2018 showed that “criminality” was down.\nDespite having more people on the island and increased activity with potential links to crime, Dr Farrugia said, the police’s efforts to act as a deterrent was reaping benefits.", "comment_count": 2, "id": 2505}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Updated with authorities' reaction\nA funeral director has denied responsibility over the burial of motorcyclist Johanna Boni in a plastic bag, contradicting a statement by the health authorities who also denied any form of responsibility.\nFuneral director Anna Falzon said she is not allowed to handle a corpse at the mortuary, let alone dress them. She was reacting to claims made by a spokeswoman for the Mater Dei Hospital’s morgue that it was the funeral director who was responsible for the shrouding of the deceased.\nMs Boni was crushed to death by a cement mixer in Labour Avenue, Naxxar on January 5, 2016. The 27-year-old was riding her Kawasaki ER6N to work at the time.Ms Boni was just 26.\nAt the time of her burial, her relatives had been advised not to look inside the coffin. But when the grave at the Mosta cemetery was reopened for the burial of her grandfather last week, the parents discovered that their daughter had been buried in a plastic bag placed inside her white coffin.\nThe shocking discovery was reported by the Times of Malta on Wednesday.\nThe ministry told the Times of Malta said that when a person dies outside Mater Dei, the hospital is not responsible for the body of the deceased. Ms Falzon said that the spokeswoman’s claims were “absolutely untrue.”\n“All I have to comment about this case and every other case is that as Funeral Directors, we never dress the deceased when the body is in the mortuary.\n“We aren’t even authorised to touch the deceased in the mortuary, let alone dress them. We dress deceased persons only when they die at home and the funeral cortege would be leaving from there,” Ms Falzon said.\nLegal procurator Quentin Tanti, who is counsel to Ms Falzon, said his client was denying that she was responsible for burying Ms Boni in a plastic bag.\nFuneral organisers were responsible - health authorities\nAsked about the matter yesterday, Health Minister Chris Fearne said: “First of all, when there is a death that does occur outside the hospital, the government is not responsible for the shrouding of the body or for the burying. It is the funeraldirectors that is responsible. In this case I am informed that this was a forensic case and that there were legal procedures.”\nWhen pressed to say whether the authorities were in any way monitoring the work of the funeral directors to make sure that they abided by the laws in place and that people were buried in a decent way, Mr Fearne evaded the question, insisting that the hospitals always made sure the law is observed.\n“All burials are regulated by the Burials Act. Obviously, if the law is broken then the authorities will monitor. From our end, we are very rigorous when caring for anyone in our responsibility, meaning anyone from our hospitals, to ensure we observe the law,” Mr Fearne told the Times of Malta.\nHospital chief executive Ivan Falzon echoed Mr Fearne’s explanation, addingthat “if the death occurs outside hospital, the undertaker brings clothing and thebody is clothed by mortuary staff according to instructions by the undertaker, who retains full responsibility for this process, in line with the wishes of the family.”\nHe said there were instances where the circumstances do not allow the body to be fully clothed. “In that case the responsibility to communicate this fact to the family was of the funeral organiser.”", "comment_count": 86, "id": 2506}, {"keywords": "", "author": "", "article_body": "Maltese farming continues to die down, with sales decreasing by 9 per cent last year, the Nationalist party warned.\nPitkalija sales went down by 20 per cent in Malta and 35 per cent in Gozo last year, it added in a statement.\nDuring a meeting with farming representatives, Nationalist party leader Adrian Delia said everyone would suffer if the farming industry died out, since there would not be any fresh Maltese produce.\nDuring the meeting, various farmers’ representatives said farming needed to take priority in Maltese politics, the PN added.\n\"We want to help farmers because they have a lot to contribute to our economy and society,\" Dr Delia said. \"In the last budget the government made it clear that farmers do not contribute to the economy,\" he added.\nWatch: \"Malta's agriculture will die unless…\"\nEuropean regulations promoting Maltese produce were never used by the Maltese government, despite the regulation being in effect for over six years, the Nationalist Party said.\nThe PN proposed using European regulations to promote fresh Maltese produce and tapping into other European regulations to effectively market Maltese products abroad.\nThe PN said its proposals sought to help the industry by strengthening representative organisations with technical assistance.\nThe Nationalist party will be organising a meeting to explain their proposals. The first meeting will be held February 23 in Gozo and March 1 in Malta.", "comment_count": 11, "id": 2507}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Finding something you dropped on the floor or making sure the boxed milk in your refrigerator is not past its due date might be challenging if you are visually impaired or completely blind.\nBut an app that has become available in Malta is making it a little bit easier for people with visual difficulties as they can now ask someone to help them out with the click of a button.\nFor blind user Anthony Borg, the best thing about the app is that volunteers can help out from wherever they are.\nThe Be My Eyes app works similarly to the telecare system, with users downloading the app on their smartphone.\nIf a blind user needs help to decipher the colour of a shirt or understand whether they are holding a five or a €50 note, they just press a button on their phone.\nA volunteer, matched by language and time zone, will contact them to help out via video conferencing and the exchange can be anonymous. This is especially helpful for blind people who live on their own.\nWhen one signed up one could now choose whether the primary language was Maltese, Mr Borg noted. The nearly two million volunteers worldwide who signed up to the Be My Eyes app speak more than 180 languages.\nMr Borg first heard about the app from his colleagues who live abroad. After seeing how it worked, he contacted the people behind Be My Eyes and they showed interest in expanding it to other countries, including Malta.\nSo far, 30 blind or low-vision users and 388 volunteers from Malta have signed up.\nA Maltese volunteer urged readers to start using the app because it felt great to be of use to someone sometime.\n“Given the fact that the global ratio of seeing people to that of the blind is so huge and also considering that the technology is already there, I think no blind person should ever find him/herself in a situation where they can’t ‘borrow’ someone’s eyes if only for a minute or two,” he said.\n“The app gives seeing users an opportunity to help make someone’s day better with very little effort. I understand how selfish this statement sounds, however, it’s what I believe to be the truth,” the volunteer said.\nThe app can be downloaded for free from the App store or Google Play.\nMore information on www.bemyeyes.com.", "comment_count": 0, "id": 2508}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A legal limbo in the Cultural Heritage Act led a man who lost two successful auction bids to the Superintendent of Cultural Heritage to file a judicial protest.\nHistory researcher Simon Cusens had won two auctions for 18th century manuscripts - Blocco di Malta Notamenti 1798-1799 by Vincenzo Borg and a set of manuscripts by George Mitrovich dating back to 1818-1878 - but these were acquired by the Superintendent of Cultural Heritage who claimed right of preference.\nThe researcher was informed of a right to appeal under Article 51 of the Cultural Heritage Act, supposedly catered for by regulations under the hand of the relative minister, only to discover that no such regulations were ever drawn up.\n“The protestant finds himself in the surreal situation where as a person directly affected by the exercise of the Superintendent’s power… whilst given the right to file an appeal, finds that the mechanisms and procedures which would permit him to appeal do not exist.”\nThe law did not indicate a forum in which he was to submit his appeal, or timeframes or an indication of the requisites for the appeal. “All there is, is a legal limbo,” reads the protest.\nClaiming that this breached his fundamental right to access to a court, the protesting party called for the immediate provision of a legal remedy by the protested parties, and reserved his right to claim damages.\nThe protest, signed by lawyers Kris Busietta and Julian Farrugia, was filed against the Superintendent of Cultural Heritage, the Minister for Culture, and the minister’s permanent secretary.", "comment_count": 0, "id": 2509}, {"keywords": "", "author": "", "article_body": "A \"well established\" Turkish airline has been awarded an Air Operator Certificate, Transport Malta said. \nFreebird Airlines Europe will operate commercial flights within the EU with its first Maltese aircraft, an Airbus A320.\nThe aircraft, with the registration 9H-FHB, carrying a substantial delegation of airline officials, was in Malta for a couple of days and left Thursday morning.\nFreebird Airlines Europe is part of Gözen Holding, a group of companies with firm roots in the aviation industry.\nThe group has airlines and branches catering for representation, surveillance, fuel, controlling, brokerage, security and training.\nIt has been established for the past 38 years and its six companies employ more than 2,000 individuals.\nFreebird Airlines is an international charter airline established in 2000 and serves Europe and nearby regions with a fleet of Airbus A320 aircraft.\n“Malta’s aviation register — the 9H — is continuously gaining momentum. We are seeing a continuous increase in the aircraft being registered in Malta, with the latest development being Freebird Airlines establishing its European arm in Malta,” Transport Minister Ian Borg said.\nFreebird Airlines is expected to extend its operations in Europe and other regions, further expanding its fleet.\nHaci Say, from Freebird said that, “Freebird Airlines Europe, with the professional cooperation and support of Transport Malta would like to extend its operations in Europe and other regions with its growing fleet.”\nMinister Borg said that Transport Malta’s Civil Aviation Directorate had been working to continue establishing Malta as an established aviation cluster.\nFreebird Europe was now among the long list of operators that had chosen Malta as their jurisdiction of choice, he said.\nA few weeks ago, Transport Malta licensed Freebird as an Approved Training Organisation, providing aviation training focusing mostly on rating training for the Airbus A320, the Boeing 737, simulator flight instructor training and Type Rating Instructor training.", "comment_count": 2, "id": 2510}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some 677 counterfeit euro banknotes were reported to the Central Bank last year.\nIn a statement, the Central Bank said it had received 286 notes in the second half of last year and 391 in the first half of 2018.\nThis was actually a 24% decrease when compared to the figures of the previous year.\nWhen compared with the number of genuine euro banknotes in circulation in Malta - slightly above 11.22 million on average for the second half of 2018 - the proportion of euro counterfeits remained insignificant, the CBM said.\nIt was also low (0.11%) as a proportion of the total number of counterfeits seized in the euro area as a whole over the same period, amounting to 262,000 pieces.\nRead:€41,400 in fake bank notes were not meant for circulation. \nOf all the counterfeit euro banknotes seized in Malta during the second half of the year, the €20 and €50 denominations continued to be the most counterfeited ones, accounting for more than three in every four of all counterfeits seized.\nThe Bank reminded the public that the new €100 and €200 banknotes, with enhanced security features, being the last two denominations of the Europa Series, would enter into circulation on May 28.\nBanknote equipment manufacturers and suppliers would continue to receive support from the Eurosystem in adapting their machines and authentication devices.\nAll commercial enterprises handling cash were advised to contact the suppliers and manufacturers to upgrade their equipment and devices without any delay, to ensure that they only accepted genuine banknotes.\nNotwithstanding the low figures of counterfeits reported locally, the Central Bank advised the public to remain alert with regard to the banknotes received in cash transactions.\nAnyone who received a suspect note should contact the police on 2294 2120 or the Central Bank of Malta on 2550 6012/13. Alternatively, one could send an e-mail to the bank at nccmt@centralbankmalta.org.", "comment_count": 0, "id": 2511}, {"keywords": "", "author": "", "article_body": "A group of unknown business owners calling itself ‘Foresite’ has written to MPs and warned that a planned deal with the Corinthia Group would violate EU state aid and public procurement laws, the government said in a statement on Friday. The anonymous letter was addressed to all Members of Parliament and stated that it was penned by a group of business operators.Foresite argued that the St Julian’s peninsula deal would give International Hotel Investments – Corinthia’s parent company - an illegal advantage and would exclude other potentially interested developers from the land development project.Times of Malta has reported that the international hotel chain is set to receive the rights to build a six-star hotel as well as luxury retail and residential units on the peninsula for just €17 million, despite experts valuating the project at around €700m in value. Corinthia is planning to build 100,000 square metres of commercial and residential real estate and offices, including high-rise blocks.\nTimes of Malta had reported earlier this month that the government had reopened talks with the Corinthia Group after it received legal advice that the project, as proposed, would violate EU state aid rules.\nThe government had vehemently denied that was the case.\nIn its statement, the government said that talks concerning the project were still ongoing but that it would “clearly” not enter into any transaction which its advisors believed was “not consistent with Maltese or EU laws”.MPs would also be discussing the project in parliament, it added. News of the Corinthia Group project first broke late last year, when the government discussed it during the last parliamentary sitting of the year, only to subsequently debate it in detail after the Opposition insisted that the plans had to be debated in full. Prime Minister Joseph Muscat has made no secret that he approves of the Corinthia Group’s plans, telling an audience on Sunday that the project would be a “giant leap” for Malta’s tourism sector and was needed if the country was to attract high-paying tourists willing to fork out thousands of euros a night. In its statement on Friday, the government said that IHI would also be spending large amounts of money on the investment, with significantly direct and indirect income for the government, and creating tangible benefits to Malta.", "comment_count": 51, "id": 2512}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The €2.2 million restoration of church façades, belfries and works of art in 15 parishes across Malta has kicked off and should be completed within three years.\n“I would like to pass on Archbishop Charles Scicluna’s appeal to appreciate the efforts of our ancestors who invested in religious heritage. We need to make sure that we pass on this heritage to future generations,” Curia administrative secretary Michael Pace Ross said on Friday.\n“Funds allocated for the restoration and conservation of our cultural heritage are an investment into the protection of Maltese identity.”\nMr Pace Ross was speaking outside the Naxxar parish church, which together with the Attard, Balzan, Dingli, Marsaxlokk, Mġarr, Paola, Rabat and Tarxien will have their façades restored.\nWork will also be carried out on the Bidnija chapel, and two others in Għargħur – the Santa Marija ta’ Bernarda and Santa Marija taż-Żellieqa.\nThe funds will meanwhile be invested in the upgrading of the Curia’s Archives into state-of-the-art premises for the benefit of researches, students and the public.\nThe upgrade of the archives, which date back to the 15th century, will include a professional archiving system, a new shelving system and exhibition equipment.\nThe Visitors’ Lodge in the Mellieħa Sanctuary square will start hosting an ecclesiastical museum and funds will also be dedicated to studies on the structure of the Saint Mary parish church in Birkirkara.\nJust two decades following its restoration, cracks have reappeared on the walls of this old Birkirkara church, which has a long history of structural problems and at one point was left for a whole century without a roof.\nThe geotechnical research would come in handy when determining the required intervention.\nWorks of art hosted at Saint Helena’s Basilica, the Mdina co-cathedral and the Mosta Basilica will also benefit from the funds.\nOf the total, 80% are ERDF 2014-2020 funds, and the rest is being forked out by the Archdiocese of Malta Cultural Heritage Foundation.\nTen tenders have already been awarded and work has just started on eight sites. The rest of the tenders will be awarded by June.\nMr Pace Ross noted that this restoration project was unprecedented and will also see the creation of a heritage trail for the benefit of local and foreign visitors.\nPhoto: Jonathan Borg\nAddressing the same press conference, Parliamentary Secretary for EU Funds Aaron Farrugia noted that as a result of this restoration and conservation project, by 2023 the number of tourists is expected to increase by 200,000.\nMore than €80m in ERDF funds have been invested in the conservation and promotion of cultural heritage, he added.", "comment_count": 11, "id": 2513}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man convicted of trapping during the closed season had his fine reduced by a court of appeal which, however, confirmed his two-year licence suspension.\nLawrence Darmanin had been charged with breaching hunting laws by seeking to trap birds during the closed season, without a licence, trapping a protected species and using prohibited trapping equipment.\nThe incident dated back to April 2015 when two constables on patrol in the ‘Ta’ Bidni’ area in the locality of Żabbar had been alerted by birdsong and had come across hunting nets set up.\nDuring criminal proceedings, the accused had denied the charges, insisting that he had left his caged songbirds outside “for some air” while slaughtering chickens nearby.\nHe claimed that his trapping equipment was set up because it was too laborious to dismantle it between one trapping season and the next.\nIn 2016, a Magistrates’ Court had found him guilty and condemned him to a fine of €1,500, also suspending his hunter’s licence for two years.\nThe accused filed an appeal, claiming that the punishment was excessive but accepting the conviction, although arguing that the judgment was null since there had been no official signed copy as required by law.\nThe court of criminal appeal, presided over by Mr Justice Giovanni Grixti, observed that as a matter of fact the appellant had a net set up, surrounded by caged songbirds during the closed season.\nThere was no reason not to believe that the man had, in fact, been trapping at the time of his arrest, even if he had been in a nearby room carrying out some other task.\nThe court also observed that the appellant had not asked for a revocation of his conviction but for a mitigation of the punishment.\nHaving heard submissions on punishment, the court reduced the fine to €1,000 but confirmed the suspension of his licence. Since the nets were not exhibited, the court said it would not be ordering their confiscation.\nInspector Jurgen Vella prosecuted.", "comment_count": 0, "id": 2514}, {"keywords": "", "author": "", "article_body": "Photo: Malta Police Force\n \n \n \nA man was arrested on Thursday afternoon after he was found in possession of drugs.\nThe police said on Friday, the 26-year-old man from Mtarfa was stopped at the Coast Road in Baħar iċ-Ċagħaq by the Drug Squad.\nIn the car the police found a carton box containing some 40 kilograms of cannabis grass and a bag with six kilograms of cannabis resin. The drugs were ready to be trafficked.\nAn inquiry is being held.\nThe box and bag which contained the drugs. Photo: Malta Police Force", "comment_count": 1, "id": 2515}, {"keywords": "", "author": "", "article_body": "There were three fatal occupational accidents in the second half of 2018, according to the National Office of Statistics.\nThe NSO said that non-fatal occupational accidents at work in the same period increased by 10, or 0.6%, when compared to the same period in 2017.\n\nAdministrative records showed that 1,599 persons were involved in a non-fatal occupational accident during the period, 1,653 more than in the first half of the year. The majority, 282 (17.6%) occurred in the manufacturing sector. Another 233 (14.6%) were in the construction sector. These were followed by 228 (14.3%) in the transport and storage sector.\nWhen compared to the same period in 2017, the number of accidents decreased by 33 in accommodation and food service activities and increased by 20 in the administration and support service activities.\nThe largest share of accidents at work during the reference period involved persons working in elementary occupations followed by craft and related trades workers.\nAlmost half (45.1%) of the injuries at work affected the upper extremities of the body, such as fingers and hands. Wounds and superficial injuries, and dislocations, sprains and strains were the most common types of injuries, amounting to 991 and 388 cases respectively.\nIn the second half of 2018, nearly 34% of the accidents at work took place in enterprises with more than 500 employees.\nIn 2018, 1,400 non-fatal accidents per 100,000 employed persons were reported. The highest standardised incidence rate of non-fatal accidents at work was recorded in manufacturing followed by construction and transportation and storage activities.\nBetween July and December, the Occupational Health and Safety Authority reported three fatal accidents at work. There were no fatalities at work in the corresponding period of 2017.", "comment_count": 0, "id": 2516}, {"keywords": "", "author": "", "article_body": "Plans to build a nine-storey hotel along the Pieta’ seafront have set off alarm bells among heritage activists who are painstakingly restoring a historic villa right next door.\nA planning application to turn Giardino Zammitello into a giant hotel would “all but destroy what remains of Villa Frere and its historic vistas”, heritage architect Edward Said told the almost 2,000 people who form part of a Friends of Villa Frere group on Facebook.\nRead: Beyond the walls of Villa Frère\n“Villa Frere and Giardino Zammitello are YIN AND YANG,” the architect said, warning that the planning application would lead to the “complete destruction of this baroque garden, save a few token relics”.\nThe historic gardens.\nHotel plans are the second attempt to develop the 200-year-old Giardino Zammittello, after plans to create a home for the elderly at the site faltered.\nThe new plans would see much of the house’s garden dug up to make room for a spa, gym and external pool, and introduce underground parking, restaurant and business centre. Applicants say they will retain and restore a tower and much of the elevated walkway in the garden.\nVilla Frere, whose gardens lie alongside those of Giardino Zammitello, is currently being restored by a team of volunteers led by Mr Said and garden expert Fernando Mifsud, after being allowed to fall into ruin.\nObjections can be filed to the Planning Authority from February 6 until March 8.", "comment_count": 46, "id": 2517}, {"keywords": "", "author": "", "article_body": "Developers are calling for an area at sea to be reclaimed by construction waste as there was a lack of land facilities for its disposal.\nThe Malta Developers Association said immediate action was needed to tackle the serious problem of the lack of facilities for the disposal of construction waste.\n\"Very little space is now available. This consists of some two unfilled quarries that have made the operators of these sites enjoy a captive market in which demand heavily exceeds supply,\" the MDA said in a statement on Friday.\nRead: 'Everywhere is full': skip operators warn of building waste crisis\n\"This situation has hit all contractors who cannot find a solution for the problem and face a steep rise in costs for waste disposal. Apart from the fact that this increase in costs will be reflected in an increase in building costs, the situation will soon lead to a serious scarcity of disposal sites.\"\nThe MDA said that applicants for permits to use their property for construction waste disposal had been facing excessive bureaucratic procedures lasting months to arrive at an acceptable solution to issues raised by the authorities.\nRead: The building waste crisis\nIdentifying an area of the sea where land reclamation was acceptable from an environmental point of view with the aim of utilising the available amounts of construction waste for this purpose had also become an urgent matter, it said.\nMDA called on government to redouble its efforts to ease this problem \"in one way or another\".\nIn July last year, 10 quarries were granted environmental permits to accept inert, construction and demolition waste for disposal to ease pressure on developers.\nRead: Reviving construction waste", "comment_count": 60, "id": 2518}]