[{"keywords": "", "author": "Philip Leone Ganado", "article_body": "Fish farm operators are exploring “alternatives” to the current practice of dumping tuna heads, tails and guts into the sea, representatives have confirmed.\nThe tuna by-products, which account for as much as a quarter of the farmed fish, are currently disposed of beyond the 12 nautical mile limit, in line with veterinary regulations.\nRead: All of Malta's tuna farms fined for breaching permit conditions\nAccording to an Environmental Impact Assessment (EIA) on plans for a formal offshore aquaculture zone off the north of Malta, the possibility of ending this practice by incinerating the material had to be discounted as the abattoir incinerator was deemed too small to handle the volume of waste generated by the tuna farms.\nNevertheless, authorities are holding discussions with the Federation of Aquaculture Producers to identify alternative options to re-use the discarded material. This would then form part of the conditions in the tuna farms’ environmental permits.\nWe are trying to transform waste into a resource\nFederation CEO Charlon Gouder on Wednesday told Times of Malta the group had engaged consultants and was considering options including re-use for fish oil, pet food and medicinal products.\n“We are trying to transform our waste into a resource,” Mr Gouder said.\nRead: Sea slime is being collected and sold by fish farm operators\nThe plans for a new aquaculture zone off Sikka l-Bajda, submitted by the Fisheries Department and currently being assessed by the Planning Authority, follow the revocation of the tuna farms’ operating permits amid public outrage over an outbreak of coastal sea slime in 2016.\nAll operators have since relocated to new offshore sites, and the Fisheries Department application would formalise a site currently occupied by Azzopardi Fisheries on a temporary operating permit.\nThe EIA, newly published for public consultation, indicates that the extent of any environmental impacts would be largely dependent on the effectiveness of mitigation measures put in place by operators.\nThe report identified several potential impacts including on water quality, marine ecology, seabird populations, as well as human activities, largely as a result of sea slime in coastal areas.\nThese impacts, it said, “may be of major significance under certain circumstances, but a degree of uncertainty or a range of possible conditions do not allow the impact to be conclusively defined”.\nOn sea slime, the report said the significance would depend on the amount of fish oil released during feeding, the amount of oils that escape the farm and the collection systems deployed to counteract this issue.\nOperators announced last summer that they had introduced booms around their pens to collect the oily residue, having already signed an agreement on a variety of mitigation measures aimed at preventing a recurrence.", "comment_count": 27, "id": 3219}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man who was granted police bail some three months ago after he was found in possession of some “ready to sell” sachets of drugs at a road block was granted bail upon his arraignment on Thursday.\nJean Claude Cassar, a 19-year old currently in search of a job, had failed to abide by the conditions laid down in his police bail imposed on October 2 and did not turn up at the Cospicua police station when summoned for further questioning on November 10.\nThe youth was finally tracked down, arrested and taken to court on Thursday where he pleaded not guilty to having been in possession of cocaine and heroin in circumstances indicating that it was not for his personal use, as well as the simple possession of cannabis.\nHe was further charged with failing to abide by the conditions of his police bail.\nThe prosecution explained that, following the road block in Żabbar back in October, the accused had told investigators that the drugs were for his own personal use. He was subsequently released on police bail.\nDuring Thursday’s arraignment, a request for bail by defence lawyer Franco Debono was not objected to by the prosecution so long as the accused supplied a fixed address and the court imposed stringent conditions.\nIn view of this, duty magistrate Rachel Montebello upheld the request against a deposit of €300, a personal guarantee of €5,000 and an order to sign the bail book three times a week, as well as to abide by a curfew between 8pm and 7am.\nThe court strictly warned the accused of the consequences he would face if he were to breach even one single condition of bail.\nInspector Eman Hayman prosecuted. Lawyer Amadeus Cachia was also defence counsel.", "comment_count": 0, "id": 3220}, {"keywords": "", "author": "", "article_body": "Works are set to start in the area known as tal-Ful in Comino to pave the way as a camping area by summer, the government said.\nThe works, by the Environment Ministry, are being carried out as part of the implementation of the management plan for ‘Comino and the surrounding islands’ prepared by Environment and Resources Authority (ERA).\nThis site will be operated and managed by Ambjent Malta.\nThe area will be cleaned and levelled and containers will be put in place to dispose waste. Indigenous trees will also be planted for the site to accommodate the required functions with the least possible environmental impact.\nThe works are scheduled to be completed by May. Camping in Comino will only be permitted in this area.\nRegeneration and rehabilitation works will also start in the important ecological area near Santa Maria Bay, previously used for camping.\nThe government said that, for many years, irresponsible actions in this area led to serious environmental damage. These works will be coordinated by Ambjent Malta under the supervision of ERA.\nEnvironment Minister Jose Herrera stressed that, as a nation, the Maltese needed to acknowledge the fact that while it was important to enjoy nature through various activities, such activities had to be carried out more responsibly and with the least possible ecological impact.", "comment_count": 14, "id": 3221}, {"keywords": "", "author": "", "article_body": "A water sports operator and his employee has been ordered to pay €34,730 to a man who suffered facial injuries when he was thrown off an inflatable water sausage towed by a speedboat in Għadira Bay.\nThe incident happened in July 2010.\nThe victim, Edward Farrugia Wismayer, had sued the operator, Ronald Agius, and the driver of the speedboat Brian Dingli, holding them responsible for the incident.\nHe successfully argued that the speedboat was driven at excessive speed and conducted erratic manoeuvres which caused the ‘sausage’ to topple, throwing a number of language students into the water..\nMr Farrugia Wismayer, who was a student leader, was injured when he hit the head of a student as they both fell into the sea.\nHe subsequently needed surgeries to his face.\nMr Justice Grazio Mercieca dismissed claims by the accused that Mr Farrugia Wismayer was responsible for the incident by having dragged his feet in the water, causing the sausage to overturn.\nThe court said it believed the version of a passenger on board the speedboat who had observed what had happened.\nThe court also observed that the speedboat driver, Brian Dingli, had not been given proper training and at the time of the incident, the service provider (Costa del Sol Company Limited) had its licence suspended because it had not been renewed. It was renewed some days later.", "comment_count": 0, "id": 3222}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young homeless man who purposely smashed a glass door at a St Paul’s Bay bakery store in a desperate bid for repatriation was given a suspended sentence upon his arraignment on Thursday.\nSerbian national Modrag Petrovic, 20, was charged with willfully damaging the sliding glass door in the incident which took place at about 9pm on Tuesday. The cost of repairing the door was valued at €472.\n“He did this just to be sent back to his country. He was homeless and lived on the street. He wishes to be sent back,” explained prosecuting Inspector Spiridione Zammit, adding that, although at the time of his arrest the man had claimed to have consumed beer, the man was not drunk.\nLawyer Charmaine Cherrett, assisting the accused as legal aid counsel, told the court that her client was “very sorry”, but had found himself in dire circumstances, with no relatives or friends in a Malta who could offer financial help.\nWhen making submissions on punishment, Dr Cherrett pointed out that the accused had fully cooperated with the police, filed an early guilty plea and also admitted why he had acted in that way.\n“He did not waste any of the police’s time. He is in a pitiful situation because his friends betrayed him and he ended up homeless.”\nIn view of the accused’s own admission and after being informed that the man lacked the means to pay for the damage caused, duty magistrate Rachel Montebello gave him a one-year jail term suspended for 18 months, observing that the accused had clearly gone about resolving his problems in the wrong way.\nMoreover, having no means to support oneself was an offence in itself and the damage caused to the shop had been totally uncalled for, the court said, further ordering the accused to pay the €472 in damages within six months.\nSources close to the case said the man is to be repatriated at the earliest opportunity.", "comment_count": 0, "id": 3223}, {"keywords": "", "author": "", "article_body": "Marsaxlokk fishermen are up in arms over the simultaneous closure of three slipways as part of a project to upgrade the facilities, but the government is insisting this was necessary to complete the works by summer.\nThe issue came to the fore recently when fishermen complained that ongoing works were creating disruptions to pull out their boats from the water to carry out repairs, or in case of inclement weather.\nWhile commending the project, fishermen who spoke to Times of Malta said that having three slipways out of action at one go had been a step too far by the authorities.\nMoreover, some questioned whether works were being rushed, as the EU funds allocated for it would be lost if the project would not have started by the end of last year.\nIn its reply state agency Infrastructure Malta, which is responsible for the €700,000 project, noted all works had been planned in consultation with the fishing cooperatives  of the locality and other related stakeholders.\nA spokesman noted that to upgrade all existing 10 slipways by summer, it was not feasible to do them one at a time, but three at one go. This arrangement was backed by the stakeholders, he added.\nThe project will involve the removal of marine growth and encrustations, the reconstruction and reinforcement of concrete structures, the refurbishment of the slipway toes and new timber skids. \nInfrastructure Malta said that half of the slipways needed major repairs and would require an extensive overhaul.\nFurthermore, another three were being rebuilt at a lower level since they were unusable due to their ramps being too high above the water level.\nIt was also pointed out that at the request of the fishing community, one of the reconstructed slipways was being upgraded in order to accommodate larger vessels.\nConsequently, once completed, the project would increase the number of accessible slipways at Marsaxlokk, the spokesman said.\nThe agency noted that this year there were other works in the pipeline to upgrade the quality of the marine infrastructure used by the fisheries, cargo and commercial ferry sectors. These included the new breakwater at Qrejten and the upgrading of pontoons at Il-Magħluq, both in Marsaxlokk.\nIn Mġarr, Gozo, new quays will be built, pontoons upgraded and the port dredged.\nInfrastructure Malta would also be developing new passenger ferry landing stations at Cospicua and Sliema to promote alternative means of mass transport, the spokesman said.", "comment_count": 16, "id": 3224}, {"keywords": "", "author": "AFP", "article_body": "Italy's populist coalition has reached agreement on the fate of 10 migrants the country agreed to take from Malta despite the fury of far-right anti-immigrant Interior Minister Matteo Salvini.\nDisagreement over the migrants, who arrived in Malta on Wednesday after being rescued in the Mediterranean and spending weeks stranded aboard an NGO vessel, has shaken Italy's coalition.\nSalvini, fellow deputy prime minister Luigi Di Maio of the anti-establishment Five Star Movement (M5S) and Prime Minister Giuseppe Conte, held talks late into the night on Wednesday.\n\"There is convergence within the government on a hard line: ports closed, fight against smugglers and NGOs,\" Salvini said on Thursday.\n\n\"And I add that any new arrival must not cost Italian citizens a cent,\" Salvini said, insisting that \"it's the interior ministry that handles immigration.\"\nWhile Salvini has for months repeated that Italian ports are closed to migrants, Di Maio last week said that Italy should take in several women and children rescued before Christmas but stranded at sea after no port would allow them to dock.\nConte, who was named premier by Salvini and Di Maio, agreed with the latter, whose party does not have the same hardline anti-immigrant position as Salvini's League.\nItaly became one of eight EU nations that on Wednesday agreed to take in some migrants from Malta.\nSalvini was infuriated by that decision and a compromise was agreed by which Italy's Waldensian Evangelical Church would take in the 10 migrants.\nThe church has been involved with so-called \"humanitarian corridors\" that help asylum seekers come to Italy, assisting them with housing, Italian language learning and skills training.\nBut Salvini also demanded that other European nations fulfil their promises to take migrants from Italy.\nIn July 2018, Germany, France, Portugal, Spain and Malta agreed each to take in 50 of around 450 migrants disembarked in Sicily by the Italian coastguard vessel Diciotti after being rescued at sea.\n\n\n\nAccording to Salvini, France has taken its 50, but Germany only 23, Spain 21, Portugal 19 and Malta none. Ireland, which said it would take in 20, has received 16 migrants, he said.\nThe Maltese government on Thursday voiced \"disdain and surprise at the inaccurate allegations by Minister Salvini\", pointing out that Italy had promised to take 50 migrants from Malta and that the two countries had agreed the two deals cancel each other out.\nSalvini remained adamant.\n\"We're not going to take any lessons from Malta, which closed its eyes for years so that boats could head for Italy,\" said Salvini.\n\"The music has changed, you can only come to Italy if you have a permit. We've already taken in too many, it's time for others to wake up.\"\n ", "comment_count": 0, "id": 3225}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Actor Davide Tucci intends to file a police report over several fake news stories linking him to a Bitcoin get-rich-quick scheme in social media adverts, posts and articles.Sponsored posts have appeared on Facebook in recent days using the actor’s photos alongside headlines such as: “Davide Tucci Reveals How He Made €2.3 Million After The Bankruptcy”.The adverts link to a website made up to look like a legitimate news service, but clicking any of the links takes users to the same landing page for a Bitcoin trading platform - the same scheme promoted by similar stories falsely attributing the pitch to the Maltese government.Some of the articles also feature the names and photos of One Breakfast show hosts Wayne Sammut and Elaine Degiorgio, with fabricated details and quotes suggesting they were bowled over by the opportunity when it was presented to them on the programme.This is clearly a scam and click-bait, please don’t buy into thisMr Tucci, who currently performs on TVM's L-Għarusa, said in a video posted to Facebook that he had never engaged in Bitcoin trading or given any authorisation for the published material.\"This is clearly a scam and click-bait, please don’t buy into this,\" he said. \"The allegations of bankruptcy particularly are very serious - and I intend to take this seriously by reporting the case to the Malta Police Force’s Cybercrime unit.\n\"I have worked really hard throughout the years to get to where I am now and I won’t let my name and image to be used for any form of scam or dishonesty.\"\nMr Tucci also urged views to screenshot and report the posts to Facebook if they saw them on their feeds.\nOne Breakfast host Ms Degiorgio also said she would be reporting the matter to the police, writing on Facebook that the facts attributed to her were false and that the promoted service was a scam. The latest adverts show scammers varying their tactics after similar stories and adverts started to appear in recent weeks suggesting the Maltese government was behind the pitch. Headlines such as: \"The government swears to boost the income of all citizens\" and photos of Prime Minister Joseph Muscat accompanied the posts, linking to various fake news websites promoting the same Bitcoin scheme. The government said last week it had asked the police to investigate. \"The government takes these articles, which have fraudulent intentions and portray Malta in a negative light, very seriously,\" it said in a statement.", "comment_count": 15, "id": 3226}, {"keywords": "", "author": "", "article_body": "Nationalist Party leader Adrian Delia called for a society which better cares for the elderly when he addressed the members of the PN's section for the elderly.\nHe said that the contribution and wisdom of the elderly needed to be better recognised and society needed to ensure their dignity.  \nThe elderly were a treasure trove of experiences which needed to be passed on to the young.\nThe government, he said, should not look on pensioners as a burden. Pensions were a right which the elderly had worked for. \nIt was therefore a disgrace that after having worked all their life, some elderly people were struggling to pay their rent or could not afford their medicines. They had to choose between leaving something for their relatives or buying their medicines.  \nLong-term planning was needed to ensure that the elderly had decent, sustainable pensions, Dr Delia said.  ", "comment_count": 5, "id": 3227}, {"keywords": "", "author": "Edwina Brincat, Herman Grech", "article_body": "Tourism Minister Konrad Mizzi on Thursday faced a cross-examination in a number of libel cases revolving around allegations stemming from the Panama Papers scandal, among others.\nHighlights from Thursday's case:\n\nKonrad Mizzi insists he had no involvement whatsoever with secret companies Macbridge and 17 Black;\nLawyer Peter Fenech grills the minister on the way Nexia BT could have implicated him with a company and sent an email without his authorisation;\nDr Mizzi says he acquired Hearneville in 2015 and not 2013, insists it was opened as a 'family investment';\nMinister's lawyer says documents presented in court are not permissible in terms of procedural law.\n\nThis is the sequence of events in the one-hour hearing:\n12.55pm: The cross examination is suspended and the case is adjourned to March 7 for Nexia BT's Carl Cini to testify about the documents. The minister has been excused for that hearing in agreement between all parties.\nDr Mifsud Bonnici says cross examination was not being conducted with respect to the other libel cases since the other defendants were not present.\n12.52pm: The source of the Panama Papers documents is dubious, and is not permissible in terms of procedural law, Dr Mifsud Bonnici says, as the minister confirms his signature is present on the documents presented.\nMagistrate says Nexia BT's Carl Cini should be summoned to confirm the authenticity of the documents he had drawn up.\n12.45pm: Dr Mizzi's lawyer says the Panama Papers do not represent Malta's laws, as he objects to documents presented in court. \nPeter Fenech hits back: \"All the world discusses the Panama Papers, except Malta.\"Lawyers Aron Mifsud Bonnici and Peter Fenech.\n12.40pm: Konrad Mizzi says he \"acquired\" the company Hearneville in June/July 2015 - it was nowhere close to the five days after 2013 elections as alleged.\nDr Fenech reminds Dr Mizzi that according to the code of ethics, ministers are barred from doing private work. Minister says he does not.\nSo why did he open the company?\nIt was opened as a family investment, for Rotura Trust, the minister replies. \nSo why not open it in Malta?\nIt was Nexia BT which advised him to open a New Zealand trust.\n12.38pm: The minister insists that he has no other companies or trusts abroad. Dr Mizzi says he has an \"international\" family and had followed his advisers advice to set it up in New Zealand.\n12.36pm: Dr Mifsud Bonnici reminds the court room not to repeat \"speculation\", after a court on Tuesday turned down a request by Simon Busuttil to have a magisterial inquiry opened into the key protagonists of the Panama Papers revelations.\n12.34pm: Asked who owns secret companies 17 Black and Macbridge, the minister continues with his line: \"I don’t know. I have no relation with whoever they belong to.\"\nMinister's lawyer butts in and describes the questions as a fishing expedition, \"with large trawlers\".\nBut Dr Fenech hits back and says the companies were opened just five days after the 2013 general election. \n\"Were it not for the Panama Papers, we'd know nothing,\" Dr Fenech charges.Were it not for the Panama Papers, we'd know nothing- Lawyer Peter Fenech\n12.29pm: Lawyer Peter Fenech asks the minister how a professional person could have implicated him with a company and sent an email without his authorisation.\nThe minister replies: \"The email was confusing. It refers to different things. Nexia reassured me that I had no involvement direct or indirect with those companies. I reaffirm that I got to know of the email in the media. No one had spoken to me about it.\"\nDr Mizzi insists he was never going to receive the figure of money mentioned therein.\n\"It's useless to ask me about an email I did not write myself. I was reassured that I had no relations with those companies.\"\n\n\n\nSimon Busuttil hits back and says Konrad Mizzi has not turned up to court in the past. Dr Fenech rebuts the accusation and says that Dr Busuttil was present for another libel case against him.\n12.02pm: Konrad Mizzi's lawyer Aron Mifsud Bonnici is lamenting about the last sitting when Dr Fenech had complained about the minister’s request for adjournment. Such comments had been made without his client being present.\nComments made about the minister for failing to turn up for his case are untrue and not correct, the lawyer explains.\n11.55am: MPs and lawyers Simon Busuttil, Beppe Fenech Adami, Jason Azzopardi are among those in the court room.\nRead: Libel cases put off as Konrad Mizzi asks for postponment of his testimony\nLast November, Dr Mizzi had been accused by lawyer Peter Fenech of taking the court for a ride and of trying to avoid cross examination. In light of these arguments, the magistrate had told the defendants to summon the minister for Thursday's hearing.\nTwo of these cases had been instituted against slain journalist Daphne Caruana Galizia. The other libel suits stem from comments made at a press conference regarding the privatisation of the Delimara power station. ", "comment_count": 0, "id": 3228}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Nearly nine out of every 10 teachers told their union they have experienced aggression at their school over the past two years.\nAt least a fifth, or 23 per cent, claimed they experienced aggressive behaviour daily, while another 23 per cent said they did so every week.\nThree quarters of those who experienced such behaviour said the perpetrators were students, according to a survey by the Malta Union of Teachers.\nThe survey was held among 183 anonymous respondents in December, after the MUT noticed escalating aggression.\nIt was not meant to be a scientific survey, but rather one that provided MUT with a snapshot of the situation, the union's president Marco Bonnici said.\nSome of the shocking testimony that emerged from the survey.\nNearly a third mentioned parents, 12 per cent colleagues and nine per cent said the perpetrators were superiors.\nHowever, only around 60 per cent said they reported the aggression.\nMr Bonnici noted that under reporting could be the result of fear or belief that no action would be taken.\nThe union insisted it had a zero tolerance to aggressive behaviour in schools, and it wanted to pre-empt incidents - which seemed to make headlines year in year out - rather than react afterwards, Mr Bonnici said.\nHe described teachers' comments that were collected through the survey as \"shocking\".\nAccording to the survey, the aggression took place on school grounds, outside school premises and also online.\nMr Bonnici said most of the aggression was physical, but he noted that the kind of discourse used by some students was very worrying and unacceptable.\nTrying to keep such incidents under wraps was common practice, he added.\nAsked to clarify, he said this culture was particular to some schools or colleges, whether state, independent or church.\nHe warned that the MUT will not hesitate to issue directives to protect its members and the union was also launching two services.\nThese include an SMS emergency line and the provision of psycho-social support to those who seek the union's help.\nThe union appealed for security at schools.\n\"A school had hired a security guard at the entrance to filter people. We want this to be extended to other schools,\" he said.", "comment_count": 15, "id": 3229}, {"keywords": "", "author": "", "article_body": "Updated at 4.20pm with PM's address\nAlthough the stand-off relating to migrants on two NGO vessels was resolved on Wednesday, President Marie-Louise Coleiro Preca lamented on Thursday that it had dragged on for as long as it had.\nThe President acknowledged Malta’s intervention, and thanked the European Commission for its endeavours to bring together the eight member states which have agreed to help in the reallocation of the 49 people, but added: “How can we, as European nations of goodwill, have allowed the mental, physical, and emotional distress of innocent individuals, to take place, over such a long period of time?”\nShe was speaking during the traditional exchange of New Year greetings with heads of the diplomatic missions accredited to Malta – the last of her term.\nThe President emphasised that human dignity, especially of the most vulnerable, should be the cornerstone of all endeavours, and said that the phenomenon of migration should be faced by sharing responsibilities among European member states, in a dignified manner which also respects fundamental human rights, and not in an “ad hoc” manner.\nShe also referred to the upcoming European Parliamentary Elections, describing them as an opportunity for Europeans to show what kind of institutions they aspired to have.\n“Social Europe is becoming more of an economic Europe. Data tells us that 1 in 4 Europeans is living in poverty, and is thereby excluded from the social identity that used to make Europe so proud,” she said.\nIgnoring migration will be detrimental to future of Europe as a union - Muscat\nPhoto: Jeremy Wonnacott, DOI\nMalta embraced a sensible migration management policy that was humane but which still gave peace of mind to the security concerns of people in the host country, Prime Minister Joseph Muscat said in his address to the heads of diplomatic missions.\nDr Muscat said the issue of migration continued to dominate and there was a lack of understanding by a number of European countries of what was happening at the southernmost part of Europe.\nThe solution for the 49 migrants who had been at sea on NGO vessels for a number of days was by no means final and immigration would remain an issue for Europe in the weeks, months, and years to come.\n“Ignoring it will be to the detriment of the future of the EU as a union,” he said.Dr Muscat said Malta supported the Global Compact on Migration because it believed a global dimension which went beyond the EU border was needed as this could assist in managing migration in a safe way. \nUnfortunately, the Compact became the first high profile international agreement to fall victim to fake news and misinformation.\n“Many asked why Malta was endorsing it. I asked them one simple question: Have you read this simple document? None of them had. How can a non-binding statement of intent end up at the centre of controversy? But it did. And how can anyone oppose the concept that migration is not a phenomenon that can be tackled nationally, but one that needs an international solution? Some did. But I do not believe this is a world of extremes where you either open your doors to everyone and get flooded, or you build a brick wall not to let anyone in.”\nDr Muscat said there could be a sensible migration management policy which was humane, but still gave peace of mind to the security concerns of people in the host country. This was what Malta embraced. \nThis was why, he said, Malta was reaching out to Africa in terms of solidarity and in terms of trade. It would soon open a High Commission in Ghana, one of the largest economies within the Economic Community of West African States (Ecowas), as well as a Commonwealth member. \nThe High Commission in Accra would provide Malta with a platform to engage more directly with Ghana, as well as the whole of Ecowas. Malta had also nominated a non-resident ambassador to Ethiopia and the African Union, who would focus on the Horn of Africa in the east through Addis Ababa, the seat of the African Union. It also aimed to engage with African partners throughout the continent.", "comment_count": 11, "id": 3230}, {"keywords": "", "author": "", "article_body": "Updated 1.49pm with PL statement \nNationalist MP Jason Azzopardi has lost a libel case he had instituted against Justice Minister Owen Bonnici in the wake of controversy over the valuation of a property in Qormi - the former Löwenbräu brewery - which the former Nationalist government had transferred to entrepreneur Nazzareno Vassallo.\nDr Azzopardi had instituted proceedings in January last year after Dr Bonnici said he had information that Mr Vassallo had met Dr Azzopardi (when he was parliamentary secretary responsible for government property) and he had assured him that 'a compromise' would be reached on the value of the land.\nThe land was subsequently transferred at 1990 prices, thus being under-declared by some €7 million.\nDr Azzopardi had denied the claim.\nDr Bonnici argued that he had made a fair comment on an issue of public interest, adding that his comment was based on sworn testimony.\nMagistrate Francesco Depasquale found that the assertion by Dr Bonnici was substantially correct in that it was based on testimony in another court by Mr Vassallo. Mr Vassallo was not summoned to testify in the libel proceedings so as to confirm or contradict his sworn statement.\nTonio Fenech, the former finance minister under whose portfolio was the Lands Department headed by then Parliamentary Secretary Dr Azzopardi, had also been reported to have said “If Zaren Vassallo had come to speak to me I would have sent him to Jason. If his file had been brought to me, I would have sent it to Jason. But none of those things happened.”\nYet, Mr Fenech was never summoned to testify in the libel suit, the court observed.\nFurthermore, Dr Bonnici had also based his comments on a report by the Auditor-General. This could be considered as a political comment and could not be considered as defamatory.\nLabour: Azzopardi must shoulder political responsibility\nIn a reaction to the court's decision, the Labour Party said Dr Azzopardi must shoulder political responsibility for the Löwenbräu land scandal. \nThe PL said its statements and those by Dr Bonnici had been proven right by the court because they were based on documents and the testimony of Nazzareno Vassallo, who had benefited from the deal. \nDr Azzopardi should, therefore, assume political responsibility. ", "comment_count": 0, "id": 3231}, {"keywords": "", "author": "", "article_body": "Infrastructure Malta is launching the second phase of the €4 million Triq Bormla project, including a new segregated cycling track and footpath along the vehicular carriageway reconstructed last year as part of the same investment.\nThe road will be reopened in both directions before summer. Triq Bormla, which was recently renamed Triq l-Aħħar Ħbit mit-Torok, is the main route between Żabbar and Żejtun. The one-kilometre link is also known as “tac-Cawsli”, the Maltese name for the old mulberry trees that line its central strip.\n\n\n\nThe road had been left in a state of disrepair for many years. Due to its weak foundations, parts of its surface had caved in, causing flooding and other difficulties to road users.\nAs part of the reconstruction project launched last year, the road is being rebuilt in a new design, including a two-lane carriageway for vehicles on one side, with segregated cycling and walking facilities on the other and a landscaped area comprising the existing mulberry trees, in between. The new layout also includes new bus lay-bys for safer public transport commutes.\nStretches of the road lie over deep disused quarries that had been refilled with construction debris and other weak materials that were not adequate for the road’s load requirements. During the first phase, these materials were excavated and replaced with retaining structures comprising 1,790 blocks of limestone and over 3,000 tonnes of concrete.\nWhile building the foundations, Infrastructure Malta also installed 3.3 kilometres of new underground water, electricity and telecommunications distribution networks and sewage pipelines. A new 2.5 kilometre storm water system linked to an existing reservoir was also introduced to reduce the risk of flooding. A new boundary rubble wall was also built along the side of the road, to separate it from the adjacent fields.\nThe row of mulberry trees will be retained in its original location, as part of a landscaped area separating the vehicle carriageway from the cycling and pedestrian strip. Infrastructure Malta is planting 21 new mulberry trees, instead of 13 existing ones that had died due to a tree borer infestation several years ago.\nIt is also working with the environmental authorities and with a local non-governmental organisation, Wirt iz-Żejtun, to support the necessary interventions required to protect the mulberry trees that have not yet been affected by this infestation.\nThe project is co-financed by the European Union, as part of a European Regional Development Fund project.", "comment_count": 19, "id": 3232}, {"keywords": "", "author": "", "article_body": "A German woman is in hospital after being assaulted when two men tried to steal her bag late on Wednesday.\nThe police said the incident happened just before midnight in Testaferrata Street, Gzira.\nThe woman was hit with a glass bottle when she resisted the muggers, who then ran off.\nThe woman was hospitalised.\nThe police said her medical condition is serious.\nPolice are investigating. ", "comment_count": 25, "id": 3233}, {"keywords": "", "author": "", "article_body": "The Maltese government has urged Italian Interior Minister Matteo Salvini to check his facts before accusing Malta of failing to fulfil voluntary migrant reallocation pledges.\nIn a statement, the government expressed \"disdain and surprise\" at what it described as inaccurate allegations by Mr Salvini, who is renowned for his anti-migrant agenda.\nThe Italian right-wing leader in a tweet accused Malta of failing to relocate migrants it had pledged to take from his country, as opposed to Germany, France, Spain, Portugal and Ireland.\n\n\n\nBut the Maltese government recalled that Italy had pledged to take 50 migrants from Malta after the NGO vessel Lifeline docked in Malta at the end of another bitter political dispute.\nWhen another case occurred in July and Italy requested support for a voluntary intra-EU reallocation of migrants, Malta was the first nation to respond by pledging to take migrants from Italy, the same number Rome had earlier pledged to take from Malta in the Lifeline case.\nAfter several requests from Malta, when the Italian and Maltese experts eventually got together to decide the modalities to fulfil these pledges it was agreed that since both countries had agreed to take the same amount from each other and since these migrants had already suffered a difficult crossing and rescue, that rather than have them undergo another voyage to another state, each country would retain 50 and thus fulfil its pledges by cancelling each other’s pledge, the government said.\nTherefore, Malta retained the 50 migrants who arrived on board the Lifeline that should have been transferred to Italy and Rome retained 50 from the Pozzallo case that should have been transferred to Malta. \nIt pointed out that the European Commission, which was coordinating the modalities of these voluntary reallocation initiatives, considered both Malta and Italy to have fulfilled their pledges to each other.\nThe government therefore urged the Italian government to \"revise its statistics and refrain from repeating unfounded claims\".", "comment_count": 0, "id": 3234}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Local committees and members of the Nationalist Party’s general council are being pressured by senior party officials close to the leadership to publicly declare, in writing, their loyalty to embattled leader Adrian Delia.\nThe PN leader is facing increasing internal calls to step down in view of continuous allegations concerning his personal life which have now spread into his political role. \nPN local committees, known as sectional committees, have been asked by the party headquarters to hold urgent meetings in which a motion of confidence in Dr Delia is approved and signed by all committee members.\nAudio of a PN meeting in Rabat.\nThe meetings are being physically monitored by persons close to Dr Delia, including loyal election candidates, who are attending these meetings to assure that all those present abide by the directive.\nAt the same time, party officials and members of staff at the PN headquarters are contacting all the members of the general council, asking them specifically whether they still agree that Dr Delia should continue leading the party.\n“It seems that Dr Delia’s restricted group at the PN headquarters are resisting all calls for him to step down and are trying to convince Adrian [Delia] that he still garners the respect of most of the PN councillors,” one councillor said.\n“They called and said they are doing a survey to sound out members whether Dr Delia should resign. Can you imagine what future I would have as a councillor if I tell them that he should go?” he said.\nWatch: ‘I will not resign” – Delia rejects claims he’s pulling PN down\nCan you imagine what future I would have as a councillor if I tell them that he should go?\nAnother councillor described the current situation at the PN as “chaotic”, saying he has never seen the party in such a bad state.\n“If Dr Delia’s clique wants to know what councillors think all they should do is call an urgent meeting of the general council and hold a secret ballot. It has become crystal clear in the past days that, even if all the allegations regarding Delia are false, he does not stand a chance of ever winning the PN an election.\n“That’s the only concern for me,” a veteran councillor said.\nTimes of Malta has received evidence of local committee meetings rushing a motion of confidence in favour of Dr Delia during the past few days.\nDuring a meeting of one committee, in Rabat, one of the members said that even those who were not present should have their name put on the “loyalty motion” as “all party clubs are doing this”.\nAsked on Wednesday to state whether PN officials are exerting any pressure on committees to approve loyalty motions and calling councillors requesting their judgement on Dr Delia’s future, a spokesman for the PN did not reply by the time of writing.A message sent to the Sliema PN committee.\nMeanwhile, Dr Delia’s advisors called for a public show of force by organising a ‘reception’ for activists to be addressed by the leader at the PN headquarters on Thursday.\nParty sources said Dr Delia has already been told very clearly by senior officials to step down so that the PN can start picking up the pieces and try to get back to function.\nRead: Resignation by Adrian Delia? Then what?\nOn Tuesday, administrative council president David Stellini and executive council president Mark Anthony Sammut held a long discussion with Dr Delia on the party's situation.\nSo far, neither the administrative nor the executive council have been convened to discuss the recent developments.\nMeanwhile, the PN’s parliamentary group has also not been convened by Dr Delia amid increasing unconfirmed reports that the majority of MPs have lost trust in his leadership.\nAccording to the PN statute, 150 councillors can call an urgent meeting of the general council in which a no-confidence motion in the leader can be discussed and voted upon.\nRead:PN executive ‘will discuss Delia’", "comment_count": 167, "id": 3235}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta’s two estate agency lobby groups have taken digs at one another as infighting in the industry reaches boiling point. \nMembers of one of the two groups, the Estate Agents Section (EAS) within the Malta Developers’ Association, have claimed that the other group, the Federation of Estate Agents, is a one-man show which did not represent operators in the sector. \nDouglas Salt, a former member of the federation who today forms part of the new MDA branch, told the Times of Malta that the federation was making “sweeping statements” without consensus of industry players and without the backing of sound research. \nThe EAS was set up in February last year, with a vast majority of the FEA’s members having quit that organisation to create a new one under the auspices of the MDA.\n“The federation isn’t a federation at all. It is today made up of just one member, Simon Debono of Simon Estates, who calls himself the general secretary,” Mr Salt said.\n“That position does not even exist in the statute – I should know, I was there when the statute was written.”\nThe federation isn’t a federation at all\nContacted on Wednesday, Mr Debono said the claims against him were part of a smear campaign meant to undermine his credibility.  \n“Look, the truth is we are at war against government policies which are forcing a substantial part of the Maltese population into poverty,” he said.\n“This is a political struggle, and those who are opposed to our position are now using political methods to attack us.”\nMr Debono would not say who else was in the federation’s top brass, telling the Times of Malta that it would have to become a real estate agency and fully-fledged member to be entitled to that information.\nNor would Mr Debono divulge how many members the federation had, saying only that there were “several” and that seven new members had signed up since the end of the holiday season.\n“If the Times of Malta wants to be used to undermine an organisation which is fighting the collapse of the housing market, then go ahead, but we will not stop doing what we believe is right,” Mr Debono said.   \nThe veteran agent has hit the headlines in recent years as he repeatedly raised the alarm over spiralling housing costs.\nTwo months ago he made a splash with claims that he personally knew of some 2,000 people living in garages who “wear jackets and ties and go to work every day”.\nThe section of the Malta Developers Association immediately issued a statement strongly condemning Mr Debono for having touted the figure during a conference on rental affordability.\nHitting back, Mr Debono himself raised doubts over a study commissioned by the MDA which had indicated that the island was not facing a risk of a housing bubble. \n“Mark my words, this is a bubble, it is not sustainable and we will regret it,” Mr Debono said.", "comment_count": 44, "id": 3236}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday:\nTimes of Malta and most of the other newspapers lead with the agreement announced on Wednesday which finally allowed 49 stranded migrants to set foot on Malta.\nIn a secondary story, Times of Malta reports that members of the Nationalist Party’s general council are being pressured by senior party officials to publicly declare their loyalty to embattled leader Adrian Delia.\nIn-Nazzjon in its secondary story quotes PN leader Adrian Delia saying minister Konrad Mizzi is continuing to throw away Malta's assets. Dr Delia said the PN would vote against the deal giving the Corinthia more rights over land in Pembroke. \nl-orizzont also reports on the end of the migrants saga, saying the EU had recognised Malta's efforts. \nThe Malta Independent says signatures are being collected among PN MPs asking Adrian Delia to step aside. ", "comment_count": 0, "id": 3237}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A controversial permit allowing Transport Minister Ian Borg to transform agricultural land in a rural hamlet into a swimming pool and outside dining area near to his home has been put on hold pending an appeal.\nThe Environment and Planning Review Tribunal, which decides planning application appeals, decided there were enough grounds to suspend the permit granted to the minister, whose portfolio includes planning. The appeal was filed by Noel Ciantar.\nIn its ruling, the tribunal said it will not be easy to reverse the site to its original state” if the development was allowed to take place prior to a final decision on the appeal. Thus, it ordered that no development should take place pending a final decision, which, by law, must be made within three months.\nNeither Dr Borg nor his wife objected.\nThe minister had applied for the extension on agricultural land on the back of another controversial permit issued in 2014, authorising him to develop his home in an ODZ area in the hamlet of Santa Katerina, in the limits of Rabat.\nThe 2014 permit to turn a dilapidated rural dwelling into a 400-square-metre matrimonial house was also shrouded in controversy after the Ombudsman had found that the approval of the permit was a grave error” and that it should have never been issued.\nBasing its decision on the original permit, the PA accepted Dr Borg’s second application to transform a field he had bought for €11,000 into an extension to his house.\nMr Ciantar argued in his appeal that since the Ombudsman had found that the first permit granted to Dr Borg was ‘abusive’, the PA should not have used it as a pretext to issue the second permit.\nOn the other hand, Dr Borg and his wife insist that planning policies qualify his dwelling for an extension and the development of a swimming pool.", "comment_count": 49, "id": 3238}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Nationalist Party said on Tuesday it would vote against a deal allowing the Corinthia Group to develop public land in St George’s Bay, originally meant for tourism purposes only, into residential and commercial real estate.\nOpposition whip Robert Cutajar on Tuesday also informed the House Business Committee, which agreed on the parliamentary agenda for the next two months, that the PN would insist on a fully-fledged debate over the controversial contract. Parliament resumes on Monday after the Christmas holidays.\nThe government had sought to rush through the deal, with deputy Prime Minister Chris Fearne tabling a motion before the National Audit Office Accounts Committee a day before the House rose for the Christmas recess in which he sought a final vote of approval to be taken during the same session. However, Nationalist MPs Mario de Marco and Beppe Fenech Adami, who sit on the House Committee, asked for more time to delve into the details.\nCorinthia Group chairman Alfred Pisani subsequently made a presentation about the project to the PN parliamentary group but, according to party sources, he failed to convince the Nationalist MPs.\nMany of the MPs, including the party leader, clearly stated that the price the Corinthia Group will be paying for the public land was far too low. We cannot agree that public land is sold for peanuts and used for pure speculation. This is daylight robbery,” the sources added.\nThis is daylight robbery\nFollowing Mr Cutajar’s declaration, Mr Fearne, who chairs the Committee, said a session would be held at a future date to continue the debate and take a formal vote.\nAccording to parliamentary procedures, the Opposition’s vote against the deal will force the government to hold a debate in plenary followed by a final vote involving all MPs present. Approval or otherwise at this stage will be by simple majority.\nLeaked details of the still unpublished draft contract negotiated by Tourism Minister Konrad Mizzi and the Corinthia Group indicate that, while renouncing to agreements concluded in the 1990s granting the hotel chain a 99-year temporary emphyteusis to use a large area on the island’s ‘golden mile’ specifically for tourism purposes (hotels), the government accepted to lift a condition banning speculation of the public land in question.\nThe proposed deal, the Times of Malta learnt, would allow Corinthia to develop land the size of 14 football grounds into apartments, residences and commercial space, including offices, and sell them at commercial prices, running into millions of euros. The group, industry sources said, would be paying €17 million on very generous payment terms, with instalments possibly staggered over decades.\nThe deal also proposes that, for the first three years from the signing of the deed, Corinthia would pay the government €4 million, equivalent to what a couple of apartments in the same area would cost at present.\nDr Mizzi has conceded that the deal was based on the same lines as the one he had negotiated with the db Group with regard to an adjacent site where the Institute of Tourism Studies once stood. That deal is being investigated by the National Audit Office.\nEstate agents told Times of Malta that the planned concession to the Corinthia Group for a premium of €17 million would have a market price tag exceeding €700 million.\n ", "comment_count": 16, "id": 3239}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Cyclists are calling for safer commute in the Luqa and airport area, particularly the Kirkop tunnels and Vjal l-Avjazzjoni.\nUnlike other tunnels in Malta, the one at Kirkop is considered to be a vital link by cyclists due to a lack of alternative routes. Sharing the road with cars in tunnels is illegal in Malta, forcing cyclists to use the pavement while giving way to pedestrians.\nDoing so in the Kirkop tunnel was especially nerve-wracking for cyclists because the footpath consisted of slabs that cave in at different parts from time to time. While repairs have been carried out over the years, the safety hazard remains, a spokesman for the Bicycle Advocacy Group told the Times of Malta.\nRoads in the tunnels were resurfaced last year, however, pedestrians and cyclists seemed to have been forgotten, he said, adding that, for cyclists, commuting through the Kirkop tunnels was like pedalling on a ladder.\nThe Kirkop tunnel as the Bicycle Advocacy Group would like it.\nThe BAG believes there is space for safe cycling infrastructure by removing one of the two pavements running through each tunnel, shifting traffic lanes and building a wide separate path on the left with a pedestrian and cycling lane.\nCyclists who frequent the area and commute all the way to Ħal Farruġ welcomed the news that the widening of Triq Ħal Qormi, in Luqa will include a 1.2-kilometre-long segregated two-way cycling path. However, the spokesman pointed out, part of the northern end of the path would be linked to the service road, meaning cyclists going in both directions would have to share the narrow road with drivers, making it quite unsafe for the former. The only other option for cyclists was to brave the main dual-carriageway, he remarked.\nAlso, further up and closer to the airport, the shared pedestrian and cycle path in Vjal l-Avjazzjoni was removed last summer to make way for a third car lane, leaving space for a narrow sidewalk and a very narrow on-street, one-way cycle lane, the spokesman recalled.\nBAG believes it would be better for the third car lane to revert back to a pavement, with room for a two-way cycle path continuing into the new slip-lane at the airport roundabout and along the other new third lane just outside the McDonald’s outlet. Slip-lanes are a grave unnecessary hazard for people on two wheels, according to BAG.\nThis cycle path could be integrated with the proposed Triq Ħal Qormi project, providing a safe cycle link to the new ITS faculty that was frequented by many students and workers and a link to Skyparks and the airport, the spokesman said.", "comment_count": 9, "id": 3240}, {"keywords": "", "author": "Jacob Borg", "article_body": "Tourism Minister Konrad Mizzi said on Tuesday that the police had not contacted him in the course of their investigations into the Dubai company 17 Black.\nReplying to questions by the Times of Malta, Dr Mizzi said he had given evidence in past inquiries and what he said would always be consistent with the truth.\nA court on Tuesday upheld an appeal by top government officials, including Prime Minister Joseph Muscat, his chief of staff, Keith Schembri, and Dr Mizzi, to block a wide-ranging magisterial inquiry into their involvement in the Panama Papers scandal (see page 6). The inquiry had been requested by then Opposition leader Simon Busuttil in June 2017.\nDr Mizzi spoke to the Times of Malta before the court decision was announced.\nHe said past claims about him having received kickbacks  from Azerbaijan through Pilatus Bank had been disproved by the Egrant inquiry.\n17 Black was identified in a leaked e-mail as one of two potential sources of income for the Panama companies Hearnville and Tillgate, which were set up by Nexia BT for Dr Mizzi and Mr Schembri. A joint investigation by Times of Malta and Reuters revealed that 17 Black was owned by power station investor Yorgen Fenech.\nA report by the Financial Intelligence Analysis Unit delving into Dr Mizzi’s energy dealings and identifying Mr Fenech as 17 Black’s owner was handed over to the police for criminal investigation last March, Times of Malta learnt.\nPushed to say why he maintained that he had no link” with 17 Black, despite the e-mail from his own financial advisers showing he planned to have a $1 million link, Dr Mizzi insisted there were no such plans. The authenticity of the e-mail, found in the Panama Papers leak, has, so far, not been contested.\n‹›-+Page:  /  \nMr Schembri had confirmed he had draft business plans” with 17 Black hours after the e-mail was first published in April 2018 by the Times of Malta as part of the Daphne Project. Still, he said he did not know who owned 17 Black and Dr Muscat refused to say whether he demanded more details about the draft plans” from his right-hand man.\nDr Mizzi said the explanation about the e-mail would be very clear” once the inquiry was concluded.\nNo specific inquiry into Dr Mizzi and 17 Black is under way, as the only magisterial involvement in the case came about after the police requested assistance to send rogatory letters to Dubai and Latvia requesting information about the company’s ownership.", "comment_count": 49, "id": 3241}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The owner of a Land Rover Freelander who had been charged with setting his car on fire to benefit from an insurance claim was acquitted on Wednesday after a court ruled that the prosecution’s case had rested entirely upon the “assumptions and speculations” of a court-appointed expert.\nAldo Bajada, 40, had turned up one morning in September 2012 at the Naxxar police station to report that his vehicle had been damaged in a fire.\nA magisterial inquiry had kicked off into the suspected arson, with a number of experts called in to determine the dynamics and cause of the fire.\nAmong these was one expert who made several “assumptions and speculations” borne out of a discussion which he had conducted with the owner of the vehicle during the on-site inspection.\nOn the basis of these conclusions, the police had pressed charges against the owner for reporting a crime which had not taken place, setting his car on fire to claim insurance money and also for being a relapser.\nIn the course of proceedings, the dynamics of the alleged arson, as determined by the expert, appeared to indicate that the perpetrator had opened the driver’s door, scattered flammable liquid onto the car seats and set it alight with a burning paper.\nThe fire spread quickly but the blaze had been extinguished within minutes once the oxygen inside the closed vehicle burnt out, the expert had reported, concluding that the perpetrator must have been no expert since, otherwise, he would have left the door open to stoke the fire.\nThis same expert said that it must have been the accused who had started the fire since his licence was to expire within one month. Moreover, he had cleared out his car a few days before and besides the car had a central locking system which meant that one open door, in this case that on the passenger side, would have unlocked all other doors.\nThe court, presided over by magistrate Donatella Frendo Dimech, pointed out various shortcomings by the prosecution in proving its case.\nThere was no evidence that the central lock system had been functioning before the fire or whether it had been damaged in the blaze.\nA chemical expert had concluded that there were “no traces of fuel” or other flammable liquid, explaining that the orange liquid lifted from the scene of the fire was a substance resulting from the burning of plastics or fabrics.\nOn the basis of all the evidence put forward, the court could find anything linking the accused to the alleged arson, adding that the cause of the fire had not been proven in any way.\nAs for the alleged insurance fraud, the prosecution had not brought evidence of any claim lodged by the accused in the four-year interval between the suspected arson and his arraignment.\nIn view of the fact that the prosecution had not proven its case beyond reasonable doubt, the court cleared the man of all charges.\nLawyer Joe Giglio was defence counsel.", "comment_count": 0, "id": 3242}, {"keywords": "", "author": "", "article_body": "Updated at 6pm\nA man died and another two were hospitalised with slight injuries on Wednesday after an ordeal at sea just outside Exiles in Sliema.\nThe police said one of the three men, a 26-year-old Ukranian residing in St Julian's, was dragged out by a wave at around 4.15pm.\nHis friends, also Ukranians living in Malta, jumped in to assist him but were unable to rescue him. The police were called, who in turn alerted the Armed Forces.\nAn ambulance was also called and took the two men to hospital while the army searched for their friend, who was found soon after but died after a few moments.\nAn inquiry is being held. The police are investigating.\n \n ", "comment_count": 0, "id": 3243}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Ombudsman’s office has criticised the hiring of a private jet for a Planning Authority board member to attend a hearing on the db Group’s controversial 37-storey St George’s Bay tower.Environment commissioner Alan Saliba said the extraordinary intervention “can be interpreted as if there were an unwarranted influence on the said member of the board”.The investigation came after a complaint by former Alternattiva Demokratika chairman Arnold Cassola, who asked the Ombudsman to examine whether the decision was a case of maladministration and whether it was discriminatory towards applications and objectors in other cases when no such measures were taken.“Neither the Authority or even more the Executive should intervene so that Members of the PA Board are present for meetings,” the environment commissioner said.“This is in conformity with the basic principle that each member of the Planning Authority Board should be left in liberty to attend the meeting and to listen to the various representations and finally decide when the vote is taken.”PA executive chairman Johann Buttigieg confirmed he had requested the €8,750 jet to fly board member Jacqueline Gili from and back to Sicily, where she was on a family holiday, to attend the hearing on September 20. Ms Gili voted in favour of the project.Mr Buttigieg said he did so to avoid criticism of the vote if any board members were not present.The environment commissioner said in his response that the executive chairman’s role should be limited to making recommendations and to answering questions from the board, and should not be seen as having any part in the board’s final decision or in any single vote.Moreover, he said, board members should do their utmost to be present for all meetings and should give sufficient notice of their absence, but should under no circumstances accept any insistence to attend or not attend a particular meeting. The commissioner said the PA executive council had indicated that it had accepted the two recommendations and that it would put them into practice.", "comment_count": 16, "id": 3244}, {"keywords": "", "author": "", "article_body": "It was a euphoric moment for the 32 migrants on the NGO vessel Sea Watch 3, as soon as they were told by the crew they would be landing at Malta after an 18-day ordeal.\nThe migrants, together with another 17 on board the Sea Eye vessel reached Malta on Wednesday afternoon following an agreement which will see them distributed among eight countries.\nWatch: PM in blunt explanation as deal is reached for long-suffering stranded migrants", "comment_count": 0, "id": 3245}, {"keywords": "", "author": "Keith Micallef", "article_body": "Fresh doubts have emerged on the Nationalist Party leader’s position with the taxman as a leaked e-mail shows that, apart from an €81,000 bill he reportedly settled last year, Adrian Delia still owed the exchequer €64,000.\nTimes of Malta on Tuesday sought to clarify the matter with Dr Delia, asking if he still had any pending income tax bills, however, he said he was not in a position to reply.\n\"The leader of the Opposition, Dr Adrian Delia, cannot confirm or deny any of your questions without being given the opportunity to see and analyse the said documents you claim to have,” a party spokesman said.\nAsked by the PN spokesman whether Dr Delia could see the document in person, Times of Malta on Wednesday morning said it had no objection.\nAccording to the e-mail seen by Times of Malta, in January last year, Dr Delia had reached an agreement with the Inland Revenue Department to start settling dues dating back more than a decade.\nThe first bill, which covered the period between 2007 and 2013, totalled €81,751. It consisted of €48,374 in unpaid tax, a €4,604 penalty and €28,773 in interest.\nDr Delia had declared this pending bill himself in September 2017 during the PN leadership race in the wake of serious concerns about his personal finances.\nAccording to that declaration, Dr Delia had no savings in local or foreign banks, home loans totalling over €725,000 and an overdraft of €104,000.\nHowever, thanks to property assets in his possession, he declared a net financial position of €1.6 million in the black. Subsequently, Times of Malta had reported that Dr Delia had received a little help from his in-laws to pay the exchequer.\nIt transpires from the leaked e-mail that Dr Delia managed to bring his overall tax bill down to €55,042 through an agreement granting him an 80% reduction on the interest due in return for paying the penalty as a lump sum, rather than in installments.\nHowever, the same income tax agreement highlighted a separate pending bill of €64,086, covering the period 2014 to 2017, which had not yet been settled. Apart from €52,973 in unpaid tax, the total comprised €3,181 in penalties and €7,932 in interest.\nMoreover, the e-mail pointed out that the amount could be settled in installments over a year but interest would keep accruing at a monthly rate of 0.54% on the balance due.\nNo details of this tax bill were published by Dr Delia in his 2017 statement of affairs and, in April last year, he had declared game over” in terms of his tax bills saga, saying the issue was done and dusted.\nNevertheless, a few days later, the Labour Party had claimed that the PN leader had lied” about his outstanding income tax payments because he still owed money to the exchequer.\nNo further details were given on the matter but the Labour media had subsequently accused Dr Delia of using funds raised during a party telethon to pay part of the bill. The PN leader denied the claim.", "comment_count": 144, "id": 3246}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Updated with court arraignment\nA female passenger found in possession of some 1.2 kilos of cannabis grass by customs officials at the Malta International Airport on Tuesday was remanded in custody after pleading not guilty upon her arraignment on Wednesday.\nNigerian-born Abidemi Abigail Aborishade, 36, who has an unknown Italian address, had just disembarked from a flight from Treviso when her luggage was flagged after being screened by customs officials who, subsequently, proceeded to search her belongings.\nThe search yielded five plastic wrapped packets, claimed to contain ‘dried fish’. However, further examination of the contents revealed some 1.2 kilos of cannabis grass.\nThe woman was arrested and arraigned, charged with the illegal importation of the drug and the possession thereof which indicated that the drug was not intended for her personal use.\nThe woman, who claimed to have been just visiting Malta, pleaded not guilty and was remanded in custody. No request for bail was made during the arraignment.\nMagistrate Yana Micallef Stafrace presided over the arraignment. Inspector Jonathan Cassar prosecuted. Lawyer Charmaine Cherrett was legal aid counsel.\n \n \n ", "comment_count": 0, "id": 3247}, {"keywords": "", "author": "Edwina Brincat, Bertrand Borg      ", "article_body": "Updated at 2.20pm\nA doctor who assisted a surgeon as he operated on Paceville kingpin Hugo Chetcuti on Wednesday recalled \"huge amounts of blood\" as medics raced to stabilise their patient. Mr Chetcuti had been rushed to Mater Dei Hospital after being stabbed on a busy Friday night in Paceville. He was whisked into an operating theatre, where surgical trainee Jeremy Fenech was assigned to help surgeon Ayman Mostafa as he operated on him. On Wednesday, Dr Fenech told the court how Mr Mostafa had sutured perforations in the patient's intestine and worked to stem the bleeding. \nDr Fenech was testifying in the compilation of evidence against Bojan Cmelik, who stands accused of having murdered Mr Chetcuti by stabbing him in Paceville.\nIn previous sittings, the court had heard from pathologists who examined Mr Chetcuti’s body, police officers who were at the scene of the crime and forensic specialists who examined the suspected murder weapon.\nMr Cmelik sat silently, armed guards nearby, as Magistrate Marse Ann Farrugia began the day's proceedings before a packed courtroom. \nDr Fenech explained how, having sutured the perforations, they had then flushed the patient’s abdomen with large amounts of water and checked the intestines several times to ensure there was no further damage.\nJunior trainee Stefan Zammit, who followed Dr Fenech on the witness stand, testified to this. Though both witnesses remembered two drains being inserted into Mr Chetcuti following the intervention, neither could recall who had inserted them. A third witness, consultant pathologist Darko Babic, explained how he had been given two intestine samples following the surgical intervention to examine. Dr Babic noted a significant perforation and evidence of haemorrhaging in the larger sample but nothing especially concerning in the smaller one. When asked what caused the haemorrhage, Dr Babic said he could not say.\n“I can only comment on the specimen,” he told the court. “It would be unfair to anticipate wrongly”. The case continues on January 23.\nFlowers in tribute to Hugo Chetcuti outside one of his Paceville establishments.\nMinute-by-minute blog\n1.56pm And that's it for today's hearing. Magistrate Farrugia adjourns proceedings to January 23. \n1.53pm Lawyer Joe Giglio wants to know what caused a haemorrhage Dr Babic noted in the larger specimen.\n\"I cannot say,\" the doctor replies. \"I can only comment on the specimen\". It would be unfair of him to speculate, he explains. \n1.50pm The problem with the longer intestine sample, the doctor says, was the perforation causing peritonitis. That (thank you, Google) is an \"inflammation of the peritoneum, typically caused by bacterial infection either via the blood or after rupture of an abdominal organ.\"\nThere was nothing in the shorter piece that could cause acute problems, he says. \n1.44pm The consultant is delving into details of his findings, and it's getting fairly dense for those without medical training. There's talk of acute inflammations, superficial lacerations and trans mural defects. \n1.40pm His hystological report confirmed what a visual examination indicated, Dr Babic tells the court. There were signs of inflammation.\n1.35pm Dr Babic is now explaining his duties in such situations. All tissues removed from a patient during surgery must be analysed. A report into the findings is then put together. The head of department is roped in to examine specimen which are interesting or unusual. \nIn Mr Chetcuti's case, two pieces of bowel were removed and assessed under a microscope. \n1.31pm Dr Zammit is done testifying. The day's third witness is Darko Babic, a consultant pathologist.\nDr Babic says he has been a consultant since 2002 and worked in Malta since 2009. \nHe was not involved in the operation on Mr Chetcuti, but checked a specimen of his bowel - a regular procedure following such surgeries.  \n1.27pm He recalled how the patient's abdomen had been flushed several times and then checked time and time again . \n\"I had a very limited view,\" Dr Zammit says, explaining how he was to the side. \nHe also recalls two drains being inserted and the abdomen being closed. There was mention of the patient being in a much more stable condition, he says. \nAnswering questions from Dr Psaila, Dr Zammit says he too does not recall who inserted the drains, but that it was not himself. \n1.22pm Dr Zammit recalls how he was summoned to help and immediately did so. He had not seen the patient or asked any questions about him and did not know any details about the case. \nWhen he entered, the surgeon and Dr Fenech had just controlled the bleeding, he says. \n1.20pm Another doctor, Stefan Zammit, is the next witness. \nDr Zammit was the other medic present during the surgical intervention. He tells the court that he graduated as a doctor four years ago. \n1.17pm Defence lawyer Dr Psaila wants to know how many doctors were present during the operation. The surgeon, a basic trainee and himself, Dr Fenech replies. \n1.11pm With that done, they proceeded to wash out the abdomen. Two drains were inserted - Dr Fenech can't recall by who - and Mr Mostafa closed the victim's abdomen with his help, he tells the court. \nWith that done, Mr Chetcuti was transferred to the hospital's intensive treatment unit.  \n1.06pm They found four perforations of Mr Chetcuti's small intestine, he tells the court. Mr Mostafa sutured them all and checked them several times to exclude any further damage. \nMr Mostafa then checked both the small and large intestines, physically going through their full length to make sure nowhere else had been pierced or ruptured. Dr Fenech says he served as an extra pair of eyes and hands at this stage. \n1.04pm Once the mesentry had been stitched up, much of the blood loss stopped, he tells the court. \nWith that done, they proceeded to check for damage to other organs. \n1.01pm Dr Fenech recalls that parts of Mr Chetcuti's small intestine had been affected by the injury and that there were \"huge amounts of blood\". \nMr Mustafa had sutured the mesentry - a fold of membrane that attaches the intestine to the abdominal wall.\nHugo Chetcuti was murdered in Paceville.\n12.57pm The magistrate wants to clarify what Mr Fenech's precise role was throughout the surgical intervention. \nHe explains that it was Mr Mostafa who took final decisions, but that he could take initiatives to help the operating surgeon. \nIn this particular case though, he says he cannot recall what he did specifically. It must have been the usual sort of assistance, he tells the court - cutting out extra threads during suturing, sucking out blood, helping the surgeon see better by moving organs as he worked, disinfecting areas and so on.   \n12.53pm Surgical trainee Jeremy Fenech is the day's first witness. He tells the court he graduated five years ago and sees to emergency cases. He was assisting during surgery on Mr Chetcuti. Surgeon Ayman Mostafa was the doctor who first operated on Mr Chetcuti when he was rushed to Mater Dei following the stabbing. \n12.50pm Magistrate Marse Ann Farrugia begins proceedings. As a reminder - lawyer Ishmael Psaila is representing Mr Cmelik, with Inspector Nikolai Sant prosecuting and lawyer Joe Giglio appearing parte civile on the Chetcuti family's behalf.\nBefore last October's hearing had to be put off, the court had heard how Mr Cmelik used to go by another name - Bojan Mitic. He had his name changed in March 2016, police officers testified. \n12.45pm Mr Cmelik is in the courtroom, with armed guards standing close by. \nTensions have run high in this case. Last October, a hearing had to be postponed after a bit of a kerfuffle in the courtroom. Mr Chetcuti's brother-in-law had lunged at the accused, saying his \"smirks\" had infuriated him. \n12.35pm It's looking like a packed courtroom, and people will be jostling to get a seat. Not entirely surprising, given that Mr Chetcuti's murder was arguably the highest-profile crime of 2018. \n12.30pm Armed officers are in the corridor outside the courtroom, as has been the norm throughout the case. Mr Chetcuti's brother is also present.\nThe hearing prior to this one was over almost as soon as it began. Will Wednesday's shed more light on the case? \n12.25pm Three doctors who formed part of the medical team caring for Mr Chetcuti in the days before his death are expected to testify today.\nThe court has already heard from other medics in previous hearings. They told the court that Mr Chetcuti was rushed into surgery 21 minutes after entering hospital, and had initially appeared to be in a stable condition following that intervention. \nHis condition however subsequently deteriorated and he died a few days later. \n ", "comment_count": 0, "id": 3248}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 6pm with UNHCR statement\nTired and weary but ecstatic, 49 men, women and children walked on land on Wednesday afternoon after a long journey at sea which saw them finally reaching Malta.\nThe migrants, who will be shared with Germany, France, Portugal, Ireland, Romania, Luxembourg, the Netherlands and Italy, spent 19 days aboard two NGO rescue ships.\nThey were refused entry first by Italy - which was legally bound to allow them in - and then by Malta until Wednesday, when an agreement was finally reached on the distribution deal.\nAs part of the relocation deal, a majority of a separate group of 249 migrants brought to Malta by AFM patrol boats in December will also be taken to other EU countries. \nThe agreement was announced by Prime Minister Joseph Muscat and welcomed by opposing politicians, NGOs, Bishops, the UNHCR and Council of Europe, among others.  \n\"220 persons will be relocated to other member states or be returned to their county of origin,\" Dr Muscat said.\nChristmas rescues\n\nMost of the group of 49 migrants, including women and young children, were rescued by the MV Sea-Watch 3 three days before Christmas.\nOthers were picked up by the MV Sea Eye. The rescues were made between Libya and the Italian island of Lampedusa, but Italy refused to open its harbours for the ships.\nMalta did likewise, though last week it allowed the vessels to enter its waters for shelter as the weather deteriorated.  \nSea Watch on Sunday said that the situation aboard was deteriorating dramatically, with food and water running short and the migrants getting dehydrated and demoralised.\nWatch: 'C'est fini'!' Migrants cheer as they hear the news\nMalta had insisted that since the rescues did not take place in its area of competence, it should not be held responsible for the migrants.\nAs the days dragged on to weeks, calls for EU member states to resolve the matter grew louder and more frequent. On Sunday, Pope Francis made a clear appeal for solidarity. \n\nTalks to resolve the diplomatic stand-off were coordinated by the European Commission and involved all member states. \nOn Wednesday, Dr Muscat acknowledged that the Maltese government had insisted on a relocation mechanism for the 249 migrants rescued by Malta to also feature as part of a deal to disembark and relocate the 49 stuck at sea. \nIt would not have been fair, the Prime Minister argued, if the EU agreed to relocate migrants which a member state had refused to take responsibility for - a clear reference to Italy's position -  while not helping out when a government abided by its obligations. \nPhoto: Matthew Mirabelli\nDr Muscat said the migrants on the two rescue ships will be transferred to AFM patrol boats and the two vessels will then be told to leave Maltese waters.\n44 Bangladeshi migrants who were among the 249 rescued by Malta will be repatriated, with assistance by the EU.\n\n\nCouncil of Europe Commissioner for Human Rights, Dunja Mijatović also expressed relief that the situation has been resolved and listed issues which states had to tackle to prevent a reoccurence of the situation. \nUNCHR welcomes deal\nThe UN refugee agency, UNHCR, also welcomed the news and commended the EU member states which had agreed to relocate migrants. \nIt nevertheless expressed concern that it had taken so long to come up with a solution.\n\"The imperative to save lives comes above politics and cannot be a responsibility that’s negotiated on a case by case basis,” said UN High Commissioner for Refugees Filippo Grandi. ", "comment_count": 0, "id": 3249}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A number of relatives and close acquaintances have painted a positive image of the young man currently accused of having raped his young cousin - describing her as difficult and manipulative.\nThe 25-year-old man is charged with subjecting her to seven years of sexual abuse.\nAn 82-year old female neighbour of the family, who visited daily the grandmother’s home where the abuse allegedly took place and who has known the accused for the past nine years, ever since he moved in with his maternal grandmother, described the small flat as a “club. Always filled with people”.\nThe elderly lady claimed that the alleged victim “did not have such a fine character. Was too ambitious, did not talk much and ordered her mother about, even when she wanted a drink”.\nMoreover, the girl appeared to be jealous of her younger sister. “If her mother bought a €5 item for the younger daughter, the elder one would want something worth €20 or €25,” the witness explained, adding that the alleged victim wanted to put “everyone beneath her\".\nAsked about the accusations at the centre of the trial, the witness emphatically declared: “I don’t believe it. I’m almost certain that he did not do it.”\nNext to take the witness stand was an uncle of the accused, a bird breeder who claimed to spend his days up inside the washroom of the residence where he kept his prized possessions, the birds that were like his “children”.\nThe washroom was the place where the rape of the then-10 year old girl had allegedly taken place, yet the witness claimed that the key to the room was always in his possession, pulling out a bunch of keys and indicating a particular one to all those present in the courtroom.He had never seen his niece on that floor, he said, claiming that he would spend from dawn to dusk in the room, going down just to buy cigarettes, occasionally accompanied by the accused.\nAs for the victim, the man described her as “a bit of a duttura”, who did not talk unless spoken to.\nThe accused’s girlfriend for the past nine years took the witness stand, explaining how she knew the family well and describing the alleged victim as standoffish, the jealous type who was difficult to get along with.\nLeafing through some printed copies of posts taken from Facebook, the witness explained how the alleged victim had posted comments on her page and that of her boyfriend, dating back two years.\n‘Lovely couple!’, ‘perf couple,’ ‘Keep the cute couple up,’ were among the posted comments read out by the witness.\nAsked about the accusations faced by her boyfriend, the young woman replied “At first I was shocked. But after some reflection I concluded that it was not true. I have no doubt, otherwise I would not be here.”\nAn uncle-in-law of the accused gave similar insight into family relations, shedding light on the character of the victim. “If she wants something she’ll persist until she gets it.”\nAs for the accusations, the man stated “I’m not convinced that this boy did this. I believe him not her. Now the family lives apart. We can no longer trust anyone.”\nRead: 'It did happen, I swear' - Teenage girl stands by sexual abuse claims against her cousin\nTuesday evening’s long session came to a close with the testimony of a 16-year old cousin of the parties who gave evidence via video conference.\n“She has a very proud character (supperva). I didn’t speak to her much, only addressing her when she asked me about school. After the arrest, I blocked her on Facebook to break off all contact. I was afraid she might make up something else,” the young man said.\nThe witness explained how the alleged victim would fight with her mother, shouting at her when she did not get what she wanted and attempting to steal attention away from her younger sister who was lactose intolerant and thus got more attention from her mother.\nThe girl would also lie about school grades, saying she did well when her sister would later give away the fact that her sibling had spent the whole night crying when she failed an exam, the court was told.\nAs for the accusations, “It cannot be true. We used to be a lot of people at granny’s home which is very small,” the witness concluded, adding that a mirror right opposite the kitchen revealed the bedroom opposite where most of the abuse allegedly took place.\nAfter the series of witnesses, the defence informed the court that it had no further evidence to put forward.\nThe trial is continuing on Wednesday as the prosecution makes it submissions.\nLawyers Franco Debono, Marion Camilleri and Anita Giordmaina are defending the accused.\nLawyers Matthew Xuereb, Nadia Attard and Charles Mercieca from the Office of the Attorney General are prosecuting.", "comment_count": 0, "id": 3250}, {"keywords": "", "author": "", "article_body": "It’s been 19 days since the men, women and children aboard the Sea-Watch 3 and Sea-Eye last set foot on land. The Maltese coast lies tantalisingly within sight, but it remains forbidden territory for as long as EU governments continue to argue over whose responsibility the asylum seekers are. Times of Malta visited people stuck at sea as concerns were growing over rapidly deteriorating weather conditions, forecast for Wednesday and Thursday. \nMany of those aboard were too tired, sick or shy to face the camera. A few others were not. Times of Malta photographer Jonathan Borg captured some moments on deck. \nLittle Habiba, 1, peers inquisitively into the camera.\nBlue skies and calm waters were a relief to crew members, but conditions are set to deteriorate.\nVolunteers have been regularly delivering supplies to crew and passengers aboard the ships. On Tuesday, they brought drinking water, couscous, fruit and vegetables.\n'We do not know what is going to happen to us,' one migrant admitted.\nA foreign journalist snaps a shot. Reporters from media outlets across the globe have flown in to Malta to report on the ongoing saga.\n'We are not bad people. It was no good in Libya, you do not know how they treat us, like animals.'\nTattered sandals are not the ideal footwear while at sea - but it is all that many aboard have.\nFilfla in the background as the Sea-Eye, its crew and passengers patiently wait.\nThe sun sets on the vessels' 18th day stuck at sea.\n \n \n ", "comment_count": 16, "id": 3251}, {"keywords": "", "author": "", "article_body": "Minister Konrad Mizzi has formally dropped the constitutional case filed on December 7 claiming that his fundamental rights had been breached in the judicial process sparked off by a request for a magisterial inquiry by former Opposition Leader Simon Busuttil following revelations in the Panama Papers.\nRead: Court rejects Konrad Mizzi's request to hold up Panama appeal proceedings\nDr Mizzi’s constitutional application had prompted a request by Dr Busuttil and MEP David Casa for authorisation to intervene in the suit.\nYet when the case was due to continue on Wednesday morning, the applicant’s lawyers - the minister was not present in court - informed the court that the minister was formally presenting a note to cede the case.\nThis was done in view of Monday's decree by the Criminal Court whereby Mr Justice Giovanni Grixti decided that there were not grounds for any inquiry based on the information that had been given by Dr Busuttil. The judge also overturned the earlier decision by a Magistrates’ Court giving the green light for a magisterial inquiry against seven high-profile personalities, including Minister Mizzi.\nRead: Court rejects Simon Busuttil’s request for a Panama Papers inquiry\nIn view of this formal declaration by the Minister’s lawyers, Mr Justice Robert Mangion upheld the request for cession of the constitutional proceedings and declared the case closed.\nDr Mizzi's lawyers were Aron Mifsud Bonnici and John Bonello.\nDr Simon Busuttil, present on Wednesday, was assisted by Dr Jason Azzopardi.", "comment_count": 0, "id": 3252}, {"keywords": "", "author": "", "article_body": "Malta is one of just three countries in western Europe to improve their score in The Economist Intelligence Unit’s Democracy Index, just issued, although it remains ranked 13.\nThe other two European countries to improve their scores are Finland and Germany.\nMalta is 13th among the 21 Western European countries, with Norway, Iceland and Sweden leading the pack and Malta just behind Germany, the UK and Austria but ahead of Spain, Portugal, France and Italy.\nThree European countries saw a deterioration in their overall scores: Turkey, Italy and Austria. All other scores stagnated. Once again, none of western Europe's “flawed democracies” — Italy, Portugal, France, Belgium, Cyprus and Greece — moved into the “full democracy” category.\nIn the global table on political participation, protest and democracy Malta is 18th out of 20 countries classified as full democracies, one down from last year when Malta had also seen a slight deterioration of its points tally following the murder of Daphne Caruana Galizia and questions about the country's rule of law.\n\nThe index rates 167 countries by 60 indicators across five broad categories: electoral process and pluralism, the functioning of government, political participation, democratic political culture and civil liberties.\nThe policies of Italy's anti-immigrant and anti-establishment government which came to power last June torpedoed the country's global democracy ranking.\nThe country dropped from 21st to 33rd position in the Economist Intelligence Unit's 2018 Democracy Index, mainly because of the presence of the far-right League in Italy's coalition.", "comment_count": 8, "id": 3253}, {"keywords": "", "author": "", "article_body": "The police have launched an investigation after a man was found dead on a construction site at Dragonara Road, St Julians.\nThe grim discovery was found at 6.50am.\nThe man has not been identified but is believed to be a foreigner. \nThe police said that according to preliminary investigations, the man fell a height of about two storeys.\nA magisterial inquiry is underway.", "comment_count": 11, "id": 3254}, {"keywords": "", "author": "Keith Micallef", "article_body": "Nationalist Party leader Adrian Delia on Tuesday held talks with the heads of two top party organs about his future, amid growing pressure to resign over serious allegations against him.\nDr Delia met Mark Anthony Sammut, president of the executive committee, the second-highest decision-making body after the general council, and MP David Stellini, who heads the administrative council, which deals with issues of a disciplinary nature.\nWhile both declined to comment on the outcome of the meeting, Mr Sammut remarked that he and Mr Stellini had shared their views \"on what we believe should be done”.\nHe expressed the wish that the best decision in the interest of the party” be taken but would not elaborate.\nMr Sammut was the first top party official to publicly express concern about domestic violence allegations against Dr Delia that surfaced at Christmastime. The claims, levelled by Dr Delia’s wife during separation proceedings, ended in the public domain following a leak of court documents.\nExecutive committee president very worried\nMr Sammut had pronounced himself on the matter when asked for his reaction by The Sunday Times of Malta, saying Dr Delia’s situation would have to be tackled by the executive committee.\nPrior to this controversy, The Sunday Times of Malta had also reported that the PN leader was being investigated on the strength of a report by the government anti-money-laundering agency in connection with a Soho prostitution racket. He denied any wrongdoing on his part.\nWhile a defiant Dr Delia vowed to stay, branding the latest accusations part of a plan to oust him by exploiting private life” issues, Mr Sammut admitted he was very worried about the disturbing” claims.\nMeanwhile, reports that Dr Delia could be facing calls to resign even from within his own parliamentary group continue to make the rounds. Though, so far, no MP has publicly declared losing confidence in the party leader, fewer than half the members of the parliamentary group have publicly pledged support on Facebook.\nMoreover, party sources said that the stream of leaks emerging from the PN headquarters in the form of social media messages was taking its toll on Dr Delia’s staunch supporters, across all ranks.\nTimes of Malta reported on Tuesday that senior party officials were in shock after learning that Dr Delia had last August tried to strike a financial deal for the party, using the so-called ċedoli loan scheme. The information came to light following leaks from the PN leader’s mobile phone devices.\nThe PN reacted by issuing a statement in which members of the party’s finance team categorically denied having discussed party financial matters with the Times of Malta.\nEvery single member of the finance team reiterates full trust and unequivocal support to Adrian Delia and vouch for his integrity and transparency,” the statement said.", "comment_count": 113, "id": 3255}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers.\nTimes of Malta says fresh doubts have emerged on the Nationalist Party leader’s position with the taxman as a leaked e-mail shows that, apart from an €81,000 bill he reportedly settled last year, Adrian Delia still owes the exchequer €64,000.\nTimes of Malta and l-orizzont also report how a judge rejected Simon Busuttil’s request for a Panama Papers inquiry.\nl-orizzont says the claims were nothing but speculation. The newspaper also says that six people were saved from suicide over the Christmas period.\nIn-Nazzjon gives prominence to remarks by PN leader Adrian Delia on TimesTalk that his party is united in fighting government corruption. It also reports how NGOs pleading for the welfare of migrants were denied a meeting at Castille.  ", "comment_count": 0, "id": 3256}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 1.35pm - The Libyan coastguard should be allowed to do its job, Prime Minister Joseph Muscat said on Wednesday after having talks in Valletta with Libyan Prime Minister Fayez al-Serraj.\nNo details about the talks were issued, but migration and bilateral relations were at the top of the agenda.\nIt was the first meeting between the two leaders since they met for a conference on Libya hosted by the Italian government in Palermo in November. \nThey greeted each other warmly on the steps of the Auberge de Castille before proceeding inside for talks that were expected to focus on the unstable situation in Libya, the aftermath of the Palermo conference, the migration situation and bilateral relations. \nAsked for comments after the meeting, Dr Muscat told the press that the level of commitment from the Libyan side to tackle migration had grown exponentially over the past year.\nThis was in part due to input of the EU and help from Italy when it comes to patrolling of the territorial waters.\n“Once the EU is helping Libya finance, set up and train its coast guard, and this coast guard is finally functioning, we need to allow the Libyan coast guard to do its job. It’s not a race of who comes first when it comes to territorial waters… They should be allowed to coordinate a rescue. I don’t think it’s on that organisations think that they can decide rules for themselves.\n“Member states, rightly so, are held accountable to proper international rules, and NGOs should also be held accountable to proper rules.”\nThose accompanying Dr Muscat at the talks included Deputy Prime Minister Chris Fearne and ministers Michael Farrugia, Chris Cardona, Konrad Mizzi and Carmelo Abela. Former Foreign Minister Alex Sceberras Trigona, who has served as Dr Muscat's envoy, is also present.\nThe migrants exodus from Libya has put pressure on Italy and Malta, with both countries seeking to have the migrants distributed among other EU countries while refusing to open their harbours to rescue ships operated by NGOs. \nTimes of Malta had reported in December that government employee Neville Gafà, in November had had a meeting in Libya with one of the country's most notorious militia leaders. It was not clear whether he had represented the government on that trip and he  played it down as “nothing serious”. But Prime Minister Muscat subsequently said Mr Gafa was doing “very good work”.\nPrime minister Fayez al-Serraj is based in Tripoli and leads a UN-recognised government which, however, has limited authority over the country.  \nThe Palermo summit had been meant to assemble Libya's main rivals for the first time since a similar event in Paris in May last year, when they had agreed to  hold elections in December.\nBut al-Serraj's main rival, General Khalifa Haftar, whose government is based in the east of Libya, did not attend the conference, although he visited Palermo and had a meeting there with Italian Prime Minister Conte. The elections were not held.\nSerraj's western-based government has struggled to assert its authority in a country still mostly controlled by armed groups, almost nine years after NATO-backed rebels toppled former dictator Muammar Gaddafi.\nLibya also has two parliaments based in the east and west and has been beset by violence by the various militias which has seen its airports and oil fields frequently shut down. \nUN Libya envoy Ghassan Salame said late last year that he hoped another attempt to hold an election will take place by June but Libyans should first hold a national conference in early 2019 to decide on the poll's format. \nThe envoy said the national conference should \"preferably\" take place on Libyan soil. Surveys had shown that 80 percent of Libyans want elections to end the stalemate between Libya's rival administrations.  \nFrance has been courting Haftar, who is supported by Egypt and the United Arab Emirates, which see his forces as a bulwark against Islamists.\nItaly is the main backer of Serraj and his weak Government of National Accord (GNA), and has worked with local groups in Libya to stop Europe-bound migrants from embarking by boat. ", "comment_count": 28, "id": 3257}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Senior Nationalist Party officials on Monday expressed “shock” at various leaks from the personal mobile phone of their embattled party leader Adrian Delia showing attempts by Dr Delia last August to strike a financial deal for the party using its loan scheme known as ċedoli.\nMembers of the PN’s financial committee, who spoke to Times of Malta on condition of anonymity, condemned the leak of “sensitive financial information related to the PN”, while distancing themselves from any of the ‘initiatives” apparently undertaken by Dr Delia without their knowledge.\n“The PN’s financial committee, which among other things, administers this loan scheme and makes sure that it is run with the highest rigour and professionalism, was never informed about any intention of selling or using this asset as some type of collateral,” members told the newspaper.\n“If Dr Delia was conducting any kind of discussions, the committee was kept in the dark and was never given details on what was going on. These revelations are news even to us and we are in shock,” they said.\nVenting their frustration at the ongoing evolving situation and the leak of sensitive PN information through Dr Delia’s personal means of communications, one senior official said that “this continues to show that what was described as a private and personal matter has now become a very public issue exposing the party’s internal documents and risking the PN’s future”.\nAccording to the leaks seen by Times of Malta, last August Dr Delia asked one of the directors of Global Funds Sicav Plc, Konrad Camilleri, if the financial investment company was interested in raising over €5 million in a deal over the ċedoli scheme.These revelations are news even to us and we are in shock\nIn the WhatsApp conversation, Dr Delia asks Mr Camilleri, who resides in his own hometown, Birkirkara, whether Global Capital would be interested in the PN’s ‘loan notes’.\n“How realistic is it to get €5.5 million to buy PN ċedoli at 4% per annum and capital after 10 years?” Dr Delia asked.\nWhile Mr Camilleri told Dr Delia, who he addressed as “chief”, that he needed to speak to the Global Capital CEO Paolo Catalfamo, he later said that his boss was interested in discussing the matter.\nIn the text conversation Dr Delia even mentioned the possibility of securing “the bond against property”, possibly PN property, including party clubs.\nIt is not yet known whether Dr Delia’s attempt to get some sort of financing through the use of the ċedoli asset was successful. PN officials told Times of Malta in confidence that they were not aware of any such deal.\nThe PN’s spokesman did not reply to questions about the matter.\nOn his part, the PN Deputy Leader for Party Affairs, Robert Arrigo, who is in charge of the raising of funds for the party and their administration, including the ċedoli scheme, did not reply when asked about the latest revelations.\nMr Arrigo, also an MP, was asked whether he was aware of Dr Delia’s discussions with Global Capital and whether a deal was struck.\nEstablished under the previous party leadership, the ċedoli scheme was an innovative financial vehicle created by the PN to raise funds. \nIn a statement on Tuesday, all members of the PN's finance team denied discussing the party's financial matters with Times of Malta. \nIn the statement, signed by Mr Arrigo, secretary general Clyde Puli, treasurer David Camilleri, executive chairman Media.Link Communications Pierre Portelli and financial controller Malcolm Custo, the PN aid Dr Delia had set an ambitious 10-year plan to place the party on a robust financial footing through which it would be able to pay its debts. \nThrough the ċedoli scheme, which was harshly criticised by the Labour Party, PN supporters and investors were encouraged to lend the PN small sums of money, up to €10,000, in return for a 4% interest per year and the return of their capital after 10 years.\nThe scheme proved to be quite successful. In fact, according to the PN’s financial report, by the end of 2016 the scheme had raised over €3.5 million.\n ", "comment_count": 57, "id": 3258}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated Wednesday 10.15am with David Casa statement\nBobbing along the waves between Filfla and the Żurrieq coast, a rescue vessel packed with migrants braces itself for the rough weather expected to make its way towards Malta from tomorrow. \n“We do not want to stay here in storms anymore, please. It makes us sick, all of us - 32 people - in one room on a boat, like animals, we are not happy, this is not fair. There are women and children, and everybody is scared - we just want to be safe,” said Diamond, a Nigerian asylum seeker onboard the Sea-Watch 3.   \nHe is one of 49 migrants who have been stuck for almost three weeks on board two NGO rescue vessels just a few kilometres off Malta’s southwestern coast. \nBoth Malta and Italy have refused permission for the NGO vessels to enter harbour, but Malta last week allowed them to enter its waters to shelter from rough seas.\nRead: ‘Migrants can only disembark when host agreements are in place’ - Government\nTimes of Malta on Tuesday joined the stranded migrants for a rare glimpse of life at the forefront of the Mediterranean migration crisis. \nSpeaking from the bridge deck of the SeaWatch 3, head of mission Kim Heaton-Heather said the situation on board was unbearable. These are people who have been through multiple traumatic experiences, they have symptoms of post-traumatic stress disorder\n“We have crew and the guests [rescued migrants] being sea sick together. It is a day-to-day struggle to keep people from losing control or giving up. These are people who have been through multiple traumatic experiences, they have symptoms of post-traumatic stress disorder, they have been imprisoned, in some cases raped and tortured, and now they are within distance of safety but there is nothing they can do,” he said.\nThe few migrants on board willing to face media cameras recounted how the experience of being locked in a floating prison at the gates of Europe, is all too familiar for those who endured nightmarish captivity in one of Libya’s detention centres.\n“It was no good in Libya, you do not know how they treat us, like animals,” another migrant said, his stoic brow refusing to give in to tears.   \n“We are not bad people.”\nPhoto: Jonathan Borg\nAfter having endured repeated abuse in Africa, it is now the European Union migration policy and the stubbornness of frontier member states, such as Malta, that is causing them distress.\nLooking towards the Maltese cliffs, one migrant - a teenage Egyptian who dreams of playing basketball and making new friends, said he has to relinquish control of his own fate as he clings to hopes for a better life.\n“We do not know what is going to happen to us. We just want a safe port so that we can be safe and not at sea. Please European governments don’t leave us here,” said Austin, another Nigerian migrant.\nMeanwhile, asked if there had been any communication with the Maltese authorities, Mr Heaton-Heather said that all the team knew was that they were not authorised to disembark the migrants onboard the two ships in Malta. \nMoving closer to the port might shelter the vessel from bad weather forecast for the coming days, but having to move back out to sea when it clears out would be another major blow to the migrants’ already battered spirits. \n“I have made it clear to them I will not leave until they are given a safe port. This is all we can do, be honest with them and show solidarity,” he said.\n'Malta being called to assume responsibilities beyond its remit' - government\nIn a statement, the Maltese government said it was closely monitoring the situation and would be granting assistance in case of emergency, as it was bound by law until a solution to the current impasse was found.\n“Malta is once again being called to take upon itself responsibilities which are beyond its remit when it comes to showing European solidarity in practice,” the government said.\nIt reiterated that it did not have legal competence to rescue migrants who were intercepted in Libya’s search and rescue area, closer to Libya, Tunisia, and Italy. The NGOs, the government said, were denied entry in other European and non-European safe ports and proceeded to loiter in Maltese territorial waters.\nWhile these cases were happening, Malta rescued a further 249 migrants, fulfilling all its obligations as it had always done.\nThe smallest European Union state was now being called on to disembark the migrants on these NGO boats as had happened a few months ago with Malta taking an active role in providing effective solidarity.\nIt said that, in this context, the discussion on ad hoc relocation should not be limited to the persons on board the two NGO vessels but extended to a portion of the persons rescued and already in Malta, as a sign of goodwill.\nDiscussions, the government said, were underway and the government wished they would be concluded in the coming hours.\n“A long-term European solution for similar issues in the future should be a priority to avoid a repeat which put even more burden on a member state like Malta which always abides by its obligations,” the government said.\nMEP David Casa on Wednesday sent a letter to all his peers, saying action was needed as the situation was deteriorating rapidly.\n\"I have sat through 15 years of declarations in this house on safeguarding human life and solidarity with southern European member states,\" he lamented. \n\"This is the time to put those words into action.\"", "comment_count": 0, "id": 3259}, {"keywords": "", "author": "", "article_body": "Updated Wednesday 9.13am with Labour Party reaction - Simon Busuttil, the government and the Labour Party have reacted after a court turned down a request by the former Opposition leader to have a magisterial inquiry opened into the key protagonists of the Panama Papers revelations. The Criminal Court said that Dr Busuttil had failed to indicate sufficiently that any crime had been committed.\nIn July 2017, Dr Busuttil had asked for a magisterial inquiry to be opened into the allegations. Magistrate Ian Farrugia had eventually found that there was enough reason to justify an inquiry, but appeals had been immediately filed against that decision by Prime Minister Joseph Muscat, Tourism Minister Konrad Mizzi, OPM chief of Staff Keith Schembri, Nexia BT’s Brian Tonna and Karl Cini, and businessmen Malcolm Scerri and Adrian Hillman.\nMr Justice Grixti said in his judgment, issued on Tuesday, that Dr Busuttil had given a number of facts which in themselves did not indicate any wrongdoing, such as the Prime Minister going to Azerbaijan on a solo trip, the police commissioner and the head of the FIAU resigning, and Nexia BT getting rid of considerable amounts of documents.\nHe stressed there was a considerable leap between these facts and money laundering, and that the accusations were merely Dr Busuttil's opinion - something that he was free to have - as long as he did not them extrapolate them to a crime.\nDr Busuttil, the judge said, ought to have provided details of layering to prove money laundering.\nHe therefore overruled Dr Farrugia's decision and said an investigation was not justified.\nREACTIONS\nIn a statement, the Office of the Prime Minister highlighted the judge's remarks that Dr Busuttil had not substantiated his claims and that they therefore \"qualified as speculation in the absence of further evidence\". \n\"After the Egrant inquiry, this has also completely exonerated the Prime Minister and others,\" the OPM said in a statement. \n\nReacting in a tweet, Dr Busuttil asked how could a court refuse to open an inquiry when Dr Mizzi and Mr Schembri were caught red-handed with  a secret Panama company to pocket €5,000 a day.\nIn a reaction to Dr Busuttil's comments, the Labour Party described the former Opposition leader as arrogant and said that somebody who professed to believe in the rule of law was now hitting out at the court, effectively acting as judge and jury.   ", "comment_count": 0, "id": 3260}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 9.15pm with PD statement\nRepresentatives of 40 organisations gathered outside Castille Palace requesting a meeting with the Prime Minister to call for an end to the impasse that has left 49 migrants stranded on rescue vessels in Maltese waters.Migrants aboard the Sea-Watch 3 and Sea Eye have been stuck in limbo for 18 days after Malta and Italy both refused to open their ports, but Malta last week allowed the vessels to enter its waters to shelter from rough seas. \nThe vessels' crews have reported that the situation on board has grown increasingly desperate in recent days. The organisations gathered outside the Prime Minister’s office on Monday after receiving no response to a request to meet. Representatives said they would remain there until an answer arrived.In a statement to the media, they said they were appalled that despite countless calls for solidarity, European member states had not managed to find a diplomatic solution to the current impasse, and called for Malta to prioritise saving lives above any other considerations.At this point, the question we must answer is simple: what is more important, scoring political points, or saving lives?“This is nothing short of tragic and shameful. It can only mean that we have completely lost our humanity – as a people and a union of States that supposedly upholds the values of solidarity, respect for human rights and human dignity,” Integra Foundation director Maria Pisani said on behalf of all the organisations. Acknowledging the complex issues the situation raised, and the need for a European solution, the organisations said these issues could not be used as an excuse to abdicate the individual and national responsibility to save lives at any cost.Watch: Pope Francis appeals for solidarity with migrants stranded off Malta“The duty to save lives is not only a legal but also a moral imperative which can never be subjected to political conditions, such as the availability of concrete offers of relocation or the fear of creating a precedent.“At this point, the question we must answer is simple: what is more important, scoring political points, or saving lives? For us, the undersigned organisations, there can be only one answer: people are more important.”The statement was also delivered to a spokesman for the Prime Minister, who met briefly with representatives and said he would deliver the message and the request for a meeting. The 40 organisations included Integra, aditus foundation, Jesuit Refugee Service Malta, Malta Emigrants’ Commission, Moviment Graffitti, Christian Life Community, Women’s Rights Foundation, Richmond Foundation, St Jeanne Antide Foundation, Malta LGBTIQ Rights Movement, Migrant Women’s Association Malta, African Media Association Malta, Catholic Voices Malta, several University of Malta departments and student groups.\nActivists left candles outside Castille Palace, referencing the 49 people who remain at sea. Photo: aditus.\nPut solidarity and humane treatment before all else - PD \nIn a statement in support of the NGOs in the evening, Partit Demokratiku saidthe migration phenomena in the central Mediterranean has been going on for two decades, yet the EU has not managed to get its act together to address this dilemma.\n“This is not on for a Union that prides itself with being an actor on the global stage. Government should have taken in the vulnerable, which include women and children, as soon as the weather deteriorated, setting an example for other member states to follow,” MP Marlene Farrugia said.\nMalta, she said, needed to be tough on migration given its precarious position between Africa and Europe, its size, and the Dublin II Convention, which obliged the country to house rescued refugees forever.\nBut, on the other, the government could not act in an inhumane manner as witnessed in the recent Sea Watch incident, which was a case of prolonged suffering in inhumane conditions for those rescued.\n“Whilst the government must abide by its international obligations and cater for rescuing and disembarking migrants within its zone of responsibility, and should be praised for saving the lives of 251 migrants less than two weeks ago, Malta cannot shoulder the refuge burden alone. To be clear, it cannot take in all migrants rescued miles off Libya, because it will instigate dangerous, unsustainable, precedents,” PD leader Godfrey Farrugia said.\nThe only way out of this precarious situation was to continue to take the bull by the horns and address the matter in Brussels by pushing for burden sharing, but diplomacy could not take a break during Christmas, when human lives were at stake.\nThe Sea Watch situation was a case in point with cruel consequences.\n\"It seems that the valued principles on which Europe has been founded : solidarity, equity and inclusiveness have been sidelined,\" he said.\n“Solving single incidents which emphasise the plight of migrants will not solve anything unless the EU gets its act together in Africa, especially Libya,” secretary general Martin Cauchi Inglott said.\n“If elected as an MEP, rest assured that one of my priorities will be dealing with migration through Libya and at sea, ensuring emergency procedures,” he promised.\nPartit Demokratiku noted that human displacement was a very sensitive and volatile subject that transcended from the political circles through all social strata to the roots of society.\n ", "comment_count": 0, "id": 3261}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A new book featuring letters and inscriptions dating from the ancient past to modern-day Malta seeks to tell the country’s history through the words of those who penned them. \nView of Maltese Watchtower – Watercolour on paper, 1916, painted by a British officer convalescing in Malta.\nThe letters, many of which are being published for the first time, include first-hand accounts by those who survived major events and others written by grandmasters, prime ministers and ordinary civilians. \nLetters sent to German Flight Lieutenant Iring Englisch, who had been heavily involved in the war against Malta and a 1799 letter signed by French officers during the siege of Valletta are just two of the several correspondences published in the book The Malta Letters.\nAuthor Robert Attard told the Times of Malta that the book recounts Maltese history through inscriptions, notes and letters in private collections. The author wanted to let the letters speak for themselves, with captions providing the necessary context and information. \nThe book gives a bird’s eye view of the history of Malta from Punic times to 1968, with the oldest ‘letters’ consisting of inscriptions on coins and pottery and the most modern ones being typewritten letters.\nAmong others, the book includes the only known copy of Gratulatorii Plausus – a poem written by Maltese poet Francesco Buonamico, the second poet known to have written in Maltese. \nA list of Buonamico’s international publications had been published in the 18th century by Franz Paul von Smitmer, but the contents of his obscure poem Gratulatorii Plausus remained a mystery, Dr Attard said.\nThe book gives a bird’s eye view of the history of Malta from Punic times to 1968\nThe poem was known to exist, however, a copy could not be found anywhere, Dr Attard noted.  The poem, which came in the form of a non-descript tiny pamphlet, was missing from the most advanced collections. \nEven the largest libraries of Europe did not have a copy of it.\n“I was immensely lucky to locate the only known extant copy of Buonamico’s lost poem in Modena… I believe that Gratulatorii Plausus was an attempt to create a ‘Maltese’ pocket-sized version of Torquato Tasso’s Gerusalemme Liberata.”\nPublished by Miller Distributors Ltd, Daniel Cilia took care of the photography and design of the book.\nRental agreement executed by Grandmaster Zondadari’s Court – Ink on calf skin 1720. The document is a rental agreement that refers to Jean Baptiste Ludovic de Bocsosel-Mongontier and the Order’s Commandery in de Chazelle. The de Bocsosel-Mongontier family gave many knights to the Order of Malta.", "comment_count": 0, "id": 3262}, {"keywords": "", "author": "Jacob Borg", "article_body": "A Turkish journalist has been given a 13-month jail sentence after she was found guilty of defaming and insulting former Turkish Prime Minister Binali Yildrim and his two sons. Journalist Pelin Unker had revealed that Mr Yildrim’s two sons owned two companies in Malta. Their ownership of these companies was revealed in the 2017 Paradise Papers leaks. The Paradise Papers, published by the International Consortium of Investigative Journalists, had enabled journalists to search for directors or shareholders of Maltese companies using data obtained from the Malta Financial Services Authority, whose own publicly available database does not allow for such searches. The two brothers were shown to own Hawke Bay Marine and Black Eagle Marine.\n\n\n\nMs Unker’s lawyer argued in the defamation case that the reporting about the Yildrims’ ownership of the two companies was in the public interest. \"I did my duty as a journalist. The story was about public figures. I fulfilled my duty to announce the incident to the public. The right to reply was granted to himself. I don't think the story I did constitutes a crime”, Ms Unker was quoted as saying.She was also fined 8,660 Turkish lira (€1,400).", "comment_count": 84, "id": 3263}, {"keywords": "", "author": "Jacob Borg", "article_body": "Malta’s anti-money laundering unit (FIAU) is unable to say if any regulatory action has been taken against government consultants Nexia BT. \nLast month, FIAU director Kenneth Farrugia warned financial intermediaries during a training conference that combatting money-laundering was a shared responsibility and not just the unit’s task. \nFinancial intermediaries are legally obliged to report suspicious activities by their clients to the FIAU. \nDespite being at the heart of the Panama Papers scandal, government consultants Nexia BT have so far escaped any apparent regulatory action. \nThe firm set up secret offshore structures for the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi without notifying the tax authorities. \nAccording to one e-mail found in the Panama Papers, the two government officials were set to receive payments of up to $2 million, a figure far greater than their modest government salaries. \nA leaked FIAU report about Dr Mizzi accused Nexia BT of withholding information from the unit during the course of its Panama Papers investigations. \nNexia BT were retained as advisers to the PM’s office following the scandal\nReplying to questions by Times of Malta, FIAU deputy director Alfred Zammit said the FIAU adopted a risk-based approach when carrying out its supervisory functions, as required by international standards.\nMr Zammit said confidentiality obligations meant the FIAU was not in a position to confirm whether the unit had or would be taking any supervisory action on Nexia BT.\nNexia BT partner Karl Cini was called in for police questioning last year soon after selected conclusions of the Egrant inquiry were published in July. \nThe firm’s managing partner Brian Tonna is facing a magisterial inquiry after a leaked FIAU report raised suspicions that he passed on a €100,000 kickback on passport sales to Mr Schembri. \nAll those involved deny any wrongdoing. \nAccountancy Board chairman Peter Baldacchino told Times of Malta last month that “different exercises” were under way when asked about the apparent inaction against financial advisory firm Nexia BT.\nDr Baldacchino said the regulator could not publicise its every move and had always taken action when needed. Both Mr Cini and Mr Tonna resigned from the Malta Institute of Accountants in 2017 after it was made known they would face disciplinary action in the wake of the Panama Papers scandal.\nThe firm has received over $800,000 in government contracts since Labour returned to power in 2013. \nMr Tonna was employed full-time in 2014 by the Justice Ministry on a contract worth €5,000 per month. \nHe retained the contract even after the Panama Papers hit the headlines in 2016.\nNexia BT were also retained as advisers to the Prime Minister’s office following the scandal. ", "comment_count": 16, "id": 3264}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Four men on Tuesday admitted to breaching immigration laws by carrying false documents.\nTwo of them had been stopped at Malta International Airport while attempting to travel out of the country, whereas the other two had managed to get out of the country, only to be stopped by immigration authorities in Italy and sent back to Malta to face justice.\nThe prosecution insisted upon an effective jail term.\nPresiding Magistrate Joseph Mifsud said the court could not \"close an eye as to the fact that Immigration Laws have been breached,” adding that such offences had become a somewhat “constant phenomenon”.\n“With all due respect, it was not acceptable for a person to enter and exit national territory with false documents, trying to deceive Immigration Authorities both locally and abroad,” Magistrate Mifsud continued when delivering judgment.\nSuch offences could “undermine State security” and for this reason, the Maltese State should show a “keen interest to find out the true identity of whoever entered the country,” the Magistrate stressed, “especially in times of upheaval, conflicts and terrorism in various parts of the world” including those close to Maltese territory.\nHe took note of the accused’s early guilty plea and the fact that all four had no fixed address, condemning them to a six-month effective jail term each.\nIn respect of the Egyptian nationals, the court urged the relevant authorities to take the necessary measures to repatriate them once they served their sentence and the asylum process was over, since Egypt was considered a “safe country”.\nInspector Frankie Sammut prosecuted. Lawyer Yanika Bugeja was legal aid counsel to the Sudanese men. Lawyer Mark Attard Montalto was legal aid counsel to the other accused.", "comment_count": 0, "id": 3265}, {"keywords": "", "author": "", "article_body": "A 59-year-old man from Victoria was seriously hurt when he was run over by a car in Xewkija.\nPolice said that the accident occurred in Triq it-Taflija at 8.10am.\nThe man is being treated at the Gozo General Hospital.\nThe car was being driven by a 43-year-old man from Żebbuġ, Gozo.\nInvestigations are still underway.", "comment_count": 0, "id": 3266}, {"keywords": "", "author": "", "article_body": "Court expert Martin Bajada can remain assigned to both the magisterial inquiry and the compliation of evidence in the Daphne Caruana Galizia murder case, a judge ruled on Tuesday.\nIn an urgent constitutional application filed in March 2018, lawyers for one of the three men accused with the murder - Alfred Degiorgio - argued that Martin Bajada's appointment to the case violated their client's fundamental human rights.\nMr Bajada is an IT and mobile phone expert who continues to enjoy the trust of several members of Malta's judiciary, despite having been convicted of theft and fraud back in 1993.\nMr Justice Silvio Meli quoted extensively from case law to explain that the circumstances did not pose any danger to Mr Degiorgio’s human rights and he therefore dismissed his application.\nMr Degiogio's lawyers had also objected to the fact that foreign experts had been working in tandem with IT expert Martin Bajada, in the compilation of evidence for the criminal case.\nDr Bajada had been appointed a day after the journalist’s assassination on October 16, 2017 and it was his findings which led to the arrest of 10 suspects and the subsequent arraignment of three of them, namely Mr Degiorgio and his brother George, and Vince Muscat.", "comment_count": 0, "id": 3267}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A 16-year-old girl who was allegedly the victim of sexual abuse by her cousin for seven years stood by her claims in court on Tuesday.\n“It did happen, I swear. I never lied and I will surely not lie about this matter. It hurts when I hear people speak lightly about abuse. They don’t know what abuse is,” she stressed. \nThe man, now 25, stands accused of raping his underage cousin and engaging in sexual acts with the girl over a seven-year span which ended two years ago.\nThe alleged rape took place when the girl was 10 years old.\nTestifying via video conference while her cousin, the accused, followed from an adjacent courtroom, eyes intent on the monitor and expressionless, the girl recounted the episodes which had allegedly marked her for life.\n“Mentally, the events drained me. I used to hear sad songs, sad quotes. I spent long spells crying. I occasionally cried at night pressing my face into the pillow. I faked a smile for seven years. I have a great sense of guilt. My self-esteem has suffered.”\n“Why did you wait for seven years?” asked Madam Justice Scerri Herrera.\nI spent long spells crying. I occasionally cried at night pressing my face into the pillow. I faked a smile for seven years.\n“I lacked courage and besides I feared that it would break up the family,” explained the girl as she recounted how she had made an appointment with a guidance teacher.\nMeeting a male teacher at the eighth lesson, before the ringing of the final school bell, the girl had first spoken about exams by way of gradually getting to the actual source of her troubles.\n“What do you understand by abuse?” the judge asked.\n“Being forced to do something against your will” the teen replied, adding that that was what she had been forced to do once or twice a month by her cousin, eight years her senior. She said he would tap her hand to signal his intentions.\n“Why didn’t you tell your mother or aunt?” the judge continued, prompting the girl to insist that courage had failed her and that she did not want to cause a family breakup, which was what actually happened ever since her disclosures.\nAfter recounting in detail the instances of abuse leading to the accusations against her cousin, when asked by the Judge whether she had herself made sexual advances towards her cousin, the girl’s first reaction was “I don’t remember.”\nUrged by the judge to tell the whole truth, the girl continued:\n“I don’t know what came over me that time. I dropped a hint and he touched my private parts. Then I regretted it.”\nQuestioned about her relations with her former and current boyfriends, the girl stressed that she had done none of the things she had experienced with her cousin.\nThe witness explained how she had once confided in her former boyfriend, opening up about her longstanding troubles. It was he who had urged her to speak out about the abuse.\n“Is this the truth?” asked the judge. “Yes” came the firm reply. “Do you want to take anything back?” “No,” the girl concluded.\n“It was not easy to talk the first time. But now….It’s hard but I’m trying,” concluded the witness.\nEarlier in the sitting, the girl’s mother took the witness stand, tense and visibly embarrassed when asked about the girl’s alleged ordeal.\n“I’m still shocked. I cannot believe this happened to us- Victim's mother\nNervously gripping the wooden stand, the mother declared “I’m still shocked. I cannot believe this happened to us” she said, pointing out that her daughter, a quiet, reserved child who had never caused any trouble and had never confided in her about the abuse.\nShe said that all she knew had been relayed to her by the police.\nPressed by Judge Scerri Herrera to speak about her daughter’s alleged ordeal, the woman appeared visibly uncomfortable, red-faced and agitated.\n“Abuse. Bad things. He did rude things with her. Sex eh!” she finally blurted out.\n“The girl never told me anything and I never noticed anything wrong,” the woman went on, adding that whenever she would tell her daughter to be careful when going out with her boyfriend, the girl would reassure her.\n“Don’t worry Ma. I know these things from school.”\nUnder cross-examination, the girl was asked to explain a Facebook photo of herself with the caption “I’ve got a good heart. But this mouth…”. She said: “I have a good heart, but when I’m angry I can say some things and can be sassy.”\nAsked why she had not told the magistrate about the time that she had made advances to the accused, the girl said she was under the impression that she had.\nGuidance teacher recalls first meeting\nThe girl’s guidance teacher testified about his first meeting with the alleged victim, saying she had opened up about her ordeal.\nThe guidance teacher said he had referred the matter to his superior.\nUnder cross-examination, the teacher said that before making the referral he had not been told that the girl had a boyfriend at the time, nor that she had once made a sexual advance towards her cousin some two months previously.\nThe school’s former principal counsellor also testified, explaining that she had never personally spoken to the girl but had spoken to the Child Protection Services at Appoġġ upon receiving the information from the guidance teacher.\n“Given that the girl had spoken to her teacher during a brief 20-minute session, interrupted by the ringing of the final bell, when the teacher did not have sufficient time to gauge the full details, didn’t you sense the need to investigate further before making the referral”  lawyer Marion Camilleri asked.\n“Our job is not to investigate but to create emotional and psychological support. We report to Appoġġ\" the teacher said. \n“Don’t you check whether the facts are true?” the defence pressed on.\n“Our job is not to investigate. Indeed we are bound not to investigate. Our role is to provide therapy,” came the reply.\nThe trial is continuing on Tuesday with two recorded audio-visual statements of the accused under police questioning back in November 2017 played out in court.\nLawyers Nadia Attard, Matthew Xuereb and Charles Mercieca from the AG’s Office are prosecuting.\nLawyers Franco Debono, Marion Camilleri and Anita Giordmaina are defence counsel.", "comment_count": 0, "id": 3268}, {"keywords": "", "author": "", "article_body": "A new large catamaran will be delivered to Virtu Ferries later this month, after which it will start its long journey from Tasmania to Malta to operate services to Sicily.\nThe M/V Saint John Paul II is being fitted out at the Incat shipyard in Hobart and will be handed over to Virtu on January 24.\nIts 17,780km journey to Malta will take 20 days.\nWith a deadweight of 1000 tons, capacity for 900 passengers in five lounges, and a garage that takes 167 cars or 23 trailers, Saint John Paul II will be the largest High Speed RoPax Catamaran operating in the Mediterranean and the second largest in the world.\nThe vessel’s maiden voyage will see her crossing the Indian Ocean, calling at the ports of Fremantle in Western Australia and Colombo in Sri Lanka for refuelling, before passing Somalia, at the Eastern tip of Africa, to transit the length of the Red Sea where she will call at the last refuelling port of Jeddah before entering the Mediterranean via the Suez Canal. The last leg of the journey, Port Said to Valletta, should be covered in 30 hours, Virtu said.\nThe vessel will be deployed on the Malta-Sicily route in March 2019.\nSaint John Paul II is powered by four MTU engines generating a total of 36.4 Mega Watts. These state of the art engines meet IMO Marpol Annex VI Tier II standards which regulate exhaust gas emissions, with the aim of reducing local and global air pollution. Four Wärtsilä waterjets give the vessel a cruising speed in excess of 38 knots (over 70.4 km/hour).\n\nSaint John Paul II is the fifth newbuild, and 11th high speed vessel, delivered to Virtu since the commencement of the high-speed ferry service between Malta and Sicily in 1988.\nThe vessel was built to conform to International Maritime Organisation High-Speed Craft Code 2000 and the standards of the European Maritime Safety Agency.  \nIt was named after Saint John Paul II to recall the day Virtu Ferries welcomed  Pope John Paul II on board the much smaller San Franġisk on a trip from Gozo to Malta on May 27, 1990.\nLike all other Virtu high-speed vessels, Saint John Paul II will fly the Malta Flag and is certified for international voyages by the International Classification Society.\nIn a statement, Virtu Ferries said it had invested in excess of €175 million in high-speed vessels that have, at some time, been operated on the Malta-Sicily route.\nVirtu currently also operate high-speed vessels between Venice and Adriatic ports in Slovenia and Croatia as well as Tarifa, Spain to Tangier in Morocco. ", "comment_count": 56, "id": 3269}, {"keywords": "", "author": "Ivan Martin", "article_body": "Marsaxlokk’s monti hawkers are dead set against a move to close the open air market by 3pm. \nThe association of open-air market sellers told the Times of Malta that some 300 families depended on the trade plied from the stalls along the Marsaxlokk waterfront and the curfew was a financial death sentence. \n“There are loads of families that depend on that market. Making sellers clear off by that time, just a few hours after tourists start arriving is madness,” an association member said.  \nMarsaxlokk residents will this week vote in a referendum to have their say on whether the town’s seaside open market should have a strict closing time or not.  \nMayor Horace Gauci said the vote would be held to decide on whether the monti should be made to close at 3pm, giving cleaners enough time to tidy up the mess left behind from the market stalls and still allow residents to enjoy a sunset stroll or other outdoor activities.\n“Today we have a situation where the stalls close up at sunset, and by that time the promenade is clear of stalls there is a mess and no one can enjoy the area,” he said.  \nThe mayor said the Marsaxlokk local council had recently reached a unanimous agreement that the Sunday open market along the wharf should be closed by no later than 3pm.\nMeanwhile, the hawkers’ association met yesterday after reading the reports of the planned vote. \nMaking sellers clear off by that time is madness\n“We were not informed and had no idea this was going to be happening so soon,” one seller said. \nHe later added that a meeting was being scheduled with the local council later this week.  \n“Tourists normally start arriving after noon. If we are made to clear shortly after that, there will be no time for us to make any sales,” another seller said.   \nThe referendum is set to be held this Saturday, with polls open between 7am and 7pm at the local council offices. \nMeanwhile, according to Mr Gauci, a preliminary poll has already found that most sellers had in fact agreed with the need for a strict cut off time.\nAnd, although some had raised concerns that forcing them to close at 3pm would affect sales, the council noted that most markets ended by not much later than 1pm.\nAsked how residents felt about the situation, Mr Gauci said the council had not conducted any surveys among those living in the area. However, the decision to go for a referendum was based on feedback and complaints that local councillors had received over the years. \nThe government has launched a White Paper on open markets and is receiving feedback from stakeholders until February. \nMr Gauci said the local council agreed with all the points raised in the government’s document other than the times being set. \nThe council is adamant that stalls should be put away by the afternoon to give enough for the promenade to be cleaned and enjoyed by residents and the public.", "comment_count": 27, "id": 3270}, {"keywords": "", "author": "", "article_body": "Unemployment in November was down to just 1,808, a drop of 19.5 per cent from November 2017, official data issued on Tuesday showed.\nThe NSO said registered unemployed dropped among all age groups, with the exception of those aged less than 20 years where unemployed remained unchanged.\nRegistrants for work decreased when compared to November 2017, irrespective of how long they had been registering for employment. The largest decrease was recorded among persons who had been registering for more than one year.\nThe number of persons with a disability who were registering for work decreased by 59 persons when compared to the previous year, reaching 229.\nThe largest share of men and women on the unemployment register sought occupations as clerical support workers with 18.4 per cent and 40.1 per cent respectively.\nThe unemployment rate in June 2018 stood at 0.9 per cent of the labour supply, (excluding part-time employment); 1.0 per cent for men and 0.6 per cent for women.", "comment_count": 10, "id": 3271}, {"keywords": "", "author": "", "article_body": "Two cars were destroyed in a mid-morning blaze in Ħamrun on Tuesday.\nThe blaze, at Triq it-Tram, was noticed at about 9.40am and is believed to have started in a Volkswagen and spread to a Fiat Punto.\nBoth cars were parked at the time.\nNo one was injured. ", "comment_count": 0, "id": 3272}, {"keywords": "", "author": "", "article_body": "A man was trapped by a conveyor belt while he was on duty, causing serious injuries.\nPolice said that the accident occurred at a printing press in Luqa where the man worked, at 8am.\nHe was identified as a 30-year-old Ivorian residing in Cospicua.\nThe man was hospitalised for treatment, while investigations continue.", "comment_count": 0, "id": 3273}, {"keywords": "", "author": "", "article_body": "Planning Control Applications are being abusively used in Gozo in an effort to have development allowed Outside Development Zones, environment NGO Flimkien Ghal Ambjent Aħjar has complained.\nIt said such attempts were being made by the same applicant in Xlendi and Għasri, in areas with a combined area of over 15,000sqm. The applicant wants to turn agricultural fields into apartment blocks - 'a request which under the present restrictions for the area would be out-rightly refused' the NGO said.\nA Planning Control application is a mechanism reserved for minor changes to land already within the development zone. The law specifically precludes this mechanism from being used to change the zoning of the area itself, as is being requested in these two cases, the NGO insisted.\n\"We have unfortunately already witnessed the ruin of large parts of Malta following years of rampant and unregulated development. Now it seems developers are turning their sights to the relatively untouched beauty of Gozo by means of what can be considered nothing more than 'creative' applications, in an attempt to defy existing planning regulations. Their approval would truly spell the end for Gozo and kill any chance for its sustainable development.\" \nThe NGO said it expected the Planning Authority to do its duty and screen and weed out these abominations.  \n\"If approved, these applications would make a mockery of existing planning restrictions and render the Planning Authority's role obsolete,\" it warned.", "comment_count": 18, "id": 3274}, {"keywords": "", "author": "Keith Micallef", "article_body": "The last piece of the jigsaw in the City Gate project will finally fall into place in the coming days with the inauguration of the ditch garden, which has been in the offing for more than a decade. \n However, the parking area at the far end of Lascaris Ditch will be out of bounds to the public, even when it is not being used by civil servants who have first preference for the parking bays. \nSpearheaded by the Grand Harbour Regeneration Corporation, the €5 million project has been dogged by delays and was supposed to have been ready a year ago, in time for Valletta 2018 Capital of Culture activities. \nPrior to that, however, plans for the ditch had been temporarily shelved soon after the Labour Party was elected to government in 2013. \nThe decision was taken on the grounds that the entire project incorporating the new entrance and parliament building, designed by world-renowned architect Renzo Piano, had gone over budget. \nIn July 2016, the GHRC revived the idea of transforming City Gate ditch into a public garden, this time as part of a separate project comprising the Tritons Fountain restoration and embellishment of the surrounding area. Back then, the completion deadline was set for the start of last year. \nProject supposed to have been ready a year ago, in time for V18 activities\nWhile the Tritons Fountain project was finished in time, work on the ditch garden fell behind with the deadline postponed, first to July 2018, until it was completed a few days ago. \nNamed after 16th century Italian architect Francesco Laparelli, who was commissioned by Pope Pius V to construct Valletta, the garden complements the surroundings through extensive use of Maltese hardstone.\nAccessible through a staircase and a lift next to the parliament building, the garden also incorporates the old railway bridge which used to connect the defunct Valletta station to a tunnel near Portes des Bombes. \nWhile no official opening date has been announced, it is set to be inaugurated in the coming days. \nThis was confirmed by GHRC chairman and Labour MP Stefan Zrinzo Azzopardi, in reply to questions sent by the Times of Malta.\nThe re-opening of the ditch means that a car park at the very far end at Lascaris Ditch, which can accommodate over 100 vehicles, will be accessible once again through a narrow road on the side. \nThe Lascaris Ditch parking which will be out of bounds for the public even when not in use by civil service employees who have first preference. Photo: Mark Zammit Cordina\nAsked about the parking arrangements, Dr Zrinzo Azzopardi noted that this facility would be available for public service employees holding a specific permit. \n“Security personnel will be taking care of both the security in the same area and the flow of vehicles alongside the garden,” he said. \nHowever, this parking space will not be made available to the public when not in use by civil servants, despite acute parking problems in the capital.  \nThis was confirmed by Dr Zrinzo Azzopardi, who made it clear that the area and vehicular access to it would be closed during weekends and holidays.", "comment_count": 38, "id": 3275}, {"keywords": "", "author": "Ivan Martin", "article_body": "Migrants stranded off the Maltese coast will only be allowed to disembark once EU member states agree to host them, Malta government sources said.\nSome 49 migrants have been marooned for almost three weeks on board two NGO rescue vessels just a few kilometres off Malta’s southwestern coast. \nBoth Malta and Italy have refused permission for the NGO vessels to enter harbour, but Malta last week allowed the vessels to enter its waters to shelter from rough seas.\nOn Monday, calls for the migrants to be allowed ashore continued to grow, with many using the hashtags #LetThemIn and #DontLetThemDrown.\nThe government sources however said the NGO rescue vessels, Sea-Watch 3 and Sea Eye, would only be allowed in once enough pledges for relocation were received from the 28 member states, and not before.  \n\n\nThe commission spokesman said “the swift disembarkation” of the migrants in a safe harbour was the key priority at this point.  \nRepresentatives of the 28 member states were also given a late update of the situation yesterday and the spokesman said the stalemate showed that a serious solution was urgently needed.  \nThe government sources indicated that talks were ongoing to try and relocate some 250 migrants rescued by Maltese authorities in recent weeks.  \nThe talks, the sources said, were “diplomatic but complicated” and any preliminary agreements reached so far were “fragile”.\nFielding questions from reporters, the Commission spokesman said that on a broader note, a possible rethink of some of the Union’s migration policies could also be on the table. \nAn asylum policy reform and “other pending issues” would be tackled within the context of the Council of the European Union hopefully before the upcoming European Parliament elections, he said.\nMeanwhile, the spokesman said the Commission welcomed Pope Francis’s recent call for increased solidarity, saying this was key.  \nThe Office of the Commissioner for Children has also chimed in, saying the fundamental right to health and safety should take precedence over diplomatic negotiations. This was particularly true when it came to children and unaccompanied minors.\nThe office appealed for solidarity and for “the voice of reason to prevail”, urging governments to find a solution to save lives, as well as to find a long-term strategy to prevent similar incidents from recurring.\nAndrew Azzopardi, Dean of the Faculty for Social Well-Being at the University of Malta, appealed “for common sense, decency and decorum to prevail” in what he called an unprecedented situation.\n“The Maltese government and the Maltese people are known for their high standards of camaraderie,” Prof. Azzopardi said in a statement.\n“We are morally bound to host these individuals and use our strong diplomatic presence in the EU and the UN to ensure that such situations are dealt with around the table.”", "comment_count": 0, "id": 3276}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Companies banking with HSBC have to pay a maintenance fee of up to €360 a year as from this year, with the bank defending itself, saying it had absorbed a considerable amount of the costs associated with corporate clients.\nThe fee is going to be levied across the board – although some concessions were made for particular categories. Clubs and associations, for example, will have to pay €27 a month, while sole traders and condominiums will pay €12.\nThe bank was asked whether non-profit making entities would have any concessions but the reply from the bank spokesman ignored that question, stating: “The costs of providing banking services have increased reflecting higher regulatory standards which provide benefit to the overall financial system and all those who use it.\n“These increased costs, which are tiered to reflect complexity, are reproduced in our revised banking tariff for business customers, however a significant proportion of the associated costs have been absorbed by the bank and not passed on to clients.”\nThe Malta Employers’ Association was less than impressed by the move – as well as the reason given by the bank – with director general Joe Farrugia telling the Times of Malta: “HSBC’s arbitrary decision to introduce a monthly maintenance fee on businesses, and apparently on any organisation which can be considered to be involved in any commercial activity – such as schools – is certainly not welcome by the business community. \n“The bank’s expressed intention of improving relationship with its customers through such a measure is contradictory, as what is being understood by companies is that this is just another administrative cost. It is difficult to discern any benefits to the bank’s clients arising from the introduction of a maintenance fee.”\nNo similar fees could be found on the website of the other leading bank, Bank of Valletta, although at least one other bank levies annual corporate charges.\nHowever, sources close to the commercial sector warned that it might just be a matter of time: “Once they see that HSBC has taken the plunge, they might just follow suit.”\nFee for 'parking' cash\nHSBC Bank Malta is also charging companies who keep too much cash in their accounts. It is going to charge them 0.4 per cent for ‘parking’ the money there, when the credit balance is €2 million or over in the case of financial and non-banking financial institutions, and €10 million or over for non-personal customers. \nOn this point, the HSBC spokesman said: “The EU-wide negative interest rate environment means that surplus deposits held by banks result in significant costs which are not passed on to customers. Our revised tariff will enable the bank to continue to provide these services and recover any ancillary operational costs which are incurred to in the course of providing services to financial institutions that hold accounts with us and a small number of corporate customers that hold large balances.”\nBank of Valletta's website indicates a similar fee.", "comment_count": 76, "id": 3277}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday.\nTimes of Malta reports that senior Nationalist Party officials expressed “shock” at various leaks from the personal mobile phone of their embattled party leader Adrian Delia showing attempts by Dr Delia last August to strike a financial deal for the party, using its loan scheme known as ċedoli.\nThe newspaper also reports that Marsaxlokk hawkers are dead set against the imposition of a 3pm closing time.  \nThe Malta Independent quotes Adrian Delia saying he has no intention to resign. It also reports that the European Union is coordinating efforts for a distribution of migrants stranded on and near Malta.\nl-orizzont says the government is considering offering surgeries to trans people. It also says that attacks on the Occupy Justice group have divided the PN. \nIn-Nazzjon focuses on a bad reputation Malta is gaining abroad, blaming it on the Joseph Muscat government. It also reports how a man is undergoing trial for allegedly raping his cousin. ", "comment_count": 0, "id": 3278}, {"keywords": "", "author": "", "article_body": "Four seminarians, who are currently in their fifth year of studies, yesterday asked Archbishop Charles Scicluna to officially accept them as candidates for priesthood. \nIn a ceremony held on Sunday at St John’s Co-Cathedral in Valletta during Epiphany Mass, Roderick Baldacchino and Jean-Claude Schembri from St Catherine’s Parish in Żejtun, Joshua Cortis from St Gaetan Parish in Ħamrun, and Tony Pace from the Conversion of Saint Paul Parish in Safi, publicly expressed their will to serve as priests. \nAccepting their offering “with joy”, the Archbishop called on the candidates to ensure that they would use the remaining years of their studies before their ordination to prepare themselves “to worthily receive Holy Orders”.\nOne of the four men, Mr Pace, a widower, had already made headlines in the past for wanting to become a priest after reaching the age of 60.\nIn an interview with TVM in 2017, Mr Pace, who is the father of three adult children, had said that on her death bed, his wife had urged him to get remarried, however he immediately told her that he wanted to become a priest. His son was also studying to become a priest.\nHe had said during the interview with TVM that his children were not surprised by his decision because they were used to both he and his wife doing voluntary work.\nDuring the same Mass last year, four other seminarians had taken part in a similar ceremony.", "comment_count": 8, "id": 3279}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "Embattled PN leader Adrian Delia told The Sunday Times of Malta yesterday that he put down all assets and revenue streams that he was obliged to declare in his declaration of assets to Parliament last April.\nHe maintained that he was even “more forthcoming than most” of his peers in divulging his financial affairs, although he would not be drawn into revealing his current tally of monthly income.\n“I submitted the declaration in Parliament to the fullness as obliged in law. I think I already revealed more than any other politician in the recent history of our nation, and I don’t think I should give more details,” he said in answer to a question on his current global monthly income.  \nQuestions about his income arose after the leak of court documents in his marital separation proceedings last week showed that the court had ordered him to pay his wife alimony and child maintenance amounting to €2,750 monthly, as well as his five children’s school fees – amounting to several thousand euros per term – and medical costs.\nOn top of that he is saddled with substantial monthly remortgage payments on his loans – his loans amount to around €700,000 according to a tally in last April’s parliamentary declaration.\nDr Delia pockets about €2,700 from his parliamentary remuneration, his chief publicly known income – much less than his monthly outlays. It was this apparent disparity between his known income and his monthly financial commitments – something brought into sharp relief after the imposition of relatively high maintenance payments in last week’s court decree – that triggered much chatter in political circles, including mutterings in high places within the PN.\nIt was all this talk that impelled this newspaper’s inquiries into Dr Delia’s other sources of income and whether he had omitted to declare such income in his last declaration of financial affairs submitted to Parliament.\nI already revealed more than any other politician in the recent history of our nation\nContacted on the phone yesterday, he insisted that he would not discuss the modalities of the maintenance set by the court because of the agreement in court of non-disclosure of details of the personal separation case. “But I am willing to talk about my income if you ask me questions on that,” he added.\nHe reiterated that he had not received “any income whatsoever from the party”, reaffirming his decision to forgo a party leader’s salary from the PN in the same spirit as his predecessor.\nHe explained that he has two sources of income: the ‘remuneration from Parliament’ and another deriving from what he said was the sale of his business interests in the legal firm he held, which is payable to him on a monthly basis.\n“Other than that,” he said, “I do not have any other income.”\n “And just a point of curiosity: I do not walk around with bags of €500 notes,” he quipped, referring to allegations made elsewhere this week. He said he would continue supplying all information in Parliament about his financial matters “as obligated”.\nHe also dismissed any doubts about his ability to fulfill his financial commitments by saying that if he hadn’t kept up with remortgage payments then “the bank would be after me”.\nAs for the fees imposed by the court last week – alimony, maintenance, school fees and medical costs – he said that on balance these were not costs that arose last week.\n“I was spending that money anyway to maintain my children and wife before the separation,” he explained. “So separation or not, nothing much has changed in this regard.” \nIn setting maintenance levels, the Family Court assesses the children’s lifestyle before the separation as well as the means of the parent that would be burdened with the maintenance payments.\nA maintenance is then set that would seek to maintain the children’s way of life prior to the separation while taking into consideration the regular income of the paying parent. Normally it is less than half the regular income of that parent, but there are no set formulas for calculating maintenance and each case is assessed in its own merits.\nIt also depends on the request and counter offer of the parties, particularly in the early stages of the proceedings.\nIn fact court orders on matters such as maintenance and care arrangements of children are provisional in the course of the proceedings. The Delias’ case is still at the initial ‘mediation proceedings’, not even a full-blown lawsuit yet.\n“Since I got into politics I have been very transparent about my financial matters,” Dr Delia maintained. “I know of no other politician who has been as transparent.”", "comment_count": 9, "id": 3280}, {"keywords": "", "author": "Claire Caruana", "article_body": "The year that just came to an end was “another record year” for the police, Commissioner Lawrence Cutajar said, insisting 2018 was a “success” but one during which the force experienced some “tough times”. \nThe police chief was speaking at the force’s annual award-giving ceremony, an event that commends officers who excelled in their work throughout the previous year. The ceremony is held on the first Sunday of the year at the police headquarters in Floriana.\nThe Valletta and Floriana District was given an award for cutting down crime in the area by 23 per cent, the highest when compared to all others districts.\nHome Affairs Minister Michael Farrugia, who also attended the event, said figures recently showed that the crime rate went down by 14.2 per cent in 2018 when compared to the previous year. \nAccording to Mr Cutajar, last year was one that will be remembered “forever” by police officers after a “historic” sectoral agreement was unveiled. \n“In the two-and-a-half years since I was appointed Commissioner, a lot has been done. I may one day leave the force, but the legacy I leave behind will remain,” Mr Cutajar said in his speech.\nReferring to criticism that the police force was not doing enough to combat fraud and money-laundering, Mr Cutajar said he reckoned that this – which was mostly targeted at him directly – was “unjust”. \n“I found a grossly understaffed department which now has more officers than ever before, including an assistant commissioner. From the outside, people might think that nothing is happening but this is not the case,” Mr Cutajar told those present.\nI may one day leave the force, but the legacy I leave behind will remain\nMeanwhile, during the event, police officer Simon Schembri was met with a long standing-ovation as he walked up to collect the Officer of the Year award. The 48-year-old constable lost his arm last year after he was dragged for several metres in a hit-and-run after he tried to stop 17-year-old Liam Debono who was speeding. \nThe youth stands charged with attempted murder. \nMr Schembri was also awarded a certificate of appreciation for his work.\nMr Cutajar said that Mr Schembri was awarded the title not only because of the accident, but also for his contribution after that, including his work with the newly-set up Simon Schembri Blue Light Foundation, which offers psychological as well as financial support to first responders.\nThis year marks the first time in 13 years that the Officer of the Year was selected after members of the force themselves nominated their peers. \n“This is my favourite event because not only do we recognise those who went above and beyond in their work but also because it gives me the opportunity to meet ex-colleagues,” the Commissioner went on. \nDuring the event, apart from the award to Mr Schembri, a group of police officers were also handed certificates for outstanding work. \nA good number of these, the Commissioner noted, had succeeded in stopping people who were close to committing suicide. Others were also handed certificates for their efforts to help cut down criminality.", "comment_count": 9, "id": 3281}, {"keywords": "", "author": "", "article_body": "Updated at 6.50pm\nA woman was rushed to Mater Dei Hospital on Monday afternoon after she was hit by a car on a busy thoroughfare during the rush hour.\nThe 80-year-old woman, who lives in Santa Venera, was hit by a Kia Ceres being driven by a 51-year-old Birkirkara man. \nThe incident on Old Railway Track, Santa Venera – the tail end of Birkirkara’s Psaila Street – was reported to the police at around 5.30pm. An ambulance rushed the victim to hospital while police officers cleared the incident area to limit rush hour disruption. No information about the woman’s medical condition was available at the time of writing.", "comment_count": 0, "id": 3282}, {"keywords": "", "author": "", "article_body": "The upcoming Constitutional reform should seek feedback from ordinary citizens, the Democratic Party said on Monday.\nIn a statement, Parliament's third party said its officials had met with members of the Steering Committee for Constitutional Reform on Monday, holding talks on the way forward.\nPD said it had presented its thoughts on the planned reform, which included the need for wide consultation among all entities and stakeholders.\nThe proposed reform was an electoral pledge of the incumbent Labour administration and while there has been no timeline for its delivery, preliminary talks have been held in recent weeks.\nRead: How would experts reform the Constitution?\nPD said that a specialised and technical commission of local and foreign constitutional experts should be formed to assist the convention and draft the reformed Constitution.\nA lot of time, the party said, had been capriciously lost by government and the Opposition until a first meeting was finally held last month.\nHowever, lost time should not lead to half-baked measures when reforming the Constitution.\nPD said it had forwarded 12 issues that should be addressed.\nThe party also weighed in on the Venice Commission's recent report on Malta.\nThe Parliamentary Assembly of the Council of Europe’s rule of law experts remit, PD said, should be widened to cover all aspects of the much needed Constitutional Reform.\nThe Commission recently found that Malta’s democratic structures were lacking and did not ensure proper rule of law.\nPD was represented by Deputy Leader Timothy Alden, Secretary General Martin Cauchi Inglott, PRO Marcus Lauri and Anthony Buttigieg.", "comment_count": 2, "id": 3283}, {"keywords": "", "author": "Ivan Martin", "article_body": "Intensive talks are ongoing in Brussels to find a solution to the migration impasse in Maltese territorial waters, according to the European Commission’s chief spokesman.\nMargaritis Schinas on Monday said that diplomatic efforts had been going on throughout the weekend and had continued today.\n“We are working the phones. There has been intensive contact with a number of member states which have been ongoing also during the weekend,” he said during a press briefing.\nSome 49 migrants have been stranded for almost three weeks on board two NGO rescue vessels just a few kilometres off the Maltese coast.\nBoth Malta and Italy have refused permission for the NGOs to enter harbour.\nSo near, so far. The Sea Watch sheltering off Malta.\nMalta late last month allowed the two ships, Sea Watch 3 and Sea Eye, to enter its territorial waters for shelter from rough seas, while making it clear it could not be held responsible for migrants who were rescued in areas which were not within its competence.\nContacted by radio, the crew onboard one of the NGO ships said most of the migrants were depressed, dehydrated, and the situation desperate. \nOn Sunday, Prime Minister Joseph Muscat said letting them in would set a precedent that the government was not comfortable with, while Italy has also kept its harbours closed, amid contradictory statements by its two deputy prime ministers.\nThe commission spokesman meanwhile said “the swift disembarkation” of the migrants in a safe harbour was the key priority at this point.\nBrussels will be informing the 28 member states of the latest developments later on Monday, and the spokesman said the current situation showed that a serious solution was urgently needed.\nFielding questions from reporters, the spokesman said that on a broader note, a possible rethink of some of the Union’s migration policies could be on the table.\nAn asylum policy reform and “other pending issues” would be tackled within the context of the Council of the European Union hopefully before the up0coming European Parliament elections, he said.\nMeanwhile, the spokesman said the Commission welcomed Pope Francis’ recent call for increased solidarity, saying this was key.", "comment_count": 0, "id": 3284}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A proposed farmhouse close to the protected Victoria Lines is slated for refusal as the Planning Authority this week meets to discuss the ODZ application.\nThe owners of the land in Triq Għaxqet l-Għajn, overlooking the Għargħur valley, are seeking a permit to demolish an existing disused farm and related rural rooms, and redevelop it into a one-storey farmhouse with a basement. \nThe 230 square metres site is adjacent to the location where a bomb exploded last May which almost killed Kevin Ellul. Mr Ellul is the applicant for this new dwelling. \nThe farmhouse would have an external height of 4.3 metres. Previous plans for a swimming pool seem to have been dropped in this application. Instead, the proposal is to plant 30 additional trees. \nThe plans have been in the making since 1995 when the first application for the construction of a country house with a swimming pool was made, which had been refused. A year later, there had been an attempt to reinstate the existing agricultural room but even this had been refused. It was, however, granted permission at appeals stage and only after an enforcement notice was issued for illegal works. \nTen years later, there was an application to “reinstate pre-1967 habitable rooms” but this time there was an attempt to raise the roof by one course. \nThird attempt to try to obtain a permit for a residential unit on this site\nThe case officer recommended the refusal of this application, insisting that the site on the edge of the valley was within an area designed as a listed ecological area and an agricultural area. \nHe also noted that the agricultural store approved for reinstatement in 1996 has been doubled, from the original 14.5 square metres to 31 square metres. \nHe said the proposal could not be considered further unless the illegal development is first sanctioned or removed. \nIn its objection, the Environment and Resources Authority said this was the third attempt to try to obtain a permit for a residential unit on this site. It noted that from the aerial photos some of the structures had been roofed over and other additional structures had been constructed on site without a permit.  \nERA said that the proposed development “does not respect the scale and massing of the original building” and also runs counter to a policy about the general presumption against development on crests and sides of faults, valleys and the coast.\n“The permitting of such proposal may also create a precedent for further built-up structures within this area which cumulatively would result in the uptake of land in the countryside for unacceptable urban uses, with consequential additional impacts on the rural landscape and the visual amenity of the area,” ERA said. \nNature Trust also objected to the ODZ application, saying it would lead to further similar developments in an area that lies between the scheduled Victoria Lines and the protected valley.", "comment_count": 7, "id": 3285}, {"keywords": "", "author": "", "article_body": "Fake news posts on social media featuring positive headlines about Malta to draw people in have been reported to the police, the government said in a brief statement on Monday. The websites’ Facebook posts feature photos of Prime Minister Joseph Muscat and other government figures above headlines such as ‘The government swears to boost the income of all citizens’. Clicking on the sponsored posts leads viewers to a variety of similar websites which all point to promotion pitches for cryptocurrency Bitcoin. The fake news posts have featured on local social media feeds for several weeks. \nTimes of Malta last week asked the Office of the Prime Minister to confirm it had nothing to do with the suspicious adverts and whether it would be reporting them to Facebook. No reply was forthcoming. However, on Monday the government said it had filed a police report about the fake news websites and social media posts.\n“The government takes these articles, which have fraudulent intentions and portray Malta in a negative light, very seriously,” the statement said.", "comment_count": 50, "id": 3286}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two women were arraigned on Monday after allegedly raiding rooms at a St Paul’s Bay hotel, making off with jewellery and electronic equipment belonging to guests.\nMaria Pia Zammit, a 34-year-old cab driver, and Rasha Ahmed Gado, a 19-year old, formerly employed as a carer, both residing at St Paul’s Bay, were arrested and jointly arraigned over the aggravated theft which allegedly took place on Saturday afternoon.\nThe younger of the two was also separately charged with another instance of aggravated theft which allegedly took place a few days before Christmas at the home of an elderly woman where the accused used to work as carer.\nMs Gado was further charged with breaching two separate bail decrees.\nThe two women sat at the dock, in tears throughout the hearing, as prosecuting Inspector Godwin Scerri explained how the duo had been targeted by investigators on the strength of incriminating CCTV footage from the hotel.\nThe duo had allegedly used master keys, taken from one of the chambermaids, to enter into the guests’ rooms.\nA search of the two suspects had yielded a box containing gold and silver items which investigators found had been stolen on December 20 from the residence of an 80-year old lady where Ms Gado worked as carer.\nDuring the arraignment, Ms Zammit pleaded guilty and was remanded in custody pending judgment, which is expected on Tuesday.\nHer defence lawyer, Rachel Tua, pointed out the woman’s early guilty plea, her cooperation with investigators and the fact that the stolen items had been returned to their lawful owners.\nThe other co-accused, Ms Gado, pleaded not guilty and was also remanded in custody for proceedings to continue in her regard.\nA request for bail was turned down by duty magistrate Donatella Frendo Dimech in view of the gravity of the offences, the lack of trustworthiness of the accused and the fact that the elderly victim was still to testify.\nInspector Shawn Pawney also prosecuted. Lawyer Rachel Tua assisted Ms Zammit.\nLawyers Lennox Vella and Marisa Mifsud assisted Ms Gado.", "comment_count": 0, "id": 3287}, {"keywords": "", "author": "", "article_body": "Updated 6pm\nThe fundamental right to health and safety should take precedence over diplomatic negotiations, particularly when it comes to children and unaccompanied minors, the Office of the Commissioner for Children said on Monday.\nThe office was reacting to news reports that talks were holding up the disembarkation of migrants stranded out at sea since December 22.\nWatch: Stranded migrants dehydrated, not eating, NGO says, as it defends rescue methods\n\"The office joins the Pope and other entities in appealing for all political leaders, at national and European Level, to cooperate on a humanitarian level to ensure that these migrants are brought to safety,\" it wrote.\nThe vessels off Malta. Photo: Via Twitter\nIt was referring to an appeal by Pope Francis on Sunday over the 49 migrants, in which he called on European leaders to show concrete solidarity.\nThe office appealed for solidarity and the voice of reason to prevail, urging governments to find a solution to save lives, as well as to find a long-term strategy to prevent similar incidents from recurring.\nMalta late last week allowed the migrants rescue vessel to enter its territorial waters for shelter from rough seas, while making it clear it could not be held responsible for migrants who were rescued in areas which were not within its competence.\nOn Sunday, Prime Minister Joseph Muscat said letting them in would set a precedent. Italy has also kept its harbours closed, amid contradictory statements by its two deputy prime ministers.\nThe Netherlands and Germany have indicated they are ready to take some of the migrants.\nAndrew Azzopardi, dean of the faculty for social wellbeing at the University of Malta, appealed \"for common sense, decency and decorum to prevail\" in what he called an unprecedented situation.\n\"The Maltese Government and the Maltese people are known for their high standards of camaraderie,\" Prof Azzopardi said in a statement.\n\"We are morally bound to host these individuals and use our strong diplomatic presence in the EU and the UN to ensure that such situations are dealt with around the table knowing well-enough that complex political arguments need to be made, but not at the cost of risking peoples’ lives. Trying to resolve an issue through Tweets and media releases will surely not see us through this debacle.\"", "comment_count": 0, "id": 3288}, {"keywords": "", "author": "", "article_body": "501,907 passengers used the Gozo ferries between December 1 and January 6, along with 156,343 vehicles, the Gozo Ministry said on Monday.\nThat is an increase from 464,837 passengers and 141,349 vehicles during the same period last year.\nThe statistics were announced amid public debate over whether the Gozo Channel line should have a fourth ferry to ease long queues during busy days and whether a tunnel should link the two islands.\nThe Gozo Ministry said the busiest day was Sunday, December 30, when 25,186 passengers and 5,670 vehicles used the ferries. The company operated 76 trips on the day. \nGozo minister Justyne Caruana welcomed the data, saying this influx was the result of work by her ministry to present and promote a variety of events during the Christmas period. \nSuch figures encouraged the ministry to organise more cultural events over the coming months, she added. A number of events are already being advertised on visitgozo.com\nGozo Tourism Association Joe Muscat said the Christmas period was the best for several years for Gozo businesses and accommodation establishments. \nJoe Borg, on behalf of the Gozo Business Chamber, said the ministry's Il-Milied f’Għawdex campaign had achieved its purpose.\n ", "comment_count": 11, "id": 3289}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man went on trial on Monday, accused of having sexually abused his cousin since she was seven years old.\nThe trial, the first this year, is also the first to be presided by Madam Justice Consuelo Scerri Herrera.\nThe man, now 25, stands accused of raping his underage cousin, now 16, and engaging in sexual acts with the girl over a seven-year span which ended two years ago.\nThe alleged rape took place when the girl was 10 years old.\nTestifying in the trial, presided over by the judge, without a panel of jurors, various police officers recounted how the alleged abuse had come to light only after the criminal nature of the activity had dawned upon the girl during PSD lessons at school.\nInspector Paula Ciantar, who had led the investigations leading to the arrest and arraignment of the accused, explained how the alleged abuse had taken place at the home of the victim’s maternal grandmother at Marsa where the accused resided and where the girl regularly used to spend time while her mother was at work.\nIt had all begun when one day the young man placed a hand on his cousin’s leg, sliding it up towards her private parts before stopping short of any further act.\nOther sexual activity followed at frequent intervals, culminating in one particular episode when the accused had pushed his cousin forward onto a washing machine and forced himself upon her, causing her to cry out in pain.\nThat was the only occasion where sexual penetration had taken place, the court heard.\nThe final incident before the victim had opened up with her school counsellor, had taken place when the girl was 14. She recounted how her cousin had caught hold of her hand and placed it inside his underpants.\nThis episode had taken place while the two were sharing a bed with their 7-year old twin cousins who lay between the accused and his alleged victim, such circumstances prompting the defence to question the truth behind the allegation.\nThe court also heard of one other occasion when the girl had approached her cousin and tried to touch him intimately. The man had turned down her advances on that occasion. The girl had later told the police how she had felt bad about her action.\nFollowing this incident, the abuse had allegedly ceased for a year or so, only to resume until the girl realized that what had been taking place had been wrong and decided to speak about it. \nWhen going through the details with the police, the girl had always insisted that the accused had never employed violence and that she had only realized the wrongful nature of the activity after lessons at school.\nInspector Ciantar explained that the alleged victim had been brought up in a family environment where sexual education was hardly ever discussed.\nAt one point, during the testimony of a police constable, the defence raised a point of law regarding the validity of the accused’s arrest since it was not clear when the man had been told the name of the person making the allegations in his regard.\nApparently, upon turning up at the grandmother’s flat where the accused resided, the police officers had immediately informed him of the charges without telling him the name of his alleged victim.\nFacing cross-examination in court today, a police sergeant and constable insisted they had done so since other family members had been present at the time. However, his cousin’s name had been revealed in the police car on the way to police headquarters where he was taken for questioning. \nThe court ordered a ban on the name of both victim and the accused.\nLawyers Nadia Attard, Matthew Xuereb and Charles Mercieca from the AG’s Office are prosecuting.\nLawyers Franco Debono, Marion Camilleri and Anita Giordmaina are defence counsel.", "comment_count": 0, "id": 3290}, {"keywords": "", "author": "", "article_body": "A 69-year-old was found dead inside his Għajnsielem home on Sunday evening, the police have confirmed.\nThe man’s body was found by a relative.\nThe police reached the scene at Triq il-Gleneagles just before 5pm after being alerted to the dead body by Gozo General Hospital officials.\nMagistrate Joanne Vella Cuschieri is leading an inquiry.", "comment_count": 0, "id": 3291}, {"keywords": "", "author": "", "article_body": "The nephew of former Prime Minister Dom Mintoff, Ivan Grech Mintoff, and Rebecca Dalli Gonzi, niece of former Prime Minister Lawrence Gonzi, will be contesting the forthcoming MEP elections.\nThe pair will be contesting under the Alliance for Change banner, the re-brand for the former Alleanza Bidla Party of which Mr Grech Mintoff and Dr Dalli Gonzi are co-leaders. \n“The Christian and political conflict of the 1960s divided our nation and that division is still being felt today. It changed Maltese identity and how we approach many national issues. \n“As co-founders for a new Alliance for Change, we have chosen to erase the conflicts that have existed since Dom Mintoff and Michael Gonzi presented Christ’s teaching. We are replacing conflict with unity via a common belief,” they said in a statement. \n“We are aware of our strong political legacies as nephew and niece to past prime ministers and are now ready to be personal with politics in our future. \n“As the next political generation, united in a single force, we intend to use our common force to bring to the forefront Maltese identity, values and culture. To be the very point of the spear in a much needed political reform that unites rather than divides,” the statement said.", "comment_count": 29, "id": 3292}, {"keywords": "", "author": "Christopher Scicluna", "article_body": "A private bus owner and the owner of land which was being illegally used as a bus park have been ordered to pay €9,236 in damages to the owner of an adjacent apartment which was damaged by a fierce fire in 2009.\nThe case was instituted by GasanMamo Insurance as the insurer of apartment owners Angelo and Mary Spiteri against the land owner Joseph Mifsud. His brother Emanuel Mifsud was subsequently brought into the case.\nThe court heard how the fire had badly damaged the facade of the apartment occupied by Mr and Mrs Spiteri, destroying apertures and an air conditioning unit and badly damaging electrical and water installations. \nJoseph Mifsud had denied responsibility for the blaze, saying the fire had started from the bus belonging to Emanuel Mifsud, adding that his own bus and another belonging to Nathaniel Spiteri were also destroyed.\nEmanuel Mifsud disputed the total cost of the damages and said he should not have been called into the case since he was facing separate proceedings. He also argued he was not the owner of the land.\nMagistrate Gabriella Vella observed that the fire had broken out on a plot of land at Sliema Road corner with Guze Miceli Road belonging to Joseph Mifsud. It was adjacent to a block of apartments called Stella Maris.\nPA had issued an enforcement notice\nThree buses used to be illegally parked on the land. The Planning Authority had issued an enforcement notice because of unlawful development which had seen the change of use of the land into a bus park.\nThe court heard that on the day of the blaze, a bus belonging to Emanuel Mifsud had developed faults. Nonetheless, it was used during the day and parked at 11.30pm. The fire was noticed at 2.40am. It was concentrated on this bus but later also spread to the other two.\nThe court dismissed the plea by Emanuel Mifsud that he was facing separate proceedings, saying Mr and Mrs Spiteri were not party to them.\nThe court declared that Emanuel Mifsud was responsible for damages since it was his bus which had caught fire. He had been aware for several days of the faults which his bus had, but still continued to use it, telling the driver not to switch it off because of its electrical problems. This only made the problem worse. \nHowever, the court said that Joseph Mifsud was equally responsible for what had happened because he was using his property as a bus park when he did not hold a permit to do so and when the Planning Authority had issued an enforcement notice dated October 11, 2004.\n\"It is clear from the evidence that Joseph Mifsud was making illegal use and allowing the illegal use of his property and should therefore be held responsible for the damages caused,\" the court said.\nThe court dismissed pleas about the cost of the damages caused, saying it was satisfied with the workings made by an architect and the inquiries made by the insurance company.", "comment_count": 0, "id": 3293}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A third of the self-employed in Malta in 2017 had leapt at the chance to go it alone, according to a comprehensive survey published on Monday by the National Statistics Office.\nAnd they don’t seem to be regretting their decision: 90.4 per cent of them are quite happy with their status and have no intention of changing it.\nThe NSO found that job satisfaction was quite high for both employees and the self-employed, although the latter ranked higher: 81.5 per cent of the self-employed and 73.8 per cent of employees were largely satisfied with their main job.\nIn 2017, there were 33,648 people classified as self-employed, out of 220,835 who were working. NSO figures for the third quarter of 2018 – the latest available – show that the number of self-employed went down to 33,311, while the overall workforce went up to 239,544.\nThe ability to forge their own destiny seemed to be a major consideration, with 85 per cent of them saying that they had influence over both the content of their daily tasks and the order in which they did them.\n\nThat does not mean, however, that they work any less than those who are employed: on average, full-time self-employed persons worked 46.4 hours per week while part-timers worked 24.4 hours per week. This does not seem to have been an important factor in the decision to go self-employed, however, with only 8 per cent saying that they were seeking more flexible work hours.\nThe perception of the self-employed person being a loner is also not necessarily correct. Almost 11,000 of them have employees, and nearly 23 per cent were considering hiring more workers on a permanent or temporary basis or making use of subcontractors. In many cases, however, there was not enough work to justify hiring employees (44.1 per cent). A further 40.6 per cent simply preferred to work on their own or did not want to expand their business.\nIn addition, the survey found that one in every four self-employed persons worked with a co-owner and/or in a network with other self-employed.\nWorking on your own is not without its problems, but while the main one is common across all businesses – delayed payments or non-payments by clients (16.4 per cent) – it is harder for the self-employed who fall ill and lose their income (11.9 per cent) and who go through periods of financial hardship (10.3 per cent).\n\nFinancial insecurity is one of the reason that more people are not self-employed. Around one in seven employees (14.4 per cent) were willing to work as self-employed but were held back by financial insecurity (42.8 per cent), stress, responsibility or risk (19.6 per cent) and difficulties with getting finances for the business (19.2 per cent).\nThere is also a clear gender gap in this area, with only 8.6 per cent of the women in employment being self-employed, compared to 19.8 per cent for the men.", "comment_count": 1, "id": 3294}, {"keywords": "", "author": "", "article_body": "Opposition leader Adrian Delia has been asked to retract claims that website Lovin Malta is part of a clear conspiracy against him and in an alliance with the Labour government.\nThe website's founder, Chris Peregin, said on Monday that these claims were untrue, libellous and damaging to the website's reputation.\nHe warned that failure to publish a retraction of the false claims may result in further actions against Dr Delia and the Nationalist Party’s media organisations. \nMr Peregin's statement came days after Dr Delia sued Lovin Malta for libel over a story where it said that several key protagonists of the Nationalist Party are fuming and expect him to step down to protect the party from further fallout caused by his acrimonious marital separation.\nDr Delia on Sunday warned he was prepared to sue other sections of the press in order to safeguard his reputation.", "comment_count": 7, "id": 3295}, {"keywords": "", "author": "", "article_body": "Nationalist MEP Francis Zammit Dimech has been awarded €2,000 in libel damages after a court found against former Prime Minister Alfred Sant following an interview with The Sunday Times of Malta dating back to the eve of the 2008 general election.\nThe interview was published under the heading “The only way is us.”Dr Sant had made claims about Dr Zammit Dimech which a court found were libellous.\nDr Sant had claimed in the interview that part of the kickbacks from the MTV concert contracts went into Dr Zammit Dimech's campaign. Asked for the evidence, the then Opposition leader had replied: \"It’s not evidence. It’s something that people know.\"\nWhen Dr Zammit Dimech instituted the court proceedings, Dr Sant argued that his comments amounted to fair comment in the public interest and political criticism of public administration. \nBut in its considerations, the court said that a comment could only be considered fair and in the public interest if it was substantially based on the truth. \nIn the absence of evidence to back up the alleged facts such comments were libellous, even if made in a political context close to a general election. ", "comment_count": 0, "id": 3296}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Around 30 transgender people are receiving services – ranging from counselling to hormone therapy - at the new gender clinic in Mtarfa.\nThe multi-disciplinary clinic opens its doors once a month, hosting surgeons, social workers, a family therapist, a speech and language pathologist and a psychologist.\nClients need to be referred to the clinic by their family doctor, a hospital specialist, a social worker or a psychologist.\nThose moving to Malta from abroad who are entitled to free healthcare here, also need a referral by the gender clinic in order to start receiving the required treatment that is available on the government formulary list.\nAddressing the media outside the clinic on Monday, Health Minister Chris Fearne said that universal healthcare was in line with the government's and the World Health Organisation’s policy.\nThe government had tried to address any shortcoming when it comes to accessibility and last year it focused, among others, on services for transgender people.\nMr Fearne said transgender people required a gender clinic since they had additional specific needs, such as hormone therapy and gender affirmation care.\nA press release issued later in the day by his ministry stated that 35 people were currently using services at the clinic. \nSo far public healthcare was not addressing such needs, so the government had drawn up a policy and also included treatment within the government formulary list, before opening the clinic in November.\nA transgender healthcare public consultation was held between April and June, and the final document was published on Monday.\nRead: Plan for free gender reassignment for transgender people is ‘needed’\nBack in August of 2017, the government had said it was planning on introducing free gender reassignment treatment “without delay”.\nThen last year a spokeswoman for the Health Ministry had said that the process was delayed because of consultation with NGOs, clinicians and various stakeholders on the document.\nWhat does the policy document say?\n- The Health Ministry will support awareness-raising and training for the health workforce, to render services more user-friendly for transgender people.\n- While some people officially change their name and gender to better match their identity, some do not. The Health Ministry is collaborating with Identity Malta to share such information securely to avoid misgendering .\n- The Health Ministry is proposing use of standards of care issued by the World Professional Association for Transgender Health as a starting point for the elaboration of local treatment protocols.\n- Care and services will range from primary care, gynecologic and urologic care, reproductive options, voice and communication therapy, psychological support, psychiatric care, psychotherapy and hormonal and surgical treatment.\n- To ensure that children and adolescents are appropriately cared for and to facilitate transitioning, pediatric experts also form part of the multi-disciplinary team.\n- Early use of puberty-supressing hormones may avert negative social and emotional consequences. Reversible treatment may, therefore, be considered in adolescents, ideally with parental support and involvement. Partly or fully irreversible treatment should be considered after the age of 16.\n- Health Ministry will explore further links with expert centres overseas where local members of the multidisciplinary team can acquire more specialised training.\n ", "comment_count": 0, "id": 3297}, {"keywords": "", "author": "", "article_body": "Nationalist leader Adrian Delia warned on Monday that he is prepared to go on the warpath against his opponents within his own party.\nThe message, which was relayed to Times of Malta, was sent via WhatsApp at 5am to the members of the party’s administrative council.\nIt came as The Sunday Times of Malta reported that the PN’s executive committee, its second-highest decision-making body, is set to tackle allegations of domestic abuse being made against Dr Delia.\nThe PN leader is facing pressure to resign after allegations of domestic violence were made against him by his wife in separation proceedings. There have also been potential compromising leaks of audio and video files concerning Dr Delia, some in a domestic setting. \n“Today Christmas time has ended. For most a time of peace and caring. It was alas for us a time of battle,” Dr Delia wrote in his post.Traitors who cross the line and sell their souls an instance distraught which can a nations destiny forebear\n“In war there are mercenaries who wage it merely for monetary gain. Most are so. Few, indeed very few, heroes for love of God and country. Sometimes they turn the battle and at times of rare they win the war. Eternally history lauds them. But sadly most are lost not by lack of them but by traitors who cross the line and sell their souls an instance distraught which can a nations destiny forebear.\nThe WhatsApp message sent on Monday morning.\n“We are at war no doubt remains. Most will fight and lose or win. Some will perish. Warriors few, they live to fight and win to die and hence shall live forever “The time has come. The time is now.\n“For love of God and country in here only warriors true belong,” he wrote.\nOne member who received the message replied bluntly: \"if you want war, you will get it.\"\nDr Delia has consistently vowed to stay on, branding accusations against him as part of a plan to oust him by exploiting “private life” issues. \nOn Saturday, his communications officer replied to questions over a rumour that he has considered stepping down by saying that “Dr Delia has never submitted his resignation and has no intention of resigning from the position of Leader of the Opposition and Leader of the PN”.\nPN executive committee president Mark Anthony Sammut told The Sunday Times that the allegations against Dr Delia were “very serious and should be addressed by the party organs”.\nHe said the allegations made, including sworn allegations, and footage circulating are very disturbing and some of the allegations are of a criminal nature.\nOnly about eight of the 28 Nationalist MPs are so far known to have publicly pledged their support to Dr Delia on Facebook.Article 90 of the Constitution states that if in the judgment of the President, “the Leader of the Opposition has ceased to command the support of the largest single group of members in Opposition to the Government, the President shall revoke the appointment of the Leader of the Opposition”.", "comment_count": 245, "id": 3298}, {"keywords": "", "author": "", "article_body": "A shop assistant got the fright of her life when a man wearing a hoodie brandished a weapon and held up the shop.\nThe police said that the man walked into the shop in Triq il-Wied, Balzan, at 9.30pm on Sunday and grabbed an unspecified figure of cash before running away. \nThe shop assistant, a 44-year-old Birkirkara woman, was the only person in the shop at the time. She was not hurt.\nPolice investigations are still underway.", "comment_count": 0, "id": 3299}, {"keywords": "", "author": "Claire Caruana", "article_body": "The police could not inform the people about each and every case being probed, including those of public interest, Police Commissioner Lawrence Cutajar said on Sunday when asked whether the 17 Black case was being actively investigated. \n“Every case that is referred to the police, both by individuals as well as by other entities, is investigated. Most of the time, reports that we receive from the FIAU and other entities are just intelligence reports on which we would then need to start collecting the evidence ourselves,” Mr Cutajar told the Times of Malta.\nBy law, the police must obtain information about cases independently from the anti-money laundering unit – whose intelligence reports cannot be submitted as evidence in court. \nThe Commissioner’s comments were the first since it was revealed in November that the owner of the once-secret Dubai company 17 Black was local power station businessman Yorgen Fenech. \nThe company was named in leaked e-mails as the entity that would pay money into the Panama companies of Tourism Minister Konrad Mizzi and the Prime Minister’s chief of staff Keith Schembri. \nAccording to Justice Minister Owen Bonnici, a magisterial inquiry has since been launched. \nThe Sunday Times of Malta reported last month that police investigations would only turn the spotlight on Dr Mizzi and Mr Schembri once formal confirmation from foreign jurisdictions was obtained about the ownership of 17 Black.\nAsked whether the two men were being investigated as part of the case, the Commissioner refused to give details, insisting instead that the police did not comment on specific cases and reiterated that every case referred to the force is always probed.\nWhen it was pointed out that the 17 Black case was of public interest and asked if the public deserved to know that the case was being actively investigated, the Commissioner insisted that “the police work in silence”. \n“I am saying that every case is being investigated. In some cases, you cannot go in front of the public, comment, say what you have in hand and prejudice the case. The police work in silence,” Mr Cutajar went on, complaining that he was “always being asked the same questions”. \nThe police chief’s comments echo similar ones by the officer responsible for the 17 Black case investigations, the head of the police economic crimes unit Ian Abdilla. \nLast month, he told the Times of Malta that he was not accountable to the public when asked about the apparent lack of progress in the investigation. \nApproached as he was leaving court, the officer told off the Times of Malta for chasing him, saying that he was not answerable to journalists or the public but only accountable to his boss – the Police Commissioner.", "comment_count": 67, "id": 3300}, {"keywords": "", "author": "Ivan Martin", "article_body": "Marsaxlokk residents will this week vote in a referendum whether the town’s seaside open market should have a strict closing time or not.  \nMayor Horace Gauci told the Times of Malta the vote would decide whether the monti should be made to close at 3pm, giving cleaners enough time to tidy up the mess left behind from the dozens of market stalls and still allow residents to enjoy a sunset stroll.\n“Today we have a situation where the stalls close up at sundown, and by the time that the promenade is clear of stalls, there is a mess and no one can enjoy the area,” he said. \nThe mayor said the Marsaxlokk local council recently reached a unanimous agreement that the Sunday open market along the wharf should be closed by no later than 3pm. The local vote will not be managed by the Electoral Commission, although Mr Gauci said they had consulted them and would be employing professionals to ensure all was done in accordance with the law.\nToday we have a situation where the stalls close up at sundown\nThe poll will be held between 7am and 7pm at the local council offices on Saturday. \nThis will be the first vote open to 16-year-olds, who will later this year be voting in the European Parliament and local council elections.\nAccording to Mr Gauci, a preliminary poll conducted among sellers found that four in five agreed with the need for a strict cut-off time. Although some had raised concerns that forcing them to close at 3pm would affect sales, the council noted that most markets ended by not much later than 1pm.\nAsked how residents felt about the situation, Mr Gauci said the council had not conducted any surveys among those living in the area. However, the decision to go for a referendum was based on feedback and complaints that local councillors had received over the years. \nMeanwhile, the government has launched a White Paper on open markets and is receiving feedback from stakeholders until February. Mr Gauci said the local council agreed with all the points raised in the government’s document other than the times being set.", "comment_count": 11, "id": 3301}, {"keywords": "", "author": "Ramona Depares", "article_body": "Calls have been made for PN leader Adrian Delia to step down. Ramona Depares speaks to three political observers who believe it would not be the right move, one of them insisting no one is strong enough to take over.\nAs clouds continue to gather around embattled Nationalist Party leader Adrian Delia, the voices of those who question whether a political future as head of the Opposition remains viable for the lawyer-turned-politician grow increasingly louder.\nIt is an unprecedented situation for Malta’s second biggest political party, which historically has opted for a ‘Caesar’s wife’ approach when it comes to decisions about its leadership.\nWhile past PN figureheads like Eddie Fenech Adami and Guido de Marco achieved a near cult-like status and the unquestioning loyalty of party supporters, an internal party rift has been caused by events surrounding Dr Delia’s personal and professional life.  \nWe asked three political observers for their take on the impasse, and what they believe should be the way forward for Dr Delia.\n\n‘No one is strong enough to pick up the reins’\nGeorge Vital Zammit\nLecturer in the Department of Public Policy, University of Malta\n“It is easy to make a call for the resignation of a party leader, but things do not happen in a vacuum. Were Dr Delia to resign at this point, political affairs in the country will not suspend themselves until the Nationalist party resolves its internal affairs and appoints a new leader.\nThe previous PN leader, Simon Busuttil, made the choice to step down after the Nationalist Party lost the second election in a row under his watch.\nHis decision to make way for a new leader was met with criticism from sections within the party. Many were those who felt that this course of action meant that Dr Busuttil was abandoning the party at a time when it needed him most, and without a clear way forward.\nWhen Laurence Gonzi decided to renounce his leadership, his strategy was very different. He took an active part in paving the way for a new leadership. This is because the resignation of the leader of the Nationalist Party comes with very strong implications. It is the second biggest political party in Malta, and a resignation effectively means that Malta could be left without an effective Opposition. At the end of his tenure, Dr Gonzi ensured that this scenario did not happen.\nWe need to ask ourselves what would happen were Dr Delia to resign. At this stage I do not believe that there is anyone within the Nationalist Party who is strong enough and who possesses the right skills to pick up the reins. And, as a main political player, Dr Delia cannot simply step down and leave a vacuum.\nIf you had a strong contender for the PN leadership, then a different set of considerations would come into play. But at the moment this is not the case. You could say the situation is in stark contrast to that within the Labour Party, which has invested in young people who have the potential to become promising leaders. We have a number of Cabinet ministers who are still in their 30s, and who could take up the top role within the party.\nIt is clear that Labour has laid down a succession plan, while the PN has not, which makes a sudden resignation possibly counterproductive. The situation is far from ideal and Dr Delia needs to resolve the issues that surround his leadership as rapidly as possible. I cannot envisage a situation panning out where he is leading an election with all these questions hanging over his head.\nI view the 2019 elections as a litmus test for the upper hierarchy of the Nationalist Party. This is why it is of paramount importance that all issues are resolved.\nBut, in the meantime, Malta’s government needs an effective Opposition leader to watch over the executive. Malta does not stop functioning while a political party sorts out its internal affairs.”\n\n‘Separation cases are notoriously complicated’\nLaurence Grech\nFormer editor, The Sunday Times of Malta\n“If any of the allegations that have been brought forward against Dr Delia were to be proven in court, then without a doubt his position would be untenable. However, this is not the case so far. I myself have not seen any shred of evidence regarding domestic abuse or any other allegations.\nShould a political leader resign on the strength of unproven allegations? I do not believe so. It is very easy to make an allegation; anyone can decide to fabricate an accusation against anyone. In this case, what if the allegations turn out to be unfounded? Separation cases are notoriously complicated, and there have been instances where spouses were found to have made exaggerated claims.\nIt is also worth noting that over the years many allegations covering a wide variety of issues have been made against many politicians from across all sides of the political spectrum. None of these allegations have ever led to resignations.\nI do not believe that Dr Delia should be expected to resign on the strength of unproven stories\nIf the accusations that have been made with respect to Dr Delia are ever corroborated by a court of law, then there is no doubt that he will not be able to stay on as party leader. You cannot have one of Malta’s main political players tainted in this manner. But until then, I do not believe that Dr Delia should be expected to resign on the strength of unproven stories.”\n\n‘George Borg Olivier soldiered on’\nDominic Fenech\nProfessor of History, Dean of the Faculty of Arts at University of Malta\n“No, I don’t think he should resign, and certainly not on the basis of snippets of family life that have been evidently leaked with a purpose. Those who are baying for his resignation have been wanting to get rid of him ever since his name appeared in the PN leadership contest.\nIf it were not his family affairs, they would be waiting for some other handle. After all, it’s not so long ago that his wife was being rubbished on the most personal and private level for no other reason than that she was his wife.\nHis political rivals have already shown a capacity to stop at nothing to achieve their aims, just as they did not stop after he trounced them in the leadership race. Let’s face it, this is the first time in 70 years that a losing faction in a party leadership contest has openly failed to accept the outcome, threatening every day to split their own party.\nI would say, if he has the wherewithal to absolve his political responsibilities while going through personally trying times, then there’s no cause for resignation. George Borg Olivier soldiered on when his marriage broke down under what were, for those times, very damaging circumstances.”\nCourting controversy\nThis is not the first time that Adrian Delia has courted controversy and provoked antagonism. Since he became party leader in September 2017 his tenure has been characterised by a series of allegations relating both to his professional and his personal life.\nAugust 2017Assassinated blogger Daphne Caruana Galizia accuses him of links to a London-based prostitution ring.\nJuly 2018Dr Delia creates an internal rift within the Nationalist Party by stripping former leader Simon Busuttil of his Opposition portfolio and calling for his suspension from the party. Under pressure, he reverses his decision on the latter.\nSeptember 2018Dr Delia attracts the ire of human rights NGOs following comments that the country is being “flooded with third country nationals”. The political leader later insisted on Times Talk that he is not a racist.\nDecember 2018The Sunday Times reveals that Delia is the subject of a police investigation into a money-laundering operation on the strength of a report compiled by the Financial Intelligence Analysis Unit.\nDecember 2018Women’s Rights Groups and activist groups call for Delia’s resignation after claims of domestic abuse come to light during separation proceedings with his estranged wife Nickie Vella de Fremeaux.", "comment_count": 135, "id": 3302}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta reports that a farmhouse outside the development zone on the Victoria Lines is slated for development refusal.\nThe newspaper also reports how Police Commissioner Lawrence Cutajar, when asked whether the 17 Black case was being actively investigated, said the police could not inform the people about each and every case being probed, including those of public interest.\nThe Malta Independent focuses on how Pope Francis called for solidarity with the migrants stranded off Malta on two rescue ships.\nIn-Nazzjon leads with remarks by PN leader Adrian Delia criticising the government for cheaply giving public land away for speculation while some people did not have decent housing. \nl-orizzont leads with the prime minister's declaration on Sunday that Malta cannot accept migrants which others turn away. ", "comment_count": 0, "id": 3303}, {"keywords": "", "author": "", "article_body": "A 68-year-old man from Birzebbuġa was seriously injured on Sunday evening when he was hit by a car in Mġarr Road, Għajnsielem.\nThe police said the accident happened at 6.10pm.\nThe vehicle, a Land Rover Freelander, was being driven by a 51-year-old German man. \nA magisterial inquiry is underway.  ", "comment_count": 0, "id": 3304}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some of the 49 migrants who have been stranded on the NGO rescue ship Sea Watch for almost three weeks have stopped eating and others are being treated for dehydration, the vessel's captain said on Sunday.\nContacted by radio during a press conference hosted by the German NGO in Valletta, Capt Kim Heaton-Heather said most of the migrants were depressed and the situation was getting more difficult.\nWhile the crew were trying to keep spirits high “there is only so long you can hold bad news”.\nDuring the press conference, Sea Watch spokeswoman Georgia Linardi insisted there was nothing irregular about the manner of rescue of migrants conducted by the NGO.\nShe was reacting to comments by Prime Minister Joseph Muscat who had cast doubts on the method of rescue during a radio interview earlier in the day.\nSea Watch spokeswoman Georgia Linardi.\nGoing through the rescue, Ms Linardi told Times of Malta that the migrants had departed from the Libyan port city of Zuwara. A spotter plane found them in a dinghy and the NGO deployed its ship to their location. The 32 migrants were embarked after they were found to be in distress.\nBoth Malta and Italy have refused permission for Sea Watch to enter harbour, but Malta last week allowed the vessel to enter its waters to shelter from rough seas.\nThe spokeswoman said the vessel was currently at double its capacity and the rescued asylum seekers were being accommodated in a crowded room. As the boat rocked, the migrants were \"throwing up on each other and in very difficult situation”.\nShe said the NGO had been following the EU-level discussions on burden sharing and could not believe that these human beings were being made to live in such conditions.\n\n“We want to stress we are talking about human beings here. They are aware of their situation and have even asked the captain why member states would not share them,” the spokeswoman said.\nAsked how much longer they thought the migrants could stay on board, she said it had already been far too long.\n“This is already the worst case scenario,” she said.  \nPope Francis earlier on Sunday appealed to EU governments to offer concrete solidarity to the migrants.", "comment_count": 0, "id": 3305}, {"keywords": "", "author": "Keith Micallef", "article_body": "New President, Cabinet reshuffle and Constitutional Convention\nIn six months’ time it will be exactly 100 years since the Sette Giugno riots of 1919, which are widely considered the main catalyst for the eventual achievement of self-governance in 1921. While the centenary event is highly significant, it will also coincide with the instalment of Malta’s 10th head of state, with the five-year term of President Marie-Louise Coleiro Preca ending on April 4.\nThough it is still early days, Education Minister Evarist Bartolo has already been linked with the presidency. An appointment like that would trigger a Cabinet reshuffle, as happened in 2014 when Ms Coleiro Preca was nominated. There is mounting speculation that former tourism minister Edward Zammit Lewis – who nearly missed out on re-election in 2017 and was saved by a casual election – is the first in line for a promotion to Cabinet. \nWhile Malta’s Head of State is largely a ceremonial figure, the next President’s legacy could be a lasting one, as he or she is expected to pilot the process leading to the “Second Republic”. Attempts to overhaul the 1964 Constitution have been in the offing since 2013 but it was only late last year that a steering committee, comprising representatives of the two major parties, was formed.\nMore changes in Cabinet are probably in the pipeline, as 2019 will also bring to an end the term of the EU’s Juncker Commission, meaning that the Maltese government will have to nominate Karmenu Vella’s successor. This could pave the way for the exit of another senior Labour politician, possibly Equality Minister Helena Dalli.\nAdrian Delia and the PN’s future\nIf he lasts that long, the May elections could be do or die for Adrian Delia, after less than two years at the helm of the party. While it is an open secret that he does not enjoy the full support of party members, a bad showing in next May’s election would erode his position even further and boost calls for him to resign.\nEducation Minister Evarist Bartolo has already been linked with the presidency\nUnfortunately for Dr Delia, scepticism over his political future does not only relate to his leadership qualities: questions have been raised about his integrity and personal life. Having started on the wrong foot from the very moment he entered the PN leadership race in the summer of 2017 – when he had to battle money laundering claims by slain journalist Daphne Caruana Galizia – he is still facing questions. While Dr Delia has strenuously denied any wrongdoing, the recent revelation by this newspaper that he is under police investigation over the matter has started to dent his credibility even among his most ardent followers.\nAs if this was not enough, the PN leader is also facing calls to resign over domestic violence claims, levelled over the Christmas period by his estranged wife Nickie Vella de Fremaux.\nMany, even from within the PN, are of the opinion that a political party whose leader is constantly having to fight fires on various fronts stands no chance at the polls, even more so in the PN’s dire situation. Yet, Dr Delia is resolute about forging ahead.\nIronically, the dim prospects for May’s elections seem to have turned in his favour as it has so far discouraged any serious contender for the leadership from coming forward. However, the escalation of issues surrounding his marital breakdown has made the situation very volatile.\nWith senior PN officials admitting that the party is no longer functioning, it may not be long before the issue comes to a head. If not, Delia will have the daunting task of achieving the seemingly impossible: making inroads into Labour’s commanding lead in May. Or find himself in even hotter water.\nMEP and council elections\nThe political highlight of the year is expected to be the European and council elections scheduled for May 25.\nNormally, expectations for the party in government in democratic countries would not be very high, as mid-term elections usually result in some losses and are more about damage limitation than anything else. However, Malta seems to be an exception, as every single opinion poll carried out since the 2017 general election indicates that the PL could well widen the already huge gap between the two main parties. While Prime Minister Joseph Muscat has been trying to play the underdog card, it is more than plausible that his party will win four out of the six European Parliament seats up for grabs, as things stand.\nWhile such a result would be another feather in Dr Muscat’s cap, it would further diminish the Nationalist Party’s electoral prospects, at least for the immediate future. It would mean that despite having changed leaders twice, the PN has made no inroads after six years in Opposition.\nIs it curtains for Opposition Leader Adrian Delia (left) and Prime Minister Joseph Muscat this year? Or will they both still be around in 2020?\nIs the PM still intent on calling it a day?\nIronically, a convincing result for the Labour Party could also result in Joseph Muscat bowing out of politics. Having repeatedly declared he has no intention of contesting the next general election, there would be no better time to pass on the baton than with his party enjoying more popularity than ever. Yet, he is still facing calls to stay on, sometimes publicly, as was the recent case of his predecessor Alfred Sant.\nShould Dr Muscat resign, a hotly contested leadership race is on the cards. While one of the expected contenders, Deputy Prime Minister Chris Fearne, would appeal to the moderate faction, Transport Minister Ian Borg is also touted to be strongly interested in the position and his stock with the grassroots is rising. However, as the saying goes, where two are fighting, the third wins, which in this case could spell good news for another potential contender, MEP Miriam Dalli.\nCorruption – 17 Black, Macbridge\n2018 was the year in which Joseph Muscat claimed victory in the Egrant saga, as a magisterial inquiry concluded there was not enough evidence to support claims that he or his wife Michelle owned this secret Panama company.\nYet, the government’s reputation of bad governance and corruption suffered another blow in November when damning evidence emerged involving Minister Konrad Mizzi and the Prime Minister’s chief of staff Keith Schembri. The Times of Malta and Reuters revealed that the owner of Dubai-based company 17 Black – which planned to deposit $2 million in the accounts of secret Panama companies owned by Mr Schembri and Mr Mizzi – was Yorgen Fenech, the chairman of the consortium chosen by the government to build the new power plant in Delimara.\nThe link prompted even more calls for the Prime Minister to take action, given that Mr Schembri and Mr Mizzi, who deny any wrongdoing, persistently refuse to consider stepping down. \nLabour’s already weak reputation for fighting corruption would be further eroded\nHowever, there could be more dark clouds on the horizon. Apart from 17 Black, leaked emails uncovered in this joint investigation by Times of Malta and Reuters showed that there was also another company by the name of Macbridge, which was also identified as a source of funds for the companies owned by Mr Schembri and Mr Mizzi.\nThe identity of Macbridge’s owner has not yet been established. However, if it were to be somehow linked to the power station project or any other member of government, Labour’s already weak reputation for fighting corruption would be further eroded. In the hypothetical scenario of this happening following Dr Muscat’s departure, it would not bode well for Mr Mizzi because the Prime Minister, who has been a staunch defender of his, would no longer have the final say.\nMeanwhile, three other pending inquiries could have very serious repercussions for Labour. These relate to allegations that Mr Schembri received kickbacks from the sale of passports, another that involves him and former Allied Newspapers managing director Adrian Hillman in money laundering claims, and a third into Panama Papers revelations. The latter is yet to start due to legal challenges mounted by the ‘defendants’, including Mr Schembri, who objected to this probe taking place.\nThis year will also mark the second anniversary from the assassination of journalist Daphne Caruana Galizia. While three persons were charged in December 2017, the masterminds are still at large.\nRoadworks will continue to disrupt traffic flows. Will it all end in a happier driving experience?\nRoadworks galore\nAway from politics, 2019 will see many more of the country’s arterial roads turned into construction sites, as a number of large-scale infrastructural projects get underway, hopefully alleviating traffic congestion.\n Apart from ongoing works on the multi-level junction near the Addolorata Cemetery, the next 12 months will see the completion of Tal-Balal Road, the reconstruction of the Valley Road bridge in Msida, the widening of Triq Buqana between Rabat and Mosta, and probably the start of the controversial Central Link Project between Attard and Mrieħel.\nHaving so many concurrent projects risks bringing the island to a standstill, unless there is a comprehensive traffic management plan in place to minimise disruptions. Meanwhile other large-scale projects like the Santa Luċija tunnel and the Malta-Gozo Tunnel are already in the pipeline.\nNo-deal Brexit?\nFrom an international perspective, the UK’s departure from the EU may affect Maltese consumers, especially if there is no deal. This scenario would mean the imposition of tariffs on imports from the UK, which would result in higher prices.", "comment_count": 6, "id": 3306}, {"keywords": "", "author": "Ramona Depares", "article_body": "As smaller businesses make way for a parade of homogenous bars, and the original community continues to dwindle, Ramona Depares asks whether the soul of our capital city has been sold off together with the development permits.\nIn December 2016, when the drive towards creating new business opportunities in Malta’s capital showed every sign of steady increase, a government strategy was launched to ensure that Valletta retained the image and identity that had made it deserving of the much-coveted UNESCO World Heritage title.\nSt Ursola Street, October 1995.\nThe strategy was intended to kickstart a process of social regeneration that would encourage people to live in Valletta.\nBut, as the centre of the city continues to be taken over by a parade of homogenous bars and restaurants, residents are complaining that two years down the line the strategy has failed in achieving its goal, and that the community spirit is being eradicated.\nIt is difficult to fault the naysayers. Writing as someone who has lived both sides of the coin – I was born and raised in Valletta and, to a limited extent, I also appreciate the new life the last decade brought with it – the outcome of the so-called ‘regeneration’ is both obvious and inevitable.\nValletta appears to be on a fast-track to becoming a cold and soulless city, populated only by revellers and an ever-changing parade of anonymous residents.\nAnd, although the influx of new residents includes a small number of young families, these have very little opportunities to bond with the original community of Beltin that is dying out fast.\nEven the shortest chat with a few of the original families is likely to yield a refrain repeated across the corners of the city. From l-Arċipierku across to il-Kamrata, id-Diju Balli, Puturjal and il-Mandraġġ, the few remaining resident families are likely to disagree on everything, from which political candidate they support to which patron saint’s xalata to attend.\nBut, on one point, they will nod in agreement: the Beltin are no longer wanted in their own city.\nThis is a point that Holger Camilleri, 33 years old and hailing from one of the original families of Valletta, has discussed at length with friends and family. He has seen Valletta change to a more commercial city over the last three decades, and believes that this has been achieved at the expense of “kicking aside its soul – the residential part”.\nToday, Valletta is alive and buzzing, but nobody seems to actually live in the city\n“We expect evolution to take us to a better place from all aspects, but in Valletta it started and stopped with the commercial side. We have not seen it happen from a residential perspective. Business owners and developers need to keep in mind the families that kept the heart of Valletta beating through the years,” he says.\nThis lack of respect towards the original communities is a story that has repeated itself across many cities across Europe.\nSt Zachary Street, June 2009\nIn London, residents of Shoreditch, Hackney and Brixton found themselves priced out of their homes during a regeneration process that took place between 2004 and 2015.\nToday, these areas are major tourist hubs. But, while they are no longer classed among the poorest areas in London, the flipside is that local residents and traders have been pushed out of their homes and communities.\n“I do believe that the intentions behind the changes are good, but there needs to be a properly enforced plan to conserve the character of the city. If residents were to be consulted, the change will be for the better, as it will touch the soul of the city. Valletta is made by its people,” Mr Camilleri concludes.\nArtist James Vella Clark is another Belti who concedes he has witnessed a number of positive developments – he mentions the restoration of buildings, the rediscovery of the city and the influx of new people.\nBut he remains also wary about the commercial aspect gaining the upper hand when it comes to prioritising strategies.\n“There is a renewed sense of pride among the newer generation of residents. But this constantly clashes with the many business interests. There is no balance between the needs of the residents and the influx of so many cars, businesses, tourists and leisure seekers.\n“Valletta’s needs are unique, because it is the administrative city and it’s the heart of tourism activity. Residents have to co-exist with all this. There are moments when I feel too stifled. Valletta has been reduced to a cash cow,” he laments.\nAnd, while he does not believe that the community of people is dying, he does feel that the community spirit is dying.\nSt Christopher Street, September 1998\n“The demographics have changed so much, in such a short span of time within a confined locality. The culture clash between the old community and the newer one is even more evident now. When such a cultural divide exists, it is very difficult to aspire to a sense of unified community,”Mr Vella Clark says, adding that although all localities experience this in some way, in a small community such as Valletta this is more evident.\nMuch like everyone I speak to, photographer David Pisani –  who is currently exhibiting a collection of 192 works that make up a visual documentation of the city – recognises the need of a living city to evolve.\nBut, he says, this should not be at the expense of the community that lies at its heart.\n“Change in any city is both inevitable and desireable. In the case of Valletta, the infrastructure was crumbling and the residents were slowly leaving. This was the point where a surge of restoration projects began,” he points out.\nHowever, he believes that not enough was done to stop residents from leaving.\n“For me, the biggest change was in the demography, not in the buildings themselves. Today, Valletta is alive and buzzing, but nobody seems to actually live in the city,” he claims.\nMr Pisani’s love affair with the city is a long-standing one. He started taking photos in Valletta in 1982, aged 17. At the time, he had no idea that the project would grow into an extended photo essay.\n“I just loved being in Valletta and roaming through the streets. Despite the fact that Valletta wasn’t looking its best, I found it very beautiful, even in the decay,” he reminisces.\nIt was to be a lengthy documentation process, with the photographer spending a lot of time in the bars on what he calls “the lower, less reputable parts of Valletta”.\nIt was this bond with the city that gave birth to what, at first, was an unstructured journey, the only wish of the photographer being to record what he was living at the time.\nIn time, the journey developed its own path towards documentation in an organic manner, and Mr Pisani found his natural inclination taking him to particular areas within the city.\n“The works focus particularly on the socially deprived areas. Yes, they were socially difficult areas but they were alive,” he tells me.\nThe culture clash between the old community and the newer one is even more evident now\nThis was at a time when the drive towards regeneration had not yet started, and theatre-goers would have been very hard pressed to find somewhere to have a bite once the clock hit 9.30pm.\nIt was also a time when outsiders would claim that the capital city was empty after dark, a claim that anyone with inside knowledge of the local community is fast to rebut.\nAs a teenager growing up in Valletta, I would certainly have been greeted by very confused looks had I tried to hunt for an Aperol Spritz – today ubiquitously advertised outside every single bar and restaurant.\nBut the local communities that congregated in the tiny corner shops, selling cheap shots of whisky and fortified glasses of tea, were there if you knew where to look for them.\nOld Bakery Street, June 2007\nThis is also Mr Pisani’s experience of the city: “People who claimed that Valletta was dead at night never ventured further down than Pjazza Reġina. It was very alive, even if not in the best of ways. If ever there was an identity, it was with the Beltin,” he says.\nMost of the locations photographed by Mr Pisani do not exist anymore, or have been renovated beyond recognition.\nMeantime, the result of his photographic documentation is currently showing at Spazju Kreattiv under the title Vanishing Valletta. Part of the collection was originally shown in Paris back in 1996; the feedback it garnered inspired him to take a more systematic approach in order to grow the collection.\nSince then, Vanishing Valletta has been shown in several art institutions overseas, while in France it forms part of the permanent collections of the Bibliotheque Nationale de France.\n“I wanted to show this collection in Malta because I felt that Valletta deserved to see it.  However, so far there is no museum or art institution in Malta that owns a part of this collection,” he adds.\nSmall consolation though it is, the Beltin can take comfort in the knowledge that the soul of their disappearing city lives on in a museum in France.", "comment_count": 31, "id": 3307}, {"keywords": "", "author": "Sarah Carabott", "article_body": "“I am not, and I don’t want to become, another Dun Ġorġ Grima.”\n That’s one thing Fr Alex Cauchi makes amply clear early in our interview.\n“He was one – the founder of the movement. I’m simply keeping his legacy alive as its director.”\nThis is not the first time since taking on the directorship that Fr Cauchi has had to explain what an enormous feat it would be to fill the shoes of Fr Grima, whose missionary work spanned 40 years.\nFr Cauchi, who turns 49 on Monday, has returned to Malta after 22 years in Brazil and Peru. His mission here is to make sure the movement’s wheel continues to turn, after slowing down slightly following Fr Grima’s demise.\nAmong its major projects, Ġesu fil-Proxxmu (Jesus in Thy Neighbour) feeds 23,000 children taking part in education programmes in Brazil, Kenya and Ethiopia, and has built several dwellings, schools and hospitals, its latest being a centre for children with disabilities in Ethiopia.\nGozo-born and raised, Fr Grima embarked on his missionary work in 1977 in Brazil, founding the movement a decade later. He passed away in September 2017 after undergoing heart bypass surgery.\nSince then, donations have declined while expenses are ever on the rise.\nFr Cauchi observed that the most loyal benefactors had kept up their donations but others seemed to be getting cold feet and some thought the movement had died with the passing of Fr Grima.\nAs things stand, the movement’s outlay is higher than its revenues. Its feeding programme alone costs €80,000 a month.\nAll beginnings are difficult, and I’m taking it day by day\nFr Cauchi said a request for assistance was made to him by Fr Grima in July of 2017, only a couple of months before he passed away. The younger priest had promised to return the following summer and spend a year with Fr Grima to learn the ropes and understand whether he could take on the role.\nBut that decision was made for him. That September, he was asked by Bishop Mario Grech to assume the directorship of the movement.\nHe has since visited the movement’s projects in Africa and believes there is huge potential to turn things around in Kenya and Ethiopia, where the situation is similar to that of northeast Brazil 50 years ago. In Africa, he says, people are willing to work and the tourism industry, among others, is picking up, creating new jobs.\nInspired by the work of the Church in Brazil, where the poor are empowered rather than simply assisted, he hopes that small initiatives in the African countries will kick off sustainable projects.\n “We plan to provide residents with brick moulds and cement, so that they can produce bricks for the movement’s own projects, rather than resorting to buying them off a producer from a faraway city,” he explained.\n“This way, the residents can learn a skill and start their own business, becoming self-sustainable.”\nWhen it comes to donations of animals like cows and sheep, the movement would be tying the beneficiaries to providing the diocese with a calf or a lamb, which would then be gifted to another family in need.\nBy empowering people to become self-sustainable, they would in turn become less dependent on the movement, and the organisation could then move on and focus on other areas in need, he says.\n“All beginnings are difficult, and I’m taking it day by day, believing, as Dun Ġorġ did, in providence.”\nStill, he is well aware of the fundraising difficulties faced by smaller charities like the movement.\nHe has started networking with Maltese migrant benefactors in Australia, Gibraltar, and the movement has opened two charity shops on Triq l-Ewropa and Pjazza Savina in Victoria – a concept that has gone down well with residents and visitors.\nVisit www.gesufilproxxmu.com or call on 2155 6453 for more information about how to help out the organisation. Donations can also be made by SMS on 5061 7365 for €2.33, 5061 8083 for €4.66 and 5061 8933 for a donation of €6.99.", "comment_count": 1, "id": 3308}, {"keywords": "", "author": "Claire Caruana", "article_body": "Police officer Simon Schembri was met with a long standing ovation on Sunday morning as he walked up to collect the Officer of the Year title during the force’s annual award-giving ceremony.\nThe 48-year-old traffic policeman lost an arm last year when he was dragged several metres under a car in a hit-and-run after he tried to stop 17-year-old Liam Debono, who was over-speeding in a Mercedes. The youth stands charged with attempted murder and is out on bail after pleading not guilty to the charges.\nMr Schembri was also awarded a certificate of appreciation for his work.\nSpeaking during the event, Police Commissioner Lawrence Cutajar said that Mr Schembri was not awarded the title only because of the accident, but also for his work after that, including his work with the newly-set up Simon Schembri Blue Light Foundation, which offers psychological as well as financial support to first responders.\nThis year marks the first time in 13 years that the officer of the year was selected after the members of the force themselves nominated their peers.\n“This is my favourite event because not only do we recognise those who went above and beyond in their work but also because it gives me the opportunity to meet ex-colleagues,” the Commissioner went on.\nDuring the event, apart from the award to Mr Schembri, a number of police officers were also handed certificates for work that stood out last year. A good number of these, the Commissioner noted, succeeded in stopping people who were close to committing suicide. A number of others were also handed certificates for their efforts to help cut down criminality.\nThe Valletta and Floriana District was also handed an award for cutting down crime in the area by 23 per cent, the highest when compared to all others districts.\nOn his part, Home Affairs Minister Michael Farrugia, who also attended the event, also commended Mr Schembri for his resilience after the devastating accident. According to the minister, latest figures he received recently showed that the crime rate went down by 14.2 per cent in 2018 when compared to the previous year. He also referred to a study by Eurostat which showed that trust in the police had shot up in recent months.", "comment_count": 1, "id": 3309}, {"keywords": "", "author": "", "article_body": "Pope Francis on Sunday issued an appeal for effective solidarity by European governments with 49 migrants stranded on two ships which are sheltering from rough seas off Malta.\nIn remarks following the Angelus at St Peter's Square, Pope Francis said: \"49 persons rescued from the Mediterranean Sea have been aboard two NGO ships for several days, seeking harbour for disembarkation. I urgently appeal to European leaders to show concrete solidarity with these people.\"\nMalta late last week allowed the two ships, Sea Watch 3 and Sea Eye, to enter its territorial waters for shelter from rough seas, while making it clear it could not be held responsible for migrants who were rescued in areas which were not within its competence. On Sunday, Prime Minister Joseph Muscat said letting them in would set a precedent. Italy has also kept its harbours closed, amid contradictory statements by its two deputy prime ministers.\nThe Netherlands and Germany have indicated they are ready to take some of the migrants.\nMalta has been involved in diplomatic efforts being made by the European Commission for the migrants to be disembarked and distributed among several EU countries. Malta is also calling for 249 other migrants, rescued by the Maltese armed forces and landed in Malta, to also be distributed among several EU countries.\nLast week, the bishops of Malta and Gozo wrote to European bishops urging them to insist with their governments on action to help migrants stranded at sea.", "comment_count": 60, "id": 3310}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some sections of the media were harming the country, Opposition leader Adrian Delia said on Sunday, standing by his decision to sue a media organisation that reported details about his marital breakdown and the ensuing political fallout.\nSpeaking during an interview on the Nationalist Party’s NetFM, Dr Delia said a “small part of the media” seemed to be engaged in a coordinated attack against him which coincided with him climbing in the polls.\n“I respect the truth, and have always opened my doors for questions to be asked by the media. But unfortunately, in recent days there have been articles that happened to coincide with the PN climbing in the polls.”\n“All of a sudden a part of the media launched a personal campaign when they knew I was going through personal issues, when they knew my wife and I had agreed to keep these issues private. Part of the media, working in cahoots, has engaged in mudslinging at Adrian Delia, at the Delia family, and at the PN,” he said.\nDr Delia said these sections of the media claimed to be working in the best interest of the country, but were actually dancing along to the Labour Party’s tune.\nHe said that while he may be accused of bullying the media through his decision to seek legal recourse against Lovin Malta, he would not stand down and allow untruths to be spread. He would also take the same position with any other media house, he warned.\nCorinthia project\nDr Delia also weighed in on the controversial Corinthia hotel development.\nTimes of Malta last month reported how the Corinthia Group will be paying the government just €17 million to build up to 100,000 square metres of residential and office property in St George’s Bay.\nSources indicated that the piece of land carried a current market price tag of at least €700 million.\nThose struggling to buy a property, get a home loan, or even just rent somewhere to live, were finding it difficult to keep up. The government, meanwhile decided to give prime land to the private sector for a pittance,Dr Delia said. The people would ultimately judge this deal that was coordinated by Minister Konrad Mizzi, he said.\nV18\nAsked about the conclusion of Valletta’ stint as European Capital of Culture, Dr Delia said it had become clear that this had not been about the arts and culture, but about fattening the pockets of a select few.\nTimes of Malta reported how more than 280 direct orders were handed out to individuals and companies in the first six months of last year.\nV18, Dr Delia said, had given nothing to culture but had given millions to friends of the current administration.\nBitcoin\nFinally, Dr Delia referred to financial services operators’ concerns on a dip in Bitcoin value.\nWhile he would not speculate on matters like this – insisting he would leave that to others who often spread \"fake news\"– Dr Delia said he was concerned that the government had remained worryingly silent on the future of Cryptocurrency.\nAfter months of campaigning for Malta to be considered “the Bitcoin Island”, the government was dead silent on the future of this volatile asset.\nInvestors, he said, deserved to know what the government’s position was.", "comment_count": 65, "id": 3311}, {"keywords": "", "author": "Ivan Martin", "article_body": "Prime Minister Joseph Muscat said on Sunday that he did not want to set a precedent by letting in a group of migrants stranded on board NGO rescue boats just off the coast of Malta.\nSpeaking during a brief telephone interview on the Labour Party’s ONE radio, Dr Muscat said it would be the easiest thing to play the part of the “Christmas saint” and allow the group of migrants to disembark on the island, but this would open the island to becoming a Mediterranean disembarkation centre for refugees stuck at sea.\nThe migrants were rescued off Libya by the MV Sea-Watch 3 and Sea Eye on and around December 22 but 49 people remain stranded on board, sheltering from rough weather just three miles off Malta, sparking diplomatic spats at EU level over who should assume responsibility for them.\nMeanwhile, Dr Muscat said he did want to set a precedent with the European community on what should happen in such scenarios.\n\"We need to find a balance between the human aspect and the national security. This is an issue that might set a precedent and we should be vigilant about it. It is easy to play the Christmas Saint with everyone, but then come January, February and the summer period we would be told to do the same.\"\nHe said that while others are making an issue with accepting 30 or 70 migrants and closing their ports, Malta has accepted to rescue 249 persons without protest.\n\"If one would accept to disembark the two NGO vessels without making things clear from the outset, the bullies would have won, while the countries like Malta who respect the laws and save lives would end up being the victim, said the prime minister.\n“That is why we are stressing that we do not want this case to set a precedent. In fact, we are discussing with other countries and the European Union to tell us whose responsibility this case was and in case a similar case happens, who takes responsibility,” Dr Muscat said.\nHe reiterated the government’s position that Malta would not be held responsible for those rescued outside its jurisdiction and competence.\nThe Prime Minister also raised doubts about the rescue methods employed by the NGOs, saying he would not get into this issue on air as it would take too long.\n“There are many different opinions on the dynamics of these rescues and how they were conducted but I won’t get into that here,” he said.\nEarlier in the interview, Dr Muscat made glancing references to the year ahead, saying it would see revolutionary changes in a number of sectors.\nSixteen-year-olds would be voting in local and European Parliamentary elections, and the government would be investing heavily in a number of sectors, from national security to recycling, he said.\nItaly's Salvini insists Italy will keep its ports closed\nMeanwhile, Italian Interior Minister Matteo Salivini on Sunday again reiterated in a tweet that Italy would keep its ports closed to the migrant rescue ships. \nItalian ports are and will remain closed for those who do not respect the laws, he said.\n\n\n\n ", "comment_count": 0, "id": 3312}, {"keywords": "", "author": "Keith Micallef", "article_body": "The PN’s executive committee, its second-highest decision-making body, is set to tackle allegations being made against party leader Adrian Delia.\nPlans to convene the committee to discuss the way forward were confirmed by its president Mark Anthony Sammut. No date has yet been set for the meeting.\nThe development comes 10 days after allegations of domestic violence, made against Dr Delia by his wife in separation proceedings, went public after the leak of court documents.\nThere have also been compromising leaks of audio and video files concerning Dr Delia, some in a domestic setting.\nThe developments are putting an enormous strain on the party, which is split across all levels, from parliamentary group down to the grassroots, over whether Dr Delia’s position is tenable and whether he should resign.\nA defiant Dr Delia has vowed to stay, branding the accusations part of a plan to oust him by exploiting “private life” issues.\nREAD: Adrian Delia insists he will \"persevere\" in 2019\nOn Saturday, his communications officer replied to questions over a rumour that he has considered stepping down by saying that “Dr Delia has never submitted his resignation and has no intention of resigning from the position of Leader of the Opposition and Leader of the PN”.\nUntil Saturday there had been no sign that the party’s higher structures, which include the executive and administrative committees, had been brought into the picture, amid continued efforts by members of the leadership to play down the controversy.\nHowever, now that the issue is set to go on the executive committee’s agenda, Dr Delia’s position cannot be considered safe.\nAsked if the present situation was sustainable, especially with the European and council elections looming, Mr Sammut admitted that the allegations against Dr Delia were “very serious and should be addressed by the party organs”.\n“I am awaiting that matters raised are addressed in the party organs and I will see that the executive committee is convened in due time, and we [will] then take it up from there,” he said.\nThe fact that two-thirds of the parliamentary group do not stick their necks out for Dr Delia carries huge significance\nFar from adopting a business-as-usual attitude, the high-ranking party official admitted he was “very worried” about the situation.\n“The allegations made, including sworn allegations, and footage circulating are very disturbing and some of the allegations are of a criminal nature,” he said.\nMr Sammut is among those in the party who subscribe to the view that this saga is doing the PN no good.\n“The party should not be dragged into quarrels which are definitely harming it and which are outside of its control.”\nMeanwhile, PN sources said that there is a growing sense of discontent even among those who until a few weeks ago were staunch supporters of Dr Delia.\nSupport from his parliamentary group is crucial. However, while none of them have gone public to express lack of confidence in him, only about eight of the 28 Nationalist MPs are so far known to have publicly pledged their support on Facebook.\nThe fact that two-thirds of the parliamentary group do not stick their necks out for Dr Delia in the circumstances carries huge significance\n“The fact that two-thirds of the parliamentary group do not stick their necks out for Dr Delia in the circumstances carries huge significance,” one party source said, adding there was the remote possibility of entering uncharted territory in terms of the Constitution. \n “We could be heading towards a situation in which the PN leader and the Opposition leader are two separate MPs. If that were to happen Dr Delia’s days at the helm of the party would be numbered.”\nArticle 90 of the Constitution states that if in the judgment of the President, “the Leader of the Opposition has ceased to command the support of the largest single group of members in Opposition to the Government, the President shall revoke the appointment of the Leader of the Opposition”. \n “The party is no longer functioning. No wonder Dr Delia ranks as the PN leader who enjoyed the highest support ever among Labour Party ranks,” another source told this newspaper.", "comment_count": 169, "id": 3313}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta reports that PN’s executive committee is totackle the allegations being made against party leader Adrian Delia. Plans to convene the committee were confirmed by its president Mark AnthonySammut. No date has yet been set.\nThe newspaper also quotes the archbishop saying the migrants issue is a test of civilisation. Mgr Charles Scicluna made his remarks when he visited the NGO rescue ship Lifeline.\nThe Malta Independent quotes Parliamentary Secretary Aaron Farrugia, who is responsible for EU funds, saying that corruption allegations have not changed the way the EU looks on Malta. The newspaper also says former Foreign Minister George Vella is favourite to be appointed the next president of Malta.\nMaltaToday reports that the EU has watered down its threat on Malta's passports scheme. It also says that President Marie-Louise Coleiro Preca is expected to continue to head the constitutional reform committee after she steps down in April.  \nIl-Mument looks at a year of non-stop work by Adrian Delia. It also reports that the Commissioner for Voluntary Organisations is investigating Occupy Justice. He is looking into why the group has not registered as an NGO, how it is collecting funds, and what is happening to them. \nIllum says several PN insiders want PN leader Adrian Delia removed before the European Parliament elections in May, but he is certain to stay. \nIt-Torċa says Malta Airport has an emergency plan to deal with drones. It also focuses on the need for tests for drugs taken by motorists.\nKullĦadd says rivals of Adrian Delia are claiming that Dr Delia twice offiered to resign.\n ", "comment_count": 0, "id": 3314}, {"keywords": "Gozo", "author": "", "article_body": "Ġustizzja bi Tbissima, Stejjer Umoristiċi is a new publication by Tonio Borg. The book, published by Kite Group, was launched at the Gozo Law Courts in Victoria with an introduction by Magistrate Paul Coppini.\n\nThe book deals with more than 160 anecdotes involving judges, magistrates and lawyers. Some of the anecdotes were passed from generation to another but they were never published before. The voluminous book also includes 30 illustrations. The book includes also duets penned by Judge Victor Caruana Colombo since 1961 where he pulls his colleagues’ legs in a unique way during the feast of Sant’Ivo, patron saint of lawyers. Copies of the book are available from leading bookstores. Picture shows Dr Borg with Magistrate Coppini.\nwww.kitegroup.com.mt", "comment_count": 0, "id": 3315}, {"keywords": "Gozo", "author": "", "article_body": "The December edition of this hallowed monthly (first published in 1945) offers its usual fare of diocesan and other news from and about Gozo, predictably focusing, but not exclusively, on Christmas celebrations. The editorial questions whether the commercial flavour of most events is diluting the traditional authenticity of Christmas on the island. This is balanced by an article on Schola Cantorum Jubilate, featured in the cover, and its popular annual Christmas event at the Priory of St Augustine in Victoria, an event which remarkably combines spirituality, culture and gastronomy. We can read more about the experiences of selfless youths who travel to far-off places like Cambodia, Perù, Guatemala and Kenya on missionary projects. The old photo of the month recalls the opening of St Therese Hospital in 1929… and there’s more - theatre, sport, history, biography and satire.\nilhajjafghawdex@gozodiocese.org", "comment_count": 0, "id": 3316}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Bishop Mario Grech welcomed members of the clergy and representatives of various lay organisations at the Gozo Curia for New Year’s greetings last Sunday. Mgr Grech thanked them for their work on behalf of the Church during the past year and urged them to continue with their commitment during 2019.", "comment_count": 0, "id": 3317}, {"keywords": "Education", "author": "", "article_body": "Etienne Gatt recently conducted a qualitative study that investigated the personal and social factors that help individuals coming from families of low socioeconomic backgrounds achieve upward social mobility in Malta. The study was a dissertation project that Gatt conducted as part of the Master in Counselling degree at the University of Malta.\nEtienne Gatt\nThe six participants in the study coming from local families whose parents have less than five ‘O’ levels. Despite coming from backgrounds characterised by hardship the study found that this in actually helped them to become mature, dependable and hardworking individuals. The participants recognised how these positive characteristics have been invaluable in helping them to be successful in life. It was interesting to discover that such experiences are consistent with research conducted internationally.\nDespite the participants coming from different age brackets, they had encountered similar difficulties. They were faced with feelings of inferiority, inadequacy, loneliness and hardship.\nThey also reported how such experiences forged them with an identity that has distanced them from the identities of their families of origin. When seen from a Maltese perspective, this disclosure assumes more importance given the tight-knit characteristics of local families.\nGatt said the study’s main findings show the importance of counselling as a service to assist individuals in drawing meaning out of such experiences.\n“The role of counselling and the counsellor is that of providing a safe space where feelings, such as those of loneliness and inadequacy, can be safely discussed and made meaning of. This is especially the case where individuals have lesser access to networks of role models that can assist and positively influence their trajectories,” Gatt said.\n“It also needs to be considered that, usually, individuals going through such experiences are of a younger age and certain families might not afford such services. Therefore, accessible counselling can significantly help individuals navigate such experiences and may contribute in ensuring more equitable forms of social justice,” he added.\nA copy of this study may be found at the University of Malta library. Gatt undertook the Master in Counselling with the support of a scholarship funded by the Endeavour Scholarship Scheme.", "comment_count": 0, "id": 3318}]