[{"keywords": "", "author": "", "article_body": "No libels about stories claiming MEP David Casa was a cocaine user had been filed, a court heard on Friday.\nMaltaToday managing editor Saviour Balzan told a court that Mr Casa had not filed any libel suits about the allegations published in his newspaper.\nMr Balzan was testifying in a defamation case MEP Marlene Mizzi has filed against Mr Casa, over allegations that she was keeping an office rental allowance to which she was not entitled.\nMs Mizzi testified earlier in the sitting and said she could not accept Mr Casa's allegation that she was pocketing money, dropping mention of the allegations against Mr Casa. \n“The fact that he is inflating salaries and taking drugs instead of trying to clear his name…,” she started saying but was interrupted.\nMs Mizzi said she had been using offices owned by her daughter, who would not accept rent from her. This led to allegations that she was “pocketing” allowances intended for paying office rent.\n\nShe referred to the General Expense Account Good Practise Guide, saying she was following those rules on how a parliamentarian was to act.\nMEPs, she said, were not obliged to give an account of their expenses. Money was given to MEPs without an explanation being needed on how it was spent.\nMs Mizzi was cross-examined by lawyer Jason Azzopardi, who asked whether she knew whether Mr Casa’s accounts were audited. “I don’t know,” she replied.\nAsked whether her accounts were audited, Ms Mizzi said they were.", "comment_count": 0, "id": 519}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta must step up its fight against corruption and impunity, also bolstering human rights bodies, according to United Nations members states.\nIn a report published during a Human Rights Council session, delegations from UN members repeatedly called on the government to “strengthen its anti-corruption institutions, including the enforcement of anti-money laundering regulations”.\nFreedom of speech too had to be strengthened, they argued, urging the government to “enhance the safeguards”.\nThe independence of the media was also flagged as an area the government had to work on to improve. The government was encouraged to “investigate fully” all cases of threats, harassment and violence against journalists and bring to justice direct perpetrators of such crimes and those inciting them.\nA number of the delegations called on Malta to intensify efforts to set up a national human rights institution.\nRead: Do more to protect journalists, Malta told\nAccording to the report, some of the conclusions reached and recommendations made “enjoy the support of Malta” but though several other proposals were “examined” by the government, a response had yet to be provided to the UN council. The government has until March 22 to respond on such matters.\nThese included calls for Malta to increase the number of investigations and prosecutions in cases of corruption and financial crimes and recommendations to revise public service media laws.\nThe government had also still to reply to calls to adopt “effective measures” to guarantee the safety of journalists and the exercise of freedom of expressions.\nThe council was likewise awaiting a reply on calls for Malta to improve conditions in detention centres and on a recommendation that teenagers between 16 and 18 are tried by special juvenile courts.\nThere was also a call for an “independent and effective public inquiry” into Daphne Caruana Galizia’s murder, on which the government had yet to respond. The Maltese government had examined other recommendations too but it did not support them. \nThis included calls for the reform of laws on abortion with the aim of legalising it.\nThe government delegation, headed by Equality Minister Helena Dalli, had said it was “determined to accept as many recommendations as it was in a position to do in order to improve further the living standards and quality of life of its citizens”.\nThe UN reviews all member states by analysing what they did to fulfil their human rights obligations within the framework of the Human Rights Council’s work to address violations. \nMalta was last subject to such a review in 2013.\nPress freedom organisations react \nIn a reaction on Friday following the adoption of Malta’s review, a group of press freedom organisations noted that it was “deeply worrying” that the government “explicitly not accepted” the recommendations to guarantee an independent inquiry into the murder of Ms Caruana Galizia.\n“The UPR process has done nothing to allay these concerns. If anything, it has exacerbated them,” the organisations said in a statement, adding that they welcomed statements by many UN member states raising “major concerns about the deterioration of freedom of expression in Malta”. \nThe four organisations - Article 19, European Centre for Press and Media Freedom (ECPMF), PEN International and Reporters Without Borders (RSF) – also pointed out that “prominent subjects” of Ms Caruana Galizia’s reporting have not been placed under formal investigation or questioned. \n“The lack of progress in the investigation into Ms Caruana Galizia’s murder is a truly disturbing indicator of impunity,” they went on. \nThe recommendations related to freedom of expression and information, association and assembly, which the government has now accepted, can only be seen as paying lip service to its obligations under international human rights law, the groups insisted. \n“These recommendations can only be fully implemented if the government establishes without delay a public inquiry into whether Ms Caruana Galizia’s life could have been saved, a recommendation it has explicitly refused to accept. Without its immediate effect these promises will continue to ring hollow.”", "comment_count": 11, "id": 520}, {"keywords": "", "author": "Ivan Martin, AFP ", "article_body": "Updated at 4.30pm\nEight-year-old Samwel Attard struck a chord when he took the microphone at an environmental rally on Friday, asking why developers were building over the last remaining countryside on the island. \n“I want to be heard by those who are cutting down the last trees… I wish the air didn’t smell like exhaust fumes, it smells so fresh when I go abroad. I wish there wasn’t so much plastic when I swim in the sea… I wish you would listen to me,” the young boy told a gathering of a few hundred students.\nStudents marched from the University of Malta’s Msida campus to the Valletta Parliament building, as thousands across the globe also took part in symbolic strikes for action to combat climate change.\nTens of thousands of young people skipped school across the globe on Friday to march through the streets for an international day of student protests aimed at pushing world leaders into action on climate change.\nClassrooms in capitals from Bangkok to Berlin, Lagos to London emptied as as ambitious organisers of the student strike hoped to stage 1,000 demos in more than 100 countries.\nAs youngsters hit the streets in cities across the globe, nations meeting at the UN environment assembly in the Kenyan capital Nairobi announced that they had agreed to \"significantly reduce\" single-use plastics over the next decade.\nBut experts said the pledge - which only referred to man-made global warming and made no mention of the fossil fuels driving it - fell far short of the steps needed to tackling Earth's burgeoning pollution crisis.\nYoung Samwel Attard was among the activists. Video: Ivan Martin\nEuropean reports put Malta among the continent's lowest achievers in terms of tackling climate change.\nMarching through St Anne’s Street in Floriana, hundreds of Maltese students chanted “climate justice now”. Placards read; “wake up!”, “don’t destroy our future”, and “less petrol stations more balls” among others.\nThe local march was announced on Wednesday and traffic was halted from University to Valletta for half an hour as students filled the street.\nThe wave of youth activism began with 16-year-old Greta Thunberg from Sweden, who last August began camping outside the Swedish parliament and accused lawmakers of failing to uphold their commitments to fight climate change as agreed to under the Paris climate accord.\nPlacards read; “wake up!”, “don’t destroy our future”, and “less petrol stations more balls”\nStudents at St Michael's hold up placards they made to support the event. Photo: Jonathan Borg\nThe young Ms Thunberg says she was inspired by students from the Parkland school in Florida, who walked out of classes in protest against the US gun laws that enabled a bloody massacre on their campus.\nAs word of her strike spread, she made headlines, and was invited to speak to climate negotiators in talks last December in Poland and more recently to global leaders in Davos, Switzerland.\nMs Thunberg has now been nominated for the Nobel Peace Prize.\n'Climate change is like Jenga'\nSteven Bajada, 19, who helped organise today’s gathering in Valletta, said climate change was a domino chain.\nThe first domino was already wobbling, he said, warning that once it fell, the damage could not be undone. The “runaway train” of carbon sinks becoming carbon sources, and coral reefs being relegated to the history books, was the fruit of decades of inaction.\n“Climate change is like a game of Jenga [A tower building game]. We are pulling out blocks and just hoping the whole tower won’t fall,” he said.\nHis speech ended with a call to arms: “if we all shout loud enough maybe the people in the chamber behind me [Parliament] will hear us”.\nThe University and sixth form students were joined by youngsters from Valletta’s St Albert the Great College and around a dozen others who got their school’s permission to join the protest march.\nPlacards prepared for the event. Photo: Mark Zammit Cordina\nElsa Cassar, 19, who chairs the Youth Scout Council, said young scouts were asking why the fields they once played in were now turning into construction sites. “We are tired of the ‘same old’ mentality,” she said.\n\nMarches across the globe\nAmbitious organisers of the global student strike hoped to stage 1,000 demos in more than 100 countries.\nStudents flooded into the streets in Wellington, Sydney, Bangkok and Hong Kong carrying placards that read \"There is no planet B\", \"You're destroying our future\" and \"If you don't act like adults, we will.\"\nIn Delhi, one of the world's most polluted cities, around 200 students took part in a colourful protest, waving ribbons, juggling and performing stunts with hoops.\n Young activists at the University campus. Photo: Mark Zammit Cordina", "comment_count": 44, "id": 521}, {"keywords": "", "author": "", "article_body": "The Malta Financial Services Authority has joined local and international organisations in celebrating World Consumer Rights Day, a yearly occasion which serves to highlight and raise awareness on the rights of consumers around the world.\nThe MFSA is celebrating this day by highlighting a fundamental right for consumers of banking products and services - that of receiving clear and concise information related to their bank account.\nWith over 1.5 million deposit bank accounts currently held by Maltese and foreign residents with local banks – translating to an average of three bank accounts per resident – the campaign should appeal to the majority of the public.\nIt revolves around the provision of information through clear and easy to understand documents which are available free of charge, including the fee information document and the statement of fees (SOF).\nThe fee information document assists the consumer in his choice of bank account, prior to entering into a contract with a service provider. This document, which is to be provided for each account offered by the bank, should contain the terms of the key services linked to a bank account as well as the corresponding fees for each service.\nAfter entering into a contract for a bank account, each consumer has the right to be provided, at least annually, with a SOE for the relevant period.\nThis document would cover items such as the total amount of each fee charged, interest applied, information regarding any overdraft interest charged (interest rate and total amount), the credit/debit interest rate applied and the total amount of interest earned or paid. \nThe SOF is different to the monthly or yearly account statement which most bank account holders are familiar with, varying not only in format but also in the objectives that they satisfy. While account statements aims to give account holders full disclosure of all the movements to and from the account, the SoF is intended to help consumers to both understand and compare fees through a common format.\nThrough this document, the customer will be able to have a general overview of all the fees paid during a specific period, understanding the expenditures to which the fee relates and assess the need to either modify consumption patterns or move to another provider.\nThe provision of these documents will go a long way into delivering transparency and improving the relationship between the customer and the bank.\nMFSA’s conduct supervision head Michelle Mizzi Buontempo commented that “As the single financial services regulator in Malta, the MFSA is continuously working to create awareness and protect consumers in the financial services sector. Such initiatives are considered as critical in our efforts towards becoming one of the leading jurisdictions in Europe.”\nFurther information on this subject as well as an explanatory video are available on the MFSA website.", "comment_count": 1, "id": 522}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Where does an 18-year-old student seeking shelter from domestic violence or a family who loses its home because of a spike in rental prices go?\nWith demand surpassing supply, space at shelters is running out, so the Catholic Action Movement (AKM) is joining other NGOs in providing temporary relief for those who end up homeless overnight.\nRegina Pacis in Balzan is being converted into a home to provide temporary shelter to a family in need or a small group of homeless people.The temporary shelter in Balzan.\nGeneral secretary Sarah Caruana told the Times of Malta the movement was increasingly meeting families who could no longer afford their rent and ended up homeless overnight. They would need temporary shelter for a couple of months until they could get back on their feet, she added.\nAt the moment, the Church NGO refers homeless people to other organisations that provide shelter or, when possible, even hosts people at its retreat house in Birkirkara.\nThose who end up homeless include young people who do not qualify for protection from the State, such as those trying to escape a domestic violence environment.\nIncreasingly meeting families who could not afford their rent\nMs Caruana said care homes did not cater for 18-year-olds who ran away from abuse and those who were still studying could not afford to live independently.\nRead: Number of officially homeless in Malta is 'not a reality’\nThe number of homeless people seems to be on the increase, with two main charities providing shelter to homeless people telling the Times of Malta the official data showing that 27 people were sleeping rough between 2013 and 2018 was a far cry from reality.\nWhen last month’s storm battered the country, homeless people who usually sleep rough on beaches and in boats struggled to find shelter, with many seeking refuge in cars or abandoned properties.\nThere is still a lot of work to be done at the Regina Pacis home and the AKM is in need of either volunteers who can finish the house with the donated material or funds that would allow it to hire workers. It is hoping to complete the house by the end of the year.\nMore information on how to help out with the Regina Pacis project on info@akmalta.org or 2122 2239.\nDonations can be sent to the AKM at the Catholic Institute in Floriana or by making a deposit in Bank of Valletta account MT27VALL22013000000040023865211.", "comment_count": 17, "id": 523}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated 11.25am, adds unveiling of study\nIt was “unlikely” Malta would manage to slash the early school-leavers’ rate to 10% in line with the European Union’s 2020 targets, researchers have concluded.\nCarmel Borg, who heads the National Observatory for Living with Dignity, told the Times of Malta ahead of the study’s publication today that as things stood now and unless the criteria was redefined, Malta would reach the set target by 2022.\nThe observatory comes under the President’s Foundation for the Wellbeing of Society.\nProf. Borg, who carried out the study together with lead researcher Milosh Raykov, insisted when contacted that “predictions are fluid” and there could be other factors, such as the redefinition of certain terms, that could lead to a sudden drop in numbers.\nThe study follows up on the latest National Statistics Office figures, which, last October, showed that although Malta’s early school leaving rate had dropped to 17.7% in 2017 from 20.3% in 2014, it was still far from the 2020 target.\nFor years, Malta’s numbers have been among the highest across the EU, with Eurostat data showing that one in five Maltese students leave school by the age of 18. \nThe Europe 2020 strategy is the EU’s agenda for growth and jobs for each member state. It emphasises smart, sustainable and inclusive growth as a way to overcome the structural weaknesses in Europe’s economy, improve its competitiveness and productivity and underpin a sustainable social market economy.\nContacted for a reaction, an Education Ministry spokeswoman said Malta had achieved “a steady and constant reduction in the early school-leaving rate over the past years. From 23.8% in 2010, the rate has now gone down to 17.7% in 2017. We are confident that, on the basis of these steady and significant improvements, Malta will continue this positive trend within the remaining three-year period and achieve its 2020 target.”\nIn recent years, the government often insisted that while efforts to address problems in the education system started a while ago, it would take a number of years before the impact of the changes made were reflected in Malta’s performance in EU reports.\nThe study being unveiled on Friday is also expected to highlight issues with labelling in schools after a number of the early school-leavers interviewed by the researchers claimed they felt “shortchanged” by the education system, noting that this often did not properly acknowledge their learning difficulties.\nAhead of the publication, the researchers also said their work showed that divorce was increasingly becoming the reason behind some students’ decision to drop out of school without any qualifications. \nStudy unveiled\nSpeaking at the unveiling of the study on Friday, President Marie-Louise Coleiro Preca said that the work provides “relevant evidence” that would help with the understanding the reasons behind early school leaving.\n“I hope that these important insights are taken into consideration by politicians and policy makers, who have a mandate to secure the best future prospects of each and every one of them, with concurrent benefits for economic growth and social cohesion,” the President said. \nShe insisted that ensuring that students did not abandon their studies before securing the necessary qualifications was especially important because it aided in breaking the cycles of depravation, poverty and social exclusion.", "comment_count": 3, "id": 524}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Friday’s newspapers.\nTimes of Malta says the mysterious disappearance and gruesome murder of an accountant whose clients were involved in shady property dealings 37 years ago resurfaced on Thursday when his wife and son asked the court for compensation. In another story, the newspaper says researchers have concluded it was “unlikely” Malta would manage to slash the early school-leavers’ rate to 10% in line with the European Union’s 2020 targets.\nThe Malta Independent quotes economist Gordon Cordina saying that employment sustainability required the right economic balance.\nL-Orizzont leads with a story on Ryanair’s new winter routes.\nIn-Nazzjon says the increase in population was not leading to an increase in business for small shops.", "comment_count": 0, "id": 525}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The mysterious disappearance and gruesome murder of an accountant whose clients were involved in shady property dealings 37 years ago resurfaced on Thursday when his wife and son asked the court for compensation.\nAlthough nobody has ever been charged with his violent death in 1982, during the turbulent years of political upheaval, the case has always been widely considered to have had political connotations.\nThis mainly emanated from the fact that his clients had included people involved in the corridors of power and having connections with the late public works minister Lorry Sant.\nThe heirs of other political murders had been compensated\nIn a judicial protest, a first legal step leading to a proper lawsuit, filed Thursday against the Prime Minister, lawyer Peter Fenech argued that the government was discriminating against Anna Cassar and her son Paolo since the heirs of other political murders had been compensated. The son was born just a few months after his father’s disappearance.\nLegal sources told the Times of Malta that although the ‘political murders’ during Dom Mintoff’s era remained unsolved, most of the heirs of the victims were compensated by the State. These included the heirs of Karen Grech killed by a letter bomb in 1977 during an ongoing doctors’ strike, and of Raymond Caruana, a Nationalist Party activist who was fatally wounded when shots were fired at the Gudja PN club in late 1986.\nHolding the State responsible for the ‘political’ murder, perpetrated by a tense political climate, rampant corruption and the failure of institutions, Mr Cauchi’s heirs noted that informal talks on compensation were never concluded. \nAccusing the government of never really investigating the brutal murder in a proper manner, thus breaching the Constitution, Ms Cassar and her son called upon the Prime Minister to proceed in granting them compensation they were eligible to.\nThe brutal murder of Lino Cauchi\nIn the late 1970s and early 1980s, Mr Cauchi was among the handful of accounting practitioners on the island. At the time, the island was experiencing very turbulent political times, dominated by rampant institutionalised corruption.\nAmong Mr Cauchi’s clients was a group of people connected to Mr Sant, the only high-profile Maltese politician ever to be found involved in corruption by the Permanent Commission Against Corruption.\n\nIn December 1981, days before a tense general election, Mr Cauchi was called for a meeting at the office of the late Joe Pace, owner of the Magic Kiosk in Sliema, when, according to court evidence, the accountant was instructed to draft various promises of sale agreements on the transfer of land to members of Mr Sant’s clique. The evidence also indicated that Mr Cauchi had objected to what was being done and, after he had left the meeting, one of those present had remarked Mr Cauchi was a problem.\nTwo months later, in the morning of February 14, 1982, the 32-year-old accountant left his home in Santa Venera for his office in Valletta and never returned.\nAt the time, Mrs Cauchi, pregnant with their son, believed her husband had been kidnapped.\nMr Cauchi was last seen in Old Bakery Street, Valletta, at 6.30 pm but his car, for some unknown reason, was found parked outside his residence at about 4pm, when he was in Valletta.\nA suitcase he carried when he last left home was found empty at Chadwick Lakes two days later. It was forced open.\nIt later resulted that Mr Cauchi had a similar suitcase at his home and had warned his wife not to let go of it should anything ever happen to him. The day after his disappearance, a man identifying himself as Inland Revenue Department official appeared at Ms Cauchi’s door asking for the suitcase. The distraught woman handed it over to him. The department later denied ever sending anyone to pick the suitcase.\nMore than three years later, on November 15, 1985, the remains of a human body were found by the police in a shallow well in the area known as Il-Bosk, near Buskett Gardens in Rabat. They were later identified as Mr Cauchi.\nAccording to forensic expert Anthony Abela Medici, who had studied the case at the time, although it was difficult to establish when Mr Cauchi was killed, forensic evidence indicated his body was dismembered, packed in plastic bags and dumped in the well within 30 minutes of the murder.\nIt was established Mr Cauchi had been killed with a blow to the right hand side of his head by a mallet, which was also found in the well. According to Dr Abela Medici, the strong blow fractured the skull in 28 places and could have been fatal. Forensic evidence suggested that more than one individual could have been involved in the killing because of the short time span it took for the body to be cut up, packed and dumped. Both a manual and an electric saw were used to cut up the body.\nCourt evidence on a number of corruption cases in the 1980s had indicated that Mr Cauchi was privy to corrupt dealings by a number of businessmen, including Mr Sant’s right-hand man and works manager, Pio Camilleri.\nHe was identified by at least two court witnesses as Mr Camilleri’s accountant. However, Mr Camilleri has consistently denied ever knowing Mr Cauchi.\nAlthough the murder remains a mystery, it is widely believed it could have been linked to the late accountant’s knowledge of corrupt dealings.\n ", "comment_count": 192, "id": 526}, {"keywords": "", "author": "Claire Caruana", "article_body": "Students who left school early, without obtaining any qualifications, often felt “shortchanged” by an education system that did not properly acknowledge their learning difficulties, according to a new study.\nConducted by the National Observatory for Living with Dignity, the study, being published tomorrow, is also set to reveal that students whose parents get a divorce were more likely to drop out of school without any qualifications.\nObservatory chairman Carmel Borg told the Times of Malta the study would confirm there were moments in the lives of those interviewed where they felt they had been shortchanged by a system that did not properly acknowledge and provide for their learning difficulties and let them drift away from the targets set for the compulsory school system.\n“The system also tracked or streamed them early until they became a self-fulfilling prophecy and they were rarely helped in properly transitioning from home to school given the social and cultural gap that defined home-school relations,” Prof. Borg said.\nProf. Borg said the break-up of parents’ marriage could cause the most profound emotional trauma and leave the biggest impact on children, particularly in low socio-economic status contexts defined by limited social and cultural capital.\n“Children living in families where parents are divorced are often in constant, apparent or hidden mourning that often leads to early school-leaving,” he noted.\nThe issue, he commented, threw light on the importance of emotional stability within the family unit because there was a very strong link between such stability and potential for the child’s holistic development. The study, by lead researcher Milosh Raykov, consists of a literature review of qualitative studies as well as in-depth interviews.\nThe researchers warn that while a positive educational environment at home is crucial, quality schools are strategically central to achieving social justice in education.\nThe National Statistics Office reported in October that although Malta’s early school leaving rate dropped to 17.7 per cent in 2017 from 20.3 per cent in 2014, this was still far from the 2020 target of 10 per cent.\nIn recent years, Malta continued to register among the highest numbers of early school leavers across the EU, with Eurostat data showing that one in five Maltese students leave school by the age of 18.\nThe National Observatory for Living with Dignity is part of the President’s Foundation for the Wellbeing of Society.", "comment_count": 3, "id": 527}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A recent Facebook advert promoting a new ‘service’ and encouraging boat owners to trade their unused mooring permits in various bays was illegal, Transport Malta has confirmed.\n\nEyebrows were immediately raised when Kerb, an international digital company also operating in Malta, started marketing buoys in various bays, insisting that owners could now monetise their permits when not using their mooring spots.\nEncouraging boat users to resort to their online application, the company said it was using the latest satellite technology to indicate which buoys were temporarily available and how much it would cost to ‘lease’ it for a few hours or days.\nWhat the company apparently did not know was that, in Malta, such practice was not possible as it was illegal.\nWhen contacted, a spokesman for Transport Malta noted that, according to Maltese laws, a mooring permit was awarded to an individual for a particular boat.\nPermit cannot be transferred to other individuals\n“Such a permit cannot be transferred to other individuals, not even temporarily, as seems to be implied in the case of this particular application,” the spokesman said, insisting the authorities were investigating.\nThis newspaper is informed that the ‘new service’ must have been an oversight by Kerb Malta and, in fact, the advert is not online any longer.\nDescribing itself as the “Parking Airbnb”, Kerb states that, through its applications, people trying to find a parking, at least on land, can do so through their application. It highlights the possibility that owners of private parking spaces can now also trade their “unused” places.\nAccording to the company, its systems are already highly used in hundreds of cities across the globe, from Asia to the US.", "comment_count": 7, "id": 528}, {"keywords": "", "author": "Denise Grech ", "article_body": "A man and a woman were treated for smoke inhalation on Thursday evening after a fire broke out in an apartment overlying a garage at Ta' Paris in Birkirkara.\nThe blaze was reported at 7.30pm and two fire engines were deployed by the Civil Protection Department.\nFiremen accessed the apartment through a balcony after going up a fire-engine ladder.\nOfficials on the scene said the fire appeared to have started in the kitchen and was quickly brought under control. The cause was not immediately apparent. \n\nThursday's incident came three weeks after a man died and two others were injured in an apartment blaze in Msida. ", "comment_count": 2, "id": 529}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The police are not yet known to have instituted criminal charges against “a particular person”, as instructed to do by the magistrate who conducted the Egrant inquiry, judging by information given in Parliament this week.\nMagistrate Aaron Bugeja. Photo: Matthew Mirabelli\nThe matter was raised in a written parliamentary question Nationalist MP Jason Azzopardi put to Home Affairs Minister Michael Farrugia.\nDr Azzopardi asked why the Police Commissioner had failed to follow the orders issued by Magistrate Aaron Bugeja to arraign and press “particular criminal charges” against “a particular person”. He noted that the Egrant inquiry was concluded on July 21, 2018.\nThe minister said the Police Commissioner was aware of the magistrate’s report. \n“The police are following all the conclusions, instructions and recommendations made by the inquiring magistrate in the same inquiry. I am informed that, at this stage, the police are not in a position to give more information on what they were asked to do by the magistrate so it would not prejudice its investigations,” Dr Farrugia replied in Parliament on Tuesday.\nCourt sources told Times of Malta that in his 1,500-page inquiry report, still unpublished, Dr Bugeja singled out “at least one of the main protagonists involved in the setting up of the secret [Egrant] Panama company” and instructed the police to issue criminal charges connected to perjury against the person.\nPrime Minster Joseph Muscat had pledged that the inquiry report would be published in full although this has not yet materialised. \nSo far, only 49 pages of the voluminous report have been released. The “main conclusions” were published by the Attorney General on the same day Dr Muscat gave a press conference on the findings.\nPolice are not in a position to give more information\nAttorney General Peter Grech has declared his opposition to publication of the entire report, though he did hand over a copy to Dr Muscat who recently said he now preferred to await the decision by the court on a lawsuit filed by Opposition leader Adrian Delia demanding a copy of the report.\nAccording to the published conclusions, the inquiring magistrate found no evidence linking the Prime Minister, his wife, Michelle, or their family to Egrant Inc. It is not known whether the report proper gives any indication of who owns Egrant.\nTwo secret companies opened on the same day as Egrant by the same intermediaries, Tillgate and Hearnville, belonged to the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi.\nNo arraignments are known to have been made so far as a result of the Egrant inquiry. \nPolice sources told The Sunday Times of Malta last summer potential crimes from the report included forgery of official documents and perjury.\n\nTo publish or not to publish…\nPrior to the news that the Egrant inquiry had been concluded, the Prime Minister insisted on various occasions he wanted the whole truth to come out and pledged that the entire report would be published once completed.\nOn July 20, 2018, Magistrate Aaron Bugeja concluded his inquiry and sent a copy of his 1,500-page-long report to the Attorney General as required by law.\nEarly the following day, the Attorney General called Justice Minister Owen Bonnici telling him that the inquiry report was on his desk and that he would be informing the public about its conclusion. \nThe minister, in turn, informed the Prime Minister who instructed his lawyer, Paul Lia, to ask the Attorney General for a copy.\nThat same day, the Attorney General passed a copy of the entire report to Dr Lia. The copy was then handed over to the Prime Minister and the Justice Minister.\nOn July 22, the Attorney General’s office published a 49-page document containing the conclusions of the inquiry. Immediately afterwards, the Prime Minister addressed a press conference saying the inquiry found that Egrant did not belong to either him or his wife. He reiterated his intention of publishing the report.\nA week later, a spokesman for the Office of the Prime Minister told The Sunday Times of Malta the report would be released in “a matter of days” because government officials and lawyers were redacting the document to make sure no third party names or anything that could prejudice further investigations were published.\nOn October 26, 2018, following a court case filed by the Opposition demanding the release of the report, the Prime Minster insisted he was still in favour of the publication of the full report.\nHowever, he declared this would not be done until a decision was made by the court hearing the case instituted by the Opposition.\nivan.camilleri@timesofmalta.com", "comment_count": 40, "id": 530}, {"keywords": "", "author": "", "article_body": "The police have arrested two men from Serbia and another from North Macedonia after finding them in possession of drugs.\nThe arrests stemmed from investigations after an Albanian man reported that he was assaulted earlier this month.\nThe arrests were made in a house in Msida.\nThe men were found in possession of cannabis and cocaine. A magisterial inquiry is under way.\n ", "comment_count": 0, "id": 531}, {"keywords": "", "author": "Keith Micallef", "article_body": "Fresh alarm has been raised about surfacing of country roads after the practice was spotted at il-Lunzjata in the limits of Rabat, and a valley on the outskirts of Mġarr.\nConcerns were first raised when concrete was poured on newly-widened country lanes at Wied l-Isqof in Rabat, destroying vegetation.\nAlfred Baldacchino, a former assistant director of the Environment Protection Directorate at the now defunct Malta Environment and Planning Authority, raised the concerns amid fears that works by State entities would result in “further destruction of biodiversity”. \nThe matters were flagged in e-mails sent to the transport and environment ministers, Infrastructure Malta, the political parties, the Environment and Resources Authority and other State entities.\nMr Baldacchino claimed that the same mistakes that recently prompted ERA to halt ongoing works by Infrastructure Malta at Wied l-Isqof – on the grounds that these were causing environmental destruction – were being repeated again a Il-Lunzjata.\nHe pointed out he had nothing against improving access for farmers as long as these country paths would not morph into highways.\n“As long as the existing footprint is maintained, and vegetation at the margins is not affected -in order for the rain to percolate to the water table - there is nothing wrong,” he said.\n“However, widening country paths goes against the interests of farmers themselves, as the area will become more accessible and exposed, thus increasing the risks of thefts of produce like melons and water melons,” he added.\nThe expert said that at country paths and roads used by farmers in Il-Lunzjata were being widened by encroaching on virgin land and all vegetation was being obliterated as the concrete was being applied across the entire width of the road.\nFurthermore, the works were destabilising rubble walls in view of the fact that the soil underneath was being removed.\nMr Baldacchino criticised these works, saying they were not being carried out in consultation with other State entities, such as the Energy and Water Agency.\nThe biodiversity expert also took issue with the “ridiculous” reply given to him by Environment Minister José Herrera. The latter insisted that these works consisted of the removal of some vegetation from the roads and pavements.\n“It seems that whoever briefed the minister about the matter had taken him for a ride as there are no pavements at Il-Lunzjata,” Mr Baldacchino said.\n“Evidence on the ground suggests that this pristine area is braced to face the same fate of Wied l-Isqof.”\nMr Baldacchino has also flagged the situation at Wied il-Ħżejjen on the outskirts of Mġarr, where a number of trees were uprooted in recent days. He claimed that during this operation heavy vehicles belonging to Transport Malta were seen on site.\n“Though I reported the matter to ERA, by the time enforcement officers arrived on the spot, they had left,” he told this newspaper.\nReplying to questions from the Times of Malta and ERA spokeswomen noted that in both cases a verbal stop notice was issued on both sides. She added that action was taken following complaints from the public.", "comment_count": 28, "id": 532}, {"keywords": "", "author": "", "article_body": "The family of Daphne Caruana Galizia has rejected the prime minister’s offer to drop libel proceedings against the slain journalist if they accept the conclusions of the Egrant inquiry.\nJoseph Muscat made his offer when he testified in the libel suit on January 31.\nIn a formal reply through the Magistrates' Court on Thursday, the family said it was not in a position to consider surrendering the case by admitting that Ms Caruana Galizia was not right in her allegations, since it did not have access to the full inquiry report by Magistrate Aaron Bugeja.\nMs Caruana Galizia had said that the prime minister’s wife was the ultimate beneficiary of funds from Panama secret Egrant, basing herself largely on information by Pilatus Bank whistleblower Maria Efimova. Dr Muscat had denied the claims and sued for libel. \nRead:Egrant inquiry finds falsified signatures, differing testimonies and no proof\nThe family said that it had no access to the testimony given by Ms Caruana Galizia and Ms Efimova before Magistrate Bugeja.\nIt also had no access to the testimony given by Jaqueline Alexander and did not know whether she had confirmed or denied having signed a trust document indicating Michelle Muscat as the ultimate beneficiary owner.\nThe family also had no access to testimony by Karl Cini and Brian Tonna about who held the bearer share certificates representing 99 per cent of the Egrant equity and in whose name they were.\nNor was there access to the reports by the forensic accountants engaged by Magistrate Bugeja to examine and analyse the operational database, accounts and archives of Pulatus Bank, the family said.\nA judge is to decide on May 14 whether to order the Attorney General to provide the Leader of the Opposition with a full copy of the Egrant inquiry report.", "comment_count": 0, "id": 533}, {"keywords": "", "author": "Denise Grech ", "article_body": "Low-cost airline Ryanair is expecting the \"worst summer ever for delays\", blaming planned Europe-wide air-traffic control strikes and staff shortage for the inconvenience.\nLast summer was already the worst summer for delays because of strikes by air-traffic controllers, head of sales and marketing Chiara Ravara said on Thursday. But this is set to become worse and the airline is calling on governments to help deal with the issue.\nOne solution for potential strikes in countries like the UK and Germany would be to have neighbouring countries help by taking over air traffic control, she said.\nLast summer saw a number of delays caused by strikes in countries such as Italy, UK and Germany as controllers demanded better working conditions.\nRead: Ryanair flights cancelled following strikes in Italy\nMs Ravara was speaking at a press conference where the airline launched 15 new routes to countries including Amman and Santiago.\nTurning to concerns on the controversial Boeing Max 8 aircraft, Ms Ravara said the airline still had plans to eventually operate the aircraft but it would first await the outcome of investigations before making further comments.\nFlights of the Boeing Max 8 aircraft, have been banned after it crashed in Ethopia last week.\nRyanair has ordered 135 737 MAX 200s, a modified version of the MAX 8, and has options on 75 more. It is due to take delivery of the first in April, two in May, two in June and then 50 more before the 2020 summer season.", "comment_count": 2, "id": 534}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The police have managed to solve a long string of thefts and a number of cases of fraud, spanning a four-month period dating back to last October.\nMatthew Camilleri, a 32-year-old Gżira resident, was charged with no fewer than 19 separate instances of theft, the majority carried out over a fortnight at the end of January.\nTwo other thefts dated back to October and November respectively.\nThe 25 charges referred to thefts, one attempted theft, and fraudulent gains targeting a variety of shops, real estate agencies, insurance company offices and a service station, located at Mosta, Sliema, Ta’ Xbiex, St Julian’s, Birkirkara, Gżira, Marsascala, Paola and San Ġwann.\nThe thefts involved unspecified amounts of cash, cheque books, eight laptops and other items.\nThe October theft had targeted a couple’s Sliema home from where jewellery and cash were stolen.\nThe man was also charged with recidivism.\nAfter consultation with his lawyers, Franco Debono and Marion Camilleri, the man entered a not guilty plea and was remanded in custody.\nNo request for bail was made at the arraignment.\nInspectors Saviour Baldacchino, Joseph Mercieca and Colin Sheldon prosecuted.", "comment_count": 0, "id": 535}, {"keywords": "", "author": "", "article_body": "Ryanair has announced 15 routes from Malta to cities including Luxembourg, Cork and Oslo during the winter. \nThe airline will also be flying to Paphos in Cyprus and Santiago in Spain - for the first time. \nThe airline will extend its current services to Amman, Billund, Cardiff, Cork, Exeter, Lamezia, Luxembourg, Maastricht, Nantes, Oslo, Perugia, Rome Fiumicino and Thessaloniki.\nWith the additional traffic resulting from the new routes, a total of almost three million customers would pass through Malta International Airport. The Maltese travelling on the airline would also increase by 16 per cent, Ryanair head of sales Chiara Ravara said.\nTo celebrate, Ryanair has launched a seat sale with fares on its Malta routes available from €14.99, for travel in April and May, which must be booked by midnight next Tuesday. ", "comment_count": 1, "id": 536}, {"keywords": "", "author": "Simonne Pace", "article_body": "Eight days before Christmas day, Catherine Dato went through nephrectomy, a procedure involving the surgical removal of a kidney. She was only able to return to her husband Antonio and her two children, Massimiliano, 16, and Martina, 13, three days before Christmas.\n“I know my children miss me a lot and home is the not the same for them without me,” says the heartbroken 45-year-old mother who suffers from polycystic kidney disease, a disorder through which clusters of cysts develop on the kidneys, causing them to enlarge and lose function over time.\n“There are not enough words to describe my feelings as we decorated our home together a couple of days before my surgery,” says Dato, who had previously undergone another operation in preparation for dialysis.\nDiagnosed at the age of 26, at the very beginning of her married life, Dato, who lives in Kalkara, considers herself extremely lucky to have her family by her side all the time.\nRead: How to avoid kidney failure\n“Due to this illness I experienced a series of unfortunate events in my life,” explains the young mother, who has had to quit her 12-year job as a machine operator due to unforeseen bouts of sickness which affected both her private life and work commitments.\n“Polycystic kidney disease is not very common. The cysts that grow on the outside of both kidneys produce severe pain. Infections are common and there is no cure. Only painkillers can relieve the pain. The disease can lead to kidney failure, as happened in my case,” says Dato who, despite her many fears, feels proud to form part of the 1st Cospicua Scout Group.\n“My husband wholeheartedly supports me. He takes care of all our needs and when I’m forced to stay in bed he takes the children to school, picks them up, attends parents’ days, cooks and does the housekeeping chores.”\nI have learnt to appreciate my life the way it is, as I cannot escape reality\nIt has been an arduous journey so far and the couple’s life plans have turned topsy-turvy and been put on hold, as there is no forecast to Dato’s sickness. Pain and infection tend to crop up from time to time and without warning.\n“I cannot remember a single season during which I wasn’t sick. I was admitted to hospital several times but, thanks to the staff and doctors, I have always recovered. However, these situations create a deep instability at home because of my lack of presence. My husband always strives hard to keep up with the pressure, while my elder sister is of great help too, especially when I have to visit hospital. She takes good care of me both during and after my hospital stays.”\nDato visits the Renal Unit at Mater Dei Hospital every three days for her dialysis, with each session taking about four hours. Dialysis is the process through which a complete blood cleansing is carried out while the patient usually sits waiting for a machine to do the work of the failed kidneys. \n“Sometimes I feel very tired after the treatment and need to rest. It’s tough, as the next day it’s back to the normal routine of having to keep up with the house and caring for my children.”\nAn avid dog lover, “when I’m feeling up to it I go for daily walks with my husband and beautiful dog Seimo,” says Dato, who is on the waiting list for a kidney transplant. Unfortunately, her husband Antonio isn’t a compatible donor.\n“Waiting for a kidney transplant offers me relief and hope, although worries still linger in my mind. But I’m not anxious. I am living day by day.”\nAs expected, this whole situation has affected family planning in the couple’s lives. “We can never plan a holiday not only abroad but even in Malta, as we never know what my health situation will be like. Even a simple outing with friends can turn bitter. It’s not the first time we had to postpone or cancel an activity due to my unexpected sickness.” \nToday Thursday, World Kidney Day, like many other kidney patients, Dato will be undergoing dialysis treatment in hospital.\n“Most probably, we, the patients, will be ‘celebrating’ this day together with the formidable staff of the Renal Unit, to whom I’m so grateful,” she says.\n“I have learnt to appreciate my life the way it is, as I cannot escape reality. My family gives me the strength to carry on with my life. \n“The Scout Group gives me the satisfaction that I’m doing something beneficial for others. \n“I think the best cure is to try to continue living notwithstanding the limitations. There are enough problems, so I feel there is no need to invent others that can easily be avoided.”\n\nNew psychological support for renal patients\nThe LifeCycle (Malta) Foundation and the Renal Unit have set up RUSH, the Renal Unit Support Health Hub. On the occasion of World Kidney Day, LifeCycle and RUSH are offering free psychological support to kidney patients, as well as to current patients receiving kidney transplants and current live donors.  \nAround 300 kidney patients undergoing haemodialysis treatment or a kidney transplant will be benefiting from the new LifeCycle-RUSH psychological voucher scheme. Renal patients wishing to seek psychological therapy will be given a voucher from the Renal Unit at Mater Dei Hospital.\nThe voucher will entitle the patients to one free therapy session with their preferred psychologist from five listed on this scheme by the Malta Chamber of Psychologists. The vouchers will be honoured by the LifeCycle Foundation. \n“From experience, we have learnt that many renal patients are at a complete loss as to how to adapt their lives in a meaningful manner. Apart from the dedicated support they receive at the Renal Unit, they need to be mentally prepared for the life changes they encouter at the different stages of the disease,” LifeCycle founder Alan Curry said.\nThe Renal Unit provides dialysis treatment for about 300 patients suffering from kidney failure. It also provides transplant coordination services and support to patients and their family members.\nFor the past 20 years, LifeCycle has been raising money for life-saving equipment to help people suffering from kidney disease, while also advancing the awareness about organ transplants in Malta. The LifeCycle Foundation is the only NGO that supports renal patients in Malta.\nDonations to the Nescafe 3 in 1 LifeCycle Challenge 2019 can be sent via SMS to 5061 7370 (€2.33); 5061 8920 (€6.99); 5061 9229 (€11.65); via a call to 5160 2020 (€10); 5170 2005 (€15); and 5180 2006 (€25); or via BOV Account No. 14814521017.\nFor further updates and to donate, visit www.lifecyclefoundation.com or https://www.facebook.com/LifeCycleChallenge/.", "comment_count": 0, "id": 537}, {"keywords": "", "author": "", "article_body": "Boeing 737-800 Max airliners, similar to the one that crashed in Ethiopia on Sunday, has so far visited Malta eight times, according to plane spotters.\nSunday's crash was the second in a few months, leading aviation authorities all over the world to ban flights of the aircraft, which first flew in 2016. Malta as part of the EU banned flights of the aircraft in its airspace on Monday.\nThe last time the MAX 8 was seen at Malta International Airport was on March 7, just four days before the tragedy that left all 157 people on the Ethiopia Airlines flight dead. \nThe aircraft belonged to Turkish Airlines. This was the third time the airline had deployed the MAX 8 to Malta, the two other occasions being on October 18, 2018 and last February 28.\nThe first MAX 8 to visit Malta arrived on May 23, 2018, operating a Smartwings service. The airline operated three other flights to Malta using the MAX 8: on October 23, 2018, the day after and on October 28, 2018.\nA Tui Fly Max 8 was here on March 5.\nThe plane spotters reported online that a Smartwings MAX 8 en route from Cape Verde to Prague was in “holding pattern”, that is circling in the air, off Malta on Tuesday evening until a decision was made to re-route to Tunisia after the EU aviation safety agency closed the European airspace to the MAX 8 earlier in the day.\nBoeing Commercial Airplanes delivered about 350 MAX 8 models, which cost about €100 million each, since 2017 and reportedly has orders for 5,000 more, though the fact that airlines in many countries have suspended the use of the plane in the wake of the latest crash is likely to affect sales.\nThe new MAX line was unveiled on August 30, 2011, but the first flight took place on January 29, 2016. The plane can have up to 210 seats in a two-class configuration. \nHaving a range of 6,570 kilometres, the airliner is just under 40 metres long and has a wingspan of almost 36 metres.\nThe airliner is the latest in the very successful B737 family, first introduced in 1965. Less than two decades later, the B737  was the most ordered plane in commercial history.\nBoeing set a new Guinness World Record for the “highest production of large commercial jet” in March 2018 when the 10,000th B737 airplane was assembled in Renton, Washington, where the plans are to produce 57 B737s every month this year.", "comment_count": 6, "id": 538}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man allegedly grabbed his mentally-impaired girlfriend by the neck and forced her to have sex against her will.\nThe 26-year old Siġġiewi man was marched to court on Thursday under arrest, pleading not guilty to rape as well as to having allegedly forced himself upon his 19-year old girlfriend who, the court was told by inspector John Spiteri, was mentally impaired.\nThe woman refused her boyfriend’s sexual demands, prompting the man to grab her by the neck and allegedly forcing himself upon her.\nDefence lawyer Leslie Cuschieri remarked that he would request an examination to assess his client’s mental faculties, noting that the accused lived with his mother and could lose his job if bail were to be denied.\nHowever, the Court, presided over by magistrate Audrey Demicoli, turned down the request for bail citing the possible risk of tampering with evidence until the alleged victim testified.\nLawyers Alfred Abela and Rene Darmanin appeared parte civile.", "comment_count": 0, "id": 539}, {"keywords": "", "author": "", "article_body": "The bridge across Valley Road in Msida has been partly dismantled as part of works to replace it by a wider one.\nTwelve concrete beams will be laid to support the new structure.\nThe new 20-metre beams are being cast at an offsite location and will start being transported to Regional Road in the coming days.\nSeven nearby junctions are also being upgraded as part of a revamp of Regional Road. \nOnce complete, the new bridge would be one of the widest bridge structures in Malta, extending 23.5 metres, Transport Minister Ian Borg said when visiting the site.\nOver the last few months, Infrastructure Malta constructed the first of the two additional lanes and started building the foundations and abutments of the new bridge.\nA few days ago, the two carriageways of Regional Road were shifted by a few metres so that the bridge construction works could continue without affecting any of the four lanes currently in use. Parts of the new lane along the southbound carriageway of Regional Road will be opened to road users soon. Infrastructure Malta has also started the construction of the sixth lane along the sides of the northbound carriageway.", "comment_count": 11, "id": 540}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The police vice-squad swooped in upon a Sliema brothel on Tuesday, catching some of the women ‘in flagrante’ with their customers, a court heard on Thursday.\nTwo Maltese men and six Colombian women were taken to court. The suspect masterminds behind the illicit activity, Don Spagnol, 34, and Luke Farrugia, 31, both Gżira residents, were the first to face separate arraignment over charges of living off the earnings of prostitution, involvement in the running of the brothel and using the premises for prostitution.\nProsecuting inspector Joseph Busuttil explained how a lengthy operation had closed in upon the suspect racket, finally making their way into the Sliema premises finding half-naked couples engaged in sex in different rooms.\nOne of the men, Mr Spagnol, had allegedly exited the premises some time before the raid took place on Tuesday.\nBoth men pleaded not guilty and requested bail.\nHowever, the request was strongly objected to by the prosecution in view of the fact that the women were still to testify, as were some clients caught in the act.\n“We won’t ask for the women’s deportation but for them to remain to give evidence against the accused,” said Inspector Busuttil, pointing out that the risk of tampering with evidence was real.\nThe court, presided over by magistrate Audrey Demicoli, turned down the request, remanding both men in custody.\nAs the men were escorted out of the courtroom, their place was taken up by six young women, all Colombian nationals, the youngest aged 18 and the eldest 26, who were brought in one by one, weeping and visibly upset.\nKelli Johana Bermudez Patino, Yeiny Carolina Ayala Moncada, Luisa Fernanda Villalba Monsalve, Maria Valentina Sanchez Quiguanas, Laura Cristina Loaiza Acevado and Daniela Cardona Carrillo all pleaded guilty to living off the earnings of prostitution, running a brothel and using the premises for prostitution.\nPremises' title transferred to women\nWhen making submissions on punishment, Inspector Busuttil explained that the women had ended up as quasi victims since the men had apparently transferred the title to the premises onto them, upon sensing that the police were breathing down their necks.\nThey had even transferred to new premises, but the police had managed to track down both sites.\nDefence lawyer Gianluca Caruana Curran, counsel to all six women, pointed out that his clients had cooperated with the police and that a jail term would not be appropriate in their regard.\nIn the light of these submissions, the court declared all six guilty and condemned each of them to a 12-month jail term suspended for four years.\n“Tell her that her testimony might help others not to do the same thing,” advised the magistrate as one of the girls was led out.\nAfter the hearings, the six girls hugged and wept outside the courtroom, tears of relief streaming down their face. Inspector Roxanne Tabone prosecuted.", "comment_count": 0, "id": 541}, {"keywords": "", "author": "Jacob Borg", "article_body": "Economist Gordon Cordina said on Thursday that Malta needed to take a much more responsible attitude towards construction activities.\nSpeaking during a business breakfast organised by The Malta Business Weekly about sustainable employment, Dr Cordina said the construction industry’s share of the economy was actually decreasing as growth in other sectors outstripped it.\nThe economist quipped the best was yet to come for the construction industry judging by the number of permits approved last year.\nDr Cordina augured that these permits would translate into more regeneration projects.\nHe said that the construction industry might eventually have to return to more sustainable levels, and the country had to be ready to absorb any slack from construction into other areas.\nHe said that the housing stock and prices were not rising faster than economic growth. The Maltese population was amassing wealth and there was no big drive for credit.\nAll these factors pointed towards talk of a housing bubble being incorrect.\nDr Cordina said a sharp correction in housing prices could be generated by other shocks, but the sector would not inherently implode.\nTurning to the manufacturing sector, Dr Cordina said that far from dying a natural death, manufacturing was relatively thriving thanks to an increase in productivity.\nOn the public sector, Dr Cordina said the economy and society needed to obtain excellent value for money from public administration.\nHe said he was not worried about growth in the public administration sector if this was what the country needed.\nThe quality of the services provided by public administration had to be analysed before simply criticising its growth, he said.\nDr Cordina pointed towards the declining public debt to GDP ratio as one of the indicators that Malta was in good stead to weather an eventual economic downturn.\nHe said this flexibility was an essential insurance policy for the future.\nDr Cordina said that on the tourism front, Malta might be reaching its capacity limits.\nThis required even more focus on the shoulder months as well as the quality of the product on offer.\n‘Ageing population makes foreign workers necessary’\nJobs Plus chairman Clyde Caruana said that the demography and dynamics of the workforce in Malta had evolved.\nHe said that workers of 65 years of age would have changed two jobs on average during their working life, while those 30 years and under would have already gone through 9-10 jobs.\nIn the coming decades the younger generation will be very mobile in the labour market, he said.\nHe also warned of a decline in the amount of young, Maltese workers.\n“Ten years ago the number of 24-year-old natives stood at 6,000. In 15 years’ time, the figure will be around 4,000. In a short period of time that demography would have decreased by at least one-third”.\nMr Caruana said this trend was expected to remain.\nTo retain a sustainable and increased level of output per capita the labour supply had to be increased.\nHe said the choice was stark, either the number of foreign workers increased or economic growth slowed down.", "comment_count": 10, "id": 542}, {"keywords": "", "author": "Claire Caruana", "article_body": "Farmers needed pesticides to have good produce, Parliamentary Secretary Clint Camilleri said on Thursday, insisting on the importance of sustainable use of chemicals.\nAddressing a press conference at the government farm in Għammieri, the Agriculture Parliamentary Secretary said that with the action plan to be unveiled soon, the government would be working towards ensuring that the use of pesticides was more sustainable.\nThe government’s action plan, being drawn up together with the MCCAA, would seek to address issues related to pesticides and would be unveiled soon. A public consultation on the plan comes to an end on Sunday, with the authorities having held meetings with stakeholders in recent weeks.\nRead: Farmers not taking precautions risked pesticide poisoning, warns expert\nWhile insisting on the importance of farmers making good use of pesticides, Mr Camilleri emphasised that when used well, pesticides were crucial to farmers and their produce.\nOn what was leading to the overuse of pesticides by farmers, Mr Camilleri said that this was due to one of two reasons – either the farmer was not equipped with the skills on how to make good use of the chemicals or the fact that in Malta, the types of pesticides available was limited.\nAlso speaking at the press conference, Parliamentary Secretary for Consumer Rights Deo Debattista insisted that the action plan was important not only because it served as guidance to farmers but because it also meant that consumers would be even more protected.\nRead: Reviewed national action plan for sustainable use of pesticides in Malta\nHe insisted that the government wanted to someday have all organic farming in all farms, noting however that this was no easy feat, especially when one took into consideration the island’s small size.", "comment_count": 31, "id": 543}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 5.50pm\nA wild cat spotted pacing nervously on a roof is registered with the authorities, despite outrage by the public after footage emerged online.The original post on Facebook\nThe puma, allegedly kept on a roof in Fgura has a shelter and is well fed, even if neighbours said they can hear its continuous cries. \nThe individual who initially uploaded the video of Facebook has pulled down her profile following a backlash with the owner.  The video is available on the Animal Liberation Malta page.\nThe police were informed about the footage.\nA spokesperson for the Environment Ministry said the animal is registered with the authorities and meets the requirements laid down by regulations.\nUntil 2014, Malta did not have any legal definition of ‘dangerous animals’. A person could bring any animal to Malta if they had all veterinary and traces certificates, documentation, health and movement notifications and sometimes even passports.\nThe Animal Welfare Council started discussing regulation of exotic animals in 2010, but it was only in 2016 that subsidiary legislation on owning and keeping dangerous animals was adopted.\nAccording to the law, dangerous animals can only be kept in a licensed zoo unless permission is granted by the director of veterinary services for them to be kept in adequate enclosures.\nBobcats, caracals, cheetahs, jaguars, leopards, lions, lynxes, ocelots, pumas, servals and tigers are included in the dangerous animals’ list.\nWhen contacted, Animal Welfare Commissioner Denis Montebello said that he was following Thursday's case.\nIn 2017, former Animal Welfare commissioner Emanuel Buhagiar said he was against keeping large animals in Malta.\nHe said he did not believe the minimum standards for enclosures should be left to EU member states but that they should be regulated by the European Commission.\nMalta’s specifications for enclosure sizes are in line with those of the Swiss Ordinance, which he viewed as inadequate for large animals.\nIf you have any information about the cat's whereabouts send an email on mynews@timesofmalta.com. The source will be remain confidential.\n ", "comment_count": 122, "id": 544}, {"keywords": "", "author": "", "article_body": "More than 87,000 foreign students attended English language courses in Malta in 2018, according to official statistics.National Statistics Office figures show that the number of students last year remained almost exactly the same as in 2017, with the growth of nearly 14% that had been seen a year before slowing to a halt. \nMore than a quarter of all students came from Italy, followed by Germany and France, which all together account for nearly half of those attending English language schools.The largest share of students, around a third, were 15 years or younger, while women outnumbered men two to one.Summer remained the busiest period, with nearly half attending courses in June, July or August.These students represented 3.4% of all inbound tourists last year, spending a total of 215,252 weeks in Malta.The average length of stay was two-and-a-half weeks, down a couple of days when compared to 2017.With an average of 11 weeks in Malta, students from Colombia recorded the highest average duration, followed by South Korean and Turkish students with an average duration of 7.9 and 6.4 weeks respectively.There were 1,028 English-language teachers in licensed schools last year, around a third of them aged between 18 and 24. Women accounted for nearly three-quarters of all teaching staff.Non-teaching staff amounted to 721, of which just over half were employed on a full-time basis.", "comment_count": 4, "id": 545}, {"keywords": "", "author": "", "article_body": "The highest number of registered first-time applicants for asylum relative to the population of EU member states in 2018 was recorded in Cyprus, ahead of Greece, Malta and Luxembourg, according to Eurostat, the EU’s statistical arm.\nCyprus had 8,805 first-time applicants per million population, Greece 6,051, Malta 4,276 and Luxembourg 3,694.\nThe lowest numbers were recorded in Slovakia (28 applicants per million population), Poland (63), Hungary (65), Estonia (68) and Latvia (91).\n\nIn the EU as a whole, there were 1,133 first-time asylum applicants per million population.\nLast year’s number of applicants was down by 11% compared with 2017 (654,600) and less than half of the number recorded in the peak year 2015 when 1,256,600 first-time asylum applicants were registered. The number of asylum applicants in 2018 was comparable to the level recorded in 2014, before the peaks of 2015 and 2016.\nSyrian, Afghan and Iraqi continued to be the main citizenships of people seeking international protection in EU states in 2018, together accounting for almost 30% of all first-time applicants.\nThis has been the case since 2013. Of the 80,900 Syrians who applied for asylum for the first-time in the EU in 2018, more than half were registered in Germany (44,200, or 55%). Syrian was the main citizenship of asylum seekers in eight EU states.\n\nWith 41,000 first-time applicants (or 7% of the EU total) in 2018, Afghan was the second main citizenship of asylum seekers in the EU states. Almost 29% of Afghans applied in Greece (11,800). Afghan was the main citizenship of asylum seekers in five EU s.\nIraqi (7% of the total number of first-time applicants) was the third main citizenship of asylum seekers in EU states. Of the 39,600 Iraqis seeking asylum protection for the first-time in the EU in 2018, more than 41% applied in Germany (16,300). Iraqi was the main citizenship of asylum seekers in two EU states.\nAt the end of 2018, 878,600 applications for international protection in EU states were still under consideration by national authorities (excluding Finland, as data not available).\nAt the end of 2017, this figure was slightly higher (927,000). Germany had the largest share of applications pending in the EU at the end of 2018 (384,800, or 44% of the EU total), ahead of Italy (103,000, or 12%), Spain (78,700, or 9%) and Greece (76,300, or 9%).", "comment_count": 0, "id": 546}, {"keywords": "", "author": "", "article_body": "Fraudsters are using the details of a genuine Maltese entity to try to deceive the public, the Malta Financial Services Authority has warned.\nThe website https://securetrading-services.com/ falsely claims to be associated with a licensed and authorised organisation in Malta, the MFSA said in a statement. \nThe entity claims to have a presence in France, Luxembourg and the UK, with its head office located in Paris, France. These representations are believed to be false.\nThe MFSA said it can confirm that the website has no association with the authorised and licensed company Secure Trading Financial Services Ltd, which is a Malta-based company with a registered office in Birkirkara (company registration C56013).\nThe MFSA said the public should refrain from undertaking any business or transactions with the false entity. \nA list of entities licensed by the MFSA is available from the official website https://www.mfsa.com.mt/financial-services-register/", "comment_count": 1, "id": 547}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Those who paid undue VAT on car registration between 2004 and 2008, or their heirs, have to apply for a refund until April.\nThe six-year refund scheme for vehicles registered between May 1, 2004 and December 31, 2008 will come to an end this year, Finance Minister Edward Scicluna said on Thursday.\nIn 2009, the European Commission had declared that it was illegal to include registration tax in the taxable amount of VAT levied on car sales.\nSo in 2014, the government launched a refund scheme through which a total of 29,000 people would receive €23.6 million between them.\nAround €4.9 million will be distributed this year to 6,300 people who registered their car in 2008. They are being urged to file a refund application between next week and April 26 and will receive the refund in May.\nTransport Minister Ian Borg said the government was sharing its success with the public and will be concluding a chapter of past injustices.\nThe government did all it could to collect every due cent, however, whatever was collected unjustly needed to be returned to the people, he said.\nProf. Scicluna meanwhile noted that this tax should never have been collected and when Malta joined the EU, the Labour party, then in Opposition, had flagged the issue with the PN government.\nHe said the government could only refund people because of the steady economic growth that was now averaging 7.1% a year. This was a huge leap compared to the average 2.1% economic growth between 2007 and 2012.\nHow to get your refund\nThe government will this year refund the amount equivalent to the extra tax paid by vehicle owners who registered their vehicle between January 1 and December 31 of 2008.\nThe total they will receive will exclude the €110 (vehicles) and €55 (motorcycles) that was already paid back to everyone in 2014 with the launch of the scheme.\nTransport Malta will be notifying eligible applicants in writing about the scheme and whoever receives this notification should verify their personal details, sign and send the application to Grant Scheme, Transport Malta, A3 Towers, Triq l-Arkata, Paola or Għotja ta’ Darba, Ministeru ghal Għawdex, Pjazza San Franġisk, Victoria.\nThose who registered their vehicle between 2004 and 2007 but did not apply for a refund can still submit an application form that can be obtained from TM until April 26.\nMore information on 8007 2373 or grantscheme.tm@transport.gov.mt", "comment_count": 8, "id": 548}, {"keywords": "", "author": "", "article_body": "The European Parliament has voted for €10 billion to be dedicated to migration, with all political groups agreeing that the principle of solidarity and fair sharing of responsibility should serve as a legal basis for the proposed Asylum, Migration and Integration Fund.\nThe report was approved with 374 votes in favour.\nThe fund aims to address a number of objectives, included strengthening the Common European Asylum System, legal migration and social inclusion, solidarity and returns of persons who do not quality for protection. This also means that European regions and cities will also be given the necessary tools to address the challenges they face.\nLabour MEP Miriam Dalli fought hard to bring together political groups and members of the European Parliament who believe in solidarity and that frontline countries like Malta should not be left on their own.“I am extremely satisfied with the outcome of the vote. Had it been for the conservative forces, this fund would be spent in third countries and not within the EU, as is its aim. But today the European Parliament voted to support countries like Malta,” Dr Dalli said.“Whilst we need a decisive and common policy, it is important to remember that financial support is essential when countries like Malta end up in situations that this country faced in the past months. For example, money from this fund can be used to support relocation measures from countries like Malta to other states.”\nThe European Parliament's Civil Liberties Committee earlier this week approved objections for funding to include controlled migration centres established by member states.\nThe European Commission had tried last December to widen the scope of activities eligible for funding, with the aim of supporting national authorities struggling to cope with asylum, migration and integration, particularly for reception and accommodation for asylum-seekers or migrants in irregular situations.", "comment_count": 9, "id": 549}, {"keywords": "", "author": "", "article_body": "Political party access to the scans of cast ballot sheets for up to three months after an election opened a very dangerous can of worms as it would be possible to highlight specific voting patterns, Partit Demokratiku said.\nIt was imperative that there was transparency and a clear plan of action to prevent abuse, for even after the three months of access were over, how would one be able to ensure that political parties were no longer holding the data.\nAccording to proposals by the Electoral Commission, political parties will be given access to scans of all valid votes cast, along with their interpretation by the e-counting software set to be introduced during the May MEP elections.\nThe data can be held by the parties “for verification purposes” for a three-month period, after which it has to be deleted.\nRead: PN stays coy on ballot sheet concerns\nPD said that through such access, political parties would be able to predict which MP would be elected in a by-election, and would be able to strategically plan ahead in a way which defeated the spirit of democracy.\nIt was unacceptable that the country was moving ahead and shrugging shoulders with a flawed system which did not fully adhere to the principle of the secret ballot, a legal requirement for a European election.\n“If the way we vote is going to be opened up for abuse, then there should be no question that switching to electronic counting is a step backwards… Godfrey Farrugia and Marlene Farrugia voted in favour of electronic counting because the Party believed in modernising our voting system, but the understanding is that it must not come with any loopholes, risks or potential for abuse.\n“As part of the Opposition, PD is not going to shrug its shoulders and accept this situation as a fait accompli,\" deputy leader Timothy Alden said.\nThe party said it was urging the Electoral Commission to revisit these flaws immediately, and political parties to take stock of the situation and a step back.", "comment_count": 4, "id": 550}, {"keywords": "", "author": "", "article_body": "The Home Affairs shadow minister has called for political responsibility to be shouldered following the death of a prisoner in custody on Wednesday.\nA 39-year-old prisoner awaiting trial for attempted murder was found dead in his cell at Corradino prisons on Wednesday afternoon.\nIn a statement on Thursday, Beppe Fenech Adami said that no prisoner, whatever his crime, should die or allowed to take his own life while in prison.\nHe said that in spite of the government’s public relations exercises in the past weeks, the death of another prisoner in custody was confirmation of the dire situation at the facility.\nWhile it was still important for one to pay for his mistakes through detention, the reform and rehabilitation of prisoners was as important.\nThe government was failing in this and a person had again died under the eyes of those who were supposed to be rehabilitating him. Minister Michael Farrugia should explain this failure, because each life was precious, Dr Fenech Adami said.\nIn December, a 26-year old inmate was also found dead at Corradino Correctional Facility. ", "comment_count": 0, "id": 551}, {"keywords": "", "author": "", "article_body": "The President’s Foundation for the Wellbeing of Society has urged authorities to remain vigilant against online sexual abuse, after a media sting operation had revealed the troubling reality of online predatory behaviour.\nTVM's Xarabank last week revealed the outcome of an investigation in which a fake Facebook profile purporting to be that of a 13-year-old girl was inundated with messages, as well as sexual photos and videos, from men seeking to meet the girl for sex. \nIn a statement, the President's Foundation urged national authorities to continue working in synergy with civil society, educational institutions, and other relevant stakeholders, to identify, prevent, and end the criminal activity of potential and actual online predators, in a timely and efficient manner.\n“We must all join in the work of protecting the youngest members of our society, to ensure that the holistic wellbeing of each and every person in the Maltese Islands is effectively safeguarded,” the foundation said.\nRead: Protecting your children from online sexual predators\nWhile reaffirming the right of every child to grow up in a caring and loving environment, the foundation said that since online abuse manifested itself in psychological harm to victims, authorities should ensure that parents and caretakers had the necessary resources to properly care for their children’s online welfare and the reassurance that legal enforcement is swift and effective.Online sexual abuse involves the misuse of web cameras, mobile phones, social media, and other means to coerce targeted victims into inappropriate and sometimes illegal sex acts.\"Preventing child abuse is an effort that must be undertaken in all our homes, our schools, and our communities,\" the foundation said. \"Online child abuse is a unique form of abuse, which may not happen face-to-face, nor does it necessarily require physical contact. It can also result in negative in-person consequences, including rape, sexual assault, and harassment.\"", "comment_count": 0, "id": 552}, {"keywords": "", "author": "", "article_body": "A rare historical volume dating to 1728, banned by the Vatican when first published, has been donated to Heritage Malta by an Irish couple.Patrick and Anne Hegarty donated a copy of the first volume of the series Histoire des Chevaliers Hospitaliers Saint-Jean de Jérusalem, translated into English, originally published by the Abbé René Aubert de Vertot in 1726.Only a few copies of this volume are in circulation since it was banned by the Vatican due to its anti-Papist content.“My father Jack was an avid collector of antiques, especially of old Irish silver, porcelain and artworks,” Mr Hegarty said.“He loved going around antique shops with his friends on Saturday mornings in search of that something special. This rare historical volume was one of his discoveries, probably around 60 years ago.“I decided to donate this book to Heritage Malta because I believe that it belongs here in Malta. That’s where its spiritual home is. There is no point in keeping it in a house in Ireland where nobody gets to see it.“At least in this way, it can be enjoyed by the Maltese people and by all those who come to visit this Museum.”Abbé René Aubert de Vertot was a provincial clergyman who was commissioned by the Order of St John to serve as its chronicler in order to formulate the history of the Order from its humble beginnings in Jerusalem up to the year of publication of the book.I believe that it belongs here in Malta. That’s where its spiritual home is.In his writing, he provides a lively account of the history of the Order of St John, from its earliest beginnings to the conclusion of the Great Siege of Malta in 1565, supplemented by succinct Annals of the Order up to the year 1725.Vertot spent 13 years compiling all the information to work on this book. However, in the end, the final result shocked the Church. In the course of the 600-year description, he discussed the formation and expansion of the Templars, their rivalry with the Hospitallers, and their eventual dissolution. He explained the rise of the Turks and of Mahometanism and referred to the heroism and barbarism of warfare and sieges. Moreover, he focused on the corruption and greed of many of the popes and cardinals.The anti-papist statements in the book attracted the outrage of the Inquisition, leading to the work being banned by the Vatican. Yet it was this prohibition which made the book even more popular and successful.Malta Maritime Museum’s principal curator, Liam Gauci, thanked Francis Spiteri Paris for spearheading this donation to Heritage Malta.“Our Maltese national collection have been enriched further with this prestigious donation which will be exhibited at the Order of St John’s section of the Malta Maritime Museum in Birgu.”", "comment_count": 31, "id": 553}, {"keywords": "", "author": "Sarah Carabott", "article_body": "While the rest of us discuss climate change, students at Savio College have rolled up their sleeves and increased the number of indigenous plants at their school by 50%.\nThe trees and shrubs are watered through an irrigation system fed by a rainwater reservoir, which the college has just acquired EU funds to restore. \nUnfortunately, half of the water in the four-metre deep reservoir, which is also used for sanitary facilities, is being lost as the cistern is in desperate need of repair.\nTrees and shrubs at Savio College are watered through an irrigation system fed by a rainwater reservoir. Photos: Jonathan Borg\nThe EU fund is not the only source the school has tapped into to become greener. Over the past five years, the Dingli college, which hosts 258 students in 10 classrooms, has acquired government funding and private industry sponsorships to turn its energy consumption into an environmentally-friendly one.\nThe school installed photovoltaic panels on its roofs, which feed into its electricity grid. Live data is projected on a screen situated at a prominent spot in the school, allowing students to understand the size of the carbon footprint the environment is being spared through the PV system. \nThe information is broken down in terms of CO2 emissions and the equivalent in kilometres that a car would run on that energy.\nPhoto: Jonathan Borg\nAll the water heating systems at Savio College, which also hosts live-ins, run on gas, while the electricity system has been changed into an LED one. Corridors have had intelligent lighting installed so lights do not remain on when no one is in the area.\nWhile enhancing the school’s indoor and outdoor spaces, historical sites on its grounds – such as Punic tombs, an 1867 donkey shed and a girna – have also been added to a heritage trail accessible to the public.\nThe pupils had been inspired by the Pope’s encyclical\nHead of school Fr Jeremy Vella told Times of Malta they wanted to create a sense of sensitivity towards the community and, most especially, the environment. This allowed students to put in practice the values the school tried to pass on through its religious ethos.\nPhoto: Jonathan Borg\nWhile the school was becoming greener, inspired by the keen students’ ideas, they were also being exposed to how this all tied in with corporate social responsibility, he noted.\nStudents’ Council president Juergen Valletta noted that the pupils had been inspired by the Pope’s encyclical on the environment Laudato Si’ and had ensured everyone’s contribution to a greener school.\nThis included decorating classrooms with recycled materials, such as a Christmas tree made out of plastic bottles, separating waste in classrooms and coming up with ideas on cutting down on the food carbon footprint.\nThese activities supplemented others within the larger Dingli community where students lent a helping hand to those in need, including banking food for the parish’s most vulnerable.\nPhoto: Jonathan Borg", "comment_count": 3, "id": 554}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Planning Authority said it found no objection to the placing of pre-fabricated offices by a Turkish construction firm on the water’s edge in Tigné, Sliema. \nResidents told the Times of Malta that a few weeks ago, following the start of construction works on the Fortina Hotel site, TACA construction, which started importing construction employees from Turkey to work on the site, placed the unsightly structures on the water’s edge, just across from the former hotel. \nFollowing a visit by Times of Malta, it emerged that the structures were being used as offices by TACA and not as living quarters. \nAsked to state whether the placing of these container-like structures, metres away from a pool used by tourists, was covered by the necessary permits, a spokesman for the Planning Authority said this was not necessary.\n“The case was investigated and the containers are temporary site offices and are within the footprint of the development permit for which no planning permission is required,” the spokesman said.\nAnkara’s TACA Construction already hit the headlines a few weeks ago when the Times of Malta discovered the setting up of a container village in a quarry outside Mqabba to house hundreds of employees working on construction projects.\nTens of containers and a large tent had already been placed in the secluded quarry belonging to road construction group Bonnici Brothers, while a number of employees were already ‘living’ in the quarry.\nReports said that the company, which was already tasked to build the new Fortina project and the db Group tower and hotel on former public land at St George’s Bay, was planning to import some 2,500 employees during the coming years.\nHowever, following the news on the Mqabba ‘Turkish’ village, the company abandoned its plans and instead said that it was going to house its employees in normal accommodation facilities. It also said that for the time being it only planned to import some 500 workers which were contract bound not to bring their families.\nTACA insisted that its construction workers were not paid ‘cheap labour’ rates but their packages consisted of a salary, free food and accommodation.\nA few weeks ago, Prime Minister Joseph Muscat said the country needs to keep importing such workers if the Maltese wanted to keep receiving increases in their pensions and other social benefits.", "comment_count": 43, "id": 555}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says a new study shows that early deaths due to air quality in Malta were more than twice as high as previously thought, with 576 people dying prematurely every year of diseases brought on by airborne pollutants. In another story, the newspaper says that according to United Nations members states, Malta must step up its fight against corruption and impunity, also bolstering human rights bodies.\nThe Malta Independent says NGOs have called on the EU Commission to investigate the potential lack of enforcement of EU rules in the Maltese fisheries sector.\nIn-Nazzjon quotes PN leader Adrian Delia saying that rather than safeguarding the interests of the people, the Attorney General ended up being the Prime Minister and ministers’ lawyer.\nL-Orizzont says the Civil Protection Department received 37 calls for assistance on Tuesday.", "comment_count": 1, "id": 556}, {"keywords": "", "author": "", "article_body": "Capping pensions at a maximum that was never raised was “abusive” and “discriminatory” against elderly people, the president of the National Council for the Elderly, Anthony Mulè Stagno, said on Wednesday.\nDuring a discussion by the House Social Affairs Committee on the abuse of the elderly, Mr Mulè Stagno argued that many pensioners were in precarious situations, often working for less than the minimum wage on the pretext that they were part-timers. \nWhen pensions were introduced, the maximum was intended to be index linked to the salary of the President of Malta, he recalled. \nHe said he did not receive the maximum social security pension, which he had a right for since he was also entitled to a Treasury pension. In this context, the fact that other categories of pensioners could receive four concurrent pensions was unfair, he lamented.\nMr Mulè Stagno said many elderly citizens abused by their children, whether financially, physically or otherwise, did not report it for fear of being abandoned.\nCriminologist Saviour Formosa noted that although Malta was a rather safe country, repeat victimisation was a problem, especially in cases when the aggressor was a family member.\nThere had been an overall drop in the crime rate in recent years, although the number of victims was increasing due to a bigger population. Whereas crime had, in the past, tended to be of a more public nature, it was increasingly making itself felt in the private and technological spheres, with domestic violence becoming more prevalent than bodily harm.\nProf. Formosa argued that the elderly were most vulnerable to crime during the morning hours, when their regular routines exposed them to those noticing their movements. He called for a targeted approach to defending the elderly from such vulnerabilities and to address an expected increase in cybercrime and other technological offences, adding that unreported “dark crimes” had to be given more attention.\nAnthony Scerri, from the Department of Nursing at the University of Malta’s medical school, said there were far more incidents of abuse than were reported.\n“Healthcare professionals were indispensable when it came to reducing the incidence and impact of abuse, often being the first to recognise warning signs,” Dr Scerri said.\nThe prevalence of abuse in healthcare institutions was unknown, with cases mainly involving elderly patients who suffered from physical or cognitive disability. \nPatients suffering from dementia, he added, were sometimes placed under excessive restraint out of fear they would run away.", "comment_count": 10, "id": 557}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Early deaths due to air quality in Malta are more than twice as high as previously thought, with 576 people dying prematurely every year of diseases brought on by airborne pollutants, a new study shows.\nResearch published in the European Heart Journal used new data on the health impacts of air pollution to estimate that about 800,000 people a year across the EU die early and that the average person loses two years of life.\nMalta’s figures – which compare to previous estimates of between 250 and 270 early deaths for the same period – are slightly worse than the EU average. Compared to the population, Malta experiences 137 early deaths per 100,000 people, when the EU average stands at 129 per 100,000. \nRead: Deaths due to air pollution increase\nThe corresponding figures were 98 in the UK and 154 in Germany, while some eastern European countries had more than 200 deaths per 100,000. Most deaths were caused by heart disease, followed by respiratory tract illnesses, pulmonary disease, lung cancer and others.\n“To put things into perspective, this means that air pollution causes more extra deaths a year than tobacco smoking,” Thomas Münzel, who led the study at the University Medical Centre Mainz, in Germany, said. \n“Smoking is avoidable but air pollution is not.”\nResearchers made their estimates using a new simulation model that combined data on air pollution exposure, population density and age as well as the health impacts of dirty air.\nRead: Malta's air pollution among the worst in Europe\nThe dramatically higher estimates are due to previously-unavailable data on the effects of very high levels of fine particulate matter (PM2.5), which earlier research had tried to make up for by using data from second-hand smoking studies. \nThe new model used an expanded database taking into account 41 studies from 16 countries, including new data from China, where pollution levels are higher than in Europe and North America. The authors acknowledged a degree of uncertainty to their estimates, which, when taken into account, provide a range of between 473 and 677 early deaths per year in Malta.\n“Improving European air quality is an achievable, highly effective and, therefore, imperative health promotion intervention,” the authors added. \n“By replacing fossil energy sources with clean, renewable fuels, the attributable mortality rate in Europe could be reduced by 55 per cent.\n“Further reductions are feasible by additionally controlling other industrial and agricultural pollution sources.”", "comment_count": 105, "id": 558}, {"keywords": "", "author": "Denise Grech ", "article_body": "The parliamentary secretary responsible for citizenship on Wednesday denied that a man described as having blown the whistle on an Algeria visas scam had been singled out for revocation of his Maltese citizenship.\nReplying in parliament to remarks made on Tuesday by Jason Azzopardi, Julia Farrugia Portelli said the Nationalist MP had been very selective and misleading in his remarks.\nShe said that Alex Fezouine had not been singled out but was among a group of 17 against whom proceedings had been started. Their citizenship had not been revoked and  they had a term within which to argue before a board why their citizenship should be maintained.\nWhile Dr Azzopardi had claimed that Mr Fezouine could not have his citizenship revoked for vitiated consent of his marriage, Mr Fezouine had actually been found by a court several years ago to have married a Maltese woman solely for the purpose of attaining Maltese citizenship. This amounted to marriage of convenience, which was a valid reason for citizenship to be revoked, she explained. \nThe court judgement quoted by the parliamentary secretary. The name of the Maltese woman involved in the 'marriage of convenience' has been removed.\nMr Farrugia Portelli said a simple Google search of court records was enough to show how Dr Azzopardi was incorrect. \nA court had found Mr Fezouine had initially told his then partner he was French not Algerian. Three days after he was married, he applied for citizenship and asked authorities to rush the application so that he could visit his brother. The court concluded he had married the woman solely for purposes of acquiring citizenship. \nWhy had Dr Azzopardi ignored what the court had declared, she asked.\nShe also noted a document dated from 2006 - when the Nationalist Party was in government - where Mr Fezouine was listed among people found to have a marriage of convenience. \"Why did the government not act at the time,\" she asked. \nThe present government, she said, was simply rectifying the situation.\nMs Farrugia Portelli also pointed out that while Mr Fezouine was being described as a whistleblower, he never followed the procedures laid down under the Whistleblowers Act.\nPerhaps, she said, Dr Azzopardi could have spoken more about his history, such as the way he had been employed by a Nationalist MP, and why he was no longer in employment. ", "comment_count": 27, "id": 559}, {"keywords": "", "author": "", "article_body": "A 39-year-old prisoner was found dead in his cell at Corradino prisons on Wednesday afternoon.\nThe police said the man was found dead shortly after 5pm in Division II.  \nThe police are investigating and a magisterial inquiry has been appointed. The prisons are also holding an internal inquiry.\nThe man was awaiting trial for attempted murder.\nThis is the second such case in three months.\nIn December, a 26-year old inmate was also found dead at Corradino Correctional Facility.  A magisterial inquiry and internal investigation had also been ordered in that case.", "comment_count": 6, "id": 560}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A self-confessed drug addict who assaulted and tried to rob an 81-year-old man had been jailed for just over five years after a court found that he had wasted several opportunities to get his life back on track.\nSimon Borg, 33, was accused of attempted theft aggravated by violence and  with having slightly injured the victim last October in Zerafa Street, Marsa.\nHe was further charged with having committed the crime during the operative period of a suspended sentence, breaching bail and relapsing.\nThe 81-year old man had been chatting to an elderly friend when something brushing against his back trouser pocket.\nHe turned around and spotted Mr Borg, who pushed him to the ground. He landed face down beneath the pavement.\nAs he struggled back to his feet, blood streaming from a cut above his eye, the elderly man had seen Mr Borg as though about to strike him when somebody behind him suddenly halted him in his tracks.\n“Why pick on that man? Strike me not him. He’s a poor old man,” the voice had called out, startling Mr Borg who was ordered to sit down and not move.\nThat voice had belonged to a stranger who had been driving by and had stopped to help. He was never identified.\nMr Borg was arrested by a police patrol which was quickly on the scene. \nMagistrate Marse-Ann Farrugia observed that Mr Borg had confessed to the police about having consumed synthetic drugs and pills some time before the incident.\nHe told the police that he never had any intention of hurting or robbing the old man and had no recollection of the whole episode since he had been ‘out of his senses’ at the time.\nWhen delivering judgment, the court gave a detailed explanation of what constituted ‘pickpocketing’, pointing out that this offence did not require many preparatory acts.\nNormally, the accused would not even have a particular victim in mind but acted on the spur of the moment, pouncing upon some individual whom he happened to spot in a public place and who seemed likely to be carrying cash and appeared vulnerable, the court observed.\nSuccess depended on “the agility of the thief to rob his victim in a few seconds without giving the latter the chance to realize and react, before making his escape,” the court went on.\nIn this case, the elderly man had been carrying a wallet containing some €350 in cash and the attempted theft had been thwarted by the simple fact that the accused had not been nimble enough in pulling the wallet out of the victim’s pocket, the court observed.\nThere was no evidence of any intention other than that of robbing his victim, said the court, adding that the failure to commit the theft was totally irrelevant.\nMoreover, contrary to what had been argued by the defence lawyer, the accused had not freely chosen not to leave the scene but had been made to stay out of fear of the stranger who had thwarted his attempt.\nWhen meting out punishment, the court observed that the accused had six past convictions, two of which related to 13 instances of aggravated theft, and had wasted several opportunities for reform given by the courts.\nHis probation officer, who had been following him since 2010, had testified as to how the accused had suddenly vanished from a shelter last August, merely days before he was due to enter rehabilitation.\nIn the light of all evidence, the court declared Mr Borg guilty and condemned him to five and a half years imprisonment, also ordering the confiscation of a bail bond of €6,000.\nInspector Robert Vella prosecuted.", "comment_count": 1, "id": 561}, {"keywords": "", "author": "Denise Grech ", "article_body": "Migrants at the Marsa Open Centre spent three days on an unofficial hunger strike to \"protest their de facto detention\" and \"systematic violation of human rights\", NGO Mediterranea Saving Humans said.\nThe migrants, who came from the Sea-Watch and Sea-Eye vessels, were also demanding clarification on the procedures for relocation to other member states, the group said.\nSources in close contact with the migrants said the \"hunger strike\" started March 5 but that it was unofficial.\nOne thing was clear, however: they were frustrated at being stuck in Malta and they thought the food was inadequate, they said.\nThe ministry denied that there was any official hunger strike but did not clarify whether there were people who had repeatedly refused to eat.\nOver 40 men and women reached Maltese shores after an agreement to share them out between several EU member states in January.\nMigrants had repeatedly expressed frustration at being kept in the dark about the relocation processes. They were expected to be relocated to Germany, France, Portugal, Ireland, Romania, Luxembourg, the Netherlands and Italy, spent 19 days aboard the two NGO rescue ships.\n\"We learned from those in Marsa that delegations from France and Germany have excluded several people from the possibility of being relocated there, without any reason being given and without the refusal being communicated in writing, making it impossible to use legal means to fight against the decision,\" Mediterranea Saving Humans said.\n\"Others have not had any news about their transfer and have not even had access to the first phase of this informal mechanism, which consists in an interview by officials from the states which are to be their destination,\" they added.\nThe fate of the migrants meanwhile remains unknown, the group said.", "comment_count": 27, "id": 562}, {"keywords": "", "author": "", "article_body": "Three people were hospitalised on Wednesday afternoon after a head-on collision between a car and a cement mixer in Triq Monsinjur Mikiel Azzopardi in Siġġiewi.\nThe Civil Protection Department had to be called in to get the driver of the car out of the wrecked vehicle. The 52-year old, who resides in Siġġiewi, was found to have serious injuries.\nThe 62-year old driver of the cement mixer, who lives is Attard, and his 19-year old passenger, from Siġġiewi, were both taken to hospital for treatment. The 19-year-old was found to have suffered serious injuries.\nThe police are investigating and magistrate Astrid May Grima is leading an inquiry into the incident. ", "comment_count": 0, "id": 563}, {"keywords": "", "author": "", "article_body": "Parliament will vote on the nomination of George Vella as Malta's next president on Tuesday April 2, MPs decided on Wednesday. \nThe vote on Dr Vella will be taken during a special parliamentary sitting during which parliamentarians will also salute outgoing president Marie-Louise Coleiro Preca. \nShould the vote be passed, as is expected, Dr Vella will be sworn in as Malta's head of state on Thursday April 4, taking his oath of office at noon at the Presidential palace. That ceremony will follow an investiture Mass held at St John's co-Cathedral. \nA medical doctor with decades of experience in politics, Dr Vella was nominated to succeed president Coleiro Preca last week.\n\"I am sure Dr Vella will be another unifying figure for our people and country,\" Prime Minister Joseph Muscat said when announcing his nomination.\nOpposition leader Adrian Delia has said that the Nationalist Party will support Dr Vella's nomination, in the national interest. ", "comment_count": 7, "id": 564}, {"keywords": "", "author": "Ivan Martin", "article_body": "Maltese students will join others around the world in demanding action to combat climate change on Friday with a symbolic strike.\nStudents will be marching from the University of Malta to Parliament in Valletta at noon, as thousands of others around the world also hold rallies and marches of their own.\nIgnore global warming... at Malta's expense, protesters warn\n“The University of Malta student council shall be rallying students and youths in Malta to participate in this Friday’s global students4climate strikes. The strikes so far have students in a hundred countries confirmed participating around the globe,” KSU President Carla Galea said on Wednesday.\n“We are calling on all students to join us to take action on our future,\" she added.\nThe road between the University’s Msida campus and Valletta will be closed for 30 minutes, between 12.30pm and 1pm, this Friday, as part of the march.\nSteve Zammit Lupi, who helped organise the local strike, said students from Valletta’s St Albert the Great College would also be gathering in front of Parliament.\nMalta again fails emission test, has to pay \"hundreds of thousands\"\nOther schools were being encouraged to hold events on school grounds too.\nThe wave of youth activism began with 16-year-old Greta Thunberg from Sweden, who last August began camping outside the Swedish parliament and accused lawmakers of failing to uphold their commitments to fight climate change as agreed to under the Paris climate accord.\nWatch: Thousands skip school for climate protests\nThe young Ms Thunberg says she was inspired by students from the Parkland school in Florida, who walked out of classes in protest against the US gun laws that enabled a bloody massacre on their campus.\nAs word of her strike spread, she made headlines, and was invited to speak to climate negotiators in talks last December in Poland and more recently to global leaders in Davos, Switzerland.", "comment_count": 31, "id": 565}, {"keywords": "", "author": "", "article_body": "A 63-year-old man from Safi was seriously injured on Wednesday afternoon when he fell a height of just under one storey at a construction site.\nThe incident happened in Dragonara Road, St Julian's, at about 1.30pm.\nThe man was rescued by personnel from the Civil Protection Department who used a crane to lift him on a stretcher. ", "comment_count": 0, "id": 566}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta will be asking for millions of euros from the EU’s solidarity fund to cover the costs of the damage caused by last month’s freak storm.\nGovernment sources said a review of how much money was required had already indicated “more than €10 million” though the exercise was ongoing.\nMalta has only tapped into the fund once before, in 2004, when it received about €960,000 to help deal with floods that had hit the island the previous year.\nFunds required to replace street furniture alone was estimated at more than €2 million, the sources said. This, they noted, excluded damaged breakwaters or piers.\nDubbed the worst since 1982, the storm that battered the islands during the last weekend of February caused significant damage across the country. In 48 hours, the Civil Protection Department received and assisted in a record 486 emergency calls, in many cases also with the help of the police and other emergency response teams.\nPrime Minister Joseph Muscat had announced that the government would be seeking to tap the EU’s solidarity fund to help rebuild and repair. Gale-force winds that reached gusts of up to 133 km/hour lashed Malta, uprooting trees, demolishing walls and damaging power lines.\nThe February storm caused massive damage.\nA spokeswoman for EU Funds Parliamentary Secretary Aaron Farrugia told the Times of Malta on Tuesday the government was at an advanced stage of evaluating the extent of the damage costs and the secretariat was coordinating with a number of ministries to finalise the figure.\nAgriculture, fisheries badly hit\nThe government sources said agriculture and fisheries were two sectors that sustained heavy damage. Some schools and sports facilities had also been ravaged by the winds.\nAccording to EU regulations, Malta has 12 weeks from the date of first notifying Brussels of its intent to apply for funds to complete the application process. However, it will likely take much longer than that for Malta to actually see any money heading its way from Brussels.\n“It is worth noting that the European Union Solidarity Fund is not a rapid response instrument for dealing with the effects of a natural disaster. Financial aid can only be granted to the applying State following an application and budgetary process which can take several months to complete,” Dr Farrugia’s spokeswoman said.\nInsurers are still grappling with claims from policyholders who suffered damage to property. \nThe director general of the Malta Insurance Association, Adrian Galea, said it was still “too early” to establish the amount that would be claimed. While insurers also had to establish what sort of claims would be filed, Mr Galea said he expected the majority to be related to buildings and their contents, building sites and vehicles.\nPolicyholders, he said, were not always quick to make claims and, in fact, they were still trickling in.", "comment_count": 79, "id": 567}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An appeals court has cleared a man of charges of violent indecent assault on a young mother after a court deemed her version of events as not credible.\nThe 60-year old father from San Ġwann was arraigned after his neighbour told the police that she had been groped by him when she had followed her 4-year old son into his garage.\nThe alleged incident took place in March 2012 when the woman’s son spotted the man and ran over to him shouting “Boat, boat, boat,” indicating a boat near the neighbour’s garage.\nThe man had lifted the child into the boat and had subsequently carried him into the garage to see his caged owl.\nThe mother said she had followed her child into the garage where the owner, still carrying the boy on his arm, had allegedly pushed her against a wall, slipping a hand under her top and groping her.\nAs the woman attempted to pull back, the man had allegedly warned her not to tell the police, threatening her “to do worse,” and take away her child.\nThree days later, the woman filed a report at the local police station, accompanied by her mother who had urged her to take action.\nThe suspect molester denied any wrongdoing and gave his account of the meeting with the woman and her son who apparently held a ‘soft spot’ for the man.\nThe man was accused of violent indecent assault and with having slightly injured the alleged victim who had been certified as bearing two fresh bruises, some 2 centimeters in size, on her breasts when she was examined by a doctor three days after the alleged episode.\nThe man was convicted in December 2015 and handed a 9-month jail term suspended for 3 years, prompting him to file an appeal, protesting his innocence.\nThe Court of Criminal Appeal, presided over by Madam Justice Consuelo Scerri Herrera, observed that according to the evidence, throughout the alleged incident the accused had been carrying the 4-year boy on his arm.\nThis scenario, together with other evidence, made the woman’s version rather unlikely since it was “inconceivable” that a man, carrying such a load, could have groped the woman.\nMoreover, the bruises on the woman’s body had been certified as “fresh” three days after the incident. The doctor who had examined her had testified that the woman had claimed to have been beaten, but that she recalled nothing else.\nThe accused’s son and a friend who had happened to be outside the garage at the time of the alleged aggression had also testified as to how the woman had chatted to them after leaving the garage. She had appeared to be “normal” and spoke of her desire to find a suitable partner.\nA psychiatrist had also testified how the alleged victim had been a patient of his for three years before the incident, needing treatment for depression.\nThe first court had pinned guilt on the basis of the presence of the bruises on the woman’s breasts, but these did not suffice to prove guilt beyond reasonable doubt, the court of appeal observed.\nThe judge also observed that the woman had added allegations as she told her story over and over, until she finally alleged that the accused had even demanded sex - a fact not corroborated by any other witness.\nNor had there been any evidence of crying or shouting by the child throughout the alleged ordeal, the court observed.\nIn the light of all this, the court declared that the woman was not credible and that the conclusion by the first court had not been “safe and satisfactory,” thereby upholding the appeal and pronouncing an acquittal.\nLawyers Edward Gatt and Mark Vassallo were defence counsel.", "comment_count": 0, "id": 568}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta’s underwater heritage is set to receive an extra level of attention and protection with the setting-up of a dedicated unit within Heritage Malta.The new Underwater Cultural Heritage unit will be headed by maritime archaeology professor Timmy Gambin and will aim to protect and increase public appreciation of underwater remains.“Any nation has an obligation to share its cultural heritage. Heritage Malta has taken a bold step by taking underwater cultural heritage under its wing,” Prof. Gambin told Times of Malta at a launch event on Wednesday. “Through the activities of this unit, we will be sharing this heritage not only with those who can access it, such as divers, but also with the general public.”This goal, Prof. Gambin said, would initially be achieved through outreach programmes for the public using videos, imagery and virtual reality technology.Describing the new unit as the product of a long process of continuing collaboration between the University of Malta and heritage, culture and tourism authorities, Prof. Gambin stressed the challenge of protecting and managing underwater sites. “You cannot just build a wall and hire a watchman,” he said. “We believe in the power of educating the public on the importance of this unseen cultural heritage. We will have monitoring programmes but I believe the main thrust will be education.”\nCulture minister Owen Bonnici said the setting-up of the new unit was a “historic” moment for Heritage Malta. “Until now, it has been as though we were ignoring one half of Malta’s cultural heritage,” he said.\nMalta's seas are dotted with hundreds of wreckages of planes - many dating back to World War II - and ships from across the centuries.\nOne 2,700-year old Phoenician wreck discovered off Gozo is believed to be the oldest in the central Mediterranean, and explorations - led by Prof. Gambin - have yielded important historical artefacts including North African amphorae and grinding stones from Pantelleria. \nThe new unit will be supported by legislative changes aimed to regulate access to wrecks, where divers have regularly complained of a free-for-all situation, including registration for diving schools and restricting irresponsible practices at sensitive sites. ", "comment_count": 7, "id": 569}, {"keywords": "", "author": "", "article_body": "Updated at 4.29pm with Foreign Ministry's explanation below - \nMaltese authorities have refused to issue a visa for the one-year-old baby of a Turkish investigative journalist, MEP David Casa has claimed.\nPelin Ünker, who is currently facing a 13-month jail sentence for having reported on the secret financial dealings of relatives of Turkish politicians, was due to fly to Malta with her husband and infant child to attend a vigil for murdered journalist Daphne Caruana Galizia vigil on Saturday. \nRead: MEPs rally to defend Turkish journalist jailed for Malta story\nIn a statement decrying the \"unbelievable\" decision to deny Ms Ünker's child a visa, Mr Casa said that authorities had \"taken issue\" with a baby but had no qualms about issuing visas to \"hundreds of Turkish construction workers\". \n\"What the Turkish government has tried to do - to separate a mother from her child - is now being done by the Maltese one,\" Mr Casa said. \n\nDespite the visa trouble, Ms Ünker would nevertheless be visiting Malta for \"a few hours\" and speaking at Ms Caruana Galizia's vigil, he added.  \nMs Ünker's visit to Malta follows an invitation from Mr Casa, who visited her and her legal team in Istanbul.\nAddressing the European Parliament on Tuesday, Mr Casa appealed to the European Commission and the Council to urge the Turkish authorities to drop the charges against Ms Ünker.\nForeign Ministry explains\nIn a reaction to Mr Casa's claims, the Foreign Ministry said members of Ms Unker's family were not granted a visa given a previous decision which was already taken by another Schengen member state, whose authorities rejected similar applications by the same individuals.\nThe application was treated in accordance with standard procedures, the ministry said.", "comment_count": 59, "id": 570}, {"keywords": "", "author": "Claire Caruana", "article_body": "Efforts to address dwindling birth rates need to go beyond merely “opening up more childcare centres”, the University’s Labour Studies centre head believes, as data confirms the Maltese are having the fewest babies in Europe.\nAt 1.26 births per woman, Malta’s fertility rate is not only the lowest in Europe but women are having the fewest number of babies in more than a decade, an issue that the centre’s director, Anna Borg, insists needs to be urgently addressed.\nIn comments to the Times of Malta following Eurostat’s publication of data on fertility, Dr Borg said that workers in Malta had more restriction when they came to having children because there has not been enough investment in promoting a so-called “dual-earner” culture where both women and men may choose to work or raise children. \nThat meant that women were still being forced to choose between having a career and having children, Dr Borg said. \n“We have done some things to address the situation but in reality these have been rather futile.\n“We may think that we have solved the problem by introducing free childcare, for instance, but no, we haven’t,” Dr Borg said. \nThe Labour Studies director had warned in the past that if pressures that women faced when they had children were not addressed, the birth rate will not improve. \nFamily leave is not generous enough\nAsked whether she was concerned that despite efforts in recent years, not only these have failed to yield significant results but the rate was at its lowest in a decade, Dr Borg reiterated that “much more needs to be done”.\n“Family leave in Malta is not generous enough. Paid maternity leave is just 18 weeks. You cannot expect a woman to be ready to return to work in such a short period of time,” the director stressed, pointing out that paternity leave remained unpaid. \nFor there to be any significant change, Dr Borg said, the issue needed to be taken much more seriously, adding that changes to the law would also have to be considered in order to better address certain issues.\nAccording to the Eurostat data for 2017, the year under review, the fertility rates were lowest in southern countries and following that of Malta, the fertility rate in Spain, Italy, Cyprus, Greece and Portugal were the lowest across the EU. \nThe highest rates were reported in France, Sweden, Ireland, Denmark and the UK while the EU average stood at 1.59 babies per woman. \nIt also emerged that, on average, women in Malta are 29 years old when they give birth to their first child, the same age as the European average. \nIn the year reviewed, there were a total of 4,319 births in Malta.", "comment_count": 96, "id": 571}, {"keywords": "", "author": "Denise Grech ", "article_body": "Only a third of women invited to a cervical cancer screening attend, but the rate is higher for breast screening - at 60 per cent, MEP Francis Zammit Dimech said.\nThe PN MEP said more investment in cancer screening and campaigns were needed to encourage people to attend screening programmes.\nThe government recently announced colorectal cancer screening, which was previously offered to patients aged 60 to 64, will now be offered to people aged 55 to 69.\nWatch: Cancer survivor urges people to get tested\nWelcoming the proposal, Dr Zammit Dimech, a member of the MEPs against Cancer Group, said the government should introduce population-based screening for prostate cancer.\nRead: Maltese researchers develop less invasive and improved cancer screening\n“We need to ensure that screening services are not only available but that their acceptance rates are also high. In this regard more awareness is necessary,” he said.\nMalta sees 2,000 new cancer cases a year, while 900 people are killed by the disease annually.\nHe also recommended that data should be shared across multiple EU member states through cancer registers.\n“This would permit professionals and policy makers to gain better understanding of trends and act accordingly,” he said.", "comment_count": 16, "id": 572}, {"keywords": "", "author": "Jacob Borg", "article_body": "Environment Minister José Herrera defended a decision to allow lucrative tuna fattening operations to continue despite multiple inspections by the fisheries regulator last year finding irregularities in the industry.\nTuna operators in the multi-million euro industry are meant to abide by strict quotas during the fattening process that takes place in their pens.\nThe Sunday Times of Malta reported that fisheries department inspectors found major irregularities in most of Malta’s tuna farms last year but the operations were allowed to proceed notwithstanding.\nDr Herrera overturned the suspension of several tuna cage operations and overruled the further regulatory step of suspending the companies’ licences after the fisheries department flagged major discrepancies in the amount and type of tuna in their pens, industry sources said. \nInstead, it was decided to await the outcome of a magisterial inquiry into the industry practices after the matter was reported to the police.\nThe island’s tuna farming industry has been cast in the spotlight after an international investigation found it was at the centre of an EU-wide black market operation.\nReplying to questions by the Times of Malta, an Environment Ministry spokesman defended the decision to allow the operators to carry on as normal.\n“Whenever discrepancies are found, as a matter of course, the Department of Fisheries and Aquaculture (DFA) temporarily suspends the operations of the specific cage until discrepancies are decided and corrective action is taken.\n“By way of example, if excess tuna are found over and above the acceptable level, the DFA orders the release of the excess before it allows continuation of operations at the cage. This must be seen also in the context of the fact that when operations are suspended operators incur substantial expenses by way of extended feeding and management,” the spokesman said.\nHe said that whenever discrepancies in operators’ tuna numbers appeared to constitute a criminal offence, evidence was preserved and the matter referred to the police for further investigation.\nAsked whether the ministerial decision to overturn the suspension of the tuna pen operations undermined the DFA’s position as a regulator, the spokesman insisted this was not the case.\n“The approach adopted does not diminish the regulator’s powers, bearing in mind that, in any democratic country, the decision as to whether a criminal act has been committed, and the consequence to be suffered for that, pertains to the courts,” the spokesman replied.\nThe industry sources said one company’s tuna cage operation was suspended for several weeks around October by the fisheries regulator as a result of the irregularities found. Following the suspension, officials from the European Commission carried out a surprise inspection at another tuna farming operation. \nThe company’s operation was also suspended after more tuna than that declared were found in the pen.\nAndreina Fenech Farrugia, the fisheries department’s head, was suspended by Dr Herrera after a Spanish newspaper published excerpts of a conversation she allegedly had last June with a tuna pen operator.\nShe denied allegations she had solicited bribes from a Spanish tuna kingpin in exchange for an increase in his tuna quotas. A separate magisterial inquiry is looking into these allegations.", "comment_count": 38, "id": 573}, {"keywords": "", "author": "", "article_body": "Tourist arrivals in January numbered 127,723, 2.4% more than in the same month in 2018.\nThe National Statistics Office said 114,551 came for a holiday, while 9,461 came on business.\nArrivals from non-EU states went up by 14.6% to 20,788. Most arrivals were aged between 25 and 44 (41.3%), followed by those within the 45-64 age bracket (31.6%).\nTotal nights spent went up by 7.6% when compared to January 2018, amounting to 912,439 nights.\nTotal tourist expenditure was estimated at €84.7 million, an increase of 3% over the same month in 2018.", "comment_count": 6, "id": 574}, {"keywords": "", "author": "", "article_body": "“Institutional bodies” were needed to monitor dangerous public and private structures for safety on a daily basis, to preempt incidents, the Sliema council said.\nReferring to an incident on Tuesday which saw a balcony in Hughes Hallet Street collapsing, the council proposed that a monitoring set-up should be explored by the Building Regulations Board.\nIt said it offered its full support to the necessary reforms needed in this area.\nThe council said it was grateful that no one was injured in the balcony incident, which, it said, should serve as a wake-up call to owners of properties which had not been maintained for some time.It was is the property owner’s legal responsibility to maintain their property in a proper condition, the council said.", "comment_count": 17, "id": 575}, {"keywords": "", "author": "", "article_body": "The Local Councils’ Association has denied media reports of plans to lure pigeons into cages and poison them as a method of controlling the bird population.\nIn a statement, the association confirmed that cage-trapping had been chosen as the most sustainable and humane method, coupled with a total ban on feeding pigeons in public places, after a study of various options.\nHowever, it said it had never discussed or agreed to poisoning the captured birds.\n“Discussions are ongoing with the environment ministry to ensure that the contractor will be allowed to move the pigeons caught in various localities to Għammieri [the government farm],” association president Mario Fava said. “The association's call does not give the contractor the responsibility to dispose of the pigeons by feeding them poisonous foods.”\nThe association said it would be continuing discussions with the environment ministry and NGOs to guarantee safeguards for the animals’ rights once the system was introduced.\nHowever, it defended the need for measures to control the pigeon population, stressing the public cleanliness and health problems caused by bird populations and the failure of various entities to act despite local councils’ pleas.\nIn the past, authorities have organised culling sessions in which the birds were shot out of the sky.\nReports of plans for pigeons to be captured and poisoned had provoked a negative reaction from several stakeholders.\nThe Democratic Party (PD) described the plans as unethical and urged the authorities to find alternatives.\nThe MSPCA warned that several poisons were known to produce a long and drawn-out death, and recommended more humane solutions such as building nests which would allow the eggs to be removed and prevented from hatching, proposed by the Commissioner for Animal Welfare in 2017.", "comment_count": 11, "id": 576}, {"keywords": "", "author": "", "article_body": "Updated 11.10am\nTwo senior citizens were rushed to hospital after being hit by a car in Qormi on Wednesday morning, the police said.\nThe couple, aged 72 and 73 and living in Qormi, were crossing Triq il-Vitorja at 7am when they were hit by a Ford Fiesta driven by a 33-year-old woman from their hometown.\nThe incident was reported to the police at 7am. An ambulance took the two to Mater Dei Hospital, where they received treatment.\nTheir injuries were described by the police as critical.\n ", "comment_count": 0, "id": 577}, {"keywords": "", "author": "Claire Caruana", "article_body": "Students whose parents get a divorce are more likely to drop out of school without any qualifications, a study being published this week has revealed.\nIt emerged through the study carried out by the National Observatory for Living with Dignity, that divorce is \"one of the significant contributors behind students’ decision to abandon school early\".\n\"Divorce may cause the most profound, emotional trauma and leaves the biggest impact on children, particularly in low socio-economic status contexts defined by limited social and cultural capital.\n\"Children living in families where parents are divorced are often in constant, apparent or hidden mourning that often leads to early school leaving,\" observatory chair Carmel Borg said a in a statement ahead of the publication of the results on Friday.             \nThe study, by lead researcher Prof. Milosh Raykov, consists of a literature review of qualitative studies as well as in-depth interviews.\nIn it, the researchers also warned that while a positive educational environment at home was crucial, quality schools were strategically central to achieving social justice in education. \nEarly Leavers from Education and Training (ELET) are students aged between 18 to 24 who leave compulsory school without at least five SEC passes and who are not enrolled in any form of educational programme or training.\nThe study follows up on the latest National Statistics Office (NSO) figures, which in October 18 showed that although Malta’s early school leaving rate dropped to 17.7% in 2017 from 20.3% in 2014, this was still far from the 2020 target of 10%.\nIt adopts a social justice approach to understanding the phenomenon, where ELET is seen as symptomatic of a society where success is still heavily dependent on the socio-economic status, and of a school system that fails to guarantee education success to all.\nIn recent years, Malta has continued to register among the highest numbers of school-leavers across the EU, with Eurostat data showing that one in five Maltese students leave school by the age of 18. \nThe observatory is part of the President’s Foundation for the Wellbeing of Society. The entire study will be unveiled on Friday. ", "comment_count": 17, "id": 578}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta says the financial services watchdog will be paying €1.2 million by the end of the year to experienced officials as part of an early voluntary retirement scheme. In another story it speaks to the University’s Labour Studies centre head who says efforts to address dwindling birth rates need to go beyond merely “opening up more childcare centres”.\nThe Malta Independent says MEPs want the European Union to counter the IT threat from China.\nL-Orizzont leads with a story on shocking cases mentioned in Parliament in the foster care sector.\nMalta Today says that Malta has closed its airspace to Boeing 737 Max.", "comment_count": 0, "id": 579}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 11.10am with Air Malta reply\nAir Malta’s website on Tuesday fell victim to a hack that saw the airline’s contact page directing customers to what appeared to be a dating site. \n\nClients who attempted to use the Air Malta contact form, which comes up when a user clicks on the website’s Contact Us tab, told Times of Malta how the form was already filled in when they opened the page, despite not having inputted any personal data.\nUpon closer inspection of the text inputted into the form, the airline’s clients said that the name and e-mail address were evidently “made up”, as were the contact number and the Flypass Number. In the message box at the end of the form, apart from a message reading “new super hot photo galleries, daily updated collections”, there was also a link to a dating website. \nThe same message was still coming up at around 8.30am, when the newspaper accessed the airline’s website. The issue seemed to have been fixed some time later. \nContacted about the issue, a spokesman for Air Malta said the airline had been in touch with the website designer on the matter and that he would reply to questions sent via e-mail to better explain what led to the issue. \nThere was also a link to what appeared to be a dating website\nTimes of Malta asked the airline whether it was aware of the glitch and whether any of its clients’ personal data had been compromised and if so, whether the authorities had been informed of the issue.  \nThe airline did not reply at the time of going to print.\nAirline blames automated bot\nOn Wednesday morning, it told Times of Malta that the issue had only affected the contact form and was caused by an automated bot \"which was carrying out attempts to propagate malicious links via email\".\n\"Air Malta’s website was not breached and no customer data was compromised,\" a company representative said.  \"The matter was immediately resolved.\"\nBots are software applications designed to run simple, automated tasks repetitively at a much higher rate than would be possible for a human alone.\nThey are estimated to make up more than half of all traffic on the internet.\nTheir most common online use is by search engines, which use bots to scan, or 'crawl', websites to index online content. Bots can also be used maliciously and often feature in attacks on websites or email spamming activities. ", "comment_count": 23, "id": 580}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The financial services watchdog will be paying €1.2 million by the end of the year to “experienced” officials as part of an early voluntary retirement scheme, Times of Malta is informed.\nThe disbursement of the funds was approved by the Malta Financial Services Authority’s board of governors, industry sources said.\nThe regulator, they added, was also mulling the possibility of pumping additional hundreds of thousands of euros into the early voluntary retirement scheme to create more vacancies at its top echelons.\nA spokesman for the MFSA confirmed to the newspaper that a new early retirement scheme was offered to some members of the top management.\nThis followed a change at the very top, when Joe Bannister asked not to be reappointed chairman and was succeeded by Joseph Cuschieri, who headed the Malta Gaming Authority before.\nNo details were given about the senior MFSA officials who took up the offer or how much they received as the spokesman would only say that, so far, 10 staff members would be retiring.\nMFSA sources told Times of Malta that, apart from the head of enforcement, Anton Bartolo, who was told “in diplomatic terms” he was not welcome any longer, the head of insurance and pensions supervision, Marisa Attard, the director of human resources, George Spiteri, and the head of the banking supervision unit, Ray Vella, were also politely shown the door.\n\n\n\n“All of these heads, by far the most experienced in the organisation, were not really given an option to stay even though the scheme is termed voluntary. They were offered money and asked to leave,” the sources said.\nIn the meantime, Mr Cuschieri set up a new executive team, consisting of chief officers, concentrating all ‘power’ in an executive committee headed by himself as CEO.\nOne of Mr Cuschieri’s closest aides at the Malta Gaming Authority has already been engaged as his second in command at the MFSA. The new chief officers are also known to be close collaborators of Mr Cuschieri.\nAsked to give details of the financial package awarded to the new chief officers, the MFSA spokesman refused, citing “data protection” rules.\nHowever, the newspaper is informed that while Mr Cuschieri receives over €11,500 a month, the amount increasing substantially over the next few years, his chief officers get close to €100,000 annually.\nThe MFSA spokesman said the early retirement scheme was open to officers with either a minimum of 25 years’ experience or who were within six calendar years away from normal retirement.\nWithout giving details of the sums paid so far, he said the payments consisted of either a lump sum equivalent to up to two-thirds of their annual salary until the date of their reaching retirement age or three times the employee’s terminal annual salary.\nIn some cases, those asked to leave will be receiving more than €150,000 each with the right to find another job even in the same industry, the sources said.\nThe ‘offloading’ of experienced staff coincides with a range of calls for applications for the recruitment of tens of new officials. A few days ago, Mr Cuschieri announced the MFSA planned to increase its staff to about 450 in the coming years, up from 350. This is expected to raise the MFSA’s wage bill by several millions of euros in the process.\nThe financial services regulator has come under intense pressure over recent years, particularly from the European Commission and the International Monetary Fund, in the wake of alleged money laundering breaches by some of its licensees, including Pilatus Bank and Satabank.\n ", "comment_count": 67, "id": 581}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Free access to sports facilities, machines that identify illicit substances at hospitals and mental check-ups for all students are among a set of proposals that the Malta Youth Council believes would improve mental health in Malta.\nAccording to the council’s policy paper, there has been substantial development in the mental health sector, however, there was still space for improvement when it comes to the standards of care of the mental health hospital.\nThe best approach would be to bring mental health services at par with those given to people who live with physical illnesses, the Kunsill Nazzjonali Żgħażagħ says in its paper.\nCalled ‘A holistic approach towards mental health and youth’, it urges for more inclusion and integration of people living with mental health illness.\nIt was penned following consultation with some 800 youths with different backgrounds, and was presented to President Marie-Louise Coleiro Preca and Health Minister Chris Fearne among others.\nIt its paper, KNŻ flagged the need for physical education in fighting mental health illnesses. It suggested granting free access to sports facilities or providing a discount for such services to people who live with mental illnesses.\nBring services at par with those given for physical illnesses\nApart from its therapeutic side, this would allow the development of better coping mechanisms instead of recurring to other non-recommended substances like alcohol or drugs.\nMeanwhile, security at the new mental health hospital, which is planned to be situated adjacent to Mater Dei, needs to be prioritised inside the wards and also outside upon entrance. This could be done through machines that detect tobacco, illicit substances and any other material that could be of danger to patients.\nReferring to innovative approaches at schools, the paper meanwhile suggests check-ups at every institution. This check-up would include a fixed allocated time for every student, and if the counsellor notices the need for follow-ups, appointments could be set up.\n“The effect of this initiative will be twofold, since it would normalise and destigmatise counselling, while serious problems can be caught earlier.\n“Students would still have a chance to opt out if they feel uncomfortable, however the majority would attend.”\nThe council expressed concern that little importance was given to educating on the importance of well-being, including mental health, at educational institutions.\nIt was worrying that 49 per cent of respondents who took part in a questionnaire in the build-up to the paper, were never taught mental health at school. \nAnother “grave concern” was the inability to promote an appropriate transition between the Young People’s Unit and the adult services.\nIt was highly recommended that gradual and effective processes were put in place between the ages of 18 and 21 to ease the transition process from child and adolescent psychiatry to adult psychiatric services, according to the paper.", "comment_count": 0, "id": 582}, {"keywords": "", "author": "Jacob Borg", "article_body": "The Nationalist Party has held back from publicly opposing plans to grant political parties uncontrolled access to ballot sheet scans, despite its representatives on the Electoral Commission voting against them.\nAccording to proposals by the Electoral Commission, political parties will be given access to scans of all valid votes cast, along with their interpretation by the e-counting software set to be introduced during the May MEP elections.\nThe data can be held by the parties “for verification purposes” for a three-month period, after which it has to be deleted.\nNationalist MP Beppe Fenech Adami raised concerns about the proposals in Parliament last month, saying it would make it possible for parties to search for a particular voting pattern agreed upon in advance with a voter from a specific address, given that ballot boxes are assigned to particular streets.\nA veteran election observer told the Times of Malta last month that what was being proposed meant shifting from a system where votes were held under lock and key by the Electoral Commission to giving political parties unmonitored access to the scans.\nAsked whether the PN would be backing in Parliament proposed amendments to the electoral law, giving them access to the ballot sheet data, a spokesman said the party was still not happy with the results attained during the mock tests to evaluate the new e-counting system.\n“A system without proper checks and balances could lead to voter fraud. In this regard, the PN is still discussing possible changes to the proposed system to ensure that each and every voter’s voting intention is truly reflected in the final result,” the spokesman said.\nSources close to the Electoral Commission said delegates from both the Nationalist and Labour parties favoured the system.\nTwo PN party insiders told this newspaper, on condition of anonymity, the party preferred to be given equal access to the ballot scans as per the proposed amendments. The sources said that were the amendments not to be approved, they feared Labour would still manage to get its hands on the ballot sheet data.\n“It might not be the most principled approach but we have to be pragmatic about these things. It’s better to have the same access to data that the Labour Party has, rather than nothing at all,” one party insider commented.\nQuestions sent to the Electoral Commission over a month ago asking why political parties would be given access to such sensitive information remain unanswered.\nWhen a reminder was sent to Chief Electoral Commissioner Joseph Church several weeks ago, the reply, sent by mistake, was: “He is still persisting. Let’s put it before the commission again, please.”\nMr Church later clarified the e-mail was meant to be addressed to the commission secretary, requesting him to bring up the questions for discussion.\nFive weeks later, no replies have been forthcoming.\nThe Labour Party, too, failed to answer when asked for its stand on the proposed amendments regarding access to ballot sheet data.\nQuestions to the Electoral Commission\nIf the commission “affirms its satisfaction that the electronic vote counting system guarantees the correct result reflecting the electorate’s vote”, why has it agreed to give political parties the right to access all people’s voting documents for three whole months? What does it think will be achieved by granting such access?\nWhat safeguards will be put in place to ensure that this data is handled correctly and eventually erased?\nDoes the commission not feel that giving political parties access to every single vote cast violates constitutional provisions ensuring voter secrecy?\njacob.borg@timesofmalta.com", "comment_count": 16, "id": 583}, {"keywords": "", "author": "Denise Grech ", "article_body": "The man who blew the whistle on the Algerian visas scam has been stripped of his Maltese citizenship for reasons which are not provided for by law, Nationalist MP Jason Azzopardi told parliament on Tuesday.\nHe said that Alex Fezouine, a Maltese-Algerian, was stripped of his Maltese citizenship on the pretext of the annulment of his marriage to a Maltese woman owing to vitiated consent 17 years ago.\nWhile the law rightly provided for citizenship to be revoked in the case of a marriage of convenience, this was not such a situation, Dr Azzopardi insisted. Citizenship could not be withdrawn for the reason that had been given.What had happened was unprecedented, but it was not a coincidence.\nWhat had happened was \"disgusting, disgraceful and an act of vindictiveness\", he said.\nHe explained that an unprecedented case, the government wrote to Mr Fezouine on March 8 informing him that his citizenship was revoked. The man will have to leave behind a business he started and an 11-year-old child, the PN MP added.\nThis, Dr Azzopardi said, was the first time ever that citizenship had been revoked because of vitiated consent for marriage and not because the marriage was out of convenience, as was normally the case. \nMr Fezouine had blown the whistle about a corrupt scheme which had seen Malta issuing Schengen visas to Algerians with the blessing of the highest echelons of power.\nThe auditor had investigated the case and in large part confirmed the allegations.\nBut the government instead of investigating the case, had in an obscene manner revoked the citizenship granted to this man. This was the ultimate secular crime which a state could commit.\nCorruption had been aided and abetted by the highest authorities, to the detriment of European member states, Dr Azzopardi added. \nInstead of police investigating, as would be the case in other countries, they took the citizenship of the person who blew the whistle on the scandal. \nThis was further confirmation that what the government said about protecting whistleblowers was merely lip service. One only needed to see what had happened in the case of [whistleblower] Jonathan Ferris, Dr Azzopardi said.", "comment_count": 100, "id": 584}, {"keywords": "", "author": "Keith Micallef", "article_body": "Bottlenecks in the exportation of electronic waste and illegal sale of white goods for metal parts are to blame for the current state of civic amenity sites that are morphing into junkyards.\nIndustry sources said that economies of scale and export costs are also hindering the so-called WEEE (waste electrical and electronic equipment) schemes, which are administered by the environment authorities.\nThe schemes are meant to collect such waste as white goods, television sets, water heaters, computers and air conditioning units, which are then sent to recycling plants abroad, mostly in Italy.\nThere are only two authorised schemes at present, incorporating importers, producers and vendors who pay for the collection, treatment and recycling of the waste.\nTimes of Malta reported last week that most of the civic amenity sites operated by State agency Wasteserv had reached full capacity and were fast becoming an eyesore.\nAsked for an explanation, an agency spokeswoman acknowledged that the facilities, where bulky refuse from households is disposed of, were becoming less user friendly due to the overstocking of WEEE. However, Wasteserv pointed its fingers at the Environment Resources Authority.\n“It is important to note that it is the responsibility of the relevant schemes, permitted by ERA, to manage the disposal of this waste and, hence, its export effectively.\n“Failure of these schemes to perform on a regular basis has led to the current situation where piles of this waste are being left to congest Wasteserv’s premises,” the spokeswoman said.\nShe added that Wasteserv was monitoring the health and safety risks at civic amenity sites and was seeking to mitigate the situation by exporting some of the waste directly.\nThere is no level playing field\nThe ERA admitted there might be situations whereby there could be an excess of stored WEEE pending export.\nA spokesman said that, for the past month, the environment watchdog had engaged with Wasteserv and both WEEE schemes to find solutions.\nMoreover, he said the ERA had also taken enforcement action where schemes were not attaining their targets. However, he declined to give further details.\nIndustry sources said that, by law, all bulky refuse collected by a local council’s contractor was sent to civic amenity sites, over and above items deposited there by private individuals. In turn, Wasteserv was obliged to hand over this waste to the two schemes according to their respective number of members.\nHowever, the industry sources complained that one of the main problems they faced was that items containing highly-sought metal parts that attracted a good price on the market were never reaching civic amenity sites.\n“It seems only fridges, freezers, television sets and neon tubes are being thrown away,” they added.\n“In reality, cookers, washing machines and air conditioning units are being illegally dismantled and their metal parts sold on the black market for recycling,” the spokesman pointed out.\nConsequently, WEEE schemes complain there is no level playing field. Furthermore, sources said Malta’s economies of scale meant they were, more often than not, at the mercy of Italian operators that treated certain white goods.\n“Apart from being costly to export items like fridges, because they require hazardous waste containers of which there is a limited amount available, these cannot be sent abroad on a regular basis due to restrictions imposed by foreign plants,” the sources said.\nThey pointed out that the same could be said for traditional cathode ray tube found in TV sets as the glass screen was costly to treat due to the presence of lead.\n“This is creating a bottleneck because the country lacks the sufficient capacity to export certain types of WEEE,” they noted.", "comment_count": 11, "id": 585}, {"keywords": "", "author": "", "article_body": "Thirteen migrants absconded from the Initial Reception Centre in Marsa on Monday-Tuesday night, but five have since returned, the Agency for the welfare of asylum seekers said on Tuesday evening.\nThe migrants were being held in Marsa to be assessed and for medical clearance.\nAnother two migrants ran away from the Office of the Refugee Commissioner when they were taken there to apply for protection, the agency said.\nThe police are conducting a search for the migrants who remain at large.\nIt is understood that the migrants were part of a group rescued by the Armed Forces of Malta last week.", "comment_count": 0, "id": 586}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Conservation experts have raised concerns that excavation works for the planned Malta-Gozo tunnel could impact the historic Red Tower in Mellieħa.\nGovernment plans for a 13-kilometre-long tunnel between Manikata and Nadur would run directly below the 17th-century tower, now being restored by Din l-Art Ħelwa.\nArchitect Edward Said, part of the restoration team, told the Times of Malta the area surrounding the tower was historically known to be afflicted by geological problems.\nThese issues, he said, were evidenced by cracks in the tower’s structure, which had been repaired several times over the years and which were being monitored.\n“As a conservation architect, I am very concerned about the prospect of excavation beneath the tower,” Mr Said admitted.\nWe are appealing to the authorities for information about the plans\n“At this stage, we don’t know how far beneath the tunnel it will be but this is a consideration that must be addressed as part of the project. Similarly, there should be an appraisal of other historic structures that may be afflicted by the same phenomenon.”\nDin l-Art Ħelwa’s outgoing president, Maria Grazia Cassar, said the organisation was concerned about the lack of information on key aspects of the project, even as the government made clear its intentions to forge ahead with the project and issue a call for tenders in the coming months.\n“It clearly would not be desirable to have vibrations underneath the tower,” Ms Cassar said.\n“We are appealing to the authorities for information about the plans, including the route and the depth.”\nThe Red Tower restoration, which is EU-funded and supported by the Malta Tourism Authority, includes extensive work on both the building’s interior and exterior and is planned to be completed around July.\nThirteen NGOs last week issued a joint call for the government not to race forward with the tunnel plans until further studies on the project’s social, economic and environmental impacts were held.\nA decision on whether a tunnel was the best solution to Gozo’s challenges could only be established after serious studies and public consultation, the groups said. They also lamented the lack of public information, saying people did not have access to studies cited by the government.\nCritics of the tunnel have raised concerns over the effect of in-creased traffic on the sister island, environmental impacts at the entrance and exit points and the massive amount of construction waste the project would generate.\nSocial impact studies, however, have consistently pointed to high levels of public support.\nAbout 82 per cent of Gozitan respondents were in favour of the tunnel in a 2017 assessment and a later study found similar results among Maltese people.", "comment_count": 15, "id": 587}, {"keywords": "", "author": "", "article_body": "An administrative mix-up over the date of an appeal hearing nearly cost a man €1,700 before the mistake was flagged by a lawyer.\nMatthew Mifsud had been accused of damaging third party property when building a concrete slab on his roof.\nMr Justice Antonio Mizzi, who presided over the case's appeal, had scheduled sentencing for October 30, 2018. But on that date the sentencing was put off to January 30, 2109.\nIn the meantime judge Mizzi had retired and the case was assigned to Madam Justice Edwina Grima, with the date being shifted to January 25. However, some days before this date, Mr Mifsud had been called up by the court usher and informed that the sitting was cancelled and to expect a new notification.\nRead: Court registrar's mistake almost lands man in jail\nMr Mifsud had informed his lawyer and nobody had attended the sitting on January 25 – but instead of receiving a new sitting notification, he had received orders for the immediate payment of €1,730.54 as he had been found guilty in his absence.\nHis lawyer, Jason Grima, had immediately filed an appeal arguing that it was an unfortunate mix-up by the court authorities for which the accused had no fault.\nHe further argued that the order for payment also specified the wrong date – January 30 – when it was actually given on January 25.\nIn a decree handed down on March 1, Madam Justice Edwina Grima upheld the request, rescheduling the appeal hearing to May 8.\nRead: Magistrate to re-hear case after court administration mistake ", "comment_count": 0, "id": 588}, {"keywords": "", "author": "", "article_body": "Locals opposed to a large-scale project at Mistra Bay have successfully filed an appeal against the plans, using money collected during a 10-day crowdfunding drive. \nThey used a portion of the €7,350 raised to pay the application fee. The remaining money will be used to pay the fees for a lawyer to argue the case. \nResidents say the Mistra Heights project, which will see hundreds of apartments built in a series of blocks on the site of the Mista Village Holiday Complex, will be “intensive, congestive and intrusive”.\nThe project, which has been on the cards for more than a decade, appeared on the verge of collapse before developers renewed its planning permit last January.\n“There have been no studies about the impact of this project for the last 15 years. It was disastrous then, it is even worse now,” said activist Karen Tanti. “Our environment, road networks and infrastructure cannot take it. We are already flooded with unsustainable planning permits and we cannot understand why the PA acts as a rubber-stamping body allowing developers to build all over us in the most irresponsible and arrogant manner.”\nMs Tanti said that various communities around the island had come together to oppose the plans. \n\"This is a grassroots movement which has worked hard to keep partisan politics out of the equation, and will not be bought out or silenced by the powerful construction lobbies,” she said. ", "comment_count": 12, "id": 589}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A child-molester who groped two young sisters at Pretty Bay in Birżebbuġa almost 10 years ago has had his jail term reduced to a suspended sentence, after a judge ruled that he had not been accused of the correct offence.\nA police report had been filed in August 2009 stating that the two sisters, then aged eight and nine, had been at the beach when they had seen a man swimming and pushing some small dogs on a lilo.\nThe curious children had commented on how cute the dogs were and the man had agreed, before groping both sisters’ genital areas.\n“He was going to [put his hand under my swimsuit] but I didn’t let him,” one of the sisters, testifying via videoconferencing, had told the court. The accused had tried to pull her back but she swam away.\nHer sister had also described to the court how the man had done the same to her and then made her promise not to tell her mother that he had touched her.\nHowever, the children had told their mother of the incident later that evening as she was bathing them and the parents went straight to the police, who arrived at the conclusion that it was Alfred Xerri – known as “il-Uomo” – from the children’s description of the man.\nThe 79-year-old had been sentenced to three years’ imprisonment when he was convicted in 2013. Mr Xerri, who consistently denied any wrongdoing, had filed an appeal with his lawyer Joe Brincat insisting that the touching was “entirely accidental” and that in a worst-case scenario would only constitute the crime of violent indecent assault.\nMadam Justice Consuelo Scerri Herrera said she could not find a person guilty of a crime they had not been accused of, citing case law and the criminal code. \nThe Court of Criminal Appeal therefore revoked the sentence at first instance where it found Xerri guilty of defilement of minors “bearing in mind that although this Court agrees with the appellant that the facts fit the crime of violent indecent assault, the appellant was not accused with this crime and this court therefore cannot find him guilty of violent indecent assault.”\nIt was up to the prosecution to accuse the appellant with this crime but it had not been mentioned, so much that the Attorney General did not indicate it in his note of referral, said the court.\nDespite being cleared of corrupting a minor, the man’s conviction for offending public morals was upheld.\nThe judge underlined that although the appellant was not being found guilty, “his behaviour was deplorable and can never be accepted, behaviour which causes fear both in the young victims as well as parents and society in general”.\nNoting that the man had also been convicted in 1999 of offending public morals, the court fined him €1,000 and imposed the maximum punishment of three months’ imprisonment which the court suspended for the maximum of four years in view of the accused’s advanced age.", "comment_count": 0, "id": 590}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government has yet to confirm whether it would consider providing its educators with insurance, despite a formal request by the teachers’ unions being filed two weeks ago. \nThe Malta Union of Teachers filed an official request for all teachers to be covered by insurance recently after it was announced that members of the disciplined forces will be included under a new occupational insurance scheme.\nAsked whether the government would be taking the request, which was also made by the other teachers’ union, the Union of Professional Educators (UPE), into consideration, the Education Ministry did not provide any replies, despite reminders. Nor did it say whether it would be meeting the unions to discuss the issue.\nTimes of Malta also sought information on the matter from the Finance Ministry after Edward Scicluna said during a press conference that claims will be handled by a specialised office.\nIn reply, a Finance Ministry spokesman said that the scheme “implemented an electoral pledge announced in the 2019 Budget” but gave no additional information on whether the unions’ request would be taken into consideration.\nNor would the spokesman say whether the Finance Minister had discussed the matter with the Education Minister, as seemed to be the case with the Home Affairs Minister when the insurance for the members of the disciplined forces was rolled out.\nCoverage against injury and loss of earnings were being proposed\nEarlier this week, the UPE reiterated its calls for the insurance cover during a press conference outside the Office of the Prime Minister, with union president Graham Sansone insisting that both indemnity insurance and coverage against injury and loss of earnings were being proposed as requirements.\nMr Sansone said that the union recently met Prime Minister Joseph Muscat and Education Minister Evarist Bartolo to discuss the matter and they had been “receptive”.\nOn their part, the MUT has said that there is no need to “reinvent the wheel” to introduce insurance for educators, dismissing claims by the government that introducing such a scheme would require “a substantial amount of time”.\nAccording to the MUT, the government had said that although the request would be “considered” it would require time to implement.\nclaire.caruana@timesofmalta.com", "comment_count": 6, "id": 591}, {"keywords": "", "author": "", "article_body": "Updated at 3.35pm with government statement\nMaltese YouTubers will be one step closer to earning money for their videos from Thursday, when the social media giant will launch monetisation features on its website for Malta.\nLocal content creators for the website have long complained that unlike their counterparts in other countries, they are unable to cash in on views on their videos. \nYoutube’s partner programme allows creators to get paid for running adverts on their channels.\nMEP Francis Zammit Dimech said he had held meetings with Google in February and was given assurances legal challenges would be overcome.\nThe monetisation programme will be officially launched later this week, MEP Francis Zammit Dimech said.\nRead: Maltese YouTubers to start getting advertising revenue\nDr Zammit Dimech thanked Google for taking the right steps to unlock the YouTube partnership programme for Malta, saying this would be another incentive to content creators.\n“As an MEP I have pushed for this to happen and I am glad we have managed to achieve this important result,” Dr Zammit Dimech said.\nDr Zammit Dimech also thanked the PN MP Therese Comodini Cachia who had worked for the policy change during her stint as MEP.\n'A Maltese YouTube'\nDigital Economy parliamentary secretary Silvio Schembri said that the monetisation platform was the result of talks he had held with Google at the start of last year. \n“I am satisfied that our work with Google bore fruit and now Maltese youths are going to be paid for their art and content produced on YouTube on par with other European youths”, he said. \nThe government would be organising an activity in conjunction with YouTube to provide content creators with more information about the partnership programme.  ", "comment_count": 2, "id": 592}, {"keywords": "", "author": "", "article_body": "Malta has won two awards at the largest tourism trade fair in the world.\nThe Malta Tourism Authority said Malta won the best LGBT trend destination, while Valletta won the award of Best City Break-Destination Award.\nThis was the 53rd edition of ITB Berlin (Internationale Tourismus-Börse), and Malta was present at this fair with three stands. The main stand was hosted by the MTA and the Ministry of Tourism, with Air Malta and several hotels and incoming travel agents also present. There was a second stand in the culture lounge, and a third in the LGBT area.\n\nTo attract and educate visitors, Liam Cauchi, from tastehistory.org provided samples of the food concept being offered at the Maritime Museum. This concept sees food prepared in the style that the Knights of Malta would have cooked. This wowed all those present as it provided an insight into Maltese gastronomic history.\nValletta won the award of Best City Break-Destination at the seventh edition of the Connoisseur Circle Hospitality Awards. Connoisseur Circle is the number one publication for luxury tourism market in Germany and the gala awards are considered one of the social highlights at the ITB. The winners of the various awards are determined by a jury of 16 independent travel connoisseurs.\nThe LGBT destination award was awarded at the Spartacus Travel Awards. Spartacus Traveller magazine is the largest LGBT travel magazine in the German-speaking market. These awards honour destinations and travel companies that are committed to the LGBTIQ market.\nMalta was awarded the award for trend destination in 2019 due to its increased popularity in the LGBTIQ community as a holiday destination, as well as its progressive legislation and targeted advertising.\nMTA’s executive chairman Gavin Gulia said that in 2018, the German market consolidated its position as the third largest incoming market to Malta, with an increase of 17.6% when compared to arrivals in 2017. ", "comment_count": 7, "id": 593}, {"keywords": "", "author": "", "article_body": "Updated at 5.15pm\nA fire broke out at the spa of the Qawra Palace Hotel on Tuesday afternoon, police confirmed.\nThe fire began inside the hotel spa's Turkish bath facility, sources said. \nSix fire trucks, two ambulances and a Mater Dei Hospital major incident support unit were dispatched to the site after a fire report was lodged at around 1.45pm.\nTwo further fire engines reached the site some time later. \nEmergency rescue crews who entered the hotel found smoke filling the reception, and worked quickly to evacuate hotel guests and staff members. \nAn estimated 21 people who were inside the hotel, as well as one member of the Civil Protection Department, received first aid treatment for smoke inhalation. They were subsequently taken to a nearby restaurant to gather their breath. \nA number of streets in the area were closed off to traffic by emergency services.\nMagistrate Simone Grech was informed of the incident but is unlikely to launch a magisterial inquiry as foul play is not suspected, the police told Times of Malta.\nA hotel representative told Times of Malta at around 5pm that operations were returning to normal. \n\"The hotel is preparing for dinner for the residents as we speak,\" they said. \nIt was the second major fire CPD officials had to manage in the space of a few hours: earlier in the day, firefighters worked for several hours to put out a large fire inside a Marsa warehouse generally used to house carnival floats.\nDo you have photos of the incident? Email us on mynews@timesofmalta.com\n\nVideo: Mark Zammit Cordina", "comment_count": 20, "id": 594}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Nearly one in five adolescents have self-harmed before the age of 17, the Richmond Foundation said on Tuesday, as it announced a new mental health campaign aimed at young people.\nThe campaign - Let us find your way forward - urges young people to come forward and seek help for mental health issues and marks the foundation's 25-year anniversary.\nIt includes a new freephone service - 1770 - for people who need support, as well as billboard and other media featuring real people sharing their stories of starting the journey to recovery.\nRead: Twenty per cent of working population have mental health conditions\nRichmond CEO Stephania Dimech Sant said around 150,000 people in Malta would face mental health problems at some point in their lives, of whom 75% experienced their first symptoms before the age of 25.\nHowever, research showed that the average person would wait four to 10 years to seek help, she said, due to a lack of awareness about support options as well as continuing stigma surrounding mental health issues.\n\"Mental health problems effect a person's day to day life, their relationships and their productivity,\" she said. \"This is a sector that effects society as a whole and requires both an individual and a policy response.\"\nRead: What mental health treatment? Many carers do not even know \nMs Dimech Sant said the Richmond Foundation currently catered for 2,000 people a year through 11 residential and support services, including 100 residents at the Villa Chelsea rehabilitation home.\nThe foundation also offers professional support in people's homes as well as a brief intervention service which received 1,600 calls last year and which is being extended with a specific focus on young people, training programmes, employee assistance to 70 companies and other services.\nMs Dimech Sant also appealed to the authorities and the public for support, in terms of both funds and volunteers, to allow the foundation to continue offering its services for free.\nRead: Mental health services require ‘transformation’\nPresident Marie Louise Coleiro Preca praised the work of the Richmond Foundation over the last 25 years and expressed her hope that it could do even more in years to come.\n\"Although we have made giant leaps forward, the stigma is still with us,\" she said. \"There are still people who feel they cannot reach out for help.\"\nRichmond Foundation also announced a rebranding, carried out by BRND WGN, based on challenging the perception of people with mental health problems as weak and presenting a way forward.\nRead: Southern harbour has highest number of residents with mental problems", "comment_count": 2, "id": 595}, {"keywords": "", "author": "", "article_body": "A balcony in Sliema crashed onto the street, probably as a result of the gale force winds which whipped the island on Tuesday morning. \nThe entire stone balcony in Hughes Hallett Street, close to Tigné seafront, appeared to have collapsed, according to witnesses.\nRocks from the balcony hit a car parked just below it, inflicting major damage. Nobody was injured. Photo: Jonathan Xuereb\nThe entire area was cordoned off. \nAnother balcony in Sliema has also been reported in danger of collapse, according to the police, though they would not identify the area.\nTuesday's winds come just two weeks after Malta experienced its worst storm in a generation.\nHave you seen any other structures damaged by the strong winds? Email us on mynews@timesofmalta.com\nThe entire balcony appears to have collapsed. Photo: Jonathan Xuereb\nThe collapsed balcony caused significant damage to cars below. Photo: Corinne Raven", "comment_count": 43, "id": 596}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta has the lowest fertility rate in Europe, according to EU-wide data released on Tuesday.\nFigures for 2017 published by Eurostat found that while France had the highest fertility rate of 1.9 babies per woman, Malta was at the very bottom of the list with 1.32 babies born on average for every woman.\nMalta has long been at the lower end of the spectrum. In fact figures for 2016 had found the island was fourth from last for fertility.  \nIn 2017, 5.075 million babies were born in the EU, compared with 5.148 million in 2016.\nThe total fertility rate in the EU stood at 1.59 births per woman, compared with 1.6 the previous year.\nRead: Malta needs to accept it has a fertility problem, says expert\nThe highest total fertility rate recorded in recent years was in 2010 when it reached 1.62, still below the replacement level, which is considered to be 2.1 live births per woman.\nMalta is at the bottom of the list when it comes to having babies.\nAmong the 5.075 million births, 45% were the mothers’ first child, 36% a second child and 19% a third or subsequent child.\nWomen in the EU who became mothers for the first time in 2017 were, on average, 29 years old - up from an average of 28.7 years old in 2013. Almost 5% of births of first children in the EU in 2017 were to women aged less than 20 (teenage mothers), and around 3% to women aged 40 and over.\nThis information comes from recently published data by Eurostat, the statistical office of the EU.\nA closer look at the figures for Malta show how 2,283 first born children were recorded in 2017. Five per cent of these were born to teenage mothers. Around half of these were born to mothers aged between 20 and 29, while 44% were born to mothers aged between 30 and 39.\nJust 1.6 per cent were born to Maltese mothers who were over the age of 40.", "comment_count": 177, "id": 597}, {"keywords": "", "author": "", "article_body": "A man who bit and attacked police officers when they tried to help him after finding him unconscious in December was jailed for two years on Tuesday.\nThe police had found Faraj Mohamed Faraj El Ragig, 33, who lives in Marsa, drunk and passed out. \nHe groggily woke up as they were calling for assistance and bit the two officers trying to help him, Inpector Robert Vella told the court.\nA police constable had testified that, on December 17, he and a colleague had noted Mr El Ragig flat on his back, with cotton wool in his ears and evident facial injuries.\nThey had tried to speak to him but he didn’t want to talk. While they were calling for an ambulance he got up in a rage shouting Allah hu akbar and tried to punch and bite the officers.\nThe officers had to use a taser to control him and in the course of being restrained, he bit the two officers.\nMr El Ragig was charged with attacking the police officers, insulting or threatening them during the exercise of their duties, slightly injuring them, breaching the peace, failing to obey legitimate orders and being drunk and incapable of taking care of himself in a public place.\nIn his statement to the police, he had denied being drunk or attacking the officers and claimed that it was the officers who attacked him.\nBut the court did not believe the accused, saying the police had no reason to stop other than to help.\n\"This is the thanks they get,\" the magistrate noted. \nThe court noted that the police had not embellished their account and even acknowledged that the accused had calmed down on the way to the police station.\nJailing the accused for two years, Magistrate Donatella Frendo Dimech noted that the defence had asked for clemency, but said that on the other hand, the accused had shown no remorse for his actions.\nHis actions could never merit clemency. “If this conduct is allowed to take root and flourish, the country will be the greatest loser… Attacks on the forces of law and order should not be tolerated but should be punished with the greatest severity.”", "comment_count": 0, "id": 598}, {"keywords": "", "author": "", "article_body": "More people applied for asylum in EU member states in January than in all months of 2018 bar one, new figures released by the European Asylum Support Office have revealed. \nSome 58,600 applications for international protection were lodged in the EU's 28 member states, Norway and Switzerland last month. \nThat was around 9 per cent higher than the corresponding figure in January 2018 but lower than the 61,563 applications lodged in October. \nJanuary's figure was also 21 per cent higher than December's, but that is in line with seasonal fluctuations, EASO said, with December a traditionally slow month for asylum applications. \nThe January figure remains in line with trends, EASO added. \nSyrians, Afghans and Iraqis lodged the most applications and together accounted for 23 per cent of all applicants in the EU+. Applicants from Pakistan and Venezuela represented an additional 9 per cent.\nApplications by nationals exempt from visa requirements when travelling to the Schengen area reached 13,646, a peak since the summer of 2015. Applicants from visa-exempt countries accounted for 24% of all applications in the EU+.\nIn this group, Venezuelans were the most prominent, with the largest increases registered for Venezuela, Colombia and Nicaragua. There were also notable increases for visa-liberalised countries from the EU neighbourhood, mostly for Albania, Moldova and Georgia.\nMore than 450,000 cases were awaiting a first-instance decision at the end of January. This was the largest stock for a year. Just over half of all cases had been pending for more than six months. The largest share was for nationals from Syria, followed by Venezuela and Afghanistan.", "comment_count": 0, "id": 599}, {"keywords": "", "author": "", "article_body": "Updated at 11.40am - New video \nFirefighters rushed to Marsa's quays on Tuesday morning after a fire broke out inside a warehouse used to house carnival floats at Xatt il-Mollijiet. \nFive fire engines were dispatched to the site and members of the Civil Protection Department quickly got to work, hosing water through an open first-floor window as black smoke blew out of the building. \nTheir work was complicated by strong northwesterly winds blowing across the country and which spread the flames.\nBy 10.30am the CPD had sent two further fire engines and a water bowser to help put out the flames. An ambulance and staff of paramedics waited on standby. \nNo peoplewere inside the warehouse when the fire broke out but two dogs were rescued.\nCarnival floats were taken out before they were damaged, sources said. \n\n\n\nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Jonathan Borg\nPhoto: Mark Zammit Cordina\n ", "comment_count": 5, "id": 600}, {"keywords": "", "author": "", "article_body": "The European Parliament's Civil Liberties Committee has approved objections for funding to include controlled migration centres established by member states.\nThe European Commission had tried last December to widen the scope of activities eligible for funding, with the aim of supporting national authorities struggling to cope with asylum, migration and integration, particularly for reception and accommodation for asylum-seekers or migrants in irregular situations.\nHowever, MEPs complained that the concept of “controlled centres” was controversial and “of questionable legality” as it did not exist under Union law and had not been approved by the co-legislators.\nThey insisted that such a concept should not be funded “unless and until it is properly defined in an appropriate legislative instrument - adopted by the colegislators - detailing its legal basis, nature, purpose and objective”.\nThe first objection amended the regulation establishing the instrument for financial support for external borders and visa (part of the Internal Security Fund), while the second modified the regulation establishing the Asylum, Migration and Integration Fund.\nThe committee backed both objections by 44 votes to eight.\nTo be adopted, objections to delegated acts need the backing of a majority of MEPs. The vote in plenary is scheduled for the March 25-28 sitting.", "comment_count": 1, "id": 601}, {"keywords": "", "author": "", "article_body": "An agreement on whistleblowing has been reached between the European Parliament and member states.\nThe EP said in a statement on Tuesday that with legal guarantees, people reporting illegal practices in good faith would be safe in the knowledge they would not be punished.\nEPP group spokesman Geoffroy Didier MEP said a good deal was reached for both whistleblowers and companies.\nWhile the former would be free to speak up if they knew about a malpractice affecting the public interest such as corruption in public procurement, a threat to public health or a tax fraud, the latter would not lose their good names due to false accusations.\nRead: ‘Whistleblower protection should be given to journalists as well’\nThe new legislation ensured whistleblowers would benefit from protection and guaranteed follow-up of their reports. At the same time, the rules defined penalties for false or malicious reporting to damage someone’s reputation or as a means of business competition.\nMr Didier explained: “We encourage whistleblowers to report internally as, according to empirical studies, more than 90% of whistleblowers feel more at ease reporting within the organisation where they work.\n\"However, they are free to go directly to the public authorities (external channel) if they consider this to be necessary. Internal and external channels are the best ways to relay the information on infringement to those concerned who can contribute to the early and effective resolution of any damage to the public interest.”\nRead: Malta's whistleblower laws rank second in the EU - NGO report\nThe directive will apply to national and local public administrations in cities with more than 10,000 inhabitants and all companies with more than 50 employees.\nThe EPP Group had small and medium-sized enterprises in mind when discussing the new rules. Given their limited sources compared to big enterprises, they would be granted an additional two years to comply with the new reporting standards.\nTo decrease administrative costs, the MEPs also proposed a single reporting platform that all SMEs with less than 250 employees would be able to use instead of setting their own reporting channels”, concluded Didier.", "comment_count": 0, "id": 602}, {"keywords": "", "author": "", "article_body": "A 31-year-old woman was seriously injured in a traffic accident in Ħamrun on Tuesday.\nThe police said the accident happened in Triq il-Kappillan Mifsud at 7.30am.\nThe woman, who is English, was hit by a Toyota Vitz that was being driven by a 71-year-old man from Marsaxlokk.\nThe woman was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 603}, {"keywords": "", "author": "", "article_body": "The Democratic Party (PD) has proposed the setting-up of an independent and specialised Ombudsman for Children to add another level of protection for children's rights and interests. \nAddressing Parliament during a debate on the Minor Protection Bill on Tuesday, PD leader Godfrey Farrugia described the draft law as a positive change towards child-centred alternative care, that would help provide a more stable family life for children deprived of one.\nThe proposal of a specialised Ombudsman, he said, would build on the new administrative framework. The new office could be under the remit of the Commissioner of Children, or part of the established structure within the Ombudsman’s Office, he added.\nRead: Children's rights are human rights - Michael Falzon\n\"Children have a right to having their opinion listened to. This legal framework will strengthen the rights of children to be protected from violence, exploitation and neglect, whilst it ascertains their right to education, health, wellbeing and to grow up in a healthy family environment,\" PD said in a statement signed by its MEP candidates Anthony Buttigieg, Martin Cauchi Inglott and Camilla Appelgren.\"These are not one size fits all solutions. However, whatever measures are undertaken, these have to be decided and executed in a timely manner as such interventions are of essence in a child’s development.\"", "comment_count": 2, "id": 604}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Nexia BT, which featured prominently in Malta-related documents leaked by the Panama Papers, will be advising Wasteserv on new public-private projects, including a €150-million incinerator at Magħtab.\nThe consultancy firm was given a €44,000 direct order by the State’s waste management company, which falls under the political responsibility of Environment Minister José Herrera.\nAccording to a notice in The Malta Government Gazette, the company owned by Brian Tonna will provide Wasteserv with “services of assistance in the setting up and monitoring of PPPs in relation to waste streams”. No details were given on the public-private partnerships in question.\nRead:€600,000 in six months: direct orders to ‘friends’\nWasteserv is chaired by David Borg, a former aide to Prime Minister Joseph Muscat when he was an MEP in Brussels.\nMr Tonna has served as the independent auditor to the private business group – Kasco – owned by Keith Schembri, the Prime Minister’s closest aide. Together with Nexia BT, he also advises the Office of the Prime Minister and a number of government ministries and state entities.\nNexia BT has received hundreds of thousands of euros in direct orders since labour was returned to power in 2013\nNexia BT has received hundreds of thousands of euros in direct orders since Labour was returned to power in 2013.\nRead: Nexia BT gets €130,000 in direct orders from Mizzi-led entity\nNexia BT and Mr Tonna were outed by the Panama Papers in 2016 as being the personal advisers to both Mr Schembri and Tourism Minister Konrad Mizzi when they opened secret companies in Panama and trusts in New Zealand.\nThe Financial Intelligence Analysis Unit had also mentioned Mr Tonna, Mr Schembri and other individuals in reports on suspicious money laundering activities related to the sale of passports.\nContrary to strict international accounting rules, Mr Tonna had claimed he had received a €100,000 “loan” from Mr Schembri. The FIAU had found no proof of such loan and the matter is now being investigated by a magistrate. Accountants holding a warrant are precluded from engaging in business dealings and accepting loans from clients.\nRead: €735,000 in OPM contracts to Panama Papers firm\nIt emerged last year that Mr Tonna was closely involved in the selection of Electrogas to build a €400-million new power station in Delimara against a security of supply agreement guaranteeing the winning consortium hundreds of millions of euros from the state electricity provider over 18 years.\nTimes of Malta reported that Mr Tonna, together with three Nexia BT staff members sat on the government’s selection committee handling the project. It is not yet known whether representatives of the consultancy firm or Mr Tonna would be sitting on the selection committee dealing with the up-coming lucrative incinerator.\nThe selection process is expected to start this year and works are scheduled for completion by 2023. \nPN reaction\nIn a reaction, the Nationalist Party said this direct order confirmed once more how close Nexia BT was to the government, to the detriment of other investors. \nThe PN observed that Brian Tonna and Nexia BT had been given several major contracts by the government.\nIt said it remained committed to fighting corruption, strengthening the rule of law and providing a level playing field for investors. ", "comment_count": 41, "id": 605}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Two siblings, aged four and six, will be returned to Australia after a judge found they were abducted by their mother who brought them to Malta without the father’s consent.\nThe father, who has dual Australian-Maltese citizenship, filed a court application in Malta after he was informed by his Maltese wife that she had travelled to Malta with the children and had no intention of returning. It emerged that the mother took the children, a boy and a girl, and started her voyage to Malta while her husband was at work in December 2016.\nHe told the court he returned home only to find his family was gone. He checked his Facebook account and found a message from his wife saying that by the time he read the message, the three of them would have already left Australia with no intention of ever returning.\nHe called in the police who confirmed that the mother and her two children had indeed travelled to Malta. The relevant Australian authorities then commenced proceedings to get the children back once they had been taken without his consent and also on grounds that Australia was their habitual place of residence.\nThe father recounted in court he had relocated his family to Australia in 2015 and tied the knot with his partner three months later. He said he enjoyed joint custody of his children with his wife and also had the right to be part of important decisions in their life.\nThe authorities in both countries were in contact with a view of returning the children to Australia voluntarily but the mother refused to comply. She argued they had not relocated to Australia permanently as the move had always been planned to be a temporary measure.\nAccuses her husband of selling narcotics\nThe woman said the court had not been informed about the violence and abuse she and her children had been subjected to while in Australia and neither that she had initiated separation proceedings from her husband.\nShe accused her husband of selling narcotics, cultivating cannabis and spiking her drinks with drugs, visiting strip clubs and even having regular sexual relations with other women, even passing on a sexually-transmitted disease while she was pregnant.\nShe told the court she had sought help in Australia but was informed to seek assistance from outside the country. This was why she had decided to pack and leave with the children.\nThe children called their father via Skype twice a week, the court also heard.\nMadame Justice Abigail Lofaro said that although the couple’s plan was not to relocate in Australia for good, the mother’s decision to come to Malta without the father’s consent was tantamount to an abduction. According to case law, the children had to be returned to their habitual place of residence, that is, Australia.\nReferring to the mother’s claims of violence and abuse on the children, the court noted there had been just a couple of incidents and the mother never took the matter further. The other claims regarding strip clubs and frequenting other women were extraneous to the abduction proceedings, the judge remarked.\nIn the circumstances, Madame Justice Lofaro ordered that the children were to return to Australia with the assistance of the police and court bailiffs.", "comment_count": 0, "id": 606}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says a wide-ranging investigation into an international car smuggling racket has yielded no arrests in Malta despite the alleged involvement of two Maltese nationals. In another story, the newspaper says two siblings, aged four and six, will be returned to Australia after a judge found they were abducted by their mother who brought them to Malta without the father’s consent. \nThe Malta Independent quotes Deborah Schembri, a former Parliamentary Secretary who rose to fame when she led civil society’s call for a divorce referendum, saying there was no comparison between divorce and abortion.\nL-Orizzont quotes Health Minister Chris Fearne saying the government wanted a health service close to the people in the community.\nIn-Nazzjon leads with PN leader Adrian Delia accusing the Attorney General of taking decisions in the government’s rather than the national interest.", "comment_count": 0, "id": 607}, {"keywords": "", "author": "Ivan Martin", "article_body": "A wide-ranging investigation into an international car smuggling racket has yielded no arrests here despite the alleged involvement of two Maltese nationals, Times of Malta is informed.\nThe Italian police said last week two Maltese men had allegedly acted as intermediaries in the smuggling of stolen vehicles.\nThe police in Ragusa, Sicily, said they had made several arrests in the early hours of last Wednesday after smashing a criminal ring that involved stealing luxury cars and other vehicles in Italy and then shipping them to Libya via Malta.\nSome 40 people were held during the operation, codenamed ‘Coast to Coast’, by investigators.\nSources close to the police in Malta, however, on Monday dismissed claims that two – so far unidentified – Maltese nationals had been among those arrested.\nThey also played down reports of an extradition request related to the investigation.\n“As far as we can tell at this point, no Maltese have been arrested as part of this investigation, so we were quite surprised to hear claims to the contrary. We got no official communication of this [arrest] from our Italian counterparts,” a police source said.\nMeanwhile, Maltese investigators involved in tracing down stolen vehicles said that dozens had been discovered on the island in the past five years. These were mainly from Italy and the UK.\nIllicit operations within the framework of the racket were believed to have slowed down after a series of crackdowns by the authorities, the sources said.\nThe Italian operation involved about 150 officers who searched 50 locations in several Italian cities. The two Maltese ‘accomplices’ were supposed to have been involved in liaising between the Italian car thieves and Libyan dealers who would sell the vehicles on order.\nThe Italian police last week released a recording of an intercepted phone call in which a man, who the sources identified as a Maltese national, and an Italian interlocutor discussed the collection of a BMW X5 arriving on the catamaran serving the Malta-Italy route.\nAccording to Italian police sources the two Maltese ‘accomplices’ were known to the authorities and were believed to have been involved in a number of criminal enterprises.\nThis included dismantling some of the luxury vehicles and selling them for parts on the Maltese black market. They were believed to have been involved in similar rackets in the past too, the sources said.\nYet, the Maltese police had yet to receive information about this from their Italian counterparts, Times of Malta was told. The Malta police also appeared to be in the dark as to which period the latest investigation covered.\n“This case dates back quite a few years. It is our understanding that the audio recording released [last week] was from a few years back and formed part of another investigation, so it is not yet clear to us what this investigation announced last week consisted of exactly,” a police source said.\nPhone intercepts by the Italian police during their investigation indicated that Libyan nationals would order luxury or commercial vehicles, which the Italian organised crime group would provide within weeks after either stealing them or buying the vehicles and then reporting them stolen as part of a wider insurance fraud scam, the sources said.\nThe investigation is believed to have started in 2012 following a string of reported car robberies and various suspicious car insurance claims.\nTwenty-one trucks, a cement mixer, a compactor and eight cars, all stolen, were seized in Sicily shortly before they were due to be shipped to Libya, some via Malta, as part of the racket earlier this month.", "comment_count": 70, "id": 608}, {"keywords": "", "author": "Claire Caruana", "article_body": "Efforts to eradicate poverty will only work if the focus shifts to making sure people can afford to live “a decent life”, lobby group Alleanza Kontra l-Faqar believes.\nTimes of Malta sought comments from the anti-poverty group following the publication of statistics by the National Statistics Office last week, which showed that 55,000 people in Malta are struggling to make ends meet and are considered materially deprived.\nActivist Matthew Borg from the group said that providing a ‘living income’ was the way forward if the authorities really wanted to find a long-term solution to poverty.\nThe so-called ‘living income’ is the amount that a household would have to earn to afford a decent standard of living. It is made up of a number of elements including food, water, housing, education, health care, transport, clothing, as well as other essential needs, such as provision for unexpected events.\nHe referred to a research study carried out by Caritas three years ago which focused on low-income households and what basket of essential items these would require for a decent living. Taking such an approach, he said, would ensure that people were no longer pulled out of certain poverty bands only to get stuck in the “at-risk-of-poverty” classification.\n“This living income would allow a person to live a decent life. We’re not saying people with low income will suddenly be able to afford to travel abroad once a month, of course not, but at least people would not be at risk of being pushed back into poverty at the first unexpected burden.\nWhen you live in a country constantly discussing ‘L-aqwa żmien’ people struggle with admitting they cannot afford to heat their home\n“This should, of course, not be someone’s final goal in life, but it should serve as a good push, backed by studies and efforts that are specifically catered for the person, so that one can move on further,” Mr Borg explained.\nWhile the Alleanza Kontra l-Faqar is gearing up to start pushing for such a change with decision-makers, Mr Borg admitted that the group was aware of the hurdles it might face in the process, pointing to the Caritas study as an example.\n“That was a good study and it was discussed for some weeks but in reality it remained on the shelf gathering dust,” Mr Borg said.\nA similar approach was rolled out on Wednesday in Italy amid widespread criticism. The Italian government’s scheme, dubbed the citizens’ income, will see those below the poverty line receiving a benefit that is paid via pre-paid debit cards and which can only be spent on food and medication. If there is money on the card at the end of the month, this is debited, rather than being carried over to the next month.\nThose benefiting from the scheme must also enrol in job training, with the scheme being lost if they turn down three job offers.    \nThe Alleanza activist expressed a degree of scepticism on the figures published by the NSO last week. While there was nothing wrong with the methodology used by the NSO to calculate income and living conditions, there could be people reluctant to admit they are materially deprived.\n“When you live in a country that is constantly discussing ‘surplus’ and ‘L-aqwa żmien’ [‘the best of times’ – Labour’s 2017 election slogan] people struggle with admitting that they cannot afford to heat their home or to buy a second pair of shoes,” Mr Borg said.\nThe figures were also two years old, meaning the current housing crisis affecting a good number of people might not have been reflected in the results, he noted. An increase of foreign workers and a booming economy should not be used as an argument to justify poverty, Mr Borg went on, expressing disappointment that the government had downplayed the increase of 0.7 per cent in the material deprivation rate.\nAccording to the NSO figures, 8.7 per cent of the people living in Malta last year were considered materially deprived while a further three per cent were severally materially deprived. This translated to a total of 55,000 people.\nThe number of people considered to be materially deprived increased for the first time since 2013, while those who were found to be suffering severe material deprivation decreased by 0.3 per cent.\nMaterial deprivation is defined as the inability to pay for unexpected expenses, afford a one-week annual holiday away from home, a meal involving meat, chicken or fish every second day, the adequate heating of a dwelling, durable goods such as a washing machine, a colour TV set, telephone or car, and being confronted with payment arrears.", "comment_count": 8, "id": 609}, {"keywords": "", "author": "Keith Micallef", "article_body": "Despite the various changes made to the controversial Rabat Road project plans, the Superintendence of Cultural Heritage has reiterated its concerns that such works might threaten archaeological remains and historic buildings.\nThis position was reaffirmed in the wake of the findings of the environmental impact assessment on the proposed development known as the central link project. \nStretching from the foot of Saqqajja Hill on the outskirts of Rabat down to Mrieħel Bypass, this €55 million project is meant to alleviate traffic congestion in Attard, notably Triq in-Nutar Zarb. Unveiled in May last year, the project was amended several times in the wake of the outcry from environmentalists and residents against the loss of hundreds of trees and large tracts of virgin land. \nNonetheless, it will still result in the loss of 60,000 square metres of agricultural land, the size of about eight football pitches.\nWorks go through archeologically sensitive area\nMoreover, 549 trees will be uprooted and 237 transplanted. To compensate for this the government is pledging to plant 618 mature indigenous trees. The project has not yet been approved by the Planning Authority.\nApart from these environmental considerations, the cultural watchdog had from the very beginning sounded the alarm bells on other fronts. Prior to the publication of the EIA, it had warned that works would run along a tract of the historical Wignacourt Aqueduct, which enjoys the highest degree of protection.\nThe superintendence had also noted that the project would result in the demolition of structures that might have cultural heritage value, such as rubble walls and vernacular features.\nFurthermore, works would run through an area known to be archaeologically sensitive, as evidenced through various discoveries including ancient tombs of high value.\nIn this respect, the EIA notes that in Triq l-Imdina a newly-identified archaeological site was discovered recently, consisting of rock-cut feature visible on the surface. It also points out that a concentration of structures is located near the 18th century chapel dedicated to St Paul’s Shipwreck.\nAs for potential remains, the study highlighted the possibility of unearthing underground piping, which formed part of the Aqueduct that dates back to the 16th century.", "comment_count": 6, "id": 610}, {"keywords": "", "author": "", "article_body": "The newly-appointed US Assistant Secretary of State for Europe, Philip Reeker, has paid a brief visit to Malta for talks with Prime Minister Joseph Muscat.\nHis visit was revealed by the US embassy in a tweet. No details were given other than that he also visited St John's Co-Cathedral.\nMr Reeker's appointment as assistant secretary of state for Europe and Eurasia was announced on March 5.\nHis previous appointment was at the US European Command (EUCOM) in Stuttgart, Germany.\nHe was also a US Consul General in Milan and Deputy and  Assistant Secretary of State in the Bureau of European and Eurasian Affairs from 2011 to 2013. \n ", "comment_count": 12, "id": 611}, {"keywords": "", "author": "Denise Grech ", "article_body": "Drug users taking an illicit form of the drug fentanyl, described as the most potent narcotic known, are chasing a cheap but intense high and pay no attention to warnings about its dangerous and potentially lethal consequences, experts have warned.\nAlso known as super-smack, illicit fentanyl has killed numerous first responders abroad who encountered the drug on the scene and last week the Maltese authorities warned the drug was making its way to Malta.\nTimes of Malta spoke to experts about what makes fentanyl so attractive to users.\nIn an attempt to give an intense high, fentanyl, in the form of a white powder, is often mixed with heroin – with drug traffickers, however, often being none the wiser, said addiction psychiatrist Anthony Dimech.\nHe said addicts were sometimes blinded in search of a high and often did not care what the drugs might contain.\n“It is not about what you get, it is about what you anticipate you are going to get,” he pointed out.\n “In some cases they do not even know they are mixing it in. In other cases it’s a cheaper way of mixing. Whereas before they might have been using something that was not as easily accessible, this is cheaper and gives a better high,” he added.\nIt is not about what you get, it is about what you anticipate you are going to get\nA drug forensics expert, Godwin Sammut, echoed Dr Dimech: “It’s not the first time that those who mix and create heroin do not know what they are making,” he said. “Traffickers do not always know their heroin has been mixed with fentanyl.”\nThe illicit powdered form is made in South East Asia and bought through Chinese eBay-style websites, he said.\nDrug trends in Malta were usually six years behind the US, helping forensic experts anticipate the next trend, he added.\nA medicinal form of the drug is provided in hospital to treat chronic, severe pain and major trauma. But the powdered form – 100 times stronger than morphine and 50 times more powerful than heroin – has authorities scratching their heads.\nMr Sammut said it was hard for analysts to pinpoint exactly how the drug was being made. Simply cutting up the already legal tablets did not have the same effect – the medicinal version is ‘cleaner’ than the product being made in South East Asia.\nThe European Monitoring Centre for Drugs and Drug Addiction has asked EU Member States to issue guidelines for first responders who are at risk of encountering the substance.\nCustoms officials, policemen and nurses have been advised to wear the correct protective gear and warned not to touch their eyes, mouth, nose or skin after dealing with a potentially contaminated surface.\nIn the US, the synthetic opioid has caused what some describe as an epidemic. Its deadly properties have even led it to be used for executions in US states such as Texas.\nDescribed as “the most potent narcotic known”, the man-made opioid had led the US Drug Enforcement Administration to issue a nationwide alert about its dangers.\nIn the UK, the drug is being bought from Chinese websites. In 2017, deaths caused by the opioid rose by 29 per cent, according to national figures.", "comment_count": 12, "id": 612}, {"keywords": "", "author": "", "article_body": "A landmark Sliema house, known to locals as Id-Dar il-Ħadra (the Green House) for its unusual green façade, is no more.Residents were dismayed last week to see the 19th-century house on St Agatha Street, once recommended by heritage authorities for special protection, brought down to make way for the construction of an eight-storey apartment block.Artist's impression of the planned block.\nThe Planning Authority granted permission for the works last February despite the objections of residents, heritage groups and the Sliema local council, while the Superintendence for Cultural Heritage had called for the building to be granted Grade 2 scheduling due to its architectural value.\nA prominent niche on the façade with a statue of the Virgin Mary, which gave its name to the adjacent St Mary Street, will be retained, along with a few other architectural features. The Sliema local council had lodged an appeal against the demoition decision, calling for the façade to be protected in its entirety, as well as other elements. \nThe council argued that the PA had ignored “the evident heritage value” of the house and allowed it to be replaced with “an incongruous and aesethetically questionable façade”. This and other grounds for the appeal were rejected by the Planning Tribunal in October, when it confirmed the decision to issue the permit.", "comment_count": 107, "id": 613}, {"keywords": "", "author": "", "article_body": "Edward Cardona, 36, from St Paul’s Bay, went on trial on Monday, accused of conspiring to traffic cocaine and possession of the drug.\nThe case goes back to 2013 when police arrested a female drug courier at Malta International Airport.\nThe woman was found to have been carrying a number of drug-filled capsules inside her stomach, with subsequent hospital checks yielding 73 capsules bearing almost one kilo of cocaine with a street value of €57,513.\nThe woman had later told investigators that she had been instructed by an Algerian man from Spain, called ‘Obi’, to smuggle the drug into Malta and hand it to pre-determined customers.\nIn the course of her collaboration with the police, the woman had recounted how she had visited the island several times.\nOn one occasion, back in December 2012, she had allegedly met “a tall, bald and burly man,” for the purpose of handing over some 70 capsules of cocaine and a further 20 grams of the drug, in terms of his agreement with ‘Obi.’\nThis information led police to Mr Cardona.\nThe trial is presided over by Mr Justice Giovanni Grixti.\nLawyers Nadia Attard and Ann Marie Cutajar from the Office of the Attorney General are prosecuting.\nLawyers Franco Debono and Amadeus Cachia are defence counsel.", "comment_count": 0, "id": 614}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Plans for a fast ferry between Malta and Gozo face further delay, as the Court of Appeal ruled that the selection of the service provider must follow public procurement regulations.\nChief Justice Joseph Azzopardi nullified a decision by the Public Contracts Review Board, which had found that Gozo Channel did not necessarily have to abide by public procurement rules when selecting a partner for its fast ferry venture.\nAs a public entity, Gozo Channel was bound to follow strict public procurement rules when awarding contracts, the Court of Appeal ruled. It ordered the review board to re-evaluate the objections made by Virtu Ferries, which is vying for the contract.\nVirtu Ferries, a private catamaran service provider, is protesting Gozo Channel’s decision to choose a fast ferry bid  made by Islands Ferry Network, a joint venture between Magro Brothers and the owners of the Fortina Hotel.\nAccording to Virtu Ferries, Gozo Channel abused its position because the successful bidder failed to meet the required technical and financial criteria to provide the service.\nThe contracts review body had concluded that it had no jurisdiction on the case, accepting legal arguments by both Gozo Channel and Islands Ferry Network that this was not a public tender proper but, rather, a different selection process, under different rules.\nHowever, the Court of Appeal dismissed these arguments, insisting that a contract awarded by a State company was a public tender and had to follow strict rules.\nThe saga, which has been going on for over two years will now have to go back to the drawing board, with the PCRB deciding whether Gozo Channel’s selection was made according to the rule book.\nAccording to Virtu, Island Ferries Network could not even qualify for the selection made by Gozo Channel as it had “no experience whatsoever” in the provision of fast-ferry services, as demanded in the state entity’s offer.\nVirtu is arguing that the selection of the Magro/Zammit Tabona joint venture was “vitiated” and decided upon “merits” which were outside the commercial sphere.\nBoth Gozo Channel and Islands Ferry Network refute these arguments, saying the most advantageous offer had been selected.\nThe company eventually selected to offer fast ferry services will be in line to receive millions in taxpayer contributions for chartering fast ferry vessels to Gozo Channel over a five-year period.", "comment_count": 36, "id": 615}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man addicted to child pornography was handed a suspended sentence on Monday after pleading guilty to having knowingly obtained and shared pornographic material related to minors.\nKevin Mifsud, 44 of Siġġiewi, was also ordered to undergo compulsory psychotherapy.\nThe court heard that the material had been downloaded from porn sites on the internet and the subjects involved were not Maltese.\nThe man was arrested following an anonymous tip-off to the police.\nMr Mifsud's lawyers told the court that their client’s troubles stemmed from a serious personal condition which needed to be treated.\nProsecuting inspectors Joseph Busuttil and Paula Ciantar confirmed that the man had also expressed his need to seek help to overcome his addiction.\nMagistrate Rachel Montebello declared the accused guilty and condemned him to a two-year jail term suspended for four years.\nThe court also placed the accused under a treatment order so as to receive the necessary psychotherapy and other medical assistance required to overcome his condition.\nThe court also ordered the confiscation and destruction of the pornographic material seized by the police.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 616}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A team of researchers at the University of Malta have come up with a cancer screening test that is less invasive and more sensitive than current methods.\nThe research forms part of a project called Accurate Cancer screening Tests (Act), which initially focused on improved diagnosis of breast cancer and is now developing similar tests for colorectal cancer.\nLed by Prof Godfrey Grech from the Pathology Department, the partners in this ongoing project are the university's Laboratory of Molecular Oncology and industry partner Applied Biotech.\nProf Grech noted that during the research, technology was adapted to develop a new method in diagnosing tumour cells, and in the meantime discovered new characteristics of colorectal cancer.\nA patent application has been submitted for the newly discovered characteristics and also the new screening methods.\nThe upcoming challenge will be identifying tumours at an earlier stage so that treatment could be more effective.\nThe sum of €200,000 was invested in the project through Fusion, a national funding programme managed by the Malta Council for Science and Technology.\nMCST chair Jeffrey Pullicino Orlando commended the research, noting that cancer impacted families, the country’s economy and health sector.\nOne out of every three people will get diagnosed with cancer before they turn 75. However, despite increases in diagnoses, treatment was also improving, he said.\nPhoto: Johnathan Borg\nHealth Minister Chris Fearne meanwhile noted that Malta sees 2,000 new cancer cases a year, while 900 people are killed by the disease annually.\nHe noted that the belief that Malta was too small to carry out research with a global impact had changed over the years.\nThe size of the island was actually advantageous as researchers had access to whole population data, a resource that only a few other countries had, he added.\nParliamentary Secretary for Financial Services, Digital Economy and Innovation Silvio Schembri said it was crucial to keep investing in the Fusion programme to encourage Maltese researchers to sustain their research.\nHe said that some €8million had been invested in research and it was having an impact on the economy.\nHe thanked researchers and scientists involved in this project.", "comment_count": 6, "id": 617}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The Malta Financial Services Authority has appointed an American company to help it check crypto currency assets.\nThe authority is currently going through procedures for the approval of cryptocurrency agents – known as virtual financial agents – at least 29 of which have already applied for licences. Once these have been approved, expected by the end of this month, the VFA agents are expected to submit applications for operators like exchanges, wallets and initial coin offerings.\nWhile the VFA agents are expected to do the due diligence on the individuals and entities behind these operators, the MFSA will still require tracking of the assets that flow through them – which is where CipherTrace will come in.\nCipherTrace was founded in 2015 by Silicon Valley entrepreneurs and was initially funded by the US Department of Homeland Security Science and Technology and government agency Defense Advanced Research Projects Agency. Its solution was described as being able to gauge and potential risk exposure of businesses including cryptocurrency exchanges, collective investment schemes and initial coin offerings.\n“Ciphertrace Compliance Monitoring will provide the MFSA with powerful oversight tools to automate regulatory processes and audit the risk management of virtual asset businesses licensed in Malta,” CEO Joseph Cuschieri said, noting that the MFSA was “strongly aware” of the money laundering and financing of terrorism risks associated with entities operating in this sphere.\nThe system can be used at both pre- and post-authorisation stages, and uses data encompassing exchanges, addresses, wallets and other entities, profiling everything from criminal addresses and dark markets, to gambling services and high-yield investment products.\nThe Times of Malta recently reported that the cryptocurrency operators waiting in the winds were champing at the bit as banks were politely declining their business, saying it was outside their “risk appetite”.\nSources said banks were not distinguishing between cryptocurrency and blockchain, even though the two were not always linked.\nParliamentary Secretary for Financial Services Silvio Schembri told the Times of Malta that he was holding talks with different banks and other stakeholders “to have a better understanding of the industry”.\nCipherTrace CEO Dave Jevans said that banks often find themselves turning away valuable customers in this lucrative sector, merely because of lack of insight about which businesses to trust as corporate customers.\nApplications have been steadily trickling in to the MFSA since the end of November for registration as VFA Agents under the Virtual Financial Assets Act.\nThe MFSA had told the Times of Malta that it was aiming to issue the first licences within the first quarter.\nAn authority spokesman had said that the timeline depended on the due diligence assessment – including competence in the field of anti-money laundering and the counter funding of terrorism.\nThe International Monetary Fund’s recent Financial System Stability Assessment Report urged caution with regards to virtual-asset investments because of their high risk.\nThe report cautioned that monitoring the sector would require \"significant resources with appropriate expertise, such as cyber risk experts, technology experts and lawyers specialised in technology, creating additional challenges for financial authorities to build and retain expertise\".\nIt \"strongly encouraged\" the authorities to implement the laws and regulations gradually, imposing strict conditions, such as periodic renewal, to any licence.", "comment_count": 4, "id": 618}]