[{"keywords": "Construction, Planning Authority, Court, St Julian’s", "author": "Claire Caruana", "article_body": "The government on Thursday would not say whether Planning Authority board member Matthew Pace would be stepping down following a court decision that he had a conflict of interest in the controversial db Group City Centre project.\nMr Pace’s involvement in the City Centre project was first revealed by The Shift News shortly after the authority approved it by 10 votes to four.\nThe board member, an entrepreneur, is a franchise owner of Remax Alliance Swieqi, which shared a database and website with Remax Malta. The agency had been selling apartments that were part of the db project at a time when no planning permit had been granted.\nMr Pace was appointed to the board in 2013, shortly after the Labour Party was elected to government.\nA conflict of interest and therefore the approval of the project was deemed null and without effect\nThe court ruled on Wednesday that Mr Pace, who was one of the 10 board members who voted in favour of the 38-storey tower and 17-storey hotel project, had a conflict of interest and therefore the approval of the project was “deemed null and without effect”.\nMatthew Pace. Photo: Facebook\nThe newspaper asked both the authority and the Ministry for Capital Projects whether Mr Pace, who was appointed to the board by the government, has stepped down following the court’s decision.\nTimes of Malta also asked whether the government or the authority had requested that Mr Pace steps down.\nLater in the afternoon, a ministry spokeswoman told the newspaper questions sent would be answered “later” but no such replies were received. A Planning Authority spokesman said board members were not appointed by the PA.", "comment_count": 7, "id": 2219}, {"keywords": "Crime, UK, Court", "author": "Edwina Brincat", "article_body": "A British man wanted in his homeland to face charges for his alleged involvement in a brutal 2003 killing should be sent back to the UK, a court ruled on Friday.\nThe magistrates' court ordered that Christopher Guest More should be held in custody pending his extradition to Britain. \nMr More, 41, formerly on Europe’s ‘most wanted’ list, was arrested in Malta earlier this month after almost 16 years on the run. \nA court in Macclesfield had issued a European Arrest Warrant to bring him into custody in May 2004, with an alert on the Schengen Information System issued in May last year.\nMr More, arrested after a covert operation between Maltese and British police, is wanted to face charges over 14 offences including murder, false imprisonment, grievous bodily harm, kidnapping and illegal restraint.\nRELATED STORIESCovert operation leads to arrest of Briton in Malta under false identity\nAfter a fingerprint court-appointed expert reported a “positive match” of the man’s fingerprints with those attached to the EAW, the Court, presided over by magistrate Donatella Frendo Dimech, declared that any lingering doubts as to the identity of the requested man had been “dispelled.”\nFurther noting that the offences for which he was wanted were extraditable offences in terms of law and given that no bars to the extradition had been raised, the Court ordered Mr Guest More’s committal to custody pending his return which was not to be effected before the lapse of seven days.\nLawyer Arthur Azzopardi was defence counsel.", "comment_count": 0, "id": 2220}, {"keywords": "Accident, Mtarfa", "author": "Denise Grech ", "article_body": "Elisa Buhagiar, the 10-year-old girl who died in a tragic car crash on Thursday, was described as a “very energetic” and happy child by her former Scout leader.\n“She was like a young woman, always dancing and doing cartwheels”, Antoine Vella, the Assistant Cub Scout leader at Mtarfa, said.\nThe 10-year-old was with her best friend, Mattea, and her father, when the car they were in went out of control and overturned in a narrow country road in Manikata.\nElisa and Mattea were both 'cubs' at the local scout group, and the Mtarfa group is now planning a session to explain what happened to the rest of the young kids.\nYoung Mattea and Elisa's father, who was driving the car, have been hospitalised, but efforts by the authorities to save Elisa were unsuccessful.\nThe two young girls were like two peas in a pod, Mr Vella said, adding he had fond memories of them staying up at night whispering when the Scout Group organised sleepovers or camping trips.\n“This was a complete shock to us and it hit the community like a ton of bricks,” he said.\n“She was very girly, and she loved animals. I keep hearing her laugh and I continue having flashbacks,” an emotional Mr Vella told the Times of Malta.\nThe small Mtarfa community is in mourning following the incident, Mr Vella added. \"It just reminds you not to take things for granted,\" he added. \nMeanwhile, St Joseph School in Blata l-Bajda reportedly cancelled a school concert that Elisa was supposed to take part in.\nContacted about the incident, representatives from the St Joseph School declined to comment.", "comment_count": 5, "id": 2221}, {"keywords": "Joseph Muscat, European Union", "author": "Ivan Camilleri", "article_body": "The Prime Minister’s prospects of landing one of the EU’s top jobs appear to have become bleak, despite intense lobbying by embassies and senior Maltese officials in European capitals.\nEU leaders on Thursday evening kicked off their crucial summit meeting in Brussels aimed at coming up with a list of names for the prestigious posts, but sources told the Times of Malta that so far Joseph Muscat’s name has not made it to any shortlist.\n“Despite Dr Muscat having made it amply clear in EU corridors that he was after the post of [Federica] Mogherini, the EU’s High Representative, this is not likely to happen,” a senior EU diplomat told the Times of Malta.\n“Obviously, when these discussions take place, you cannot exclude anyone, but I can tell you confidently that the Maltese Prime Minister will most probably not make it,” another diplomat within the Council presidency said.\nWho will head where?\nIn their summit meeting, EU leaders discussed who will be nominated to head the EU’s main institutions – the European Commission, the European Parliament and the European Council – as well as the High Representative, also known as the EU’s foreign minister.\nHe would surely be an asset in the next election\nThe unwritten agreement is that the persons appointed to the posts will reflect the results of the last European elections in terms of the political groups they represent.\nOn Friday morning, EU Council president Donald Tusk said talks had so far failed to bear fruit. EU leaders will now reconvene on Saturday July 2 to try and reach agreement on the posts. \nAccording to senior EU diplomats, the Commission presidency is expected to again be occupied by a member of the centre-right, the European People’s Party; the Parliament presidency will be split between the Socialists and the Greens; the Council presidency may go to the Liberals while the High Representative will be another Socialist nominee.\nThe two most likely names for the Socialist nominations are Frans Timmermans, the Dutch Vice President of the Commission, and Spanish Foreign Minister Josep Borell.\nCommissioner Muscat? \nAlthough Dr Muscat has never publicly admitted that he is seeking a top EU job to make his exit from Maltese politics, it is an open secret among his kitchen cabinet and friends that this is his goal.\nGovernment officials close to Dr Muscat said on Thursday that since the ‘big’ EU role appears unlikely, the possibility of the prime minister being nominated as Malta’s next European Commissioner is increasing.\nRELATED STORIESMuscat admits an EU top job is a long shot\nIn 2014, the Maltese government was among the first to nominate its next European Commissioner, Karmenu Vella. This time, no decision has yet been taken.\nLast week, a spokesman for the Prime Minister categorically denied that Dr Muscat is interested in becoming Malta’s next Commissioner but sources close to Castille said this possibility had still not been ruled out.\n“The only problem for this exit route for Dr Muscat is the potential response of the European Parliament, which has the prerogative to botch any of the nominated commissioners,” a senior diplomat said.\n“The EP has not been very complimentary towards Dr Muscat’s government of late, particularly due to rule of law issues, money laundering claims and the perception of other serious governance problems,” the diplomat said.\nSources close to Dr Muscat said he could continue serving as Prime Minister, despite repeatedly saying he would not be leading Labour into the next general election. However, a petition is being collected asking him to stay on.\n“Unlike the PN leader, Dr Muscat is in demand. He would surely be an asset in the next election, which should be easy to win given the current state of the PN,” a senior aide said.\n ", "comment_count": 155, "id": 2222}, {"keywords": "Court, Media", "author": "Edwina Brincat", "article_body": "New judge Francesco Depasquale insisted that he would not dwell upon the “continuous attacks” against the judicial system, which were “often unjust and incorrect” on this occasion, adding that he preferred to view the event as a 'celebration'.\nMr Justice Francesco Depasquale was giving his inaugural speech while presiding over his first sitting on Friday, addressing a packed courtroom in the presence of his family, close relatives, colleagues and state authorities.\n“I’m here to serve and, as such, I promise to do my utmost to ensure that the citizen feels that justice is being done, and that this is achieved in the most efficient and effective manner, whilst bearing in mind that every citizen is a human being to be treated with respect and loyalty,” he vowed.\n'Media savvy' courts\nThroughout his speech, peppered with coulorful anecdotes from childhood, growing up with a parent who was himself a member of the judiciary - now retired Mr Justice Franco Depasquale - and also recalling his university days, the new judge reiterated the need for the Courts to be “media savvy.”\nThis could be achieved through the setting up of a communications office within the law courts and, more importantly, an educational campaign on the laws, judgments and court operations in general.Journalists owed a duty to society in general to report “the truth in an impartial and loyal manner”\nMr Justice Depasquale vouched to put to good use the experience gained through his eight-year stint on the magisterial bench, “keeping up his efforts to ensure that justice is done within a reasonable time, in spite of the great limitations faced by the Courts today.”\nAddressing magistrates, his colleagues and friends, Judge Depasquale highlighted the “difficult and challenging” work magistrates did, pointing out that they handled 99 per cent of the criminal caseload.\nThese members of the judiciary worked “in silence without much fanfare and without expecting any gratitude,” often ending up “threatened and intimidated in public,” the judge went on.\nA word for journalists\nA special word went to journalists, particularly those who reports from court, who owed a duty to society in general to report “the truth in an impartial and loyal manner”.\nIn a world marked by misinformation and lies, the need for ethical journalism became even more strongly felt, said Judge Depasquale, observing that today’s society was “thirsty for certainty and truth.”\nHe urged journalists to persevere in their work, no matter how “thankless and difficult” it could be.\nFriday’s sitting was officially introduced by a speech delivered by Vincent Galea, as vice president of the Chamber of Advocates and former colleague of the new Judge, having both graduated in 1996.\nDr Galea said that Mr Justice Depasquale’s experience as a member of the judiciary was “tried and tested many times over,” praising the new Judge for his impartiality and efficiency when serving as magistrate.\nDr Galea also stressed upon the vital role of the media in ensuring that the right of informing the public is balanced against the right of fair hearing, stressing in particular the need for court reporters to have a background knowledge of the judicial process.\nThe role of the media needed to be discussed with all parties concerned, Dr Galea went on, stressing that in court cases “one size does not fit all” and calling for greater dialogue with the Chamber to achieve greater efficiency in the judicial process.\nAs for the hearing of cases, Dr Galea recommended that in those cases where evidence was to be heard, these would no longer be scheduled for 9am since such timing was making life difficult for those concerned, particularly lawyers.", "comment_count": 4, "id": 2223}, {"keywords": "Alternative energy, Statistics", "author": "", "article_body": "The amount of energy produced from Photovoltaic Panels (PVs) last year shot up to 131,303.7 kWp in 2018, increasing by over 16 per cent from the previous year. \nAccording to figures by the National Statistics Office (NSO) published on Friday, the domestic sector amounted to 52.1 per cent of the total amount, followed by 43.8 and 4.1 per cent in the commercial and public sectors respectively. \nThe peak power rating of an average PV system in the domestic sector, the NSO said, stood at 2.9kWP, while that for the commercial and public sectors totalled 45.2 and 20.9kWp respectively.\nWhere are most PV panels located?\nAccording to the statistics office, most of the energy was generated in the South Eastern and Northern Harbour districts at 19.6 and 17.8 per cent of the total. Increases were highest in the Northern Harbour district and lowest in the Southern Harbour district, the NSO said. \nThe stock of PV installations amounted to 25,007 last year, of which 84.5 per cent were installed in Malta and 15.5 per cent in Gozo and Comino. \nThe Northern Harbour and Western districts accounted for 37.5 per cent of the total stock of PV installations with 4,831 and 4,544 installations respectively. \n ", "comment_count": 3, "id": 2224}, {"keywords": "Crime, Finance", "author": "", "article_body": "Two foreign nationals traveling to Istanbul from Malta on Thursday were found to be carrying nearly €26,000 of undeclared cash as they were boarding their flight, while a Maltese passenger was found to be carrying nearly €13,000 as he was getting on to the ferry to Sicily.Customs officials from the Anti-Money Laundering Team stopped two passengers at the Departures lounge for checks at MIA following a positive indication by Charlie, the Customs sniffer dog.\nThey were escorted to the Customs Office where subsequent searches resulted in the elevation of €11,015 from one passenger and €14,630 from the other. The cash in excess of €10,000 per passenger was confiscated and the rest was returned to the passengers. Earlier in the morning at the Seaport, Charlie, the same sniffer dog, gave a positive indication for on a vehicle departing to Sicily, in which €12,760 were found, with the excess cash also confiscated.", "comment_count": 7, "id": 2225}, {"keywords": "Animal welfare, Properties", "author": "Claudia Calleja", "article_body": "The Lands Authority is investigating claims that a farmer who is occupying government land in Salini, to run a chicken farm, is illegally subleasing it to a horse rescue NGO.\nRMJ's Horse Rescue, Malta’s only horse rescue NGO, is claiming that the landlord of the Salini stables they rent is upping their €2,200 monthly fee by €700. As a result RMJ, a registered voluntary organisation, may no longer be in a position to take in horses.\nA spokeswoman for the Lands Authority said the authority has been looking into the case following the report of potential illegalities on site. \"The LA had no reports of the current tenant subleasing to third parties as is being alleged by NGO RMJ's Horse Rescue. To this effect, LA officials met with the representatives of the NGO to better understand their claim. The Lands Authority will intensify its investigations.”\nWe have been assured that we will not be made to move our horses until an alternative is found.\nMeanwhile RMJ president Corinne Farrugia said the NGO is in talks with many people to try and find a solution. \"The focus seems to be on the illegal aspect of subleasing government land so we hope that the horses will be taken into consideration. So far, we have been assured that we will not be made to move our horses until an alternative is found. I really hope this is true,” she said.\nParliamentary Secretary for Animal Rights Clint Camilleri said: “We are always willing to support NGOs safeguard the welfare of animals… within legal limits. I am in contact with the Lands Authority regarding this issue. It is very important that such an NGO continues to carry out its work.\"\nRMJ is Malta's only horse rescue NGO. It takes in injured and unwanted horses. The majority are race horses that would otherwise be sent for slaughter. \nEarlier this week the NGO informed its followers, via a Facebook post, that it may no longer be in a position to take in horses due to increased rental costs. \nMs Farrugia explained that the stables, where they currently keep 30 horses, are on government-owned land registered as a chicken farm. The farmer has declined to comment.\nThe NGO is calling for a solution that would solve the problem in the long term.“Donations always help. But we’re looking for a long-term solution, a place where we can keep these horses,” she said. Ms Farrugia elaborated that, apart from the rent, the NGO has to foot the bill for animal feed, vet bills as well as the cost of overseas homing.\nMeanwhile, RMJ set up a crowd funding initiative to raise money to cover bills https://gogetfunding.com/june-fundraiser/.\n \n \n ", "comment_count": 4, "id": 2226}, {"keywords": "Finance, European Union", "author": "", "article_body": "Less than 15 per cent of Malta's debt is held by non-residents, in stark contrast with the situation in other member states.\nEurostat on Friday reported that there were significant differences across the European Union (EU) regarding the sector in which government debt is held.\nThe share of public debt held by non-residents in 2018 was highest in Cyprus (76%), followed by Latvia (74%) and Lithuania (73%).\nThe holders of Malta's debt show a very different pattern to that of other member states.\n \n ", "comment_count": 2, "id": 2227}, {"keywords": "Finance, Crime", "author": "Claire Caruana", "article_body": "Updated at 2.45pm with Ministry comment\nInvestigators from anti-money laundering monitoring bodies come to Malta \"for a short time\" and then get things wrong, Finance Minister Edward Scicluna insisted on Friday morning. \nIt was therefore up to the government to \"tell them they are wrong\", Prof. Scicluna added, pointing to Moneyval and other similar bodies as an example. \nThe Finance Minister made the comments during his opening speech at the start of the 67th Meeting of the Joint Committee for the Prevention of Money Laundering. \nProf. Scicluna took issue with what he said was a certain level \"unfairness\" that arises from having documents that form part of investigations leaked. \nRELATED STORIESWere FIAU reports written to be leaked, asks Scicluna\n\"They come for a short time and they get it wrong but you have to tell them that they are wrong. This is the unfairness of leaking documents at this stage. If a smart guy wants to leak a document at this time, what can you do? We continue making our case because we want to try how the situation is,\" the minister said. \nThis is not the first time Prof. Scicluna disputed Malta’s poor showing in a recent evaluation of its anti-money laundering regime, insisting in April that the findings were \"leaked\" midway through the process. \nProf. Scicluna addresses his audience on Friday morning. Video: Chris Sant Fournier\nThe Sunday Times of Malta reported in March that Malta had failed the first stage of a Moneyval test, which measures the country’s compliance with principal international standards to counter money laundering, and the effectiveness of their implementation.\nIn view of this, the government was scrambling to improve its final score before the publication of the finalised report next summer.\nMoneyval evaluates countries' anti-money laundering regimes in a series of eight stages and Malta's final evaluation is due out in July.       \nMoving on to other issues, Prof. Scicluna also told the committee that Malta had started to review its efforts to combat money-laundering and other financial crimes in the late 1990s, even before the island had joined the EU. \nToday, he said, the government was still looking at ways to better tackle tax evasion, for instance, something which according to the minister had become \"a global issue\".\n\"Today, this is becoming a global issue and we got hit because it is a global issue,\" he insisted. \nOn monitoring by the local regulators, Prof. Scicluna said that while it was crucial that there are strengthened, \"the regulator cannot do everything and be everywhere\". \n\"I don’t think citizens are upright and go about their business in the legal way because there are the police the down the road. The police are there to deter crime and those who are not upright. It would be a police state if we were to expect every citizen to not be upright. Same with our business,\" he pointed out.\n'Give bodies space to do their work'\nIn a statement issued through the Department of Information later in the afternoon, Prof. Scicluna said that the gist of the address was that the Maltese regulatory authorities together will be showing the world that, rather than pointing fingers or blaming anybody, they want to look ahead, change and improve their systems and being effective in their AML task. “The Minister further explained that the evaluation procedures carried out by international organisations such as IMF, FIAP, FATF, Moneyval and the rating agencies allow for a phase where the country being evaluated is given the opportunity to point out any factual errors in a report. “Some of these errors occur due to the time limitations of the mission doing the evaluation. In any case the organisation will have the last say to accept or refuse changes to the report,” the statement read.The point made by the Minister, it went on, was that these international organisations should be given the space and allowed to come to their own conclusions, after all the set procedures have been followed, as in fact they are followed in all member countries. ", "comment_count": 47, "id": 2228}, {"keywords": "Accident, Maritime", "author": "", "article_body": "Two boats collided in the channel between Comino and Mġarr on Thursday night, leaving the driver of one of them seriously hurt.\nThe injured man is a 27-year-old Macedonian residing in Żebbuġ, Gozo. He was alone in his boat at the time of the incident around 10.15pm.\nThere were two people in the other boat: a 48-year-old man from Naxxar and a 35-year-old woman, also from Naxxar. They were not hurt.\nPolice investigations are still under way.", "comment_count": 0, "id": 2229}, {"keywords": "Luqa, Transport, Court, Crime", "author": "Edwina Brincat       ", "article_body": "Updated 10.50am\nTeenager Liam Debono has been sentenced to five years in prison, left more than €60,000 out of pocket and banned from driving for a decade for having driven a car while out on bail, despite a court order forbidding him from doing so. The 18-year-old, who is currently facing attempted murder charges for having allegedly run over police officer Simon Schembri in a 2018 hit-and-run incident, was caught behind the wheel by police last month.\nLiam Debono  stood alone at the dock while the Magistrates’ Court delivered judgment on Friday morning declaring the young man guilty of driving without a licence, in breach of a 3-year ban imposed upon him last year.\nHe was also found guilty of driving without an insurance cover, breaching a probation order, breaching bail and also with being a recidivist.\nThe young man, currently still facing proceedings over the incident which left PC Simon Schembri maimed for life, landed once again on the wrong side of the law when on the afternoon of May 24, he was spotted by an off-duty police officer, driving a Fiat Uno at Luqa.\nWhat had caught the policeman’s eye was the slouched stance of the driver, whom he immediately recognised as Liam Debono, in spite of his face being partially hidden behind sunglasses.\nSergeant Kevin Curmi, who earned a special mention by the Court on Friday for his “strong civic sense” and “respect towards his uniform and the role he occupied,” had on that Friday afternoon promptly alerted his colleagues, while continuing to chase the Fiat Uno, giving precise and detailed directions of the route taken by its driver.\nWhen reading out the salient parts of the judgment, Magistrate Joseph Mifsud, explained that case rested on the testimony of Sergent Curmi, declaring that the Court was morally convinced of the facts as testified by the police officer, whom he had no reason to doubt.\nAlthough being off-duty, the officer had followed the suspect, keeping visual contact and looking on as the driver jumped out of his seat to exchange places with the passenger, Jason Zammit.\nLater on, had also identified the alleged culprit through the clothes he had been wearing at the time of arrest.\nRELATED STORIESDebono almost crashed into off-duty officer\nMoreover, the officer had been present when Jason Zammit had first “confessed”, upon being stopped by the police, that Debono had “effectively” been driving.\nThe sergeant’s testimony had been corroborated by other evidence, the Court went on, adding that the fact that the defence had not chosen to cross-examine the witness, though not implying guilt, was in itself “indicative.”\nOn the basis of all evidence put forward, the court declared the accused guilty, condemning him to a 1-year jail term and a €6,000 fine. He landed a 3 and a half year jail term and a €5,000 fine for breaching probation and a further 6 month jail term for breach of bail, bringing the total to five years imprisonment and a €11,000 fine.\nHis earlier bail was revoked against forfeiture of the €10,000 deposit and €40,000 personal guarantee. Upon serving the jail term, the accused would have to face a 10-year driving ban.\nThe Court strongly deplored the young man’s attitude towards the law, ignoring court orders and “doing as he liked” as though he was “above the law.” If everyone did likewise, we would end up living in a lawless jungle, Magistrate Mifsud remarked, stressing that bail conditions were always to be followed scrupulously and “to the letter.”\nThe owner of the Fiat Uno, Jason Zammit, will forfeit the car, but will also face possible investigation over his certain participation in the offence.\nThe Court sent a recommendation to the Police Commissioner to investigate both the man and his daughter, Kirsty, for possibly testifying falsely in the proceedings.\nThe court finally revoked the brief of the probation officer who had been appointed to monitor the accused.\nLegal aid lawyer Victor Bugeja was counsel to the accused. Inspectors Fabian Fleri and Pierguido Saliba prosecuted.", "comment_count": 0, "id": 2230}, {"keywords": "Media, Religion, Health", "author": "", "article_body": "Autism is not a disease and certainly not something that can be ‘cured by prayer’, the Autism Advisory Council said on Friday.\nIts reaction came after parents of children with autism were left aghast after singer and TV presenter Phyllisienne Brincat broadcast a video showing a child who was allegedly ‘cured’ from autism through prayer, during her show Il-Verita on F-Living.\nThe council called on the Broadcasting Authority to take action, suggesting once again that a person with disability should be on its board.\n\nThe council said: “Autism is a lifelong neurological difference, and while certain behaviours and co-occurring conditions – such as anxiety – are regularly linked to it, autism itself is part and parcel of a person’s identity, and not something to be ‘grown’/ ‘prayed’ out of.”\nIt stressed that the behavioural manifestations linked to autism are often a reaction to a person “trying to cope with a world that is inaccessible to them” – such as a cluttered classroom at school – which warrants a shift in understanding and approach by those responsible for the social environment the children are in, rather than a change in the children themselves.\n“While behavioural management, as from an early age – and with the involvement of family members and other close persons – can help a person on the autism spectrum – this should never be a replacement for condoning society’s current lack of willingness to understand and adapt itself to the needs of all persons with disabilities – including persons on the autism spectrum,” it argued.\n“Pushing forward the idea that autism is something to be cured is pushing forward the wrong idea of autism, and a great disservice to persons on the autism spectrum and their family members.”", "comment_count": 74, "id": 2231}, {"keywords": "Politics, Joseph Muscat, North Africa", "author": "Ivan Camilleri", "article_body": "Neville Gafà, whose current role with the government has never been explained, last Tuesday formed part of an official government delegation holding talks with the Libyan government, the Times of Malta is informed.\nThe Maltese government did not issue a statement on the talks held with Libyan officials, who included Deputy Prime Minister Ahmed Maiteeq. The communications office of the Libyan government issued pictures of the meeting in which Mr Gafà was present.\nMr Gafà is a Labour Party activist and a member of OPM chief of staff Keith Schembri’s inner circle. He was allegedly involved in a medical visas racket linked to Libyan refugees and was subsequently sacked by the Health Ministry.\nWhile the Libyans said the latest meetings concerned economic and commercial matters, Mr Gafà did not reply when asked to explain his role on the trip.\nContacted by phone he said: “I cannot tell you. Please send me questions through e-mail and I will reply.” He then hung up.\nUntil the time of writing, Mr Gafà had not replied to e-mailed questions. He was asked about his role in the delegation, his current occupation with the government and who he was representing in Libya. \nThe Office of the Prime Minster did not reply to questions about Mr Gafà’s latest overseas mission.\nRELATED STORIESWhat is Neville Gafà's real job?Neville Gafà denied three times in parliament\nAccording to the Libyan government’s dispatch, Mr Gafà accompanied Malta’s Ambassador to Tripoli, Charles Saliba, in the talks which focused on economic and commercial relations between the two countries.\nFrom salesman to senior government roles\nA salesman until 2013, Mr Gafá was catapulted into senior government positions as soon as Labour was returned to power that year.\nHe first worked at the Health Ministry but was then transferred to Gozo for a short while after stories hit the media about his alleged involvement in a medical visas racket in connection with Libyan refugees.\nThe police never pressed any charges against Mr Gafà, despite talking to him on various occasions.\nHe was then appointed projects director at the Foundation for Medical Services by then health minister Konrad Mizzi, and given a €50,000 financial package.\nHowever, he found himself in hot water again following reports by the Libyan media that he attended “official” talks with Libyan officials and militia members in Tripoli.\nThe OPM distanced itself from these talks and Mr Gafà said he had been on a working holiday in which he met his friends. He passed off an encounter with a militia leader as a coincidence, saying he happened to “bump into him on the street”.\nRELATED STORIES'Neville Gafà is doing very good work' - Muscat\nMr Gafà’s declarations did not convince the new Health Minister and Deputy Prime Minister, Chris Fearne, who sacked Mr Gafà and rescinded his contract at the Foundation for Medical Services.\nHowever, in an apparent clash between the Prime Minister and his deputy, Mr Gafà was kept on the government’s payroll and started working at the OPM, as a collaborator of Mr Schembri.\nSince last January, the government has never explained Mr Gafà’s role at the OPM. Sources say his latest contract describes him as “a person of trust” of Prime Minster Joseph Muscat.", "comment_count": 23, "id": 2232}, {"keywords": "Crime, Prostitution", "author": "Ivan Martin", "article_body": "An under-age girl was among the victims of human trafficking in Malta last year, according to a new international report.\nThe Trafficking in Persons report by the US State Department, published on Friday, said that for the first time ever, Maltese authorities had identified and referred a child victim to care.\nThe Maltese girl was a victim of sex trafficking, the report says, adding that the government had provided the child victim with comprehensive specialised support.\nProsecution and Victim Protection\nThe report says that the Maltese police’s vice squad, which is responsible for investigating trafficking, conducted three probes in 2018, compared to seven in 2017.\nPolice also conducted seven investigations for illegal prostitution in massage parlours, but they found no evidence of trafficking.\nThe government prosecuted 10 persons (eight for labour trafficking and two for sex trafficking) compared to two in 2017.\nThree labour trafficking prosecutions initiated in 2014 and a 2004 case involving a police official for collusion with a trafficker remained pending at the close of the reporting period.\nIn March 2018, the government convicted one sex trafficker from a 2008 case, however, the court fully suspended the prison sentence; this was the first conviction since 2012.\nThe perennial issue of slow court proceedings, the report says, continued to hamper prosecutions and convictions.\nThere were no new investigations or prosecutions of government employees complicit in trafficking offenses.\nPolice identified 23 foreign trafficking victims and one Maltese victim, compared to 30 foreign victims in the previous reporting period. Forced labour victims included 17 Filipinos (13 from a single case), three Mauritians, one Nepali, and one Pakistani. Sixteen of the forced labour victims were male and six were female. Sex trafficking victims included one Moldovan woman and one Maltese girl - the first government-identified child victim to date.\nSixteen of the 24 victims identified during the reporting period received care services. The government assisted one victim with return to their home country.\nRELATED STORIESMalta's failure to convict human traffickers has NGOs worried\nA social worker dedicated to trafficking victims was employed last year, and in March 2019, the legal aid agency trained victim assistance lawyers.\nThe government encouraged - but did not require - victims to assist in the investigation and prosecution of their alleged traffickers, and provided them with protective support, including the option to testify via video, although courts inconsistently offered it.\nSome victims reported challenges in accessing interpreters, the report says.\nWho are victims of trafficking in Malta?\nAs the report has detailed in previous years, human traffickers exploit domestic and foreign victims in Malta.\nSex traffickers, the report says, exploit foreign and domestic women and children and labour traffickers exploit foreign men and women.\nForced labour victims originate from China, Eastern Europe, and Southeast Asia, with increasing numbers from the Philippines.\nWomen from Southeast Asia working as domestic workers, Chinese nationals working in massage parlors, foreign male soccer players, and women from Central and Eastern Europe, Russia, and Ukraine working in nightclubs represent populations vulnerable to trafficking.\nMalta does not meet the standards\nAccording to the report Malta does not fully meet the minimum standards for the elimination of trafficking but is making significant efforts to do so. The government demonstrated overall increasing efforts compared to the previous reporting period.\nThese efforts, the reports says, included prosecuting more traffickers, hiring a social worker dedicated to trafficking victims, removing all residency and work permit fees for foreign victims of trafficking, and for the first time, identifying and referring a child victim to care.\nHowever, the government did not meet the minimum standards in several key areas. It has only convicted one trafficker since 2012, which resulted in a fully suspended prison sentence, identified fewer victims, continued to lack coordination among ministries, and did not effectively control licensing for massage parlours, where there was a high vulnerability for sex trafficking\nKey recommendations\n• The report calls on the Maltese authorities to vigorously investigate and prosecute trafficking offenses, including convicting traffickers and sentencing convicted traffickers to significant prison terms.\n• Efforts to proactively identify trafficking victims among vulnerable immigrant populations, particularly migrant workers and women in prostitution needed to be increased.\n• Improve licence control for massage parlours\n• Increase collaboration between police and other stakeholders during investigations.\n• Use anti-trafficking training for police officers, prosecutors, and judges to increase focus on working with victims.", "comment_count": 20, "id": 2233}, {"keywords": "Police, St Paul’s Bay", "author": "", "article_body": "Updated 10.20am\nA decomposing corpse found in a garage in St Paul's Bay on Thursday afternoon has been identified as that of the Danish man who was reported missing earlier this month.\n\nHis identity was officially confirmed by police on Friday morning, although the cause of death has not yet been confirmed.\nAllan Hartmann-Jensen, 53, was reported missing on June 5.\nHe appeared to have been dead for some time, and an autopsy is to be carried out.\nA magisterial inquiry is underway.\n ", "comment_count": 0, "id": 2234}, {"keywords": "Politics", "author": "Jacob Borg", "article_body": "An annual declaration of assets filed by ministers and parliamentary secretaries has given insight into which Cabinet members have the most cash, investments and properties.\nThe man who holds the public purse strings is also the most cash rich of all the ministers. Finance Minister Edward Scicluna boasts a healthy bank balance of €701,000 and no outstanding debts\nSocial Solidarity Minister Michael Falzon isn’t short of a few pennies himself, thanks to bank balances of €639,000 and no debt.\nEnvironment Minister José Herrera’s €282,000 balances places him third in the cash rankings, followed by Tourism Minister Konrad Mizzi with €230,500.\nDr Mizzi, who famously ‘declared’ ownership of a secret Panama company in his asset declarations, has an outstanding loan of €297,000.\n\nOn the other end of the euro scales, parliamentary secretary Silvio Parnis declared €2,800 in bank deposits. Not a huge fan of cash holdings, Mr Parnis declared €109,000 worth of government stocks and a life policy worth €27,000, as well as six properties.\nNext on the cash ‘poor’ list came fellow parliamentary secretary Clifton Grima, who declared cash holdings of €4,200 and ownership of two properties.\nJustice Minister Owen Bonnici has €8,400 in the bank and owns three properties. He owes the bank €130,700.\nNot a huge fan of cash holdings\nEnergy Minister Joe Mizzi declared a bank balance of €13,200 and three properties, including a family grave.\nApart from cash and other assets, ministers are made to declare any outstanding debts.\nClifton Grima is the Cabinet member with the most outstanding debts. Mr Grima owes the bank a total of €397,000 in property loans.\nEconomy Minister Chris Cardona has unspecified debts of €375,000.\nParliamentary secretary Julia Farrugia has a loan of €312,100 and a credit card bill of €784.\nChris Cardona has unspecified debts of €375,000. Photo: DOI/Clifton Fenech\nInfrastructure Minister Ian Borg has funded his various property buys through a loan on which he owes €303,000.\nIn contrast, Chris Fearne, Evarist Bartolo, Helena Dalli, Edward Scicluna, Jose Herrera, Michael Falzon, Aaron Farrugia, Silvio Parnis and Anthony Agius Decelis are all debt free.\nOn the property front, Clint Camilleri on paper declared interests in the most properties, with a total of 23 appearing under his name.\nHe bought two of the properties himself, had one donated to him by his mother and holds small shares in 20 other inherited properties.\nJosé Herrera is second on the list, with interests in eight properties.\nSilvio Parnis and Roderick Galdes both own six prop-erties each.\nClint Camilleri holds stakes in 23 different properties.\nPrime Minister Joseph Muscat, who owns one property, is getting his house in order with a €120,000 ‘home works’ loan from BOV.\n*These figures are the total declared bank and cash savings. They do not include investments and property holdings. \nThe value of property holdings are not declared by ministers, and the value of investments are not always quantified.\nIn the red\n1st Clifton Grima - €397,000 2nd Chris Cardona - €375,0003rd Julia Farrugia - €312,884 4th Ian Borg - €303,000\nDebt Free\nChris Fearne, Evarist Bartolo, Helena Dalli, Edward Scicluna, Jose Herrera, Michael Falzon, Aaron Farrugia, Silvio Parnis and Anthony Agius Decelis", "comment_count": 29, "id": 2235}, {"keywords": "Accident, Ħamrun", "author": "", "article_body": "A 55-year-old woman was run over in Ħamrun on Thursday and was seriously injured as a result.\nThe police said that she was hit by a car driven by a 63-year-old woman from Swieqi.\nThe accident occurred at 6.30pm on Triq Joe Sciberras.\nPolice investigations are still under way.\n ", "comment_count": 0, "id": 2236}, {"keywords": "Politics, Finance", "author": "Denise Grech ", "article_body": "The Financial Intelligence Analysis Unit’s caseload surged to 1,614 new cases in 2018, from 780 in the previous year, according to its annual report.\nThe FIAU also forwarded 45 cases of suspected money laundering to the police, compared to 34 the year before.\nAnother 34 “spontaneous” reports were made to the police for possible further action to be taken.\nSuspicious transaction reports by the remote gaming industry also skyrocketed by 221 per cent over 2017, the FIAU noted.\nIn the report, FIAU director Kenneth Farrugia said the FIAU was “of the opinion that the amount of suspicious transaction reports received were not commensurate with the country’s risk profile as a financial services centre”.\n“There is clear evidence of under-reporting in a number of sectors, especially among designated non-financial businesses and professions,” Mr Farrugia said.\nCombined, the number of reports received from credit institutions and remote gaming companies during 2018 account for over 84 per cent of all STRs submitted to the FIAU, the report said.\nJust over 70 per cent of those reported to the FIAU in 2018 were either non-Maltese nationals or foreign companies.\nDisclosures to the FIAU increased by 116 per cent, reaching a total of 1,679 reports in 2018, the report noted.\nThe FIAU said it received 251 requests for information from foreign jurisdictions. It also sent 506 requests to foreign financial intelligence units. These figures, the report said, dwarfed of previous years’ and “clearly demonstrated the increasing use of international exchanges”.\nThe FIAU’s analysis section also channelled an excess of 200 intelligence reports to the national supervisory authorities.\nThe FIAU responded to 71 per cent of the requests in one week and 26 per cent within a month from date of receipt and request, according to the report. Last year was a “game changer” for the Compliance Unit, Mr Farrugia said, adding it managed to plan and organise several crucial changes for its supervisory strategy, risk assessment and governance framework.", "comment_count": 12, "id": 2237}, {"keywords": "Media", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe Times of Malta features the ramifications of the revocation of the db Group's permit for St George's Bay/Pembroke, as well as revealing that Neville Gafa was with a government delegation that went to Libya.\nThe 'sense of distrust' within the PN is how the Malta Independent described the situation, also writing about the fact that Maltese food prices were 12 per cent higher than those in the EU.\nIn-Nazzjon leads with Adrian Delia's call in Brussels for the EU to move closer to its citizens, also writing about the death of a 10-year-old girl in a crash in Manikata.\nL-Orizzont also carries a photo of the crash, along with a story about the insufficient numbers of moorings in Birżebbuġa, while its main story is the viewpoint of the Building Industry Consultative Council on the proposals to change the construction regulations.", "comment_count": 0, "id": 2238}, {"keywords": "Traffic, Accident", "author": "", "article_body": "Updated Friday 7.30am\nFour persons were hospitalised on Thursday evening following a head-on collision in Marsascala.\nThe crash took place at 8pm in Triq Id-Daħla ta' San Tumas and involved a Honda and a Maruti.\nThe injured persons included a group of three Italians, all of whom reside in Marsascala.\nThe 34-year-old Italian driver of the Maruti was seriously injured while his passengers and the other driver sustained slight injuries.\nThe road between Zejtun and St Thomas Bay was closed as a result of the accident.  \n \n ", "comment_count": 0, "id": 2239}, {"keywords": "Accident, Traffic", "author": "", "article_body": "A 10-year-old girl has died following a crash in a narrow country road in Manikata, close to Popeye Village.\nThe crash happened at 5.35pm and involved a Toyota Aygo driven by a 49-year-old man from Mtarfa and a Nissan Leaf, driven by a 35-year-old woman from Mellieħa.\nThe Aygo, in which the girl was travelling, overturned after going out of control. It was being driven by the girl's father. Another 10-year-old girl was also on board. Both were hospitalised. \nThe police are investigating reports that the accident happened when another car which was being driven wrong way suddenly stopped and started to reverse. \nRescuers from the Civil Protection Department were on site along with an ambulance crew to help the drivers and passengers. But efforts to save the girl proved unsuccessful.\nA magisterial inquiry is under way. ", "comment_count": 0, "id": 2240}, {"keywords": "Police, Crime", "author": "", "article_body": "The police have issued a call for information on the whereabouts of three men (picture below).\nThey are Srdjan Dragic, Milos Markovic and Ivan Bozic who, the police said, used to frequent the area of Qbajjar, Marsalforn.\nInformed sources said the men are wanted as part of investigations into a drugs haul in a Qbajjar apartment on Wednesday. \nAnyone having information about them was asked to phone, even anonymously, on 2122 4001 or 119.\n\n ", "comment_count": 0, "id": 2241}, {"keywords": "Gozo", "author": "Ivan Camilleri", "article_body": "A ferry which joined the Gozo Channel fleet last week to ease long queues at the harbours, has only been leased for the summer months.\nThe 32-year-old ro-ro vessel, leased from Greece with crew, is costing the state entity up to €5,000 a day, according to maritime sources. Gozo Minister Justyne Caruana is refusing to provide financial details, citing “sensitive information”.\nThe MV Nikolaos was leased from a Greek company through a direct order approved by the Finance Ministry. Gozo Channel did not issue a call for tenders for the service, despite the high cost involved.\nAsked to explain why the state-owned company had not issued a competitive tender, as it is obliged to do under EU procurement rules, the Gozo Minister failed to reply but promised a call for tender when the fourth ferry is introduced permanently.\nConfirming that the boat would only be here during “the summer period”, a spokesman for the Gozo Minister said: “Gozo Channel shall be issuing a tender for the identification of a ro-ro ferry which should complete the current line-up of ferries on a permanent basis.”\nNo one knows how many crew members are on board, how much are they being paid, who is paying for fuel and who is cashing in on the bar\nAsked how much the leased vessel was costing Gozo Channel and whether the government had made a special allocation of public funds for the lease, the spokesman declined to give any details.\n“Gozo Channel is not in a position to release commercially sensitive information,” the spokesman said.\nGozo Channel officials, speaking on condition of anonymity, said that the commercial details were in fact “a complete secret” and only the company’s chairman and its lawyers were privy to them.\nThe new vessel being given diesel by the contractor who supplies fuel to Gozo Channel ferries.\n“No one knows how many crew members are on board, how much they are being paid and under what conditions, where are they staying when not on board, who is paying for the fuel of the vessel and who is cashing in on the bar and other on-board services, whether Gozo Channel or the ship’s owners,” one official said. On the other hand, despite some complaints about the limitations of a 1987-built vessel when compared to the facilities of the three Gozo Channel ships built in Malta, commuters seem to have welcomed the new service.\n“The ship looks horrendous and it does not have a lift for the disabled or the elderly. Passengers have to board from the garage ramp, as there is no separate entrance for vehicles and passengers,” one frequent user said.\nAnother commuter, however, described the garage as very large and comfortable and the speed of the crossing is good: “Despite its constraints, a fourth ship is still better than three and the service is better with the latest vessel.”\nGovernment sources said that although the Gozo Minister was pushing for a fourth vessel to become a permanent feature of the ferry service, no decision had yet been taken.\n“Although a fourth ship might be useful in summer, it is highly unlikely that it will make economic sense in winter when demand is much lower,” a senior government official said.\n“Gozo Channel is already heavily subsidised by taxpayers so one needs to see if an extra vessel is viable on the long term.”", "comment_count": 39, "id": 2242}, {"keywords": "Crime", "author": "Edwina Brincat", "article_body": "A man who was accused of smashing the door of the family home during an argument with his mother, was let off the hook by a court on Thursday after the woman refused to testify against him.\nThe incident took place in April and necessitated police intervention.\nThe 44-year-old pleaded not guilty to using violence, moral or psychological, threatening and assaulting his mother, causing her to fear violence and damaging her property.\nHe was also been charged with cannabis possession.\nThe mother later told the court that she had forgiven her son and would not to testify against him.\nThe court said that since there was no other witnesses, the case was marked by a lack of evidence which could in any way support the charges against the accused.\nMagistrate Joseph Mifsud cleared the man of all charges save for the possession of cannabis to which the man admitted and was fined €75.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2243}, {"keywords": "Sliema, Transport", "author": "", "article_body": "An ice-cream vendor has lost a bid in court to stop Transport Malta from moving his van from its years-long parking spot at ‘the ferries’ on the Sliema Strand.\nGeorge Camenzuli had requested the court to issue a warrant of prohibitory injunction to stop Transport Malta and Infrastructure Malta from moving him from a parking spot which he said he had occupied for 30 years.\nHe said that Transport Malta had issued him a permit to park on a designated spot at ‘the ferries’ and he had a power and water connection which he regularly paid for.\nHowever, he had been verbally informed by Transport Malta officials to move his vehicle by June 14 because of the planned building of a quay (the quay reportedly will be used by the Marxamxett ferry).\nMr Camenzuli insisted that his ice-cream van would not affect the project and he therefore asked the court to stop the authorities from moving him.\nIn a joint reply, Transport Malta and Infrastructure Malta argued that Mr Camenzuli held a hawker’s permit to park but did not hold an encroachment permit. His right was not an exclusive one and he could, furthermore, move elsewhere without suffering damages. But they would suffer damages if the project, partly financed by the EU, was to be stopped\nThe court observed that the parking permit was issued to Mr Camenzuli ‘without prejudice and on condition that the authority can move or remove the vehicle if changes were needed to the bus stop where it is located.’\nThe court noted that Mr Camenzuli himself had confirmed that he did not hold an encroachment permit for the site, although he had applied for one.\nMadam Justice Lorraine Schembri Orland said Mr Camenzuli had not been able to prove he had a right over the site or that he would suffer irremediable damages if he was ordered to move elsewhere.\nThe court therefore dismissed his request.   ", "comment_count": 13, "id": 2244}, {"keywords": "Court, Justice, Prison", "author": "Edwina Brincat", "article_body": "A man who was wanted by the police on suspicion of theft was actually already in preventive custody in connection with other cases of theft, a court was told on Thursday.\nCurtis Bakoush, 30, of Valletta, was being investigated by police after showing up on CCTV cameras allegedly stealing perfumes at a Malta International Airport shop.\nHe was taken to court and accused of the thefts on Thursday. He pleaded not guilty.\nRELATED STORIESMan who preyed on elderly people caught after drug bingeMachine thief avoids prison\nThe thefts took place at the airport arrivals lounge over the span of a week, two months ago.\nMr Bakoush also pleaded not guilty to having assaulted the store manager, causing him slight injuries.\nCCTV footage and stills used by investigators were exhibited in court by prosecuting Inspector Silvio Magro, who told the court that the accused was eventually found at Corradino prisons.\nA request for bail was turned down by Magistrate Simone Grech, in view of the man’s untrustworthy character as evidenced by his criminal record and also bearing in mind that he was already in preventive custody.\nDefence lawyer Simon Micallef Stafrace informed the court that the accused wished to embark upon a drug rehabilitation programme.\nHe was remanded in custody.", "comment_count": 0, "id": 2245}, {"keywords": "St Julian’s, Planning Authority, Architecture", "author": "Philip Leone Ganado", "article_body": "The scheduled Villa Leoni in St Julian’s has been spared from development after the Planning Authority rejected a proposal to turn it into a hotel.\nVilla Leoni, scheduled at Grade 2 level and within the Urban Conservation Area, was described by the heritage authority as a “distinguished” 19th century house, with a formal garden extending at the rear of the building.\nBoth house and garden were said to have historical and architectural value.\nThe development plans, shot down on Thursday by 10 votes to two, would have added four storeys to the height of the building on Main Street and completely demolished its extensive garden to accommodate another seven floors overlooking Birkirkara Hill.\nPrior to Thursday’s hearing, the plans had faced opposition from the Superintendence for Cultural Heritage (SCH), which described them as a “massive intensification” in development and “incompatible” with the building’s cultural heritage value.\nObjections were also submitted by the St Julian’s council, Din L-Art Ħelwa and Flimkien Għal Ambjent Aħjar, who all argued that the development would breach the building’s Grade 2 scheduling status and failed to respect its surroundings.\nThe PA case officer, who recommended the application for refusal, had concluded that the structural alterations and proposed height and depth all ran counter to planning policy.\nThe case officer also said the plans would have long distance implications and failed to respect the urban design and environmental characteristics of the UCA.\nDuring the hearing, St Julian’s mayor Albert Buttigieg insisted that the neighbouring streets and buildings were all residential, and that the large-scale commercial development would contribute to residents being “flushed out” of the area, as had already happened in other parts of the town.\nProject architect Edwin Mintoff argued that the villa would be retained practically in its entirety, and that discussions with the SCH were still taking place. He said the proposal was in line with similar approved developments on nearby sites and elsewhere within the UCA.\nThe PA board upheld the recommendation to refuse the development, with only deputy chair Elizabeth Ellul and board member Deborah Busuttil voting to approve.", "comment_count": 12, "id": 2246}, {"keywords": "Accident, Police", "author": "", "article_body": "A man and a woman were grievously injured after they were hit by vehicles in separate accidents on Thursday.\nIn the first, in Triq Ponsomby, corner with Triq Ġużeppi Callus, Mosta, a  63-year-old man from Mosta was hit by a car being driven by a 54-year-old man from Ħamrun. The accident happened at 10.30am.\nIn the other accident, an 81-year-old Italian woman was hit by a Mitsubishi L200 driven by a 51-year-old man from Rabat. The accident happened in Triq ix-Xatt, Msida, at 10.50am.\nBoth victims were taken to Mater Dei Hospital by ambulance.\nThe police are investigating.\n \n ", "comment_count": 0, "id": 2247}, {"keywords": "Transport", "author": "", "article_body": "An investigation has been launched after a bus driver was left with bite marks and scratches when an argument with a passenger got out of hand.\nCCTV footage showed a passenger spitting at a bus driver after the driver refused to let him off after the vehicle had passed a bus stop on Tuesday, a spokeswoman for Malta Public Transport said. \nThe spokeswoman said an argument ensued and the passenger got off at the next stop and started kicking the bus, the spokeswoman said. The driver then disembarked and an argument between the two escalated until they were both physically violent.\nBoth were left with injuries, the driver to his knee and arms.\nThe spokeswoman said MPT had reported the case to the police and would be assisting the driver.\nNo disciplinary action would be taken against the driver, she said.\nThis was not the first instance of road rage escalating into physical arguments.\nIn 2017, CCTV footage showed a man accused of assaulting a bus driver after he tried to board the bus using an expired bus ticket.\nProsecutors had said it was not the first time the accused man tried to pull off the trick, and that the driver and the passenger had already been involved in another argument a few days before the fight.", "comment_count": 4, "id": 2248}, {"keywords": "Employment, Family", "author": "", "article_body": "The European Parliament's new Work-Life Balance directive has been signed into EU law.\nMember states will now transpose the directive, which aims to improve the quality of life of families, parents, workers and carers.\nThe new law was signed at the European Parliament in Brussels by European Parliament President Antonio Tajani, in the presence of parliament’s rapporteur and lead negotiator MEP David Casa.\n\nSpeaking after President Tajani signed the directive into law, Mr Casa said that all member states, including Malta, should start the process of introducing the rights catered for in the directive.\nThese rights had to be introduced within three years. They include the introduction of 10 days of paid paternity leave, two months of paid parental leave, five days of annual carers leave and the right to request flexible working arrangements.\nThis law was a direct investment in families across the EU. It would ensure a better sharing of caring responsibilities between men and women helping reduce the gender employment, pay and pensions gaps.\n[twitter id=\"script>\" link=\"\n\n\"][/twitter]\nMEP Casa led the EP negotiations with the European Council to ensure that the directive reflected realities and ensured that the new rights would not be a huge burden on businesses, especially SMEs.\nMr Casa thanked European Commissioner Marianne Thyssen for her cooperation during the negotiations.", "comment_count": 16, "id": 2249}, {"keywords": "Construction, Court, Planning Authority", "author": "Sarah Carabott", "article_body": "The developers behind the controversial db Group City Centre project in Pembroke cannot appeal the court decision that has halted the development, according to lawyers representing the objectors.\nWednesday's decision was described as “huge” by lawyer Claire Bonello, who was acting on behalf of three councils, a number of NGOs and residents of the area.\nThe court ruled that a member of the PA board had a conflict of interest when he was called to decide whether to award a permit for the project.\nThe appellants’ legal team, which included Ian Vella Galea and Malcolm Mifsud, told Times of Malta the ruling meant the developers would have to resubmit their development proposals.\nRELATED STORIESPembroke db Group project works halted until appeal is decidedPembroke db Group project works halted until appeal is decided\nAsked if this judgment could be used to challenge other decisions, they said it created a good precedent for similar cases.\nThe €300 million project – which includes a 37-storey tower and 17-storey hotel – had been approved by the PA by 10 votes to four, despite the board having received an unprecedented 4,500 objections.\nOne of the 10 votes cast in favour was by Matthew Pace, a board member and entrepreneur who was later revealed by The Shift News as being involved with a branch of one of the real estate agencies seeking investors and buyers for the project.\nMr Pace is a franchise owner of Remax Alliance Swieqi, which shared a database and website with Remax Malta.\nMr Justice Mark Chetcuti said the Environment and Planning Review Tribunal’s decision in February granting the go-ahead should be revoked and that the Planning Authority’s September approval of the plans was to be “deemed null and without effect”.\nAn artist’s impression of the db project in Pembroke.\nIn 2016, Labour MP and Planning Authority board member Joseph Sammut had recused himself from a hearing on the revocation of fish farm permits, saying he had represented interests in the sector.\nPlanning Authority board member was ‘objectively biased’\nIn the db case, Dr Bonello said residents had finally been “vindicated” for not giving up.\nA spokesman for db Group declined to comment, saying the company had nothing to say at this early stage.\nWhen contacted, the Planning Authority said it was studying the court’s decision.\nQuestions about whether it had conflict-of-interest guidelines for its board members or whether it had any intention of introducing such guidelines following the decision remained unanswered by the time this newspaper went to print.", "comment_count": 61, "id": 2250}, {"keywords": "Weather, Climate, Environment", "author": "Philip Leone Ganado", "article_body": "An ‘atmospheric tsunami’ struck Malta’s east coast early on Monday morning, sweeping small boats onto the rocks in Xemxija and registering on ocean monitoring stations in St Julian’s.\nAn eyewitness in Xemxija told Times of Malta that at about 6am, the sea level began to rise and fall by around 60 centimetres in regular cycles every few minutes. The phenomenon lasted roughly an hour, leaving several small boats stranded on the shore.\nAldo Drago, head of the University of Malta’s oceanography research group, said the phenomenon was known as a coastal seiche, or milgħuba, caused by atmospheric changes.\nRELATED STORIESAn 'atmospheric tsunami' caused Msida and Birżebbuġa floodingHigh freak waves were not a ‘mini-tsunami’\n“In the early hours of the day a train of atmospheric gravity waves hit the Maltese islands from the east; their impact on the sea is like a big sea hammer repeatedly hitting the sea surface and producing long period waves in the open sea areas,” Prof. Drago said.\nThe phenomenon was captured by monitoring stations forming part of a national observing system run by the oceanography research group, positioned near Portomaso.\nThese stations picked up intense atmospheric waves starting at around 2.30am and continuing for around three hours.\nProf. Drago said that while sea level changes near Portomaso were quite limited, the effect would have been amplified within bays.\nMoreover, he said, the same phenomenon would have also occurred at Mellieħa Bay, which was known to oscillate in direct opposition to St Paul’s Bay as two connected water bodies, and where sea level changes of more than one metre had been observed in the past.\nProf. Drago also had some words of warning for the owners of vehicles parked on a quay close to where the phenomenon was observed: “Just a few centimetres higher and these sea level oscillations could well have well drifted the vehicles away!”\nThe phenomenon was captured by real-time monitoring stations forming part of a national observing system run by the oceanography research group, positioned near Portomaso.", "comment_count": 6, "id": 2251}, {"keywords": "Society, Migration, Education, University, Racism", "author": "Claire Caruana", "article_body": "One in every three foreign students experiences some form of bullying while at school, a study on the well-being of non-Maltese children has revealed.\nPublished this week, the study by University of Malta researchers and commissioned by the Children’s Commissioner, analysed the lives of foreign minors and their overall well-being.\nConducted over a period of two years, the research was carried out among 2,500 students who were both foreign and Maltese. They took part in four studies.\nA series of interviews with children from various schools revealed that 33% of those interviewed experienced some form of bullying while in school. According to the data, the most common form of abuse was name calling, with almost 45% of students experiencing this type of bullying. The figure was only slightly lower for two other forms – hitting and being “left out” – with 33% experiencing this form of bullying.\nRELATED STORIESTeach Maltese to foreigners' children - Education Minister\nOne student, a 14-year-old boy, claimed he did not think school was “really safe”.\n“Here you have to be very careful with people,” he told the researchers.\nAnother student, a 12-year-old girl, described how there were “a lot of bullies” at school, with both physical and psychological bullying being reported on a daily basis.\nThough most students did not specify if they were victims of racial bullying, a small number did reveal to the researchers that they had experienced bullying because of their race, religion or the inability to speak Maltese or English fluently.\n“They don’t let me play at school because I am Syrian,” a 12-year-old boy claimed.\nAccording to the researchers, students also feared schools often take physical bullying more seriously than any other types. The children told the researchers they wanted their teachers to not only address physical bullying but other forms too.\n“The school is quite harsh on physical fights but if someone says something to you, they don’t really mind it [sic],” a 15-year-old girl pointed out.\nOn fights between children at schools, the study showed these were more likely to be a problem in State schools, where almost 20% reported fights on “most days”. The figure went down to 11.8% at independent schools and even lower (9.1%) in Church schools.\nOn educational engagement and inclusion, the researchers found that students from low socio-economic status and who lacked proficiency in Maltese and English were less likely to be engaged or included.\nStudents from Africa or the Middle East, the researchers noted, appeared to be less cared for and were less open to learning new things and participate in classroom activities. These students also had less friends and were less likely to be included in social activities when compared to peers from other nationalities, the researchers went on to note.\nThe focus of the study was children aged up to 16 who are either born outside Malta or in Malta to non-Maltese parents (or one parent in the case of single parents) who are currently living in Malta.\nAll foreign children in Malta (and their teachers, parents or carers) who could be identified through schools, residential homes, centres and agencies, were invited to participate.\nA representative sample of Maltese students in primary, middle and secondary schools, was also included in the study.", "comment_count": 0, "id": 2252}, {"keywords": "Politics, Adrian Delia, PN", "author": "Ivan Camilleri", "article_body": "Nationalist Party leader Adrian Delia was faced by calls to step down from several of his MPs late Tuesday but rejected them, before telling waiting journalists that no one at the parliamentary group meeting had asked for his resignation. \nAt the meeting, he was bluntly told by MPs that the PN would be unelectable if he remained leader and that the next logical step would be to step aside in the interests of the party, Times of Malta is informed.\nThe embattled leader, who presided over the party’s worst ever election results in May, had been asked to give the parliamentary group a reply during the Tuesday meeting on whether he had made up his mind on his exit.\nHe turned down both the demand to hand in his resignation and, failing that, the request to resort to the party’s highest organ, the General Council, and ask for a vote of confidence.\nA number of MPs who spoke to Times of Malta on Wednesday described Dr Delia’s declaration – that he did not face calls to resign – as “unbelievable”.\nAlthough they insisted on remaining anonymous, they claimed he was told to step down by at least 10 members of the parliamentary group.\n“This is not about Delia anymore but about the future of our party,” one MP said, adding it was evident the PN was going nowhere with Delia and the baggage he carried.\n“Last night (Tuesday), he was repeatedly told once again, very directly, that he was unelectable and that he must go.”\nAccording to the accounts of the meeting, as it got underway, the PN leader ignored the request that had been made to him in the two previous parliamentary group meetings, that he should take some time to reflect, consult and convey a decision on his future.\nInstead, he made 10 proposals to “radically restructure the party” which he said he would like to work on in the coming weeks.\nThe proposals included meeting every two weeks for the parliamentary group (it used to meet once a week during the last legislature), the inclusion of more people in his strategy group and the holding of another national convention. \nConfronted by several MPs about whether he had decided on his position, he insisted he was not going to resign.\nAt that stage, MPs proposed that he should at least go to the General Council to ask for a vote of confidence in his leadership.\nDr Delia turned this avenue down, arguing it would create deeper splits in the party.\nTimes of Malta is informed that only two MPs openly expressed the desire for Dr Delia to remain at the helm. All the others either sat on the fence or told him outright that he should leave.\nOne MP expressed frustration that after all these meetings “we are still back to square one. Dr Delia is refusing to do the honourable thing”.\n“We now have to decide whether to try to force him to leave or let him drift for another three years until the election. In that case, the PN will continue to suffer and Labour will keep getting stronger.”\nWhere will the PN go?\nWith Adrian Delia refusing to step down of his own accord, the party is faced with a number of options:\nOption 1: He is left at the helm to face the next general election in three years’ time. Going on the last historical electoral defeat, this would be expected to lead to another significant loss, especially as retaining Dr Delia as leader is seen as unlikely to resolve the internal conflict and might lead to more PN supporters dissociating themselves from a party led by him. In that eventuality, Dr Delia would then have no option but to step down.\nOption 2: The parliamentary group moves a motion to sack Dr Delia as Opposition leader. However, while they would appoint someone instead of him who enjoyed their confidence, he would still be the leader of the party itself since he was elected by the party members. This split would weaken the PN even further.\nOption 3: The necessary 150 signatures are collected from members of the General Council to call an extraordinary meeting, in line with provisions in the PN statute. A motion calling for a vote of confidence in Dr Delia as party leader is then moved. If Dr Delia wins, he stays on. If not, he will be sacked.\nOption 4: Dr Delia tests his leadership during a convention of paid-up members of the party (tesserati). If he fails to win sufficient support, he would have to leave his post.", "comment_count": 189, "id": 2253}, {"keywords": "Media", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says the db developers are back to the drawing board as their permit has been declared null. In another story, it says Nationalist MP Adrian Delia hangs on as MPs demand his resignation.\nL-Orizzont says MPs opposing leader Adrian Delia have been weakened.\nIn-Nazzjon says DB’s permit for massive development on ITS land has been revoked.\nThe Malta Independent says the Financial Intelligence Analysis Unit has made 12 requests for information to the United Arab Emirates in 2018.", "comment_count": 0, "id": 2254}, {"keywords": "Drugs", "author": "", "article_body": "Cannabis legalisation lobby group ReLeaf has expressed concern at 'reservations' by President George Vella on extending legal use of the drug beyond medical care.\nPresident Vella said on Tuesday that “as a doctor and a father” he had reservations about how wise it would be to extend the legal use of cannabis beyond medical care.\nSpeaking at a conference on drugs and mental health, Dr Vella said he preferred to rely on the advice of experts in such matters.\nIn a statement, Releaf on Wednesday expressed concern that there continued to be \"poor understanding of why and how a legalised and regulated market could operate.\"\nThe scope of a legalised and regulated market, the group said, would be to address the very basic of concerns surrounding cannabis and cannabis use.\n\"In brief, a legalised and regulated market is in fact centred on the fundamental notion that as a society we hold the opportunity to take control of this widely used consumable product,” the group said.\nReLeaf argued that, as already implemented in various countries, legislative changes would ensure cannabis was only sold to adults, tested for any impurities or bacteria, and grown and distributed by certified professionals.\nThe group said it looked forward to holding a meeting with Dr Vella, to further explain the principles and functions of a legalised and regulated cannabis market.", "comment_count": 39, "id": 2255}, {"keywords": "Health", "author": "Claire Caruana", "article_body": "Works at the physiotherapy department at the now-closed St Luke’s Hospital will be completed by October following an agreement between US operators Steward Health Care and the nurses’ union. \nThe works on the run-down building, which physiotherapists say is in such a bad state that they cannot treat their patients properly, are set to start next week. \nIn comments to the Times of Malta yesterday, Malta Union of Midwives and Nurses president Paul Pace said that the time frames supplied by Steward were “acceptable”.\nHe confirmed that Steward had also committed to starting the works next Monday.\n“We had a meeting with Steward who confirmed the works would commence on Monday and be completed by October,” Mr Pace said.\nRELATED STORIESSteward says it needs more time to plan belated physiotherapy department overhaulPhysiotherapy department is in a 'shambles'\nSituated at St Luke’s Hospital and run by Steward Health Care, the US company that took over the 30-year government concession to manage three hospitals, the outpatient physiotherapy department is the only one of its kind on the island. Some 75,000 patients are treated at the department every year. Despite this, the unit has not seen an upgrade in years, with the only treadmill there not working for months on end. \nIn recent months, the union had resorted to issuing directives that resulted in no new patients being treated at the department for weeks after the operator failed to deliver the promised timelines on works.\nThe time frames were acceptable\nAsked whether, in light of the complaints in the past that Steward had failed to bring about change, the union was confident the time frames would be met, Mr Pace said that at this stage, the operator seemed committed. \n“We have been provided with time frames that are broken up into five different phases. We also have a breakdown of the work that will be carried out on a week-by-week basis.\n“Everything is very public and if the operators fail to complete the works by October, they will have to answer everyone, including the Health Ministry,” Mr Pace went on. \nAccording to Mr Pace, Steward has engaged a number of contractors to carry out the works, including one that is foreign. \nIn a statement, Health Minister Chris Fearne “thanked” Steward’s team, led by Nadine Delicata. \nAccording to Mr Fearne, the upgrade will allow for the introduction of new services for those with Parkinson’s as well as multiple sclerosis patients.", "comment_count": 7, "id": 2256}, {"keywords": "Adrian Delia, Politics, European Union", "author": "", "article_body": "PN leader Adrian Delia is in Brussels for a meeting of the European Popular Party, of which the PN forms part. The meeting will be held on Thursday.\nHe is accompanied by PN international secretary Roselyn Borg Knight.\nThe meeting will be held hours before a summit meeting of EU heads of government which is expected to focus on the future strategy of the EU and nominations to the key posts of the EU.\nPrime Minister Joseph Muscat will be attending the summit, ", "comment_count": 3, "id": 2257}, {"keywords": "Parliament, Politics", "author": "", "article_body": "The Minister for Finance will gain new powers over the management and spending of public funds in terms of a new law to regulate public finance management, currently being considered by the House of Representatives.\nThe new law will distinguish between the powers of the finance minister, those of other ministers, and those of delegated officials.\nAlthough permanent secretaries will be responsible for the proper management of finances within ministries, the finance mister will be given the power to prevent entities from making use of public funds in cases where these funds were not being used in accordance with legislation, Finance Minister Edward Scicluna told parliament.\nThis would ensure that public funds were used properly and towards their intended end.\nProf. Scicluna explained that each ministry’s permanent secretary will be required by law to start an internal investigation as soon as he or she suspects that any provision of the law is being breached. He would then be bound to prepare a report in order to identify the culprit and to proceed with efforts to recover any misappropriated funds, without prejudice to the government’s rights at law.\nThree levels of oversight\nThe bill will introduce three levels of oversight with respect to the misuse of public funds, by attempting to prevent the misuse of these funds in the first place, identifying the misuse of these funds when it occurred, and taking steps to correct this misuse after the fact.\nThe bill would also make clearer the duties and responsibilities of officers with a role relating to the management of public funds.\nProf Scicluna said the bill will also identify what should be considered mismanagement of public funds, and the steps to be taken in each case. It includes guidelines to limit the use of “below-the-line accounting,” since such accounting does not appear in the government Budget.\nFurthermore, it will pave the way for the public sector’s move from what was known as the Departmental Accounting System (DAS) to an accruals system based on International Public Service Accounting Standards (IPSAS).\nProf. Scicluna insisted that access to correct and updated information was essential for correct decisions to be taken. The necessary training was being provided, with a period of parallel accounting to be undertaken prior to a complete shift to the new accrual-based system of accounts.\nIn the interest of having access to up-to-date information concerning the government’s financial situation, the legislation would also give the Accountant General the power to request information concerning the bank balances of every government entity from the banks where these entities held accounts.\nAlthough Opposition Whip Robert Cutajar said that the Opposition would be voting in favour of the Bill, he and the shadow minister of finance, Mario de Marco, criticised the government’s track record on good governance.\nPoor track record of good governance\nDr de Marco said that the proper management of the country’s finances had an impact on the future of the country and of coming generations. Financial discipline and proper accountability made a difference in everyday life. The way a country managed its finances was fundamental to investor confidence and to positive reports from credit rating agencies, and no government could sustain public spending if this spending were not managed well.\nDr de Marco and Mr Cutajar both made reference to “underhanded deals” which had been attributed to Tourism Minister Konrad Mizzi, to the various land transfers carried out by the government which had attracted controversy, and to doubts raised by the Auditor General in various reports concerning government expenditure.\nThe two MPs took the government to task for resorting to direct orders and “accelerated procedures,” when direct orders were intended to be the exception, not the rule. They questioned who would be bearing the responsibility for this abusive use of procurement regulations.\nDr de Marco also pointed out that it had been three months since the Moneyval report on Malta was leaked. He asked Prof. Scicluna to elaborate on any measures undertaken by the government in order to improve Malta’s position in the eyes of Moneyval, considering that a Moneyval plenary session would be held in the coming month in order to determine whether the negative report which had been drafted should be published in its original form or amended to take positive developments into account.\nHe questioned whether the government had indeed engaged experts to draw up recommendations for Malta’s position to be improved, and whether the government intended to adopt these recommendations or had an alternative plan to avoid the blacklisting of Malta.\nDr de Marco requested details concerning when the shift to accruals-based accounting would begin. The best financial management systems were futile if there was no political will to do things properly, he said, and it was useless to pass legislation if the respective institutions were toothless or partial to the Government. ", "comment_count": 11, "id": 2258}, {"keywords": "Crime, Drugs", "author": "", "article_body": "Three men and a woman, all Maltese, have been arrested by the police as part of a drugs raid focused on a room in St Thomas Bay.\nThe police said the raid took place on Tuesday afternoon when members of the Vice Squad and the Special Intervention Union found suspected cocaine and heroin ready for trafficking.\nThey arrested three men, who are resident in Cospicua, Qormi and Marsa.\nA young woman was arrested later in a house in Żejtun. \nThe raid followed weeks of observation. Magistrate C Farruġia Frendo is holding an inquiry. \nPolice investigations are continuing.", "comment_count": 2, "id": 2259}, {"keywords": "Construction, Properties", "author": "Matthew Xuereb", "article_body": "The proposed law to avoid damage to third party properties actually makes them more vulnerable because it removes the obligation of a geological investigation, according to geologist Peter Gatt. \nDr Gatt told the Times of Malta that third party property owners are “worse off” with the proposed amendments as the geological investigation is not any longer an obligation but will depend on the arbitrary decision of the project’s architect.   \nHe explained that the 2013 version of the same legal notice imposes the requirement of a geological investigation for every excavation deeper than three meters. \nHowever, the amendment now states that a geotechnical design report may include a geotechnical investigation, if the architect deems it necessary. \nDr Gatt said a geotechnical report is one which looks at rocks but purely from the point of view of the preparation of foundations. A geological investigation is more of an in-depth study of the rocks and their quality. \n“Before it was a requirement. Now it’s up to the architect to decide on something that he or she is not necessarily competent in,” he said. \n“It’s like telling an orthopaedic surgeon to perform an open heart surgery. By becoming arbitrary, in all probability the geological investigation will not be done.\n“The way I see it, the new amendments are an erosion of the protection previously afforded to third party property owners who need most protection during excavation more than during construction. It just doesn’t figure,” he added. \nDr Gatt also expressed concern that there is no register of geologists who can carry out such studies and that Malta is the only country in Europe which does not have a National Geological Service.", "comment_count": 18, "id": 2260}, {"keywords": "European Union, Politics, Gender", "author": "", "article_body": "Labour MEP Miriam Dalli has been elected as one of the vice presidents of the Socialists and Democrats Group in the European Parliament.\nThe group on Tuesday elected Spanish MEP Iratxe Garcia Perez as its new president. She is the second woman to take the helm of the group after Pauline Green, 20 years ago.\nThe group had nine vice presidents.\nDr Dalli is starting only her second term in the European Parliament. She was the most popular candidate elected in last month's MEP elections in Malta.", "comment_count": 24, "id": 2261}, {"keywords": "Crime, Court, Gender", "author": "Edwina Brincat       ", "article_body": "A soldier who turned violent after his wife posted an Instagram photo of herself at the beach was conditionally discharged for three years on Wednesday.\nJoel Portelli, 30, was found guilty of causing slight injuries and exceeding the limits of provocation during a marital row two summers ago.\nMr Portelli had flown into a rage after his wife had shared a photo showing the sea view and the lower part of her legs on Instagram in August 2017, the court heard.\nHe had sent her messages calling her a “whore” who lazed around, always taking the kids to the beach and then continued the row when he returned home that evening as the couple’s two young children lay asleep.\nAs the argument escalated, the man had allegedly ordered her out, grabbing her by the neck and dragging her along the corridor towards the main door of the apartment. The woman, fearing for her children, had put up a struggle and been hurt while being dragged against the door jamb.\nShe had finally manage to make it into her car and called her father-in-law, in the hope that he would talk sense into his son’s head.\nThe father-in-law defused the situation and the woman took the couple’s children to her parents, later filing a police report.\nWhen testifying, the woman claimed that her husband had threatened to kill her or jump from the Ta’ Cenc cliffs, taking the couple’s children with him.\nMr Portelli was accused of grievously injuring the alleged victim, threatening her, breaching the peace and committing a crime he was duty bound to prevent.\nBoth the woman and her alleged aggressor testified in the course of the proceedings.\nThe court, presided over by magistrate Joseph Mifsud, observed that a final decision had been delayed while attempts at the couple’s reconciliation were ongoing.\nHowever, when these attempts failed, the court had proceeded to judgment, starting off by warning against the harmful effects of social networks which, when misused, could lead to breakups and character assassination.\nAs for domestic violence, the court pointed out that this could never be justified, no matter what the circumstances and was to be handled as a public matter which gave rise to social problems and crimes.\nFocusing upon the case at hand, the victim had suffered a fractured leg and bruising above the hip according to medical testimony.\nHowever, in the light of all evidence put forward, the court pronounced itself “convinced” that the nature of the injury had been slight, explaining that classification of an injury was ultimately in the hands of the judge deciding upon the facts and was not “necessarily and exclusively” based on “medical opinion.”\nWhen all was weighed and assessed, the court concluded that the man was guilty of causing slight injuries and exceeding the limits of provocation, though not guilty of breaching the peace.\nHe was also acquitted of the charge of committing an offence which he was bound to prevent, as the Malta Armed Forces Act revealed no such obligation, the court said. \nIn the light of the family’s circumstances, the court added, it was recommendable for the accused to retain his job.\nThe court conditionally discharged Mr Portelli for 3 years, binding him under a €2000 personal guarantee for one year.", "comment_count": 0, "id": 2262}, {"keywords": "Government", "author": "Ivan Martin", "article_body": "The declaration of assets of the members of the Cabinet was published in Parliament on Wednesday.\nThe statements show most ministers having home loans, with Prime Minister Joseph Muscat himself having a loan of €120,000 for home works.\nDr Muscat said he had no investments in shares, bonds or other instruments but had €70,000 in bank deposits. His only income was his salary as Prime Minister.\nFinance Minister Edward Scicluna, appropriately, appears to be the most well off, with deposits of €710,000 according to the handwritten declaration. His income includes his ministerial salary of €62,979,  €4,607 from university work and €52,865 in pensions apart from some investments.  \nDeputy Prime Minister Chris Fearne, who is also Health Minister, has €109,000 in the bank, along with another £2,600. He also declared holding €279,000 in bonds and €70,200 in his wife’s bank account.\nTourism Minister Konrad Mizzi declared total deposits of €230,572 and a loan of €297,731. He declared 4000 shares in Malta International Airport and ownership of a house and garage in London.\nEconomy Minister Chris Cardona declared €135,000 in bank deposits and a €375,000 outstanding loan. Aside from his €62,500 ministerial salary, he also made €10,000 in rental income. He declared owning two properties, one in Birkirkara, and another in Madliena.\nEducation Minister Evarist Bartolo declared a modest €1,962 in his current account at HSBC, along with €22,372 in two separate savings accounts. Aside from his €62,597 ministerial emollition, Mr Bartolo also declared a €33,095 pension.\nEnergy Minister Joe Mizzi declared having just 1cent in his BOV current account. He also has €13,237 in savings. He has two outstanding loans for a total of €11,000.\nEquality Minister Helena Dalli declared some €38,000 across two current accounts, along with another €20,000 in savings. Aside from her ministerial salary she also declared being paid €3,293 by the University of Malta.\nIn an attached document to her declaration, Dr Dalli disclosed her holdings in five trading companies and another two non-trading companies.\n Home Affairs Minister Michael Farrugia declared €116,620 in savings, and €159 in his current account. He also has an outstanding loan for €36,698.\nJustice Minister Owen Bonnici holds no shares or bonds, and declared €8,420 in the bank.\nHe has two loans with BOV totalling €130,000.\nEnvironment Minister Jose Herrera’s declaration form was not filled in, and instead referred to an attached document. He declared holding a sixth of two properties, a house in St Paul’s Bay and another in Sliema. He also declared holding an apartment in Sliema and a garage, a garden in Mosta, an office in Valletta, and half of Gzira plot that is currently being developed.\nHe also declared having €277,000 in the bank, along with €5,000 cash in hand.\nForeign Affairs Minister Carmelo Abela declared holding some 19,000 in security holdings between him and his wife. His current account had some €7,000 and he has another €6,400 in savings.\nIn the section in which he was asked to disclose any other directorships, he wrote “xejn” [nothing].\nHe has €108,513 in outstanding loans.\nTransport Minister Ian Borg has €22,708 in the bank and owes €303,476. Aside from his matrimonial home in Rabat, he declared holding an apartment and an office in Dingli, another office in Rabat, and a piece of land which he acquired in 2015.\nGozo Minister Justyne Caruana has €118,288 in the bank, and owes €32,000.\nSocial Solidarity Minister Michael Falzon has no outstanding loans. He declared having three BOV savings accounts which hold €124,000, €127,880, and €7,233. He also has a fixed account containing €380,000.\nRead the declarations of all the ministers and parliamentary secretaries in the link below.", "comment_count": 79, "id": 2263}, {"keywords": "Drugs, Crime, Gozo", "author": "", "article_body": "Three men are being held in custody after the police found 80g of a substance believed to be cocaine, and 200g of suspected cannabis, which were ready to be trafficked.\nThe drugs, as well as a quantity of cash, were found in an apartment in Qbajjar where two of the men - both Serbians - reside.\nThe third man was Maltese.\nThe men were arrested on Tuesday evening and are being held in custody while investigations continue.", "comment_count": 0, "id": 2264}, {"keywords": "Traffic, Accident", "author": "", "article_body": "A 56-year-old cyclist was seriously injured when he was hit by a car in Sta Venera on Wednesday morning.\nThe police said the accident happened in Cannon Road, where the cyclist, from Iklin, was hit by a Kia Carens driven by a 47-year-old man from Paola.\n ", "comment_count": 0, "id": 2265}, {"keywords": "Construction, Properties", "author": "Vanessa Macdonald", "article_body": "Architects are happy to accept their responsibilities under the law as it stands, but they cannot be expected to monitor what contractors are doing on a 24/7 basis, the president of the Kamra tal-Periti Simone Vella Lenicker said.\n“As the law stands today, that is the role of the site manager: to make sure that the architect’s instructions are carried out on an hour-by-hour basis,” she explained to the Times of Malta.\n“The contractor is engaged by the developer, and it is up to the developer to look after his interests and find someone to monitor the site.”\nHundreds to attend meeting\nHundreds of architects and civil engineers have signed up to attend an  extraordinary general meeting being held on Friday by the Kamra tal-Periti, forcing them to move the venue to the Catholic Institute.\nThe EGM will be discussing various points, which were highlighted in the KTP’s press release earlier this week in the wake of proposed new regulations. However, the role of the site manager is clearly central to the objections.\n“A surgeon gets on with his job and does not check on the anaesthetists. They can rely on them to do their job because they can rely on the system.\nUnfortunately, when it comes to site managers, there is no system and they are not registered and do not need to be trained or qualified,” she explained.\nRELATED STORIESConstruction safety laws need right culture to work\nOne problem with the current system was that in the absence of a designated site manager, the developer took on the role.\n“How can we be sure that a developer knows what needs to be done? While there are some experienced ones, there are also ones that are developing their own block,” she fretted. \"You could go out and buy some machinery and become a 'developer'.\"\nThe KTP sent a review of the proposed legal notice to all its members, and will discuss its position on Friday.\n“Our plan of action will depend on the outcome of the EGM. All our options are open,” she stressed.", "comment_count": 50, "id": 2266}, {"keywords": "Crime", "author": "Edwina Brincat", "article_body": "A man, who allegedly headbutted his former partner during an argument over access rights to the couple’s child, was cleared after the victim and her sister chose not to testify against him.\nThe 34-year old Palestinian national, stood accused of assaulting and threatening the two women, as well as damaging his partner’s property during the violent episode which took place at her Zabbar home in October 2018.\nThe man was accused of grievously injuring his former partner who suffered facial injuries.\nProsecuting Inspector Oriana Spiteri had told the court how police had been alerted to the incident.\nA social worker, testifying about the circumstances leading up to the alleged violence, explained that the accused’s former partner had been assaulted by the man who had turned up at her home, demanding to see his son.\nIt had been late at night, shortly after the mother had returned from an outing with other family relatives.\nAfter being let into her home, the man had allegedly smashed a vase as an argument over money broke out between the two.\nThe argument had allegedly escalated to the point that the man had headbutted the woman and torn her clothes, the court was told, the scene apparently witnessed by two of the woman’s relatives who called an ambulance.\nOn her way to hospital, the victim had received a call from her alleged aggressor who, mistaking his partner’s sister for the woman herself, voiced threats against her and the child.\nSocial workers, called in to assess the case, expressed great concern on account of earlier violence allegedly inflicted upon both mother and child.\nOne of the doctors who attended to the woman after the violence later testified that she had suffered a fractured eye socket, confirmed by a CT scan.\nThe court, presided over by Magistrate Gabriella Vella, observed that the prosecution’s case rested solely upon the testimony of parties who had not been directly involved in the incident.\nThe two witnesses directly involved in the alleged violence, namely the accused’s former partner and her sister, had chosen not to testify when summoned to do so in court last October.\nMario Mifsud and Marita Pace Dimech were defence lawyers. ", "comment_count": 0, "id": 2267}, {"keywords": "Msida, Police, Unusual", "author": "", "article_body": "Police responding to reports that a hand grenade was lying in the common area of a block of flats in Msida could breathe a sigh of relief on Wednesday afternoon after discovering that the suspected explosive was just a toy. \nOfficers were called to Valley Road late in the morning after receiving a report that a hand grenade had been spotted at the entrance of a block of apartments there. \nThey were joined by members of the army's Explosives Ordnance Disposal unit, who approached the suspicious device with caution. \nPeople in the area were evacuated.\nA short while later, the operation was called off when the bomb disposal experts confirmed that they were dealing with a realistic-looking fake. \nVideo - Matthew Mirabelli.\n ", "comment_count": 1, "id": 2268}, {"keywords": "Construction, Environment, Properties", "author": "Sarah Carabott", "article_body": "The Office of the Ombudsman is calling for a one-stop-shop that would look into building complaints and halt development when neighbours notice worrying wall cracks.\nIts proposal comes after all demolition and excavation work in Malta was halted when the wall of an apartment in Ħamrun collapsed, the second such incident in a week and the third in two months.\nThe Environment and Planning Commissioner within the Ombudsman’s Office has published (see pdf link below) a series of suggestions to be included in amended regulations aimed at preventing damage to third party property.\nDraft legislation was published by the government on Monday, suggesting, among others, that architects would have to report on the measures being taken to protect neighbouring buildings from demolition and excavation works. RELATED STORIESWatch: Builders should not put costs ahead of safety – lecturer\nThe Commissioner said he hoped his recommendations would be taken on board by the government and discussed by stakeholders to help them improve performance.\nOne of his main concerns was that people were wasting too much time looking into which government entity would be able to handle their complaint - a delay which could lead to serious consequences in urgent cases.\nIf someone complained about workers who did not have the right protective gear while working on the façade of an old government property, for example, currently five enforcement officers - from the Planning Authority, Building Regulation Office, Occupational Health and Safety Authority, Superintendence of Cultural Heritage and Lands Authority - would be sent on site.\nIf there were just one allocated to the complaint, then the other four could see to other complaints and each enforcement officer could also investigate complaints in the vicinity, he pointed out.\nApart from passing on complaints to enforcement officers, the one-stop shop would also keep all entities informed of developments and maintain a digital archive of related documents, which would be available to all the stakeholders involved.\nIt would also receive commencement notices for all projects, collect fines and serve as a central hub where government entities would be able to resolve differences.\nOTHER RECOMMENDATIONS\n• The Commission also suggested that apart from the building commencement notice, there should also be a pre-building commencement notice that included the contractor’s signature giving the go-ahead for demolition and excavation. This would ensure that the one-stop-shop was aware of any delay between demolition and building.\n• In cases where excavation works were already underway, the area touching the division wall should be strengthened and reinforced with a cement-filled wall or other structure, as ordered by the architect, before the continuation of any works.\n• Apart from physically being on site prior to taking important decisions, the architect and site manager should, within 12 hours, submit any decisions taken to the one-stop-shop in writing, together with proof that the information had also been passed to the contractor.\n• While the title of the draft regulations referred to damage to third party property, this should also incorporate danger to the public, as well as damage to public streets and spaces.\n• As soon as neighbours notice cracks that were not the mere hairline kind, a detailed architect’s report should be sent to the project’s architect, the site manager and the one-stop-shop, which should halt the development until the director informed stakeholders how to proceed.", "comment_count": 5, "id": 2269}, {"keywords": "Court, Justice, Police", "author": "Edwina Brincat", "article_body": "A woman, who allegedly attacked a policewoman on duty at Bank of Valletta’s San Ġwann branch in May, was granted bail after protesting her innocence upon her arraignment on Wednesday.\nElizabeth Muscat, a 38-year-old cleaner, was escorted to court under arrest, pleading not guilty to threatening and violently assaulting the female officer who happened to be on watch at the branch on May 23.\nPolice investigations into the incident at the bank, in Naxxar Road, including analysis of CCTV footage, had led to the suspect’s arrest and arraignment.\nOn Wednesday, the woman pleaded not guilty to slightly injuring the policewoman, causing her to fear violence, refusing to obey legitimate orders, spitting in public, exceeding the limits of provocation and breaching the peace.\nThe accused was further charged with being a relapser and with committing the offences while under a three-year Probation Order handed down in 2017.\nDefence lawyer Michael Sciriha told the court, presided over by magistrate Rachel Montebello, that the woman had been “provoked”.\nAfter hearing submissions by both parties, the Court upheld a request for bail against a personal guarantee of €5,000.\nInspector Joseph Xerri prosecuted.", "comment_count": 0, "id": 2270}, {"keywords": "Migration, European Union", "author": "", "article_body": "The Refugee Commissioner received 2,131 applications for international protection in 2018, 15.9 per cent more than in 2017.\nThe National Statistics Office said 16 boat landings were recorded in Malta with 1,445 persons being brought to Maltese shores. The majority, 80.1 per cent, were African, the rest Asian.\nDuring the year under review, 79 third-country nationals were resettled to another country – a decrease of 54.3 per cent over 2017. Another 22 benefitted from assisted voluntary return programmes.\nConsidering applications per million population, Malta ranked third among EU  countries, after Cyprus and Greece. The majority of applications, 60.2 per cent, were lodged by Africans.\nConsidering individual countries with regards to the total applications for asylum, the largest proportion of applicants were Syrian (22.8%). Another 15 per cent and 14.5 per cent were Somali and Libyans, respectively.\nA total of 1,500 applications were processed in 2018 with 43.1 per cent being granted a positive decision at first instance. The remaining applications were rejected.\nMore than half of the applicants who were granted a form of protection status were Africans and 37.8 per cent were Asian. \nAn increase of 30.5 per cent was registered in the resident population of open centres and other institutional households when compared to the preceding year. The majority of this population was in Ħal Far (71.9%). The largest share of residents were males (77%) while 13.8 per cent and 13 per cent were Sudanese and Somali, respectively.\n ", "comment_count": 0, "id": 2271}, {"keywords": "Rabat, Politics, Construction, Environment", "author": "Ivan Camilleri", "article_body": "Planning Minister Ian Borg and his wife will have to re-think their plans to turn agricultural land adjacent to their house into a swimming pool.A court of appeal ruled on Wednesday that the minister’s proposed development is not permitted and that the issue of a development permit by the Planning Authority must be reconsidered by an Appeals tribunal with a different composition. \nIn its decision, which came following a challenge by Dingli resident Noel Ciantar, the court revoked the decision taken by the Environment and Planning Tribunal last April, which had confirmed, with some tweaks, an earlier permit granted to the Minister by the PA.\nThe court accepted Mr Ciantar’s objection that the PA had used a policy not applicable to the rural area where Minister Borg had built his controversial home in order to issue a second permit to turn ODZ land into a swimming pool and recreational area.\nIn its decision, the Court of Appeal said that the Tribunal could not apply the policy they did (Rural Policy and Design Guidance) to issue the permit to the Minister and this was not applicable to the area where the Minster lives.\nThe court added that, instead, the policy which the PA ought to have considered in the context of the Minster’s application was another one, North West Local Plan 3 and 4, which makes it amply clear that developments such as the one applied for by the Minister – a swimming pool in a rural settlement - was not permitted.\nMinister Borg is keen to build a swimming pool on ODZ land next to his house in Rabat. Photo: Chris Sant Fournier\nThe court sentence nullified the decision of the Tribunal.Dr Borg however claimed otherwise, writing on Facebook that his lawyers believed that the original permit “remained valid”.\nHow the plans developed over the years\nDr Borg’s development in a sensitive rural area in the hamlet of Santa Katerina, limits of Rabat, has been in the news from its inception.In 2014, soon after gaining his seat in Parliament, Dr Borg was given a PA permit to turn a dilapidated ODZ dwelling into a 400-metre matrimonial residence.\nFollowing an investigation by the Ombudsman and the Commission Against Corruption, the Ombudsman had recommended a review of the permit, describing the PA’s green light as “a grave error” and saying the permit should not have been issued. At the same time, no proof of corruption was found.\nDespite the recommendation, Dr Borg still continued with his development after the Prime Minister, at the time responsible for the Planning Authority, ignored the recommendation.\nIn the latest development, Dr Borg was given a permit, through a fresh application, to transform an agricultural field he had acquired together with the dilapidated house into an outside dining area and a swimming pool as an extension to his residence, substantially increasing the property’s value.\nThat permit was based on a policy allowing such extensions to dwellings which were already built in rural areas. However the Court has now decided that this was not the policy to be used.\nThe field, which has idyllic, unobstructed views of the valley, was acquired by Dr Borg from a farmer for just €12,000.", "comment_count": 120, "id": 2272}, {"keywords": "Politics, Employment", "author": "Denise Grech ", "article_body": "Employers looking to employ foreigners, including third-country nationals, could soon upload documents online instead of queuing in front of Identity Malta offices ifor hours, Parliamentary Secretary Julia Farrugia Portelli said.\nSpeaking during the presentation of a report on simplification measures, Ms Farrugia Portelli said a pilot project would allow employers to apply for permits and submit documents of their prospective employees online.\nCurrently, employers arrive at Identity Malta with a pile of applications, with some having to queue for hours to be able to apply, she said. \nThe pilot project would focus on two particular industries and authorities were hoping it would be implemented by the end of the year, Ms Farrugia Portelli said.\nIdentity Malta also recently extended its opening hours and removed capping on the tickets given to those waiting in the long queues, she said. \nSpeaking at the launch of the report in Castille, Principal Permanent Secretary Mario Cutajar said the authorities would also be looking into including artificial intelligence into the public sector. \n\nAI could help service-users not only by responding to people's needs, but could help them decide on the next steps, Mr Cutajar added. \nGoing to the public sector would no longer be a burden and accessing services would no longer be difficult or complicated, he said. \nHe also added that a report on budgetary implementations would be issued in the coming months.\n\"We want to be clear about what we have accomplished, where we have not accomplished it and why it’s not been accomplished,\" he said.\nOver 75 per cent of proposals were implemented in 2018, Mr Cutajar said. \nAmong the measures implemented, there are now three one-stop-shops covering family services, taxpayer services and the education sector. \nOver 70 services can now be accessed through mobile application Maltapps, Mr Cutajar added. ", "comment_count": 0, "id": 2273}, {"keywords": "Agriculture, Weather", "author": "Ivan Martin", "article_body": "More than €3 million of national funds have been allocated to help cover the cost of damage caused to farms in a freak storm back in February.\nAgriculture Parliamentary Secretary Clint Camilleri on Wednesday announced the compensation scheme at the Agriculture and Rural Payments Agency in Ta' Qali.\nBack in February winds of up to 133km/h hit the island, causing widespread damage.\nFollowing the wild weather, the government had announced that it would be applying for special EU assistance to help cover some of the damage costs.\nHowever, it subsequently became clear that Malta had not suffered the necessary €60 million worth of damage to be eligible for the EU assistance.\nRELATED STORIESDestruction across Malta as gale-force winds batter islands€25m in storm damage not enough to qualify for EU funding\nMr Camilleri said the government had undertaken a sample of 250 farms across the island, to develop an estimate of the damage costs for farmers.\nThe Finance Ministry had then allocated €3.5 million, based on the estimate calculations.\nThe financial assistance will cover up for 45 per cent of the cost of damage to rubble walls, stone storerooms, tunnels, water reservoirs, and general damage to farms.\nRELATED STORIES‘Farmers have never seen so much damage’\nThe damage costs would have to be certified by a warranted architect and the fund would help cover the architect’s fees as well.\nFebruary's storm ripped through Malta. Video: Sarah Carabott\nTo apply one would have to produce a bill of quantities drawn up by an architect, attached to other necessary documentation.\nThe fund is only open for farmers and small businesses involved in agricultural production who are in the Directorate of Agriculture’s Registry of Farmers.\nApplications would be accepted until the end of September to allow farmers enough time to get their affairs in order.\nMeanwhile, a similar initiative to cover the costs of damage suffered by fishermen will be launched in the coming weeks.\nMr Camilleri said that an exercise had found that the extent of the damaged suffered in this sector was significantly lower than for farmers.", "comment_count": 3, "id": 2274}, {"keywords": "Justice, Panama Papers", "author": "", "article_body": "Judge Antonio Mizzi has been appointed Commissioner of Laws, with the appointment backdated to June 1.\nThe one-year appointment can be renewed.\nThe Commissioner is responsible to ensure that laws do not conflict when it comes to human rights, among other things.\n[twitter id=\"script>\" link=\"\n\n\"][/twitter]\nJudge Mizzi served as magistrate in the Maltese courts between 1987 and 2013, when he was promoted to judge, a position he held until his retirement in 2018.\nOne of his last hearings was on the Panama Papers, which he had adjourned to a date after his retirement. The case had propelled him into the limelight after former Opposition leader Simon Busuttil objected to the fact that the case was being heard by a judge who is married to a Labour MEP.\nAs Commissioner of Laws, Judge Mizzi takes over from Franco Debono, who had publicly stated that he did not wish to have his contract renewed. ", "comment_count": 14, "id": 2275}, {"keywords": "Travel, Transport, Disaster, Food and drink", "author": "Sarah Carabott", "article_body": "A former ŻfinMalta dancer left the island to cycle across 25 countries, planning to offer therapy for trauma but he soon realised he himself was receiving a different kind of healing.\nGabin Corredor, 28, who lives in Malta and France, thought he would be offering performances and workshops to victims of natural disasters, long-term hospitalisation, abuse and addiction.\n“I left because I wanted to share and give something but soon realised I was learning from others more than I was giving them,” Mr Corredor told Times of Malta following his 26,000-kilometre-long trip that lasted a whole year.\nSometimes, all it took was a smile, hello or just a nod to forge a relationship.\n“When I arrived in a village situated at an altitude of 4,000 metres in Tajikistan, I realised that people there were surviving on what we Europeans consider to be the bare necessitates,” he said.\n“Dancing didn’t really have a place there and we couldn’t even share a word because of the language barrier.\nGabin Corredor with Syrian refugees in Istanbul.\nTrip lasted a whole year\n“So, instead, we shared a piece of bread, a cup of tea and a smile. That was enough – sometimes we need to get rid of the frills and just go back to our roots – of a human relationship.”\nMr Corredor cycled from France to Turkey and Kazakhstan, then flew to Hanoi and cycled to Bangkok. He flew to Ushuaia, in Argentina, cycled to Chile, back to Buenos Aires and up to Rio de Janeiro in Brazil before heading back to France through Portugal and Spain.\nApart from living on €5 or less a day and carrying all his cooking, sleeping and dancing equipment on his bicycle, the trip was so emotionally daunting he nearly gave up three times.\nThe first time was while crossing a desert in Turkey.\n“It was tough. I had to deprive myself and ration water. All I had was my bike and six bags. I had left a comfortable job, a partner and my family behind and loneliness is hard to handle,” he said.\nIt took him two months to realise that, although he did not belong to the communities he was coming across, he was never alone. There were always people around me, he noted, adding that, in Europe people took everything for granted.\n“We have a lot of commodities and often forget that it is just a matter of luck. We always want different things and chase different dreams but deep down we are all the same,” he said.\n“All of us just want to be happy and I feel like we are losing the simple things that make us feel good and alive in Europe.”\nThe young man pedalled for some eight hours a day to fulfil his project, which he completed also thanks to crowdfunding.\nTaking refuge from the weather elements in South America.\nOne of the best parts of the Frenchman’s trip was sharing his dancing passion with Syrian refugee children in Turkey.\nGabin Corredor. Photo: Chris Sant Fournier\nWhile the parents gathered at ad hoc centres to share handy skills such as sewing, he entertained the young ones with dance workshops.\nHe recounts another anecdote at an Iranian supermarket. The owner, who lives and works at the place, offered him a place and a warm ‘shower’ for the night.\n“Two hours after meeting the man, I was sleeping cosy with a roof over my head. Without people the trip would have been useless.\n“It was all about the people and the sharing of such experiences,” Mr Corredor said.", "comment_count": 1, "id": 2276}, {"keywords": "Transport, Roads", "author": "", "article_body": "Commuters can now access the new southbound lanes of the Msida Valley Road Bridge that is being rebuilt with a wider deck and new lanes off Regional Road. The project is scheduled to be completed by October.\nWhen the second half of the structure is built, this bridge will be the widest one in Malta, extending to 23.5 metres.\nIn the coming weeks, Infrastructure Malta will shift the two northbound lanes to the new bridge as well, so that it can rebuild the rest of the old structure and integrate it in the new design of Regional Road.\nThe €7 million project includes the reconstruction and widening of part of this road from four to six lanes, three in each direction, from the Tal-Qroqq Tunnels in Msida towards Santa Venera.\nThis stretch of road links with other arterial roads through slip roads and other junctions.\nBuilt in the 1970s, the road bridge is now being rebuilt to optimise the road’s alignment and super-elevation for increased safety, according to TM.\nEarlier in the year, the agency constructed and opened the first stretches of two additional Regional Road lanes.\nIt also built the foundations and abutments of the new bridge and demolished part of the existing one.\nThe new bridge deck that has just been opened is supported on six 20-metre pre-stressed concrete beams weighing 24 tonnes each.\nRELATED STORIESWatch: Regional Road sliproads, Valley Road bridge to be widened in €7 million project\nIn the northbound carriageway, from the Santa Venera tunnels towards Msida, one of the additional lanes will provide safer access from the slip roads connecting Msida Valley Road, Old Railway Track, in Birkirkara and Kappillan Mifsud Road, in Santa Venera to Regional Road.\nFurther north, part of this new lane has already been constructed and opened to road users, reducing travel times when exiting Regional Road through the slip road in the direction of the Birkirkara Bypass (Dun Karm Psaila Road), the University of Malta and Mater Dei Hospital.\n ", "comment_count": 20, "id": 2277}, {"keywords": "Construction, Court, St Julian’s", "author": "Sarah Carabott, Edwina Brincat", "article_body": "Updated at 8.34pm with PN reaction\nThe controversial db Group City Centre project in Pembroke has been brought to a halt by a court decision which found that one of the Planning Authority's board members had a conflict of interest in the project. \nThe “huge” court decision was handed down following an appeal on behalf of three local councils, various NGOs and residents by lawyer Claire Bonello.\nMr Justice Mark Chetcuti ruled that the Environment and Planning Review Tribunal decision in February of this year granting the go-ahead for the project should be revoked and said the Planning Authority’s September approval of the project was “deemed null and without effect”.\nThe €300 million project, which includes a 37-storey tower and 17-storey hotel, was approved by the Planning Authority in September, despite an unprecedented 4,500 objections from the public, local councils and NGOs.\nRELATED STORIESPA board member flown in for vote by private jet\nThe 38-storey tower and 17-storey hotel project had been approved by 10 votes to 4.\nOne of those 10 votes in favour was by Matthew Pace, a board member and entrepreneur who The Shift News had later revealed was involved with a branch of one of the real estate agencies seeking investors and buyers for the project.\nMr Pace is a franchise owner of Remax Alliance Swieqi, which shared a database and website with Remax Malta.\nThe court's reasoning\nThe court observed that the City Centre project was being advertised long before the Planning Board had voted on it, and that any property agent who clinched a deal would receive a commission even if they had not been directly involved in its advertising.\nMr Pace was therefore in a position to receive a commission through his estate agency for a project which had not yet been approved and which he had a say in approving, through his his vote as a member of the Planning Board.\nThis meant that he had “a clear and direct interest” in the vote which he was duty-bound to declare from the start, the Court said, since there was a potential financial benefit in his regard, “no matter how small that benefit could be.”\nMr Pace ought to have abstained from the sitting on the Board when the decision on the project was to be taken, the court said.\nThe Planning Tribunal’s assurances of transparency could not be limited to being “on paper”, the court said, saying that Mr Pace in this case was “objectively biased.”\n‘Surprised’ at tribunal\nThe court expressed “surprise” at the way in which the Planning Tribunal – which had dismissed conflict of interest claims – had handed the matter.\nThis was “an enormous project” with massive financial repercussions, it noted. Such projects could not be tainted by “any shadow of doubt”, the court said.\nIt was irrelevant that the project would still have been approved with or without Mr Pace’s vote, the Court said.\n'Back to the drawing board'\nLawyer Claire Bonello, who filed the appeal on behalf of objectors, said that the court decision would force developers back to the drawing board.\nResidents had finally been “vindicated” for not giving up, Dr Bonello told Times of Malta.\n\nResidents had joined forces with NGOs and local councils of Swieqi, Pembroke and St Julian’s that had different leaderships and crowfunded to raise money needed to lodge appeals. \nThis was not a political matter, she added.\nA spokesman for db Group declined to comment, saying the company had nothing to say at this early stage. \nThere was no sign of any workers at the St George's Bay location when Times of Malta visited the project site on Wednesday morning, shortly after the court decision. \n All quiet at the St George's Bay site. Photo: Chris Sant Fournier\nRELATED STORIESPA approves 38-storey db Group tower by 10 votes to fourPembroke db Group project works halted until appeal is decided\nDr Bonello said residents had found a “measure of justice”, despite so many setbacks and hailed the \"vital\" judgment.\nShe hoped that it encouraged other residents and objectors not to give up.\n'Highly satisfying', says Pembroke mayor\nPembroke mayor Dean Hili said the decision proved that objectors' complaints were not at all subjective, \"as some had claimed\". \n\"We were objecting to planning and conflict of interest issues, and the judgement recognised this,\" he said.\n\"This is of course highly satisfying, especially at a time when many are discussing the rule of law,\" he said.\nMr Hili added that he still needed to read through the court sentence in detail to understand the motivations behind the judgement.\n\nWork on the massive project had started in 2018, only to be halted a few months later after opponents filed an appeal. \nIn February, the planning appeals tribunal ruled that the project could go ahead pending an assurance from Transport Malta that the existing road network could handle the additional traffic it would cause. \nThat tribunal had dismissed conflict of interest accusations presented by objectors, who had said that Mr Pace and another board member, Labour MP Clayton Bartolo, should both have recused themselves from the vote. \nUndeterred, objectors had referred the matter to judicial review. \nProtesters marching against the project last year. Photo: Mark Zammit Cordina\nThe NGOs, councils and residents who instituted the case welcomed the outcome.\n\"This has been a long case, from the first core group meetings with concerned residents, to the public meeting to discuss the way forward with the wider community, to the Planning Board meeting which had to change venue due to the unprecedented interest, and then on to the Environmental and Planning Review Tribunal, where we appealed the Planning Board's decision, and then to the Court of Appeal,\" a statement issued through Moviment Graffitti said. \n\"These challenges were met thanks to the tremendous support shown by people from all over the islands who responded to our call for crowd funding. Without each and every one of their donations, their support, this would not have been possible. This victory is theirs as much as anyone's.\" \nPN - PA needs to explain\nThe Nationalist Party said the court's decision brought sharp focus on the way the Planning Authority operated, with the government's blessing.\nIt observed that while the court had found a board member appointed by the government to have had a conflict of interest, it was worth recalling that the PA had on the day of the vote on this project spent some €8,500 to fly in another board member on a private jet so that she could vote.\nThe government had introduced an attitude that anything goes, and an independent investigation was needed into the way the authority operated and how it spent its money.", "comment_count": 0, "id": 2278}, {"keywords": "Religion", "author": "Ivan Martin", "article_body": "All too often, the Church reacted to claims of sex abuse involving the clergy by clamming up, Archbishop Charles Scicluna said on Tuesday.  \nAddressing a conference for heads of media of Churches in Europe, Mgr Scicluna reflected on a meeting of the presidents of episcopal conferences and supreme moderators of the main religious institutes last February.\nFollowing the meeting, Pope Francis disseminated an Apostolic Letter, Vos estis lux mundi, laying down measures that should be adopted to prevent and fight sexual abuse against minors and vulnerable people or abuse carried out with violence, threat or abuse of authority.\nIt allows all dioceses one year to establish stable and publicly accessible systems to report cases of sexual abuse and their cover up.\nAll clerics and religious people have to report any abuse they are aware of, to competent ecclesiastical authorities. The cases need to be promptly verified and handled in accordance with Canon Law.\nFar too often, Mgr Scicluna said, the Church reacted to allegations of sexual abuse by becoming defensive. \nInstead, what was needed was a climate of collaboration. \nAnyone who was after the truth was an ally\nWhile certain parts of the media may have an agenda – and even these should be engaged with – others were simply after the truth.\nAnyone who was after the truth, he said, was an ally, as the truth would set one free.  \nHe understood that in such instances the temptation was to view inquisitive media as the enemy, however, this was not the case he said. \nMgr Scicluna told the heads of Church communications offices gathered at the Curia in Floriana that the experience of meeting victims of sexual abuse was never pleasant, however, it was important to do so – to be a compassionate understanding voice. \nPope Francis, the Archbishop said yesterday, had already urged members of the clergy to move away from silence and towards “sincere confrontation”. \nMgr Scicluna also spoke of the need for “absolute respect” for victims. \n“Our attitudes towards these people who have suffered and feel pain must be one of total respect,” he said.", "comment_count": 10, "id": 2279}, {"keywords": "Media", "author": "", "article_body": "Times of Malta leads with a protest organised by Moviment Graffitti on Tuesday in the wake of three building collapses in two months because of excavation works on adjoining sites. In another story, it says Nationalist MPs faced leader Adrian Delia in the evening, a day after a chaotic executive committee meeting which saw the party’s media head resign.\nThe Malta Independent also leads with the protest and the PN’s marathon meeting.\nIn-Nazzjon quotes the Malta Hotels and Restaurants Association saying that Malta was becoming a construction site experience for tourists.\nL-Orizzont says 464 local councillors have taken their oath of office.", "comment_count": 0, "id": 2280}, {"keywords": "Politics, PN", "author": "", "article_body": "Outgoing PN media chief Pierre Portelli and party MP Karol Aquilina traded accusations and insults on Tuesday, as internal party divisions came out into the open.\nMr Portelli drew first blood saying Dr Aquilina had appeared in court alongside blogger Manuel Delia, who Mr Portelli said was out to harm the party.\nDr Aquilina retorted by saying Mr Portelli was close friends with 17 Black owner Yorgen Fenech.\n\nThat prompted Facebook fury from Mr Portelli, who said that claim was \"fabricated\" and accused Dr Aquilina of having brought financial ruin on the PN when, as president of its administrative council, he accepted money from various developers.\nDr Aquilina speaks to the press late on Tuesday evening.\nSpeaking on Tuesday night, Dr Aquilina noted that Mr Portelli had not denied being a personal friend of Mr Fenech. \nDr Aquilina was speaking late in the evening, following a long parliamentary group meeting which party leader Adrian Delia described as \"positive\". Another MP who asked to remain unnamed, however, claimed that \"at least 10\" MPs had called for Dr Delia to step down as party leader. \nMr Portelli quit the PN's media arm under a cloud late on Monday night, making public a resignation letter in which he accused unnamed MPs of being complicit in \"criminal activity\" in an attempt to shove party leader Adrian Delia aside. \nHe later told Times of Malta that now that he had resigned, MPs who were staunchly opposed to Dr Delia's leadership had no excuses to mask their failings. \nEarlier in the day, Mr Delia had written of Mr Portell that it was the second time he was abandoning the Nationalist Party.\n“When John Dalli was leading his sapping campaign from Super One, Pierre Portelli was already abandoning his post at the PN for the first time,” Mr Delia charged.\nHe noted that while Mr Portelli was posting \"snide\" comments about Dr Aquilina and himself appearing in court, the PN's now-former media chief had not even shown up in court to testify in that case, claiming that he was \"not notified\". \nDr Aquilina’s accusation about Mr Portelli and Mr Fenech being close friends comes just two weeks after former PN candidate David Thake alleged that Mr Fenech had offered the Nationalist Party €50,000 if David Casa was not reelected as MEP.", "comment_count": 25, "id": 2281}, {"keywords": "Animal welfare, Properties", "author": "Claudia Calleja", "article_body": "Malta’s only horse rescue NGO may no longer be in a position to take in horses as the landlord of the stables they rent is upping the monthly fee.\nRMJ’s Horse Rescue, a registered voluntary organisation, has been paying €2,200 a month in rent to a farmer for the use of the Salini stables, where they currently keep about 30 horses.\nA rescued horse at the Salini stables.\nThe stables are located on government-owned land registered as a chicken farm, NGO president Corinne Farrugia said when contacted. She said the farmer now wanted to increase the rent by a further €700.\n\nIn a message posted on Facebook, the NGO wrote: “We were already struggling with field bills and we simply cannot afford paying more rent. We now have the daunting task of trying to sort out a place for our horses until the end of the rent term, assuming we are not forced to leave before.”\nWhen contacted, the farmer declined to comment.\nThe NGO is calling for a solution that would solve the problem in the long term.\n“Donations always help. But we’re looking for a long-term solution, a place where we can keep these horses,” she said.\nMs Farrugia elaborated that, apart from the rent, the NGO has to foot the bill for animal feed, vet bills as well as the cost of overseas homing.\nThe majority of the horses they rescue, she said, are retired racing horses. Each year, racing enthusiasts import between 200 and 300 horses from abroad. \nWe simply cannot afford paying more rent\nThese are often horses that approached the end of their racing career overseas so, when they arrive in Malta, they do not have many years left on the track.\nWhen the horses slow down, or get injured, the owners call the NGO and give them ‘a deadline’ – usually when the new horse arrives. \n“When I get a phone call to rescue a horse I know that, if I say ‘no’, it will be sent for slaughter,” Ms Farrugia said.\nThe NGO takes in the horses and keeps them at the Salini stable from where they try to find them a home – in Malta or by sending them abroad. The horses at the stables are also made available to other NGOs for therapeutic services, she said.", "comment_count": 13, "id": 2282}, {"keywords": "Adrian Delia, PN, Politics", "author": "Denise Grech", "article_body": "A long meeting of the PN parliamentary group was described as 'very good and constructive' by party leader Adrian Delia early on Wednesday.\n\"I think we have laid the foundations for the Nationalist Party to rebuild and move forward, including the radical change that needs to be done,\" Dr Delia said. \nHe confirmed that during the meeting he presented proposals on the future of the party. It was agreed that the parliamentary group would be meeting every two weeks or sooner to discuss the proposals further. The reforms, he said, involved the set-up of the party and the way it presented itself to the electorate.\nI have one parliamentary group. Anyone who speaks against any of its MPs would be speaking against me and the party- Delia\n\"I have one parliamentary group. Anyone who speaks against any of its MPs would be speaking against me and the party,\" Dr Delia said to applause from a small crowd.\nDr Delia said he was not asked to resign during the meeting.\nBut Dr Delia's comment was contradicted by an MP, who contacted Times of Malta to say some MPs - about 10 - did actually challenge Dr Delia, asking for a vote of confidence in the general council. Dr Delia refused.\nEither of the claims could not be immediately confirmed.\nSee video below.\n\nThe meeting started at 7pm on Tuesday and ended at 12.30am on Wednesday. A small crowd applauded as Dr Delia emerged from party headquarters.\nPrior to the meeting, Dr Delia told reporters that he would not resign, nor demand anybody's resignation.\nHe was questioned as he entered party headquarters amid reports that many of his own MPs are demanding that he should go.\nDr Delia on Monday told a stormy meeting of the PN Executive Committee that he would be presenting a plan for the way forward for the party, with him at the helm.\nFollowing angry exchanges at that meeting, Pierre Portelli, Dr Delia's closest collaborator, resigned from his post as head of the PN's media arm.\nDr Delia did not wish to comment on Mr Portelli's resignation as he went in for the meeting of the parliamentary group, saying he may comment after addressing the MPs. Among other things, Mr Portelli in his resignation later said that some MPs \"went as far as sustaining and aiding criminal activity by third party simply to get you out of the way.\"\n\nA crowd of some 100 people awaited Dr Delia's arrival. They cheered when Dr Delia arrived and also applauded MPs Carm Mifsud Bonnici, Mario Galea and Kristy Debono.\nMany had expected a bigger crowd, with posts making the rounds on Facebook on Tuesday afternoon calling on supporters to have a show of force and to show \"these rebels that we have had enough\".\nMembers of the crowd were heard jeering Chris Said, a former leadership contender, apparently after remarks were exchanged. There was silence as other MPs came in.", "comment_count": 58, "id": 2283}, {"keywords": "Fire, Accident", "author": "", "article_body": "One person was injured in a gas explosion in Victor Denaro Street, Msida, on Tuesday evening.\nThe blast was heard over a wide area shortly after 9pm. \nIt is believed to have been caused by leakage from a gas cooker.\nFire-fighters of the Civil Protection Department were on site with an ambulance crew.\nNo further details were immediately available.", "comment_count": 1, "id": 2284}, {"keywords": "Construction", "author": "Claudia Calleja ", "article_body": "Cracking tiles, displacement of stones, the appearance of fissures in walls and water seepage could all be signs that your home is being damaged by neighbouring construction works.\nThe three recent construction-related incidents, which resulted in the collapse of a wall and two buildings adjacent to building sites, raised concerns among the public with people asking: when should they get worried?\nAccording to the Chamber of Architects and Civil Engineers, people should be concerned when they notice damage occurring to their property or when they feel “uncomfortable with the level of vibration inside their property”.\n“They should look out for opening of cracks, displacement of stones, cracking of tiles, ingress of water,” said the chamber.\n“People who are concerned for their safety should immediately engage a perit [architect or civil engineer] to inspect their property.\n“They may also request their perit to review the works’ method statement submitted at the Building Regulations Office by the developer or his site manager to ensure that it has indeed been submitted, and that it is being complied with.”\nRELATED STORIES'They told us it was safe''Err, where's my garden wall?' - Kristina Chetcuti\nThe chamber reminded the public that they have a right to be presented with the conditions report describing the condition of their property, eight weeks before the start of works.\nThey also have the right to review the method statement describing the works and to contest the contents should they disagree with them.\n“They have the right to engage professional advice, including periti and lawyers, to safeguard their interests at all times. They have the right to report non-compliance with any of the regulations, including those related to health and safety, noise, operating hours, dust generation, and site and street cleanliness. They have the right to expect all relevant authorities to enforce the regulations,” the chamber said.", "comment_count": 16, "id": 2285}, {"keywords": "Parliament, Pensions, Civil society", "author": "", "article_body": "Reforms to the pensions law will allow civil servants to continue to work after the age of 61 without suffering any reduction to the gratuity paid out upon their retirement.\nThe reforms, moved by Social Solidarity Minister Michael Falzon, will furthermore allow the Principal Permanent Secretary to permit civil servants to continue to work after age sixty-five.\nThe bill will also add the post of Principal Permanent Secretary to the list of civil service offices whose pension is retained even if the office-holder returns to a lower grade.\nThe measure will not impact current Principal Permanent Secretary Mario Cutajar, as this provision already applies to him as Cabinet Secretary.\nDuring Tuesday’s debate in parliament, Opposition MP Claudio Grech called upon the government to examine how a sustainable pensions system could be built for coming generations. Older persons were living longer while facing more severe health conditions, putting a further strain on their ability to make ends meet.\nOld age should not be seen as the last phase of life, but as the best phase of life, Mr Grech added, saying that this was the period when the elderly could enjoy the fruits of their social contribution. However, difficult situations were being created for elderly people in an economy which was built upon restrained consumption.\nResponding to Mr Grech and to others, Home Affairs Minister Michael Farrugia expressed his surprise at Opposition MPs who seemed “cut off from reality.” The poverty rate was a third of what it was in 2013, he said, but the government was still not happy and would continue to ensure that this rate continued to dwindle.\nAlthough the national insurance rate and the pensionable age had both been raised during Nationalist administrations, pensions had not increased at all, a trend which had been reversed by the Labour government. The government had also ensured that pensioners who earned less than €13,000 a year from pensions were not taxed on this income, and launched schemes to ensure that pensioners were incentivized to work beyond pensionable age.\nDr Farrugia said that it was important to recognise that the situation of those reaching retirement age could and would be improved. It had been possible to make positive changes over the past six years due to the sound economic footing which Labour had created for the country.\nOpposition MP Godfrey Farrugia said that present efforts to reform pensions needed to move at a quicker pace. He called upon the government to make room in Budget 2020 for pensions, in the same way that it found money for other things. The Government should launch an educational campaign to help those approaching pensionable age to cope with financial commitments and loans.\nA category of pensioners, who were mainly women, had not amassed enough social security contributions to receive a decent pension. The government had a duty to look after these persons, Dr Farrugia insisted, and they should also be given what they deserved in the upcoming Budget.\nRecently co-opted Opposition MP Kevin Cutajar expressed the Opposition’s approval of the amendments, which would “remedy an injustice.” However, he stated that one could not but worry about pensions in the present day.\nReferring in particular to disability pensions, he asked MPs whether the €400 or so given to some of those who suffered from disabilities was adequate. Government efforts to increase the employment opportunities offered to the disabled were laudable, but there was a category of disabled persons who would never be able to reach the economic performance necessary to ensure a comfortable life for themselves. As a result, it was necessary to ensure that these persons were given the opportunity to live a decent life.\nDr Cutajar said that other categories, such as the elderly, were failing to benefit from the well-performing economy that the government often mentioned.\nWinding up, Michael Falzon, minister responsible for social policy, said that this year would mark the fourth consecutive increase in pensions since Labour’s accession to government. He recognised that the present state of affairs was “not a utopia,” however, acknowledging the gender gap in pensions which was pointed out earlier by Opposition MP Claudette Buttigieg. However, he added that everybody had benefitted from pensions increases and increases to the cost of living adjustment.\nThe government would be looking at new classifications of disability which weren’t as strictly tied to mobility problems. He expressed his hope that Budget 2020 would ensure that disability allowance for certain conditions was on par with the net minimum wage.", "comment_count": 5, "id": 2286}, {"keywords": "Construction, Accident", "author": "", "article_body": "A construction worker who suffered a four-storey fall in a construction site in Qawra five days ago, has succumbed to his injuries, the police said on Tuesday.\nThe worker, 23, was from Mali. \nActivists who held a protest on Tuesday over excesses by the building industry, observed a minute's silence out of respect for victims of construction site accidents.", "comment_count": 6, "id": 2287}, {"keywords": "Demonstration, Construction, Civil society", "author": "Denise Grech", "article_body": "Hundreds of people chanted against \"developers’ rule\" as they held a protest on Tuesday in the wake of three building collapses in two months because of adjoining sites under excavation.   \nProtesters marched to the offices of the Malta Developers Association in Guardamangia on Tuesday\nResidents who used to live in a building that collapsed in April and other victims of last week's collapse led the way and there were emotional scenes as the protest paused in front of the apartment block where a wall collapsed last week.\n“Thank you for your support. We are still going through a lot mentally,” Raymond Brincat, one of the victims told those present.\nHis 24-year-old daughter broke down in tears as they arrived on site.\nMr Brincat said he wanted to show his two children they would always find someone for them.\n“Look behind you,” one activist shouted, pointing to the hundreds that gathered for the protest.\nIt was Mr Brincat’s wish for the crowd to sing the theme “you’ll never walk alone” to show his daughter and his son that they were not alone following their traumatic event. \n\nCaroline Micallef, who lost her home eight weeks ago in Guardamangia hill, said they still do not know what will happen to their building.\nMs Micallef barely made it out of her home as it crashed to the ground, holding on to her blind dog as she ran out.\nVisibly emotional, Ms Micallef said although the incident happened weeks ago, they still did not know what would happen to the building they once lived in.\nAnthea Brincat, the wall of whose house collapsed earlier this month, said her family was still traumatised.\n“Something we will never do is stop fighting for justice,” she said to loud applause.\nRaisa Gatt, who lived in the same building as Ms Brincat, said the family was still suffering.\n“We want a clear structure and we want to see what will happen after this,” she said.\n\nDuring the protest, scores banged drums and carried posters reading 'parties plan with developers against the people', with some carrying placards likening developers’ greed to pigs.\nMany also lamented the 'takeover' by the construction sector, carrying placards reading 'Malta was sold for peanuts' and saying 'enough is enough'.\nActivist Wayne Flask said people were sick and tired of developers’ stronghold on authorities.\n\"We came to protest against the authorities who dance to your whims and give you whatever you want,\" he said.\n\"We came to protest because no one made you, an all-powerful group of businessmen, leaders of this country.\"  \n\"People are saying: You disgust us,\" he said, adding developers were acting like dictators with the political parties in their pockets.  \n\"You demolished the country’s soul and instead covered us in concrete,\" Mr Flask said.\nThe recent incidents have led the government to rush through reforms in the construction sector. Earlier this week, a document published for public consultation gave a more detailed definition of the roles of architects and site managers. It also proposed to raise fines for those who flout regulations and laid down that a geotechnical report outlining the structures of nearby buildings must be completed before excavation starts.\n\"Now that houses and people’s lives have crumbled to bits, your mask has fallen,\" Mr Flask said.\nThe organisations participating in this protest organised by Moviment Graffitti included : Alleanza Kontra l-Faqar, Archaeological Society of Malta, Bicycle Advocacy Group, Din l-Art Ħelwa, Flimkien għal Ambjent Aħjar, Friends of the Earth Malta, Futur Ambjent Wieħed, Isles of the Left, Repubblika and Żminijietna – Voice of the Left. ", "comment_count": 77, "id": 2288}, {"keywords": "Construction, Msida, Architecture", "author": "Ivan Martin", "article_body": "A five-storey building in Msida which appeared to be resting on a flimsy column of bricks is safe, architects confirmed on Tuesday.\nThe Kamra tal-Periti was investigating whether the building on Santa Venera road was sanctioned by a warranted architect, following concerns on social media about the apartment block’s structural integrity. \nPictures of the building were shared widely on social media earlier this week, with many raising concerns that the apartment block appeared to be supported by two flimsy rows of concrete bricks set up in a makeshift column.\nThe bricks have now been removed.\nSources at the Kamra tal-Periti said the building, which was covered by the necessary permits, had been constructed more than 14 years ago.\n'No structural purpose'\nThe party-wall which had raised the public alarm, was designed as a cantilever structure throughout the whole length of the building.\nAs a result, each floor was supported as a cantilever structure and was not resting on the column of bricks.\nThe concrete brick wall, the sources said, served as a temporary support for the shuttering of the structural concrete slab.\nThey had not been removed since there was another building adjoining the property and became visible when that property had eventually been demolished by a third party.\n These concrete bricks have now been removed, the sources said.\n“It is amply clear that the bricks served no structural purpose,” the sources said.\nBricks now removed - owner\nThe building’s owner said the same thing.\n“Construction was carried out under the supervision of an architect,” they told Times of Malta.\n“The bricks on which it appeared as though an entire wall of the building was resting in fact served no structural purpose. They were placed there to support scaffolding,” they added, saying the bricks had now been removed under an architect’s supervision.\nThe building appeared to be resting on a flimsy column of bricks - that was not the case.\n“Authorities are welcome to make any further visits and inspections they might feel necessary,” they said.\nSeparate incidents\nThe reports come just over a week after a building collapse in Mellieħa and the wall of an apartment fell into a building site in Guardamangia.\nIn April, an apartment block next door to a building site also crumbled at night. \nMeanwhile the architects who spoke to Times of Malta stressed the importance of not resorting to over-sensationalism at this time.\nAnother member of the Chamber said they were receiving a number of similar reports from their members and from the public.", "comment_count": 63, "id": 2289}, {"keywords": "Education, Consumers", "author": "", "article_body": "Parents, students and teachers have voted overwhelmingly for tracksuits to replace formal uniforms in government schools, the Ministry of Education said on Tuesday.\nThe tracksuit will also include a polo shirt, t-shirt, shorts, cap winter jacket. \nA consultation exercise was held between February 1 and March 18. \n85% of participating primary school pupils voted in favour of the change to a tracksuit, as did 91% of students in middle and secondary schools. \nThe choice in favour of tracksuits was also confirmed by 89% of parents of students in middle and secondary schools who took part in an online survey  along with 77% of teachers who are also parents.\nRELATED STORIESHow would you like your uniform, sporty or formal? \n56% of teachers who took part in the survey also opted for tracksuits instead of formal uniforms. \nThe Education Ministry said talks are being held on the design of the tracksuits and the materials to be used. The tracksuits will be designed by Mcast students, the ministry said, with designs and colours varying according to the various colleges, thus reinforcing their identities.  \nOnce the designs are finalised, a request for proposals will be issued to potential suppliers. \nThe change-over will be gradual in order to ease costs for parents.\nThe current uniforms will be retained for the scholastic year 2019-2020.\nThe new tracksuit and related poloshirt, t-shirt, cap and winter jacket will be introduced in the scholastic year 2020/2021 for Kindergarten 1, Year 1, Year 7 and Year 9.\nAll other pupils will follow in the scholastic year 2021/2022\nFurther details are available on telephone number 153.\nParents and educators both favoured the switch.\nThe public consultation was overwhelmingly in favour of the switch.", "comment_count": 36, "id": 2290}, {"keywords": "Health, Drugs", "author": "", "article_body": "President George Vella said Tuesday he had reservations about extending the legal use of cannabis beyond medical care. \n\"As a doctor and as a father, I have reservations about how wise it would be to extend the legal use of cannabis beyond medical care. We should rely on the advice of experts in such matters,\" Dr Vella told a conference on drugs and mental health organised by the OASI foundation and Naxxar local council. \nIn his address, Dr Vella said it would be a mistake to view people suffering a drug problem or a mental health issue as being somehow different or inferior to the rest of society. \nHe thanked volunteers, NGOs and relatives of patients for their support as well as professionals for their care to ensure that patients were able to resume active participation in society. \nHe also confirmed that mental health issues would be a priority of his presidency and said talks are underway with the Commissioner for Mental Health on a national conference aimed at removing the stigma associated with mental health.  ", "comment_count": 22, "id": 2291}, {"keywords": "Adrian Delia, PN, Politics", "author": "Denise Grech ", "article_body": "Supporters of embattled Nationalist Party leader Adrian Delia have been urged to go to the PN headquarters on Tuesday to show their support, according to posts on social media.\nThe PN parliamentary group is expected to meet on Tuesday amid turmoil within the PN. During last week’s meeting, some MPs called for Dr Delia to step down.\n\"It's very important we show our force. Pls come and tell all your trusted friends to join us!! We need to show these rebels that we have had enough,\" a post under a picture of Adrian Delia said.\nThe party leader told executive committee members on Monday that he would outline a way forward following two massive electoral defeats, sources said.\nThe party has been in turmoil ever since a poor showing at the European and local council elections.\nTuesday’s meeting comes just one day after the party’s media chief, and close collaborator of Dr Delia, Pierre Portelli handed in his resignation.\nRELATED STORIES'No excuses now for rebel PN MPs'- PortelliDetermined Delia soldiers on\nMr Portelli, however, said he would remain part of the party committee.\nThe Civil Society group Repubblika, in a vaguely-worded statement where it did not name any MPs or party, said on Tuesday afternoon that it was deeply concerned at what appeared to be coordinated attacks and attempts at intimidating Members of Parliament in an effort to get them to submit and comply with views and opinions held by an unquantified number of vociferous individuals.\n\"Repubblika does not presume to interfere in how political parties regulate themselves internally. However, it is our duty to insist that whatever means a political party uses to promote its political program, those means cannot include intimidation including through the use of social media to mobilise gangs of online thugs whose language and methods appear intended to bend Members of Parliament to their will.\n\"The Constitutional freedoms of Members of Parliament must also be respected by employees of political parties hired to advise them. Party officials elected from within the membership of their party would also do well to defer to Parliamentarians whose political and constitutional legitimacy arises from having been elected for their role by universal suffrage.\"\nThe statement by Repubblika also comes on the back of several outbursts by  Pierre Portelli against PN MPs Jason Azzopardi and Karol Aquilina. \nIn comments to Labour Party’s media after the meeting, Mr Portelli hit out at Dr Azzopardi, insisting the MP needed to learn how to control himself on social media.\nDr Aquilina was the next MP in Mr Portelli’s crosshairs this morning, as the Siġġiewi MP was taken to task for representing Manuel Delia in a case against Net TV.\nMr Delia told the Times of Malta that lawyer Andrew Borg Cardona is his only legal representative in that particular case.", "comment_count": 79, "id": 2292}, {"keywords": "Health, Attard, Human rights", "author": "Claire Caruana", "article_body": "A total of 106 patients have been moved out of Mount Carmel Hospital after it emerged they had been living there for years despite not having any mental health issues. \nHealth Minister Chris Fearne disclosed the number on Tuesday during a visit at the hospital to tour a new ward. The ward, which has 30 beds, will welcome the first group of patients on Wednesday. \nAccording to Mr Fearne, the 106 patients had been admitted to the hospital years ago even though they did not require any psychiatric treatment. They were only admitted to Mount Carmel, he said, because they had nowhere else to go. A further 24 patients will be relocated in the coming weeks, the minister went on.\nIn recent weeks, the run-down state of the hospital has again been under the spotlight after a former senior official told a parliamentary committee that patients at the state mental health hospital had been made to endure freezing cold showers in the height of winter because there was no hot water for months on end.\nMr Fearne speaks to the media. Video: Matthew Mirabelli\nThey were only admitted to Mount Carmel, he said, because they had nowhere else to go.\nThe comments prompted several reactions, including from mental health NGO Richmond Foundation, which urged the authorities to close down the hospital \"for all psychiatric conditions\", insisting that Mount Carmel was unfit to treat patients.\n'10-year plan'\nThe NGO has argued that patients with psychiatric problems should not be immediately admitted to Mount Carmel, as this singled them out from those with physical problems. Instead, it said, effort to treat mental health in the community should be stepped, while those with acute problems should be moved to Mater Dei. \nAsked about this, the minister told the Times of Malta that the government has a \"10-year plan\" that includes measures to move towards treating most mental health patients through community care.\n\"We are also working on the new hospital at Mater Dei. Obviously, these things do not just happen in a day so, meanwhile, we are relocating as much of the patients as possible while also providing a suitable environment for the remaining 300 patients or so,\" Mr Fearne went on.\nIn April, the Times of Malta had revealed that around three-quarters of the wards at the psychiatric hospital, in Attard, have condemned ceilings.\n ", "comment_count": 14, "id": 2293}, {"keywords": "Aviation, Crime, Court", "author": "", "article_body": "Updated at 3.10pm\nA passenger leaving Malta for Jordan was caught with €34,000 in undeclared cash at Malta International Airport on Tuesday morning.\nDual Irish-Iraqi national Aly Hussein Alzubaidy, 47, wept in court as he said that the money he had hidden were his family savings.\nThe passenger was caught after Customs Officials selected him for screening.\nMr Alzubaidy declared that he was carrying €8,000 in cash, the police told a court, but Customs anti-money laundering officials had found a total of €34,220.\nCustoms officials informed the police anti-money laundering section. Officers arrested the man, returned €10,000 to him – the maximum amount of undeclared cash permitted by law – and seized the rest.\nLegal aid lawyer Martin Fenech argued that this was clearly not a case of money laundering, but simply one of a man taking money to his family.\nThe money had been in a bank, legitimately saved, Dr Fenech argued. \nMr Alzubaidy said the same.\nI just came to Malta for transit for 4 hours, I didn’t see any sign. They asked if I had money and I said yes. It was money for my family.”\nMr Alzubaidy pleaded guilty, with his lawyer saying he was aware of the penalty but was asking the court to consider his position.Magistrate Caroline Farrugia Frendo confiscated the excess €24,021 and fined the man €8,555.Inspector Lianne Bonello prosecuted.\n ", "comment_count": 5, "id": 2294}, {"keywords": "Court, Crime", "author": "Edwina Brincat", "article_body": "A Nepalese man paid €1,500 for a fake Latvian residency permit, hoping to use it to be able to work in Malta.\nProsecuting inspector Frankie Sammut said the accused had been caught when he had tried to apply for work with the fake permit, and asked for a custodial sentence.\nLawyer Martin Fenech, appointed as legal aid to the accused, argued that the man’s passport was valid and that he was not a criminal, and he was merely trying to improve his life.\nThe 35 year-old, Kunwor Kushal, pleaded guilty and was sentenced to a year in prison, suspended for four years, by the court, presided over by magistrate Caroline Farrugia Frendo.", "comment_count": 0, "id": 2295}, {"keywords": "Tourism, Construction", "author": "", "article_body": "“Blatant” abuse at a construction site in Buġibba was flagged by the Malta Hotels and Restaurants Association on Tuesday, which said that the situation was intolerable.\nA legal notice dating back to 2007 states that no excavation or demolition works can be carried out between June 15 and September 30. However, works are still being carried out “irresponsibly, and most times illegally”, it said.\n“This situation has now reached intolerable levels and is seriously damaging the tourism sector, which is an extremely important economic sector, and thus affecting also the quality of life of the Maltese residents,” MHRA president Tony Zahra said, adding: “Enough is enough.”\nThe MHRA is receiving calls every day from concerned members, giving as a particular case in point the works carried out in Bugġbba square in front of HSBC, where a concrete platform was erected for a tower crane.\nIt also said that excavations were still being carried out in Qawra, in breach of the legal notice.\n“We are quickly becoming a destination specialising in a construction site experience for tourists visiting us, and if the implications of such a serious situation are not understood by the competent authorities then we will soon be heading into some serious problems which would be very difficult and expensive to address and reverse.”", "comment_count": 23, "id": 2296}, {"keywords": "Crime, Police, St Paul’s Bay, Court", "author": "Edwina Brincat", "article_body": "A Sicilian man who is on bail after having been accused of trafficking 40 kg of cannabis last year, is facing fresh charges of armed robbery of a supermarket in St. Paul’s Bay.\nSandro Lo Presti, 44, appeared before Magistrate Caroline Farrugia Frendo  accused of theft aggravated by violence after allegedly holding up the 77 year-old supermarket cashier at knifepoint on May 31 at around 4:30am.\nLo Presti was also accused of holding the man against his will, carrying a knife in public without a police permit, failing to abide by his bail conditions and relapsing.\nLo Presti, who is a gypsum plasterer, had been released on a €50,000 bail bond in May in connection with a drug smuggling case.\nCID Inspector Fabian Fleri testified that the cashier, also Sicilian, had immediately informed the police that the person committing the crime was from Ragusa like him, telling them that the robber’s name was Sandro, who worked with a person he knew and who had been in prison. He said he had threatened  in Italian, in a Ragusa accent, not to involve the police two or three times, saying he’d get his revenge if that happened.\nCCTV footage showed only the man’s chin as his hood covered the rest of his face, the inspector said, but Lo Presti’s cell phone location data placed him near the shop seven minutes before the crime took place. At the time of the hold-up, the phone was off and was switched on around 5am when the man returned to his apartment, the inspector said.\nMoreover, Inspector Fleri said the victim was adamant that it was the accused, as he had noticed him acting suspiciously in his shop before and had even saved CCTV footage of him.\nLawyer Franco Debono requested bail. He said the entire case hinged on voice recognition, arguing that the fact that Lo Presti lived close to the shop meant that the phone localisation data didn’t prove all that much.\nThe prosecution objected to bail, citing the fact that its main witnesses were yet to testify and lived close to the accused. Despite the defence countering this argument with the fact that the victim had already testified in the magisterial inquiry, the court denied bail at this stage.\nLawyers Franco Debono and Alexander Scerri Herrera were defence counsel.", "comment_count": 0, "id": 2297}, {"keywords": "Court, Crime", "author": "", "article_body": "A 28-year-old man from Xagħra ended up in Court on Tuesday, charged with threatening a person, holding them against their will, and breaking the public peace.\nThe police did not give details of the other person who was involved noting, however, that the crimes took place between June 15 and 17.\nThey said that the man was also charged with driving dangerously, speeding, driving without a valid licence and insurance, and damaging a third party's vehicle.\nThe man, whose name was not given by the police, pleaded not guilty, and he was granted bail against a deposit of €500 and a personal guarantee of €3,500.\nThe prosecution was led by inspector Bernard Charles Spiteri.", "comment_count": 0, "id": 2298}, {"keywords": "Court, Justice, Construction", "author": "Edwina Brincat", "article_body": "The owners of two Pietà residences enveloped by two construction projects in the same area that witnessed a building collapse last week have filed two judicial protests in a bid to safeguard their own safety.\nDulcie Zammit and Gotthard and Magnolia Tabone filed two judicial protests against Portica Estates Ltd and Mohib Abouzidan, the two developers and their respective architects behind the two projects, one on Ursuline Street and the other on Danny Cremona corner with Mimosa Street, close to the site of a building collapse just five days ago.\nIt was the third such collapse in a few days. Following the most recent collapse, the government decided to temporarily suspend all demolition and excavation works.\nThe first project residents protested against involves the replacement of an existing house with five housing units including a duplex penthouse, a basement warehouse for domestic use and parking spaces at ground floor level.\nRELATED STORIESWorkers back at Guardamangia collapse site for 'remedial works'\nThe other project involves the demolition of an existing tenement and the construction of a basement garage, class 4B shops at ground floor, 15 overlying flats and two penthouses.\nThe protesting parties, whose properties are closed in by these two construction sites, have sought recourse before the courts, calling for information about the name and details of the site managers.\nThey are also requesting copies of the relative insurance policies and bank guarantees, condition reports on their properties as well as method statements of the proposed developments.\nRELATED STORIES'This is your protest': activists to march against construction mania\nWhile calling upon one of the developers to abide by the statutory 7cm distance from party walls during excavation works, the protesting parties pointed out that the other developer had ignored this rule, digging right next to the dividing wall abutting the third party property which collapsed five days ago.\nThe protesting parties called for the use of adequate machinery in the works and for a geological survey to be carried out, especially since another building in the same zone had already collapsed.\nIn the light of such “serious doubts” about the structural stability of the area, the protesting parties called upon the developers and their architects to ensure that they would suffer no damages through the building works next door.\nLawyer Andrew Borg Cardona signed the acts.\n ", "comment_count": 2, "id": 2299}, {"keywords": "Adrian Delia, PN, Politics", "author": "Keith Micallef", "article_body": "Nationalist Party MPs would now have to face their own failings and could no longer hide behind excuses, outgoing Nationalist Party media chief Pierre Portelli said 12 hours after making his resignation public.\n“Now the onus is on them to try and seek a way out of this conundrum,” Mr Portelli told Times of Malta, saying that MPs opposed to party leader Adrian Delia would now not be able to claim somebody was working against them behind the scenes.  \nMr Portelli, who announced his resignation as Media.Link executive chairman immediately after an executive committee meeting on Monday, pointed out that he would not be resigning his seat on the party committee.\n“I’ve been elected by the General Council. And I intend to stay on!” he said.\nRELATED STORIESDetermined Delia soldiers on\nMr Portelli dismissed criticism that the PN was not electable with Dr Delia at its helm.\n“Is the PN electable with the small group of MPs who have been putting spokes in the wheels from day one, in their attempt to retain their influence on the party?” he questioned.\nAsked if Dr Delia should call a vote of confidence, he questioned why the disgruntled MPs who have been pushing for it, would not call it themselves.\nDaphne claims 'pure spin'\nSources who were at Monday’s meeting claimed that Mr Portelli outraged members when he began blaming several external factors, including the Times of Malta and murdered journalist Daphne Caruana Galizia, for the party’s problems.\nHis reference to the late journalist incensed many people in the room, sources said. \nOn Tuesday, Mr Portelli dismissed those claims as pure “spin”, saying he never attacked Ms Caruana Galizia but wanted to \"defend\" her during Monday’s executive committee meeting.\n\"I recalled that in June 2017 she had called to enquire about Dr Delia as she had never met him before. However, from then onwards a number of MPs started feeding her lies about him, which she reproduced in her blog,\" he told Times of Malta.\n\"The moment I mentioned Daphne during the executive council meeting, a small number of MPs started screaming their heads off and disrupted the meeting, which had to come to an end. This is unacceptable behaviour for a democratic party, let alone for one that once branded itself the ‘party of dialogue,’\" he said.\nHis resignation comes as the PN convenes its parliamentary group on Tuesday night in what could possibly determine Dr Delia's fate.", "comment_count": 32, "id": 2300}, {"keywords": "Construction, Accident", "author": "", "article_body": "Updated 5pm with Chamber of Planners comments\nThe proposed amended regulations relating to the construction industry following a number of building collapses were \"piecemeal and ill-thought\", the Chamber of Architects and Civil Engineers said in a draft position.\nThe proposals issued by the Infrastructure Ministry, say that architects and site managers will have to adhere to stricter procedures and regulations and in case of any breach, fines may shoot up to €50,000. \nThree buildings - two in Guardamangia and another in Mellieħa - were destroyed or severely damaged thanks to construction work carried out in adjacent areas.\nRELATED STORIES'They told us it was safe' - Residents evacuated as wall collapsesBuilding collapses in Mellieħa\nIn a statement on Tuesday, the chamber said Malta’s legislative instruments needed a complete overhaul. Attempting to amend the current regulations without considering their impact on other legislation, as well as on current practices and the industry’s capacity, was a recipe for further confusion and lack of clarity.\nRELATED STORIESGovernment announces reform after stopping all demolition, excavation works\nThe legal notice failed to address the dangerous process of loading party walls, and their foundations - designed to carry two or three storeys - by several floors.\nThe chamber referred to an amendment aimed at clarifying the roles of the figures engaged on a site and said there were glaring incongruities with roles defined in other legislation.\nRather than clarifying, the proposals introduced new roles without defining appropriate competencies, while ignoring the existence of figures already defined in other legislation, such as licensed masons.\nIt also ignored the lacuna regarding the legal obligation for the registration of contractors, who, together with architects, were liable for the structural integrity of buildings.\nThe chamber said that the proposed processes for the submission of method statements, geo-technical investigation and design reports were cumbersome and more intent on establishing who carried out and submitted the reports, rather than on establishing the criteria for their preparation.\nThe chamber said it believed this was due to a lack of research to understand how such instruments were used internationally, and trying to adapt them to the local situation, with no regard for scale or complexity of projects.\nThe proposed draft, it said, seemed to imply that the measures proposed were to apply retroactively for ongoing projects. This would have implications on the capacity of the industry to respond in a meaningful manner, it said.\nThe chamber said it did not believe that the proposed amendments were acceptable and would be publishing a full analysis at the end of a consultation period following an extraordinary general meeting, being held on Friday.\nArchitects have been given until Thursday at noon to submit their comments in writing.\nChamber of Planners say regulations not enough to address problems\nThe Malta Chamber of Planners also weighed in, saying that while the new regulations were welcome they would not, on their own, be sufficient to address the current problems with the construction industry and particularly the safety of adjacent properties.\n“The regulations should promote a precautionary approach for all types of demolition and excavation works on site, irrespective of the distance between such works and adjacent properties/walls. Such precautionary approach should also be promoted in particular areas or situations where geo-technical instability of the ground is very likely - example, properties in close proximity to ridge edges, caves, clay areas, etc.,” the chamber said.\nIt also noted that it was unacceptable to leave sites excavated or in a state of abeyance for more than one calendar month, and that applications for excavation alone should not be allowed.\nIt also suggested that planning permits should be valid for three years instead of the current five, and just two years for development in ODZ.\nThe chamber also warned that despite the need for appropriate studies, there was always the risk that the rush to finish a project “to move on to the next” might result in poor construction methods.\nIt also suggested that the method statement should be forwarded to the relevant neighbours for a one-week consultation, giving them enough time to seek professional advise and raise concerns if necessary.\nTo avoid cases linked to construction from dragging on for years, the Chamber of Planners proposed the setting up of a construction appeals tribunal, composed of an architect/ structural engineer, a lawyer and a geologist, which would be obliged to deliver a decision by not later than two months, with appeals to the Civil Court of Appeal only on points of law.", "comment_count": 11, "id": 2301}, {"keywords": "Adrian Delia, PN", "author": "", "article_body": "Adrian Delia left a Nationalist Party executive committee meeting on Monday night insisting that nobody in his party had “until today” called for vote of confidence on his leadership.\nThe PN leader appeared calm and soft-spoken as he spoke to journalists outside the PN’s headquarters at the end of the meeting, which got rowdy at times and which sources said was exemplified by Dr Delia’s right-hand man Pierre Portelli clashing with members over who was to blame for the PN’s woes.\nDr Delia declined to comment on why PN members were seen storming out of the building following the meeting.\n“You’d need to ask them [why they were angry],” he said. “I am not. I have a clear vision of what the party needs to move forward”.\nDr Delia said he had never called for a vote of confidence in his leadership, and had not faced any calls for such a vote – yet.\n“There are ways and means for such a vote to be called for,” he said. “I have not called for one, and until today nobody has either”.\nDr Delia speaking to the press. Video: Chris Sant Fournier\nAsked point-blank whether any members had resigned during the executive committee meeting, Dr Delia replied with a simple “no”.\nDr Delia’s aide and the party’s media chief Mr Portelli subsequently announced on Facebook that he would be stepping down as the boss of the party's media arm.\nHe said he had first offered to resign last week but had stopped short after speaking to Dr Delia. Monday’s meeting, however, made him return to his original decision.\nDr Delia will face his parliamentary group on Tuesday evening, with MPs opposed to his leadership expected to clearly demand that he step aside and make way for a new leader.\nHe has declined to comment on reports about that ultimatum, saying on Monday that it would “unethical” to discuss the workings of the PN’s parliamentary group.", "comment_count": 85, "id": 2302}, {"keywords": "Weather, Climate", "author": "", "article_body": "The amount of rain falling in May was double the normal amount for that time of year, with six storms - compared to the one normally expected - making the month the worst since 1951.\nThe Met Office said that while April was relatively dry, May literally took Malta by storm, showering the Islands with 19.2mm, more than double the expected 8.5mm.\nDespite the fact that May was a generally calm month, winds reached a maximum gust of 48 knots with a SE direction on the 4th of the month.\nThe total 289.7 hours of sunshine recorded during May fell 10 hours short of the expected 299.1 hours for this time of year, although the islands still basked in an average of 9.3 hours of bright sunshine every day.\nWhile May started off on a cool note, seeing air temperatures drop to a low of 10.1°C on May 8, the sun quickly thawed the islands, leading the air temperature to reach a maximum of 26.7°C on May 29.\nThe average air temperature was over one degree lower than the climate norm of 19.8°C, standing at 18.3°C.\nSimilarly, the average sea temperature for the month stood at 17.9°C, which is also slightly lower than the climate norm of 18°C.\nMay's weather by the numbers. Image: Malta International Airport", "comment_count": 0, "id": 2303}, {"keywords": "Finance, Economy", "author": "", "article_body": "The Forum Unions Malta has objected to the European Commission’s recommendation to raise the statutory pensions age with a warning: “do not touch it”.\nThe European Commission's Country Specific Report for Malta, published a few weeks ago, said that since life expectancy was going up, the pension system would become unsustainable unless the statutory retirement age was adjusted.\nThe pensionable age has been reformed through various measures to make the system more sustainable, with the For.U.M. saying some of these were “clearly detrimental to employees” who saw their respective statutory retirement age being raised in the past years.\nRELATED STORIES‘No drastic measures needed on pensions’\n“While emphasising that the sustainability of pensions is of utmost importance, measures which are detrimental to employees cannot be considered,” it insisted.\nFor.U.M. appealed to the government to consult all social partners about the work being carried out by the Pensions Strategy Group - which should finalise their work by 2020 - and will be asking the Malta Council for Social and Economic Development to include the topic on its agenda.\nThe report can be accessed here.", "comment_count": 3, "id": 2304}, {"keywords": "Construction, Guardamangia, Accident", "author": "", "article_body": "Works resumed on Tuesday at a Guardamangia excavation site right next door to a building which partially collapsed last week, for what the developers’ architect described as “remedial works”.  \nThe architect for the site on Mimosa Street said that the contractor was reinforcing the building to make it safe, following the advice of a geologist who assessed the site’s geological foundation.\nResidents living in the block next door were evacuated last Thursday after a wall adjacent to the building site collapsed.\nThe collapse – the third in as many months – spurred the government into action, with Prime Minister Joseph Muscat ordering a suspension of all excavation and demolition works across the country until revised regulations could be rushed through parliament.\nRELATED STORIES'They told us it was safe'Activists to march against construction mania\nA magisterial inquiry has been opened into the Mimosa Street incident but has been stalled due to the structural danger the partially collapsed building posed.\nTuesday’s works, the developer’s architect told Times of Malta, would temporarily buttress the structure and ensure it was safe. The police had given the go-ahead for the works to get underway, he added.\nVideo: Keith Micallef\nResidents have previously spoken to Times of Malta about their trauma and described being forced to sleep in a car for fear of being inside their own home.\nOn Tuesday, they said that they had not been informed that works would resume and complained that some of their possessions, which were buried in the collapse rubble, could have been bulldozed.\nActivists are planning to march against construction impunity just a few hundred metres away from the site on Tuesday evening, with an activity that is scheduled to begin at 6pm outside St Luke’s Hospital.", "comment_count": 19, "id": 2305}, {"keywords": "Banking, Economy", "author": "Jacob Borg", "article_body": "ING’s withdrawal of its US dollar correspondent banking services to Bank of Valletta hits at the heart of Malta’s financial system, Malta Bankers’ Association (MBA) chairman Marcel Cassar told Times of Malta.\nBOV now has until December 14 to find another bank that will allow it to continue processing transactions in US dollars.\nMr Cassar said large international correspondent banks have been exiting, or de-risking, the service for years.\nRELATED STORIESBOV closing accounts held in US dollarsWatch: BOV's correspondent bank loss is due to its success - Muscat\nHe pointed towards a United Nations report describing the shrinking of correspondent banking services as a worldwide issue that impacted a number of countries and hundreds of banks, especially in emerging markets. \nSmaller banks are particularly impacted since their volumes and scale do not justify the compliance risk and economics for their correspondent banks.\nLatest developments 'worrying'\nThis is also the case in Malta, where the jurisdiction's volumes are small, Mr Cassar said, while also pointing to the country’s “reputational issues”.\n“Although a good number of Maltese banks continue to be serviced by their USD correspondents, the latest developments are obviously worrying, especially if they are not driven by anything specific about Bank of Valletta”.\nMr Cassar said the MBA has been alerting the authorities for years about the de-risking by correspondent banks, as its members are in the line of fire.\n“We know what’s been brewing first-hand. Admittedly there are no straight-forward solutions but more needs to be done to preserve the hard-earned reputation of Malta’s financial services industry.\n“Political, regulatory and industry players should focus on presenting Malta as a place that upholds the highest standards of conduct”.\nMFSA reforms a step in the right direction, but...\nThe MBA chairman said the reforms underway at the Malta Financial Services Authority are a step in the right direction, but they will take time to deliver results and need to be accompanied by corresponding actions at regulator and enforcement authorities.\n\nHe warned that some “serious, urgent challenges” were still ahead, like the imminent publication of the Moneyval report.\nThe Sunday Times of Malta reported in March about how Malta received a “fail” in an initial draft of the report.\nAll efforts are needed to mitigate the risk of financial exclusion and a potential negative impact on financial stability, which other correspondent bank exits may bring about, Mr Cassar said.\nAn experienced financial markets analyst, who preferred to remain unnamed, told Times of Malta that correspondent banking arrangements are crucial for making cross-border payments.\nThe US dollar is still the most used currency in trade so any disruption in the payments system will affect business and individuals directly and severely.The analyst said BOV will probably have to resort to using the services of what are known as secondary banks to continue processing dollar payments.\nAccording to the analyst, BOV would still have to be vigilant as the reasons ING pulled out could also make these secondary banks think twice about a relationship with the Maltese bank.\nHow will this impact BOV clients?\nToday, BOV is the only major bank handling payments from gaming companies and payment gateways. Disruption cannot be excluded if banks get tougher on dealing with such businesses.\nMalta's business model is considered to be high risk as it is based on low tax incentives and lax enforcement of anti-financial crime regimes, the analyst told this newspaper.\n\nBOV is already under scrutiny from banking regulators (European Central Bank) and rating agencies because it is perceived to have a business model based on supporting economic activities that are considered not be to sustainable in the long term.\nThe analyst said BOV will have to keep reducing the risk in its business model by curtailing certain services to businesses that are perceived to present a higher risk of money laundering and tax evasion or even avoidance.\nWhy is everyone scared of dollar transactions?\nUS-based banks are threatened with major fines and even the withdrawal of their licence to operate in the US if they handle money that may be connected with activities that are not “viewed positively” by US regulators.\nPayments involving e-gaming and payment gateways outside the Visa or Mastercard system are viewed as high-risk in the US.\n\nUS regulators also take a dim view of companies that are perceived to be avoiding tax in their country of origin.\nJurisdictions associated with money laundering and terrorist financing are shunned by US banks, and countries where there is a perception that such activities exist are often blacklisted, either officially or unofficially, the analyst said.\nHow do US banks view Malta?\nThe analyst said Malta’s reputation was unfortunately tainted.\nThis perception has existed for long especially since some of former Libya strongman Gaddafi's fortunes were also held in Maltese banks.\nRecent incidents of abuse have of course not helped to dispel the bad reputation, the analyst said.", "comment_count": 29, "id": 2306}, {"keywords": "Conservation, History, Planning Authority", "author": "Philip Leone Ganado", "article_body": "Extensive plans for the restoration of the imperilled Fort Ricasoli were given the go-ahead by the Planning Authority on Monday, six years after they were submitted.\nThe plans by the government Restoration Directorate will see the restoration, in several phases, of large parts of the Kalkara fortifications – including bastion and parapet gun emplacements, ditches, ravelins, barrack blocks and a chapel – to ensure their long-term preservation.\nFort Ricasoli, built by the Knights of St John and the largest on the island, has been in a dire state of deterioration for years, with sections of its outer bastions already having crashed into the sea and heritage experts warning that further collapse was inevitable without immediate intervention.\nA report drawn up by the Restoration Directorate as part of the planning process noted that the deterioration had largely been caused by the rough seas which continuously batter the exposed ramparts.\nRELATED STORIESWatch: Group pleads for emergency works to save Fort RicasoliMalta's largest fort is falling apart... and it could cost €50m to save it\nThe report concluded that wave action had caused extensive structural damage to the bastions facing the open sea, causing their collapse, while salt contamination had further attacked masonry elements and rock outcrops.\nExtensive rust damage was found on steel structural elements and fittings added in later years, while further damage had been caused by the unchecked growth of algae and vegetation, neglect and lack of maintenance, as well as pollution from the burning of fossil fuels.\nSections of bastions already crashed into sea\nRELATED STORIESFort Delimara may soon be historyWatch: Forts under attack from neglect and vandalism\nThe planned restoration works include cleaning and reconstruction missing sections of the limestone fabric, restoration of deteriorated masonry and collapsed structures, and structural consolidation.\nThe rock face below the fort will also be consolidated as a hazard reduction measure.\nAlthough the application for the works was submitted in May 2013, it appears to have lain dormant for years, and was only approved by the PA on Monday.\nThe Restoration Directorate did not respond to questions on why the plans were delayed and where they fitted in the broader strategy for conserving the fort.\nRELATED STORIESFort Ricasoli is under serious threatA 150-year-old fort waits to be eaten by the sea\nConcerns over the fort’s survival have increased in recent years, and heritage group Wirt il-Kalkara last year estimated it would take €50 million worth of emergency works to ensure its survival.\nDesigned by the Italian military engineer Antonio Maurizio Valperga, the fort was built between 1670 and 1698 on a promontory known as Gallows Point, commanding the entrance to the Grand Harbour. Over the centuries, it was occupied and added to by the Knights of St John, the French and, finally, the British army and Royal Navy, before being decommissioned in the 1960s, since when it has been used for industry and as a film location, including for Gladiator and Game of Thrones.\nIt is a Grade 1 scheduled national monument and has been on the tentative list of Unesco World Heritage Sites since 1998.", "comment_count": 9, "id": 2307}, {"keywords": "Construction, Demonstration, Guardamangia, Civil society", "author": "", "article_body": "Updated 9.55am\nAnger at Malta’s construction lobby will spill onto the streets on Tuesday evening as activists rally to march against rampant, unfettered development.\nThe Moviment Graffitti protest, which begins at 6pm outside St Luke’s Hospital, is expected to bring together people from all walks of life and will see people march to Malta Development Association offices just a few hundred metres away.\n\"We want those who have had enough of this situation to join us, together with their families. Bring placards and if you can, musical instruments - no partisan messages will be tolerated, because this is a people's protest,\" organisers said in a rallying call to drum up support.\n“If you’ve had enough of the development lobby and their arrogant control over the islands, walk with us. Otherwise, typing away at home won’t help you,” they added. \nIrritation at lax enforcement of construction laws and developers’ power over politicians has bubbled over in recent weeks, following a spate of building collapses and construction site accidents in recent weeks.\nRELATED STORIESJanet's anger is our voice - Sandro SpiteriThe great big enforcement sham - Claire Bonello\n“This is not our protest,” a Moviment Graffitti spokesperson told Times of Malta.\n“It is the protest of residents of Pieta’, Mellieħa and Ħamrun,” he said, referring to the sites of three separate building collapses in the past months.\n\n“It is the protest of people all across the country who are fed up of the arrogance and bullying of the development lobby and sick and tired of being ignored by the planning boards, which constantly favour developers over residents”.\nActivists have a litany of complaints about Malta’s development sector and have protested – and appealed – against several major projects, from the db Group’s City Centre project in Pembroke to plans to build an undersea tunnel stretching from Manikata to Nadur, as well as “permanent construction” in Sliema, St Julian’s and Swieqi.\nAt least three other civil society groups – democracy-focused Repubblika and leftist think tank Żminijietna and environmental NGO Flimkien għal Ambjent Aħjar – have endorsed the protest and said they will march with Graffitti in the evening.\nPartit Demokratiku will also be taking part. It said in a statement on Tuesday that the recent construction disasters were an acute symptom of a chronic condition and linked to a lack of, or selective, enforcement.\nThe lack of good governance and authorities under continuous political influence were driving Malta into a degenerative economy as the latter was supported by construction, population increase, consumerism, and the selling off of anything and everything.\nIt said it was against cosmetic solutions and populist politics but in favour of the force of reason where prosperity was hallmarked by peace of mind.\nThe government has scrambled to react following a collapse last week in Guardamangia, suspending all excavation and demolition work and fast-tracking plans to revise construction legislation.  \nThat reaction, however, has not placated activists, who are demanding a limit on the number of planning permits issued, tighter restrictions on permitted hours for construction and serious enforcement of existing laws, among other things. ", "comment_count": 19, "id": 2308}, {"keywords": "Media", "author": "", "article_body": "The following are the top stories in Tuesday’s front pages.\nTimes of Malta says Bank of Valletta is in a race against time after confirming on Monday its last correspondent bank for US dollar transactions is pulling the plug on its relationship with Malta’s local bank in December. In another story, the newspaper says extensive plans for the restoration of the imperilled Fort Ricasoli were given the go-ahead by the Planning Authority on Monday, six years after they were submitted.\nThe Malta Independent says that the new construction regulations call for a geotechnical design report and stipulate harsher fines.\nL-Orizzont says the regulations place a bigger responsibility on architects.\nIn-Nazzjon says a foreign couple has alleged they lost their baby as a result of bureaucracy at Mater Dei Hospital.", "comment_count": 0, "id": 2309}, {"keywords": "Construction, Joseph Muscat, Politics", "author": "Ivan Martin", "article_body": "The construction industry has grown at a faster pace than its regulators, often leaving citizens with nowhere to turn, Prime Minister Joseph Muscat admitted on Monday.\nFielding question from reporters, Dr Muscat was asked whether some contractors felt they could do as they pleased as there was no one to police the sector.\n“I think it’s a situation where the industry has grown at a much faster rate than the capacity of the institutions governing it, that is the truth,” he said, later adding that he wanted to see this gap reduced.\nThree buildings collapsed in the past months - in Pieta’, Mellieħa and Ħamrun.\nDr Muscat told reporters he would not tolerate a situation where watchdogs were reduced to “filing cabinets” for documentation and reports.\n“We must have a more proactive approach,” he said, again conceding that citizens deserved better.\nAsked whether he felt that political responsibility for the present situation needed to be shouldered, Dr Muscat pointed to the government’s decision to temporarily suspend all demolition and excavation works.\n“We have shouldered responsibility because we have stopped an entire industry,” Dr Muscat said.\nTurning to the consultation on amendments to construction industry, Dr Muscat said the government could no longer tolerate a situation where people in the private sector caused accidents because of negligence.\nA protest by Moviment Graffitti is being held on Tuesday starting at 6pm from outside St Luke’s Hospital to the Malta Development Association offices just a few hundred metres away. It is expected to bring together people from all walks of life.", "comment_count": 21, "id": 2310}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "Updated at 1.14pm\nThe head of the Nationalist Party's media company, Pierre Portelli, resigned on Monday night as he launched a scathing attack on members of the parliamentary group, although he stopped short of naming anyone in his resignation letter.\nThe letter, dated June 14, was made public in a Facebook post in which Mr Portelli announced he was stepping down.\nMr Portelli, former editorial director of The Malta Independent, is widely believed to be the man who had encouraged Dr Delia to stand for the PN leadership contest two years ago. \nHe was then appointed head of Media.Link by Dr Delia.\nMr Portelli said that while he was resigning from his job at Media.Link, he would be keeping his seat on the party's executive committee. \nSome MPs... who went as far as sustaining and aiding criminal activity by third party simply to get you out of the way.\"- Pierre Portelli\nMr Portelli said he had initially offered to step down last week but had stopped short of doing so after speaking to Dr Delia. He returned to that initial decision following an executive committee meeting held on Monday evening, he said in his Facebook post.\nIn his letter to Dr Delia, Mr Portelli said that persevering in his role would not bring further changes \"due to the constant and coordinated attacks on the party and its media by some of your MPs within the parliamentary group, who went as far as sustaining and aiding criminal activity by third party simply to get you out of the way\".\nSome within the party, he added, “insist they have a divine right to lead and control the party and its media platforms”.\nMr Portelli said he would return to the private sector, but would continue to support Dr Delia in his resolve to push a new way for the PN.\n\"The reality that surrounds us today demands of us to take serious action and cleanse the party from people who continue to stall the PN in bad faith.\n\"Our vision was to open up the party and its media to new ideas, new people and new solutions for our country. Unfortunately, I came to realise that that dream needs to wait the revolution to take place, one that draws up new rules of engagement that are clear to all those seeking office under the PN brand,\" Mr Portelli said.\nPierre Portelli's resignation letter.\nMr Portelli made his Media.Link resignation public late on Monday night, once the PN executive committee meeting had ended. \n'He blamed Daphne'\nMembers of the PN executive appeared angry and irritated as they exited the party headquarters late in the night, with sources saying Mr Portelli had ended up railing against perceived enemies of the party, including the Times of Malta, in an speech which turned sour.\nRELATED STORIESWatch: Determined Delia soldiers on following rowdy meeting\n“He blamed MŻPN, #OccupyJustice, the Times, and last but not least and worst of all, Daphne [Caruana Galizia],” a source who was at the meeting said.\nMr Portelli said Ms Caruana Galizia had set out to destroy Dr Delia even before he was made PN leader, people at the meeting claimed.\nHis reference to the late journalist who was murdered 20 months ago incensed many people in the room, sources said. \n\"It descended into a shouting match,\" one person at the meeting said. \n'I'm attacking you, not her'\nAnother person in the room who is closer to Dr Delia said Mr Portelli's point was that some MPs were using the memory of Ms Caruana Galizia to gain their own political mileage.\n\"He told them, 'I'm attacking you, not her',\" the source recalled.\nTensions had been rising throughout the meeting, another said, with Mr Portelli having failed to impress attendees with a list of 10 points to move the party forward, which included more meetings with party members and social media rules for party officials and MPs.\nThe resignation comes as Dr Delia is expected to convene his parliamentary group on Tuesday evening.\nThe Sunday Times of Malta reported that the PN’s parliamentary group is expecting Dr Delia to relay a decision about his future after having given him a “few days” to reflect, consult and decide.\nMr Portelli was appointed chairman in November 2017, shortly after Dr Delia was elected PN leader of the PN. The party has since been rife with internal fighting, culminating in an electoral thumping in the European and local council elections.", "comment_count": 106, "id": 2311}, {"keywords": "Politics, Adrian Delia, PN", "author": "", "article_body": "Nationalist Party leader Adrian Delia told a meeting of the PN executive on Monday that he will present the parliamentary group with a plan on the way forward, with him at the helm.\nThe parliamentary group is due to meet on Tuesday, amid reports that the meeting will mark the expiry of an ultimatum by MPs who want him to step down. \nParty unrest worsened in the wake of an electoral battering at the European and local council elections last month and a meeting of the parliamentary group last week heard calls for Dr Delia to go.\n\nSources said Dr Delia informed Executive Committee members that he is prepared to assume responsibility for the recent election results by continuing to lead and restructure the party. He did not give details about the plan he intends to present to parliamentarians.\nParty officials spoke about the need to discipline those who were causing harm to the party leadership through their posts on social media.\nNo one made comments when the meeting of the Executive ended.\n\nIt is believed Dr Delia still enjoys support among executive committee members, in stark contrast to the majority of MPs and other party structures who have demanded change at the top.\nThe Sunday Times of Malta reported yesterday that the PN’s parliamentary group is expecting Dr Delia to relay a decision about his future after having given him a “few days” to reflect, consult and decide.\nSources within the party said just a few MPs are still backing Dr Delia, who was elected party leader by the party members in September 2017.\nOn Monday, PN deputy leader Robert Arrigo also spoke about the need to restructure the party, including rebranding.", "comment_count": 36, "id": 2312}, {"keywords": "Politics", "author": "", "article_body": "Simon Busuttil’s description of the State Advocate Bill as “anti-European” had been labelled by Dutch MP Pieter Omtzigt as “a step too far,” according to Justice Minister Owen Bonnici.\nSpeaking in parliament, Dr Bonnici said Omtzigt was critical of Dr Busuttil's remark in comments during which he described the bill as an important but insufficient step forward.\nDr Bonnici stood by the State Advocate Bill as he concluded the second reading debate on the bill.\nThe Opposition has criticised the bill, arguing that while it purported to separate the roles of the attorney general to prosecute and to serve as the government's legal counsel, the persons to both posts would still be appointed by the prime minister. \nDr Bonnici observed that Dutch MP Pieter Omtzigt, a member of the Council of Europe Committee on Human Rights and Legal Affairs who had compiled a report on the assassination of Daphne Caruana Galizia and the state of the rule of law in Malta, objected to what he called the lack of judicial review of the actions of the Attorney General.\nBut it appeared that Dr Omtzigt had relied on comments in the media by Prof. Kevin Aquilina, Dean of Laws at the University of Malta. \nDr Bonnici said that he had been advised that the extant “challenge proceedings” procedure - which provide that the police can be taken to court for failing to take action against an accused sufficed as judicial review. This procedure was well known to all practising lawyers.\nThe existence of such a recourse also served to counter Opposition Leader Adrian Delia’s criticism that the Attorney General had the exclusive power to initiate prosecution. Furthermore, Dr Bonnici added, the Attorney General lacked the power to prosecute whatsoever in terms of the existing law.\nDr Bonnici also took Dr Delia to task for criticising the excessive power given to the Attorney General. He pointed out that the Venice Commission and the Opposition alike had criticised the excessive power given to the Prime Minister, not to the Attorney Genera. Steps were being taken to address this criticism by requiring a public call and selection board composed of experts to be involved in the appointment of the state advocate.   The Bill would also reduce the powers available to the Attorney General by hiving off his current civil functions.\nFurthermore, Dr Delia was in the same breath proposing to give the Attorney General even more power by urging the government to implement a Venice Commission recommendation to assign magisterial inquiries to the Office of the Attorney General.\nThe present system worked, Dr Bonnici said, and further study was necessary in order to determine whether such a change was warranted and could be implemented.\nReferring to remarks by Opposition MP Carmelo Mifsud Bonnici, Dr Bonnici reiterated that very few jurisdictions in the free world selected their Attorney General - where the latter was also the director of public prosecutions - with a two-thirds majority of Parliament.\nHe could not understand how Dr Mifsud Bonnici had almost encouraged the government to move such legislation while Opposition MPs Simon Busuttil and Karol Aquilina had portrayed the Bill as a “step back.” Dr Busuttil seemed to be part of the “hara-kiri party,” said Dr Bonnici. He  was against everything and everyone.\nDr Bonnici said that he was proud of the level of the debate in general, adding that the Bill had the support of Cabinet and of the Labour Parliamentary Group after being discussed by both in detail. However, he said that the government could not introduce all of the changes recommended by the Venice Commission at one go, in order to avoid shocks to Malta’s legal system.\nInstead, changes would be introduced where necessary after the law currently before the House came into force and started to function. There would be no “omnibus Bill” which would turn the Constitution on its head.\nReferring to criticism of the fact that the Attorney General would continue to serve as head of the Financial Investigation and Audit Unit, Dr Bonnici said that the practice of appointing the Attorney General to this position had been started when the Unit was established by a Nationalist administration. The appointment of Attorney General Silvio Camilleri to this role had been followed by the appointment of Dr Peter Grech. However, the government did not object to reviewing this arrangement once Dr Grech’s term reached its conclusion.", "comment_count": 4, "id": 2313}, {"keywords": "Accident", "author": "", "article_body": "Bank of Valletta has been ordered to pay €11,475 as compensation to a woman who fractured one of her feet when she slipped on a doormat at the bank’s branch in Naxxar.\nThe incident happened on July 15, 2016 as the 83-year-old entered the bank.\nThe court, presided by Mr Justice Lawrence Mintoff, heard how the woman, Catherine Seager, was fit and used to go out on her own and drive until the day of the accident. She had just returned from a holiday in Scotland the day before.\nShe was hospitalised as a result of the fracture and needed to be operated upon. Some days later she contracted an infection, known as herpes zoster, which she blamed on her weakened condition as a result of the fall. A court-appointed doctor who examined Ms Seager 18 months after the incident, confirmed that the woman continued to suffer some pain and a 2% permanent disability.\nMs Seager argued that as a result of the incident her son, who lived with her, refused offers to work as a ship’s engineer while he cared for her round the clock for three months. She paid him €10,000 for his services.\nThe bank denied responsibility for the accident.\nThe court said the carpet was not of the ideal type for a public area used by hundreds of people. The carpet was so light, that the security officer at the door had to put it back in place several times during the day since it moved when people walked over it.\nThe bank had a duty to ensure that no part of its furniture posed a danger. It did not take much to realise that a light carpet that did not stick to the floor in a place used by hundreds of people was not ideal for a bank’s door. Indeed, one of the security officers at the door had long warned of the possible danger, although no other accidents had occurred until that date.\nThe court, therefore, found the bank responsible for the accident through negligence and imprudence.\nIn considering the amount of compensation, the court considered medical expenses incurred by Mrs Seager. It also noted how she had paid her son €10,000 for the period he looked after her and ordered that that amount be considered as material damages since, had the woman engaged another carer, she would have ended up paying more.\nOn the potential loss of future earnings, the court said that although the woman was 83 years old and was not gainfully occupied at the time of the accident, this did not mean she should not receive compensation for loss of future earnings in view of her 2% permanent disability. €805.15 were calculated for this purpose.\nThe court therefore ordered the bank to pay total damages of €11,475.\nMrs Seager was represented by lawyer Malcolm Mifsud. ", "comment_count": 0, "id": 2314}, {"keywords": "Police", "author": "", "article_body": "A 53-year-old man, Allan Hartmann-Jensen, has been missing since June 5, the police said. \nHe was last seen around Buġibba square.\nAnyone having information about him is being asked to phone the police, even in confidence, on 21 224001 or 119. ", "comment_count": 0, "id": 2315}, {"keywords": "Local councils, Politics, Birkirkara", "author": "", "article_body": "Michael Fenech Adami has resigned his seat on Birkirkara local council so that he can continue to serve as president of the Central Region Council, the Nationalist Party said on Monday.\nRecent amendments to local councils law forbids the president of a regional council - grouping councils of neighbouring localities - from being a councillor. \nMr Fenech Adami, a former mayor and son of Eddie Fenech Adami, was due to be sworn in for another term as Birkirkara councillor on July 1 after being reelected in elections last month. \nBirkirkara is, for the second successive term, to be run by a Labour mayor, Joanne Debono Grech, who was elected with 3,610 votes.\nThe PN's Justin Schembri was the second Birkirkara councillor elected, with 2,543 votes. Mr Fenech Adami came third, with 1,501 votes. \nMr Fenech Adami's term as president of the Central Region Council continues until 2022.\nMr Fenech Adami thanked the councillors who had worked with him along the years and the residents of Birkirkara who had elected him. \nHe said he would work as president of the Central Region with more commitment while confirming he would continue to work within the PN. \nThe PN thanked him for his service and wished him well for further work within the Central Council and the party. ", "comment_count": 9, "id": 2316}, {"keywords": "Politics, Gender, Court", "author": "", "article_body": "The leader of Alleanza Bidla has joined forces with a concerned couple calling for the immediate withdrawal of a primary school workbook they claim is being used as a tool for “gender indoctrination”.\nIvan Grech Mintoff, in his capacity as “a citizen interested in all that takes place in the country”, together with Melvin and Jennifer Farrugia, have filed a judicial protest in the First Hall, Civil Court against the Minister for Education and Employment, his permanent secretary, the director general in the department of curriculum, lifelong learning and employability and the directorate for learning and assessment programmes.\nThey voiced “serious concern” over the workbook used in personal, social and career development classes for Year 4, 5 and 6 pupils.\nThe workbook, which the children are not allowed to take home, though purportedly intended to educate them about “facts of life” linked to their physical, psychological and sexual development, made “subtle” and “direct” references to gender orientation issues that were likely to bring “confusion” in such young minds, the couple and Mr Grech Mintoff argued.\nRELATED STORIESChildren's book helped expose abuse cases, ministry says\nWhoever designed the schoolbook demonstrated “lack of sensitivity” towards children of such tender age. The youngsters were not mature enough to fully grasp the implications such teachings could have upon their lives, the protest noted.\nExplaining “wet dreams” to 10-year olds and defining sexual orientation as “attraction to persons of the same or opposite sex” were aspects of the workbook that gave rise to serious concern, they continued, stressing that the matter was of direct interest to all parents concerned about the well-being of their children.\nThe judicial protest also questioned the raison d’etre behind a letter sent by the education authorities to heads of primary State schools in April 2018 who were “kindly asked to forward these workbooks directly to the peripatetic teachers of PSCD and not to class teachers due to the sensitive nature of the topics”.\nEven more worrying, they went on, was the fact that the workbooks were to be used solely in class, prompting them to question why the publication “was being kept away from parents who had a right to know what their children were being taught at school”.\nSuch attitude ran counter to “the right of every parent of a minor to give his decision with regard to any matter concerning the education which the minor is to receive”, as acknowledged by article 6 of the Education Act, which echoed the EU Convention on Fundamental Human Rights and five international treaties to which Malta was a signatory, the couple and Mr Grech Mintoff remarked in their judicial protest.\nReference was also made to a pronouncement by the European Court of Human Rights in a case against Denmark declaring that “The State is forbidden to pursue an aim of indoctrination that might be considered as not respecting parents’ religious and philosophical convictions. That is the limit that must not be exceeded.”\nIn the circumstances, they called upon the authorities to immediately withdraw the workbook and make adequate changes. Lawyer Michael Tanti-Dougall signed the judicial protest.", "comment_count": 84, "id": 2317}, {"keywords": "Migration, Maritime", "author": "", "article_body": "A surge in the number of crossings in the Mediterranean is being noticed, pointing towards an increase in human trafficking, Foreign Affairs Minister Carmelo Abela has warned. \nSpeaking during a meeting of EU foreign affairs ministers in Luxembourg on Monday, Mr Abela said a reduction in EU military surveillance in the central Mediterranean was making smugglers and traffickers more daring. \nIn a statement, the Foreign Minister said Mr Abela sounded the alarm bell on the absence of EU naval assets in the Mediterranean brought about security risks. \nThe EU set up Operation Sophia in 2015 in a bid to disrupt the business model of human smuggling and trafficking networks in the southern central Mediterranean and prevent the further loss of migrants’ lives at sea.\nMr Abela said the aerial operations being conducted as part of Operation Sophia are relatively ineffective to break the smugglers’ models. \nThe foreign minister said the surge in the number of crossings raised the risk of more tragedies in the Mediterranean.\nMr Abela insisted a reinforcements of aerial surveillance is warranted in the central Mediterranean route, even during the early mornings, when most of the departures happen, at least over the summer period. \nHe stressed that this being an EU-wide challenge, it is only through solidarity, as well as through a combined effort and responsibility-sharing by all stakeholders, that it can be addressed.\nThe statement said foreign ministers also discussed ways to improve the effectiveness of the EU’s Common Foreign and Security Policy (CFSP).\nNoting that, over the past years, the CFSP has been strengthened considerably, Minister Abela suggested that the EU should make better use of its leverage when it comes to interacting with third countries.", "comment_count": 1, "id": 2318}]