[{"keywords": "", "author": "Ramona Depares", "article_body": "As experts continue to sound the alarm about the crisis that risks killing the local farming industry, one lobbyist warns that Malta is losing all agricultural know-how and that “we are raising a generation of children who think that carrots grow in supermarkets”.\nJames Lupi Spencer, the founder of popular Facebook group Dilettanti tal-Agrikoltura, Siġar u Pjanti, pointed a finger at the lack of basic education in schools as one of the biggest reasons behind the increasingly discouraging difficulties being faced by the industry.\n“It may sound like an exaggeration, but I bet you that if you carried out a quick poll among young children, asking where carrots come from, many would reply: the supermarket. I hear this sort of thing on a daily basis. It is almost funny, except that it is sad,” Mr Lupi Spencer says.\nThe young amateur farmer blames this lack of basic knowledge on a system that is failing to equip students with practical information about our culture and indigenous industries.\n“I do remember being taught an amount of practical information when I was still at school. We were taught simple cooking using local ingredients, how to grow tomatoes and herbs at home... that sort of thing.\n“The idea was not to turn us all into farmers, of course, but to foster an appreciation of the agricultural process. This has all been lost today,” he says.\nMr Lupi Spencer also laments the readiness to import and buy produce from nearby countries like Sicily, which places an added strain on the flailing local industry.\n“It is a shame to see that so many automatically gravitate towards imported fruit and vegetables, with many not even being aware that when fruit travels a certain distance it loses a percentage of its nutrients and even taste. The produce with the least footprint tends to be the healthier, cheaper and more delicious.”\nMeanwhile Mr Lupi Spencer, together with a number of others, is doing his bit to support the industry through the Facebook Dilettanti group. It provides what he describes as a space for like-minded individuals to network and to exchange knowledge, whether they are full-time, part-time or even amateur farmers or gardeners.\nThe encouraging feedback has led to the birth of a sister Facebook page called Ixtri Online Mingħand Il-Bidwi Dirett. The public group offers a platform for those who grow their own produce to sell it directly to the consumer without the need of a middleman.\n“The problem of lack of transparency at the pitkalija persists,” Mr Lupi Spencer says. “This page is directly aimed towards eliminating the commercial and financial problems that the pitkali middleman system is creating for farmers.\n“Only last week, I was told of an incident where an entire truck of beautiful, fresh lettuce was sold for a ridiculous price. It’s obvious that a better-regulated system is needed if farmers are to survive.”\nHe adds that “everyone” is aware of the specific problems that beseige the farming industry, but “no-one wants to actually do something about them”.\nIxtri Online Mingħand Il-Bidwi Dirett seems set to redress the situation somewhat, having attracted a healthy number of regulars from both sides of the fence.\nA cursory scroll through the page reveals a wealth of local seasonal produce that ranges from potatoes to onions, marrows, strawberries, carrots, broccoli, oranges, cabbages and more.\nThe platform is open to all forms of produce, including eggs, honey, marmalades and jams, and even the ever popular limoncello liqueur.\nRead: 'L-Aħħar Bidwi' could be a reality in just 15 years \n“It is immediately evident that neither supply nor demand are lacking, and that all that is needed is an efficient and fair system,” Mr Lupi Spencer says. “But, of course, the problem needs to be tackled at source by the authorities.”\nThe lobbyist puts the success of the initiative down to what he describes as “fostering personal connections”.\n“It helps when people build a working relationship, and they know who they are dealing with. It’s the kind of atmosphere that encourages return clients,” he explains.\nThe page is peppered with colourful and enticing photos of produce, leaving no doubt in the mind of a potential customer about the quality on offer.\nAn added convenience that has also met with success is that some of the farmers offer deliveries to homes.\n“The will is there on both sides. Given education and proper regulation, the farming industry does not need to die out,” Mr Lupi Spencer concluded.\nThis is the second in a series of articles looking at different aspects of the local food industry. \nRead the first article. ", "comment_count": 23, "id": 2719}, {"keywords": "", "author": "Keith Micallef", "article_body": "A Yemeni man paid a hefty price for not declaring €14,000 he was carrying while transiting through Malta International Airport, as he ended up losing half of this sum to the Maltese authorities.\nMohammed Abdullah Ahmed Al-Wahaishi, 55, was arrested on Friday evening at Malta International Airport prior to boarding a Turkish Airlines flight to Istanbul on his way to Saudi Arabia, where he resides.\nPolice inspector Keith Vella told the court that the cash, which was found by customs officials in the defendant’s bag, comprised different denominations, though the bulk was in the form of 50,000 Saudi riyals (€11,800). \nFacing duty Magistrate Aaron Bugeja, the man pleaded guilty and apologised, insisting that this was a genuine mistake. Lawyer Mario Mifsud, who appeared on his behalf told the court that the man was not aware that cash control restriction in Malta were tighter than in Saudi Arabia.\nThe court fined the man €3,431, in line with the law which says that the penalty must be equivalent to a quarter of the overall sum. The defendant also lost another €4,000, which customs officials had confiscated at the airport.\nThis sum is equivalent to the excess over the €10,000 undeclared cash limit set by Maltese laws. ", "comment_count": 0, "id": 2720}, {"keywords": "", "author": "Keith Micallef", "article_body": "A 26-year-old man from Żejtun was granted bail against a deposit of €500 and a personal guarantee of €4,500 after pleading not guilty in a case of domestic violence. \nThe incident happened on Saturday afternoon when the defendant allegedly tried to assault his estranged partner and threatened her during an argument which began when he went to pick up their daughter. \nDuty magistrate Aaron Bugeja, who presided over the case, warned the accused not to approach the alleged victim, nor to set a foot in Marsa where she resides. He was also warned that any breach to the protection order issued against him in favour of his estranged partner could result in a jail term and a fine of up to €7,000.\nPolice inspector Oriana Spiteri prosecuted, while lawyer Lucio Sciriha was defence counsel.", "comment_count": 0, "id": 2721}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 2.46pm with PL reaction\nA magisterial inquiry is looking into documents containing his forged signature, Adrian Delia told party enthusiasts gathered at the party’s Mellieħa club on Sunday.\nHe called for the investigations to quickly establish whether there are links between the documents and money laundering allegations concerning him.\nThe Sunday Times of Malta had reported last December that the Financial Intelligence Analysis Unit had compiled a detailed report into Dr Delia, finding a reasonable suspicion of money laundering and flagging six-figure transactions they believe were linked to a Soho racket. Police investigators have now said that they may not be able to follow up the FIAU's work, saying the case may be \"too hard to crack\". \nDr Delia is alleging that his signature was forged on a number of financial transaction documents. He first made the allegation on Saturday evening, telling the media that he had handed the documents to the police. \nThose documents, he told party supporters on Sunday, were now the subject of a magisterial inquiry. \nEarlier on Sunday, Prime Minister Joseph Muscat advised Dr Delia to request a magisterial inquiry into money laundering allegations.\nDr Delia said the government was wrong in thinking that the PN leader or the party itself were going to be intimidated, noting that he had immediately headed to the Police Commissioner following the leak.\nThere he handed over evidence that his signatures had been falsified by third parties.\n“I will make sure that the truth will come out and we expose the spin and lies that are trying to silence myself and the PN.”\nThe Opposition leader insisted that whoever had truth on his side should never be afraid.\n“No one will intimidate me. Despite the continuous attacks on me and my family, with every passing day, I grow more convinced that the fight is neither mine nor the party’s. It is a fight for the truth, democracy and for all of you.\n“This government is reaching extremities that we haven’t experienced in years, he said,” he said.\nAfter months of the PN's insistence that the AG’s role of prosecutor and lawyer of the government, and head of the Financial Intelligence Analysis Unit was no longer tenable, the government had split the roles of Prosecutor and Attorney General, he said.\nThe changes appear to be similar to what had been proposed by a Nationalist government in May 2002, and rejected by the Labour Opposition at the time.\nDr Delia added that news about the constitutional amendment that will hive off functions of Prosecutor General from those of the AG will not blindfold the PN.\nThe government, he added, needed to implement all recommendations by the Council of Europe’s rule of law experts, known as the Venice Commission.\n'The PN was, is, and will remain in favour of life'\nThe PN leader also insisted that his party was totally against abortion adding that he had flagged the issue of safeguarding life during a European People’s Party summit in Brussels.\n“The PN was, is and will remain in favour of life from conception till its end,” he said, adding that he was later commended by the party’s candidate for President of the European Commission Manfred Weber for bringing up the topic.\nAccording to Dr Delia, the European socialist party was militating in favour of abortion, something that the Maltese government had tried to hide while changing laws in preparation for the introduction of abortion.\n“Our commitment is clear… We should not forget what this government is capable of. The threat is there, the government’s plan is clear, and the PN has to, together with people, continue safeguarding life till the end.”\nGovernment's lack of long-term plan\nThe government's lack of a long-term plan had led to traffic congestion, teaching students in containers, and gearing up the economy through a false surplus while the government operated with a deficit, Dr Delia said.\nAccording to EU data, Malta was the only place in the EU where salaries had decreased, because while pay increased slightly, cost of living had also increased, he added.\nRead: Minimum wage rise in Malta is lowest in Europe\n“Under a PN government, everyone was becoming owner of their house or had a roof over their head, while a socialist government is urging people to die earlier, get a loan and skip getting a pension.\n“The government is saying that our land is not ours, but it is that of foreigners whom we are importing to earn a living and then leave.”\nThe PN leader reiterated his call on the electorate not to remain at home and complain, but use the most precious tool they had and change the country’s direction.\n'Double standards and no credibility' - PL\nIn a reaction, the Labour Party said that Dr Delia's double standards were turning him into a worse version of his predecessor, Simon Busuttil. \nWhile he was quick to demand resignations \"for every little thing\", he kept refusing to subject himself to an investigation, the PL said. \n\"Adrian Delia should have called for an investigation into money laundering investigations. Instead he called for an investigation into how information about him was made public,\" the PL said. ", "comment_count": 32, "id": 2722}, {"keywords": "", "author": "", "article_body": "A 59-year-old woman who lives in Xewkija is in a critical condition following a traffic accident in Xewkija.\nThe police said the accident happened in Triq Santa Katerina at 4am. \nThe woman lost control of the Nissan Almera she was driving and crashed into a wall.\nShe was taken to Gozo General Hospital by accident and later transferred to Mater Dei by helicopter.\nAn inquiry is being held.", "comment_count": 0, "id": 2723}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 2.40pm with PN reaction\nPrime Minister Joseph Muscat has urged Opposition leader Adrian Delia to request a magisterial inquiry into money laundering allegations which he says have haunted the PN head for the past two years.\nFour months ago The Sunday Times of Malta reported how a London-based prostitution racket and the alleged involvement of Dr Delia were part of an ongoing money-laundering investigationby the police. Dr Delia had vehemently denied any wrongdoing.\nAddressing Labour Party supporters at Marsascala on Sunday morning, Dr Muscat said that while he would not get into the allegations that Dr Delia faced, insisting he would wait until investigations were concluded to comment, he urged the Opposition leader to go to a magistrate and request an investigation into the claims.\n“We are not like those who protested in the streets in an attempt to destabilise the country. We have always been consistent on this and so we will judge the Opposition leader when the investigations are concluded. But it would have been better had he asked for an investigation, just as I had done. After two years of allegations, Dr Delia should go to the magistrate himself and ask for an investigation,” Dr Muscat insisted.\nThe rule of law, he went on, was not something that one simply talked about but it is something that should be practiced and believed in.\n“I followed Adrian Delia’s press conference yesterday. He said that there were some journalists who asked him questions and he is saying that the documents were forged and that he has asked the police to investigate. I will not comment on this because I know what it feels like to have someone lie about you,” he noted.\nThe Sunday Times of Malta has reported that a year after the FIAU flagged a “reasonable suspicion of money laundering” by the Opposition leader, the police investigation has hit a brick wall.\nThe newspaper also said that a report by the anti-money laundering unit drafted in March 2018, concluded that sufficient information was available to conclude that Dr Delia and his bank account in Jersey “may have been used for money laundering”.\nAddressing a press conference on Saturday, Dr Delia announced he had asked the police to investigate documents that contained his signature and that he said were forged. While not describing the documents in further detail, Dr Delia said these had been brought to his attention around the same time he received questions from The Sunday Times of Malta.\nVenice Commission reforms\nMoving on to major events that took place throughout the week, Dr Muscat referred to the government’s decision to make amendments to the Constitution in line with recommendations by the Venice Commission.\n“After the Commission handed us the list of the suggestions, we realised that these were items that were put to scrutiny when Malta was to join the EU but which were never, at least publicly, questioned.\nRead: No precise timeline given for reform of judicial appointments\n“Now, years later, we are in this situation but that’s no problem. In less than 100 days since the recommendations were made, with special thanks to Justice Minister Owen Bonnici who worked tirelessly on this, we will start implementing changes suggested,” Dr Muscat told his supporters.\nHe argued that a number of the recommendations made by the Commission were already being put to practice even though they might not be written on paper.\nAir Malta accounts\nOn the announcement made on Saturday that Air Malta had registered a slight profit, Dr Muscat said this was no easy feat and the airline’s success was thanks to its workers.\nHe also commended the work of Tourism Minister Konrad Mizzi, his predecessor Edward Zammit Lewis as well as President Emeritus George Abela, who acted as the intermediary between the airline and workers’ unions.\n“Air Malta will become the airline of the Mediterranean. I am convinced that we will make it. But we’re not there yet. We still have a lot more to do,” Dr Muscat went on.\nProperty scheme for pensioners\nOn a government initiative urging pensioners to borrow money by putting up their property as a guarantee, the Prime Minister said that this was something that will further protect the elderly. Dismissing the Opposition’s criticism on the measure, Dr Muscat said that the scheme was already used by the private sector and that the government’s move would regulate the practice.\nHe went on to add that in the coming days, the Labour Party would be unveiling a number of proposals to ensure that there would be more women politicians. He insisted, however, that these proposals were not about quotas but about ensuring equality.\n“As the saying goes, if not us then who? If not now, when?” Dr Muscat added as he concluded this week’s speech.\n'No social compass' - PN\nDr Muscat's speech was dismissed by the Nationalist Party, which in a statement said the Labour government had no long-term plan for the country and had \"lost its social compass\". \nFigures showed that wages were down and inflation was up, the PN said, and workers were ending up squeezed from either end. ", "comment_count": 43, "id": 2724}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The government is not committing itself to a precise timeline on making changes to the way members of the judiciary are appointed, which could allow it to first fill vacancies with more appointments of those close to the party in power.\nIn a letter to the European Commission last week, following criticism over the lack of independence of various State institutions, Justice Minister Owen Bonnici gave details of the government’s plan for reforms.\nHe gave precise timelines on when changes are to be introduced to the offices of the Attorney General, the Ombudsman, the civil service and the police but refrained from doing the same on the reform of the judiciary.\nSince elected to office in 2013, Labour has made a number of judicial appointments of persons deemed to be friendly to the government. Most of the recent appointments of magistrates and judges are of people closely connected to the Labour Party, including that of Toni Abela, Labour’s former deputy leader, who was made a judge.\nOther appointments include the promotion from magistrate to judge of Antonio Mizzi, husband of Labour MEP Marlene Mizzi, despite being found in breach of the judiciary’s code of ethics; former Labour candidates Joanne Vella Cuschieri, Wenzu Mintoff, Joe Mifsud and Monica Vella; the former president of Labour’s Gozo branch Grezzju Mercieca; the daughter of former Labour deputy leader and now Speaker Anġlu Farrugia, Caroline Farrugia Frendo; and Consuelo Scerri Herrera, the sister of Environment Minister Jose’ Herrera, who also was found in breach of the code of ethics.\nMay allow the government to appoint more friends over the next two years, before the door closes\nThe current system, in use since the 19th century, through which the government appoints magistrates and judges, was declared by the Council of Europe’s Venice Commission as out of date and in need of immediate change.\nIn 2016, the government, with the consent of the PN Opposition, introduced a Judicial Appointments Committee to filter those who wished to be appointed members of the judiciary. However, the final say remains in the hands of the government.\nAsked to explain why the government has once again decided not to commit to a timeframe on the introduction of changes to the method of judicial appointments, and whether the government would freeze the current process until the new system is in place, Justice Minister Owen Bonnici failed to reply.\nRead: No timeline for Venice Commission reforms yet\nThe minister has been saying that he agrees with the need for change since his appointment in 2013.\nResearch conducted by The Sunday Times of Malta shows that in the coming two years, at least four judges of the Superior Court and one magistrate will have to be replaced. Another sitting judge will also move to a European appointment and is also likely to be replaced.\nThe lack of timeframe for changing the system may allow the government to appoint more “friends” over the next two years, “before the door closes through a new system”, one legal source told the newspaper.\nThe Venice Commission is recommending that appointments be made by a new Judicial Appointments Committee, composed of judges. Vacancies would be filled following a public call and on an order of merit decided by the committee. The appointment would be made directly by the President of Malta and the Committee’s decision would be binding.\nThe Chief Justice, currently selected directly by the Prime Minister, would also be chosen through the new system, according to the recommendations.\nMagistrates and judges put in place by Labour so far:\nJudgesAntonio MizziEdwina GrimaLawrence MintoffMiriam HaymanGiovanni GrixtiToni AbelaAnthony VellaConsuelo Scerri HerreraGrezzju Mercieca\nMagistratesAaron BugejaCharmaine GaleaJoanne Vella CuschieriJoe MifsudMonica VellaDonatella Frendo DimechCaroline Farrugia FrendoYana Micallef StafraceRachelle MontebelloSimone GrechAstrid May Grima\nTo be replaced next Judge Silvio Meli - April 2019Judge Noel Cuschieri - December 2019Magistrate Paul Coppini - October 2019Chief Justice Joe Azzopardi - April 2020Judge Tonio Mallia - November 2020Judge Joseph Zammit McKeon - March 2021Judge Joseph R. Micallef - March 2021\n ", "comment_count": 5, "id": 2725}, {"keywords": "", "author": "", "article_body": "The police are holding two men who were caught acting suspiciously near a car in Gżira early on Sunday.\nIn a statement, the police said the men were close to a car in Triq Sir William Reid.\nThey were carrying tools, allegedly stolen. The men were apprehended at around 2am.", "comment_count": 0, "id": 2726}, {"keywords": "", "author": "Keith Micallef", "article_body": "With no date yet set for a parliamentary debate on the “biodiversity destruction” caused by ongoing roadworks in rural areas, there are concerns that by the time the matter is on the agenda it will be too late.\nThe concerns were raised by two Opposition MPs who sit on Parliament’s Environment and Development Planning Committee. They recently made separate requests for a debate on the outcry in the wake of works in Wied l-Isqof and Il-Lunzjata in Rabat and Wied is-Sewda in the limits of Żebbuġ.\nThe controversy erupted after it transpired that vegetation was being obliterated during the concrete surfacing of country roads and lanes used by farmers.\nThe Environment and Resources Authority issued a stop and compliance order, however Times of Malta reported that last Monday works at Il-Lunzjata had nonetheless continued.\nOpposition MP Jason Azzopardi filed a request to Environment Committee chairman and Labour MP Alex Muscat on March 4 to debate the matter while denouncing the “biodiversity destruction”.\nDemocratic Party leader Godfrey Farrugia also tabled a similar request in which he expressed his concerns on what he described as physical alteration to valleys and changes to the water course’s profile. He remarked that valleys were subject to various EU directives on water and habitat and that the works could impact neighbouring protected Natura 2000 sites.\nBy the time the concrete works in valleys were debated, the damage would have been done\nContacted by the Times of Malta, Mr Muscat noted that the normal procedure was for the Committee to discuss and agree when to have such an item put on the agenda whenever it convened to discuss the next pending subject. Asked about the date of the next meeting, he said the Committee had yet to agree on a date.\nDr Azzopardi expressed his frustration that this was not an isolated incident. “We are yet to debate the revised fuel station policy, even though the request for such debate was tabled months ago,” he said.\nFurthermore, he expressed concern that by the time the concrete works in valleys were debated, the damage would have been done.\nDr Farrugia agreed, also questioning the decision to appoint Mr Muscat to head the Committee once he was also the Prime Minister’s deputy chief of staff. “This might pose a conflict of interest,” he said.\nCommenting on the controversial roadworks, he lamented that the ERA had not been consulted in advance.\n“Such roads need to be permeable not to affect the water table and leave enough room for vegetation at the sides to keep growing,” he added.", "comment_count": 8, "id": 2727}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Full-time clerical staff at many government schools will be provided by private employment agencies instead of being engaged through the usual recruitment procedure, Times of Malta is informed.\nThe move is aimed at filling school clerk vacancies that have been vacant for years, Education Ministry sources said.\n“There are 150 vacant clerical posts at various government schools, both at primary and secondary level, that were never filled over the past four years,” a senior government school official told Times of Malta.\nFarming out the service was preferred to issuing a call inviting qualified candidates to apply, he complained.\nThe ministry sources said clerks were deemed to be crucial in a school administration system and their quality normally determined how the place was run.\nPublic servants working in schools complained to Times of Malta the latest move could mean the people provided by the employment agencies might not be up to the standard required. \nThey noted that, in the past, only qualified personnel who would have successfully sat for an examination would be recruited.\n“We fear that the level of those joining our schools will be much lower that what we have now”, they said. Employment agencies making the cheapest offer would get the contract and that could well mean low-quality clerks, they continued.\nAn Education Ministry spokeswoman confirmed that contract workers would be engaged in line with rules precluding precarious work. Twenty-two assistant clerical support workers would be hired to serve at various State schools, she said, adding a call for tenders was published in the past weeks.\nThe authorities are well aware that these areas are poaching hotspots\n“The duration would be one year with the possibility of the contract being extended on the same terms and conditions,” the spokeswoman said. \nShe did not say why clerical staff members for State schools were not recruited according to normal Public Service Commission practices.\nIt is not known whether the contract workers will be offered the same conditions as the other clerks at State schools although the Education Ministry said they would not be in the same grades as clerical staff. \n“Assistant clerical support staff were being engaged and the ministry did not have employees in the same position,” the spokeswoman said.\nEducation officials said this latest move again demonstrated the lack of planning and direction at the Education Ministry. \n“Due to bad planning, we have already seen classes being replaced by mobile homes. Now we are seeing clerks being replaced by contract agents. \n“This does not augur very well,” a senior official remarked.", "comment_count": 41, "id": 2728}, {"keywords": "", "author": "", "article_body": "St Joseph tradition\nThe smell of żeppoli filled the air in Rabat on Tuesday, as the locality marked the feast of St Joseph. The traditional deep-fried choux pastry balls stuffed with ricotta are closely associated with the yearly celebration.\nWhat made the headlines\n\n‘Backlash at journalists following Panama Papers’: Malta is among a few countries where a backlash against journalists was recorded after the Panama Papers stories were published, according to a review of the impact of the massive documents leak. Issued by the Reuters Institute ahead of the collaborative journalism project’s three-year anniversary, the review shows that while nearly one in five countries or international bodies made “substantive legal, regulatory or policy changes” in the wake of the Panama Papers, nothing of the sort happened in Malta. The researchers recalled the car bomb that killed Daphne Caruana Galizia as one example of the backlash against journalists that ensued after the global journalistic investigation.\nGozo works start as ERA asks for studies: Extensive excavation works to turn a rural area in Xewkija into a park and ride facility and a bus terminus have started although planning permits have still to be issued, the Times of Malta revealed. The works in an area known as Tax-Xħajma, next to the horse racing track, form part of an EU-funded project aimed at building a multi-modal hub to ease parking problems on the island. An application submitted to the Planning Authority by the Gozo Ministry last October was still under consideration and the Environmental and Resources Authority has demanded environmental studies, building industry sources said.\nTurkish ‘village’ containers to be turned into classrooms: A construction firm, which a few weeks ago hit the headlines over plans to build a makeshift container ‘village’ in a quarry to host Turkish construction workers, is in pole position to turn some of its now ‘unused’ containers into classrooms for government schools. UNEC Ltd, a subsidiary of Bonnici Brothers, submitted the cheapest offer for a tender issued by the Education Ministry to buy mobile classrooms to host students in St Paul’s Bay and Żejtun. Sources said that once the company had to shelve its plans for a temporary container village, it turned its sights to the Education Ministry which needs mobile classrooms to cope with an influx in the population, particularly through migration.\nPN outlines cancer fight policy: More funds for prevention, early diagnosis and higher-quality treatment are the main proposals of a Nationalist Party policy document on the fight against cancer. Shadow health minister Stephen Spiteri presented 30 proposals to better respond to the disease during a news conference outside Mater Dei Hospital. The PN is calling for more investment to promote healthy lifestyles and for population-based prostate cancer screening. It is also proposing the use of EU funds to further cancer research among children, incentives for investment in cancer medicine and more funds for breast screening.\nDirector chased over €4m in unpaid taxes: The sole director of a cleaning firm that received more than €9 million in direct orders in three years owed the Inland Revenue Department over €4 million in unpaid taxes, the Times of Malta revealed. Records show that, in October, 2017, X Clean director Denis Xuereb had been asked through a judicial letter to pay over €530,000 in unpaid taxes. A few months later, Mr Xuereb, this time as director and owner of cleaning firm Euro Hygiene International Ltd, received another bill to settle €3.5 million in unpaid taxes.\nAttorney General to lose dual role: The Attorney General’s dual role as the government’s legal counsel and prosecutor general is to end as the government announced it will be splitting the roles in two separate entities. A Bill paving the way for the reform is expected to be presented to Parliament tomorrow and the government plans to enact the changes before the House rises for the summer recess. Justice Minister Owen Bonnici made the announcement in a news conference in which he outlined a series of reforms based on the recommendations of the Council of Europe’s Venice Commission.\nBrussels sees ‘lack of progress’ on corruption: Malta did not register any significant progress in the fight against corruption, the European Commission said. During a presentation on the Malta 2019 country report, an annual scorecard issued by the EU’s executive, European Commission deputy secretary general Céline Gauer said more work needed to be done in strengthening governance frameworks and enforcing anti-money laundering measures. Ms Gauer did note, however, there had been significant improvements in the staffing levels of supervisory authorities in the financial sector.\nWhat trended\n‘Too much of a good thing?’\nThis week saw Malta bid a sorry farewell to the only NGO solely dedicated to water conservation on the island.\nThe Malta Water Association’s parting shot – “the battle’s lost”, it said – was a damning indictment, Times of Malta readers broadly agreed.\n“If ever there was any proof needed that Malta is in a management crisis...this is it,” wrote Matthew.\n“When the time comes, I suppose we will start drinking concrete”.\nI suppose we will start drinking concrete\nMalta’s water table might be diminishing and growing more saline by the minute, but as Mark noted, “tackle the root cause, over-extraction”.\nAnd while unregistered boreholes continue to suck out whatever water is left beneath the ground undetected, Anthony reckoned the country’s general reliance on a different source of water had something to do with national apathy.\n“The reverse osmosis system has cut off people from the unpredictability of the water supply,” he argued.\n“In the bad old days, before the RO plants existed, lack of rainfall actually meant lack of water in the tap. So people could see the connection...today, people find water in abundance in the tap, whatever the weather.”\nA case of too much of a good thing?\nRipping up the rulebook\nYou can hardly blame developers for ignoring the rules if authorities do it too. The Times of Malta reported that a tract of land in Xewkija which the government wants to turn into a park and ride facility has already been excavated – despite no permits having been issued.\nRipping up the rulebook seems to be all the rage these days, which could perhaps explain why so many readers opted to focus on the dubious need for the project.\n“Park and ride??!! On a journey of maybe 4km,” wrote Christopher.\n“Just improve the bus service and cut out the need to ‘park’ and make it just ‘ride’.”\nIt was the first time Tom had heard of parking problems in Xewkija.\n“I think somebody was overeager to get EU funds,” he theorised.\nBut perhaps that’s too innocent an explanation.\nThere was another reason authorities might want to build such a facility “in the middle of nowhere”, Nigel suggested.\n“It’s very close to where the proposed tunnel is due to surface in Gozo. There’s some skulduggery going on methinks!” he wrote.\nWhat they said\n“The Nationalist Party would again have to step in to clean up the mess left by a Labour government.”\nNationalist Party leader Adrian Delia addressing a PN activity in Msida, where he said the Labour administration’s policies and lack of long-term planning took the country to the brink of disaster.\n“Today, more than ever before, our country is a symbol of peace, equality and a nation that welcomes everyone. We have always been this way and we will remain as such.”\nPrime Minister Joseph Muscat addressing Labour Party supporters in Siġġiewi.\n“Endless [economic] growth is a vicious cycle.”\nDemocratic Party deputy leader Timothy Alden writing in the Times of Malta about the continuous growth of the Maltese economy and the continued influx of foreign workers.\n\n“When looking into rule of law and democracy issues I’ve noticed that the relaxation of standards, especially among EU newcomers, can become quite a dangerous tendency.”\nAndrius Kubilius, former Prime Minister of Lithuania, who is running to be the next secretary general of the Council of Europe, speaking to the Times of Malta.\n\n“Russia has both a long history of disinformation campaigns and a political culture largely untroubled by concerns for truth.”\nColumnist Martin Scicluna writing an opinion piece in the Times of Malta entitled ‘Russian confrontation’.", "comment_count": 0, "id": 2729}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Sunday’s newspapers.\nThe Sunday Times of Malta says a year after the FIAU flagged a reasonable suspicion of money laundering by Opposition leader Adrian Delia, the police investigation has hit a brick wall. In another story, it says Finance Minister Edward Scicluna is under pressure to sign a permit that would allow a member of Dubai’s ruling family to buy the project to build hundreds of apartments on the site of the former Mistra Village tourist complex in Xemxija. The newspaper also says that Malta’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation, with the government now scrambling to push up its final score before the summer deadline.\nThe Malta Independent on Sunday says only two people were charged with drink driving on St Patrick’s day.\nMalta Today says Prime Minister Joseph Muscat has a 2020 exit date.\nIllum says that two thefts are carried out in homes daily.\nIt-Torċa says Air Malta makes a profit of €1.2 million after 18 years.\nKullħadd also leads with a story on Air Malta’s profit.\nIl-Mument says the leader of the Opposition has requested an investigation into persons who falsified his signature.", "comment_count": 1, "id": 2730}, {"keywords": "", "author": "Denise Grech ", "article_body": "“Unjust policies” that leave migrants in limbo over their future is causing them to turn to drug use, a new study has revealed.\nThe study found that many homeless migrants are being kept at Mount Carmel Hospital out of humanitarian goodwill or provision of care, “despite the high risk of institutionalisation”.\n“Systemic neglect” of migrants could lead to the incarceration or continued hospitalisation of individuals, the study warned.\nThe study was conducted by the Foundation for Shelter and Support to Migrants and the Richmond Foundation who interviewed both substance users and professionals who worked with the migrants. As a result of the study, over 100 migrants and professionals have been given training or support.\nRead: Alone and invisible - a hidden, harsh reality of migration\nFindings pointed to a “great recidivism problem”, with migrants facing mental health challenges being admitted to Mount Carmel only to fall into a recurrent pattern of discharge and readmission.\nThe main risk associated with repeated relapse is the inability to obtain legal status. Having no access to decent housing is also seen as one of the most limiting challenges inhibiting recovery.\nThe majority of users who were released from Mount Carmel hospital or prison were either homeless or struggling to find dignified accommodation, the report noted.\nThe precarious living situations may even significantly increase the risk of mental health deterioration and relapse.\nExperts in the field also point towards “dramatic” space saturation at government open centres for migrants and homeless shelters. This also led to poor mental health, the report noted, adding individuals who had not been given a refugee status were struggling to find accommodation. These individuals were also at risk of additional barriers to accessing services and rights, the report added.\nThe lack of staff in governmental institutions meant that professionals could handle only selected or severe cases.\nProfessionals who participated in the study said a major difficulty in helping the migrants was referral to mainstream services. This was typically lengthy and complex, and “often for nothing”, one participant lamented.\nProfessionals also lamented they had to deal with the policy limitations that are faced by the migrants.\nThe lack of availability of translators and interpreters was also a major problem for professionals to work with their clients, develop care plans, and support clients to commit to these plans.\n“It impacts my work greatly since the language barrier is a huge boundary in service provision and it’s hard to establish therapeutic rapport in this case and formulate a rehab programme,” one participant said.\nConcluding the report, the Foundation for Shelter and Support to Migrants said the findings would not be effective unless there was an equal effort to create policies that were just and effective in promoting the support and long-term inclusion of migrants in society.", "comment_count": 0, "id": 2731}, {"keywords": "", "author": "Ivan Martin", "article_body": "A year after the FIAU flagged a “reasonable suspicion of money laundering” by Opposition leader Adrian Delia, the police investigation has hit a brick wall. \nThe Sunday Times of Malta can confirm that a report by the Financial Intelligence Analysis Unit drafted in March 2018, concluded that sufficient information was available to conclude that Dr Delia and his bank account in Jersey “may have been used for money laundering” (see details below).\nHowever, senior police sources explained that although the intelligence report handed to them this time last year had recommended a criminal probe, this had been left on the back burner for several months as the case was deemed too difficult to crack and not as pressing as other matters.\n“We do not have great hope for this investigation. We opened inquiries into the report’s findings. However at this point it depends largely on other jurisdictions – some of which are very secretive – handing over the necessary information, as well as probing a 15-year-old prostitution racket which allegedly operated in another country,” the source said. \nFour months ago The Sunday Times of Malta reported how a London-based prostitution racket and the alleged involvement of Dr Delia were part of an ongoing money-laundering investigation by the police.\nThe allegations against Dr Delia, which date back to the period between 2001 and 2004, had first been reported by the late Daphne Caruana Galizia, about two months before she was killed in a car bomb explosion outside her Bidnija home.\nDr Delia has vehemently denied any wrongdoing and insists his involvement was limited to that of a legal advisor and representative for other Maltese nationals involved. \nThe Sunday Times of Malta has now learnt that the 30-page FIAU report details how the FIAU had received corroborating information around the time Ms Caruana Galizia’s had first exposed the matter on her website Running Commentary back in 2017. \nWhat the FIAU found on Adrian Delia\nA tip-off received by the FIAU in 2017 indicated that a Barclays account in Jersey owned by Dr Delia could have been associated with a Soho prostitution racket and used to launder illicit gains.\nThe Sunday Times of Malta can confirm that the FIAU then conducted an in-depth analysis of Dr Delia’s offshore Jersey account, gathering information from several jurisdictions, including Malta, the UK, Switzerland, the Bahamas, the British Virgin Islands and the Marshall Islands. \nIn a nutshell, the unit found that Dr Delia’s account – which he has repeatedly denied having any recollection of – was opened in February 2001 and closed in October 2004. \nGraphic: Design Studio\nWhile it was open, some £346,000 (around half a million euros) were deposited into the Jersey account in the form of varying cash and cheques which were made directly through branches around London, predominantly the Edgware Road branch, but also via a number of other locations.\nIt was this activity, together with Ms Caruana Galizia’s reporting, which prompted the FIAU to look a little deeper. \nRead: Delia claims his signature has been forged\nIt remains unclear exactly what happened between the years 2001 and 2004. However, FIAU investigators believe two Maltese nationals, Emanuel and Eve Bajada, were involved in a dispute over money that was supposedly deposited in Dr Delia’s Barclays Jersey account for the benefit of two mysterious companies – Healey Properties Ltd and AAS Freight Services Ltd – believed to be owned by their relatives, Eucharist and Mary Bajada.\nEmanuel and his son Victor Bajada were in 2005 accused of human trafficking and running a brothel in Malta. Emanuel pleaded guilty and his sentence was later confirmed by the Criminal Court of Appeal in September 2016. He was also separately charged with money laundering on the same case and found guilty.\nMs Caruana Galizia’s allegations that Emanuel and Eve Bajada deposited funds into Dr Delia’s Barclays account in Jersey were confirmed through account statements made available to the FIAU investigators.\nThe amounts deposited, however, were not £20,000 per month as had been reported by Ms Caruana Galizia but mostly varied from £400 to £16,000 per deposit (an average of £13,000 per deposit).\nIt was this revelation – that the deposits into Dr Delia’s account were not fixed monthly rates and were therefore not believed to have been rent payments – which is considered one of the main revelations of the FIAU probe.\nThe average amount deposited was also believed to be too high to be a rent payment in the early 2000s.\nMost of the money deposited into Dr Delia’s Jersey account was in cash or cheques and came from branches around the Soho area – which is known to be linked to prostitution and brothels. \nDr Delia’s Jersey account and Healey Properties Ltd’s bank accounts with Bank of Valletta shared the same Birkirkara address.\nAll the transactions in and out of the account appeared to be linked with the Bajadas and the properties supposedly owned by Healey Properties and AAS Freight Services Ltd.\nThe Swiss connection and BOV\nMoney from Dr Delia’s Jersey account was sent to two mystery Swiss bank accounts.\nAround £158,000 was transferred to one Swiss Barclays account across eight payments, however it was unclear who owned this account and why the money was moved there.\nThe investigators found that another £60,000 was transferred to a separate Swiss Barclays account in two payments. Intelligence gathered by investigators suggests that this money was then moved on to a certain Roxanne Arlettaz, believed to be a Swiss fund manager. However at that stage the trail goes cold and it remains unclear where this money moved next.\nInvestigators meanwhile found that other funds from Dr Delia’s Jersey account were also transferred to Bank of Valletta accounts held by Healey Properties Ltd.\nThe company held eight BOV accounts and investigators do not exclude that it also held other bank accounts in more secretive jurisdictions.     \nThe funds from Dr Delia’s Jersey account were then transferred from Healey Properties Ltd’s Sterling account held with BOV to the company’s Maltese Lira accounts at the same bank.\nA number of cheques totalling Lm106,200 (roughly a quarter of a million euro) were then issued in favour of beneficiaries who are related to Eucharist Bajada (senior), Eucharist Bajada (junior) known as Kris, and Dr Delia. \nAlthough the FIAU concluded that Dr Delia and his bank account in Jersey may have been used for money laundering, it pointed out that due to the sensitivity of the case it had limited its requests for information.\nThis, sources informed The Sunday Times of Malta, was because of the risk of politicians being alerted to their inquiries.\nThe fallout and Dr Delia’s side of the story\nDr Delia has consistently denied any allegation of wrongdoing, and on Saturday called a press conference in which he said that a number of documents related to financial transactions with his signature on them had been forged. \nThe PN leader said he had been made aware of the alleged forgeries after receiving questions about the FIAU investigation from The Sunday Times of Malta.\nThe Soho matter had been raised by the PN’s ethics committee, which had been given 48 hours to probe the allegations, during the party’s 2017 leadership race.\nIn its conclusions, the committee noted that Dr Delia had not given an explanation on certain “unverified and pending issues” related to the Jersey account, particularly its use, scope and the legality of the source of the funds.\nFor this reason, the PN administrative council had called on Dr Delia to consider withdrawing from the contest.\nSince then, Dr Delia has gone on record to insist he knew nothing about the bank account in Jersey.\nHe had said he did not remember ever having a Barclays account in Jersey he said he was not able to exclude this possibility entirely. \nAt the time Ms Caruana Galizia had published a document supposedly proving the existence of his jersey account, Dr Delia had phoned Barclays International’s call centre late at night to enquire about the matter.\nAccording to a recording of this call, which had been made available to The Sunday Times of Malta, no record of such an account was found.\nPeople involved in the case:\nThe Sunday Times of Malta is informed that the people investigated were Adrian Delia, Eucharist Bajada, Eucharist Jr. Bajada, Mary Bajada, Emmanuel Bajada, and Eve Patricia Bajada.\nHealey Properties Ltd, incorporated in the Bahamas back in 1999, was also indicated in the investigation. According to the company’s BOV accounts, Healey Ltd was registered at Aladan, Triq Karm Zerafa, and Birkirkara. It is believed to be owned by Eucharist and Mary Bajada.\nAnother company owned by the two Bajadas, AAS Freight Services Ltd, incorporated in Marshall Islands, was also a part of the investigation.\nMoney in and money out of Dr Delia’s account\nInformation obtained from the FIU in Jersey showed that between 2001 and 2004 the following funds were deposited in Dr Delia’s Jersey account:\n\n£331,000 from Healey Properties (Believed to be owned by Eucharist and Mary Bajada)\n£146,000 from ‘Edgware Road’ in 18 separate payments\n£56,000 from ‘EJ Beckett’ in 10 different deposits\n£34,728 from ‘Soho Square’ in seven separate deposits\n£30,964 from ‘Eve Bajada’ across six deposits\n\nFunds remitted from Dr Delia’s Jersey account:\n\n£158,000 to a Swiss Barclays Bank account across eight payments\n£91,568 to Healey Properties Ltd across seven payments\n£60,000 to another Swiss Barclays Bank account across two payments.Intelligence gathered by investigators suggests that this money was then moved on to a certain Roxanne Arlettaz who is believed to be a Swiss fund manager\n£40,000 to ‘E&M Bajada’ across two payments into two separate Jersey accounts\n\nThe two accounts were held by Eucharist Bajada and Mary Bajada and date back to the 1990s. While one of these was mostly dormant and is now closed, the other is still open today with a balance of more than £460,000.", "comment_count": 199, "id": 2732}, {"keywords": "Gozo", "author": "", "article_body": "President Marie-Louise Coleiro Preca, last Sunday paid a visit to the Victoria Scout Group where she met the Scout Group, the Group Council, the Chief Scout, the Group patron and parents. As a farewell gesture before the President ends her term of office, the group presented €2,500 to Dr Coleiro Preca towards the Malta Community Chest Fund. The day before, on Saturday, the Group organised two fundraising activities – a football tournament at the Don Bosco Oratory and a FIFA 19 Playstation tournament at its headquarters. The funds collected from these events, together with a sum of €1,000 by the Group, were presented to the President on Sunday. Later in the evening, the President attended a dinner with the Group council and Scout leaders at their headquarters in Victoria. The President is seen here signing the visitors’ book in the presence of, from left, Victoria Group Scout leader Lorrie Saliba, Chief Scout George Cassar, Chief Commissioner Anton Pisani and Victoria Scout Group council chairman Michael Grech.", "comment_count": 0, "id": 2733}, {"keywords": "Gozo", "author": "", "article_body": "The parish church of Fontana is undergoing a restoration project on its facade, the bell tower and the church parvis. The project is part financed by the European Union after appeals by the current parish priest John Muscat and previous parish priests. The chruch, built in 1905, was showing signs of deterioration on its facade and the bell tower and many were those who voiced their concern regarding the safety of the church, which is dedicated to the Sacred Heart of Jesus. The project costs €223,528.\nThe parish will be forking out €52,285.54. €23,180.16 were already collected, but the sum of €48,252.07 is still to be funded. Fr Muscat would like to thanks all those who already gave their contribution. He is now appealing to all parishioners and other benefactors to make their contribution to see the project through.", "comment_count": 0, "id": 2734}, {"keywords": "Gozo", "author": "", "article_body": "The feast of the Holy Family was celebrated at the Ta’ l-Ibrag Hospital at Gozo General Hospital last Sunday. Hospital chaplain Fr Giovanni Curmi celebrated Mass, which was attended by Gozo Minister Justyn Caruana and Gozo General Hospital CEO Joe Fenech, among others. Before Mass, 31 bandsmen from various band clubs played marches along the hospital rounds on the initiative of Carmelo Bigeni. A reception followed.", "comment_count": 0, "id": 2735}, {"keywords": "Gozo", "author": "", "article_body": "The Ċittadella was lit by thousands of flickering lights on Saturday week in the first edition of the Lejl Imkebbes festival hosted by the Gozo Ministry. Around 10,000 people turned up for the event, which was supposed to be held in November but was cancelled due to bad weather. Around 30,000 candles lit up the bastions and formed designs in the narrow streets and squares of the Citadel. The event also included historic re-enactments, live entertainment by the Malta National Children’s Choir, singer Jasmine Abela, Cherif Mbaw of France, Klinsmann Coleiro and Band, DCapitals and The Busker, and children’s activities. Museums opened until late for free.", "comment_count": 0, "id": 2736}, {"keywords": "Gozo", "author": "", "article_body": "A Symphonic Opening was the first musical event in the 13th edition of Gaulitana: A Festival of Music, held at the Gozo Cathedral. The event featured the Malta Philharmonic Orchestra under the direction of Mro Colin Attard.\nThe overture from Rossini’s Il Barbiere di Siviglia opened the concert, while Schubert’s en­chanting Unfinished Symphony brought the concert to an end.\nThree highly expressive lyrical works – Ravel’s Pavanpour une infante defunte, Colin Attard’s Lejn Ħajja Aħjar from the soundtrack to the video film Leħen mill-Kwadru and Vaughan Williams’s The Lark Ascending – were also performed.\nThe last two works featured MPO’s solo violinist Marcelline Agius, who is celebrating her 25th anniversary as leader of the orchestra and Attard’s work dedicated to Ta’ Pinu Sanctuary which this year is marking the 400th anniversary of the titular painting of Ta’ Pinu.", "comment_count": 0, "id": 2737}, {"keywords": "Education", "author": "", "article_body": "Nineteen fifth form students will this summer be given the opportunity to work with researchers at the University of Malta’s Faculty of Science conducting studies in areas such as plant ecology, insect studies and beekeeping, chemistry, quantum physics, geosciences, physical oceanography, statistics and operations and marine science.\nThis was announced at the recent launch of the third edition of the GO4Research student internship programme run by the University of Malta’s Faculty of Science in collaboration with the Directorate for Learning and Assessment Programmes (DLAP).\nThe launch was attended by 75 fifth form students from various secondary schools who had taken part in the Malta Junior Science Olympiad, accompanied by their educators.\nThe event was addressed by Education Minister Evarist Bartolo, University Pro Rector Prof. Saviour Zammit, Faculty dean Prof. Charles V. Sammut, Director of Curriculum Management Gaetano Bugeja, and the researchers who will supervise the students’ internships.\nAlso launched at the event were the GO4Research Awards Scheme for the best research project poster presentation, sponsored by the HSBC Malta Foundation.", "comment_count": 0, "id": 2738}, {"keywords": "Education", "author": "", "article_body": "A group of Form 4 students from St Margaret College Senior Secondary School, Verdala, Cospicua, recently went on a cultural excursion in Valletta organised by their teacher Martin Azzopardi in collaboration with History Department teacher Joanne Dalli. They visited Our Lady of Victory Chapel and the Malta National Community Art Museum (MUŻA) at the Auberge d’Italie in Merchants Street, Valletta. The excursion enabled the students to view architecture and various work of art by Maltese and international painters and sculptors of the Baroque and Modern eras. Mr Azzopardi commented: “It is thanks to such opportunities that students can come in touch with our Maltese heritage and understand the meaning behind the works of art, making them critical thinkers, not just viewers.”", "comment_count": 0, "id": 2739}, {"keywords": "Education", "author": "Melanie Darmanin", "article_body": "Children are nowadays exposed to a wide range of digital technologies. A quick look around the home or during social events confirms how often children spend time on such devices.\nA variety of terms such as ‘digital natives’, ‘digikids’ and ‘screenagers’ are constantly used to describe today’s children. A recent study which I conducted has shown the extent to which children are exposed to digital technologies on a daily basis. A good number of children as young as seven have access to their own personal devices such as a mobile phone and tablet.\nIt goes without saying that reading and writing are changing with the influx of new information and communication technologies. My doctoral study showed that definitions of reading and writing now include physical interactions with texts.\nChildren are nowadays observed scrolling, touching and swiping while reading. This was evident through numerous observations conducted during the ‘One Tablet per Child Pilot Project’. The observations showed that when students read and write through the media of digital technology they interact, collaborate and communicate more among themselves.\nToday’s children are engaging in skim reading, viewing, reading of images and symbols, multi-directional reading as well as audio reading\nReading in the 21st century entails the use of a variety of skills. Today’s children are engaging in skim reading, viewing, reading of images and symbols, multi-directional reading as well as audio reading.\nWhat it means to be a writer is also changing, with students claiming that digital technology promotes and distinguishes between ‘formal’ and ‘informal’ writing.\nA child would, for example, write in a short, abbreviated form while chatting with a group of friends and write skilfully when working on homework tasks. This shows that children nowadays are aware of ‘proficiency judgement’ and adapt their writings according to the audience reading their work.\nThis suggests that students are learning to respond differently when they are asked to carry out written tasks on screen as opposed to paper-based resources.\nChildren’s writing on screen is moving from the production of printed text towards a more complex notion of ‘design’. They are nowadays sharing information through various modes and methods, such as recorded speech and videos, photos, screenshots and also through collaborating on virtual walls.\nChildren have further showed that reading and writing on screen proves to be more fun and stimulating as these seem to be directly linked to multimedia features. It can therefore be argued that educators as well as parents need to fully acknowledge how processes of children’s reading and writing are changing in the digital age.\nAs a mother myself I form part of numerous groups on social media related to children’s upbringing and education and I feel that a lot of weight is constantly given to the downsides of technology. But I believe there are numerous advantages when children are diligently exposed to reading and writing on screen but this is only appreciated through an understanding of what reading and writing are coming to mean.\nIt is only through such an understanding that children will be supported and encouraged in their reading and writing skills to reach their full potential as they academically grow in the 21st century.\nMelanie Darmanin is a senior lecturer at the Malta College of Arts, Science and Technology (Mcast)’s Institute of Community Services, Paola. This article is based on the doctoral research Dr Darmanin conducted recently on children’s use of digital technology, focusing on reading and writing in the digital age.", "comment_count": 0, "id": 2740}, {"keywords": "Education", "author": "", "article_body": "As part of the process of renewing its strategic plan for 2019-2021, the Malta College of Arts, Science and Technology (Mcast) recently held a consultation meeting with representatives of various entities and other people who work closely with the college.\n\nDuring the meeting, which was held at Esplora interactive science centre in Kalkara, presentations were delivered by Education Minister Evarist Bartolo, permanent secretary at the Education Ministry Frank Fabri, Mcast board of governors president Frederick Schembri and college principal Prof. James Calleja (right).", "comment_count": 0, "id": 2741}, {"keywords": "", "author": "", "article_body": "Updated at 8pm with Labour reaction \nOpposition leader Adrian Delia has asked the police to investigate documents containing his signature which he says were forged. In a press conference held on Saturday evening, Dr Delia said that forged documents concerned alleged activity of his dating to around 15 years ago.\nHe did not describe the documents in further detail, although in a letter sent to police commissioner Lawrence Cutajar and seen by Times of Malta, Dr Delia said that the documents \"were used to conduct financial transactions\". \nDr Delia told the press that the documents had been brought to his attention at around the same time The Sunday Times of Malta had sent him questions related to claims that the Financial Intelligence Analysis Unit had investigated him. The Sunday Times of Malta has reported that the FIAU had opened an investigation into suspected money laundering breaches by Dr Delia, in relation to work he did as a lawyer back in the early 2000s.\nDr Delia has vehemently denied the allegations, insisted he knew nothing of that investigation and called on the police commissioner to question him. \nIn his letter to the police commissioner, Dr Delia asked commissioner Cutajar to tell him whether he had a copy of the alleged FIAU report. \n\n\n\n\"It is being alleged that this report was handed to the police one year ago, in May 2018,\" he wrote. \"But as you know, I was never asked for an explanation or declaration\".  \n\"In light of these allegations, I ask that you investigate any ties between the falsified documents I am enclosing and the allegations in questions sent to me yesterday [by The Sunday Times of Malta].\" Dr Delia questioned the timing of the questions, saying they had come \"just a few hours\" after he had accused the government of seizing control of key institutions, including the police force. \nHe reiterated that he had never been involved in any money laundering activity and had always acted in good faith as a lawyer.“It is clear that someone wants to intimidate me and my family,” he told the press.\n'Delia has no credibility' - PL\nThe Labour Party said it had taken Dr Delia almost a year and half since allegations linking him to money laundering had been published. \nThose claims had been brought to light by Daphne Caruana Galizia, who ran a series of articles about Dr Delia linking him to a racket based in London's Soho district. \n\"Had Adrian Delia called for an investigation into himself when many were calling for one, we might have known the truth by now,\" the Labour Party said on Saturday.\n\"For months, he based his political arguments on leaked FIAU documents and newspaper articles,\" the PL continued. \"Now he is asking the police commissioner to investigate the same sources of information which he used to his advantage and to call for resignations\".  ", "comment_count": 73, "id": 2742}, {"keywords": "", "author": "Denise Grech ", "article_body": "Parents of children with disability are concerned the education sector is not equipped to handle them, with the Commission for the Rights of Persons with Disability reporting a “sharp increase” in education-related complaints\nThe amount of complaints lodged by the end of last week was almost half the total for the whole of 2018, a Commission spokesperson told Times of Malta. \nThe commission’s investigations unit had received about 82 education-related complaints last year, the spokeswoman said, adding that 33 new cases were now being investigated.\n“The increase might be due to people with a disability becoming more aware of their rights and also because of the commission’s role as a regulator for the rights of people with a disability,” the spokeswoman noted.\nParents who spoke to the Times of Malta on condition of anonymity said mainstream schools were ill-equipped to handle children with disability.\nIt felt as though such children did not have a voice, one parent said. Certain teachers were not trained to work with such cases, putting them at the back of the class and virtually segregating them, the parent added.\nThe commission spokeswoman said the cases brought to their attention varied considerably.\n“The majority of complaints are by parents who feel that not enough support is being given to their child,” she pointed out. \nRead: LSAs are having to lift an average of 27kg a day, union complains\nEducators, on the other hand, claimed they were not being given the necessary backing and resources to provide the required sort of support, she added.\n“The commission does not shy away from taking matters further should the need arise and, if necessary, it will also pursue the matter before the courts,” the spokeswoman said.\nThe Education Ministry insisted when approached about the matter that National School Support Services and the Directorate for Educational Services were focusing on outreach in schools.\nA ministry spokeswoman said there were learning support educators who were trained to assist students with disability in almost every school. Should issues on supporting these students arise, the head of the Department for Inclusion could be contacted and if more specialised support was re-quired, teachers were also able to reach out to education officers, she said.", "comment_count": 5, "id": 2743}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated Sunday 10.50am, adds statement by Chamber of Architects and Civil Engineers\nThe possibility of trading airspace near village cores for further development rights in other localities was “just a concept” but appears to have gone down well with the government, according to the planning consultant who floated the idea.\nStephen Farrugia told the Times of Malta developers wanted to trade development projects near quaint town and village cores for better deals on construction projects in other areas.\nThe idea was suggested during a meeting between Prime Minister Joseph Muscat and the Malta Developers’ Association on Wednesday.\nMDA head Sandro Chetcuti said a new technical committee had been drafting proposals aimed at encouraging developers not to build in Malta’s remaining unspoiled urban areas. “Our towns and villages are disappearing and this is something we want to act against,” he told Dr Muscat, who welcomed the thought of an innovative solution for the construction lobby.\nDelving deeper into the proposal, Mr Farrugia, a former Malta Environment and Planning Authority director and a former president of the Chamber of Architects and Civil Engineers, said the issue of “stock trading” was based on a system used overseas to protect iconic urban areas from unwanted construction.\nRead: Din L-Art Ħelwa clashes with MDA over 'trading' proposal \nIn a nutshell, the proposal would see the airspace of a property near a village core purchased by a developer who would not build the permissible five storeys on that land. Instead, that development potential would be transferred to another project in a more built-up neighbourhood.\nDevelopers said the urban airspace could also be purchased and offset against dues on large construction projects, such as planning gains.\nArchitects and engineers should be made to self-regulate\nMr Farrugia said he had first explored the idea when he was reading for a post-graduate degree a few years ago. He had suggested the concept to a previous administration but said interest was minimal.\nThe same, however, could not be said of Dr Muscat whose face, Mr Farrugia noted, seemed to light up at the mention of a planning solution.\nDuring Wednesday’s meeting, which the press was allowed to attend for just the first few minutes, Dr Muscat said he was not averse to the idea but added this would have to be studied and carefully thought out.\nThe value of land in different parts of the island varied greatly, he said.\nPublic consultations would have to be carried out and he urged other stakeholders to engage with the government if they too had proposals on such issues. \nMr Chetcuti made the case for self-regulation of the construction industry, something he has long been calling for.\nIn particular, the MDA believed that architects and engineers should be made to self-regulate in much the same way medical practitioners abided by a set of rules.\nShould they violate the rules, they would appear before the Medical Council, Mr Chetcuti noted.\nDr Muscat said he agreed in principle, adding self-regulation could not mean deregulation.\nArchitects are self-regulated\nThe Chamber of Architects and Civil Engineers said the profession has been self-regulated since 1919, reinforced by the establishment of the Chamber in 1920.\nThe profession has a Code of Professional Conduct, which all warrant holders were duty-bound to adhere to. Reports of misconduct were taken very seriously, duly investigated, and, depending on the case, could result in the suspension or revocation of a warrant.\nDevelopers and contractors, on the other hand, were not regulated at all. The chamber welcomed the MDA's stance in favour of regulation of the industry, which position was aligned with that which the chamber had been advocating for many years.\nThe industry was one of the pillars of the economy, and as such it was essential that the highest standards were demanded and achieved.", "comment_count": 158, "id": 2744}, {"keywords": "", "author": "Denise Grech ", "article_body": "There are no plans for Malta MedAir to become a fully-fledged airline, Tourism Minister Konrad Mizzi said on Saturday.\nEarlier this week, Times of Malta reported how Air Malta staff was concerned that MedAir would be taking over certain operations from Air Malta while shrinking the national airline’s business.\nA move to launch a new helicopter service between Malta and Gozo accentuated concerns, with Air Malta staff citing it as a concrete example of how MedAir, run by former Malta Tourism Authority CEO Paul Bugeja, could threaten the national airline.\nAsked about the issue on Saturday, Dr Mizzi said there were no plans for the new company to offer services in direct competition with Air Malta. \nHe confirmed that MedAir would be providing a Malta-Gozo helicopter service but insisted the only reason the company was recruiting technical staff was because it needed to acquire certification required for its operations to be code-shared.\nA code-share agreement is a common aviation agreement whereby airlines agree to sell each other's tickets on some routes.\nAir Malta was \"demanding\" that MedAir obtain IOSA (IATA operational safety audit) accreditation, he said. Part of the requirement for it to obtain the accreditation was the recruitment of more technical staff, Dr Mizzi added.\nDr Mizzi was speaking on the fringes of the airline's annual general meeting where it announced a profit for the first time in almost two decades.\nEnemed bills 'commercially sensitive'\nAsked to clarify the amount Air Malta owed Enemed in unsettled fuel bills, the airline's chairman Charles Mangion said the agreement with Enemed was \"being addressed fully\".\nDr Mangion refused to clarify the amount of unsettled fuel bills, saying details were commercially sensitive.", "comment_count": 21, "id": 2745}, {"keywords": "", "author": "", "article_body": "Mater Dei Hospital is expected to significantly cut its carbon dioxide emissions this year after replacing 14 air-cooled chillers with higher-efficiency ones which require less gas to cool the air.\nThe replacement project saw engineers swap out old chillers which were installed when the hospital first opened with new ones over two phases, with seven chillers swapped out in each phase.\nApart from the significant emissions reductions – the equivalent of installed more than 3,700 300Wp-rated photovoltaic panels – replacing the chillers is also expected to cut the hospital’s electricity bill by around €1.1 million every year.  \nAir-cooled chillers are used to control air temperatures throughout Mater Dei’s 300,000 sqaure metres of space.\nThe project, which began last year, will cost €6.5 million when maintenance costs for the new chillers over a 15-year period is factored in, the Health Ministry said.\n“The ministry takes pride in pushing forward a greener agenda that will guarantee a healthier environment to benefit us all,” said Health Minister Chris Fearne.\n“We see this as part of our mission firmly believing that prevention is, was and will remain better than cure.”\nMater Dei Hospital is now working to replace two water-cooled chillers and one water chiller with newer models, the ministry said.\nCorrection: A previous version of this article stated that the hospital opened in 2003, rather than 2007.\nMinister Fearne is given a tour of the new equipment.", "comment_count": 7, "id": 2746}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Agreements with reputable credit rating agency Fitch to assess the state of Malta’s finances were published this week with details on the fees paid redacted.\nFinance Minister Edward Scicluna tabled in Parliament copies of the agreements with Fitch by both the Nationalist and Labour administrations in reply to a request by Nationalist MP Simon Busuttil.\nThe agreements note that the credit rating exercise was being sought by the Maltese government and that it was based on information supplied to the agency by the government.\n“Fitch is not your adviser and is not providing you or any other party with any financial advice or any legal, auditing, accounting, appraisal, valuation or actuarial services. A rating should not be viewed as a replacement for such advice or services,” the agreement says.\n“You warrant that all information you or your agents provide to Fitch, as of the date such information is provided, (i) contains no untrue statement of material fact and does not omit a material fact necessary in order to make such information, in light of the circumstances in which it was provided, not misleading and (ii) does not infringe or violate the intellectual property rights of a third party,” it adds.\nRatings by credit agencies are considered crucial by both international investors and financial institutions when assessing the strength of a particular economy. Malta has been enjoying positive credit ratings by major agencies, reflecting a significant growth cycle of the economy.\nRead: Fitch is given €40,000 annual direct order\nInformation given by Prof. Scicluna shows that, until 2013, credit rating exercises cost the government about €80,000 a year, rising to €230,000 last year.\nThe government would not say how much it pays each of the four credit rating agencies: Fitch, Standard & Poor’s, Moody’s and DBRS. However, official information related to direct orders published on the Malta Government Gazette shows that Fitch is receiving €40,000 a year though details on individual payments to the other agencies have not been published yet.", "comment_count": 26, "id": 2747}, {"keywords": "", "author": "", "article_body": "The Naxxar church area should be turned into a car-free village core and not a traffic-choked roundabout, Alternattiva Demokratika insisted on Saturday.\nThis can be done with better management and diversion of traffic, AD chairman Carmel Cacopardo said, pointing out that cycling infrastructure is virtually non-existent in Naxxar.\nThis increase in traffic continues to deteriorate air quality and therefore contributes to respiratory diseases, among other problems.\n\"Naxxar, like all major localities in Malta is choked with unbridled growth and with traffic. The urban environment, that is so essential to residents’ quality of life is under siege,\" he told a news conference.\nPeople and not cars should be given priority on residential roads, more so in the narrow streets of village cores. This can be done several ways, including by minimising speed in residential areas to a maximum of 30km per hour as well as the development of infrastructure to encourage the use of bicycles.\nRead: Developers propose trading system to 'protect' quaint urban areas\nHe said the proposal made earlier this week by the Malta Developers’ Association so that they compensate so-called lost development opportunities due to restrictions in Urban Conservation Areas by providing additional development rights in other areas, will impact badly localities such as Naxxar.\nThe construction industry needs to be curbed and not given more and more leeway to continue with their destruction of Maltese localities, Mr Cacopardo said.\nThe MDA’s proposals will compound the problems caused by the 2006 rationalisation scheme, the impacts of which are being felt today.\n\"This is leading not only to normal low-rise houses being replaced by a concrete jungle, but has led to a huge of buildings and a large increase of cars in a small areas.\"", "comment_count": 8, "id": 2748}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Just over a week after being handed a suspended sentence after admitting to their involvement in a prostitution racket, six women were back in court requesting their passports back.\nColombian nationals Johana Bermudez Patino, Yeiny Carolina Ayala Moncada, Luisa Fernanda Villalba Monsalve, Maria Valentina Sanchez Quiguanas, Laura Cristina Loaiza Acevado and Daniela Cardona Carrillo had been released from custody on March 14 following their arraignment, each having been handed a 12-month jail term suspended for four years.\nRead: Sliema brothel raid lands eight in court\nThe young women had pleaded guilty to living off the earnings of prostitution, running a brothel and using the Sliema premises for prostitution purposes.\nThe day after judgment was delivered against them, their lawyer filed an application before the Magistrates’ Court requesting release of their passports.\nA week later, in view of the fact that the request had not yet been acceded to, lawyers assisting the women attempted a different route, filing special proceedings, known as habeas corpus - an action intended to remedy illegal arrest.\nTantamount to illegal arrest - lawyers\nIn proceedings on Friday afternoon, defence lawyers Gianluca Caruana Curran and Therese Comodini Cachia argued that withholding the passports effectively amounted to their illegal arrest since their movement was restricted.\nWithout such personal documents their clients could not obtain basic services and could not effect money transfers, leaving them short of funds.\nHowever, lawyer Maria Francesca Fenech from the Office of the Attorney General, prosecuting Inspector Joseph Busuttil and Dr Marion Camilleri, assisting the Director General of the Law Courts, countered that proceedings of habeas corpus contemplated the detention of a physical person, which was not the case at issue.\nTherefore, the procedure adopted by the defence was not the correct one, the prosecution argued, further noting that the term for filing an appeal against the judgments delivered against the six women, had not yet expired.\nAfter lengthy submissions which went on well into the evening, the court, presided over by magistrate Marse-Ann Farrugia, delivered a decision at 11.30pm declaring that withholding a person’s passport did not amount to detention.\nThe court quoted the ECHR in Baumann vs France which had established that the keeping of a passport by the police constituted a breach of freedom of movement in the particular circumstances of that case.\n“In the opinion of the court, the confiscation of a passport can constitute a limitation on the movement of the applicants, but it does not amount to detention,” ruled the magistrate, adding that consequently the scenario of the present case did not fall within the parameters of the article of the law upon which the request had been based.\nIn view of this, the court refrained from entering into the issue as to whether the failure to release the said passports had been legally justified or not.\nMeanwhile, criminal proceedings against the suspect masterminds behind the brothel activity, continue.\nDon Spagnol, 34, and Luke Farrugia, 31, both Gżira residents, had pleaded not guilty to their alleged involvement in the running of a brothel, living off the earnings of prostitution and using the Sliema premises for such purposes.\nThey were remanded in custody upon their arraignment, the court turning down the request for bail in view of the fact that civilian witnesses, among them the six Colombian ladies, were still to testify.", "comment_count": 0, "id": 2749}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 2.20pm\nMalta's national airline was not “out of the woods yet” despite registering a slight profit for the first time in almost two decades, chairman Charles Mangion said on Saturday.\nAir Malta registered a profit of €1.2 million, fuelled by an increase in revenue of over €7 million generated by an increase in passenger traffic of around 11 per cent and decreasing fuel costs, a news conference was told. \nThe airline had registered a loss of €10.8 million in 2017. \nPaul Sies, Air Malta’s Chief Commercial Officer said during the financialyear capacity was increased by 20 per cent with new routes generating a €12 million increase in revenue.\nVideo: Chris Sant Fournier\n“In spite of these positive results, we cannot rest on our laurels. A lot more needs to be done to get the company out of the woods and on firm sustainable grounds,” Dr Mangion said.\nRead: New airline will not compete with Air Malta, Tourism Minister insists\nHe said the airline needed to continue to adapt to change, adding other airlines and low-fare carriers will continue to pose challenges.\nTourism Minister Konrad Mizzi hailed the turnaround, insisting that the airline had better operational control and was registering success in ticket sales.\nThe airline is now in a position to change its fleet and will receive two new aircraft in the coming months, the minister said, adding there were plans to also open a pilot academy in the future.\nSummer schedule\nDuring the conference Mr Sies announced the highlights of the airline’s schedule for this summer which include increased frequencies to and from Paris Charles De Gaulle, Hamburg, Kiev, London Heathrow, Lyon, Munich and Tunis.\nHe also announced that after an absence of 12 years Air Malta is planning to resume flights to Egypt’s capital, Cairo and for the first time the airline will also offer scheduled services to/from Warsaw.\nCEO Clifford Chetcuti said the airline was looking at destinations in the Scandinavian and Eastern European regions, adding it will also look at long-haul flights to countries like India and sub-Saharan regions.\nHe echoed the airline chairman's warning that Air Malta could not afford to \"become complacent\", with fluctuating fuel prices and increased competitive pressures still posing challenges.\nThe airline’s strategy was starting to pay off, he said, adding this was only the beginning of the new horizons Air Malta had set its sights on.The airline played “a pivotal role in the economic growth” of the country, but its expansion had to be sustainable, Capt. Chetcuti said.", "comment_count": 76, "id": 2750}, {"keywords": "", "author": "", "article_body": "Two poachers were arrested on Saturday after they were filmed shooting at birds during the closed season. \nThe illegality was flagged by monitoring teams from the Committee Against Bird Slaughter close to the airport in the area known at Misraħ Ħlantun around 7am. \nBoth men used illegal silencers to suppress the noise of their shotguns, CABS said.\nThe birdwatchers alerted the police's administrative law enforcement unit who responded at once and caught both men in the act.\nAfter being confronted with the fact that their illegal activity was recorded on camera both men admitted to the charges and criminal proceedings have been instituted against them, CABS said in a statement.\nThe two shotguns and an illegal bird caller were seized.\nDespite repeated EU warnings, Malta's controversial spring hunting season will reopen again this year between April 10 and 30. \nRead: BirdLife objects to any changes to spring hunting season\nPolice reacted swiftly to the infringement. Photo: CABS", "comment_count": 17, "id": 2751}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The little sand that remained at Balluta Bay was swept away after the latest storm, just seven months after the completion of €110,000-replenishment project by the Tourism Ministry.\nMarine experts had warned last summer the project was doomed to fail, criticising the government on the “waste of hard-earned taxpayers’ money”.\nRead: Balluta beach project might not survive the winter\nQuestions sent to Tourism Minister Konrad Mizzi on whether this was the result of lack of planning and mishandling of public funds remained unanswered. He was also asked whether, as had been declared last year, the ministry would make another attempt to replenish the bay.\nDr Mizzi had said during a site visit last August the replenished beach was the result of “an experimental measure to determine if such an exercise was worth the expense”.\nLarge stones can cause problems for swimmers this summer\nThe beach’s inauguration had coincided with the most hectic time of the year as it was done at the peak of the summer season and coincided with the village feast.\nNot long after its inauguration, sand on the 20-metre wide beach had already started to disperse despite rather good weather. \nRead: 'Experimental' Balluta Bay temporarily closed after sand is carried away\nA month later, when most of the sand had already disappeared, a spokeswoman for the Malta Tourism Authority had denied that the beach had shrunk, stating that evidence collected through continuous monitoring indicated that such conclusions were “neither correct nor scientific”.\nNone of the sand that had been laid seven months ago at Balluta Bay is now visible. Photo: Mark Zammit Cordina\n“The fact that the sand is not visible all the time does not mean that most of the sand has been washed away,” she had insisted.\nNone of the sand that had been laid as part of the replenishment project seven months ago was visible during a visit to the beach last week. Instead, rocks could be seen where the sand once was, potentially cause problems for swimmers.\nResidents and restaurant owners in the area told the Times of Malta said they would have preferred to see maintenance work carried out on the promenade rather than “literally throwing money into the sea”.", "comment_count": 83, "id": 2752}, {"keywords": "", "author": "", "article_body": "Updated 11am with PL statement\nA government initiative urging pensioners to borrow money by putting up their property as a guarantee has been described by the Opposition as a desperate attempt to address the pensions problem.\nInstead of revising the system, the government is continuing to put pressure on pensioners and their next-of-kin, the PN statement signed by spokesmen Mario de Marco and Claudio Grech said. \nOne in five pensioners is living in poverty or is at risk of poverty, and yet the government is urging pensioners to go into debt through the newly-unveiled Equity Release scheme, the PN said. \n\"This is a government which has lost its sense of social justice and does not care about vulnerable people.\"\nLabour hits back\nA party which left pensions frozen as it served 25 years in government has no credibility, the Labour Party hit back. \nIn a statement, the PL said the government had a plan spread over a series of initiatives to help pensioners, including a raise in pensions. \nIt said the Equity Release scheme was a totally voluntary one which is already being used by the private sector.\n\"Pensioners have every right to choose what to do with their property and how to maximise its potential during their life,\" the PL said. \n ", "comment_count": 84, "id": 2753}, {"keywords": "", "author": "", "article_body": "Alfred Sant blocked a European Parliament proposal to discuss the Egrant allegations against the Prime Minister and his wife two weeks before the 2017 general elections, the former prime minister has claimed.\nMoves were made to put the issue of the secret Panama company on the agenda of the European Parliament on the eve of the general election in Malta, which could have badly affected Labour’s political campaign, he said.\n\"I took certain initiatives to ensure that discussion in the plenary would be postponed till after the general elections. And that is what actually happened,” Dr Sant told the programme XTRA on TVM.\nHe said the discussion would have strengthened the resolve of certain individuals in Malta who were \"orchestrating\" the campaign. \n“Much of my political work in Malta and at the European Parliament was meant to provide services underground. This was deliberate. With regards to Malta and the Labour Party, my best input occurred two years ago when Egrant allegations were prevalent during Malta’s election campaign and the Egrant issue was very much alive and hot.\"I recognised immediately he wasn’t involved\nDr Sant, who is again contesting the MEP elections on the PL ticket, said he has full confidence in the Prime Minister’s integrity.\n“I didn’t feel the need to contact the Prime Minister on the Egrant allegations. I recognised immediately he wasn’t involved... because I have full confidence in him, I have full confidence in his integrity. He may have committed mistakes. But I have never had any doubts about his integrity.”\nA magisterial inquiry last year found no evidence linking the Prime Minister and his wife Michelle to Egrant. Sceptics continue asking questions about the real owner of the secret company while Opposition leader Adrian Delia is involved in a court battle to get access to the full inquiry. ", "comment_count": 197, "id": 2754}, {"keywords": "", "author": "", "article_body": "A healthy dose of stories about what it means to cope with an invisible, misunderstood and incurable disease, Multiple Sclerosis; natural remedies for menopause; and a taste of the world of wellness at The Pink Tea Garden event on April 5 can be found in the March issue of Pink, out with The Sunday Times of Malta.\nHealth is, indeed, a running theme, paving the way for the upcoming well-being event that is focusing on a wholesome lifestyle through natural and organic products, from food to cosmetics, services and treatments.\nThe fashion magazine’s photo shoot, Down to Earth, features earthy and neutral hues, in keeping with the idyllic countryside location of The Pink Tea Garden, Vincent Eco Estate, offering a glimpse of the natural setting of the event that is gathering all things good, pure, nourishing and green.\nwww.ticketline.com.mt", "comment_count": 0, "id": 2755}, {"keywords": "", "author": "", "article_body": "Din l-Art Ħelwa has announced that the unique medieval chapel of Ħal Millieri just outside Żurrieq has been rendered accessible again, after the extensive storm damage to its rubble walls and pathways was repaired in time for the annual celebration in honour of the Annunciation of the Virgin Mary. \nThis year’s open day will be held tomorrow. For the occasion the chapel will be open to the public from 9am to 6pm. Mass will be celebrated at 10am, followed by the blessing of the adjoining churchyard. \nDLĦ, the volunteer heritage organisation which holds the chapel in trust, is organising two guided tours of the site led by  Stanley Farrugia Randon at 11.15am, and Anthony Mangion, curator of the chapel, at 4pm. \nThe church of the Annunciation at Ħal Millieri is a major landmark of Malta’s medieval past. The present building dates to around 1450, but archeological excavations have shown that it was constructed on the site of an earlier, possibly 13th century chapel, and a much older late-Roman rural complex.\nThe Ħal Millieri church is best known for its medieval architectural features, and for the unique set of fresco paintings that adorn its side walls between the springing of the arches. \nThis anachronistic cycle of holy effigies, which is believed to have been copied from the earlier chapel, has been expertly restored through the efforts of DLĦ, as a fine exemplar of Maltese medieval vernacular art.\nThe church can be reached from Mqabba Road at the Żurrieq entrance to Blue Grotto Avenue or from Diamond Jubilee Square (Fuq il-Mentna) at the end of the Mqabba bypass.", "comment_count": 0, "id": 2756}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The St Julian’s local council is to formally object to a 24-storey hotel just metres from the protected Wied Għomor Valley. \nDespite being in a development zone, the towering hotel will ruin the aesthetics of the area and will also jar with its surroundings, the council is insisting. \nThe council voted to formally object following a request tabled by St Julian’s deputy mayor Albert Buttigieg, who found cross-party support for his proposal. \nThe site, measuring just over 3,000 square metres, is in Triq Mikiel Anton Vassalli, corner with Triq Mikiel Ang Borg, the slip road to Spinola Bay just outside the Regional Road tunnel. The area is not Outside Development Zone. \nThe development, being proposed by Tum Invest, an offshoot company of the Tumas Group, proposes a three-storey car park and an overlying hotel over 24 storeys. There are no details about the number of guest rooms and other ancillary facilities being proposed such as a pool and an outdoor area. The application simply says “with related amenities”. \nThe Planning Authority’s Design Advisory Committee said that “the extensive height of the proposed structure will negatively impact the surrounding properties and landscape”. \nIt said it would comment further once the planning application progresses. \nTransport Malta told the Planning Authority that the development permit required a Traffic Impact Assessment before it could officially give its views on the proposal. \nI do hope that common sense prevails and no more green land will be taken\nAccording to objections re-ceived so far by the Planning Authority, residents are opposing the proposed development be-cause it was eating away at Wied Għomor, a protected valley. \nObjectors claimed that the site hosts a number of indigenous and native trees such as cypresses, carob trees and almond trees. \n“I do hope that common sense prevails and no more green land will be taken for speculative reasons,” one objector said. \nAnother objector said the maximum height of buildings in the area was of three floors. \n“The traffic under the bridge in the mornings is already present and building and this will just exacerbate the situation,” he told the Times of Malta.\n“This proposal is crazy. The fact that people have the audacity to even apply for such a permit shows that there is a serious problem. The local council is against it and so are the residents. \n“For once please just keep us residents in mind.”", "comment_count": 25, "id": 2757}, {"keywords": "", "author": "", "article_body": "Two men were injured, both of them grievously, following a fight in Paceville early on Saturday morning, the police said. \nTwo Colombian nationals were seen arguing with four other men in the heart of the town in Triq San-Ġorġ around 6.15am.\nAs the argument got out of control, witnesses said they spotted a 27-year-old lying on the ground while the other man was seen fleeing from the scene.\nAnother Colombian national, a 34-year-old, was seen trying to intervene to stop the fight, but he ended up being grievously injured, sustaining facial injuries in the process. A knife was used in the incident, the police told Times of Malta. \nThe condition of the other victim is also serious, the police later said. The man who was spotted fleeing has not yet been found. \nThe police are mounting a search for the alleged aggressors. \nPolice are investigating. ", "comment_count": 0, "id": 2758}, {"keywords": "", "author": "", "article_body": "A Moscow-bound Air Malta flight was forced to turn back late on Friday night after developing a technical fault. \nKM560 flying to Sheremetyevo International Airport reported a technical problem just a few minutes after taking off, according to the Horizon site. \nAccording to flight tracker site Flight Radar 24, the aircraft was spotted circling the island to burn off fuel to reduce aircraft weight before it landed safely back. \nNo incident was reported on board the Airbus A-320.\nThe flight was later operated by another aircraft.", "comment_count": 15, "id": 2759}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that parents of children with disability are concernedthe education sector is not equipped to handle them. It also reports an NGO saying that illegal trapping was at an “all-time high”, with 14 cases of illegal birdtrapping being reported in just 12 days.\nIn-Nazzjon says the government was forced to carry out the necessary legislative changes prompted by the Venice Commission following pressure by the Opposition. It also says that Malta was once again registering a finance deficit. \nThe Malta Independent focuses on the Brexit summit in Brussels, amid turmoil over Britain's delay to exit the EU.\nL-orizzont narrates the story of a woman who was violently raped when she was 16 years old who says her son was the biggest gift. The newspaper carries a picture of the Maltese team taking part in the Special Olympics returning to Malta. \n ", "comment_count": 0, "id": 2760}, {"keywords": "", "author": "Jacob Borg", "article_body": "Investigations into corruption and money-laundering were no easy task and involved months of preliminary work, police CEO Angelo Gafà has said.\nThe European Commission’s 2019 annual country report about Malta described police accountability as “deficient” and noted that allegations about corruption and money laundering rarely resulted in prosecutions.Angelo Gafà: everything was being done to take the fight against financial crime to the next level.\nIn comments to the Times of Malta on the fringes of a Commission event about the country report, Mr Gafà cautioned that it often took months before such investigations yielded results.\nMr Gafà, an experienced investigator who also worked for the security services, was appointed CEO of the police force in 2016. In his new role, he no longer plays any part in police investigations.\nHe said recent cases had shown the police were committed to taking criminals to court when there was enough evidence to prove a case. The burden of proof for criminal cases was higher than that of civil cases, he pointed out.\nOne of the problems identified by the European Commission was understaffing in the police economic crimes unit. Mr Gafà said efforts were ongoing to strengthen the unit, which had already seen its staff double. The unit had been split into two, with a new team focusing solely on money-laundering cases.\nHe said such reforms showed the police were fully committed to carry out all necessary changes. Apart from simply bolstering human resources, he continued, efforts were also made to train officers to better deal with complex financial crimes.\nHundreds of thousands of euros had been invested in hardware and software that would aid in better tracking links between criminal activity, which was becoming increasingly sophisticated and international, he said. \nMr Gafà said all these actions had been taken months before the Commission’s report. This showed everything was being done to take the fight against financial crime to the next level, he noted.\nThe government has been rocked by allegations of high-level corruption over the past years, with little consequence for those involved.\nThe police were fully committed to carry out all necessary changes\nPrime Minister Joseph Muscat retained his top aide, Keith Schembri, and Tourism Minister Konrad Mizzi even after their plans to receive payments totalling $2 million via offshore companies were revealed in the Panama Papers.\nThe police are not known to have opened an investigation when such plans were revealed in 2016 and former Opposition leader Simon Busuttil had asked the courts to look into the allegations.\nThe Sunday Times of Malta reported that Police Commissioner Lawrence Cutajar had warned a whistleblower in 2015 that a probe into allegations of irregularities in the way Malta’s consulate in Algeria was issuing Schengen visas would not be easy given a potential link to the Prime Minister’s cousin.", "comment_count": 82, "id": 2761}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Health Ministry and the Mount Carmel Hospital authorities did not say why they had stopped a group of social workers from working from home for two hours a day.\nThe teleworking option was granted to the social workers to be able to write reports, a clerical part of their job that does not require them to be physically present at the hospital.\nSources said the social workers enjoying the teleworking arrangement were curtly informed that agreement was being stopped due to “budgetary constraints”. \nAs a result, their physical presence at their workplace was being demanded, they were told.\nThe sources said the workers, most of them women, were utilising the telework option to balance out their family responsibilities with those related to their full-time employment.\nA meeting is expected to be held today between the hospital management and the Malta Union of Midwives and Nurses, which represents the social workers.\nUnion general secretary Colin Galea told the Times of Malta when contacted the issue simply “did not make sense” because it went against the work-life balance the government was preaching.\nThe issue simply does not make sense\n“We have a meeting with the CEO specifically on this topic. We have no doubt that this issue does not make sense because these professionals have a substantial amount of work that is office work and can easily be done through telework. These social workers have only 10 hours of telework per week when the office work it entails takes longer than 20 hours a week,” Mr Galea said. \n“We hope this issue will be resolved during the meeting.”\nThe sources said removing the telework option gave the social workers no option but to find alternatives for their children and address other logistical nightmares.\nSome social workers had enjoyed the telework arrangements for more than five years.\nThe workers were insisting they had been encouraged to take up such arrangements as telework in line with the government’s efforts to introduce family-friendly measures to safeguard a work-life balance. \nThey argued that telework did not come at an added cost so the argument that this was being done for budgetary reasons did not add up.", "comment_count": 30, "id": 2762}, {"keywords": "", "author": "", "article_body": "The double deadline the European Union gave the United Kingdom was a message that it was now the time to take decisions, Prime Minister Joseph Muscat said.\nSpeaking following the Brussels summit, which decided to give the UK until May 22 to exit if British MPs accepted the Brexit deal, and until April 12 to decide on the way forward if not, the Prime Minister said there was now enough time for the EU to be realistically prepared for a no deal Brexit while leaving the door ajar for other developments which could let everyone breath.\nThis did not mean there would not be tension. But a clear message was being sent to the UK Parliament that it had to decide. The European Union, on the other hand, had to work more to prepare for the worst possibility.\nThe summit also discussed EU commercial ties with China. The Prime Minister said that if Europe wanted to practice what it preached on an open market, it had to be open to one of the world’s biggest economies.\nThere had to be a level playing field by being clear with Chinese investors that the way they operated in Europe had to be in line with European rules. But there should not be protectionism.\nOn the other hand it was important that European developed technologies were given incentives in Europe, so the EU’s industrial policy had to be revised.", "comment_count": 35, "id": 2763}, {"keywords": "", "author": "", "article_body": "Undisclosed amounts of smuggled alcohol and tobacco products seized by Customs will be sold by auction later this month.\nThe 28 lots to be auctioned include whisky, brandy, vodka, gin, rum, tequila, port, sherry, aperitifs and liqueurs. There is also beer, wines, other alcoholic drinks, cigarettes, cigars and tobacco.\nThe sale by auction will be held on March 29 at noon at the Newport bonded stores in Marsa. The items can be seen at the bonded stores between 8am and noon and from 12.30pm to 3pm between Monday and Friday.\nMore details about each lot are available on the tender form, which can be obtained from the Newport bonded stores.", "comment_count": 2, "id": 2764}, {"keywords": "", "author": "Ivan Martin", "article_body": "The local council of St Julian’s will be discussing the future of St Patrick’s Day street party, with opinion split as to whether it should continue being held there.\nWhile it was all fun and games for revellers, residents complained that the annual event was a “massive headache”.\nAbout 15 tonnes of bottles, cans and other waste was cleared from St Julian’s over the weekend.\nThe Cleansing Department in action early the next morning.\nAside from the litter, residents had to deal with urine-soaked tarmac, puddles of vomit outside their front doors and damage to parked cars.\nDeputy mayor Albert Buttigieg said it was time the authorities discussed moving the event out of St Julian’s and to another venue more suited to hosting the roughly 30,000 people that flocked to Spinola Bay on Sunday.\n“This has already happened in the past. The beer festival, for instance, used to take place in Ta’ Xbiex but when it outgrew the area it was moved to Ta’ Qali. I don’t see why the same cannot be done with St Patrick’s Day,” he said. \nMayor Guido Dalli, however, said the matter was far more complicated than simply deciding to move the event to another part of the country.\n“This is something we will be discussing as a council when we meet. If, say, the government wants to take over organising it and move it to another locality then that is one thing. What is certain is that if it is to remain here, then we need to change certain aspects. But we need to discuss the issue as a whole council and come out with a position,” he said.\nFor this year’s event, the council brought bar owners together to share street cleaning costs to clear the mounds of bottles, cans and other rubbish left behind.\nThe Cleansing Department spokesman told Times of Malta that, following discussions with the council and other stakeholders, cleaning up started just a few hours after the partying had ended after midnight.\nTwelve employees, equipped with two mechanical sweepers and a water bowser, worked throughout the night to get the roads looking tidy again, with cleaning in some areas carrying on through the next day.\nThe cleaning bill? About €2,000.\nPaceville stalwart and vice president of the Malta Chamber of SMEs – GRTU, Philip Fenech, described the event a success. \n“Considering all those people, there were no major incidents and everything seems to have gone quite smoothly. St Patrick’s Day has become an annual event on the party calendar now,” he said.", "comment_count": 59, "id": 2765}, {"keywords": "", "author": "Edwina Brincat      ", "article_body": "A man who attacked a local community officer has ended up with a six-month jail sentence and €5,000 fine. \nŻejtun resident Loreto Portelli, 42, admitted to having slightly injured the warden in a fight which broke out on Wednesday afternoon at Għar Dalam Road, Birżebbuġa.\nThe argument was reportedly sparked by a caution over a minor infringement. The two argued and it eventually descended into a violent row.\nMr Portelli was charged with slightly injuring the warden, without intending to place his life in danger, threatening and violently assaulting the officer during the exercise of his duties.\nHe was further accused of damaging the officer’s uniform, which damage did not exceed €250 as well as breaching the peace.\nHe admitted to the charges, with his lawyer suggesting that the offences would merit a suspended sentence. The prosecution raised no objection to the suggestion.\nHowever, magistrate Marse-Ann Farrugia went one step further, declaring him guilty and condemning him to a six-month effective jail term and a €5,000 fine.\nThe accused has reportedly given notice that he will be appealing the sentence. \nInspector Roderick Attard prosecuted.Lawyer Clint Tabone was defence counsel.", "comment_count": 0, "id": 2766}, {"keywords": "", "author": "", "article_body": "Malta is the only country in the world to satisfy all criteria for gay rights protection set by an international organisation in a report into state-sponsored homophobia.\nThe report, by the International Lesbian, Gay, Bisexual, Trans and Intersex Association (ILGA World), compiles data on laws from around the world that affect people on the basis of their sexuality.\nResearchers looked at criteria such as the legalisation of same sex sexual acts; constitutional and employment protection; protection from hate crime and incitement; a ban on conversion therapy; and the availability of same sex marriage, civil unions, joint adoption and second parent adoption.\nIn a statement, the government highlighted Malta's first place, noting that it had introduced several legislative reforms in the sector.\nThose reforms had placed Malta at the top of Europe when it came to gay rights, before it was elevated first worldwide, the government said.\nThe report says that 32 member states have laws in place to limit freedom of expression, including propaganda laws that prohibit the promotion of ‘non-traditional’ sexuality or identity, while 41 states have barriers in place to prevent non-government organisations from working towards equality for LGBTIQ+ people.\nOn the other hand, legislation that protects lesbian, gay and bisexual persons from discrimination and violence has expanded in recent years.\n ", "comment_count": 64, "id": 2767}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young lady who last month admitted stealing cash from the University library pigeonholes, has been afforded a second chance by a Magistrates’ Court to get back on the right path.\nAmber-Ann Zammit, a 23-year-old from Ħamrun, currently unemployed, had been arraigned under arrest in February after incriminating CCTV footage had linked her to some six separate instances when she made off with small amounts of cash, left among the personal belongings placed inside the library compartments.\nInvestigators had managed to track her down.\nUpon her arraignment, the young lady registered an admission and was granted bail pending the drawing up of a pre-sentencing report requested by her defence counsel.\nOnce that report had been concluded and handed over to the court, presiding magistrate Charmaine Galea proceeded to hand down judgment, declaring the young lady guilty upon her own admission.\nWhen meting out punishment, the Court took note of various factors, including the accused’s early guilty plea, her cooperation with the police as well as the Probation Officer’s recommendations.\nThese considerations weighed against the accused’s criminal record and the fact that she had committed the thefts under the terms of a conditional discharge, a first opportunity handed to her by the courts.\nIn view of the accused’s age, the court deemed that the youngster could benefit through probation which would offer her an opportunity to get her life back on track, thus issuing a three-year Probation Order.\nThe court warned that a similar opportunity might not present itself once more should another offence be committed.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 2768}, {"keywords": "", "author": "", "article_body": "Updated at 5.50pm with MDA statement \nA proposal by developers to make it easier for them to increase development in certain areas with the claimed objective of protecting areas next to village cores has been slammed by Din l-Art Ħelwa.\nDuring a meeting with the Prime Minister on Wednesday, the Malta Development Association suggested buying gross floor area of property - essentially air space - near village cores, ensuring that these remained undeveloped, with that offset by payments for projects elsewhere. \nIn a statement, Din l-Art Ħelwa said it was firmly opposed to the idea. At the MDA’s annual general meeting, their president had complained that developers often faced delays due to heritage concerns.\nIt now seemed to be proposing that members would stop trying to build multiple storeys in old village cores but instead they should be given permission to increase construction in other parts of the island.\nThis was an indictment of the ineffectiveness of the authorities that were currently entrusted with protecting village and town cores.The proposal completely negated the basic concept of planning regulation, Din L-Art Ħelwa. Planning laws and policies existed to safeguard the interests of the community, and developers could not be allowed to trade rights and reassign floor space from an area to another. The protection of village cores could not be ‘traded’ for the disregard of existing planning policies elsewhere, the NGO said. Din l-Art Ħelwa asked the government to immediately and unequivocally reject the proposal and instead strengthen the protection of urban cores and rural areas outside the development zones.\n'This is risky' - PD\nThe Democratic Party said that the MDA's proposal came with several risks and announced that party leader Godfrey Farrugia would be seeking a meeting with the developers' lobby. \nFellow PD MP Marlene Farrugia said Malta's towns and villages needed proper planning protection. \n\"Are we going to barter our very own skyline and heritage, which belongs to all of us, in exchange for land which in some cases may be public land?\" she asked.\nThe PD warned that developers had to keep their greed in check or they would end up \"destroying themselves like they are destroying our country\".\nNo UCAs, says MDA\nIn a statement on Friday afternoon, the MDA denied that its proposal had anything to do with \"reassigning\" building volumes in UCAs and urban cores, as Din L-Art Ħelwa had said. \nThe MDA said that its proposal was to effectively 'freeze' development in certain areas which since 2006 could be developed to buildings of up to four floors and a penthouse.\nIn return, developers would be able to build higher in areas where height limitation was not an issue. \n\"This is solely in the interest of the country to keep the identity of certain towns and villages,\" the MDA said.\n\"To suggest that the MDA wishes to any way tamper with urban cores, UCAs and rural areas outside development zones is totally incorrect.\"\n ", "comment_count": 3, "id": 2769}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Three foreigners travelling to Germany on forged travel visas were cleared of all liability in terms of immigration laws after their criminal intent was placed in doubt on account of the very high quality of the fake documents.\nMomodu Kamara, 26, alongside his spouse Marrah Sallay, 25, from Sierra Leone, had been prosecuted alongside Eritrean Weini Goitom Fitwi, 30, facing accusations of possession and use of falsified visas, as well as falsifying registration documents under the Immigration Act.\nAll three had landed in Malta in December on board a flight from Moscow to Germany.\nThe husband and wife had sought asylum on the island, their plans thwarted when it was discovered that their German visas had been forged. The third member of the trio, Ms Fitwi, was stopped at the departure desk upon discovery that she was carrying a forged visa.\nAll three were targeted by criminal prosecution, protesting their innocence and insisting that as far as they knew, their travel documents were genuine.\nMr Kamara had explained to police that a certain person called “Doris” had handled the issue of their travel visas, offering her assistance free of charge.\nThe woman had even accompanied the Sierra Leone couple to Moscow where Mr Kamara’s wife had been enticed to work as a prostitute, an offer she had turned down. The couple had taken up a cleaning job instead.\nBeing his first experience of travel abroad, Mr Kamara could not tell if his visa was fake.\nAs for Ms Fitwi, she had told police that as far as she knew, her visa was valid.\nIn the light of all evidence put forward, the court, presided over by magistrate Audrey Demicoli, observed that although there was no question as to the falsified visas in the accused’s possession, the prosecution had failed to prove that the trio knew that the documents were false and knowingly made use of them.\nFailure to prove this conscious decision to breach the law meant that the accused could not be held guilty, the court declared, pointing out that the forgeries had been of such good quality that it was plausible to believe that the accused had not known that the visas were fakes, thereby pronouncing an acquittal.\nLawyer Roberto Montalto was defence counsel.", "comment_count": 0, "id": 2770}, {"keywords": "", "author": "", "article_body": "A tunnel between Malta and Gozo was the only way for Gozo’s economy to be fully integrated into the national one, the Malta Developers’ Association said.\nIn a statement, it said it had already declared itself in favour of the tunnel three years ago and studies undertaken or being carried out were positive and should lead to the project’s approval.\nThe MDA said NGOs and other entities opposing the project were doing all they could to block the tunnel project. They were repeatedly asking for further studies in the hope that these would lead to the project being abandoned, developers said. \nA tunnel would spell the end for economic disparities between Malta and Gozo, developers said. \nAlthough the MDA said that tunnel sceptics were continuously asking for more studies, the government itself appeared to contradict that assertion. \nJust hours before the MDA issued its statement, the government said that it would only release its own studies into the tunnel project \"soon\" as part of the project's permit application. \nThe Church Environment Commission earlier this week joined over 13 NGOs warning there was no reliable information in the public domain allowing people to make an informed decision about the tunnel or any alternatives.", "comment_count": 44, "id": 2771}, {"keywords": "", "author": "", "article_body": "Flimkien Għal Ambjent Aħjar has expressed disgust at ongoing attempts to increase height and density of a hotel in Għajnsielem, saying that this was being done through piecemeal applications and abusive practices.\nIn 2016, the hoteliers applied for an extension to the hotel which was refused by the Planning Authority. This decision was then overturned by the Tribunal who subsequently granted the permission for the development of an additional floor and lightweight roof structure.\nThe permit was already deemed to be controversial by FAA which maintains that the request was beyond that which could be attained in the area due to its vicinity to the village core.\nThe developer then went on to incrementally increase the size of the approved development through numerous requests for 'minor' amendments. These amendments resulted in the roof structure initially approved as a lightweight structure covering just 75 square meters to a restaurant covering over 300sqm built in concrete, the eGNO claimed.\nFAA representative Tara Cassar noted concrete - which can by no means be deemed a 'lightweight structure' - was never formally requested by the hotelier, saying this meant the construction as it was built was illegal.\n\"The hotelier's blatant attempt to defy planning constraints and increase the already overbearing size of this out-of-scale development overlooking the picturesque and visually sensitive Mġarr Harbour is abhorrent and should simply not be allowed to go on. The authority must take action and ensure that planning legislation is not made a mockery of through such obviously abusive requests,\" FAA said.", "comment_count": 4, "id": 2772}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A trio tried to blackmail a man for involvement with a minor - after the woman involved crept into his car as he drove through Ta' Xbiex and refused to leave, the driver claimed in court. \nThe victim recounted in court how one evening back in August 2013, he had been driving through Ta’ Xbiex when a woman had approached his vehicle and slipped inside, asking him to drive on.\nShe had refused to leave the car when asked to do so, demanding €20 instead, he said. \nNo sooner had the driver handed over the money than two male strangers suddenly crept upon him, claiming that they had been searching for the girl for three days, taking away the man’s car key and threatening to report him to the police on the grounds that the girl was a minor.\nHowever, the victim had turned the tables upon the strangers, grabbing his phone and dialing the police himself, thus prompting all three to hand back the keys and snatch the €20 note, before taking to their heels.\nThe witness later failed to identify his two male aggressors when testifying in court, recognising only the woman, before proceedings against the trio were ultimately split to be dealt with separately.\nOne the two men, Steve Galea, 26, was subsequently prosecuted along with the other man and his girlfriend for his allegedly involvement in a series of violent robberies against unsuspecting victims.\nThe accused pleaded not guilty to multiple charges including the thefts, holding the victims at knifepoint, violently forcing his girlfriend into prostitution, living off her earnings, running a brothel, carrying an unlicensed weapon and committing such wrongdoing during the operative period of two earlier suspended sentences.\nMr Galea’s former girlfriend had subsequently retracted her first version, insisting that she had worked as a prostitute out of her own will, before her 3-month relationship with the accused.\nShe also denied that he had been violent – cutting off her hair with a knife on one occasion – and explaining that they had used her earnings to pay for daily needs.\nThe woman had also denied the violent thefts, ultimately withdrawing her complaint against Mr Galea, who is also the father of her two children.\nUpon a request by the man’s defence team, the court appointed a probation officer to draw up a Social Enquiry Report shedding light upon the accused’s background.\nThe officer informed the court that in 2015, the accused was still struggling to quit his drug addiction, showed little urge to take up a stable job, had a shaky relationship with his girlfriend and led an idle life.\nHowever, the following year, after a number of false starts, the accused finally embarked upon a residential drug rehabilitation programme, which he successfully completed, stepping out with a fresh positive outlook on life, testing clean of drugs and with a regular Monday to Friday job.\nA letter from Caritas was handed over to the Court, which observed that Mr Galea had registered marked progress, having “integrated well with his peers and is today a role model to others struggling with their addiction”.\nIn the light of all this, the letter recommended that “incarceration at this moment in time is detrimental to his recovery and his therapeutic process”.\nIn the light of such recommendation, the court, presided over by magistrate Claire Stafrace Zammit, further noted that the prosecution had shown inconsistency in handling its case, failing to prove the date of the alleged violent episode at Ta’ Xbiex and failing to summon the other two co-accused to testify.\nNor had the prosecution proved the existence of the alleged brothel, identifying no premises nor proving that the accused had employed violence against his girlfriend.\nThe only clear piece of evidence was the knife found in the accused’s car whose presence he justified on the grounds of self-defence, the court observed.\nIn the light of all this, the court declared the man guilty of the unlicensed possession of the weapon and of having lived off the earnings of prostitution, as well as breaching two suspended sentences, while acquitting him of other charges.\nThe court placed the accused under a 3-year Probation Order and declared that the terms of the earlier suspended sentences were to run afresh.\nLawyers Franco Debono, Marion Camilleri and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 2773}, {"keywords": "", "author": "Denise Grech ", "article_body": "Illegal trapping was at an \"all-time high\" this spring, with more than 200 freshly-cleared sites intended for bird trapping spotted across the islands during an aerial survey.\nThe Committee Against Bird Slaughter said it filmed and reported six men illegally trapping birds on a one-kilometre square coastal strip west of Mtaħleb earlier this week.\nOnly three of the trappers were eventually caught by the police, with two suspects managing to escape and one suspect \"leaving the scene without question\", the group said.\nThe men were trapping finches using five large clap net installations equipped with live decoys and electronic calling machines, it added.\nThe operation was the biggest sting of illegal bird trapping this spring season spotted by the eNGO. No fewer than 14 cases of illegal bird trapping, involving at least 20 individuals, were reported in 12 days.\nThe reports led to the confiscation of 10 sets of clap nets and dozens of live protected birds, the group said.\nWestern coasts of Malta and the headlands of Western Gozo were the most active sites for trapping, the group said.\n\"Though the authorities are well aware that these areas are poaching hotspots they seem to do hardly anything proactive to bring the situation under control,\" CABS operations officer Lloyd Scott claimed.\n\"This is unacceptable and seeing the massive scale of abuse one could get the impression that this wildlife crime is being actively tolerated,\" he added.\n\n\n\nThe footage comes as the Ornis Committee put forward recommendations suggesting the government should open hunting for quail. NGO Birdlife Malta had warned that doing so would be make it easier to conceal illegal hunting of turtle doves.\nTurtle doves are considered a \"near threatened\" species, leading EU lawmakers to insist all hunting for it should be off-limits. \nThe government had declared a moratorium on turtle dove hunting in 2017 after the European Commission had threatened legal action against the island if the practice were allowed to continue.", "comment_count": 23, "id": 2774}, {"keywords": "", "author": "Jacob Borg", "article_body": "A proposed extension to the American University of Malta facility in Cospicua includes the building of a rooftop pool on a site adjacent to the historic Knights Building, documents lodged with the Planning Authority in January show.\nPlans show the pool.\nAddressing a press conference on Friday, PD leader Godfrey Farrugia warned that three open spaces would be taken over by the AuM if the application went through.\nOne of the open spaces, a wide staircase near the university, was renovated using EU funds.\n\n\nDr Farrugia said another area that would be taken up by the extension was used by fishermen to work on their boats.\nThe MP said public spaces were meant to be for both students and residents alike to enjoy.\nThe plans include the change of use of the Knights Building into an educational institution. An additional two floors will be built on top of the historic building. Dr Farrugia said that while surrounding buildings were three storeys high, the proposed developed went up to five storeys.\nThe PD MP urged the superintendent for cultural heritage to examine the plans for the Knights Building.\nPrime Minister Joseph Muscat inaugurated the Cospicua AuM campus earlier this month.\nAlmost two years after it first opened its doors, an official ceremony was held to inaugurate the campus, which according to the AUM currently hosts fewer than 100 students.\nIn his speech, Dr Muscat said that despite criticism about enrolment numbers, the university was now gaining traction.\nHe reiterated that a campus planned for Żonqor would still be built, but only once the Cospicua campus was full. He did not reply to questions about how many students that would take.", "comment_count": 46, "id": 2775}, {"keywords": "", "author": "", "article_body": "A 32-year-old man from Bangladesh was seriously injured after he fell a considerable height at a construction site in Depiro Street in Sliema at 8.15am.\nThe man resides in Gżira, the police said.\nHe has been hospitalised for treatment - while investigations remain under way.\nJust two hours later, a 29-year-old Somali man was also seriously injured after he was hit by falling bricks at a plant in Pembroke.\nThe police gave no other details of the accident.", "comment_count": 3, "id": 2776}, {"keywords": "", "author": "", "article_body": "BirdLife Malta has written to Prime Minister Joseph Muscat objecting to any changes to the spring hunting season both in terms of dates and the species which could be hunted. \nThe letter was sent following the Ornis Committee’s recommendation made earlier this week to the government for the season to be opened between April 10 and 30. Spring hunting in 2018 was allowed between April 1 and 21.\nThe NGO said that these dates coincide with the peak migration of thevulnerable Turtle Dove and would serve as a smokescreen for hunters to illegallytarget this species.\nBirdLife Malta also referred to the report presented by the hunting lobby calling for the lifting of the moratorium on the hunting of Turtle Dove in spring. A vote on this will be taken at the next Ornis Committee meeting planned for Tuesday since the committee members did not have access to the full report prior to last Wednesday’s meeting.\n“We are ready to understand that things do not change suddenly, but we reiterate that apart from the fact that enforcement leaves much to be desired, we categorically oppose any changes in dates for a hunting season of Quail and we can never accept a spring hunting season of any form or duration on the Turtle Dove,” BirdLife Malta CEO Mark Sultana wrote.\nA copy of the letter was also sent to Minister Josè Herrera, Parliamentary Secretary Clint Camilleri, EU Environment Commissioner Karmenu Vella, BirdLife International CEO Patricia Zurita and IUCN director general Inger Andersen.\n ", "comment_count": 2, "id": 2777}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated 5pm, adds MUT statement\nThe Union of Professional Educators warned it would report the government to European Health and Safety authorities for difficult and deplorable working conditions.\nLearning Support Educators were getting badly injured at work after being made to lift children daily, the UPE said.\nSpeaking in front of the Education Ministry in a Floriana, UPE President Graham Sansone said LSEs were required to lift 27 kilograms everyday. This was far too much and was leading to injuries at work, he said.\n\nAccording to the job description handbook, the Education Ministry and the Occupational Health and Safety Standards Authority should have reviewed work standards every two years since 2007.\nHowever, Mr Sansone believes these reports have not been done since they did not receive a copy of the reports when they asked for them.\n“This sorry state of affairs begs the question of whether the current inaction could be the result of OHSA being understaffed or MEDE forgetting to request the reports,” the union said.\nThe union called for a higher number of LSEs that would be available to lift one child if they were over 27 kilograms and an immediate review of the current policy.\n“If the union will not see any positive change in line with European labour practices, it will have no option but to notify the European Agency for Safety and Health at work of the deplorably situation our LSEs find themselves in,” Mr Sansone said.\nThe union was receiving around two reports of injuries from LSEs weekly, Mr Sansone said, adding it was not dismissing the possibility of industrial action.\nSome schools have the equipment to carry children but many mainstream schools do not, he added.\nIn a statement, the Malta Union of Teachers said it was currently revising job descriptions for all grades where it had recognition, including for LSEs.\nIt said it had created working groups who made lists of proposed changes and was currently finalising discussions with the ministry. Meetings with the directorate were scheduled accordingly.", "comment_count": 64, "id": 2778}, {"keywords": "", "author": "", "article_body": "Updated at 4.38pm, adds Opposition statement\nThe government deficit at the end of February was €62.9 million, a stark change from the surplus of €18.7 million recorded a year before.\nFigures released by the National Statistics Office indicated that the deficit was the result of more spending on both recurrent and capital items.\nDuring February 2019, debt stood at €5,440.4 million, an increase of €31.4 million from the corresponding month last year. This was primarily the result of higher Treasury Bills (€198.3 million) and the 62+ Malta Government Savings Bond (€92.6 million). Higher holdings by government funds in Malta Government Stocks also resulted a decrease in debt of €17.0 million.\nDuring the first two months of 2019, recurrent revenue amounted to €689.2 million, an increase of €31.3 million. This represented an increase of 4.8 per cent over the €657.9 million reported in revenue during the same period in 2018. This difference was primarily the result of an increase in Income Taxand Social Security.\nTotal expenditure at the end of February 2019 stood at €752.1 million, a 17.7 per cent increase over the first two months of 2018.\nRecurrent expenditure stood at €650.9 million, €73.9 million higher than the corresponding amount reported in the same period last year. The main contributor to this increase was a €53.2 million rise in Programmes and Initiatives – mainly added outlays due to EU own resources (€24.8 million) and social security benefits (€12.4 million). A drop of €2.8 million in treasury pensions slightly off set this rise in outlay.\nThe interest component of the public debt servicing costs amounted to €36.7 million, a €0.4 million increase from 2018.\nGovernment’s capital expenditure registered an increase of €38.7 million over the same period last year and amounted to €64.5 million.\nThe rise in outlay was mainly due to added expenditure reported on EU Internal Security Fund - Borders and Visa (€14.6 million) and road construction and improvements (€14.2 million).\n€35 million surplus needed for December to avoid deficit - Opposition\nThe government needed to close off December with a surplus of €35 million to avoid ending the year with a deficit, the Opposition said as it requested more information on the situation.\nFinance shadow minister Mario de Marco said in a statement that according to data published by the National Office of Statistics, the deficit accumulated in the first two months of the year amounted to €62 million representing a 436% negative change on the situation in the corresponding period of 2018.\nThe deficit in February, amounting to €8 million, pointed to a trend of monthly deficits going back to October. That month, the government sustained a deficit of €27 million, followed by a deficit of €11 million in November and €55 million in January.\nDr de Marco said the Opposition had, over the past years, cautioned the government on the accelerated increase in recurrent expenditure, at a time when the country was experiencing elevated growth rates.\nThis expenditure was being financed by one-off or short-term revenue streams - such as proceeds from the IIP scheme – potentially leading to budgetary shortfalls in the medium to long-term.\nThis point was also made by the European Commission in the Country Report on Malta 2019, published on February 27.\nThis report highlighted significant risks to the long-term sustainability of government finances. It pointed out \"possible risks associated with financing permanent expenditure increases from potentially temporary revenue flows\".\nThe Opposition reiterated its call for fiscal and political responsibility in the interest of future generations.", "comment_count": 0, "id": 2779}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The sole director of a cleaning firm that received more than €9 million in direct orders in three years owed the Inland Revenue Department over €4 million in unpaid taxes.\nRecords show that, in October, 2017, X Clean director Denis Xuereb had been asked through a judicial letter to pay over €530,000 in unpaid taxes. \nDenis Xuereb\nAccording to the official document, he had not paid taxes in the previous eight years.\nA few months later, Mr Xuereb, this time as director and owner of cleaning firm Euro Hygiene International Ltd, received another bill to settle €3.5 million in unpaid taxes.\nA spokesman for the Inland Revenue Department declined to say whether Mr Xuereb had regularised his position since, adding issues related to tax dues could not be discussed.\nAccording to the Registry of Companies, Euro Hygiene International Ltd is no longer trading and had not filed its accounts for many years.\nMr Xuereb founded X Clean in April 2015 to be able to service St Vincent De Paul Home for the Elderly, in Luqa, since his other company was in an insolvent state. \nX Clean has not submitted any audited accounts so far.\nThe Times of Malta has reported that, through the direct intervention of the Family Affairs Ministry, at the time headed by Michael Farrugia, the administration of St Vincent De Paul had been directed in March 2015 to award the cleaning services contract to Mr Xuereb through a direct order. \nAlthough this had originally to be a temporary measure for a maximum of six months, the direct order kept being renewed every six months.\nHe had not paid taxes in the previous eight years\nIn the meantime, while until March 2015 the costs incurred for cleaning by the home for the elderly used to be about €100,000 a month, costs started ballooning reaching about €300,000 a month though other ‘services’ were added when X Clean took over.\nIt was only last December, after the matter was raised in this newspaper, that the government published a call for tenders. The contract was not awarded yet.\nContracts Department director general Tony Cachia had said the tender took long to be issued as it was “complicated” and required a lot of time to conclude. \nMr Cachia also pointed out that his department had not approved the provision of other services except for cleaning.\nDocuments show that X Clean charged St Vincent De Paul Home for a raft of other services including hairdressing, engineering, gardening, street cleaning and others.", "comment_count": 90, "id": 2780}, {"keywords": "", "author": "Denise Grech ", "article_body": "The government has shrugged off criticism that the public was not adequately informed about its planned tunnel linking Malta and Gozo, insisting the studies would be published \"soon\".\nThe publication of the studies was required as part of the process determining permits for excavation, the government said. \nThe Church Environment Commission earlier this week joined over 13 NGOs warning there was no reliable information in the public domain allowing people to make an informed decision about the tunnel or any alternatives.\n\"The public is currently being fed information and assertions that are not backed by readily available evidence,\" the Church Commission said.\nPlans for a 13-kilometre tunnel between Manikata and Nadur will be forging ahead, the government said, insisting the project was part of its 2017 electoral mandate.\nWatch: Prime Minister Joseph Muscat details plans for infrastructure of the future\nHitting back at criticism that no adequate studies were done, the government said studies have been ongoing \"for years\".\nIt added that a social impact assessment and a cost-benefit analysis had both been completed. Authorities were also in the process of completing an Environmental Impact Assessment, the preliminary findings of which would be published in the coming months, it said. \nThese studies would then form the basis of a public consultation, it added. \nThe government insisted it would be forging ahead with the project,\" with the greatest attention and in the most meticulous way\" to ensure it can be completed in a sustainable manner.", "comment_count": 24, "id": 2781}, {"keywords": "", "author": "", "article_body": "There are 371,632 people registered to vote in Malta in the European Parliament elections on May 25 - 18,084 of whom are non-Maltese EU nationals.\nVoters in Malta will be among the more than 370 million voters around the EU 27, including 23 million first-time voters, who will be shaping the future of the European Union in the coming decisive elections, EP Office acting Head Anna Zammit Vella explained during an information session organised by the European Parliament Office in Malta and the Electoral Commission of Malta.\nIf the UK is still part of the EU and thus required by law to hold European elections, over 53 million people in the age of voting may be added to this total.“Turnout in 2014 was less than half of Europeans, but polls are showing a very positive trend in both people’s intention to vote and in the perception of the EU with over two thirds of Europeans thinking of the EU as a good thing,” Ms Zammit Vella said.\nThe registration process for voters in Malta is automatic for holders of Maltese citizenship. EU nationals have the option to choose whether to vote in Malta - for candidates standing for election in Malta - or in their home member state, the Head of the Electoral Commission Joseph Church explained to the ambassadors, consuls and embassy representatives at the session.\nStep 1 in the registration process requires those eligible to vote to have a valid identification document, which is a residence card issued by Identity Malta for EU nationals. EU nationals are given the option to choose whether they wish to fill in the Application Form to be registered as a voter in the Local Councils Electoral Register and/or in the European Union Electoral Register. If an EU national had opted not to vote in Malta but now wishes to do so, s/he can fill in the application form now and send it to the Electoral Commission.\nThis can be done via post, free-of-charge, or through Local Councils or Police stations, which are now fully informed of the process and their duty to transmit voter registration forms to the Electoral Commission. Only the Electoral Commission that has the power to register voters in the electoral roll, addressing the apparent misconception that this can be done by the police or local councils. Voter registration via the post, as foreseen under the law, is increasing, Mr Church noted.\nThe deadline for registrations is March 31, 2019. The Electoral Commission will accept registrations received via post up until April 1 if these were sent before the deadline.\nEligible first-time voters will include for the first time in Malta those who turn 16 by May 24, 2019, the day before the elections. Their registration process is the same.\nThe electoral authorities of other EU member state will be informed of EU nationals opting to vote in Malta, to avoid illegal double-voting. Under EU and national electoral law, each voter may only vote once in one member state, including holders of dual nationality.\nMore information on the voter registration process in Malta is available on the new step-by-step guide on the Electoral Commission website and on the European Elections website, which includes information on election dates and how to vote in all EU member states.\nWhat the EU does for me aims to inform voters on EU action in the home countries, professions and interests, and the Citizens’ App for mobile phones add stories from the ground.", "comment_count": 33, "id": 2782}, {"keywords": "", "author": "Keith Micallef", "article_body": "Six years after being overruled by the central government, the Sliema local council is still waiting the go-ahead to roll out a parking scheme that enjoys the residents’ overwhelming backing.\nThe issue was raised in Parliament recently by Nationalist MP Karol Aquilina but, for the umpteenth time, the reply given was that the Transport Ministry was conducting a nationwide study on the matter. Moreover, Transport Minister Ian Borg said talks were under way with the Department of Local Government and local councils to find a way to improve the situation.\nThe saga dates back a decade, when the Sliema council received the green light to introduce a residents’ parking scheme, similar to those in force in other localities. However, a rather turbulent period characterised by resignations and various changes at the helm, meant the scheme was put on hold for the rest of the council’s mandate.\nIn April 2013, a year after a new council had been installed, the parking scheme was rolled out with half of Sliema’s parking slots reserved for residents. \nParking in reserved areas was only allowed for up to two hours and any breach of the regulations would result in a €23 fine. The scheme was short-lived because, a few weeks later, the Cabinet intervened to suspend it. The decision came in the wake of a protest in the form of an hour-long strike by teachers in five Sliema schools.\nSubsequently, in June 2013, the scheme was repealed through a legal notice. Six years down the line it is still in limbo although existing schemes in other localities remain.\nSliema mayor Anthony Chircop expressed disappointment on the state of affairs and the manner in which the council had been left in the dark on the matter.\nHe recounted to the Times of Malta that the council had rolled out the scheme gradually on a trial basis to gauge the feedback and was willing to make some changes.\n“While it made sense to restrict parking in certain areas at certain times, circumstances in other zones dictated different arrangements,” he said. \nMr Chircop pointed out that, three years ago, the council had sought the residents’ feedback on the matter through a survey commissioned to Misco.\nFrom this exercise it had transpired that close to three-quarters (72 per cent) of those interviewed were in favour of timed parking.\n“Yet, the authorities are giving us the cold shoulder and did not even react when the council filed a judicial protest against the decision to suspend the scheme,” Mr Chircop remarked.", "comment_count": 84, "id": 2783}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to Friday's front pages:\nThe Times of Malta reports on a seminar on Thursday which discussed the European Commission's report on Malta, under the headline 'Brussels sees lack of progress on corruption'. It also explains how the prosecuting side of the Attorney General's role is to be hived off.\nThe Malta Independent also features the Attorney General story, along with one about a person with HIV who is finding it hard to find a relationship because of the disease.\nIn-Nazzjon writes about the visit of the Opposition leader Adrian Delia to Brussels for the PPE meeting and his speech on Brexit and against abortion.\nL-Orizzont also takes about the division of the Attorney General's role, and reports that 58 babies will be born as a result of the IVF procedures carried out in 2018.", "comment_count": 0, "id": 2784}, {"keywords": "", "author": "", "article_body": "President Marie-Louise Coleiro Preca met Italy’s President Sergio Mattarella at the Quirinale Palace.\nDuring the meeting, they touched upon a variety of issues of mutual interest currently affecting the Euro-Mediterranean region.President Coleiro Preca said that both Malta and Italy enjoyed excellent bilateral relations on a diplomatic and political level and added that these relations developed further over the years thanks to increased people-to-people contact at all levels of society, with a strong Maltese diaspora in Italy and an even stronger Italian diaspora in Malta.President Coleiro Preca and President Mattarella also spoke on the future of Europe in light of the upcoming European Parliament elections in May; the phenomenon of migration and how sustainable direct investment in Africa could be part of the solution to this phenomenon; and of the Arraiolos Group of non-executive EU Presidents, which provides the non-executive presidents with a platform to bring forward their peoples’ feelings, concerns, suggestions, and aspirations.At the end of the meeting, President Coleiro Preca thanked President Mattarella for his ooperation at various moments during her tenure, describing him as a wise leader, not only in Italy, but in Europe.\nPresident Coleiro Preca was accompanied by Foreign Affairs Minister Carmelo Abela and Malta’s Ambassador to Italy Vanessa Frazier.", "comment_count": 2, "id": 2785}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "As a violent storm swept across Malta a few weeks ago, Doris Doublet, 85, recalled a similar tempest during her childhood, when she spent three days anxiously awaiting news of her father, trapped by huge waves in the Ricasoli lighthouse.\nToni Spiteri, who resided in Valletta, tended to lighthouses during the war and the years that followed and his daughter spent her early years growing up in one such structure at Tigné, narrowly escaping its destruction in a wartime air raid.\nIt was some years later, in February 1949, that tragedy nearly struck again.\nHer father, then aged 48, had spent a normal night of work manning the Ricasoli lighthouse but, early the next morning, strong winds and huge waves smashed the glass on the upper level and broke through the doors below, flooding the entire building.\nWith waves relentlessly crashing over the breakwater that connects the lighthouse to the mainland, he and a co-worker, Salvu Micallef, 54, of Mosta, were cut off and trapped inside.\nWhen he did not return home, Ms Doublet and her family feared the worst.\nThe two men were eventually treading water in the dark\n“I remember my mother crying. We all thought he was dead, everyone was going around saying he had died,” she said.\nIn an interview given a few days later, Mr Spiteri said the lighthouse had continued to flood and the two men were eventually treading water in the dark. With the waves showing no sign of abating, they found themselves stuck there for the whole day and into the night, slowly losing strength and with no water except that used to flush toilets, while praying to Our Lady of Mellieħa for rescue.\nEventually, early on the second morning, they realised their only hope was to brave the breakwater outside.\nSaying another prayer to Our Lady, they made their way through the wrecked doors, according to their own reports days later, getting out moments before the lighthouse machinery crashed down on the room they had just been in.\n\n“He had started counting the waves,” Ms Doublet recalls her father telling her, “and he realised that every seventh one broke across the breakwater. So they waited for the right moment, then they took their chance and ran.”\nThe two men battled their way across, occasionally stopping to help the other along, making it up the ladder and onto solid land with their last bit of strength: “our hands swollen, our clothes torn and our bodies broken,” as Mr Spiteri put it later.\nThey were rushed to hospital, where they were kept for a few days. Ms Doublet recalls that when he finally returned home, he said it was the thought of his family and the need to see them again that had carried him through.\nBut there still was one bit of business to wrap up: shortly after his ordeal, Mr Spiteri travelled to the Sanctuary of Our Lady of Mellieħa to show his gratitude for the intercession he believed had saved him, leaving there a framed record of the experience that hangs on the walls to this day.", "comment_count": 1, "id": 2786}, {"keywords": "", "author": "", "article_body": "IVF cycles carried out in Malta last year will lead to the birth of 58 children, official figures show.There were 246 IVF cycles at Mater Dei Hospital and private clinics in 2018, according to the Embryo Protection Authority’s annual report, resulting in 56 pregnancies, a success rate of around 23%.Around 4% of these pregnancies failed, meaning the number of children born from the procedure (referred to as the ‘take-home baby rate’) was 18.7%, which is 1.9% higher than the previous year.Health minister Chris Fearne said that, following the introduction of the new IVF law in October 2018, the vast majority of couples had opted to make use of the new provisions, fertilising the new maximum of five eggs.Just seven out of the 34 couples who used IVF since the introduction of the new law opted against it.The changes to the Embryo Protection Act included increasing the amount of eggs that could be fertilised, as well as opening eligibility up to same-sex couples and single parents.The amendments proved controversial particularly in respect of the introduction of embryo freezing, which opponents said would undermine the protection of ‘life from conception’.", "comment_count": 0, "id": 2787}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An alleged rapist’s efforts to obtain bail may have gone to waste when he allegedly chose to dance the night away, well beyond court-imposed curfew hours.\nThe 39-year old Portuguese national, whose name cannot be published under a court ban issued by another magistrate presiding over the rape proceedings, had been targeted by criminal prosecution in November after a report filed by his former partner alleging that she had been the victim of his harassment.\nThe woman had also claimed that two years ago she had been raped by the accused.\nFollowing his arraignment four months ago, the man had been remanded in custody before a fresh request for bail was acceded to by the Magistrates’ Court.\nHowever, that grant was later revoked by the Criminal Court upon an application by the Attorney General.\nBail was granted a second time by the Magistrates’ Court, presiding over the compilation of evidence, later in the proceedings and after civilian witnesses had deposed.\nHowever, the accused’s bail conditions had been rendered stricter by the Criminal Court last month by fixing the curfew at 9pm instead of the former 11pm and also upping the bail deposit to €10,000 instead of the original €6,000.\nThat deposit, together with a personal guarantee of €14,000, risked being forfeited in favour of the public coffers should the accused be declared guilty of breaching bail, following his alleged infringement of court conditions.\nThe man was arraigned under arrest on Thursday after a series of circumstances culminated in incriminating footage of the man allegedly dancing at a Paceville club close to midnight on March 10 and “having a good time”.\nDuring the arraignment, prosecuting Inspector Bernardette Valletta explained how the man had ignored court orders even by contacting the victim’s former boyfriend who lives abroad, putting “personal and intimate questions” concerning the woman, which the other man had flatly refused to answer, later calling the woman and “giving her a piece of his mind”.\nThis contact with the woman’s other ex amounted to harassment, argued the inspector, her claim rebutted by defence lawyer Marion Camilleri who pointed out that the third party did not live in Malta and was not a party to the proceedings against the accused.\nThe man was remanded in custody while the court, presided over by magistrate Donatella Frendo Dimech, adjourned the case for continuation next week.\nLawyers Franco Debono and Amadeus Cachia were also defence counsel.", "comment_count": 0, "id": 2788}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The public has not been provided with the details it needs to make an informed decision on the planned Malta-Gozo tunnel, the Church environment commission warned on Thursday.The commission urged the government to publish all studies and research carried out on the alternative options for better accessibility between Malta and Gozo, indicating which offered the best environmental, social and economic sustainability.It also called for the publication of studies on the new jobs and investment that could be created by the different options, and the facts that may still deter investors from Gozo once accessibility was improved.“The Kummissjoni Ambjent (KA) believes there exists no sound and reliable information in the public domain which could help one make an informed analysis of the possible alternatives which would truly improve accessibility between the two islands,” the commission said.“The public is currently being fed information and assertions that are not backed by readily available evidence. Past promises of a fast ferry service and that of a fourth ship in the Gozo Channel fleet are as yet, unfulfilled. Moreover, the helicopter emergency service operating between the Gozo General Hospital and Mater Dei Hospital has deteriorated.”The public is currently being fed information and assertions that are not backed by readily available evidence\nGovernment plans for a 13-kilometre tunnel between Manikata and Nadur are forging ahead, despite concerns over the environmental impact and increased traffic in Gozo. Studies cited by government have consistently pointed to high levels of support for the project.\nThe commission, however, said arguments in favour of the tunnel were made stronger by the lack of improvement in the existing services, as other options had not been considered or evaluated.It called for the publication of a full cost-benefit analysis of the various alternatives to the tunnel, and a more detailed study of the factors holding back investment in Gozo.“The economic aspect has to be studied in detail, and will have to go beyond the concept that better accessibility (whatever the means adopted) may solve all the economic and investment challenges of Gozo,” it said.\nThe commission appealed to the planning and environment authorities to ensure that the rules governing environmental and social impact assessments were “strictly adhered to without any legalistic stratagems similar to those used in the case of the changes made to the Smart City masterplan”.It also appealed to the Auditor General to ensure the choice of options was above board and gave good value for money for Gozo’s development.\n“Above all, the selected option should not create negative impacts which would then have to be endured by Gozo and the Gozitans,” the commission said.", "comment_count": 41, "id": 2789}, {"keywords": "", "author": "", "article_body": "Updated with new clips 6pm\nLast year, a downpour on the first day of summer caused chaos: this year, it was the first day of spring...\nHeavy rains brought traffic to a standstill in various areas of Malta as roads were flooded, including a car park in Mrieħel close to the Forestals showroom, which lies below the level of the adjacent bypass.\nCommuters were trapped in heavy traffic, with up to a third of a metre of water in many places, just minutes after the sudden downpour around 4pm. \n\n\"Water is pouring down all the side streets to the Strand in Gżira but it gets trapped on one side of the street and cannot drain into the sea,\" one driver said.\nA Kalkara resident said water was gushing out of a manhole, adding to the water already on the roads. \nWater is gushing out of this manhole cover in Kalkara.\nThe Swieqi mayor also reported that some stone slabs were dislodged in the corner Triq il Ħemel/Spiera in his locality and that they were waiting for the Civil Protection Department to remove the danger.\nThe scene in Swieqi.\nTa' Xbiex seafront.\nAnother driver said that the bottom end of Telgħa t'Alla u Ommu was also flooded with several vehicles stalled there.\nWater pouring down steep stairs in Marsascala added to the already flooded roads, as can be seen in this FB video posted by Joanna Gatt.\nVideo by Joanna Gatt shows the problems in Marsascala.\nNusa Aquilina's video shows how quickly residential streets can become inaccessible.\n\nBaħar iċ-Ċagħaq, Stephen Cassar\nValletta, Hugh Peralta\nThe Meteorological Office had been warning for the past few days of strong winds and heavy rains, with thunderstorms also forecast for Friday.\nHave you got photos or videos of the flooding? Send them to mynews@timesofmalta.com", "comment_count": 71, "id": 2790}, {"keywords": "", "author": "", "article_body": "The Malta Water Association (MWA) has decided to cease operations on World Water Day 2019, exactly eight years after it was set up, saying it was giving up in the face of apathy.\nThe MWA is Malta’s only NGO focused exclusively on water.\nIt was founded in March 2011 “to make water everybody’s business”, communicating, educating, developing knowledge and raising public awareness on the sustainable management of Malta’s scarce and fast-depleting natural water resources.\nIt lobbied extensively for the protection of Malta’s water reserves, particularly groundwater, under threat from over-pumping and contamination. It produced and issued a number of position papers on various aspects of the subject, participated in meetings with government and EU officials and on TV and radio programmes.\nIt met ministers and politicians to discuss policy, gave talks to interested groups, and submitted proposals to political parties’ electoral manifestos.\nHowever, it was increasingly being felt among the executive and the membership base of the association that it was fighting a losing battle, with sustainability only being given lip service by the political classes.\nSix years after the Labour and Nationalist Parties and Alternattiva Demokratika promised to deliver a National Water Management Plan as a priority in their electoral manifesto, the country still lacked a plan.\nBorehole extraction remains rampant\nMeanwhile, multi-million euro water projects were limited in scope and failed to address the serious issues of water over-abstraction and contamination; private extraction by boreholes remained rampant, uncontrolled and not charged; water saving campaigns were largely non-existent and/or sporadic, and water planning in major projects largely non-existent.\nEven centuries-old legislation that required new buildings to have rainwater cisterns was being blatantly ignored, with enforcement non-existent – with the result that Malta had no emergency reserve of fresh water in buildings, and experienced flooding and surcharging of sewers with each storm event.\nA misdirected multi-million euro flood relief project had no capability to harness stormwater, and conveyed millions of cubic metres of this fresh water resource directly to sea.Failure by Malta’s politicians to address this would result in future generations having to pay massive fines to the EU\nAgricultural policy, which needed to be radically revamped and integrated with a national water plan, currently favoured an increase in irrigation (even in the dry summer months), resulting in massive abstraction of groundwater, with the consequence of the abstracted groundwater becoming more saline, to the detriment of farmers and the country.\nMoreover, lack of controls in the application of fertiliser resulted in groundwater being rendered unfit for potable use through contamination by nitrate. This was resulting in Malta becoming increasing dependent on expensive reverse osmosis plants which had a number of vulnerabilities and posed a number of risks.\nWhile the production of second class water from sewage was a welcome development and one which the association had campaigned for, it did not solve the over exploitation of ground water, nor the need for expensive reverse osmosis water.\nFailure by Malta’s politicians to address this would result in future generations having to pay massive fines to the EU, for not restoring aquifers to a good status by the established deadlines. The country would also be facing a future without affordable and strategically-important fresh water resources.\nAs this century progressed, Malta faced hotter and more arid scenarios related to climate change, which would exacerbate water demands on the country. To this one should add the pressures of a planned increase in population, which would put additional pressure on the already-stressed finite water resources.\nThe MWA said that in spite of its repeated warnings and suggestions, as well as these very real threats, the situation went from bad to worse and there was no political commitment and courage to address the damage being done.", "comment_count": 56, "id": 2791}, {"keywords": "", "author": "", "article_body": "Members of the Civil Protection Department will be assisting in the restoration of a 1940 Fordson7v Fire tender, under the direction of Heritage Malta officials.\nThe vehicle, which was used during the war-time in Malta, forms part of the national collection managed by Heritage Malta.\nThe pumping appliance was built in around 1940 and was standard issue from the Home Office in Britain for the Auxiliary Fire Service in the UK from 1939 until 1943. Many hundreds were built for the fire brigade but some were then diverted to the Armed Forces.\nThe vehicle now held by Heritage Malta was at the time diverted to the Royal Air Force. It was powered by a Ford V8 ‘Flathead’ engine, as was the Sulzer Pump carried on the rear of the vehicle, thereby having two Ford V8 engines.\nThe fire engine was also equipped with an Ajax 20ft ladder on the roof. It was painted in Royal Air Force (RAF) colours and was used in one of the three local RAF aerodromes and airstrips of World War II.\nEventually, the restored fire engine will be exhibited at Fort St Elmo which hosts the National War Museum. Heritage Malta will also provide professional technical advice to the CPD, while the latter will provide fire-fighting courses to Heritage Malta staff.\nMeanwhile, Heritage Malta will assist in the restoration of the old air traffic control tower at Ħal Far.\nBoth initiatives follow a memorandum of understanding signed between Heritage Malta and the CPD.\nCPD director general Emanuel Psaila said this collaboration was one of a series of agreements taking place with a number of entities to enhance co-ordination.\nHeritage Malta acting CEO Noel Zammit welcomed this agreement saying such collaborations with experts outside the agency were welcome.", "comment_count": 0, "id": 2792}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A teenager was remanded in custody after pleading not guilty to two instances of theft, the first seven months ago, and targeting an elderly couple’s home.\nThe 19-year old construction worker, was escorted to court under arrest and charged with stealing jewellery and other items from an elderly couple’s home in Attard in August.\nAnother charge linked the young man to the alleged aggravated theft of a mobile phone from a social shelter at Birkirkara in February. He was further charged with breaching the terms of a probation order issued in 2017.\nThroughout the arraignment, scanty details emerged as to the circumstances leading to the arrest of the suspect who, apparently, had proved difficult to trace.\nA request for bail by defence lawyer Raisa Colombo was objected to by the prosecution who pointed out that the alleged victims still had to testify, adding that one of the victims of the first theft was a 78-year-old lady and a vulnerable person.\nMoreover, when releasing his statement to the police, the man had described himself as ‘homeless,’ in spite of declaring otherwise when asked specifically by the court at the start of Thursday’s arraignment, the prosecution argued.\nAfter hearing submissions by both parties, the court, presided over by magistrate Donatella Frendo Dimech, turned down the request for bail in view of the gravity of the offences, the lack of trustworthiness of the accused, his lack of a fixed residence as well as the fact that civilian witnesses were still to testify.\nThe court upheld a request by the defence for a temporary supervision order to be issued in respect of the accused.\nInspector Christina Delia prosecuted.", "comment_count": 0, "id": 2793}, {"keywords": "", "author": "", "article_body": "More than 60 Maltese scientists and scholars issued a statement on Thursday to point out the consequences of inadequate action regarding climate change.\nThe business as usual scenarios for climate, biodiversity, forest, marine, and soil protection were far from sufficient, they said, adding that only with quick and consistent action could global warming be limited, halting the mass extinction of animal and plant species, preserving the natural basis for life and creating a future worth living for present and future generations. The scholars said that, in Malta, young people have been urging politicians to take serious action about climate change since 2008.\nHowever, neither necessary scale nor speed were being achieved in the restructuring of the energy, food, agriculture, resource, and mobility sectors.\nMalta, they said, would fail to meet the climate protection targets it had set for itself for 2020.While participation and discussion had to continue, action had to be taken now. Many social and technological innovations already existed which could maintain quality of life and improve human health and well-being without destroying natural resources.\nYoung people were reminding politicians, in particular, of their responsibility to create the necessary framework to ensure this change happened now – even if it meant being unpopular in the short term.\nCO2 prices, cessation of subsidies for climate-damaging actions and products, effective education campaigns, efficiency regulations supported by research and evidence, and social innovations had to be fostered - rather than short-term and one-sided economic interests.\n“We must urgently and drastically reduce our net CO2 emissions. With new courage and the necessary speed, we must introduce renewable energy sources, consistently implement energy-saving measures, fundamentally change our patterns of nutrition, mobility, consumption and production. A socially balanced distribution of the costs and benefits of change is essential.”They pointed out that the enormous mobilisation of the 'Fridays for Future/Climate Strike' movement showed that young people looked at the scientific facts and understood the situation, and were now demanding politicians to do likewise.\n“As scientists and scholars, we emphatically approve their demand for rapid and forceful action,” they said.", "comment_count": 7, "id": 2794}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Banks inside and outside Malta would be willing to open accounts for cryptocurrency companies once they felt they could manage the risks involved, the head of a cyber-intelligence company in the sector said.\nCipherTrace recently signed a one-year automatically renewable contract with the Malta Financial Services Authority to provide checks on cryptocurrency assets.\nThe regulator is going through procedures for the approval of the 29 cryptocurrency agents – known as virtual financial asset agents – that have already applied for licences. Once approved, the agents are expected to submit applications for operators like exchanges, wallets and initial coin offerings.\nWhile the agents are expected to do the due diligence on the individuals and entities behind such operators, the MFSA will still require tracking of the assets that flow through them, which is where CipherTrace will come in.\nTimes of Malta reported that banks are reluctant to open accounts for companies in the cryptocurrency sector but CipherTrace CEO Dave Jevans believes that will change once regulations were in place and the sector proved to be actively supervised.\nCipherTrace CEO Dave Jevans is confident trust in the cryptocurrency sector will increase once regulation is in place and working.\n“As we know, there has been a lot of pressure on Malta to get more compliance. We are aware of banks interested in working in Malta and banks already here interested in providing accounts. It is all about managing the risk,” he said in a telephone interview from the US.\n“Once the VFA agents are approved, they will do audits on their customers. They can use the same tools the MFSA is using.\n“We have a very strong role not only for the companies using our system but also the banks using it to audit those companies and the agents using it to audit their customers. We have seen that strategy play out in different places around the world.\n“We are confident that would work in Malta as well to give banks assurances about their customers,” he added.\nSector requires a proactive approach\nMr Jevans admitted the sector required a proactive approach to keep one step ahead of criminals.\n“By having really state-of-the-art capabilities in monitoring criminal activity and criminal forums, dark webs and money-laundering services, you can be quite effective. You can never be 100 per cent effective but that applies to any system whether it is a cyber one or not.\n“We have a strong background in tracing criminal, money-laundering or terrorist activity. We keep catching up. We also think forward as our team has been involved in beating online and cybercrime for 20 years in different projects and companies,” he said.\nMr Jevans said gathering intelligence on cryptocurrency transactions was not as impossible as it might sound to outsiders.\nTransactions might not necessarily be associated with the individual making them but it was possible to track transactions by the same person or company.\nAnd once crypto was changed into money – so-called fiat currencies – anonymity ended.\n“If, at some point, you access the banking system, you will need to provide identification and have a bank account. And that is true of Bitcoin or any other cryptocurrency,” he said.\nHowever, even crypto-to-crypto transactions were falling under the spotlight.\n“There was the perception that if you are not converting crypto to fiat currency and don’t need a bank account, then you do not need compliance,” he said.\n“That is a fallacy and the US has really put a lot of pressure on some of these crypto-to-crypto exchanges to have compliance and that is working.”\nWill all this regulation, monitoring and enforcement help to reverse the bad im-pression given by well-publicised collapses and outright frauds in the sector?\nMr Jevans is adamant that regulation is the answer, whether for exchanges, wallets or initial coin offerings.\n“You have seen most of these issues in countries that have not had good regulation and, more importantly, good supervision, without which regulation is just a piece of paper. Regulatory oversight is one of the biggest answers to the problems we have seen in unregulated countries where there are no audit requirements,” he remarked.\nHe said the race was on for Malta to be the jurisdiction that was safe for investors and for companies to operate in.\nThe island, he continued, crafted its regulation after looking at other jurisdictions, including the US, Japan and Switzerland.\nOther countries, like Abu Dhabi, were trying to draw up regulations for the Gulf and were looking at Malta’s lead.\n“Being a first mover in this case is an advantage,” Mr Jevans noted.\nHighlights from CipherTrace’s report\n• $1.7 billion worth of cryptocurrency stolen and scammed in 2018 has yet to be laundered.\n• Of the $1.7 billion, hackers stole more than $950 million from cryptocurrency exchanges and infrastructure, 3.6 times more than in 2017.\n• ICO exit scams, phony exchange hacks and Ponzi schemes victimised investors and cryptocurrency users for almost $0.75 billion.\n• Bad guys have to launder the funds before tough new global anti-money laundering and counter terror financing regulations come into effect over the next year.\nSource: Cryptocurrency Anti-Money Laundering Report", "comment_count": 2, "id": 2795}, {"keywords": "", "author": "", "article_body": "President Marie-Louise Coleiro Preca held an audience with Pope Francis at the Vatican, days before she leaves office.\nThe Vatican press service said the two discussed collaboration between the Holy See and Malta, the prospects of European integration, migration in the Mediterranean and inter-religious dialogue.\nThe President also had a meeting with Secretary of State Cardinal Pietro Parolin, accompanied by Mgr Antoine Camilleri, Under-Secretary for Relations with States.\nThey discussed the collaboration between the Church and the State in favour of the human, social, cultural and spiritual progress of the population, particularly of the young, in light of the century-old contribution that Catholicism has offered to the country, the press service said. \nThe president was accompanied by, among others, Foreign Minister Carmelo Abela. \nThe president first formally met Pope Francis in September 2014, when she invited him to visit Malta. She also called at the Vatican in 2016. ", "comment_count": 34, "id": 2796}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority has approved an eight-storey hotel in Mellieħa, despite the local council’s objections that the proposal breached the area’s height limitation.The plans, by J. Portelli Projects, include 120 residential units, shops, a hotel, underground parking and garages on a vacant 3,600 square metre plot close to the Valyou supermarket, the site formerly occupied by the Belleview restaurant.The plan had been recommended for refusal due to planning policy limiting buildings in the area to just three floors, although hotels could benefit from an adjustment policy allowing an extra two floors above that.Nevertheless, at a hearing earlier this month, the PA board indicated that it was ready to approve the application on the basis of a separate flexibility policy. The decision was formalised on Thursday by a vote of nine to four, with those against being board chairman Vince Cassar, Environment and Resources Authority (ERA) chairman Victor Axiak, NGO representative Annick Bonello and Mellieħa mayor John Buttigieg.The local council, which had long sought to use the formerly government-owned land for community facilities, had already objected to the project, describing it as overly-intensive and incompatible with its surroundings.During the hearing, architect Carmel Cacopardo, representing objectors, insisted the board’s decision went against local plan policies that prohibited a hotel on the site, and that the flexibility policy was not intended to supersede height limitations.Nationalist MP Robert Cutajar, formerly mayor of the town, added that the area had always been zoned for residential use.The project architect presented new plans incorporating more green landscaping into the design, the one concession to concerns raised in the previous hearing. The case officer had originally requested far more extensive changes, including eliminating the eighth floor of the hotel section and apartments on the fifth and sixth floors, and redesigning other parts of the development to include receded floors.But the project architect had consistently maintained that the plans were in line with policy and had declined to carry out the requested changes.", "comment_count": 51, "id": 2797}, {"keywords": "", "author": "", "article_body": "The first details of Malta’s Artificial Intelligence policy were announced on Thursday at a workshop organised by the MALTA.ai taskforce.\nSilvio Schembri, Parliamentary Secretary for Financial Services and the Digital Economy, said that Malta aspires to become a jurisdiction in which local and foreign companies and entrepreneurs can develop, prototype, test and scale AI, and ultimately showcase the value from their innovations.\n\"Our ambition is to create the conditions for AI to a springboard from Malta to the world”, he said.\nHe said that the.AI Taskforce identified three strategic pillars: Investment, Start-ups and Innovation; Public Sector Adoption and Private Sector Adoption.\nThere were also three enablers: Education and Workforce, a Legal and Ethical Framework, and Ecosystem Infrastructure.\nThe main objectives of the Investment, Start-ups and Innovation segment are to make Malta a centre of excellence and a technological hub in the field of AI by attracting leading AI companies to set up operation in Malta, stimulate local start-up activity and raise awareness and visibility of the Malta AI sector.\nThe main goal for the Public Sector Adoption is for the government to take a lead in showcasing the benefits that can be brought about by AI by using the technology to provide better services to citizens/businesses, improving the economic and social wellbeing of Malta and enhancing the internal operations of the Public Service Sector.\n“Our aim is to create an AI-powered government and to do so will assess a number of use cases for public sector applications. These AI use cases will be clearly defined and then assessed against criteria that will consider operational, economic, financial, legal and regulatory aspects, with a view of identifying the projects that can generate the biggest local impact,\" Mr Schembri explained. \n\"These projects will be gradually implemented as pilot projects with a view of later rolling them out across the nation”.\nHe added that this pillar will ensure capacity and capability building and knowledge transfer within the public sector, address training needs, help drive a cultural shift, change management and will also seek to encourage the procurement of smart technology-based solutions with the Public Service.\nOn Private Sector Adoption, he said that the aim is to encourage SMEs to embrace and adopt AI, help local businesses to use AI and build trust in how AI works in terms of transparency and accountability. \nThe policy document will be open for public consultation until April 22. It can be accessed at:\nhttps://malta.ai/wp-content/uploads/2019/03/Towards-an-AI-Strategy.pdf\n ", "comment_count": 15, "id": 2798}, {"keywords": "", "author": "", "article_body": "Updated at 5.10pm, adds Adrian Delia's statement\n\nThe government is to launch a constitutional amendment so that the functions of Prosecutor General will be hived off from those of the Attorney General.\nThe changes appear to be similar to what had been proposed by a Nationalist government in May 2002, and rejected by the Labour Opposition at the time.\nJustice Minister Owen Bonnici said on Thursday that the proposal for a constitutional amendment had been made by the Venice Commission on the rule of law in Malta.\nHe said the government hoped to see legislation through by the summer. The first reading will be moved on Monday.\n\n\n\nIn terms of the change, the person responsible for prosecutions will be separate from the attorney general, who is the government's legal counsel.\nHe noted that once in place, the selection for the persons for the two roles would be based on the existing mechanism of choosing the AG, on which he said, the commission had no issues.\nREAD: What rule of law experts said about Malta - and why it matters\nApart from the AG’s dual role, the commission had flagged the excessive powers held by the Prime Minister, the mechanism used to appoint members of the judiciary saying it did not guarantee full independence from the executive.\nDr Bonnici said the government would also reform the method for appointing and removal of members of the judiciary as suggested by the commission. While declining to give any details of the model being proposed, the Justice Minister noted that such changed would require the Opposition to be on board as it required the approval of two-thirds of MPs. In view of this, a consultation process will be launched soon.\nDr Bonnici also announced that on Monday he would be rolling out the legislative process to address other areas flagged by the Venice Commission. These comprise the role of the Ombudsman, permanent secretaries, positions of trust, independent commissions and the police force.\nThe respective Bills will be published in due course with the objective of enacting the changes by the end of this year, the minister said. In most of these cases too, a two-thirds majority would be needed for the changes to be made. \nAsked about other matters flagged by the commission which were not mentioned in the news conference, Dr Bonnici noted that at this stage government was focusing on a third of the issues raised. He added that once these changes would be implemented the government would focus on the rest of the recommendations. \nGovernment has to implement reform it has been resisting - Opposition\nIn a statement, Opposition leader Adrian Delia said that because the government had not listened immediately, the only measure taking place by June was the hiving off of the functions of Prosecutor General from those of the Attorney General. Other reforms would not be implemented before the end of the year.\nHe said concrete measures to strengthen democracy and ensure the independence of the country's institutions were needed.\nThe people, he said, were awaiting serious changes which could give the country back its creditability. They also wanted institutions that worked with transparency and meritocracy.\nThe Nationalist Party would make sure that the government would really implement the Venice Commission recommendations, which were clear and similar to those the Opposition had been requesting and which the government had resisted.\nThe Venice Commission conclusions clearly showed the Prime Minister was taking power from the institutions, controlling them and hindering their autonomy to the detriment of the rule of law.", "comment_count": 25, "id": 2799}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Failure to set up a Skype call thwarted three Libyan men from testifying on Thursday in libel proceedings instituted by government official Neville Gafa over allegations linking him to the irregular granting of medical visas in Tripoli.The case involves government official Neville Gafa.\nThe three witnesses were to speak via Skype from Libya on behalf of some 10 other Libyan nationals in the case against David Lindsay, editor of The Malta Independent on Sunday.\nDuring the last hearing, in January, another witness, Ivan Grech Mintoff had told the court that the Libyan witnesses were insisting on testifying “directly,” since they did not trust the police in Malta and wished to give their evidence directly to the court.\nRead: 'Neville Gafà offered Libyans money not to testify' - medical visa libel case witness\n“All we need is the fixing of a date for the Skype call and they would be willing to testify,” Mr Grech Mintoff had said.\nBut in Thursday's sitting, the parties were informed that the Skype call could not take place since the necessary arrangements with the court administration were not carried out, in spite of the court’s instructions during the previous sitting. It transpired that the defendant did not formally request the necessary arrangements. \nFor this reason, the case was adjourned to May.\nSources speaking to Times of Malta said the Libyan men who were to testify were, in fact, waiting at the other end of the line for the call that never materialised.\nLegal procurator Peter Paul Zammit was counsel to Mr Gafa. Lawyer Peter Fenech was counsel to Mr Lindsay.", "comment_count": 0, "id": 2800}, {"keywords": "", "author": "Jacob Borg", "article_body": "Malta has not made any significant progress in the fight against corruption, the European Commission said on Thursday.\n \nDuring a presentation about the Malta 2019 country report, European Commission Deputy Secretary General Céline Gauer said more work needed to be done for the strengthening of governance frameworks and the enforcement of anti-money laundering measures.\n \nMs Gauer did note that there had been significant improvements in the staffing levels of supervisory authorities in the financial sector.\n \nShe said Malta had made limited progress in general when it came to implementing the 2018 country-specific recommendations.\n \nAnother Commission official, Benjamin Angel, observed that Malta had tumbled down Transparency International’s corruption perception index in recent years.\n \nHe said no prosecutions had ever resulted from the 500 files passed on to Malta’s anti-corruption watchdog, the Permanent Commission Against Corruption.\n \nWhile commending Malta for its high rate of economic growth, Mr Angel said effective governance was key to successful and lasting growth models.\n \nScicluna: Malta will show it is serious in tackling shortcomings\n \nFinance Minister Edward Scicluna defended Malta’s efforts on the anti-money laundering and corruption fronts.\n \nHe said the government would show it was serious in tackling shortcomings in Malta anti-money laundering framework.\n \nHe pointed towards the adoption of a 50-point plan to fight money-laundering.\n \nThe finance minister also said a lot of the focus on Malta was politically motivated.\n \nHe said MEPs had requested the European Banking Authority to focus on Malta at a time when numerous European banks are facing accusations of laundering billions.\n \nMs Gauer rebutted that the EBA’s recommendations about Malta were objective and factual. She strongly objected to the characterisation of its work as being political.\n \nOn the economic front, the Finance Minister acknowledged that Malta’s recent economic growth had not been uniform, with certain sectors and pockets of society lagging behind.\n \nHe said the government had been very careful not to raise the minimum wage higher than those of Malta’s competitors.\n \nThe finance minister said the government was supplementing the income of those in need through an “enormous amount of benefits” such as free childcare and free medicine.\n \n \n ", "comment_count": 18, "id": 2801}, {"keywords": "", "author": "", "article_body": "A large boat was unhooked from a trailer and crashed into a roadside barrier in an unusual traffic accident on Thursday morning.\nThe accident happened at about 10.45am on the Marsa-Ħamrun bypass, Marsa.\nPeople on the scene said it appeared that the tow truck braked suddenly. The boat being towed on a trailer swung to one side, hitting and damaging a crash barrier, witnesses said.\nNo one was injured but the accident caused a traffic jam.", "comment_count": 4, "id": 2802}, {"keywords": "", "author": "", "article_body": "Photo - Jacqueline van Hunnik.\nA North-Easterly gale shifted sand across the road in Għadira Bay on Thursday morning, blocking the road for most traffic.\nMost of the sand was cleared by late morning.\nThe bad weather, right at the start of spring, is expected to continue until Friday, with a thunderstorm possible on Thursday afternoon.\nWeekend weather is expected to improve, though rainfall is anticipated for Saturday.\nMalta experienced rough weather in the last month, with a February storm proving to be the most devastating since 1982. \nA BMW stuck in the sand (Picture by Antida Spiteri)\nDo you have any pictures to share? Please send it to mynews@timesofmalta.com or Facebook - Times of Malta.", "comment_count": 32, "id": 2803}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Air Malta employees, particularly cabin and cockpit crew, are getting “edgy” over the shape and direction a new airline registered by the government is taking, civil aviation industry sources said.\nWhen Malta MedAir was registered last year, Tourism Minister Konrad Mizzi had said it was to take over and administer Air Malta’s landing rights and slots in particular airports, mainly the lucrative London rights.MedAir, run by former Malta Tourism Authority CEO Paul Bugeja, is now recruiting technical staff.\nInitially, trade unions representing Air Malta staff were assured by the government that the new company would principally have a role in “an accounting exercise” aimed at balancing the books of the national airline. However, recent developments at MedAir are raising eyebrows, even giving rise to fears that other plans might be in the pipeline, they noted.\nMedAir, run by former Malta Tourism Authority CEO Paul Bugeja, is now recruiting technical staff and also plans to introduce a helicopter service between Malta and Gozo, sources close to trade unions representing Air Malta employees told Times of Malta. \n“This,” they added, “might be the beginning of a plan by Dr Mizzi to develop MedAir into a fully-fledged airline, taking over certain operations from Air Malta while shrinking the national airline’s business.”\nThe helicopter service was singled out as a “concrete example of this hidden plan” as the trade unions sources noted this should be purely an Air Malta operation. \nThey said that they fear that, that through the new company, the government could recruit staff offering new and more flexible conditions, drastically restricting the rights and benefits Air Malta personnel enjoy.\nThe trade union sources commented that certain government elements, possibly Dr Mizzi too, viewed some of the collective agreements in force, particularly those not negotiated by the General Workers’ Union, as restricting the national carrier’s expansion.\nA spokesman for Dr Mizzi confirmed the new company will be responsible for the helicopter service between Malta and Gozo, adding that “naturally, this will require it to increase its staffing levels”.\nQuestions on whether the new company will offer services in direct competition with Air Malta remained unanswered.\nPlan to introduce a helicopter service between Malta and Gozo\nThe spokesman said MedAir is recruiting technical staff as part of a process to gain IOSA (IATA operational safety audit) accreditation. \n“The process sees it increasing its technical personnel required to gain IOSA approval. This is a requirement to improve the current service being provided to Air Malta on the routes where Air Malta has code-share with other airlines,” he added.\nAs part of a plan to balance Air Malta’s books, Med Air last year paid over €60 million to the national airline for the acquisition of its slots to then lease them back over a long period.\nDr Mizzi is expected to announce ‘positive’ financial results by Air Malta in the coming days.\nAsked in Parliament earlier this week by Nationalist MP Beppe Fenech Adami whether it was true Air Malta owed Enemed millions of euros in unsettled fuel bills, the minister said such information was commercially sensitive.\nIn his efforts to turn the airline around, Minister Konrad Mizzi embarked on a plan contrasting sharply with that adopted by his predecessor, then tourism minister Edward Zammit Lewis, and is trying to inject new capital into the airline and expand its operations.\nTalks had started under Dr Zammit Lewis to sell Air Malta to Alitalia but the bid failed.", "comment_count": 51, "id": 2804}, {"keywords": "", "author": "", "article_body": "The following are the top stories in the newspapers on Thursday.\nTimes of Malta reports that the sole director of a cleaning firm that received more than €9 million in direct orders in three years owed the Inland Revenue Department over €4 million in unpaid taxes. It also reports from court how the police launched a hunt for a drug 'kingpin' in October. \nThe Malta Independent quotes Joseph Muscat saying the government will not amend the electoral laws without an agreement with the opposition. It also says the hunting season for quail will coincide with the peak migration of turtle dove.\nIn-Nazzjon quotes Adrian Delia saying during a walkabout that people were worried by high rents and the quality of health services. It also says that over €24,200 were raised on Wednesday for Net TV on demand.\nl-orizzont leads with comments by the mayor of St Julian's about the need for discussion on the future of St Patrick's Day festivities in the locality. The newspaper also gives prominence to a man's experience after having adopted a Down Syndrome child.", "comment_count": 0, "id": 2805}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Extensive excavation works to turn a rural area in Xewkija into a park and ride facility and a bus terminus have started although planning permits have still to be issued.\nThe works in an area known as Tax-Xħajma, next to the horse racing track, form part of an EU-funded project aimed at building a multi-modal hub to ease parking problems.\nAn application submitted to the Planning Authority by the Gozo Ministry last October was still under consideration and the Environmental and Resources Authority has demanded environmental studies, building industry sources said.\nYet, they added, bulldozers and other heavy machinery already cleared the area, moved earth and uprooted vegetation and trees over the past four weeks.\nThe large rural area has already been levelled and all rubble and construction material has been cleared. No signs of any trees remain as people familiar with the area said that “everything was savagely uprooted”.\nWorks are being carried out on the site pertained to mineral and geological explorations and surveying\nResearch conducted by Times of Malta shows the development application is still marked as being in the “screening process”.\nAccording to one of the first consultation responses to the application, ERA asked the Gozo Ministry to supply it with additional information including a project description statement and information on the traffic impact the project is expected to generate.\nA PA spokesman confirmed when asked that the Gozo Ministry application was still under evaluation. He added, however, that the ongoing works “do not require a permit” as they were in line with subsidiary legislation related to development notification orders.\nAsked to be more specific, the spokesman said that “works are being carried out on the site pertained to mineral and geological explorations and surveying”.\nHe insisted that “surveys are still being carried out”.\nOther works, the spokesman continued, were related to the removal of illegally-dumped material covered by an enforcement notice issued more than a decade ago.\nSeasoned architects told Times of Malta it was “very creative” if the subsidiary legislation quoted by the PA spokesman was to be used for such large projects.\n“That subsidiary legislation was put in place to exempt small works, such as painting, minor internal works, installation of awnings or drilling of small boreholes for surveys and not massive excavation works,” an experienced architect insisted.\n“Instead of admitting that the Gozo Ministry is running rough-shod over existing planning rules, they are trying to invent an excuse while not realising how ridiculous they could be,” another said.\nThe industry sources warned that the Gozo Ministry was “playing with fire” because, bearing in mind that 80% of the project was EU funded, Brussels might start asking questions on why the works had started before a proper planning permit had been issued.\n ", "comment_count": 56, "id": 2806}, {"keywords": "", "author": "", "article_body": "The Ornis Committee will be recommending to the government a spring hunt for quail from April 10 to 30, from two hours before sunrise up to midday, with no individual bag limit, and a national bag limit of 5,000 birds.\nThe decision was taken with five votes for and two against.\nThis followed a hunters proposal for a quail hunt between the above dates and a turtle dove hunt from April 15 to 30.\nIn a statement, the hunters’ federation, FKNK, said it made its recommendation on the basis of its report “Traditional Turtle Dove Hunting in Spring on the Maltese Islands – Lifting of the Moratorium”.\nCommittee members requested more time to evaluate the FKNK report, which urges the government to immediately lift the moratorium and open discussions with the EU Commission for a long term solution to be reached on the hunting of turtle doves.\nA decision on the turtle dove season will be taken at the next meeting to be held shortly.", "comment_count": 15, "id": 2807}, {"keywords": "", "author": "", "article_body": "The Fidesz party of firebrand Hungarian Prime Minister Viktor Orban was suspended from the European People's Party Wednesday, the EU's biggest and most influential political grouping, the EPP said.\nThe Nationalist Party voted in favour of the suspension.\nA total 190 party members voted in favour of the suspension, with only three against, after reports of long and often heated discussions with Orban at a meeting in Brussels.\nFidesz had faced expulsion from the EPP after running a controversial billboard campaign that accused European Commission head Jean-Claude Juncker and liberal US billionaire George Soros, a bete-noire of Orban, of plotting to flood Europe with migrants.\nThe campaign has since been dropped and Orban has apologised for insulting partners from the EPP - the mainstream conservative group of MEPs - though the party leadership had warned this was not enough.\nA statement said the suspension was a joint decision by Fidesz and the EPP in a last minute re-wording intended to stop Orban from slamming the door on the group forever.\nSanctioning Orban has split the EPP, amid concern that the Hungarian leader will team up with Italian Deputy Prime Minister Matteo Salvini, leader of Italy's anti-immigrant Northern League, to create a rival group in the European Parliament.\nFaced with tough EU elections in May, some EPP members are also worried that punishing Orban will cost them support from anti-immigrant voters who back Orban's tough line.\nBut others believe Orban crosses a dangerous line into xenophobia, anti-semitism and racism that is not suitable for the EPP mainstream grouping.\nThe sanction against Orban has no end date, but party sources said senior party members would evaluate the situation and recommend next steps \"probably in the autumn\".\n\"Exclusion is not off the table, it is on the table,\" said the EPP's Manfred Weber, who will be leading the party in European elections in May.\nThe EPP brings together the EU's main centre-right parties, such as German Chancellor Angela Merkel's CDU or the Republicans in France, the party of former French leaders Nicolas Sarkozy and Jacques Chirac.\nIn an interview on Wednesday, Juncker, who won the EU's top office for the EPP in 2014, once again called for Fidesz to be excluded.\n\"For years (Orban's party) has been moving away from Christian Democratic values,\" Juncker told German radio Deutschlandfunk. Therefore \"his place is outside the EPP\".\nThe PN was represented by international secretary Roselyn Borg Knight, the head of the delegation in the EP David Casa, and MEPs Roberta Metsola and Francis Zammit Dimech.\nPN leader Adrian Delia is on his way to Brussels to attend the EPP summit on Thursday, which is expected to discuss Brexit developments.", "comment_count": 27, "id": 2808}, {"keywords": "", "author": "", "article_body": "Terrorist attacks such as that in New Zealand last week went against the teachings of God, Imam Mohammed Elsadi said on Wednesday.\nSpeaking during an interfaith vigil to honour the victims of the terrorist attacks on mosques in New Zealand, Imam Elsadi told Times of Malta that both the Christian and Islamic faiths were against any form of violence.\nThe attacks on two Christchurch mosques left 50 dead last Friday, with one gunman – identified as an Australian extremist - apparently live streaming the assault that triggered the lockdown of the New Zealand city.\nIn what appeared to be the worst attack against Muslims in a western country, witnesses spoke of victims being shot at close range, with women and children among those killed.\nImam Elsadi said the vigil showed solidarity with the victims, their families, the Muslim community and the people of New Zealand.\nDeputy Prime Minister Chris Fearne attended and was joined by representatives from the PN, the Democratic Party and Alternattiva Demokratika.\nMr Fearne said the government had condemned the attack and showed full solidarity with the victims.  ", "comment_count": 22, "id": 2809}, {"keywords": "", "author": "", "article_body": "Malta’s changeover to electric cars will be as drastic as the time when the country changed to decimals and later to euros, Prime Minister Joseph Muscat said on Wednesday.\nSpeaking at a Forum Żagħżagħ Laburisti activity at Is-Suq tal-Belt, Dr Muscat said that the change will not take place over a day but a date would be given and from that day onwards no more petrol and diesel cars would be imported.\nThose who already have such cars would be able to keep them but new cars would have to be electric.\nThe change was to be a drastic one, it would change the countries’ culture and it would also change how other countries looked at Malta.\nDr Muscat said it had been suggested that since Malta would be undertaking such a major change, it should also consider changing its driving direction. The Prime Minister said he was not saying this was going to be done but it was something worth discussing and considering.\nOn the Malta-Gozo tunnel, the Prime Minister said this had been a Nationalist government idea and both parties had promised it in their electoral manifesto.\nHe said that between 2013 and 2017 he had been criticised that nothing had been done. This was not the case as studies were then being held.\nThe government was willing to continue to listen and consult but it was now at the stage not of if but of how.\nOn quotas, the Prime Minister said that the government did not intend to introduce quotas since these would not be fair.\nBut it would be submitting proposals for a minimum 40% level of representation by each of the sexes.", "comment_count": 164, "id": 2810}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Commissioner for Voluntary Organisations has warned that his office is finding it impossible to enforce recently-enacted legal safeguards because of a severe understaffing problem.Presenting his annual report to Parliament’s Social Affairs Committee on Wednesday, Commissioner Anthony Abela Medici said his office needed 31 staff members but was currently having to make do with just seven.As a result, he said, a new law aimed at closing loopholes which made organisations vulnerable to money laundering, enacted late last year, could not be enforced effectively.“The law has made registration mandatory, but until I have the staff I need, I cannot even become aware of the organisations that have not registered,” Dr Abela Medici said, adding that staffing problems had been flagged by his predecessor two years before.“The law also empowers me to dis-enrol organisations that are consistently non-compliant, but if I do not have the people to go over those files and see who is non-compliant, there is nothing I can do.”Some organisations have collected €80,000 for social purposes but have not disbursed a single centDr Abela Medici hit out at the “laborious” recruitment process, something he said he had hoped would change with the establishment of his office as an independent public body. “My office now has a legal personality. I should be independent of everyone,” he said, prompting committee chairman Etienne Grech to urge him to remember that the press was listening in on the meeting.Dr Abela Medici said there remained multiple cases of non-compliance among voluntary organisations, citing the more than 40% who had failed to file their annual returns despite being required by law to do so.“There are organisations that have collected €80,000 for social purposes but have not disbursed a single cent in three years. We have told them they will be dis-enroled if they do not remedy the situation,” he said. Under new powers granted by the law, the office had opened investigations with local banks in three cases, of which one had been passed on to the Financial Intelligence Analysis Unit (FIAU) for further investigation, he added. At the same time, Dr Abela Medici said his office had implemented several important changes ahead of meetings with the Council of Europe monitoring body Moneyval, including a risk assessment of all 1,400-plus registered organisations. The office had also shared its database with the Malta Financial Services Authority (MFSA), police and other authorities.He added that subsidiary legislation currently awaiting the Attorney General’s approval would establish the office as a “competent authority” for legal purposes, and include new provisions to regulate charity shops and public collections, among others.", "comment_count": 2, "id": 2811}, {"keywords": "", "author": "", "article_body": "Updated March 25 with Chamber of Engineers reaction\nDevelopers have suggested a new trading system that would, they say, encourage the protection of unspoilt areas in and around village cores.\nThe proposed system would see developers purchase what is known as the gross floor area of a property near the village core, ensuring that this remained undeveloped.This would then be offset by payments for projects elsewhere, such as planning gains, which developers normally have to fork out on large construction projects.\nSpeaking during a meeting with Prime Minister Joseph Muscat, Malta Developers Association head Sandro Chetcuti said a new technical committee would be drafting proposals to stop building in Malta’s remaining unspoilt urban areas.\n“Our towns and villages are disappearing and this is something we want to act against,” he said.\nMr Chetcuti said the MDA proposal would be drafted in more detail by a new MDA technical committee made up of architects and engineers.\nArchitect and planning consultant Stephen Farrugia, who forms part of the new committee, said the proposal was based on a system used overseas to protect iconic urban areas from unwanted construction.\nDr Muscat said he was not averse to the idea, but added that this would have to be studied and carefully thought out.\nThe value of land in different parts of the island varied greatly, he said.\nPublic consultations would have to be carried out, and he urged other stakeholders to engage with the government if they too had proposals on such issues.\nDuring the meeting, Mr Chetcuti also made the case for self-regulation of the construction industry, something he has long been calling for.\nIn particular, the MDA believes architects and engineers should be made to self regulate in much the same way medical practitioners abided by a set of rules who were brought before the medical council if they broke the rules.\nRead: 'Relaxing' planning policies would lead to affordable housing\nDr Muscat said he agreed with this in principle, but said self-regulation could not mean deregulation.\nArchitects and engineers should run the risk of losing their warrant if they had been found to breach the rules.\nThis, Dr Muscat was the way things were headed, however there was still a long road ahead.\nIntroducing such a reform in a staggered manner, might be the ideal way forward he said.\nTransport Minister Ian Borg and Planning Parliamentary Secretary Chris Agius were also present for the meeting.\nKamra tal-Periti, Chamber of Engineers react\nIn reaction to the comments made about architects, the Chamber of Architects said that the profession has been self-regulated since 1919, reinforced by the establishment of the Kamra tal-Periti in 1920.\nThe profession has a Code of Professional Conduct, which all warrant holders are duty-bound to adhere to.\n\"Reports of misconduct are taken very seriously, duly investigated, and, depending on the case, may also result in the suspension or revocation of a warrant,\" the chamber said.\nIt added that developers and contractors, on the other hand, are not regulated at all.\nThe chamber welcomed the MDA’s stance in favour of regulation of the industry, said that position was aligned with what it had been advocating for many years.\n\"The industry is one of the pillars of the economy, and as such it is essential that the highest standards are demanded and achieved,\" it said.\nMeanwhile, the Chamber of Engineers pointed out that the engineering profession is regulated under Chapter 321 Engineering Profession Act of the Laws of Malta.\nEnshrined within this act is the code of ethics which every professional who is in possession of an engineering warrant to practice the profession of an engineer must follow.\nThe Chamber of Engineers has set up the ethics sub-committee within its structure, tasked to deal with issues of infringement of this ethical code. It is nonetheless important that developers engage warranted engineers from the initiation of projects in order to ensure the attainment of highest standards.\nThe Chamber additionally noted that, currently, without the involvement of engineers from an early design stage, there is little to no enforcement of specific building regulations as stipulated under LN 47 of 2018- Energy Performance of Building Regulations.\nThe Chamber of Engineers encourages the government to implement the registration and regulation of developers and contractors ranging from excavation, construction to building services.\nCorrection: This article was amended from the original that erroneously reported developers as having proposed trading land in one part of the island for another. ", "comment_count": 94, "id": 2812}, {"keywords": "", "author": "", "article_body": "People were again donning their jackets and looking for umbrellas on Wednesday as heavy winds, expected to reach Force 7 took over the Maltese islands.\nThe winds, as well as rain, are expected to continue until at least the end of this week.\nIn Sliema, the strong winds left the town's waterpolo club almost underwater, while passers-by along the promenade held onto their hoodies as they watched waves crash to shore. \nAccording to the Meteorological Office wind and rain are expected on Thursday but the wind force will gradually go down to three on the Beaufort scale. Thundery showers are forecast for Friday when the wind will again reach force 6. Winds will keep up the pace on Saturday, when there will also be isolated showers. It is expected to rain on Sunday.\nIn February, Malta experienced the second coldest month to ever be recorded by the Meteorological Office with strong winds battering the islands and whipping up rough seas. It was also the second wettest since 1923.", "comment_count": 3, "id": 2813}, {"keywords": "", "author": "", "article_body": "The major storm on February 23 and 24 caused €118,500 worth of damage to the transport sector, including the destruction of two bus shelters, and fallen walls.\nTransport Minister Ian Borg said, in reply to a parliamentary question by MP Edward Zammit Lewis, that numerous personnel had been put on standby for the clean-up expected when warnings emerged some days before about the extent of the storm.\nThe operations were coordinated between the ministry, Transport Malta, the Parliamentary Secretary whose portfolio includes the cleansing division, the Civil Protection Department and the police.\nThe roads themselves did not sustain any material damage. However, apart from the two bus shelters that were destroyed, a number of road signs were uprooted or bent, and walls fell in various places.\nA crash barrier on the side of the road was also wrenched out of the ground and ended up in the middle of the lane, necessitating closure of the road until the hazard was removed.", "comment_count": 1, "id": 2814}, {"keywords": "", "author": "", "article_body": "A senior citizen who smashed his car during a Tuesday morning crash in Marsa has passed away. \nIn a statement issued on Wednesday afternoon, the police said that the 76-year-old Birkirkara man had died in hospital. \nThe elderly man was driving a Mercedes Benz on Triq Aldo Moro on Tuesday morning when he hit the concrete barriers being used to separate lanes during roadworks. \nA 74-year-old woman riding as a passenger in the car was only slightly hurt in the crash. \n ", "comment_count": 0, "id": 2815}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man’s conviction over a theft committed 13 years ago is to be re-examined after a court of appeal pointed out a formal error which brought about the nullity of the judgment delivered by the Magistrates’ Court.\nMark Zahra, 47, had been given a 13-month jail term after he had been found guilty of the aggravated theft of jewellery and voluntary damage to third party property, besides also being a relapser.\nFollowing the judgment delivered in April 2014, both the Attorney General and the accused had filed an appeal, the former asking for a variation of punishment to better reflect the gravity of the theft, whereas the accused questioned the appreciation of evidence which had rested mainly on fingerprints allegedly linking him to the scene of crime.\nHowever, when analysing the records of the case, the Court of Criminal Appeal, presided over by Madam Justice Edwina Grima, observed that the first court had failed to indicate, in the operative part of the judgment, the provision of law concerning the charge of voluntary damage to third party property, as well as the sections concerning the aggravating factor of relapsing.\nThis omission amounted to a defect of form which translated into the partial nullity of the judgment, the court declared, observing that such a formality was specifically intended to ensure that both the accused as well as other parties in the proceedings were fully aware of the facts upon which criminal liability was based and the relative articles of law.\nWithout entering into the arguments raised by either of the appellants, the court, on the basis of this formal error, annulled the judgment, declaring it would hear afresh the merits of the case.\nLawyer Edward Gatt was counsel to the accused.", "comment_count": 0, "id": 2816}, {"keywords": "", "author": "", "article_body": "February may have started off on a relatively warm note, with the month’s air temperature peaking at 19.4°C on its second day. But a sharp drop in air temperatures to a frosty low of 3.7°C on the 23rd, coupled with a mean minimum temperature of 8.7°C, led it to become the second coldest month to ever be recorded by the Meteorological Office.\nAs temperatures plummeted between the 23rd and 24th, strong winds battered the Maltese islands and whipped up rough seas. Gusty winds blowing from a north-easterly direction reached 54 knots, forced the cancellation of a number of highly-anticipated outdoor events, including the Malta Marathon.\nWindy conditions continued throughout the weekend, with gusts greater than or equal to 34 knots being recorded until the 25th of the month. While these winds were among the strongest to be registered in recent years, the highest wind gust was actually recorded on February 4, 1955, reaching 70 knots, which is equivalent to approximately 130km/hr.\n\nHeavy rain also poured down on the parade of carnival enthusiasts whose floats were due to be exhibited the following week. In fact, a total of 43.8mm fell on February 23, amounting to almost half the amount of rain received by the Maltese islands throughout February.\nRegistering a total of 93mm of rainfall spread out over 11 days, this month was the second wettest February to be recorded since 1923. Thunderstorms and hail were also a common occurrence throughout the month, with double the norm of thundery days rattling the islands on six occasions, and three reports of hail received by the end of February.\nDespite the inclement weather which characterised the last weekend of the month, February’s cloud cover, at 3.5 oktas, was slightly lower than the climate norm and the total sunshine hours exceeded the amount expected at this time of year.\nAs the clouds gradually started to clear, the Maltese islands enjoyed their fair share of sunshine, boasting an above-average mean of 6.9 hours of sunshine per day, amounting to a monthly total of 192.2 hours. Basking in 10.1 hours of bright sunshine, Valentine’s Day was the brightest day of the month.", "comment_count": 3, "id": 2817}, {"keywords": "", "author": "", "article_body": "The Nationalist Party wants parliament's environment committee to discuss the situation at civic amenity sites, saying they were now looking more like junkyards. \nIn a statement, the PN said that waste electrical and electronic (WEEE) schemes administered by the Environment and Resources Authority are causing huge pile-ups due to the backlog in the collection of this waste (white goods, television sets, water heaters, computers and air-conditioning units) for recycling abroad.\nIn a statement in the afternoon, the PN said these sites had become more akin to junkyards.\nEditorial: Overflowing civic amenity sites\nThese sites, the party pointed out, were the responsibility of Environment Minister Josè Herrera, who was also responsible for the Environment and Resources Authority and Wasteserv. Both these entities were not doing anything about the situation, which was going from bad to worse.\nIt would have been better for the minister, rather than wasting €700,000 on television adverts in 2018 to say how well the environment was doing, had really worked in the sector and not given wasteful consultancies to Nexia BT, the PN said. \n ", "comment_count": 3, "id": 2818}]