[{"keywords": "", "author": "", "article_body": "Updated at 12.45pm\nA motor cruiser burst into flames while berthed in Kalkara on Tuesday, sending thick black smoke into the sky.\nThe cause of the incident is not yet known and police said they had no details to report for the time being. \nPhoto: Daniel Cilia\nThe smoke was seen from several parts of Malta, probably because the boat is made of fibreglass.\nPhotographer Daniel Cilia was close by at Villa Bighi when he felt a blast.\n\"The explosion made the entire building tremble,\" he told Times of Malta.\nThe boat was seen being towed away within minutes to avoid further damage to other vessels and the pontoon, which hosts a series of luxury vessels berthed at one of Malta's most picturesque locations.\nFurther details to follow\n\nVideo: Andy Seguna\nThe boat was towed away to prevent damage to other vessels. Photo: Daniel Cilia\nPhoto: Mark Zammit Cordina\nPhoto: Sebastian Kittel", "comment_count": 2, "id": 3619}, {"keywords": "", "author": "", "article_body": "Some 300 new jobs will be created as aviation servicing company SR Technics expands its operation in Malta.\nOn Tuesday morning the company confirmed that it would be building a new six-bay hangar, set across some 30,000 square meters in an area known as Park 4 in the Ħal Farruġ neighbourhood of Luqa.\nAgreement for €35 million six-bay hangar finalised\nA ground breaking ceremony was held at the site.\nSRT general manager Arthur Magri said the new “narrow body maintenance” hangar would be focused on providing services for the Boeing 737 and the Airbus A320.\nSR Technics Malta rolls out first aircraft - called Pride of Malta\nThe company had chosen Malta eight years ago, moving operations here, and this had proven to be a good decision. So much so, in fact, that they were now preparing to undertake significant growth.\nFrom left, SR Technics general manager Arthur Magri, Economy Minister Chris Cardona, and Jakob Straub the company's head of aircraft services.\nEconomy Minister Chris Cardona said that, in SRT, the government had found the right partners to be able to help the sector grow.\nAviation, he said, was a sector experiencing rapid growth worldwide, and this meant Malta would have a bigger role to play as the industry continues to swell.\nEarlier Economy Dr Cardona visited a temporary hangar set up by SR Technics at the Safi Aviation Park to ease the transition until their new site was finalized.", "comment_count": 2, "id": 3620}, {"keywords": "", "author": "", "article_body": "The Malta Financial Services Authority has approved 14 agents for crypto-assets, 17 weeks after the first applications were filed, paving the way for the sector to get going.\nThe approvals were made “in principle” as some minor details remain to be sorted out before the agents are officially taken on, according to MFSA sources.\nThe approval of the agents was the first step in setting up clients in this sector. They will be able to assist issuers and services providers under the Virtual Financial Assets Act came into force on November 1, 2018, coinciding with the Malta Blockchain Summit.\nOnce the Act came into force, applications started being filed with the MFSA. About 250 lawyers, accounts and auditors applied for certification, but nearly two-thirds failed the official assessment process, consisting of a short training course and exam.\nEventually, 28 formally applied to be agents.\nThe MFSA said on Tuesday that the agents would be the first level of defence as they would be obliged to evaluate their clients’ business plans – and ensure that they were ‘fit and proper’, prior to submitting an application to the MFSA. This will require a robust due diligence process on the clients – as the agents are themselves ‘subject persons’ under anti-money laundering regulations.\nMFSA head of securities and market supervision Chris Buttigieg said the first batch of approvals represented an “important milestone” in the regulation of cryptoassets.\n“We have worked actively since November 2017, when we started out regulatory journey in the field of cryptoassets, and today, we have a complete framework that caters for all key areas of risk, being inter alia the risks to consumers, market integrity, financial crime and cyber-security,” he said.\nHowever, one issue remains: banks’ reluctance to open accounts for the clients. Dozens of companies involved in blockchain and cryptocurrency are encountering resistance when they try to open bank accounts.\nSources from company service providers, legal firms and corporate finance companies contacted by the Times of Malta – who asked to remain anonymous to protect their clients’ confidentiality – confirmed that banks were politely declining their business, saying it was outside their “risk appetite”. However, Parliamentary Secretary for Financial Services Silvio Schembri said banks were waiting for operators to obtain an MFSA licence before opening their doors – something that the approval of agents has paved the way for.", "comment_count": 5, "id": 3621}, {"keywords": "", "author": "", "article_body": "The Democratic Party is to boycott Tuesday afternoon's parliamentary sitting which will see former minister George Vella nominated to become President.\nThe Nationalist Opposition has said it will back the nomination, although it said it would have preferred a nominee who did not come from the Labour Party.\nThe PD said that while in welcomed Dr Vella, its two MPs would not be present for the debate since the government had not shown goodwill to amend the Constitution for the head of state to be appointed by a two-thirds majority.\n“Malta has a dysfunctional democracy and Presidents of the Republic in their majority have been mere figureheads in their relative silence,” party leader Godfrey Farrugia said.\nPresidents must be given the necessary powers to ensure good governance, he said, adding that a Council of State should be set up to advise the President. \nDr Vella is due to be sworn in on Thursday morning. ", "comment_count": 27, "id": 3622}, {"keywords": "", "author": "", "article_body": "A man was seriously injured early on Tuesday when a crane mounted on a truck toppled over at Wied Iż-Żurrieq.\nThe incident happened at about 7am as the crane was raising a platform loaded with sacks of cement near the historic coastal tower.\nThe construction worker, a 45-year-old from Żejtun, was trapped under the crane.\nThe police are investigating. \n \n ", "comment_count": 4, "id": 3623}, {"keywords": "", "author": "", "article_body": "An Indian sailor is receiving hospital treatment after falling on his ship off Malta.\nThe police said the incident happened on Monday afternoon.\nThe 39-year-old was ferried to Malta by AFM helicopter.", "comment_count": 1, "id": 3624}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 2.06pm with PN statement - \nThe person who eventually takes up the role of public prosecutor under proposed reforms will be a government appointee, Justice Minister Owen Bonnici has confirmed.\nIt was announced last month that the government would be hiving off the prosecution role from the Attorney General’s functions. \nSpeaking to the Times of Malta, Dr Bonnici initially appeared reluctant to state this fact outright. \nWhen first asked how the prosecutor would be appointed, the Justice Minister said the Venice Commission, which is a constitutional adviser to the Council of Europe, spoke about the matter in its report, and he would be sticking to what the report said. \nQuestioned if the Venice Commission report said the prosecutor should be appointed by the government, the Justice Ministry coyly stated that the report had been public for months. \n“So that is my answer,” he said. \nPressed again if the prosecutor would be appointed by the government, Dr Bonnici said that point would have been relevant had the Venice Commission mentioned other methods of appointment. \n“You have to take a look at the report. It is a structured report. You cannot take this point in isolation. The point is the person occupying the role of public prosecutor should be distinct from the person advising the government,” Dr Bonnici insisted. \nYou cannot take this point in isolation\nLaw Commissioner and former PN MP Franco Debono told the Times of Malta that the role would be overshadowed by the fact that the appointment would take place by a government whose exponents are themselves under actual or potential investigations. \nDr Debono said the context from when he first proposed such a split in 2011 had changed. \nHe said the split itself had been relegated to secondary importance to the much more serious issue of the legitimacy of whoever is appointing them, notwithstanding the integrity or competence of whoever is appointed.\nAn as yet unpublished report by Greco notes that the criminal justice response to government corruption can too easily be paralysed where political influences come into play. Greco notes that “most, if not all” files against top officials in the executive and other related officials are stuck at an early stage of criminal proceedings.\nThe Venice Commission’s assessment of Malta’s legal system, which was carried out on the behest of the Council of Europe last year, says the public prosecutor should be guaranteed security of tenure to ensure independence in line with accepted international practice. Changes to the composition of the Attorney General’s office were announced by the Justice Minister in March.  \nApart from the Attorney General’s dual role, the Commission had flagged the excessive powers held by the Prime Minister and the mechanism used to appoint members of the judiciary, saying it did not guarantee full independence from the executive.\nPN: Confirmation that the prosecutor-general will not be independent\nThe Nationalist Party said Justice Minister Owen Bonnici's comments confirmed that the prosecutor-general would not be independent.\nIt said that the prosecutor-general's appointment by the government would go against the spirit of the Venice Commission's recommendations that appointments to national institutions should be truly independent.\nThis also showed that the government was only reluctantly taking up the Venice Commission's recommendations and did not really want to bring about a change that would allow the institutions to function independently, thus strengthening the rule of law.  ", "comment_count": 153, "id": 3625}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The former home of the Times of Malta at Strickland House in Valletta is set to be demolished to make way for a luxury apartment complex. \nHili Company, which acquired the St Paul’s Street property from the Allied Group in December, plans to redevelop the existing building into 50 apartments over eight floors, two of them receded, as well as a cafeteria and five levels of underground parking. \nThe company is describing the development as “Valletta’s only luxury residential complex, comprising high-end apartments, with concierge service and car parking facilities”.\nDesigns for the building’s façade, by architect Martin Xuereb, envisage a mix of open and traditional closed balconies, with timber apertures and wrought iron railings, in stark contrast to the current austere aesthetic.\nHili Company said the building, located at the highest point of Valletta and just opposite the Auberge de Castille, was “widely acknowledged as one of Malta’s finest” and said the project would be “the only new build of its quality and scale in Valletta”. \nThe proposal, being published this week for public consultation by the Planning Authority, is yet to be assessed. \nPurchased by Lord Strickland in 1930 to host his printing press, Strickland House served as home to the Times of Malta from the newspaper’s founding in 1935 until 2017, when all operations were moved out of Valletta to the current premises in Mrieħel. \nThe original building withstood the ravages of World War II, despite being bombed twice, but was burned down by Labour Party supporters in October 1979 after a mass rally in what came to be known as Black Monday.  \nAlthough the printing press was destroyed, the newspaper was published as usual the following day from another press, retaining its record of never having missed an issue. \nA charred black wall on the building’s top floor, which most recently hosted the Times of Malta newsroom, was retained behind perspex with a plaque marking the 1979 event.", "comment_count": 2, "id": 3626}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Tuesday:  \nTimes of Malta reports that the person who eventually takes up the role of public prosecutor under proposed reforms will be a government appointee.\nThe Malta Independent says that protesters have wrapped up their protest camp outside the Planning Authority's offices while insisting they will only be satisfied when a proper fuel stations policy is issued. \nIn-Nazzjon says minister Konrad Mizzi has maintained perfect silence after it was reported that he is secretly concocting a new agreement with the Corinthia group which will again see public land handed over cheaply. \nl-orizzont reports that the police are continuing their search for the murder weapon used in the weekend's double murder. ", "comment_count": 0, "id": 3627}, {"keywords": "", "author": "Keith Micallef", "article_body": "Infrastructure Malta chief Fredrick Azzopardi has justified the agency’s decision to carry out roadworks without a development permit at a traffic junction in Ħal Farruġ, Luqa, on the grounds that it was “very urgent”.\nFurthermore, he said that the agency was contesting a €20,000 fine imposed by the Planning Authority over such breach, saying it was “excessive”.\nMr Azzopardi was asked on the matter during an on-site visit that Transport Minister Ian Borg made yesterday during the second phase of the €9.5 million project. \nScheduled for completion at the end of this year, the works will widen the arterial road linking Qormi to Malta International Airport. The first phase, which consisted of the widening of a traffic junction near St Vincent de Paul, was completed in June last year. \nLast February, Times of Malta reported that Infrastructure Malta was slapped with a fine after it transpired that the first phase, which necessitated the take up of adjacent land outside the road’s original footprint, had been carried out without a permit. \nAs a matter of fact, the agency applied for sanctioning, which is the term used to regularise illegal developments. \nThe application was filed as part of the planning process for the entire project which is spread over 1.7 kilometres.\nAsked by the Times of Malta why Infrastructure Malta had flouted planning rules and started the first phase with no permit in hand, Mr Azzopardi pointed out that the fine was being contested. \n“The fine was slapped as if the entire project had been completed without a permit, which is not the case,” he said.\nWhile describing the junction as a very important one, he insisted that works had to start immediately to alleviate traffic caused by the ongoing works on the multi-level intersection in Marsa. \nWhen it was pointed out to him that the government should lead by example, Mr Azzopardi said that “when possible” the agency was following the proper planning procedure. “In the case of this junction, I felt that in the circumstances, since it was a small parcel of land, though not justified, it was important to forge ahead without a permit as the benefits were big,” he said. \nApart from this case, Infrastructure Malta was also slapped with a €42,454 fine over the controversial Tal-Balal road-widening project, which started before a permit had been issued.", "comment_count": 86, "id": 3628}, {"keywords": "", "author": "Luke Scicluna", "article_body": "Opposition MP Godfrey Farrugia called for more consultation on 5G technologies before their introduction into the Maltese digital economy but his warnings of a possible negative health impact were downplayed by Parliamentary Secretary Silvio Schembri who said that 3G technology was even less carcinogenic than “grapefruit juice”.\nDr Farrugia argued in Parliament in the context of amendments to the Malta Communications Authority Act that it had become an ‘indisputable fact’ that cellular radiation was harmful to human health, stating that even 3G radiation had been proven to be carcinogenic as was recognised by the World Health Organisation.\nDenying the health risks of this radiation was similar to naysaying about the carcinogenic effects of cigarettes, he said, pointing out that 5G had even higher intensity.\nDr Farrugia clarified that he was “in favour of progress,” but said every caution should be taken in the deployment of new technologies. He pointed out that no permit had been issued for experiments on 5G bandwidths or for the commercial deployment of 5G.\n5G antennas would be much smaller than 4G antennas - as well as being deployed more widely - making them harder to avoid for those who did not wish to live in close proximity.\nHowever, although he agreed with the need for consultation on the social and lifestyle changes that the connectivity promised by 5G technologies would offer, Digital Economy Parliamentary Secretary Silvio Schembri disagreed with what he called “alarmism” about the health risks of such technologies.\nHe pointed out that the carcinogenicity of 3G was ranked similarly to that of processed food, and less than the risks of “grapefruit juice”.", "comment_count": 28, "id": 3629}, {"keywords": "", "author": "", "article_body": "The Labour Party is expected to accept the Nationalist Party’s latest proposal of having each ballot manually inspected before it is electronically scanned to determine the voter’s preferences.\nSources close to the Electoral Commission told Times of Malta that the “hybrid system” had been proposed by the PN to resolve the serious issues in the electronic counting system.\nLast December, the PN had denounced the electronic voting system as flawed, following a number of mock tests. According to the party, the system had been tampered with, without the electoral commission’s knowing.\nMoreover, certain marks on the ballot sheet were not detected, thus fuelling concerns of corrupt practices. The PN had sounded alarm bells that the system could be abused so voters would be able to identify themselves, and hence open up the possibility of vote buying.\nTo resolve this, the PN proposed a system that would manually check each ballot to ensure that there was no visible mark which could make the voter identifiable. While this is happening, party agents will be taking their samples as is done in every election.\nThe parties will take samples and extrapolate the readings to calculate a result.\nOriginally, the Labour Party had opposed this idea because this meant the result of the sampling would be known at 2am or 3am so the parties agreed to postpone the process to 7am the day after election day.\nSources close to the Electoral Commission said this agreement so late in day meant that the commission will now have to work around the clock to ensure that people are recruited to carry out the manual checking.", "comment_count": 14, "id": 3630}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Malta’s first ecopark for children has opened its doors in Attard, hosting interactive flooring that in Europe can only be found in Germany.\nTargeting those aged two to 10, with an area specifically for autistic children, the park is fully sustainable through solar, wind and kinetic energy created by the children themselves.\nA set of stationary bicycles light up a whirlpool when used, with bright mushrooms sparking to life when children walk on them.\nLocated within the President’s Kitchen Garden, the park is equipped with play structures that demonstrate basic scientific principles to children, and any extra energy feeds the site’s electricity grid.\nSolar energy meanwhile feeds into what are known as smart benches, which can power electric equipment, serve as wifi hotspots and also provide weather information.\nThe €800,000 project by the Office of the President and the Energy Ministry, has also seen the installation of a system that collects rainwater to be used for the garden’s plants and trees.\nPermanent Secretary at the Energy Ministry Anthony Gatt hoped the equipment would help children understand how energy could be produced through sustainable sources and not just power stations.\nPresident Marie-Louise Coleiro Preca described the ecopark as a dream come true. She commended the Energy and Finance ministries for their contribution, noting that such projects needed political will to kick off.\nPhoto: Mark Zammit Cordina\nThe project was the last gem in a necklace created over the past five years, where children took a central role, the President told those present for the launch.\nIt also marks the 30th anniversary of the UN Convention on the Rights of the Child, which recognised play as a right.\nShe suggested a similar park in Xgħajra, calling on the minister to consult with the National Institute for Childhood, which sought feedback and recommendations about play areas from the experts themselves – children.\nThis way, the authorities would not only be recognising the children’s right to play but also their right to participation, Ms Coleiro Preca said.", "comment_count": 3, "id": 3631}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Malta’s President, Marie Louise Coleiro Preca, who on Thursday ends her five-year stint at San Anton Palace, made 89 trips abroad during her term of office, costing taxpayers around €2.5 million in travel expenses, The Sunday Times of Malta revealed.\nAn exercise carried out by the newspaper during the past weeks shows that the President clogged up over 200,000 air miles in five years, with most of her travels in Europe.\nHowever, other overseas appointments saw President Coleiro Preca and her entourage travel long haul, at least once a year to the United States, mainly to attend appointments related to the United Nations. She also visited Australia and Canada.\nDr Coleiro Preca also paid official visits to Chile and to Ghana and travelled three times to Iceland, mainly to attend conferences, as well as to Azerbaijan, for an UN forum and to Dubai where she led a business delegation.\nBased on the weekly publication of the President’s engagements in The Sunday Times of Malta, statistics show that London and Brussels were the President’s most frequent destinations.\nLondon and Brussels were the President’s favourite destinations\nWhile most of the UK trips were related to the President visiting Maltese patients in various UK hospitals, the President’s frequent trips to Zaventem airport in Brussels were mostly related to visits to the European Parliament.\nPresidency sources told this newspaper that Dr Coleiro Preca was by far the most travelled President in Malta’s history when compared to her predecessors.\nHowever, this could not be confirmed officially as the Office of the President twice refused to give details on her office’s travels and those of her predecessors.\nAsked according to the Freedom of Information Act to provide the newspaper with a list of travels during her presidency and that of her predecessor George Abela, the Office of the President refused, stating that “no such codified document” exists and referred the newspaper to check her weekly diary over the past five years.\nBased on budget estimates published by the Finance Ministry since 2014, it is estimated that Dr Coleiro Preca’s overseas appointments has cost taxpayers some €2.5 million.\nAlthough some of the travel expenses relate to the President’s travels are still being calculated, senior officials at the Finance Ministry confirmed that the Office of the President had significantly increased its travel budget, with the ministry having to continuously approve extended allocations as the original budget would have run out  before the end of each year.\n“For example for the year 2017, the Finance Ministry originally allocated a budget of €400,000 for travel by the office of the President. However, her office ended up spending almost twice that amount, €754,813, for that year,” the senior official explained.\nStatistics also show that Dr Coleiro Preca made most trips abroad last year, her last full-year in office, when she travelled 25 times.\nThe size of her delegations also ballooned over the years, increasing expenses significantly.\nWhile normally, under previous presidencies, only one minister used to accompany her on official visits, as per protocol, this rule was not followed during the last five years. On some occasions, the President’s delegation ended up having five ministers and parliamentary secretaries apart from a raft of chief executives and other senior government officials.\nThe office of the President of Malta is ceremonial and has no executive powers.", "comment_count": 49, "id": 3632}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "A five-day protest camp outside the Planning Authority, highlighting the 15-month delay in a review of the controversial fuel stations policy, will come to an end on Monday evening, activists said.“We are convinced that the pressure on the authorities to revise the damaging policy is indeed working,” Moviment Graffitti, which organised the protest, said in a statement.“These five days of direct action have been a truly encouraging experience for us since we have seen so many people expressing, in different ways, their outrage at the PA’s failure to change the fuel stations policy and at the authorities’ approach to our environment more generally.”Graffitti said it was satisfied that public pressure had forced the authorities to set an April deadline for the publication of the revised policy.“Should the authorities fail to publish the revised policy this month, or if the revised policy still allows ODZ fuel stations, Moviment Graffitti is ready to carry out further direct actions.”We are convinced that the pressure on the authorities to revise the damaging policy is indeed workingThe group also unveiled an online timer - www.pompitimer.org - counting the days, hours, minutes and seconds since the announcement of the policy review by environment minister Jose Herrera on January 25, 2018. Graffitti set up camp outside the PA on Thursday morning, in what they called a symbolic siege in response to authorities ‘besieging’ the country with over-development.Activists confronted planning minister Ian Borg and environment minister Dr Herrera outside their offices on Friday, where ministers promised to finally release the revised policy for public consultation this month.The controversial 2015 Fuel Stations Policy allows facilities to ‘relocate’ from urban cores to up to 3,000 square metres of ODZ land, as well as permitting entirely new stations in rural areas.The revision announced in January 2018, intended to reduce the burden on agricultural land, has not yet been completed.Proposals issued last April by the ERA, within Dr Herrera’s remit, included a complete ban on all new and relocated fuel stations on ODZ sites, but Dr Borg suggested last month that the ban may be applied only to new facilities.", "comment_count": 12, "id": 3633}, {"keywords": "", "author": "Denise Grech ", "article_body": "Around 500 people a year lose a part of their foot because of complications resulting from diabetes, academics and practitioners have warned. \nOne in eight adults aged 25 to 64 suffer from diabetes, and 10,000 people are unaware they have the disorder.\nHaving diabetes increases risks of developing a wider range of foot issues, often starting with a small foot problem that can become more complicated over time. Around 15 to 20 per cent of patients with diabetes will develop a foot ulcer at some point during their lifetime.\nEvery 20 seconds a lower limb is amputated due to diabetes, according to the International Working Group on the Diabetic Foot. Over 80 per cent of all amputations are caused by a foot ulcer and can be preventable.\nMajor amputations caused by diabetes fell by a third this year, according to statistics published by the Health Ministry. \nThe Times of Malta last year reported MEPs had warned government had ignored medical practitioners’ advice on shorter free insulin needles. \nMore commitment is needed to fight silent epidemic\nMEP Francis Zammit Dimech had said official requests by professionals for 4mm pen needles had been rejected. However, the Health Ministry had said the shorter needles could lead to incorrect dispensing if they were given to adolescents and adults instead of children. This was because the length might not be sufficient to reach the correct depth for best use of insulin, a spokesman for the ministry said.\nThe latest statistics on amputations emerged following a meeting by Dr Zammit Dimech with representatives of the Diabetes Foot Research Group at the University of Malta. During the meeting, the researchers spoke on the need to have updated information and data on diabetes. \nNoting several people in Malta were unaware they had diabetes, Dr Zammit Dimech called for the possibility of population-based screenings. He also recommended an extensive standardised diabetes register that would facilitate the exchanged of data across the EU. \nDr Zammit Dimech has reiterated his call for more investment in research, saying numbers in amputations were still relatively high.\n“More commitment is needed to fight this silent epidemic,” the PN MEP said.", "comment_count": 5, "id": 3634}, {"keywords": "", "author": "", "article_body": "Two men have been acquitted of bribery and corruption charges in the granting of a €30m IT contract for Mater Dei Hospital.\nThe proceedings were instituted by the police in 2007 against Noel Xuereb and Pierre Mercieca.\nMr Xuereb, of St Julian’s, was an employee of MITTS, the government IT agency seconded to the IT ministry as a core information systems manager and had served on the tender’s evaluation committee. Mr Mercieca, from Attard, was a consultant for Inso, a member of the AME consortium, which was one of the bidders. The investigation began after Mr Grech voiced suspicions.\nIn its conclusions, the court, presided by Magistrate Francesco Depasquale, observed that this case was launched in the wake of suspicions by Claudio Grech, who is now a Nationalist MP, and who at the time chaired the core evaluation committee.\nHis suspicions had been aroused after the original preferred bidder was excluded because of financial difficulties abroad, which had been highlighted by Noel Xuereb. \nThe police carried out an investigation, without a magisterial inquiry, and a series of documents and computers were seized.\nThe prosecution had concluded that since Mr Mercieca had in his possession tender documents with comments by Mr Xuereb, this meant that the tender's secrets had been divulged. \nThe prosecution had also suspected corruption because Mr Mercieca had given a fireplace to Noel Xuereb, allegedly as a gift in recognition for assistance in the hospital IT project tender. \nThe proceedings were instituted at the request of Mr Grech.\nHowever, the court said, none of the evidence backed the imputations based on Claudio Grech's suspicions. \nThe fireplace had not been a gift but had been paid for.\nFurthermore, as a long-serving core project manager at MITTS, it was Mr Xuereb's duty to ensure that the bidders were up to date with the government's requirements and that the final product met specifications. \nDoing his duty\nThe evidence showed that Mr Xuereb had been doing his duty. Although he had initially approved another company to become the preferred bidder, once he learnt of that company's financial and legal problems abroad, he informed the Core Evaluation Committee and Mr Grech, and he was eventually proven right that handing the contract to that company was a risk for the government. \nThe evidence showed that Mr Grech, as chairman of the Core Evaluation Committee, then chose to impose new conditions on the new preferred bidder, against the advice of the Director of Contracts.\nAt one point, Mr Grech insisted that the preferred bidder should produce a bank guarantee of €4 million even though this was not in the original tender requirements.\nIt was only through Noel Xuereb's insistence with Pierre Mercieca that the tenderer accepted to give a bank guarantee, albeit for a lower amount, despite their original protests.\nDespite all additional requests having been settled with the preferred bidder, and when the contract was at the brink of being signed, Mr Grech suddenly voiced his suspicions and, along with IT minister Austin Gatt, called the police to investigate. \nSmaller contract for eliminated bidder\nAs a result the government suspended and eventually cancelled the tender. It was then replaced by a much smaller project which again involved the company that had originally been eliminated because of its problems.\nThe court said that the evidence showed there had been no act of corruption by Noel Xuereb and Pierre Mercieca and there was no private gain.\nAs to the correspondence that allegedly existed between the accused, the court said that there had been correspondence by all parties, including Claudio Grech himself. No tender secrets had been disclosed by Mr Xuereb, and Mr Mercieca never attempted to corrupt anyone.\nBoth men were therefore acquitted.\nJoseph Giglio was counsel to Mr Xuereb and Manuel Mallia was counsel to Mr Mercieca.", "comment_count": 0, "id": 3635}, {"keywords": "", "author": "", "article_body": "One person was hospitalised on Monday afternoon following a traffic accident in Santa Venera.\nThe incident involving two cars on St Joseph High Street was reported to police at around 2pm.\nParamedics and police officers were seen at the scene. Parts of the street were temporarily closed to traffic.\nThe police said they had no further information about the crash or its victim at the time of writing.", "comment_count": 0, "id": 3636}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated at 3.35pm with video\nJustice Minister Owen Bonnici on Monday fended off concerns raised by the Group of States against Corruption (Greco) about Malta’s justice system facing paralysis unless reforms were undertaken.\nDr Bonnici said the government had consented to the publication of the Greco anti-corruption report this morning. The report was approved recently following a scheduled evaluation visit to Malta last October, but its publication had to be authorised by the government.\nThe Sunday Times of Malta reported how evaluators from the Council of Europe said it was clear Malta needed to increase its capacity to deal with allegations of corruption and other offences involving government officials.\nThe lack of action against top officials facing corruption allegations conveyed a feeling in the public that senior officials benefit from a total impunity for their actions, Greco said in its report.\nAsked to react to these strong findings, Dr Bonnici said the crux of the Greco criticism was about “legacy laws” that the government was intent on changing.\nWhen it was pointed out that the Labour government had been in power for six years and the Greco report was critical about the authorities handling of recent high-level corruption cases, Dr Bonnici countered that a raft of changes had already been introduced, such as whistleblower protection and party financing laws.\nThe report says Greco officials who carried out a visit to Malta last October were too often confronted with a culture of secrecy of many institutions, where reports, recommendations and conclusions are not published.\n“This is not compatible with an effective system of checks and balance. This situation calls for rapid changes,” Greco highlights.\nGreco’s evaluation team said they heard how institutions meant to hold the government to account suffered from a lack of courage, accountability and real means to accomplish their duties.\nDr Bonnici said many changes had already been introduced. Photo: DOI/Clodagh Farrugia O'Neill\nIn a statement on Monday, the Justice Ministry said Greco’s recommendations dealt mainly with systems and laws that Malta had for generations, some of them pre-dating Malta’s independence in 1964.\n“There are, in fact, no recommendations that in a way criticise any laws implemented by this government,\" the government said in a statement. It said the recommendations were on the same lines as the Venice Commission opinion, given last December, the contents of which, it said, were already being implemented.“The Greco report also acknowledges that some changes have already been affected since the Greco delegation’s visit to Malta, and which are not included in the report,” the government said.", "comment_count": 31, "id": 3637}, {"keywords": "", "author": "Keith Micallef", "article_body": "Malta’s poor showing in a recent evaluation of its anti-money laundering regime is being disputed by Finance Minister Edward Scicluna on the grounds that the findings were “leaked” midway through the process.\nMoreover, he lashed out against those whom he accused of “instigating” the Committee of Experts on the Evaluation of Anti-Money Laundering within the Council of Europe (Moneyval) – the entity which made this review - to take action against Malta.\nProf. Scicluna made these remarks when addressing social partners in a joint session of the Malta Council of Economic and Social Development and the Malta EU Action Steering Committee. The meeting, which was held at the Central Bank, focused on the 2019 National Reform Programme, which is meant to implement the annual recommendations issued to Malta by the European Commission, known as the country specific recommendations.\nLast month The Sunday Times of Malta reported that Malta had failed the first stage of a Moneyval test, which measures the country’s compliance with principal international standards to counter money laundering, and the effectiveness of their implementation. In view of this, the government was scrambling to improve its final score before the publication of the finalised report next summer.\nIn his address, the Finance Minister said he was aggrieved that a draft version of the report had been leaked. He noted that the evaluation by Moneyval was a long process which normally takes an entire year.\n“Somebody leaked this document midway through this process. We are in the eighth phase out of 15. This was confidential, as it would only be fair to publish it at the end when the process is complete,” he told social partners.While expressing concern that such leak was putting the entire process “in jeopardy” he added that Malta would have to suffer the consequences.\nProf. Scicluna also questioned the size the Moneyval delegation which visited Malta, late last year.\n“As a result of the fuss created about Malta, the Moneyval team which came to Malta was the largest ever,” he said.\nThe Finance Minister lamented that contrary to what used to happen in the past when such evaluation was carried out “serenely”, this time around it was a different story.\n“If you believe in this institution, you have to let it do its job. Do not try instigate it by feeding it directly with information, or by sending a letter through the council of Europe,” he said.\nProf. Scicluna said that he wanted to share this experience so that all those present for the meeting could reach their own conclusions.\nNational deficit \nIn his address, the Finance Minister also reacted to recent data published by the National Statistics Office, from which it transpired that government registered a €70.2 million deficit in 2018.\nProf. Scicluna downplayed these figures saying that they were based only cash flows, and do not give the wider picture.\n“It is like a cash register recording at the end of daily business, which does not into account other transactions,” he said.\nThe finance minister expressed himself confident that on April 23, when fresh data is scheduled to come out from the EU’s statistics office, Malta would not register a deficit in view of certain adjustments which need to be made.\n“There is nothing indicating that there will not be a surplus,” he said.\nTaking a dig at newspaper reports and at government’s critics he cautioned against rushing to conclusions on the matter.\n“Foreigners are thinking Malta is keeping its finances afloat thanks to the citizenship programme only. We have to demonstrate that even if one had to put aside the revenue from the IIP (Individual Investor Programme), there would still be a surplus,” he said.", "comment_count": 24, "id": 3638}, {"keywords": "", "author": "", "article_body": "A daredevil driver whose dangerous manoeuvre caused a collision three years ago, has landed a fine and a seven-day driving ban besides prompting a call by the Court for the introduction of road safety measures at the Siġġiewi bypass. \nThis warning was issued in criminal proceedings against Robert Galea, a 38-year old Siġġiewi resident, whose reckless driving one afternoon back in April 2016 had caused another motorist to crash into a tree.\nThe accident had taken place along Triq Mons Mikiel Azzopardi, Siġġiewi, a stretch of road which motorists regularly used as a ‘race track’ at the expense of residents and innocent passers-by, the Court observed.\nOn that particular afternoon, the accused, at the wheel of a blue Subaru Impreza, had overtaken four vehicles, crossing over to the opposite lane, heedless of oncoming traffic.\nA couple in a car driving in the opposite direction had a narrow miss when the driver was forced to swerve suddenly to avoid a direct impact with the Subaru Impreza, which drove on while the other driver and his female passenger ended up crashing into a tree by the roadside.\nA van driver who had witnessed the whole accident later recounted how he had been overtaken by a blue vehicle which had driven past at high speed, “sounding like a racing car,” also overtaking three other vehicles before ending up in the path of oncoming traffic.\nThere was no doubt that it had been the accused who had caused the accident\nThe driver who crashed his car had identified the colour and make of the other car, though not its registration number. Nor could its driver be identified on account of the Subaru Impreza’s tinted windows.\nHowever, the suspect was eventually tracked down and was prosecuted for his allegedly reckless driving and a series of other offences related to the accident, his defence counsel claiming that the identity of the culprit had not been confirmed and that the blue Subaru Impreza was not the only one of its kind on local roads. \nYet, on the basis of the testimonies and a host of circumstantial evidence, the Court, presided over by magistrate Joseph Mifsud, concluded that there was no doubt that it had been the accused who had caused the accident.\nThe Court declared the motorist guilty of negligent and reckless driving, failing to exercise due care and attention, crossing continuous white lines and damaging third party property, fining him €200 and imposing a seven-day driving ban.\nFurthermore, the Court called upon the relevant authorities for the immediate implementation of “speed calming measures” at the particular stretch of road to curb abuse, suggesting mobile speed cameras to catch drivers unawares.\nIn a decree delivered in conjunction with this judgment, the Court pointed out that the speed camera at Triq Mons Mikiel Azzopardi was proving ineffective and that other steps needed to be taken to curb abuse by those drivers who presented “a constant peril to those who lived there or happened to be passing by,” ordering that its decree be communicated to the Siġġiewi Local Council, Transport Malta and the Police Commissioner.", "comment_count": 27, "id": 3639}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A bird trapper who was fined and handed a three-year suspension of his licence for trapping during the closed season will have his case heard afresh on account of a divergence between the typed judgment and that originally written by the magistrate.\nCarmel Xerri had landed the €1,600 fine and licence suspension in May after he was found guilty on the strength of his statement and a series of short video clips provided by an environmental activist.\nHe had been arrested back in March 2017, charged with trapping during the closed season and using an illegal bird caller.\nIn the course of appeal proceedings, Mr Xerri's lawyer argued that his client's statement was inadmissible as evidence since he had not been assisted by a lawyer at the time.\nAs for the allegedly incriminating footage, defence lawyer Kathleen Calleja Grima, pointed out that the reportedly 30-minute incident filmed by the environmentalist was not reflected in the shorter footage apparently consisting of a series of short clips.\nMoreover, the video first showed three masked men in their trapping hides, followed by footage of three men walking across the fields.\n“It is submitted that the gaps between the first film and the second cannot be filled with suspicion or suppositions,” the lawyer argued, adding that the activist who had produced the footage had not actually seen any trapping activity going on, but merely trapping nets being laid out and later gathered.\nThe presence of such nets alone and the difficulty in identifying the masked men made it difficult to link the appellant to the illegal trapping, argued his lawyer.\nA further ground for challenging the conviction stemmed from a discrepancy between the judgment written in the magistrate’s hand and the typed version exhibited at the appeal stage, the lawyer argued.\nThe Court of Criminal Appeal, presided over by Madam Justice Consuelo Scerri Herrera, observed that whereas under the handwritten version the accused had been found guilty of all charges, in the typed version the last charge was declared time-barred.\nHowever, in both cases, the punishment inflicted had been the same, the court observed.\n“Therefore it emerges that there are two conflicting sentences with regards to what charges the appellant is being found guilty of.”\nCiting case law on the formal requisites of judgments, the court observed that a judgment was to declare the facts upon which guilt was based; the punishment and the article of law upon which guilt was based.\nIn this case, although the typed version adhered to the prerequisites for validity, the wording of the judgment did not fully reflect the original handwritten version, thus giving rise to two conflicting judgments, the court declared, thereby annulling the judgment and ordering the case to be heard afresh on the merits.", "comment_count": 7, "id": 3640}, {"keywords": "", "author": "Ivan Martin", "article_body": "It was 45 years ago to the day that the first Air Malta flight landed in Luqa from London’s Heathrow airport, with the anniversary celebrated in the British capital on Monday morning.\nTourism Minister Konrad Mizzi and Air Malta chairman Charles Mangion attended a cake cutting ceremony to mark 45 years of Malta’s eight-pointed cross crisscrossing the skies of Europe.\n“I can still remember the first Air Malta flight, back in 1974, which took off from here, Heathrow Airport, and landed in Malta. It was the start of a story that continues today,” Dr Mangion said.\nSince its first flight, ‘the airline of the Maltese islands’, as it is known, has carried some 56 million passengers on its aircraft, and today flies to around 50 major cities.\nThe journey over the years, Dr Mangion said, may have hit some turbulence, perhaps been made tougher through the headwinds of tricky financial navigation, but today was looking ahead at clearer skies.The journey may have hit some turbulence, perhaps made tougher through the headwinds of tricky financial navigation, but today was looking at clearer skies.\nDr Mangion said the company, which he professed to “have a love for”, was not resting on the laurels of its 45 years of experience.\nInstead, it was planning out the flight plan for the 45 years to come.\nPhoto: Ivan Martin\nPicking up where Dr Mangion left off, Minister Mizzi said his vision for the airline was one where the livery would finally be seen at other major airports such as New York’s JFK or Mumbai airport in India.\nThe airline was part of the island’s critical infrastructure - not only facilitating travel but acting as a vital bridge to the rest of the continent.\nWeighing in briefly on Air Malta and the country’s “special relationship” with the UK, Dr Mizzi said that irrespective of the outcome of Brexit, Malta was committed to be the most UK-friendly country in Europe.", "comment_count": 19, "id": 3641}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who had beaten up an off-duty police officer in a fit of road rage outside the St Julian’s tunnels two years ago, has been placed under a 250-hour community service order.\nThe case took place in January 2017.\nAngel Attard, 41, from Vittoriosa had allegedly got out of his Volkswagen and punched a plainclothes policeman who had stopped to warn him over his allegedly dangerous driving manoeuvres.\nThe victim had been out shopping with his girlfriend and had witnessed Mr Attard's driving as he sat in his girlfriend's car. Christian Agius, the off-duty officer assaulted.\nMr Attard was subsequently taken to court and accused of having grievously injured the off-duty officer without intending to place his life at risk, violently resisted a police officer in the execution of a legitimate order, assaulted the officer as well as having driven in a dangerous and reckless manner.\nOver a year later, in the course of the proceedings, the accused had registered an admission to all the charges except for violently resisting the police officer.\nMagistrate Donatella Frendo Dimech concluded that there was “an absolute lack of evidence” to prove that at the time of the incident, the victim had been executing a lawful order by a competent authority, thereby acquitting the accused of this charge.\nAs for the rest of the charges, to which the accused had registered an admission, at a not-so-early stage, the court declared him guilty.\nWhen meting out punishment, the court, whilst taking note of the accused’s tainted criminal record and all the circumstances of the case, also noted a Social Inquiry Report drawn up by a probation officer who said that Mr Attard had embarked upon the right path, had a fixed job and a stable life, buttressed by a supportive family.\nThe reporting officer thus recommended that the accused ought “to be allowed to continue to live this stability,” a recommendation which was adopted by the court, placing the man under a 250-hour community service order which would best serve the interests of society at large.\nAs for a claim for damages registered by the policeman in the course of the criminal proceedings, the court observed that a number of receipts issued by two private health clinics and a pharmacy, as well as a specialist’s email requesting payment for a psychiatric report, gave no indication of the nature of the medical consultation.\nNor had these documents been authenticated by the injured party or a representative of the clinics concerned, the court observed.\nThe victim had also requested compensation for 1,074 missed hours of extra duty, amounting to €12,199, without however, putting forward “the slightest shred of evidence” to support this claim, the court observed, adding that the least he could have done was to confirm this claim under oath and present all evidence to support this pretension.\nThe court thereby turned down the policeman's claim for damages.\nHowever, in its analysis of this claim, the court pointed out a negative prejudice resulting from recent amendments introduced by Act XXXII of 2018 whereby victims of wilful crimes against the person liable to a minimum prison term of 3 years, would have their claim for damages before the criminal court, capped at €10,000.\nThe wording of the law, as affected by the said amendments, meant that other victims, possibly suffering less grievous offences, would face no such capping of damages, the court explained, adding that this negative prejudice had clearly not been intended by the legislator, as evidenced by the parliamentary debates surrounding the amendments.\n“However the amendments as introduced did not reflect this reasoning,” the court remarked, thus ordering that a copy of the judgment be served upon the Minister for Justice, Culture and Local Government as well as the Attorney General.\nLawyers Franco Debono, Marion Camilleri and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 3642}, {"keywords": "", "author": "", "article_body": "Updated at 5.10pm with Giegold reaction\nThe Nationalist Party has condemned a call by Greens MEP Sven Giegold for the European Union to invoke an Article 7 procedure against Malta.\nMr Goldberg made the call on Sunday after the Council of Europe’s anti-corruption watchdog said that Malta’s criminal justice system is at risk of paralysis.\nThe Article 7 procedure means a member state may be denied certain rights, such as voting rights. \nThe PN said it was against such a procedure because the people should not suffer the consequences of the government's wrongs. \n\"It would be better if Mr Giegold and his European Greens were to focus their energies, like the Nationalist Party on pressuring the government and the people around it who are undermining Malta's reputation,\" the PN said.\nRead: Giegold urges HSBC to quit Malta\nIt insisted that the government should implement all of the Venice Commission's recommendations through constitutional amendments.\nThe government, it said, should also heed international reports which repeatedly complained that nothing was being done to tackle corruption. Every day of government inaction was detrimental to the country, the party said. \nPL: Too late for anyone to believe the PN\nIn a reaction, the Labour Party said the PN could not be credible in its remarks about Mr Giegold when its own MEPs had, for the past five years encouraged such people to undermine Malta, particularly in the financial services sector.  \nThe people knew who had really defended Malta's interests while the PN MEPs Roberta Metsola and David Casa rubbed shoulders with Mr Giegold on delegation visits to Malta.\nIt was too late for anyone to believe that they had meant no harm to Malta.  \n'Political cowardice' - Giegold\nThe MEP said he was nonplussed by the PL's criticism - \"I did not expect applause\", he said - but felt that the PN was being cowardly. \n\"It is political cowardice that the PN has been complaining about corruption and impunity for years but takes such a strong position against the opening of an Article 7 procedure,\" he said in a statement. ", "comment_count": 67, "id": 3643}, {"keywords": "", "author": "", "article_body": "Infrastructure Malta is doubling the width of the main road which links Qormi with Luqa.\nSite clearance has started for the road to be widened to four lanes from the current two.\nTransport Minister Ian Borg said the €9.5m project will include crash barriers, LED lighting, footpaths, safer bus lay-bys, landscaped areas and a 1-kilometre segregated cycle track which will link with the cycle lane introduced in Aviation Avenue.\nThe project will be implemented in phases to avoid inconveniences as much as possible. When the new lanes are finished, they will start being used while the old ones are closed and rebuilt.\nThe project includes 1.6 kilometres of underground water, internet and telecommunication services and a new rainwater system.\nThe minister said the works, in Triq Ħal Qormi and Triq San Tumas, were important especially because this was one of the main routes to the airport, the Ħal Far Industrial Estate, the Freeport and other businesses. ", "comment_count": 14, "id": 3644}, {"keywords": "", "author": "", "article_body": "Travellers on an Air Malta flight from Vienna to Malta via Catania suffered a delay of over nine hours and arrived in Malta on Monday morning.\nThe plane was due to arrive in Malta at midnight but arrived at 9.30am.\nThe delay developed after an aircraft suffered a fault in Malta before its outgoing flight.\nIt affected KM512/3 – Malta-Catania-Vienna-Catania-Malta and, to a lesser extent, KM626/7 Malta-Milan-Malta.\nAir Malta said on Twitter that its operations centre had worked to minimise delays, but safety came first.\nFlights were operating normally this morning.", "comment_count": 5, "id": 3645}, {"keywords": "", "author": "", "article_body": "215 contraband high-quality wines were found in a Marsamxett restaurant during an inspection by Customs officers.\nThe inspection followed investigations by JET - the Joint Enforcement Task Force formed by the Customs and Inland Revenue Departments. \nThe Customs Department said the investigations showed that the restaurateur was either directly importing contraband wine or buying the wine from somebody importing it without paying tax. ", "comment_count": 10, "id": 3646}, {"keywords": "", "author": "Denise Grech ", "article_body": "No fewer than 189 people had their licences revoked last year, following the introduction of a penalty point system that extended regulations to all drivers.\n164 people had their licence suspended following the penalty point system introduced in 2017, the Transport Ministry said.\nNineteen of the 189 drivers had their licence revoked for the second time.\nA total of 78 licences were also revoked during 2018 but to date their driving licence was not returned to Transport Malta, the spokesman added.\n“In such instances, if the licence holder does not return their driving licence after three letters or reminders, then Transport Malta informs the police to intervene and the driving licence in question will be collected by the police and returned to Transport Malta,” he said.\nThe penalty point system, introduced in December 2017, saw regulations, previously only applied to new drivers, being extended to everyone. \nThe licence in question will be collected by the police and returned to Transport Malta\nUnder the new system, drivers lose their licence for two months if they accumulate 12 penalty points over a 12-month period.\nUnderstanding the driving penalty points system\nThe system was “not very popular with motorists,” Transport Minister Ian Borg conceded, adding however, that it had proven to be effective. If their licence is revoked twice in three years, drivers must sit a fresh driving test before regaining the licence.\nA third revocation in five years means the driver can only sit for the test after a year of not driving, with the suspension rising to two years for those whose licence is revoked four times in a seven-year span.\nAuthorities are also looking to clamp down on parking offences, with a legal notice being introduced allowing photo and video evidence to be explicitly cited in the law.\nAlthough photo and video evidence has been used against parking offenders in the past, its admissibility was a legal grey area.", "comment_count": 56, "id": 3647}, {"keywords": "", "author": "", "article_body": "Updated Monday 7.45am - adds sacristan's explanation \nA sacristan at the centre of a mix-up which saw whisky instead of water being put in a chalice used by the Archbishop during Mass on Sunday has apologised.\nThe incident occurred while Mgr Scicluna was leading a concelebrated Mass at St John’s Co-Cathedral to mark the opening of the process for the beatification of former De La Salle brothers provincial Bro Louis Camilleri. \nSacristan Godwin Dalli said on Facebook that while he was not to blame for what had happened, he wanted to publicly apologise.\nHe explained that one of the volunteers who had been preparing the offerings got confused over the cupboards where the wine used for Mass was kept and picked the wrong one.\nNo contempt was meant, nor was this a joke. It was a mistake.\nDuring the Mass Archbishop Scicluna was heard asking whether whisky, rather than wine, had been put in his chalice.\n\"Is this wine or whisky?... it is whisky\", Mgr Scicluna was heard saying on the altar. A co-celebrant tasted it and agreed.\nAfter a pause the Mass continued as usual. A second chalice, containing consecrated wine, was used.\nA spokesman for the Curia said it was 'an unfortunate incident by the sacristans.'\nHe did not suggest this was a joke.\n ", "comment_count": 123, "id": 3648}, {"keywords": "", "author": "", "article_body": "Archbishop Charles Scicluna on Sunday formally proclaimed Lasallian Brother Louis Camilleri as ‘Servant of God’, in the first step towards beatification.\nDuring the ceremony, held at St John’s Co-Cathedral in Valletta, Mgr Scicluna urged people to follow in Bro. Louis’s footsteps and lead an exemplary life serving others. In his case, he served through education. \nBro. Louis, who died aged 87 in 2011, dedicated his life to Christian education as a De La Salle brother. He hailed from a humble working-class family in Żurrieq and was the second of 11 children. \nHe dedicated his early teaching career to the dockyard apprentices, who attended De La Salle College in Cottonera, before taking on leadership roles at De La Salle College, Stella Maris College, Gżira, including St Benild’s School, Sliema, and the Brothers’ novitiate in Mellieħa.\nBro. Louis is known by generations of teachers, parents and students, who came in contact with him and were influenced by him on both academic and spiritual levels.\nHis great spirit of faith and zeal, piety and readiness to help all \nHe initiated the Signum Fidei fraternity in Malta in 1981, and was loved and respected by all members of the fraternity for his great spirit of faith and zeal, piety and readiness to help all in whatever manner.\nSignum Fidei is an association of lay people who live by the spirit of the founder of the Lasallian community, St John Baptist de La Salle, and continues to meet regularly around the island.\nThe Cause of Bro. Louis’s Beatification is being led by Bro. Rodolfo Meoli, Postulator General of the Congregation of the Brothers of Christian Schools, assisted by Vice-Postulator Bro. Saviour Gatt. \nThis is the first step which is conducted at Diocesan level. Further steps of the Cause will be taken up, once that of the Malta Diocese is eventually concluded, by the Congregation for the Causes of Saints in Rome.", "comment_count": 7, "id": 3649}, {"keywords": "", "author": "Ivan Martin", "article_body": "Documents containing Opposition leader Adrian Delia’s ‘forged’ signature are linked to a shelf company which was one of several beneficiaries of suspicious payments believed to have originated from a London prostitution racket.\nDr Delia last week went to the authorities with documents which he says had his forged signature and asked them to investigate whether the documents were in any way linked to the findings of a money laundering probe, of which he was the subject last year. \nDr Delia’s calls for an investigation came as The Sunday Times of Malta recently reported how the Financial Intelligence Analysis Unit had in 2018 concluded there was reasonable suspicion that Dr Delia had been involved in laundering the proceeds of a London brothel back in the early 2000s. \nThe suspected money laundering had seen money from an alleged Soho brothel deposited into an offshore bank account Dr Delia held in Jersey. \nThe funds were then allegedly moved to other jurisdictions including Switzerland before they were eventually deposited into a Maltese bank account. \nIt was at this point that a number of cheques were made to several shelf companies owned by the Bajada family, clients of Dr Delia, who are suspected of having run the prostitution racket.\nMaltaToday yesterday reported that the documents presented by Dr Delia to the police – which are now also being probed by a magistrate – were company paperwork linked to company called Frankef Ltd.  \nIncorporated back in 1998, Frankef Ltd belonged to Kris Bajada, the son of Eucharist Bajada who is suspected of having masterminded the London brothel operation. Dr Delia was also a minority shareholder in the company.  \nDr Delia strongly refutes any allegations of wrongdoing and declares he has always acted according to the law\nSources told Times of Malta that the FIAU probe into Dr Delia had found that Frankef Ltd had in fact received around Lm25,000 (some €75,000) in cheques that are believed to have stemmed from the prostitution racket. \nThis, they explained, had resulted from information provided to the FIAU by Bank of Valletta as part of its money laundering analysis.  \nSources said Dr Delia and Mr Bajada junior “were and are currently” involved in a number of companies. Some of these – including Frankef – featured “in passing” in the FIAU analysis as recipients of cheques.  \nThe companies range from logistics service providers and fashion imports to others purportedly involved in drilling and oil field services.  \nThe sources told the Times of Malta that the link between the forged signatures on the documents presented by Dr Delia and the alleged criminal activity reported on by the FIAU was there, but the documents did not disprove the findings of the FIAU report.  \n“The suspected money laundering analysed by the FIAU saw money that allegedly came from brothels, put into Dr Delia’s offshore account and then moved around before it came to Malta. This company Frankef Ltd only appears at the end of the money trail. The main questions about the provenance of this money in the first place and why it was moved around in this manner, are not rendered mute,” a source said. \nPreliminary analysis indicates signature may have been forged\nHe later added that a preliminary analysis did indicate that Dr Delia’s signature may have been forged on these company documents, however this only posed more questions to investigators.   \nMeanwhile, the Times of Malta has sent a list of questions to the Opposition leader about the offshore account in his name which allegedly received the earnings of Soho prostitution. \nAfter a week of reminders, a spokesman for Dr Delia said it would be “imprudent” to get into specifics, saying the magisterial inquiry into the alleged forgeries precluded further comment. \n“Dr Delia strongly refutes any allegations of wrongdoing and declares that he has always acted according to the law. He categorically denies he has ever been involved in any illegal transactions which also counts for his years as a practising lawyer,” the spokesman said, adding Dr Delia was “a victim of signature fraud”. \nivan.martin@timesofmalta.com", "comment_count": 70, "id": 3650}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 7.05pm - \nJoseph Bonnici, 38 of Għaxaq admitted to the police that he had murdered his mother and sister and took the police to the field where he tried to bury them, a court was told on Sunday evening.\nPolice Inspector John Spiteri said Bonnici admitted to the killing during interrogation.\nHis admission came after police inspectors noticed that he had up to that time given conflicting answers to their questions. He eventually took them to the site near Gudja where the two had been buried.\nInspector Spiteri was speaking during Mr Bonnici's arraignment, the day after the two bodies were found in a field.\nBonnici wore a hoodie to cover his face as he was driven into the courthouse from Strait Street.\nHe was accused of murder, possession of an unlicensed weapon, firing the weapon, filing a false report, hiding cadavers and other charges including manufacturing a weapon with a silencer.\nHe pleaded not guilty. Magistrate Rachel Montebello remanded him in custody.  \nLawyers Franco Debono and Marion Camilleri were defence counsel.\nMr Bonnici was arrested early on Saturday after the bodies of the two women were found partly buried in a field.\nREAD: Double murder suspect seemed like a 'good man', neighbours say\nThe victims - Marie-Lourdes Bonnici, 70, and her daughter Angele, 29.\nMarie-Lourdes Bonnici, 70, and her daughter Angele, 29, are believed to have been shot in their home in Għaxaq and then taken to the field.\nThe motive is unknown.\nThe two had been reported missing by the police on Wednesday, having last been seen on Tuesday. \nOfficers were tipped off by a family member about where the bodies might be and the grim discoveries were made early on Saturday.\nThe suspect's father, Paul Bonnici, is currently serving a 31-year prison sentence after having been convicted of the double-murder of his neighbours 19 years ago.\nThe neighbours would regularly argue and things came to a head in May 2000, when Mr Bonnici shot Joseph and Carmela Dalli outside their home. He then reloaded the gun and shot the two at point-blank range in the head, the court was told during his trial.\nREAD: Man jailed for 31 years over double murder\n ", "comment_count": 0, "id": 3651}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A Maltese professor is helping save a variety of Arabic that is spoken by Christians and written in the Latin alphabet. Despite its historic resemblance, this language is not Maltese.\nSanna is a mix of Arabic and ancient Aramaic that is spoken by only 800 people from Cyprus’ Christian Maronite minority. The youngest speakers are in their 50s and Unesco has included it in its list of severely endangered languages.\nUntil recently there was no documented literature or poetry in Sanna, but then Maltese linguist Prof. Alexander Borg came along.\nHis involvement with the Cypriot Maronites was prompted by his study of Arabic dialectology at the Hebrew University, engendered in a scholarly interest in the striking cultural and linguistic parallels with Maltese – also a diaspora variety of Arabic spoken by Christians. His sensitivity to the unfortunate fate meted out to Christian communities in the Middle East also urged him to help the community.\nProf. Borg told The Sunday Times of Malta that the Greek-Turkish hostilities of 1974 resulted in the dispersion of the Arabic-speaking Maronite community, which made it difficult for the transmission of its ancient language to the younger generation.\nHe was able to undertake post-doctoral work for some years with the support of the Alexander von Humboldt Foundation (Germany), and his study of Cypriot Maronite Arabic has proven to be a fascinating discovery process.\nSurvival prospects are not very bright\nAlthough the Cypriot Maronites are often regarded as a Lebanese diaspora, his research demonstrated that their origins are in north Syria with close links to Mesopotamia. Significantly, the continuity of Cypriot Arabic with the traditions of eastern Christianity was also evident in its substratal formal links drawing on a variety of Western Aramaic, he noted.\n“From a human angle, the situation of the Maronite speakers of Cypriot Maronite Arabic evokes striking historical parallels with those of sectarian minority groups in the adjacent mainland that speak highly distinctive vernaculars, such as the Aramaic-speaking Christian and Jewish communities traditionally residing in southeast Turkey, northeast Syria, north Iraq, northwest Iran and Egypt.\n“Before the Bush and Blair invasion, Iraq had about 300,000 mostly Christian speakers of Aramaic. I can only shudder at the present fate meted out to many thousands of Aramaic speakers from that country and Syria,” he added.\nWhen it came to proposing an orthography, although some were inclined to adopt the Greek alphabet, Prof. Borg opted for a slightly modified version of the Latin alphabet.\nThe use of this orthography seems to have caught on and there is now an attempt to produce translations of selections from the Bible. Apart from its use in Maltese, the Latin alphabet had also been used to transcribe Andalusi Arabic in the 16th century.\nSadly, survival prospects for the language are not very bright, but, given its intrinsic interest and the feelings of its speaker community, it would be irresponsible to neglect its documentation, he told this newspaper.\nSanna has been tendered the status of a minority language by the European Commission and Prof. Borg hopes that his own work will serve the needs of linguistic research from the perspectives of Arabic language history and comparative Semitics.", "comment_count": 7, "id": 3652}, {"keywords": "", "author": "Denise Grech", "article_body": "Activists camping outside the Planning Authority's offices have decided to extend their stay until they feel their message against the building of more fuel stations outside development zones is heard.   \nSome 25 activists have been camped in front of the offices for three days to express their outrage that a promised new fuel stations policy has not yet been published.\nIn a meeting on Friday, Transport Minister Ian Borg said the fuel stations policy review will be published in April.\nActivists said they were unhappy with this response, saying they had been promised the review for a long time- to no avail.\nWhile they originally planned to stay over the weekend, they have decided to extend their stay “until we feel that the message has come across” Moviment Graffiti activist Victoria Pisani said.\n“Today is Freedom Day- and we are demanding freedom from developers,” Friends of the Earth director Martin Galea de Giovanni said.\nDin l-Art Helwa’s Stanley Farrugia Randon said people were dying as a result of what the government deemed to be development.\n“Each year, as a doctor, I keep seeing more pollution” he said, adding it was a big anomaly for the government to say it wanted fewer cars while supported more fuel stations.", "comment_count": 15, "id": 3653}, {"keywords": "", "author": "", "article_body": "A 58-year-old motorcyclist was seriously injured in a crash in Birzebbuġa on Sunday afternoon.\nThe police said the accident took place at 1.30pm in Qajjenza Road and involved a Mercedes driven by an 82-year-old German man who resides in Birzebbuġa and a Honda motorbike that was being driven by the 58-year-old man who resides in Marsaxlokk.\nA magisterial inquiry is under way. ", "comment_count": 1, "id": 3654}, {"keywords": "", "author": "", "article_body": "Marie-Louise Coleiro Preca has thanked the people as she prepares to end her presidency on Thursday.\n\"It has been my honour and privilege to have had this opportunity to be able to share with you, as one of you, these past five years as President of the Republic of Malta,\" she said in a message. \n\"Throughout that time, I have worked hard to uphold my constitutional duties, because I believe that democracy is the best means that we have, in today’s world, to celebrate human dignity and to safeguard the observance of human rights and peace, in our communities and in Maltese society.\n\"Serving as your President has been a privilege, and I am grateful to the representatives of the people through Parliament, where for the first time the nomination of President of Malta was reached through unanimous agreement, both by government and opposition, not-with-standing my coming from the government benches.\nI hope this consensus will continue for my successors\n\"I hope this consensus will continue for my successors, because the President of our nation should have no party but should serve the people, with loyalty and with a conscience that goes beyond any desire for popularity.\"\nThe President thanked the government and opposition for having received her criticisms with respect and accepted a number of her proposals and suggestions.\n\"Above all, I wish to thank the entire people of Malta and Gozo for the respect and support they have given me. My gratitude also goes to those among us who have criticised me, perhaps at times in haste and with lack of forethought, because I have learnt from the experience.\n\"I learnt from everyone, especially when I spent time among you. I learnt from our children and young people. I learned most keenly about how we are capable and competent in our capacity as individuals, but far more capable when we are united, and mindful of one another.\"\nPresident Coleiro Preca said she could see how the people of Malta have the ability to be unique.\n\"We have the ability to ensure that nobody feels isolated. We have the ability to strengthen unity, and moreover, to nurture peace among the nations.\n\"Our children want us to be united, and they want Malta to be a country in which nobody is made to suffer or to feel excluded. Our children want us to respect one another. Our children do not want conflict, rather, they want our country to welcome them and give them peace of mind.\"\nShe urged young people to be their country's activists in favour of inclusion.\nShe also expressed her best wishes for her successor, George Vella.\nShe said she would continue to do her part to promote sustainable peace, inclusive prosperity, and holistic wellbeing.", "comment_count": 10, "id": 3655}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Environmentalists camped outside the Planning Authority say the PA isintentionally dragging its feet on the long-promised Fuel Stations Policy Review. So what has happened in the 15 months since it was announced?  \nFour new fuel station applications have been submitted for land outside development zones since a revision of the controversial Fuel Stations Policy was announced in January 2018, planning records show.\nBut in that time, the tide seems to have turned against developers: although ODZ applications have continued to be heard under the existing policy, six have been rejected by the Planning Authority or withdrawn by applicants, while two have been approved.\nThe new applications, meanwhile, appear to be stalling. These include ODZ fuel stations in Bulebel, already rejected by the PA, as well as Marsascala, Attard and Birżebbuġa, two of which have been suspended by the applicant while the last is still being screened.\nThe Fuel Stations Policy was introduced in 2005\nAnother application for a major extension of an existing fuel station in Marsascala – approved just five months earlier – has also been suspended.\nApplications submitted since the review was announced will not be subjected to any eventual new policy, which is expected to be more restrictive.\nWere they all to be reactivated and accepted by the PA, the amount of ODZ land already committed to approved fuel stations – currently around 15,000 square metres, or more than two football pitches – would nearly double.\nThe Fuel Stations Policy was introduced in 2015 and allowed small kerbside facilities to relocate to ODZ land with a maximum footprint of 3,000 square metres, as well as permitting entirely new facilities in rural areas.\nSince its introduction, the PA has approved five ODZ fuel stations in Luqa, Burmarrad, Marsascala, Magħtab and Mġarr, the last a renewal of an earlier permit.\nThe policy review called by Environment Minister José Herrera is intended to lessen the burden on agricultural land, and proposals by the Environment and Resources Authority (ERA) included a ban on all new and relocated ODZ stations, as well as a reduced maximum size of 2,000 square metres.\nHowever, recent indications are that these proposals – submitted by ERA to the PA executive council back in April 2018 – are unlikely to be implemented in their current form.\nPlanning Minister Ian Borg told the Sunday Times of Malta in an interview in February that the ban may apply only to entirely new facilities, meaning the new policy would still allow relocated fuel stations on ODZ land.\nDr Herrera, under whose remit ERA falls, appeared to confirm this later, admitting to a lack of agreement with Dr Borg over the issue, and saying that should ODZ relocations continue to be allowed, the footprint would be much smaller than before, and that restrictions would be tightened.\nSince the review was announced in January 2018…\nTwo ODZ fuel stations have been approvedThree ODZ fuel stations have been rejectedThree ODZ applications have been withdrawn\nand as things stand...\nFive ODZ fuel stations have been approved since 2015Two ODZ applications remain pendingFour ODZ applications are currently suspended\n(Note: two more applications could no longer be traced on the PA server)", "comment_count": 0, "id": 3656}, {"keywords": "", "author": "Joseph Grech", "article_body": "Attendance to Mass, especially among youths, is nosediving. Is the Christian faith in danger of dying?\nYouths believe something, commit to an ideal, and are moved to act only when they are fully convinced. We see this happening when they lead the way on environmental issues.\nIt’s the same with faith. Youths will only trust the Christian faith and feel they belong in the Church when they are convinced of its authenticity – and in this regard we all have a duty as part of the ‘Church’.\nDeclining Mass numbers per se are not indicative of the level of faith, spirituality and commitment of youths today. Mass attendance is definitely important but it is only one criterion on which to gauge faith among youths.\nOne should distinguish between believing and belonging. Many Maltese youths still embrace human and religious values, such as the existence of God, the value and dignity of human life, Christian marriage, tolerance, a sense of justice, seeking meaning and cherishing the spiritual dimension of the human experience.\nThe challenge is how to transform the individualistic dimension of faith into the value of belonging to a living community of faith. Unless faith is understood as trust, it risks marginalisation. Faith is, above all, a lifestyle. The future of the Christian faith is not tied to individualistic views, as some would think.\nThe more multi-ethnic Malta becomes, the more we need acceptance, tolerance and mutual respect. These values do not spring out of nowhere. Faith embraces culture. Although faith is reliable irrespective of it being demonstrated, living up to one’s faith and convictions makes it credible.\nWhat is imperative today is a faith that is explored, questioned and put into practice. This is what youths normally do – they question their faith seriously, return to it, or strive to deepen and integrate it with the rest of their life. What is missing are the catalysts of faith who can inspire younger generations to be able to trust and to come to terms with themselves and God.\nDespite children attending religion lessons in schools and pre-Holy Communion catechism, and a large proportion attending Church schools, is the Church missing the opportunity to ‘catch them while they are young’? Does the religious formation of children need a radical reform?\nThe Church must definitely overhaul its religious formation. Formation that leads to faith merely on the level of rational enquiry is very limiting. Religion lessons in schools are about the study of religion; they are not a lived experience. Catechism should be different. It is meant to accompany and mentor the journey of faith. The humus of catechism is not the class but the living community of faith that accompanies the person. And I think this is where we are failing.\nA question to be asked is whether we have vibrant Christian communities in our Church structures. If adolescents fail to attend catechism classes, are unimpressed or opt out of Sunday Mass, we should ask why. A proper strategy needs to be implemented to invest in building true Christian communities living and incarnating the Gospel worldview.\nI would suggest three ideas. First, we need to motivate them to understand why a personal friendship with Jesus matters. We need to make room for imagination, particularly to relate faith to personal talents and experiences.\nSecondly, religious formation should be seen in terms of giving space to God’s reign among us, for example through commitment to social justice and building a better future for our common home. Most young people love to reach out to the sick, the poor or the environment.\nThe Church must definitely overhaul its religious formation\nThirdly, we could do more to combine faith formation and liturgy. This might lead to practical results concerning attitudes and values.\nCertain Catholic youth movements, such as the MUSEUM and the Youth Fellowship, are flourishing. Religious courses for adults run by the MSSP are well attended. What are they doing right?\nThe MUSEUM, the MSSP Oratory and other groups, movements and religious – and there are many – are spaces where there is a vibrant, living community of faith formed in faith through catechetical formation, intellectual knowledge of the faith, and which then provides the experiential dimension.\nThis is clear evidence that faith is still alive. Youths yearn for truth and authenticity. They flock together where their needs, dreams and aspirations are addressed meaningfully and persuasively. If we want to speak of hope in the Church, we should talk about the special ingredients that work wonders: persuasion, joy and belonging.\nBy persuasion, I mean committed Christians who seek to live their faith as best as they can. Faith matters to their life and they give hope to others. As Pope Francis says, Christian faith needs to be characterised by a joy that is felt and transmitted.\nPriestly vocations are plummeting. Does the Church need to abandon priestly celibacy and allow women to become priests in order for the faith to survive?\nIf there is a dwindling sense of belonging to the Church, then we cannot expect otherwise! If we wish to have more vocations, then we need people who encounter the Risen Christ personally in a vibrant, living Christian community of faith, who would then be ready to believe in the beauty of the Christian ideal and lead with a generous heart.\nTo foster the faith, our discourse should not necessarily be on women priests and celibacy, but rather on our readiness and decision to risk leaving behind everything to follow the Lord. This is only possible if there is a real encounter with the Risen Lord. Christian families play a part in helping young people to discern their vocation and to steer their life in the right direction.\nHave the clerical sex abuse scandals further undermined the Church’s authority and credibility? Or could they ironically lead to a stronger Church?\nIt pains me to talk about these scandals because it is really unfair to blame the Church, that is, the community of believers, without considering the commitment to the faith and the good work the Church does. Those in authority should be held responsible and accountable for wrong decisions. They should be pushing for greater accountability.\nThe emerging Church needs to mature, to have well-formed priests who understand their vocation not in terms of power, privilege and authority, but as a service that promotes the gifts and discipleship of the whole people of God.\nClericalism is said to be the root cause. But clericalism is not about being a priest but about seeking power within Church structures. And power begets abuse and arrogance. And it is not just priests who are in danger of falling into a culture of clericalism but also pastoral ministers and female religious.\nIt is important to have in the Church’s structures a more organised and empowered active collaboration with formed lay people co-responsible in the formation and leadership of the Church as well as in ecclesial ministry. All this may paradoxically help the Church prepare its candidates to become good preachers, prepared leaders of worship, collaborative leaders, public representatives of the Church and practitioners of pastoral charity.\nMaltese society displays the characteristics of ‘amoral familism’, namely a self-interested, family-centric society prepared to sacrifice principles such as integrity, good governance and the public good for one’s family’s interests and political tribalism. Is this partly a failure of the Church to inculcate true moral fibre, values and principles in the faithful?\nI would certainly not blame directly the Church for a weakening of society’s general moral fibre or morality in general. I would, however, say that the Church can do more to strengthen the human values of honesty, trustworthiness, solidarity and justice.\nWe should not remain silent in the face of domestic violence or bullying at any age. Civil and Church authorities should not act as if there is nothing wrong with stealing, character assassination, corruption, fake news, tax evasion, environmental degradation and taking false oaths in court. We need leaders who have the inner strength to stand up for what they believe is right, even in face of adversity.\nWhereas the Maltese have a reputation for being a hospitable people, today so many seem to be xenophobic, racist or unconcerned with the drowning of immigrants in the seas around us. Is this another sign of failure of Malta’s Christian faith?\nThe Church has nothing to do with xenophobia or racism that are unfortunately subtly eroding our civil and moral fibre. But yes, we should ask how it is possible that xenophobia and racism exist in a traditionally Catholic country. Something, somewhere went wrong.\nThe Church is committed to fight against stigmatisation of foreigners, but it certainly can do more to raise its awareness campaign. How can we ignore Pope Francis’ appeal to foster a couture of tolerance, inclusion and encounter?\nI can think of two ways how these can be overcome – political action and community engagement. What is most needed in society is respect, particularly when people are visibly different in terms of language, customs and lifestyle.\nThe recent reform of the IVF law, which gave the green light to the freezing of embryos, was seen by many as a precursor to the introduction of abortion in Malta. Is the Church in Malta losing the argument against its legalisation?\nThe Church is the main institution that manifests its constant effort to promote a culture of life and to protect human life at every stage of its development. During the public debate on embryo freezing, the Church did not mince words to indicate that this medical practice will lead to the gradual erosion of respect for a human being from the very first moment of fertilisation or conception. \nA caring society defends those who are voiceless and vulnerable. The destruction of the human embryo and the termination of vulnerable people by euthanasia or assisted suicide is a sign of degradation, not progress. The Church cannot shirk its responsibility in this matter.\nThe Church’s message today is one of many divergent ones in a cacophony of mainstream and social media. What, if anything, can it do better to get its message across to different audiences?\nThe Church needs to think outside the box. It should go to the peripheries and if it cannot go that far, it should at least make it to the public square. It should offer discussion, not ready-made answers. There is no reason to fear pushing boundaries to ensure the Church is able to have a conversation with the contemporary world.\nWhile certain issues are considered as hot potatoes I always keep in mind what the French philosopher Paul Ricoeur held, that Christians should always be prepared to talk to two audiences, believers or not, to whom they should convey something meaningful.\nHow many of the Faculty of Theology’s students are preparing for the priesthood and how many are lay people?\nThe Church needs to think outside the box\nWe have 154 students, of whom 10 per cent are preparing themselves for priestly ministry. This year four will become priests on April 27 at St John’s Co-Cathedral.\nIn general, three-fourths of our students are following a postgraduate degree, mainly in bioethics, spirituality/spiritual companionship, matrimonial canon law, youth ministry, Catholic school leadership and theology/religious studies. Morning students specialise in philosophical studies, theology and pastoral psychology.\nWhat changes would you like to introduce as Dean of your faculty? Is the faculty planning any new courses or other initiatives?\nI would like to see a versatile faculty re-connecting with various pastoral or social entities, re-proposing spiritual well-being and re-configuring spirituality in leadership and business.\nWe are working on two new courses. In the coming days, we will launch a new MA in Environmental Ethics. The programme will identify and analyse the deeply human philosophical, ethical and political underpinnings of the current state of cultural, biological and ecological degradation, as well as of the human potential for creating and safeguarding sustainable human ecologies for the benefit of both present and future generations.\nSecondly, we are finalising the Certificate in Safeguarding of Children and Young People, which will promote best practice and equip people engaged in pastoral ministry and other work with children and young people with the abilities and skills needed to safeguard them.\nThe abuse of children and young people needs to be confronted and tackled on many levels, particularly through education and training in safeguarding of all those involved in pastoral care, education, social work, voluntary work, healthcare, sports and other recreational activities.\nDoes the faculty have a wider role in Maltese society?\nAbsolutely. In July, it will hold a strategic planning session on how to have a wider role in Maltese society. We want to explore how we can connect with various institutions. To read and respond to the signs of the times, as a faculty we want to arm our people with the culture of dialogue as well as play an active role in the creation of an integrated and reconciled society.\nThe faculty is engaged in public consultancy on various legislation and policies, particularly through position papers written with other academics. We intend to continue this good practice. And we will continue to reach out and respond to the needs of the community through a multidisciplinary approach in line with the vision of the University of Malta.", "comment_count": 9, "id": 3657}, {"keywords": "", "author": "Denise Grech ", "article_body": "Malta is being taken over by outsiders, 40 years after Freedom Day, because its economy has become overly-dependant on foreigners, Opposition leader Adrian Delia said on Sunday \nHe told a PN activity in Kalkara that he had joined the President and the prime minister in laying flowers on the Freedom Monument in Vittoriosa, but the irony was that this government had made Malta dependent on foreigners.\n\nAccording to what the prime minister himself had said, Malta’s pensions could only be sustained if foreign workers were brought to Malta. Economic growth depended on the inflow of foreign workers; a metro system would only be viable if the population grew with foreign workers. And that too applied for the viability of the Gozo tunnel.\nRead: Not enough people to justify metro connection\nThe presence of an excessive amount of foreign workers was undermining what was truly Maltese and putting downward pressure on salaries, Dr Delia said.\nAnd most foreign workers, those brought to Malta from outside the EU, were treated as little more than slaves.\nHe had been handed copies of work contracts which showed how these workers were paid just 4.50 euros per hour, and then they had ‘further deductions’, he said.\nThey ended up paying up tax of just 55c per month. So was this how pensions were to be sustained? \nTourism Minister forging ahead with controversial Corinthia land deal\nTurning to the controversial Corinthia land deal, which had to be withdrawn following opposition by business leaders, environmental activists and the PN, Dr Delia observed that it had been reported that Dr Mizzi was forging ahead with a deal to hand over hundreds of thousands of square metres of land for just €17 million. Yet sources who spoke to Il-Mument said the amount of land set for developments related to the tourism sector would  decrease.\nUnder the original deal, the land was set to be developed into a six-star hotel, apartments and retail space.\nCorinthia agreed to lower buildings for tourism purposes. However, plans to take public land to take up apartments would remain the same.\n\"Our message is simple - we did not let you take the land December and we will never let you take this land away now,\" he said. \n\"Every negotiation Dr Mizzi did was structured around giving to the few,\" Dr Delia said. \"He thinks that in this, the most corrupt country in Europe, he can benefit,\" he added. \n'An illusion of surplus'\nDr Delia said recently published official figures also raised questions on where the surplus was. The government had ended last year in the red. When the Budget was presented, the government knew it would end up with a deficit, but the Prime Minister had insisted on a budget of \"all tricks and no treats\", he said. \nIn reaction to the Moneyval report, Dr Delia warned Malta could be blacklisted unless it addressed shortcomings immediately. \nMalta’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation, with the government now scrambling to push up its final score before the summer deadline.\n\"Following every report, we are finding ourselves without adequate explanation,\" Dr Delia said, adding this was embarassing. \nHe also referred to a report by Greco, the Council of Europe’s anti-corruption watchdog which had warned that Malta's criminal justice system was ‘at risk of paralysis’. \nThe situation, he said, was very grave and the government should immediately publish the report, not keep hiding it as it had done in the Egrant inquiry case. ", "comment_count": 58, "id": 3658}, {"keywords": "", "author": "Claire Caruana", "article_body": "Prime Minister Joseph Muscat on Sunday said he was “disgusted” by some people’s level of racism and intolerance in the wake of the hijack of a commercial vessel on Wednesday evening.\nAddressing Labour Party supporters in Mtarfa, Dr Muscat said that while the country’s armed forces had received praise for the way they handled the situation, including, he said, from other heads of states, some people had resorted to racist and intolerant discourse.\n“I was disgusted that while we were sensitive to the situation, all the while taking the necessary action, there were some people, who should know better, who were practically saying we should have shot and sunk the ship.\n“I’m not saying that we do not understand those who express concern because of the influx of foreigners living in their locality. We have in fact taken steps to step up security in certain places, such as Marsa. But we cannot accept racist and intolerant discourse,” Dr Muscat said.\n\nOn Freedom Day, which is being celebrated today, Dr Muscat said that it was crucial to keep in mind that all national feasts are of importance to the nation’s history. In recent years, he said, the Labour government had been striving to shift the mentality that one public holiday is celebrated by a group of people and another by a different group.\nHe went on to insist that moving forward, if the country wanted to remain free, it could not build walls around itself.\n“We need to understand that to move forward, we cannot build walls. We need to be open. It is very attractive to have politics based on the building of walls. After you build walls all around you, you will soon realise that you have imprisoned yourself. We want to continue inspiring people to challenge things and to inspire ourselves by the ideals that made our country free.\n“Our freedom is not a celebration of extreme nationalism. [Former Prime Minister] Dom Mintoff wanted Malta to be free so that we can sit alongside other nations on tables,” Dr Muscat went on.\nMoving on to outline the past week’s main events, Dr Muscat hailed the unveiling of the National Space Strategy, admitting that when he first heard about such a move, he himself had laughed at the proposed vision that was put before him, but he then soon learnt that there was great scope for investment in an “innovative sector”. Innovation, he went on, would be the driving force behind the government’s work in the coming year.\nOn arts and culture, Dr Muscat said that this is another area that is successfully moving forward. Through Valletta 2018, he said, the country had showcased how much good can be done through arts and culture. In fact, jobs in the sector increased by 18 per cent, he said.\nReferring to a public consultation document that was also unveiled earlier on in the week and which could see Parliament growing by up to 12 seats to increase the number of women MPs, Dr Muscat said that it was unacceptable that there had only ever been a total of 27 women elected.\n“How can we accept the fact that, for as long as there have been elections in Malta, there have only ever been 27 women elected? This tells me that there is something intrinsically wrong in the system.\n“We want to have 40 per cent of MPs women. Is this really such a big thing?” the Prime Minister went on, insisting that while other countries had introduced other measures to address the gender imbalance problem, Malta could not because of the way its MPs are elected.\nWhile other countries had asked political parties to include a woman for every man in Parliament to ensure equal participation, the system in Malta, which lets voters choose individual candidates, did not make this a viable option, he pointed out.\nThe proposed changes, Dr Muscat said, would not be set in stone forever, but aimed at addressing the present situation and it was then up to future generations to continue working on the issue depending on the changes that would have continued to occur over time.", "comment_count": 118, "id": 3659}, {"keywords": "", "author": "", "article_body": "A study on the possible relocation of the Freedom Day monument to a more open and suitable place that bears true identity should be carried out, the Democratic Party said on Sunday, the 40th anniversary of Freedom Day.\nFreedom Day marks the closure of the British military bases on March 31,1979, marking the first time in history that Malta had no foreigners occupying any part of its territory.\nThe monument is located at Vittoriosa seafront, a site associated with the British naval presence.\nBut the PD said the present location is one that does not attribute the honour and aura that such a monument deserves.\n\"It has become little better than a traffic island. Moreover it has aesthetically ruined the significance of St Lawrence square and its famed church\" the party said.\nPD MEP candidate and general secretary Martin Cauchi Inglott and candidate Antony Buttigieg said those older than 40 recalled a different kind of freedom, the freedom where they enjoyed a beautiful unspoilt and tranquil country, with clear blue seas, often referred to the gem in the Mediterranean.\n\"So has our hard earned freedom really transformed into quality of life?”  \n\"If it were up to Partit Demokratiku, Freedom Day would be celebrated when we are free from the oligarchs’ grip on government and our public land, and where every business competes equally for government contracts. Real freedom means that all of us are able to realise our full potential and capabilities without political, social and peer influence. When we manage that, then yes, we can start celebrating Freedom Day again,\" the candidates said.\nPresident, political leaders lay wreaths\nPresident Marie-Louise Coleiro Preca laid a wreath on the Freedom Monument on Sunday morning. \nShe was accompanied by Prime Minister Joseph Muscat and Opposition leader Adrian Delia.\nEarlier the AFM held a parade and a Guard of Honour formed in front of the monument, It was inspected by the president at the start of the wreath-laying ceremony.", "comment_count": 26, "id": 3660}, {"keywords": "", "author": "Jacob Borg", "article_body": "Malta’s criminal justice system is at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates took place, the Council of Europe’s anti-corruption watchdog has warned.\n\nIn a draft copy of an evaluation report carried out by Group of States Against Corruption (Greco) seen by The Sunday Times of Malta, evaluators said it was clear Malta needed to increase its capacity to deal with allegations of corruption and other offences involving government officials.\nThe lack of action against top officials facing corruption allegations conveyed a feeling in the public that senior officials benefit from a total impunity for their actions.\n\n\nJustice Minister Owen Bonnici announced during the same week the as yet unpublished Greco report was adopted by the Council of Europe (CoE) that the government would be hiving off the prosecution role from the Attorney General, as per one of the many recommendations by the CoE’s advisory body, the Venice Commission.\nThe timing of Dr Bonnici’s announcement about the reforms could be seen as a bid by the government to take some of the string out of the Greco report.\nFormer Prime Minister Alfred Sant expressed his disagreement in the European Parliament last week about the “quick commitment” by the government to adopt the changes.\n‘Crisis culminated with assassination’\nThe report charts how former Police Commissioner Michael Cassar went out on sick leave and resigned upon receiving a request from the FIAU to investigate the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi in April 2016.\nIt details how Prime Minister Joseph Muscat carried out a Cabinet reshuffle, in which the officials involved were retained instead of dismissed.\n“The crisis culminated in October 2017 with the assassination of Daphne Caruana Galizia, who had reported extensively about the number of anomalies in the conduct of public affairs in recent years,” the report says.\nThe report strikes an unimpressed tone about the arrest of three people “considered by many as mere executants acting at the request of influential persons”.\nThe Commissioner for Standards’ reluctance to touch the 17 Black revelations also raised questions from Greco.\nAcknowledging that the law governing the Commissioner precludes him from investigating actions that took place before the new laws on standards in public life came into force, Greco argues that it is an ongoing controversy.\n“The Greco evaluation team would find it particularly strange that no such action were to be taken although the situation continues in the present,” the reports says on 17 Black.\nGreco’s damning assessment in quotes:\n■ On institutional weakness:\n“Malta has on paper an impressive arsenal of public institutions involved in checks and balance.\n“However, their effectiveness is being questioned as the country was confronted in recent years with an unprecedented wave of controversies concerning the integrity of senior government officials up to the highest level.”\n■ On the centralisation of power:\n“During the interviews, the Greco evaluation team heard repeatedly that these bodies [meant to hold government to account] – with a few exceptions – suffered from a lack of courage, accountability and real means to accomplish their duties.\n“There is also a clear perception in Malta that political support currently prevails over the enforcement of the law and the general interest.\n“This is of course facilitated by the current institutional overweight of the government and especially the Prime Minister, in particular when it comes to appointments (and dismissals) in such essential State functions.”\n■ On the criminal justice system:\n“Malta’s criminal justice system relies excessively on the central role of the police, which is competent both for the investigation and prosecution of criminal offences.\n“The police has the reputation of being traditionally heavily subjected to the executive branch of power and that its ability to deal with sensitive or major cases depended largely on the capacities, determination and self-assertiveness of the head of the institution to lead the work despite external pressures.\n“This was repeatedly underlined during interviews and in media material consulted by the Greco evaluation team.”\n■ On the Permanent Commission against Corruption:\n“The Greco evaluation team’s conclusion is that in the current context, there is no added value with the Permanent Commission against Corruption (which could be abolished).\n“The criminal investigation and prosecution system should be reformed and be made more responsive and effective, with the prosecutors being given the faculty to direct investigations and the responsibility for taking such cases to court. This would obviously require structural changes.”\n■ On the police:\n“The present report lists a number of desirable improvements, including more robust ethical standards, a clear merit-based approach for career decisions and promotions, the introduction of a communication policy, a more robust training system must be developed and so on.\n“The independent Police Complaints Board should be strengthened and become an effective control body. And to counter corruption and other possible issues, a clear policy on reporting and disclosures, combined with protective measures for those who blow the whistle, is needed in the force.”\n■ On the Commissioner for Standards:\n“The media reported that on the first day in office, the Commissioner stated that he might not investigate the case of 17 Black, one of the central legal entities suspected of being involved in secret dealings with currently serving government officials and there are fears that the Commissioner for Standards in Public Life would remain a weak body.\n“The Greco evaluation team would find it particularly strange that no such action were to be taken although the situation continues in the present.”\nA look at some of Greco’s recommendations\nThat a strategy be developed and implemented to increase the capacity, authority and public accountability of State institutions entrusted with regulatory and control functions in relation to the management of public resources.\nThat the criminal investigation and prosecution system be reformed along the lines identified by the Venice Commission in its assessment from December 2018, without retaining the parallel jurisdiction of the Permanent Commission against Corruption and ii) that it be made clear for criminal investigative bodies that the launching of an inquiry or investigation does not require that evidence is readily submitted to them.\nThat detailed rules be introduced on the way in which persons exercising top executive functions interact with lobbyists and other third parties seeking to influence the public decision-making process; and (ii) that sufficient information about the purpose of these contacts be disclosed to the public in a systematic, timely and easily accessible manner, such as the identity of the person(s) with whom (or on whose behalf) the meeting(s) took place and the specific subject matter(s) of the discussion.\nThat the current regime of asset declaration be further developed by (i) extending to all persons entrusted with top executive functions, including persons of trust who are associated with a minister’s decision-making, the duty to file a detailed declaration of assets with the Commissioner for Standards in Public Life, considering including information on the spouses (it being understood that this last information would not necessarily be made public), and (ii) ensuring that all asset declarations are made systematically, easily and publicly accessible online.\nThe status of persons appointed to positions of trust be clearly identified and regulated, and that those very few who would be appointed to such positions and who would perform top executive functions be required to comply with the highest standards of integrity, including as regards rules of conduct, conflicts of interest, declaratory obligations and supervision by the Commissioner for standards in public life.\nA dedicated anti-corruption strategy be adopted and implemented for the Maltese Police Force, based on proper risk assessments, so as to promote a culture of integrity and to restore public trust in the Force through a robust set of rules, effective compliance, merit-based career systems, operational independence and political neutrality, as well as increased awareness and gender balance at all levels.\nGerman MEP: Time for the European Commission to act\nGerman Greens MEP Sven Giegold in a reaction to the report said on Sunday that the European Commission needed to act about Malta.\n\"The EU Commission must make the situation in Malta a top priority and initiate a procedure under Article 7 of the EU Treaties. So far, the responsible Vice-President and Social Democratic commission president-candidate for the European elections (Hans Timmermans) has referred the matter to Justice Commissioner Jurová. Following the Council of Europe’s dramatic findings,  Timmermans must put an end to his hesitation. The S&D Group in the European Parliament must also ask itself why Malta’s Socialists are still members of their group,\" he said.\n\"Institutional change is no substitute for criminal prosecution. It is a positive step that the Maltese government has announced changes to Malta’s constitutional set up. Nevertheless, it is completely unacceptable that Konrad Mizzi and Keith Schembri are still in office and that the financial services provider Nexia BT continues to operate on the market with impunity“.\nA procedure under Article 7 means suspension of certain rights from a member state, such as the suspension of voting rights. \nMr Giegold is a member of the EP committee on the rule of law in Malta and Slovakia. \njacob.borg@timesofmalta.com", "comment_count": 83, "id": 3661}, {"keywords": "", "author": "", "article_body": "A 17-year-old French teenager was grievously injured late on Saturday in a traffic accident in Triq l-Għarb in Għasri, Gozo.\nThe police said the young man was hit by a Toyota Tercel driven by a 41-year-old man who resides in Xagħra, Gozo.\nPolice investigations are underway.", "comment_count": 0, "id": 3662}, {"keywords": "", "author": "Keith Micallef", "article_body": "Sixteen frozen embryos are being stored at Mater Dei Hospital, three months after the practice was introduced as a procedure in fertility treatments in Malta, according to the 2018 Embryo Protection Authority annual report.\nThe Embryo Protection Authority, which regulates all assisted reproductive technology (ART), received 27 requests for embryo freezing. Though all of these requests were accepted, only 10 prospective parents had resultant embryos to freeze.\nIn turn, this led to 16 embryos being cryopreserved (medical term used for preservation through the use of cooling at low temperatures). All of these cases concern services offered at Mater Dei’s ART clinic, as this is not offered at St James Hospital, which is privately owned.  \nFurthermore, two of these 10 prospective parents are expecting to give birth, meaning that if they decide against resorting to ART in the future, their remaining embryos could be given up for adoption.\nDuring the period under review, controversial amendments to the Embryo Protection Act came into force, whereby prospective parents could opt to have a number of embryos frozen, for future use, in order to improve the success rate.\nREAD: 500 doctors object to embryo freezing\nThese and other changes, including the possibility of adopting an unused embryo, had prompted fierce objections from over 500 medical doctors, mainly on ethical grounds, to the point that they had even presented a signed declaration to Health Minister Chris Fearne. Though the government had watered down the initial proposal by ditching the introduction of surrogacy, it forged ahead on embryo freezing, which came into force on October 1 of last year.\nTake-home baby rate increased by 1.92 per cent when compared to 2017\nPrior to these changes, such a measure was only allowed in exceptional circumstances owing to grave and certified force majeur not predicted at the moment of fertilisation.\nIn this respect the report noted that apart from the 16 embryos frozen as part of the routine treatment introduced in the last three months of last year, there were a further two that hat been vitrified prior to that under the exceptional cases clause. Moreover, it notes that during the entire six-year period between 2013 and 2018, just seven embryos had been vitrified on similar exceptional grounds.\nREAD: Embryo freezing is ‘a must’, couples suffering in silence - lab director\nApart from this particular aspect, the report notes that last year the so-called take-home baby rate, which measures the fraction of birth events from the overall number of couples who underwent treatment, increased by 1.92 per cent when compared to 2017, up to 18.7 per cent.\nIn 2018, the number of procedures carried out had fallen by 19.42 per cent over the previous year. \nOther main trends in 2018\n249 cycles were carried out – 205 at Mater Dei and 44 at St James Hospital – which resulted in 56 pregnancies of whom 10 ended in miscarriage.\nNone of the couples were foreigners meaning there was no medical tourism in this sector. There were 31 female patients  aged 40-42, while the oldest male was in 56-60 age bracket.\nIn 2018, maternal age was the most important factor with respect to chances of pregnancy with the highest rate being for women aged between 25-28 years.\nObese women had a lower chance of success. A fifth of pregnant females in the Obesity Class I suffered a miscarriage, rising to a third in Class II (more obese), and 100 per cent for Class III (most obese) whereby the only patient suffered a miscarriage.", "comment_count": 7, "id": 3663}, {"keywords": "", "author": "", "article_body": "Daylight saving time, better known as Summer time, started early on Sunday when clocks were moved forward by an hour.  \nIt is a twice-yearly routine which could soon be a thing of the past. The EU is moving fast on a proposal for each country to opt for a fixed time all year round, whether it is 'winter' or 'summer' time. \nAn online consultation gathered 4.6 million responses from all 28 Member States.\nMore than 80 per cent wanted to abolish the EU's switch and favoured keeping the time used in summer for the whole year. A large majority of the Maltese also want to retain 'summer' time all year.\nThe European Parliament has backed the change and it is now up to national parliaments to decide which time each country will retain. \nGermany was the first country to introduce daylight saving time, in 1916, it in a bid to save energy during the First World War. Britain followed that same year.  Biannual clock changes became part of EU law in 1996.", "comment_count": 20, "id": 3664}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday. Most of the newspapers feature the Gudja double murder on their front pages. In other stories: \nThe Sunday Times of Malta reports that that according to the Council of Europe’s anti-corruption watchdog, Malta’s criminal justice system is at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates takes place.  \nThe Malta Independent on Sunday says the Council of Europe's anti-corruption body is awaiting government permission to publish a damning report on Malta. \nMaltaToday says the police doubt that there is a link between 'falsified signatures' claimed by Adrian Delia and an FIAU probe into his financial dealings. The newspaper also reports that Birkirkara council has banned anyone from sleeping in public gardens within the locality.\nIt-Torċa reports that Air Malta is studying the viability of more modern aircraft, longer-range aircraft. The newspaper also carries remarks by outgoing President Marie-Louise Coleiro Preca, who underlined the importance of dialogue and mutual respect.   \nIl-Mument says minister Konrad Mizzi is only planning cosmetic changes to the land agreement with the Corinthia group in Pembroke, but will not announce anything before the European Parliament elections. \nIllum says Adrian Delia will not resign from the PN despite being investigated for alleged money laundering, despite expecting the same from others. \n ", "comment_count": 0, "id": 3665}, {"keywords": "Education", "author": "", "article_body": "Youths from Our Lady of the Sacred Heart of Jesus (Sacro Cuor) parish church, Sliema, are gearing up to stage a pageant on the Passion on Saturday, April 13.\nRehearsals have been taking place on a weekly basis over the past few months. The cast comprises about 40 youths aged between six and 30-something, backed by a 10-strong backstage crew. Most are from the parish itself with some from other parts of the island, including Gozo.\nThe script was written by two of the youths themselves, and following last year’s success, will include new scenes. It will again be direc­ted by Robert Pulis, assisted by Tony Terribile. The scriptwriters had to use their imagination for some of the scenes as the Gospels do not offer a lot of detail for which they could develop dialogue, such as those where Jesus meets Herod and Veronica.\nMeanwhile, other scenes, such as those involving Pontius Pilate, presented the director with logistical challenges.\nThe pageant starts at 7.30pm at the parish church and will pass through Dun Pawl Vella Street, Church Street, St John the Baptist Street, St Trofimu Street, and end back in the church.\nThe costumes are being kindly provided by Atturi Salesjani, the wardrobe is being managed by Joe Camilleri, while most of the props have been hand-made by the director himself.", "comment_count": 0, "id": 3666}, {"keywords": "Education", "author": "", "article_body": "Antoine Guerin de Montgareuil from the French Alternative Energies and Atomic Energy Commission (CEA) recently delivered a lecture hosted by the Malta Group of Professional Engineering Institutions (MGPEI) on technologies developed at CEA and their potential application on insular territories.\nThe lecture was the first in a series forming part of the €1 million EU Joint Universal Activities for Mediterranean PV Integration Excellence (Jump2Excel) project, led by the Malta College of Arts, Science and Technology (Mcast), which is aimed at promoting research on photovoltaic (PV) integration.\nGuerin de Montgareuil was in Malta for a ‘mentoring week’ during which he also met with Mcast energy researchers, staff at the college’s Institute of Engineering and Transport, and other Maltese stakeholders to discuss a wide range of topics related to photovoltaics integration.\nDuring this mentoring week, training on modelling photovoltaic energy production was carried out, together with a presentation of Mother PV method developed by CEA.\nJump2Excel focuses on five research themes: (i) fusion of emerging technology development; (ii) energy-water nexus; (iii) future electricity markets; and (iv) examining energy pathways in the Mediterranean.\nMcast students, academics and staff, the Maltese research community and the public, may take part free of charge in its activities, which also include workshops, internships, exchanges, training, mentoring sessions, public lectures and conferences in Malta and at the other project partners.\nThe other partners in the project, which is supported by the EU’s Horizon 2020 research and innovation programme, are the CEA, the National Renewable Energy Centre of Spain (CENER), and the University of Manchester, UK.\nFor further information, e-mail the Mcast Energy Group on energy@mcast.edu.mt or visit the project webpage below.\nhttp://jump2excel.eu", "comment_count": 0, "id": 3667}, {"keywords": "Environment", "author": "Alex Vella", "article_body": "It is delightful to feel your bones dry up again under the snug spring sunshine after enduring a stretched soggy spell of a stormy Maltese winter. It is also pleasantly reassuring that nature springs out strong again from the ravaging storms that savagely lashed at it. Mighty trees have been felled, their leaves parched.\nStill, the frail buds, the dainty blossoms, the slight song birds, the buzzing bees – all nature comes out renewed with the vigour of spring. The darkness is gone and the sky has cleared, the sun prevails the sky, in celebration of rebirth.\nNot so with man-made storms that violate nature and the Maltese islands’ native character.\nThe assault of speculative development on nature drops trees dead and destroys native landscapes forever. It delivers death instead of rebirth by aborting swathes of nature under blankets of concrete, and now even on valley floors, approved by the State itself.\nThis winter will wither away only once the Planning Authority is reformed, namely its decision makers – the ‘masterminds’\nThe light and warmth of the life-giving sun is obscured by unsightly towers casting grave dark shadows, celebrating death. Typical Maltese street­scapes are scarred, soul-less. Spring and rebirth are swapped for an interminable winter of discontent for all but the few making money big time.\nThis winter will wither away only once the Planning Authority is reformed, namely its decision makers – the ‘masterminds’, not the puppets who are stringed to play ball.\nThe germ of the malaise may be attributed to the longevity of employment of the handful of decision makers at the authority, who before were case officers but are now at the helm.\nBut this longevity is dwarfed by the current planning disaster that is Malta, which has been condemned by every worthy local entity, and lately even by the Malta Developers Association itself.\nThe term ‘master plan’ is an anathema to these masterminds, whose mission is to enjoy the freedom to issue permits as they please, and to appease.\nOne needs only to look at recent PA policies, such as like the rural policy, the fuel stations policy, the floor area ratio policy, the height limitation adjustment policy, that these masterminds themselves drew up in a pliable way so as to be able to issue development permits to whoever they prefer for one reason or another.\nMind you, the permits are often issued subject to conditions. But how true the words of ex-Mepa director Martin Seychell still sound today: “We at Mepa know that we don’t have the means to enforce conditions. Therefore, attaching conditions is only an insincere way of trying to give credibility to an unacceptable permit.”\nToday, unacceptable is the norm in Malta. Clearly something is rotten in the State of Denmark.\nVisiting the Victoria Lines fort facing Fomm ir-Riħ.\nApril walks\nSunday, April 7 – Nature trail around Naxxar, Mosta and Bidnija (Scenic)\nParticipants will descend by the Naxxar cart ruts down to St Catherine chapel in Wied il-Għasel to behold beautiful meadows along the valley between Mosta and Burmarrad. The moderate walk then ascends Bidnija hill and proceeds atop the ridge with breathtaking scenic views of the eastern shores of Qawra and Salini.\nDuration: Three to four hours\nRating: Moderate\nMeeting place: T’Alla u Ommu roundabout in Naxxar\nStarting time: 9am\nWednesday, April 10 – Tunnara Museum visit and walk along Marfa ridge (Cultural/scenic).\nA cultural visit to the Tunnara Museum, Mellieħa Bay, with detailed explanations about the tuna fishing that used to be practised by fishermen in the bay, followed by a scenic walk along Marfa ridge from L-Aħrax to Il-Qammieħ.\nDuration: Three to four hours, including museum visit\nRating: Easy to moderate\nMeeting place: It-Tunnara, Għadira\nStarting time: 2pm\nScenic view of Ras il-Pellegrin from the Victoria Lines.\nSunday, April 14 – Cold War bunker visit and walk along the central Victoria Lines (Cultural/scenic)\nA cultural visit to a British defensive outpost later adapted as a Cold War bunker, followed by a walk in close affinity to nature through Burmarrad, Wied ta’ Għajn Mula, Bidnija, Dwejra, Falka Gap and back to Tarġa Gap.\nDuration: About four hours\nRating: Moderate to hard\nMeeting point: Tarġa Gap entry road to Ġnien tal-Għarusa tal-Mosta\nStarting time: 9am\nSaturday, April 20 – Gozo mystery walk (Scenic/geological)                    \nA walk mostly on rugged terrain to fully enjoy nature at its best in the spirit of the outdoor. The routes will remain mysterious. Tiny, greener Gozo may still surprise many participants with some lovely views of land and sea.\nDuration: About four hours\nRating: Moderate, with some rough terrain\nMeeting point: Just outside Mġarr terminal, Gozo\nStarting time: 10.15am (Take the 9.45am ferry from Ċirkewwa)\nNote: This is a Saturday walk!\nWednesday, April 24 –Siġġiewi countryside (Scenic)\nA moderately hard walk along paths in the valleys surrounding the beautiful Siġġiewi countryside, in close touch with nature.\nDuration: About four hours\nRating: Moderate\nMeeting point: The Limestone Heritage, Siġġiewi bypass\nStarting time: 2pm\nSunday, April 28 – Chadwick Lakes and Binġemma Fort  (Cultural/Scenic)\nParticipants will walk along low lanes through Chadwick Lakes and up high paths behind the Victoria Lines to reach Binġemma Fort. There will be rough terrain and steep inclines but the views are worth the exercise.\nDuration: Three to four hours           \nRating: Moderate to hard, with rough terrain and inclines\nMeeting point: Busugrilla roundabout, Rabat\nStarting time: 9am\nEveryone is invited to join the walks but it is important that beginners choose an easy walk to start with and then decide on the harder walks. The Ramblers’ Association takes great care in picking the trail but every participant is free to walk or stop at his/her discretion and is solely responsible for his/her safety. For further information visit the websites below or call 9949 7080.\nhttp://www.ramblersmalta.org\nhttp://www.facebook.com/ramblersmalta\nAlex Vella is executive president of the Ramblers’ Association of Malta.", "comment_count": 1, "id": 3668}, {"keywords": "Gozo", "author": "", "article_body": "Wearing colourful socks was one way through which Down Syndrome Day was commemorated across the world. The Gozo Ministry, together with the Malta Rabbit Club, Emma Victoria Morgan and Abi Macleod Clark, marked the day with a special activity for schoolchildren, as well as Santa Marta Day Centre clients at the Gozo Sports Complex in Victoria.\n\nFor the activity, children wore odd socks in different colours symbolising diversity. Chromosomes are shaped like socks and people with Down Syndrome are born with an extra one.\nGozo Minister Justyne Caruana urged children to be more informed about Down Syndrome and to participate in activities to raise public awareness and create a single global voice for advocating for the rights, inclusion and  well-being of people with Down Syndrome. “We can truly live the spirit of inclusion where every child is given an equal opportunity,” the minister said.", "comment_count": 0, "id": 3669}, {"keywords": "Gozo", "author": "", "article_body": "The Rhythm to the Melody Line was a concert of Christian music by Fr Karm Debattista and Friends at the Don Bosco Oratory Theatre in Victoria. The concert was about the spiritual journey of Fr Karm. Each song reflected a particular passage in his life and reflected the struggle, the joy and the growth of his past 40 years. He wrote the songs to share this journey with the audience. The concert was in aid of the MSSP missions in Pakistan, Peru and the Philippines.", "comment_count": 0, "id": 3670}, {"keywords": "Gozo", "author": "", "article_body": "Feel the Magic of Brass kick-started Chorus Urbanus’s new cultural project featuring the BrassTubes Ensemble at Hotel Kempinski San Lawrenz. Under the direction of Mro Mark Gauci, the well-attended inaugural concert included works covering various genres of music by Gershwin, Bricusse, Bee Gees, Marilow and Weiss. BrassTubes were accompanied by their resident vocalist Sarah Bonnici. Mro Gauci (trombone) performed Blue Bossa and Autumn Leaves accompanied by the ensemble.\nThe evergreen John Lennon/Paul McCartney song Hey Jude brought the concert to a close.The next event is Feel the Magic of Piazzolla which will feature the Sicily ensemble from Trapani under the direction of Mro Franco Foderà. The ensemble will perform a number of Piazzolla’s famous tangos and Latin American music.\nThe concert will be held at Independence Square on May 4 as part of the Gozo Alive activities.", "comment_count": 0, "id": 3671}, {"keywords": "Gozo", "author": "", "article_body": "The monument in honour of sculptor  and statuarian Agostino Camilleri, known as Wistin, has been relocated to his hometown in Victoria on the initiative and collaboration of Gozo Minister Justyne Caruana, the Gozo Culture Committee and the Eco Gozo Directorate. The move also marks the 40th anniversary of Camilleri’s death in 1979.\nThe monument, the work of Alfred, one of Agostino’s sons, was originally located at the then Wistin Camilleri Centre for Arts and Crafts in Għajnsielem on December 18, 2009.\nAmong those present for the inauguration event were Gozo Minister Justyne Caruana, Unesco Permanent Ambassador Mgr Dr Joe Vella Gauci, director Eco Gozo Vicky Xuereb, Gozo Culture Committee chairman Frank Cassar and Agostino’s children Paul, Alfred, Catherine, Mario and Michael and their families.", "comment_count": 0, "id": 3672}, {"keywords": "Gozo", "author": "", "article_body": "• A blood donation session will be held at Xewkija District Health Centre today between 8am and 1pm.\n• The Way of the Cross will be held from Ta’ Pinu Sanctuary to Għammar Hill today at 3.30pm.\n• Spider-Man: Into the Spider-Verse (U) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n• The Mnarja and Precursor Bands will give a concert to mark Freedom Day today at Independence Square, Victoria, at 7.30pm.\n• Joseph and The Amazing Technicolor Dreamcoat will be staged at the Astra Theatre, Victoria, today, at 4pm.\n• Members of Il-Fergħa Ewkaristika (Gozo) will meet at Ta’ Pinu Sanctuary to celebrate Mass and for adoration of the Blessed Sacrament on Saturday at 3pm. All are welcome.\n• An Easter Sweet Fair is being organised at the Don Bosco Oratory Foyer on Saturday from 5pm and next Sunday from 8.30am.\n• L-Imsallab fi Triqatna will be held along the streets of Victoria on Saturday at 7.30pm.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 3673}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Any voluntary organisation – even if it has no income – has three months to enlist with the Commissioner for Voluntary Organisations or face a fine and other penalties.\nWhile the Commissioner’s office – or any other entity – could never be in a position to know how many organisations were not enrolled or registered, it was keeping a watchful eye, it has warned.\nPeople in different sectors of society formed informal groups all the time, and it was not necessary that they all did this as defined by the law, a spokesman for the office told the Times of Malta.\n“However, the office is on guard to monitor media and other sources, including but not limited to complaints to check and also investigate any people claiming to be organisations.”\nThe office was contacted after it urged organisations to enlist if their annual income was less than €5,000 or nothing at all, or enrol if it was more than €5,000.\nThe office is on guard to monitor media and other sources\nAny organisation that failed to do so by June 30 would be disqualified from benefiting under any grant, sponsorship, any other financial aid from the government or any policy supporting voluntary organisations or from being the beneficiary of any exemptions, privileges or other entitlements.\nAdditionally, administrators who failed to enrol an organisation or notify the commissioner of its existence could be slapped with a fine of at least €120 and an additional fine of €11.65 for every day that such default continues.\nThe spokesman told this newspaper that new law amendments had come into force in November, bringing about “a very important change” – the legal necessity for registration or enrolment of voluntary organisations.\nOrganisations are being given three months to enrol as the procedure included the formulating and provision of certain documentation, including a statute, administrator details and charts that the office believed would inevitably take some time.\nMore information on www.voluntaryorganisations.gov.mt", "comment_count": 13, "id": 3674}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two youngsters were each placed under probation after admitting to having stolen suitcases packed with clothes belonging to guests staying at a St Paul’s Bay hotel.\nIbrahim Micallef, a 19-year old St Paul’s Bay resident, was arrested and arraigned along his 16-year old partner in crime, a Polish teen also residing at the same locality.\nThe two pleaded guilty to the aggravated theft which took place on Thursday night from a room inside the three-star hotel.\nThe elder of the two was separately charged with having committed the crime during the operative period of a suspended sentence, as well as with being a recidivist.\nThe 16-year old also faced separate charges linking him to another theft, just over a fortnight ago, of some €3,000 from a car that had been parked on a St Paul’s Bay Street.\nThe youngster also admitted to this theft, which took place in the morning on March 11.\nDefence lawyers for the two accused pointed out that the two teenagers needed help and treatment to combat personal problems, a suggestion that was fully backed by the prosecution.\nAfter hearing submissions by both parties, the court, presided over by magistrate Donatella Frendo Dimech, declared the two accused guilty upon their own admission and placed them under a three-year probation order, as well as a three-year treatment order.\nIn respect of Mr Micallef, the court also extended the operative period of his previous suspended sentence.\nWhile strongly urging both youngsters to reform themselves, the court also pointed out that the items they had stolen had been earned through hard work by the lawful owners.\nInspector Spiridione Zammit prosecuted. Lawyers Franco Debono and Amadeus Cachia were counsel to Mr Micallef. Lawyer Lennox Vella was counsel to the minor.", "comment_count": 0, "id": 3675}, {"keywords": "", "author": "", "article_body": "President of Malta Marie-Louise Coleiro Preca was presented with the Public Life Award by the Hungarian Socialist Party in recognition of her \"promotion and  improvement of women’s rights and gender equality over Europe\".\nThe award was presented by Zita Gurmai, European Member of Parliament and President of the Women’s Section of the party. \nThe award was presented at the end of a conference organised by the Office of the President and the University of Malta with the theme ‘Gender Equity: A Human Rights Perspective’, organised as part of the series of events which the Office organised to mark the 70th anniversary of the United Nations Universal Declaration of Human Rights.\nThough there has been an improvement in Malta, women’s presence and representation in public life, and across all areas of decision-making needs to be strengthened, the President said.\nAreas of inequality, such as the gender pay gap, stand in the way of the attainment of full gender equality and equity.\nThe President said that having legislation in place is a very important step forward, however the right infrastructure is also needed for women to be truly encouraged to take their rightful place in society. Moreover, she called for effective protection from all types of abuse, such as domestic and sexual violence and femicide.\nPresident Coleiro Preca praised the initiative taken by the University of Malta and by Prof. Marceline Naudi when setting up the European Observatory on Femicide, which is working to provide essential data about the most lethal forms of violence against women in Europe.\n ", "comment_count": 5, "id": 3676}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "An evaluation report on the findings of a Council of Europe anti-corruption mission to Malta should be published in the coming days, the Times of Malta was told.\nA spokesman for the Prime Minister said the report was being reviewed by the Attorney General. The report was drawn up by Greco, the Group of States against Corruption.\n“The Greco evaluation was received in the past hours and, as per standard procedure, is being reviewed by the Attorney General’s office. The government will be consenting its publication, like it has always done, in the coming days once the process is finalised,” the spokesman said on Wednesday evening.\nThe report was approved during a meeting in Strasbourg last week when the government was “invited” to authorise its publication, as is normal procedure.\nRead: Anti-corruption body Greco to visit Malta a year early\nMalta has always published such reports and, according to political observers, it was very rare that a member state would refuse to release such reports.\nBeing reviewed by the Attorney General’s office\nAccording to Council of Europe sources, the report is likely to be very critical of the Maltese government and reflect the stand taken by international bodies on the state of Malta’s rule of law and the drop in ranking in Transparency International’s corruption perception index.\nDuring its recent visit to Malta earlier this year, Greco’s mission focused on corruption prevention measures by the central government, including the top executive, and the law enforcement agencies.\nThe last evaluation report by Greco on Malta, in 2014, had noted that handling interpersonal relationships and addressing real or potential conflicts of interest were clearly critical challenges.\nIt had called for the introduction of proper laws governing rules on gifts to MPs, misuse of public resources, misuse of confidential information, revolving doors and third party contracts.\nThe government last week announced plans to reform the office of the Attorney General and other institutions in the wake of the latest critical reports on the state of the rule of law in Malta, particularly by the Venice Commission and the European Commission.\nJustice Minister Owen Bonnici said the government wanted to change the way members of the judiciary were appointed, a point raised by the Venice Commission, among others, but he stopped short from giving a time frame.", "comment_count": 6, "id": 3677}, {"keywords": "", "author": "", "article_body": "A man was injured following an accident between a motorbike and a van in St Julian's on Saturday afternoon. \nThe extent of the injuries are not known. The van driver was not injured.\nThe incident happened on George Borg Olivier Street around 3.25pm, blocking traffic in the main artery for a period of time. \nPolice are investigating. ", "comment_count": 0, "id": 3678}, {"keywords": "", "author": "Claire Caruana", "article_body": "The company owned by Health Minister Chris Fearne’s chief of staff handles the “maintenance” of an IT system at Mater Dei Hospital, it has emerged.\nTimes of Malta reported recently there was pressure to approve the renewal of a lucrative IT contract at Mater Dei by a company owned by the husband of Carmen Sammut, Mr Fearne’s top aide.\nThe company, Cursor Ltd, has been supplying services to the hospital since 2013 and is registered at the same address as Mall Systems Ltd, another IT company owned by Ms Sammut. Both companies have been the recipients of a number of other government jobs.\nAfter she joined Mr Fearne’s secretariat last year, the Health Ministry had insisted with this newspaper that Ms Sammut had resigned from her post as director of the company but made no mention of the fact that she was still the sole shareholder.\nWhile Cursor Ltd operates the patient administration system, known as CPAS, Ms Sammut’s company is responsible for its maintenance.\nThe information on the two IT companies was supplied in parliament this week by Mr Fearne in reply to a parliamentary question tabled by Nationalist MP Simon Busuttil. The former Opposition leader also asked for the amounts paid to both Cursor Ltd and Mall Systems Ltd but the minister said such information was of a “commercial nature”.\nAsked whether this was a case of conflict of interest, a Health Ministry spokeswoman reiterated that Ms Sammut had resigned from her post as director of Mall Systems Ltd. This, she insisted, had occurred “prior to her engagement with the Office of the Deputy Prime Minister”.\n“Ms Sammut currently holds no post with this company. Similarly, she initiated a share transfer procedure prior to her engagement at the ministry,” the spokeswoman told Times of Malta.\nAccording to the companies’ registry, Ms Sammut is still listed as the sole shareholder of Mall Systems Ltd. Although company documents confirm she had stepped down as director, there are no documents indicating that the shares had been transferred.\nNo reply was forthcoming from the Health Ministry when this newspaper asked about this matter.\nMr Fearne has defended the appointment of Ms Sammut as chief of staff insisting she was not directly involved in the IT business.", "comment_count": 12, "id": 3679}, {"keywords": "", "author": "", "article_body": "Malta will be marking the 40th anniversary of Freedom Day under the rule of speculators exploiting the country for the benefit of the few, a group of activists charged on Saturday.\nGraffitti issued a statement on the third day of its camp 'Assedju PA' where activists are symbolically staging a \"siege\" outside the Planning Authority premises in Floriana.\n\"The PA is putting our country under siege with unbridled development, which is ruining our quality of life and compromising our future on this island,\" the NGO said.\nFor decades, the business class has accumulated power of a disproportionate nature, with the result that politics ended up becoming a slave to the interests of this class, Graffitti said.\nRead: Demonstrators confront minister, demand stop to fuel stations\nThe fuel station policy is a clear example of all this. Although it was the same authorities which admitted that this policy is doing a great deal of harm since it permits 3,000m² petrol stations on natural and agricultural outside development zone land, it has remained unchanged.\nAt present that are 14 applications for petrol stations on ODZ land, with four of them already approved, and others which are still being processed. Together, these make up a total stretch of land five time the size of the Floriana granaries.\nThe petrol station policy is symptomatic of a much bigger and profound problem.\nThe list of \"senseless and harmful development projects\" which have been approved is endless.\n\"It is crucial for the people to fight with all their might against this rule by big business and their politician friends, which is ravaging our countryside and bulldozing over the interests of the majority. We hope to see the day when we will be able to celebrate our freedom from the rule of speculators.\"", "comment_count": 6, "id": 3680}, {"keywords": "", "author": "Claire Caruana", "article_body": "The storm that wreaked havoc at the end of last month has resulted in insurance claims of more than €8.6 million, Times of Malta is informed.\nDescribed as the most devastating since 1982, the storm that battered the islands during the last weekend of February caused damage everywhere, with insurers receiving claims for destroyed buildings, both private and commercial, as well as motor vehicles, boats and yachts.\nMalta Insurance Association director general Adrian Galea said the value of claims for private property and household policies topped €3.6 million while those for damages to commercial properties rose to €3.3 million.\nRead: 'Worst storm since 1982' saw record gusts of 133km/h \nClaims for damages sustained by motor vehicles and pleasure crafts (boats and yachts) amounted to a further €1.5 million.\nThe storm damaged several outlets.\n“In comparison to the severe hail storms which took place in 2013 and 2015 and which had a significant impact on motor vehicles, February’s storm caused a great deal of damage to property, which includes both private and commercial,” Mr Galea said.\nOn the number of claims received, the insurance association head said these amounted to just under 2,000 and while most of them were still subject to further checks, eight per cent had already been settled.\n“This is the highest ever value of claims that the local insurance industry has ever received and arising directly out of one, severely adverse weather event.  \n“The intensity of this storm underlines the importance of protecting one’s own property against unexpected perils through insurance and the importance of regular maintenance of buildings,” Mr Galea added.\nFollowing the storm, the government had said that it was urgently carrying out an assessment to quantify the damage and would seek funds from the EU, if eligible.\nMalta tapped into the fund in 2004, when it received over €960,000 to help deal with floods in September 2003.\nAccording to Transport Minister Ian Borg, the damage to the island’s roads caused by the heavy storm amounted to €118,500.\nRead: Malta to ask for ‘millions’ from EU fund to cover storm damage\nDuring the storm, which lasted about 48 hours, the Civil Protection Department received and assisted in 486 calls. In some cases it had to be backed by the police and the army.\nThere were 14 people who were evacuated in Sliema and 12 from two localities in Vittoriosa. In the days that followed, the authorities collected more than 180 tons of debris from the streets.\nMost of this work was concentrated on Xemxija, Spinola, Balluta and Ta’ Xbiex promenade.\nSeveral trees were uprooted.", "comment_count": 2, "id": 3681}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Neighbours were stunned to wake up to news of the Gudja double murder, struggling to reconcile the image of the family they knew with the events that unfolded.Victim Angele Bonnici.\nMarija Lourdes Bonnici and her daughter Angele Bonnici had last been seen at their home in Għaxaq on Tuesday and been reported to the police as missing on Wednesday.\nRead: Mother and daughter found shot and partially buried in Gudja\nPolice found the bodies of the two women in the early hours of Saturday morning.\nThe son, who is in his late 30s and who worked at a fuel station nearby is believed to be in police custody.\nYou would never imagine something like this here at all, let alone it happening again\nThe Bonnicis' home, watched over by police on Saturday morning, is at the end of a sleepy street leading to the Għaxaq village square, with members of their extended family living door by door.\nIn the only bar along the road, residents recalled the family in very positive terms as friendly and outgoing, including the son, now the prime suspect.\n\"We are all stunned. I can't imagine what could have led to this. He seemed like a good man; then so did his father,\" one man told Times of Malta.\nA woman living a few doors down also found herself at a loss to explain what had happened.\n\"You would never imagine something like this here at all, let alone it happening again,\" she said.\n\"It's shocking. They were all good people. But you never know what's going on behind closed doors\nIn 2005, Marija Lourdes's husband Paul had been jailed for 31 years for having shot and killed a couple who lived next door to them in Għaxaq.", "comment_count": 0, "id": 3682}, {"keywords": "", "author": "", "article_body": "Malta and Italy have agreed to carry out more \"intense and systematic consultation\" to coordinate the respective foreign policy positions related to the management of migratory flows. \nThe two countries will also undertake joint initiatives in negotiations on the multi-annual financial framework for the period 2021-2027, to ensure greater allocations for more incisive action in the cooperation and development of the countries of origin and transit of migration flows.\nIn a statement through the Department of Information, the government said the agreement follows up on a recent meeting in Rome between Italian Foreign Affairs minister Enzo Moavero Milanesi and his Maltese counterpart Carmelo Abela. \nIn a break from past cooperation, Italy and Malta have been at loggerheads over the issue of migration flows between north Africa and Europe.\nItaly's right-wing  deputy prime minister Matteo Salvini has often accused Malta of shirking its responsibilities while both countries have closed their ports to NGO rescue vessels. ", "comment_count": 4, "id": 3683}, {"keywords": "", "author": "", "article_body": "Presidential nominee George Vella has resigned as honorary delegate and member of the Labour Party. \nIn a statement, the PL said Dr Vella and his wife submitted their resignation for \"correctness sake\" after the prime minister's nomination was made public. \nLabour's national executive thanked Dr Vella and wished him luck in his new role. \nThe former PL deputy leader and Foreign Affairs Minister will take over the presidency from Marie-Louise Coleiro Preca next week. \nHe will be Malta's 10th President of the Republic. ", "comment_count": 5, "id": 3684}, {"keywords": "", "author": "", "article_body": "Malta’s property market is relatively small – and yet, the variety boasts so many layers. From noble dwellings to hidden country idylls and modern lifestyle developments, the market is constantly unveiling hidden gems.  \n\nThe Perry Magazine, out with this week’s The Sunday Times of Malta, is celebrating its 58th edition – and 20th anniversary – in style. But it’s not just style – there is also plenty of substance, starting from the publication’s cover.\nSince its first edition, the cover of the Perry Magazine has always showcased a beautiful work of art.\nWorks by artists such as the 1920s Italian painter Edigio Tonti to the contemporary Paul Carbonaro and the Russian sculptor Boris Edwards have graced the cover.\nThe 58th edition proposes a Gozo landscape by famous cartoonist Henry Mayo Bateman, who spent his twilight years at the Royal Lady Hotel in Għajnsielem, overlooking the quaint harbour of Mġarr.\nThe Perry Magazine has established itself as a leading authority in the Maltese real estate market, sought after for its original content and inspiring presentation of the islands’ best quality properties.\nBut not only – this 58th edition explores the up and coming property market in Floriana, highlights a historic Mdina palazzo and proposes the right property for various budgets.\nThe Perry Magazine is published by Allied Newspapers in collaboration with Perry Estate Agents. It is distributed for free with The Sunday Times of Malta, from all Perry branches and from key locations including the arrivals lounge at Malta International Airport.\nFor more information visit www.perry.com.mt.", "comment_count": 1, "id": 3685}, {"keywords": "", "author": "Keith Micallef", "article_body": "Motorists caught on camera committing a parking offence can no longer try to escape punishment by challenging the legality of such evidence, following recent amendments to the traffic regulations.\nA legal notice published recently by the Transport Ministry lays down that  “photographs, film, video recordings, electronic images or any other record produced by a prescribed parking monitoring device shall be admissible in evidence and shall constitute proof of their contents”.\nA Transport Malta spokesman told the Times of Malta that Motor Vehicles Regulations had been amended to bring the law in line with advances in digital technology and digital data transfer.\n“The changes are mostly technical, to avoid potential loopholes,” he added, noting that the amendments would reduce the possibility of the legality of video evidence being challenged in court.\nAlthough photo and video evidence has been used against parking offenders in the past, its admissibility was not explicitly cited in the law, making it a legal grey area. \nRead: Illegal parking left off list of penalty point offences\nThe spokesman noted that the amendments were enacted in consultation with the Local Enforcement System Agency and the Justice Ministry.\nChanges are mostly technical\nThe legal notice specifies that its provisions apply to “parking monitoring devices” as prescribed by order of the Transport Minister, who may in any such order lay down conditions as to the purposes for which the device is to be used.\nFurthermore, in the eyes of the law, liability will rest with the owner of the vehicle unless proven otherwise.\nIn the latter case, the same legal notice (LN48 of 2019) says that the owner shall be held responsible “unless the driver of the vehicle when the offence was committed is shown to have been stopped and identified by a police officer or a community officer upon or immediately after the commission of the offence”.", "comment_count": 44, "id": 3686}, {"keywords": "", "author": "", "article_body": "Nurse lobbyist Paul Pace has returned as president of the Malta Union of Midwives and Nurses, four years after he quit the post in 2015.\nSixty-eight per cent of MUMN members cast their vote in the election, voting for 10 new council members. \nThose 10 members then held their first council meeting on Saturday, with four elected as council officials, among them Mr Pace as president. \nMr Pace replaces Maria Cutajar, who chose not to recontest.\nMr Pace has for the past years served as an adviser to the Health Ministry. In a statement announcing its new council, the MUMN said that Mr Pace has written to the CEO of the Foundation of Medical Services to resign that post “with immediate effect”.\n It is Mr Pace’s second stint as MUMN president. He led the union for nine years before quitting in 2015 after placing eighth in council elections that year.\n“Although elected, it is clear that I have lost the support of the members of the Council,” he had said on that occasion.  \n“I can assure you that I never hid behind anyone and always tried my best.”\nMr Pace will lead a new council made up of the following members:\nSecretary general – Colin Galea\nVice-president – Alex Manche’\nTreasurer – George Saliba\nAssistant secretary general – Joseph Aquilina\nAlex Lautier, Geoffrey Axiaq, William Grech, Simon Aquilina and Claire Zerafa will serve as council members.", "comment_count": 7, "id": 3687}, {"keywords": "", "author": "", "article_body": "MEP Miriam Dalli has added her voice to calls for Joseph Muscat to stay put as Prime Minister, telling a gathering in Żurrieq that “Malta and the Labour Party need him”.\n“Together with soldiers of steel, Dom Mintoff ensured a solid base for our country.  Today, 40 years later, let us continue to build on this legacy,” she told the crowd. \n\"Let us send a clear message to Prime Minister Joseph Muscat that Malta and the Labour Party need him.”\nDr Dalli was speaking at an activity ahead of May’s European Parliament elections.\nThe MEP has been touted as potential successor to Dr Muscat, who has said on more than one occasion that he intends to step aside before the end of the legislature.\nDr Dalli used the bulk of her speaking time to focus on the ways in which Malta’s education system could get better.\n“We need to continue building on the good that already exists,” she said, emphasising the importance of inclusive programmes that were tailor-made to students’ needs and which prepared them for the industries of tomorrow, such as blockchain and artificial intelligence.\nDr Dalli has worked with the Autism Parents Association to make the University of Malta more inclusive, allowing students with different learning abilities to continue their education at tertiary level.\nThe activity was also addressed by Justice Minister Owen Bonnici, Parliamentary Secretary Julia Farrugia Portelli and MP Stefan Zrinzo Azzopardi, amongst others. \nDr Zrinzo Azzopardi announced that, based on an initiative with Dr Dalli, work was under way to see how to eliminate discrimination in the insurance sector against people with a disability.\n“There are persons finding closed doors when trying to seek certain services from financial services institutions. There are realities in the insurance sector that don’t allow persons with disability to acquire certain products. We are now studying what solutions could be offered,” he said.", "comment_count": 23, "id": 3688}, {"keywords": "", "author": "", "article_body": "Updated at 10.56am with video \nThree people have been charged with terrorist activity after taking over a commercial vessel earlier this week, in a case which made headlines across the world.\nThe accused, teenagers aged 15, 16 and 19, appeared in court on Saturday morning to face charges connected to the seizure of the El Hiblu 1.\nAll were accused of having seized control of the ship through the use or threat of force and intimidation. They pleaded not guilty to the charge and requested bail.\nUnder Malta's criminal code, unlawfully seizing control of ship is considered a \"terrorist activity.\" If found guilty, they face between seven and 30 years behind bars.\nMagistrate Donatella Frendo Dimech denied the bail request, noting that civilian witnesses had yet to testify and that the accused had no ties or means of paying a bail bond.\nShe ordered that the two minor suspects be entrusted to state care and everything done to ensure their safety and well-being. The court ordered a publication ban on the names of the minors who stand accused of the crime. \nThe 15- and 19-year-old suspects are from Guinea, with the 16-year-old a national of Ivory Coast. \nOmar Zammit and Christa Armeni prosecuted. Cedric Mifsud, Gianluca Cappitta and Neil Falzon served as counsel for the defence.  \nDuring the hearing, Dr Falzon protested that the minors he was defending had been brought to court through the building's main entrance - in full view of the public - and not from its rear entrance as was customary for minor suspects. \nFollowing a heated discussion, police officers uncuffed the accused before escorting them out of the rear of the law court building. \nA saga at sea\nFive people had been handcuffed and arrested on Wednesday morning within minutes of the El Hiblu 1 docking in Marsa.\nThe captain and crew of the El Hiblu 1 had rescued migrants stranded at sea and was taking them back to Tripoli when it suddenly veered north, towards Malta.\nOne of the five being escorted away by police after the ship docked in Malta. Photo: Jonathan Borg \nMalta’s Armed Forces had said they were keeping tabs on the “pirated ship” and subsequently stormed the El Hiblu 1 when it was close to Maltese waters, after they made contact with the ship’s captain and were told that he was not in control of the ship.\nPolice sources had subsequently expressed doubts about the captain’s version of events, saying they could not rule out that the captain had claimed he was not in control of the vessel so as to be granted permission to enter Malta.\nTimes of Malta reported on Friday that a group of the migrants threatened to jump overboard if they were taken back to Libya.\nThe El Hiblu 1 was brought to port on Wednesday. Photo: Jonathan Borg", "comment_count": 0, "id": 3689}, {"keywords": "", "author": "Claire Caruana", "article_body": "A number of educators who signed up for a 10-day crash course to obtain skills needed to teach 13 new applied subjects come September dropped out half-way through, according to the teachers’ union.\nMalta Union of Teachers president Marco Bonnici said some of the teachers who had initially expressed an interest in the new applied subjects had decided not to complete the crash course.\nIn a major shift of the education system away from a purely academic approach, students at state schools struggling with traditional teaching methods will be able to take subjects focusing on hands-on learning when the new academic year starts.\nThe Malta Union of Teachers has already warned there might not be enough educators to cater for all the new subjects. Education Ministry officials have repeatedly dismissed such concerns, telling Times of Malta last month about 60 teachers in possession of a teaching warrant would undergo a 10-day training course to make the shift to the applied subjects.\nTeachers felt the system was not yet adequately prepared for the changes\nMr Bonnici said he did not yet have the exact number of the teachers who had dropped out but could say that “a good number” had approached the union saying they had decided not to complete the training. The teachers felt the system was not yet adequately prepared for the changes, he remarked.\nMinistry denies the MUT's claims\nHowever, a ministry spokeswoman insisted the union’s claims were “not true”. “In fact,” she added, “62 persons attended and concluded the 10-day course.”\nThe government is adamant to introduce the new subjects “come what may”. However, Mr Bonnici said that, as per the agreement with the union, educators could not be forced to take up a subject that was not the same as the one they had been originally engaged to teach.\nHe was commenting at the end of a press conference called by the union to report that the teaching profession was in crisis and that the government was not doing enough to address mounting concerns.\nMr Bonnici said the situation was a result of developments in recent years, such as the drastic increase in the number of students in schools due to the influx of foreigners, the changes in students’ abilities, the introduction of new subjects and reforms introduced by the government that required more educators.\nHe insisted that while other areas were being heavily promoted to ensure that students opted for certain careers, the same could not be said for teaching. On the rare occasion that a campaign to attract students to teaching courses had been launched, this was half-baked and lacking effort, Mr Bonnici complained.", "comment_count": 15, "id": 3690}, {"keywords": "", "author": "", "article_body": "An Attard man was hospitalised on Friday night after he was grievously injured in a car crash in Mosta.\nThe man, 64, was driving a BMW 730D when he was involved in a collision with a 20-year-old man from Swieqi driving an Opel Astra while on Triq il-Kungress Ewkaristiku. \nHe was taken to Mater Dei Hospital by ambulance. The Opel driver and a 63-year-old woman in the passenger seat of the BMW were not hurt in the incident, which was reported at around 9.30pm. \nThe police are investigating further. ", "comment_count": 0, "id": 3691}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Saturday.\nThe Times of Malta reports that damage claims from February’s major storm reached €8.6 million, a new record.\nThe newspaper also writes that the captain of a ship which was reportedly hijacked by migrants he had rescued could end up facing trafficking charges, with investigators not convinced by his version of events.\nThe Malta Independent reports that the captain of the hijacked ship feared for his life as he brought migrants to Malta.\nThe newspaper also reports that a revised fuel station policy will be out for consultation in April.  \nL-Orizzont quotes General Workers Union boss Josef Bugeja as saying employment laws must be periodically reviewed to ensure they are updated.\nIn-Nazzjon highlights a court ruling which found that an appeal against the Vitals hospital contract can go ahead, with the newspaper calling it a victory for Adrian Delia and the people.\nThe newspaper also gives prominence to NSO figures showing a €70 million deficit in public finances.", "comment_count": 0, "id": 3692}, {"keywords": "", "author": "Denise Grech ", "article_body": "The captain of a vessel escorted to Malta earlier this week with 100 migrants on board risks facing charges related to human smuggling, sources close to the police have said.\nThe police and inquiring magistrate are investigating the possibility that the skipper could have “misled” the authorities by claiming he lost control of the vessel after rescuing the migrants off Libya, the sources added.\nInvestigators are not ruling out that he could have reported such a situation over the radio to be allowed to enter Maltese waters. The first arraignments related to the case are expected on Saturday.\nAccording to official accounts over the past days, the captain had claimed migrants aboard the ship had taken control of the El Hiblu 1, without violence. This led Maltese authorities to believe it was hijacked and, in fact, a spokeswoman for the Armed Forces of Malta had at one point described the vessel as a “pirated ship”.\nIt would be the magistrate who would decide whether enough evidence existed to arraign the captain, the sources said, adding this decision would have to be taken on Saturday.\nThe police are still in the process of piecing together what actually happened on the vessel before armed Maltese soldiers went on board.\nMaltese authorities managed to communicate with the captain on Wednesday night, when the vessel was about 30 nautical miles from Malta.\nMalta's Armed Forces subsequently boarded the ship and brought it to port. Five of the migrants were arrested. \nA Libyan official was on Friday quoted by Associated Press as saying that the migrants had used metal tools to threaten the crew, forcing them to head towards Europe.\n“When the sun rose and the migrants realised they are returning to Libya, some of them rebelled and used workshop metal tools in threatening the crew to change the route and head north,” a spokesman for the Libyan coast guard said.\nPolice officers told the Times of Malta no weapons were found on the ship.\nIn an interview on Friday, the captain told the NGO Lifeline he refused to go to Tripoli after the rescued migrants caused panic and confusion when they realised where the ship was headed.\nAFM released video of their mission to take control of the ship. Video: AFM\nHe said the migrants threatened to “break” the ship unless he changed course to Malta. There were just six crew members and almost 100 rescued migrants, the captain pointed out.\nFaced with such a tough situation and feeling he no longer had control of the ship, the captain said he decided to head north.\nHe also claimed that the Maltese authorities had initially denied the ship permission to head to Malta, to which he reacted: “I can’t do it. The ship [is] under pirates.”\nMigrants face an uncertain future\nMigrants who were on the ship, many of whom are from Nigeria, Burkina Faso and Senegal, face an uncertain future. The youngest child on the vessel was just six months old.\nThe migrants, including a pregnant woman and 47 people “claiming to be minors”, as the government put it, are being held at the initial reception centre, in Marsa.\nA spokeswoman for the Office of the Prime Minister said any decision about their future would have to await the conclusions of the pending magisterial inquiry.", "comment_count": 0, "id": 3693}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A Ġużè Damato townhouse in Victoria might have been spared demolition in 2016 but remains exposed to the elements and is crumbling before the residents’ eyes.\nThe townhouse, designed by the renowned architect and civil engineer behind the Xewkija and Paola parish churches, sits on Triq il-Kastell, just outside the Citadel.\nIt was built in the early 1950s by Manwel Magro and sold to the Cathedral Chapter in 2003. The Gozo Ministry recently filed a planning application to demolish the structure and instead build a three-storey car park and a pedestrian walkway to the Citadel. This was followed by a public outcry though the application is still being assessed by the Planning Authority.\n\nPhotographer Daniel Cilia, who three years ago was “shocked” to stumble upon the planning authority notice saying the house was being demolished, is now warning that the house has been left open to the elements.\n“Windows have been left open with the wind wreaking havoc inside the house. Part of the beautiful parapet wall on the roof has just collapsed, most probably during the last big storm.\nThe Church would like to let the media exposure on the property subside\n“Is the Gozo Cathedral Chapter ‘praying’ nature would demolish the house so they can go back to their parking lot plans,” he asked on Facebook. He noted that when a buyer expressed his wish to restore it, the Chapter had said they wanted to restore it themselves.\nIt was disgraceful that nothing seemed to have been done and the house was now falling to pieces, Mr Cilia added.\n\nAnother photographer, Charles Paul Azzopardi, “seconded” Mr Cilia, noting that when he approached the Chapter to document its architecture he was “blatantly told the Church would like to let the media exposure on the property subside so that the property can be ‘discreetly’ demolished”.\nSpeaking on behalf of the Chapter, architect Joseph Bugeja had said in 2016 that the cathedral, located as it was on a hill, needed to facilitate access by the faithful.\nThe needs of the cathedral outweighed retaining the house in its present state, he had noted, adding that improved access to the cathedral was one of the points in the 2010 Citadel master plan and the area was earmarked for parking. That was why it was the Gozo Ministry that applied for the car park permit.\nMr Bugeja had said the house facade would be retained but the interior would be demolished.\nQuestions sent to the Gozo Diocese and the Cathedral Chapter on any conservation or restoration plans for the house remained unanswered at the time of writing.", "comment_count": 25, "id": 3694}, {"keywords": "", "author": "", "article_body": "Updated 7.45pm \nA mother and her daughter were found shot dead and partially buried in a field off Gudja on Saturday morning. Angele Bonnici.\nThe older woman's son has been arrested and is the prime suspect, police sources told Times of Malta. \nMarija Lourdes Bonnici, 70, and her daughter Angele Bonnici, 29, had last been seen at their home in Għaxaq on Tuesday and been reported to the police as missing on Wednesday. \nPolice found the bodies of the two women in the early hours of Saturday morning after questioning several people about their disappearance. \nSources said a 39-year-old man is expected to be charged with killing his mother and sister.\nInvestigators led a search of a rural area between Gudja and Santa Luċija and eventually found the two partially buried under soil. \nPolice are still trying to establish the dynamic of what happened. From the volume of blood found on site, they have established the victims were likely not killed on the spot.\nInvestigators are still trying to establish where they were killed and how they were transported to the site. They have carried out a gunshot residue test on the suspect and are waiting for other forensic tests.\nHowever, according to TVM, the suspect killed his mother and sister at home with a shotgun before transporting them to the field. \nUntil Saturday evening, the police were looking for a mallet used during the murder as well as a tow cart which is believed to have been used to transport the corpses. \nA possible motive has not yet been established and police are looking into the suspect’s psychological state.\nMagistrate Caroline Farrugia Frendo is leading an inquiry into the case. \nA history of violence\nPolice sources noted that the horrific incident marks another violent chapter in the family's history. \nIn 2005, Marija Lourdes's husband Paul had been jailed for 31 years for having shot and killed a couple who lived next door to them in Għaxaq. \nThe neighbours would regularly argue and things came to a head in May 2000, when Mr Bonnici shot Joseph and Carmela Dalli outside their home. He then reloaded the gun and shot the two at point-blank range in the head, the court was told during his trial. \nWhen police went to the house next door, they found Mr Bonnici waiting. A shotgun containing two spent cartridges was lying on a table at the entrance of the house. \nMr Bonnici pleaded guilty to the double murder.\nPolice and forensics experts combed through the area where the bodies were found. Video: Mark Zammit Cordina", "comment_count": 0, "id": 3695}, {"keywords": "", "author": "", "article_body": "Malta has the fourth lowest rate of waste collection of electronic appliances and equipment, according to EU statistics.\nA total of 3.9 kilograms of waste per Maltese inhabitant was collected in 2016, a far cry from the European average of almost nine kilos collected per person.\nRomania collected the lowest amount of electronic waste, at 1.6 kilograms per person, followed by Latvia (2.5 kilos per inhabitant) and Cyprus (3.5 kilos per inhabitant).\nElectrical and electronic equipment, commonly referred to as EEE, consists of any type of equipment that depends on, measures, generates or transfers electricity. In Malta, over 12,000 tonnes of electrical and electronic equipment are placed on the market every year.\nElectrical electronic equipment waste could cause major environmental and health problems if not properly managed, Eurostat said.\nThe data shed light on the different performance levels of existing waste collection schemes and the levels of consumption of electrical and electronic goods, the EU statistics body added. The figures are way away from the target of collecting 50 per cent of what is put on the market each year. Malta has set an ambitious target of collecting 65 per cent by 2021.\nEditorial: Overflowing civic amenity sites\nIt remains to be seen whether the government has planned enough space to dump the electronic waste.\nThe Times of Malta has just reported that the government was using a large site hosting tarmac batching plants as a storage facility for electronic waste. A €1 million contract was awarded to Bitmac Ltd without a call for tenders to store electronic waste deposited at civic amenity sites.\nMore than half (55.6 per cent) of the total electric and electronic equipment waste collected in Europe in 2016 was attributable to large household appliances. This was followed by IT and telecommunications equipment (14.8 per cent), consumer equipment/photovoltaic panels (13.5 per cent) and small household appliances (nine per cent). The remaining 7.2 per cent included electric tools, lighting, toys and sports equipment. Under current regulations, importers and producers need to register electronic items put on the local market, giving specific details on quantities, categories and brands.", "comment_count": 2, "id": 3696}, {"keywords": "", "author": "", "article_body": "A man was stabbed in a Ħamrun alley on Friday afternoon, in a fight police believe involved three people. \nThe 30-year-old, who lives in the town, was one of two men injured in the fight in Sqaq il-Kubrit. \nThe other injured person, a 29-year-old who also lives in Ħamrun, was hurt in his leg. \nA third man believed to have been fighting the two fled before police officers reached the scene. The fight was reported at around 3.30pm. \nBoth men were taken to Mater Dei Hospital for treatment. No information about their medical condition was available at the time of writing. ", "comment_count": 0, "id": 3697}, {"keywords": "", "author": "", "article_body": "A playground in the heart of Sliema will be demolished to make way for a three-storey car park, the Planning Authority said on Friday.\nA new overlying playground will be built in line with the street adjacent to the 17th Century De Redin coastal tower, better known as it-Torri. \n\"The new parking facility will decrease the burden of cars within the area while provide new high quality recreational facilities for the family at street and promenade level,\" the Planning Authority noted.\nPlans for the car park had already been revised to remove any visual clutter and impact on the historic it-Torri, it added.\nWorks will be carried out within the buffer zone of the Grade 1 scheduled tower and battery.\nThe location of the restrooms were relocated from the buffer zone of the historical tower following consultation with the Superintendence of Cultural Heritage.\nThe planning application had been submitted by the Sliema local council over two years ago. ", "comment_count": 47, "id": 3698}, {"keywords": "", "author": "", "article_body": "Tens of thousands of counterfeit running shoes, toiletries and footballs were seized at the Malta Freeport over the past weeks, the Customs department said on Friday.\nFour separate containers were found to be carrying counterfeit goods ranging from shoes to toothpaste, shampoo and footballs.\nOfficials from Customs’ container monitoring unit, intellectual property rights unit and iscanning team worked together to identify and confirm the finds.\nThe four containers were found to contain, respectively:\n- 19,484 pairs of counterfeit running shoes - 24,912 tubes of toothpaste, 23,184 roll-on deodorants and 35,784 bottles of hair tonic, all counterfeit- 94,668 bottles of counterfeit shampoo - 7,476 fake footballs\nLegal representatives of the items’ various right holders were contacted and confirmed that the seized items were fakes, Customs said.\nThe companies are now expected to file charges in civil court against the companies responsible.", "comment_count": 0, "id": 3699}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 5.45pm with video\nBuilding a metro in Malta should only be considered if it makes economic sense, the European Commissioner for Transport Violeta Bulc said.\nAddressing a press conference on Friday afternoon, Ms Bulc said that while the government had informed her that feasibility studies had yet to be conducted, she was aware of the debate on building a metro on the island.\nWhile the EU was in favour of mass modes of transport, economic factors as well as technological ones needed to be taken into consideration when planning such upgrades.\nThe final decision however, Ms Bulc said, would be in the hands of the government which would decide whether to forge ahead with such plans.\nRead: Malta metro 'only feasible in Sliema, unless we grow' - Muscat\nRead: Valletta to Gozo in 30 minutes: what a metro in Malta could look like\nMs Bulc was in Malta as part of a day trip to visit the island’s infrastructural projects, notably those that were being funded by the EU.\nShe addressed the press conference together with Environment Commissioner Karmenu Vella as well as Transport Minister Ian Borg and EU Funds Minister Helena Dalli.\nMs Bulc described her visit as a fruitful one, citing the Marsa junction project as one which was going “pretty well”.\n\"I have full confidence that it will be ready within the projected two and a half years,\" Ms Bulc said.\nDuring her meeting with the Prime Minister earlier in the day, Ms Bulc said new and emerging technologies were discussed, during which “clear commitment” was shown for Malta's transportation systems restructuring.", "comment_count": 30, "id": 3700}, {"keywords": "", "author": "Denise Grech ", "article_body": "Updated at 6.20pm\nThe captain of the El Hiblu 1, which docked in Malta Thursday, has claimed that Maltese authorities initially denied the ship permission to head to Malta and told him to head to Libya instead. \nMaltese soldiers stormed the El Hiblu 1 early on Wednesday morning as it approached Maltese waters. The captain reportedly told the AFM that a group of migrants he had rescued had taken control of the ship. \nSpeaking to NGO Lifeline, whose ship is docked close to the El Hiblu 1, the captain on Friday described a panic-stricken group of 100 rescued individuals who realised they were heading to Libya. \nThe migrants said they would \"break all the ship\" if the captain went on with his course to Tripoli. Associated Press on Friday reported that the rescued migrants had threatened the captain and his crew \"using metal workshop tools\". \n'You cannot proceed to Malta'\nThe captain said that he contacted Maltese authorities only to be informed he did not have permission to proceed to Malta. \nHe alleged that the AFM control centre prefaced its denial with a reference to his ethnicity. \n\"You're Arabic,\" he claimed local authorities told him. \"You cannot proceed to Malta\". \nHe said he replied, \"I can’t do it. The ship [is] under pirates.\" \nMalta's Armed Forces released video of the operation to take control of the El Hiblu 1. Video: AFM\n\"Also, we were six members of the crew. They were 98,\" the Turkish man told Lifeline. \nIn his conversation with Lifeline, the captain initially said he did not have enough provision to head back to Tripoli. He later said the ship has enough food for one week. \nThe El Hiblu 1 docked in Senglea Thursday morning. A pregnant woman and 47 people \"claiming to be minors\" were among the people on board.\nFive men were arrested upon disembarkation in relation to the suspected ship hijack.\nA spokeswoman for the Office of the Prime Minister said the people aboard the ship included people from Nigeria, Burkina Faso and Senegal. The youngest migrant on board the ship is six months old, she said. ", "comment_count": 0, "id": 3701}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 4.30pm\nA controversial fuel stations policy will finally be released for public consultation next month, Infrastructure Minister Ian Borg said on Friday as he was confronted by a group of demonstrators who marched to his ministry. Dr Borg, who was flanked by Environment Minister Jose Herrera and Planning Parliamentary Secretary Chris Agius, told the demonstrators that they had not agreed with some points of the original policy which allows fuel stations in urban areas to be relocated outside the development zone and take up some 3,000 meters of green land. The protestors, led by Graffitti spokesman Andre Callus, lambasted the three politicians for having dragged their feet when it came to amending the policy. Amid cries of “bureaucracy when it suits you”, the demonstrators said Maltese society was judging them, as quality of life continued to dip because of excessive development. Retorting, Dr Borg said when people looked back at the history books, they would know that he and his two Cabinet colleagues had been the ones to change the contentious policy.\nAnger at minister\nThe group of activists, led by Graffitti, on Thursday set up tents outside the Planning Authority's main office in Floriana and pledged to camp there in protest until at least Sunday, in a symbolic siege against planners' reluctance to stop overdevelopment.\nThe demonstrators are angry that a promised fuel stations policy revision, which has been on the cards for more than a year, has not yet been published.\nIn the letter to Dr Borg, they lament about the way the island had become besieged with senseless development, in particular the development of massive fuel stations.\nThis controversial policy, the protestors said, has not been amended because of big interests that pressured planners and policy makers.\n“Our principle point is that in such an over-developed country, the mushrooming of fuel pumping stations is threatening our future,” Grafffitti spokesman Andre Callus said.\n'When people look back, they will see that we three changed this policy,' the minister told protesters. Video: Chris Sant Fournier\nHe later added that future generations would judge politicians that failed to act today.\nRead: Support for Graffitti action against 'utter incompetence'\nIf a ounce of decency remained, the revision of the policy would be published immediately, he said.\nThe group of about 25 have set up tents outside the PA driveway, holding banners, chanting and banging drums.\nThe authority barred the gate and PA security officials have been keeping an eye on activists from the other side of the gate.\nSpeaking to the activists, Dr Borg said that the revised policy will be out for public consultation by end of April.\nProtestors said the revision had taken too long.", "comment_count": 56, "id": 3702}, {"keywords": "", "author": "", "article_body": "Updated at 5.25pm\nA car overturned on Triq il-Mosta in Lija on Friday afternoon, sparking emergency services into action and causing significant traffic on the main thoroughfare.\nThe Toyota Tercel, which was being driven by a 19-year-old man from Lija, ended up flipped over on the opposite lane in a crash which involved four other cars. \nThe young man was rushed to Mater Dei Hospital by ambulance. The drivers of the four other cars - a 46-year-old Italian who lives in Sliema, an 82-year-old Naxxar man, 50-year-old man living in San Ġwann and 27-year-old woman from Mosta - were not hurt, the police said. \nEyewitnesses reported seeing an ambulance, police squad cars and Civil Protection Department members rush to the scene. ", "comment_count": 0, "id": 3703}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A woman who had filed a false police report against her estranged husband has had her conviction, including a 10-year general interdiction, confirmed on appeal.\nLegal procurator Juanita Fenech had landed the conviction five years ago over a case which dated back to November 2010 when the woman had turned up at the Birkirkara police station to report that her estranged husband had threatened her outside her home.\nShe had claimed how she had been putting out the garbage at around 8am at her Attard home when the man had driven past, together with his brother, shouting abuse at her through the lowered window and warning that their son would not give evidence in court.\nAfter reportedly speaking to her father and lawyers about the incident, she had “somehow reluctantly” filed a police report which led to her husband’s arrest, in view of the fact that his alleged presence outside the woman’s home amounted to a breach of court orders.\nIndeed, the man had been granted bail, in relation to separate proceedings, under condition that he would not approach his estranged wife and son.\nYet when the man was summoned for questioning, he vehemently denied his wife’s allegation, explaining that on that occasion he had exited his brother’s home, where he had temporarily taken up residence, not earlier than 8.20am, following a route which did not take him anywhere close to his estranged wife’s residence.\nThe man’s version was corroborated not only by other members of the household but even by mobile phone localisation and CCTV footage from Attard streets which further proved that the woman’s story had been made up.\nActing upon a suspicion that the woman had filed a false report, prosecuting Inspector Elton Taliana, from the Birkirkara police station, had called upon the duty magistrate to issue an arrest warrant against Ms Fenech who subsequently admitted, under interrogation, that what she had reported had not been true.\nIn fact, she explained that on that day she had spotted her estranged husband and brother-in-law while driving through Balzan and had made up the false tale on account of her fear of the man at whose hands she had allegedly suffered domestic abuse.\nAlthough admitting that she knew that her report was false, she had no idea that it could spell time in jail for her husband, but had only wished police to admonish him.\nThe Court of Criminal Appeal, presided over by Madam Justice Consuelo Scerri Herrera, rejected the accused’s appeal, after an in-depth study of the testimonies and other evidence put forward.\nAlthough the appellant had argued that she had been gripped by psychological fear when releasing her statement to the police, the court observed that the woman was no newcomer to police interrogations since she had faced previous proceedings, as attested by her criminal record.\nDeclaring the appellant guilty of having filed a false report, which would have implied that her estranged husband had breached bail conditions, the court turned down the appeal, confirming the three-year probation as well as the 10-year general interdiction, pointing out that this was mandatory in terms of law.\nLawyer Kathleen Calleja Grima appeared parte civile.", "comment_count": 0, "id": 3704}, {"keywords": "", "author": "", "article_body": "The Malta Tourism Authority, through its office in the United Kingdom, recently won the gold award for the best strategic PR campaign at the Travel Marketing Awards held at the Hilton Hotel on Park Lane in London.\nThe award was given for the campaign relating to Valletta – European Capital of Culture, which was presented by the MTA UK’s PR agency, Brighter Group. The campaign overcame competition from the other finalists, Visit Guernsey, Turismo De Canarias, Wow Air and South Africa.\nMTA's London office marketing executive Natalie Swinburne narrowly missed gold but was highly commended in the Tomorrow’s Travel Leader category.\nThe awards, which are organised by the UK’s Chartered Institute of Marketing, set the standard for marketing excellence in the travel industry.\nAn institution since 2009, they have firmly established their reputation as the most coveted marketing awards in travel and tourism. They identify and celebrate the outstanding expertise, talent and achievements of agencies, brands, teams and individuals.\nThe MTA’s success in London is testament to the high levels of energy, commitment and expertise that has been developed in international markets, supported heavily by the management team in Malta. \nMTA executive chairman Gavin Gulia commended all those involved and described these awards and others received by MTA offices in recent months as a welcome recognition of the excellent work being carried out by the authority and its partners across Europe and beyond.\n ", "comment_count": 12, "id": 3705}, {"keywords": "", "author": "", "article_body": "Complaints to the Malta Communications Authority increased by 13% in the last six months of 2018 when compared to the first half of the year, according to the authority’s statistical report on complaints and enquiries.\nIn total, the MCA received 132 complaints from subscribers of telephony, internet, television and postal services, 95% of which were closed within 20 working days.\nThe authority also received 354 enquiries.\nQuality of Service issues topped the list of complaints received, with faults being the most common type of complaint received with a total of 45 cases reported.From information gathered regarding complaints received in Q1 2019, the MCA noted that such complaints had decreased significantly. The MCA would keep monitoring trends in this respect to ensure that such complaints continued to decrease.\nThe second common type of complaint received was related to billing issues, namely incorrect billing, with 19 complaints reported to the MCA. In nine of these cases, following the necessary investigations, the MCA determined that the service providers were required to take necessary remedial action to address the issues reported.\nThe MCA recorded a slight decrease of 10% in complaints related to postal services during the second half of 2018. The MCA brought these cases to the attention of the service provider so that it could further investigate the matters raised and address any ensuing issues accordingly.\nCustomer support was a key aspect of the service and customers expected timely and effective assistance when encountering any issues. The MCA monitored the customer care response time provided in the industry.\nThe information gathered through a series of mystery shopping calls made to GO plc, Melita Ltd, and Vodafone Malta Ltd customer care units indicated that the average time taken for a call to be answered by a call agent was 54 seconds.In 95% of cases, calls were answered by a call agent within 5 minutes.\nThe public can contact the MCA on 2133 6840 or by email at customercare@mca.org.mt .", "comment_count": 0, "id": 3706}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Police who raided the home of a suspected drug kingpin found fake €100 notes hidden inside the walls of his shower, an inspector told the court on Friday. \nThe detail emerged as the compilation of evidence against Jordan Azzopardi continued. \nFriday's hearing also saw four witnesses recount how they had fallen prey to the fake currency scam allegedly put into by Mr Azzopardi.\nThe witnesses, the owner of a Sliema confectionery stores, a shopowner from San Ġwann, a student working part-time in a Sliema store and a front officer at a Sliema restaurant all recounted how an “elderly, bald man,” had presented a €100 note to purchase items.\nThe first witness explained that the banknote, presented to one of his staff, had been rejected by the checking machine when the customer had handed it over to pay the bill for a soft drink and minor items.\nThe man had said he had no other cash and had walked away empty-handed, his presence captured on the shop’s CCTV system.\nThe second shopkeeper had not been so lucky, accepting a similar banknote which later turned out to be fake, only realising after handing out change for a bill of some €10 and confirming his suspicion when the police later called at his shop.\nThe part-timer explained that when the customer had handed him the €100 note, he handed it over to a more experienced colleague who scanned it three times over and said it was “real”.\nRead: Acid tanks, white powder and fake €100 notes: court hears of drug trafficking operation\nHaving received the go-ahead, the man effected the transaction, only to realise they had been duped when the police called the following day.\nThe staff at the Sliema restaurant recounted how an elderly man entered the shop one evening, ordering three burgers and three colas, sounding surprised when told that the bill amounted to €28.80.\nWhen handed the food and the bill, the man had presented a crumpled €100 note.\nThe member of staff recalled how he had flatted out the money, held it up against the light and handed over the change, since the note had appeared genuine.\nThe shop had a special marker to detect false currency, the witness explained, adding that in fact when touched with the marker, this had left no mark on the banknote. The police arrival confirmed it was counterfeit.\nAn expert in counterfeit currency from the Central Bank, also testifying in court, confirmed the three banknotes handed to him for checking were fake and lacked the normal security features.\nInspector Mark Anthony Mercieca informed the court that 67 €100 banknotes had been discovered hidden inside the walls of his home shower.\nAzzopardi tried to flee police\nSeveral members from the drugs squad recounted how on March 14, they had been tasked with exercising an arrest warrant against Jordan Azzopardi.\nVarious officers testified as to how they had spotted the suspect in a black Skoda Fabia at Qui-Si-Sana, Sliema, alongside a female passenger.\nThey followed the car to Dragut Point where the surveillance team noted another male passenger on the back seat, later identified as Mario Abdilla, “the elderly-looking bald man.”\nThe trio were followed to San Ġwann, along various stops at stores, before the Skoda finally drove to Għargħur where it stopped at the McDonald’s car park.\nThe woman passenger got out, went to another car and drove away to Madliena where she was later arrested as she emerged from a maisonette at Busietta Gardens.\nIn her handbag was a crusher with traces of cannabis, while the key to the maisonette was found in her car.\nThe woman was strip-searched by two female officers who both testified that the search had proved negative. A search of the apartment yielded a glass jar filled with cannabis buds on the breakfast bench, loose cash and other drug paraphernalia.\nAn officer walked up to Mr Azzopardi just as he had exited the Skoda to buy something from the coffee shop, informed him he was under arrest.\nHowever, soon after being handcuffed, while other officers were searching the vehicle, the suspect made one final bid to escape, running away on foot with the police at his heels.\nHe finally collided with a street pole, suffering slight injuries, before being recaptured and led to the health centre for treatment.\nThe other male member of the trio had also been arrested as he sat at the passenger seat of the Skoda in the Għargħur car park.\nThe compilation continues on April 10.\nLawyer Arthur Azzopardi and Alfred Abela were defence counsel. Inspectors Mark Mercieca and Justine Grech prosecuted.\nAt the end of heading, defence counsel requested the court, presided over by magistrate Doreen Clarke, not to decide upon the bail applications filed on behalf of Mr Azzopardi and his female co-accused until other civilian witnesses testified at the next sitting. The request was duly upheld.", "comment_count": 0, "id": 3707}, {"keywords": "", "author": "Denise Grech ", "article_body": "Rescued migrants aboard a ship en route to Tripoli threatened to jump off unless the vessel changed course and turned towards Malta, according to volunteers who spoke to the crew of a ship at the centre of a diversion.\nA total of 108 migrants landed in Malta on Thursday at the end of a saga in which allegedly the crew of the vessel were overpowered by five men. \nAccording to NGO Lifeline, whose ship is docked near the El Hiblu 1, the merchant vessel spotted a stranded dinghy packed with 108 people on board. The six crew members decided to rescue them and continue on their course to Tripoli.\nThe migrants and the crew could not speak to each other because of language barriers, but five men aboard the ship were able to speak English. The nationalities of the migrants are Ivory Coast, Guinea, Mali, Gambia, Cameroon, Nigeria, Burkina Faso and Senegal. The youngest migrant on board was six months old.\n\"The captain and the engineer of the ship said there was panic and confusion when the migrants realised the boat was heading to Libya,\" a representative of the NGO told Times of Malta.\nThe crew quickly realised that lives would be lost if they continued to Tripoli, he said.The diversion was caused by unarmed migrants facing a desperate situation\nFaced with the tough situation and feeling he no longer had control of the ship, the Turkish captain decided to head north.\nThe version of events was confirmed by another source close to a humanitarian organisation who told Times of Malta that the diversion was caused by unarmed migrants facing a desperate situation.\nThe five men were largely seen as the \"masterminds\" behind what was being described as a 'hijack' and were arrested upon arrival to Malta.\nThe perils migrants face in Libya have been well-documented. Those who fled the country have repeatedly sounded warnings that it was dangerous especially for migrants and rife with violence.\nRead: 'We need to allow the Libyan coastguard to do its job' Muscat says after meeting Libyan PM\nThe El Hiblu 1 upon disembarkation in Malta. Photo: Jonathan Borg\n'Search and rescue capacity should be increased, not reduced'\nSpeaking in reaction to the incident on Friday, the UN Refugee Agency reiterated it did not consider Libya to be a place of safety and that refugees and migrants should not be returned or disembarked there.\nSerious shortcomings of search and rescue capacities called for a a predictable scheme to allow people to disembark in a place of safety, the UNHCR said.\nSearch and rescue capacity in the Mediterranean Sea needed to be increased, not reduced, as will be the effect of a decision by European Union states with regard to Operation Sophia, it insisted.\nJust hours before the incident took place, the EU announced it was going to withdraw deploying ships patrolling the Mediterranean for migrants attempting the perilous voyage away from Libya.\nSearch and rescue vessels were also being held in Malta, with the government deciding to clamp down on migrant vessels carrying out SAR missions in the Mediterranean.", "comment_count": 0, "id": 3708}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Nationalist Party adopted a cautious tone in response to the government’s proposed parliamentary ‘gender quotas’ as smaller parties came out swinging against the plans.\nPrime Minister Joseph Muscat unveiled a consultation document on Tuesday aimed at increasing female participation in politics by adding up to 12 additional reserved seats to Parliament, among other measures.\nThe new mechanism will be triggered if one gender obtains less than 40% of available seats, and will see additional candidates from the “under-represented sex” ‒ currently women ‒ taking up extra seats split equally between the government and Opposition.\nRead: Malta has a problem with women in politics\nAsked for its position on the proposals, a PN spokesman said the party welcomed measures to boost women’s participation but had not yet formulated its internal policy on the government’s document.\nThe PN is deeply concerned by the major declines Malta has suffered\n“The PN is deeply concerned by the major declines Malta has suffered in international equality rankings and believes women must play an integral part in society, not only because it is their right but because it is in society’s interest to make full use of all its resources,” the spokesman said.\n“The party is currently scrutinising the document it received yesterday to add value to this discussion in favour of greater women’s participation.”\nMark Anthony Sammut, the party’s executive president, went a step further, arguing that female and male candidates enjoyed a roughly equal probability of being elected, and that the problem was not voter prejudice but a lack of female candidates.\n“Engineering the results of democratic representation is a dangerous slope we should avoid, especially since no other attempts at increasing female candidature – which is the root cause of the problem – have yet been made,” he wrote on Facebook.\nMeanwhile, the Democratic Party (PD) adopted a more critical tone, lambasting the proposals as “the unfair and unequal imposition of gender quotas on our democracy through brute force, all in the name of extra votes”.\n“Empowerment of women must not be a cosmetic affair. Instead, this proposal ignores any attempt to understand voter behaviour or social patterns or norms,” a spokesman told the Times of Malta.\n“Half of the electorate is composed of women and the government is being condescending by telling them that they have been voting the wrong way, and that their voting behaviour requires a constitutional amendment.”\nPD said that the proposal was an admission that the government had failed to meaningfully address the challenges faced by women and that women should be allowed to achieve success “without the need for handouts”.\nAlternattiva Demokratika chairman Carmel Cacopardo also criticised the plans, which he said were a half-baked solution to a problem that required a complete overhaul of the electoral system.\nHe said the government’s proposals would be worthless if a third party were elected to Parliament and called for an electoral system built around gender-balanced party lists.  ", "comment_count": 12, "id": 3709}, {"keywords": "", "author": "", "article_body": "Children are calling on adults to create the time to communicate with them, and set aside their mobile phones to engage in a respectful dialogue that makes them feel heard, according to a national consultation exercise.\nChildren were not after adult material possessions or token participation and what emerged from the exercise was a loud appeal for adults to listen and make sure children’s voices were heard at every level of society.\nThe message was clear: “Adults do not have enough time and sometimes we are looked at as if we are something to be ticked off a checklist.”\n‘You Matter No Matter What’, launched on Friday by The Children’s Hub within the President’s Foundation for the Wellbeing of Society, is a 70-page report that presents data collected from a one-year consultation exercise among 2,400 children in 48 schools across Malta and Gozo.\nPresident Marie-Louise Coleiro Preca said: “Children and young people are the experts when it comes to their own experiences… As adults, it is our responsibility to include children in our discussions and to provide them with the support they need to participate.\nShe said she hoped the findings presented in this publication will inspire others to undertake similar initiatives and to work harder to create opportunities for child participation and the promotion of children’s rights.\nThe publication forms part of Eurochild’s Child Participation Strategy, which set up three National Eurochild Forums in 2017 and chose to have these piloted in three countries: Malta, led by The President’s Foundation for the Wellbeing of Society; Bulgaria, led by National Network for Children; and Estonia, led by Estonian Union for Child Welfare.\nImportance of eye contact and body language\nFoundation director general Ruth Farrugia said that through this project, the foundation focused on Article 12 of the UN Convention of the Rights of the Child, which states children have the right to be heard and for their opinions to be taken seriously.\n“There is still a long way to go before we can consider the participation of children as part of any standard process. We hope that our experience inspires more organisations and entities to consider the opinions of children to be as valuable as those of adults,” Dr Farrugia said.\n“The findings reveal how children feel happy and fulfilled when they are listened to, how desperately they struggled to compete with other demands on adults’ time,” Dr Farrugia said.\nThe aim of the publication focused on giving children the opportunity to share how effectively, or not, they were being heard in today’s society.\nThe key question children were asked was: “What makes you feel heard and what stops you from being heard?”\nEye contact and body language were two factors children believed were important in helping them feel their message was getting across, as well as being treated with love, reassurance and respect.\nPart of the project entailed getting the children in all the participating schools to use T-shirts as a blank canvas to draw the message they wanted to get across on what made them feel heard and what stopped them from being heard.\nThe report shows that the majority of children said that what stopped them from being heard was the frequency with which adults failed to listen to them; social exclusion; disrespect; abuse and violence; as well as other external factors such as lack of time as adults were constantly using their mobile phones and other devices.\nChildren also highlighted the fact that the education system in its current form was contributing to a lot of stress. They needed adults who were patient, who created a sense of peace and promoted harmony to instill a sense of belonging.\nThe children concluded that the changes they wanted to see were simple and involved changes to behaviour and attitudes and did not cost money.\nThe report may be read in the pdf link below.", "comment_count": 5, "id": 3710}, {"keywords": "", "author": "", "article_body": "Updated at 7.30pm with PN statement\nGovernment objections to a civil lawsuit filed by the Opposition leader calling for the deal between the government and Vitals Global Healthcare to be rescinded have been rejected.\nThis means that the case will now proceed before the First Hall, Civil Court.\nThe suit had been filed by Dr Delia against Prime Minister Joseph Muscat, the Attorney General, Malta Industrial Parks and VGH calling for Karin Grech, St Luke’s and Gozo hospitals to be given back to the people because contract conditions had not been respected.\nThe Prime Minister, the AG and the Lands Authority had raised a preliminary plea claiming that the suit was inadmissible since it could only have been filed up to the date when the final deed was signed.\nHowever, Dr Delia’s lawyers had countered that this argument fell within the merits of the case and was not to be tackled as a preliminary plea.\nThe case had then been put off until the appeal was settled.\nThe court of appeal, presided over by Chief Justice Joseph Azzopardi and Mr Justices Joseph R Micallef and Tonio Mallia agreed with the First Court that this was a ‘particular case’ and one of ‘national importance.’\nThe decision of the first court to first hear the case on the merits before deciding upon the preliminary pleas was to be respected since it fell within the discretion afforded to each judge when hearing a case.\nIt was an expression of that power and duty in the best administration of justice, the Court of Appeal declared.\nVictory for all people of goodwill - PN\nIn a statement, the Nationalist Party said this was another significant victory not just for the Leader of the Opposition, but for all people of goodwill in this country who could not continue to stomach the unbridled greed, sleaze and corruption which had become this government's hallmark.\nThe Government's decision to give three hospitals to Vitals, a company with no experience in the healthcare sector, was 'the wrong deal' which was also confirmed by deputy Prime Minister Chris Fearne when he described the new deal with Steward as 'the real deal'.\nNationalist Party leader Adrian Delia welcomed the ruling.\"This is a victory in the battle to return three hospitals which were given away for nothing to people with no experience in the health sector, back to the government,\" he said. \nDr Delia was assisted by lawyers Jason Azzopardi and Edward Debono. Lawyer Victoria Buttigieg from the Office of the AG was counsel to the prime minister, lawyer Stefano Filletti to the Lands Authority, lawyer John Bonello to Malta Industrial Parks and lawyer Adrian Meli to VGH.\nEffective rule of law - PL\nIn an another statement, the Labour Party said that Dr Delia seemed to respect the court only when decisions were taken in his favour as he had been attacking the court and Malta's judicial system for the past weeks.\nHis statement after Friday's court decision was confirmation of a rule of law that functioned, the PL said.\nGovernment respects decision\nIn another statement, the government said that the appeal was on a technical point which did not require the presentation of proof so one could not accuse the government of delaying it.\nThe government respected the Court's judgement and would not praise or attack the court according to what suited it, like the Opposition did.\nIt that the Opposition leader had praised the court's decision but he had been attacking the institution up to last Sunday.", "comment_count": 0, "id": 3711}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The number of people crossing European borders and applying for asylum has dropped but the hundreds of deaths en route and civil society’s halted rescue attempts have been flagged by the EU’s agency for human rights.\nAn estimated 2,275 people died or went missing in the Mediterranean last year, an average of more than six people every day, according to a new report by FRA, the Fundamental Rights Agency.\nThe numbers of deaths and missing people trying to reach Spain alone increased by 288%, up from 202 in 2017 to 784 people in 2018.\nRead: EU asylum applications rise in January EU asylum applications rise in January\nThe journeys people chose to undertake to reach the EU were as dangerous as ever, mainly as a result of a reduction in overall search and rescue capacity, it says.\nMany NGOs and other private entities stopped their search-and-rescue operations in the Mediterranean due to the trend of criminalising such missions, according to the agency.\nFRA is aware of at least 13 cases in 2018 where rescue vessels were not immediately allowed to dock, leaving more than 2,220 migrants and refugees, including children, stranded on board, often for more than a week in bad weather, under poor health conditions and running out of drinking water and food before being allowed to disembark.\nIn its report, FRA flags vessels that were not immediately allowed to disembark migrants, including seven that eventually landed in Malta. These included the NGO vessel Lifeline with 235 people on board and the Aquarius, which had 140 people on board in August and another 60 in September.\nRead: Fourth largest amount of asylum seekers per capita in Malta\nAbout 150,000 people crossed the EU’s external borders irregularly last year, the lowest number in five years. Asylum applications also fell for the third year in a row.\nHowever, FRA has noted that the drop in new arrivals did not lead to a decrease in fundamental rights concerns.\nApart from people dying en route and leaving migrants on board for longer than necessary there were reports of migrants, including children, being mistreated at border crossings and even refused entry unlawfully.\nViolence and hate speech towards migrants remained an issue in Europe, with a high number of attacks being reported by NGOs, the media and the police. Even so, hate crime was often largely invisible as many incidents went unreported, FRA remarked.\nIn some places, intolerance towards migrants grew and this was not helped by some politicians voicing anti-migrant statements, it added.\nFundamental rights\n▪ The number of deaths of refugees and migrants attempting the journey to Europe remained high, with more than 2,275 fatalities.\n▪ Rescue boats deployed by civil society organisations faced serious difficulties when trying to dock, considerably delaying the disembarkation of migrants and putting at risk their safety and physical integrity.\n▪ Political hate speech and generalising statements insinuating that migrants are a threat to national security and culture contributed to a racist anti-migrant environment.", "comment_count": 0, "id": 3712}, {"keywords": "", "author": "", "article_body": "NGO Din l-Art Ħelwa has expressed support at the aims of the direct action being taken by Moviment Graffitti outside the Planning Authority building.\nGraffiti activists on Thursday camped outside the building in protest at the authority’s failure to amend the fuel service station policy. They will be there until at least Sunday.\nDin l-Art Ħelwa said in a statement it joined the protesters in condemning the authority’s \"utter incompetence\", by having failed to provide a sound and timely policy review on the relocation of fuel stations to outside development areas.\n“The PA is enabling the destruction and over-exploitation of natural and agricultural land by fuel stations, ignoring the wider picture.\n“DLĦ demands that no further permits for the relocation of fuel stations from urban to rural areas should be granted until this policy review is satisfactorily concluded, giving priority to the protection of Malta’s dwindling natural environment,” it said.\nThe action was also being supported by Żminijietna - Voice of the Left and Repubblika.", "comment_count": 7, "id": 3713}, {"keywords": "", "author": "Denise Grech ", "article_body": "Still struggling to remember which bag to leave outside your doorstep every morning?\nBin It is meant to make people’s life easier when handling garbage bags.\nDespite a nationwide educational campaign that followed last year’s unveiling of the new waste separation scheme, for many the struggle remains real. To make matters worse, the new regulations come with the potential of being fined anything between €150 and €500 for taking out the wrong garbage bag at the wrong time, as the ‘grace period’ came to an all-too-abrupt end in January.\nSeven students came together to address the matter by developing an application that allows people to know which bag to leave outside and what it should contain.\nRead: On waste: separation and hoarding - Kristina Chetcuti\nDelicata, a member of the group, said the 16-year-old students realised it was quite a “hassle” for their parents trying to remember what bin bag to put out every morning. \nAnd, faced with the challenge of developing an innovative project as part of the Young Enterprise programme, the budding entrepreneurs quickly decided to address environmental concerns.\n“We decided we wanted to minimise the effort of having to separate waste. It seemed to be what people wanted and needed,” Mr Delicata said.\nThe mobile application, dubbed Bin It, was launched with the aim of helping people carry out their environmental responsibilities without having to make an effort to remember which bag to take out every morning.\nWe wanted to minimise the effort of having to separate waste. It seemed to be what people wanted and needed\nWhile local councils provided leaflets on  the new regulations, many still found it a problem to grasp the new rules. \nWhat a waste: Malta's recycling hurdles by the numbers\nThe application removes the need for the distribution of informative leaflets, which would often end up thrown away and, ironically, creating more waste, Mr Delicata said.\nThe app notifies people of the days and times for collection of different waste streams in their specific localities each morning. Initial reactions indicated people were already keen on the idea, with 300 downloads being recorded in one week alone, he said.\nThe initiative could not have come at a better time, with statistics increasingly showing Malta still has a long way to go before it can claim to be an environmentally-friendly country. \nMunicipal waste figures show only a slither of the country’s waste was recycled until 2017. More than 90 per cent of municipal waste was going to the landfill in 2017.", "comment_count": 25, "id": 3714}, {"keywords": "", "author": "Sarah Carabott", "article_body": "For many, the age of 62 marks the end of their career but for John Ambrogio retirement age was the beginning of a new journey that led him to bag a Master’s degree at 68 years.\nHe is not the only one who will be benefitting from his studies. Mr Ambrogio has drawn up a blueprint based on international standards of how to document an event and archive it within a central repository.\n“Throughout my 50-year career, I realised that, while paperwork was decreasing and digital data was increasing, efforts of documentation and archiving for prosperity were declining.\n“Malta has records dating from the time of the Knights but what records will people have of today’s events in 500 years?” he asked.\nMr Ambrogio embarked on his studies through the Endeavour Scheme, a scholarship that is part-financed by the EU and is designed to help people with their lifelong learning efforts.\nWhat records will people have of today’s events in 500 years?\nThroughout his career, mainly focused on accounting and management within IT companies, Mr Ambrogio realised he had other skills, such as digital imaging and presentation capabilities, he could not put into practice at work. When he left the “four-walled career life” eight years ago, he could focus all his energy on such skills and eventually received a Master of Fine Arts (MFA) in Digital Arts degree cum laude.\n“Apart from it never being too late, continuing your studies after retirement age is not as challenging as some believe because my career actually provided me with the basics for my studies,” he remarked.\nHe noted that, while in the business world digital records were mainly of a financial nature, recording artistic work, including performing arts and music, was a bit more challenging not only because it was of an intangible nature but also because Maltese artists did it mainly on a part-time basis.\nFrom his research, Mr Ambrogio found that as many as 260 hours of effort were behind the annual one-hour performance by University performing arts students.\nThe documentation did not revolve only around the academic part but also what the artists drew inspiration from and their anthropological background.\nDocumenting only the final performance would not be of much use to future researchers, who would be mainly interested in how artists produced the final act.\nThrough his case study, he showcased how to laboriously document a performance while keeping in conformity with international standards. This means that the documentation could be archived within a national repository and shared internationally.\nMr Ambrogio’s research work was partially funded by the Endeavour Scholarship Scheme (Malta), for which scholarships are part-financed by the EU - European Social Fund - Operational Programme II – Cohesion Policy 2014-2020.\nA spokeswoman for the Parliamentary Secretariat for European Funds noted that, apart from supporting tertiary education, the €11,235,000 scheme, which was extended to 2023, guaranteed that the Maltese labour market was in a better position to compete at an international level.\nBy the end of last August, 627 participants had signed a scholarship grant, amounting to €6 million, of which 94% were courses at level seven and 6% at level eight. Some 47% of the awardees were women.", "comment_count": 8, "id": 3715}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Friday’s newspapers.\nTimes of Malta says tens of ‘extra’ employees were recruited at Mount Carmel Hospital in May 2017 on the direct intervention of the Health Ministry. In another story, the newspaper says a pregnant woman and 47 youths claiming to be minors were among the 100 migrants who landed in Malta on Thursday after the ‘hijacked’ tanker that had rescued them off Libya was escorted to Senglea.\nThe Malta Independent leads with the Graffiti’s protest at the Planning Authority.\nIn-Nazzjon says that the tanker ‘hijacked’ by migrants has entered Malta.\nL-Orizzont quotes Justice Minister Owen Bonnici saying that culture generated work and new careers.", "comment_count": 0, "id": 3716}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 4.50pm with ministry statement\nTens of ‘extra’ employees were recruited at Mount Carmel Hospital in May 2017 – at the height of the election campaign – on the direct intervention of the Health Ministry, a report by the Auditor General shows.\nThe National Audit Office said the Health Ministry, headed by Deputy Prime Minister Chris Fearne, took advantage of a contract originally covering the provision of clerical services to almost triple the number of ‘clerks’ at the State mental health hospital. This happened, though it is not specified in the report, in the run-up to the election.\nIt also emerges from the findings that, rather than recruiting the extra employees through normal government channels, ministry officials recommended candidates to the contractor – JF Services Ltd – who obliged, hiring them and then billing the government for their wages and related costs.\nThis recruitment exercise is costing taxpayers almost €2 million in additional expenses a year. The place of residence of the new recruits is not listed in the Auditor General’s report.\nMinistry officials recommended candidates to the contractor\nThe NAO noted that although the contract, which kept being renewed through a direct order approved by the Finance Ministry, was strictly for clerks, those recruited in the period under review were not required. To mitigate the situation, most of the new employees were given other duties varying from drivers, to helping in the kitchen and carrying out security duties outside the scope of the contract.\nSome of those recruited did not possess the minimum of qualifications to perform their job. Electricians were recruited without the necessary licences and had to be given other jobs to avoid problems while the government had to hire other electricians and, of course, pay them.\nRead: Mt Carmel Hospital hired twice as many clerks as planned, then gave them different duties\nWhen asked how the extra staff members were recruited by the contractor and on whose request, none of the hospital officials could give a straight reply and most insisted the recruitment happened before their time at the mental health institution.\nPaul Dalli, the hospital’s former chief operating officer who now works at the Health Ministry, said “individuals were referred to him by the Health Ministry” and he would then “recommend to the service provider [the private contractor] to be recruited and deployed at Mt Carmel”.\nPressed by the NAO to say why the ministry took it upon itself to find employees for the contractor instead of the other way round, ministry officials replied that “such an intervention was required since the contractor was finding it very difficult to source the necessary human resources”.\n\nHospital officials were unable to say why a contract for clerks was used to engage all types of personnel who were not required. However, CEO Stephen Sultana, the Labour mayor of Santa Venera, confirmed that those recruited were still on the contractor’s payroll and were still paid by the government.\nAdmitting that some of those recruited were not up to standard, he conceded that “it is very difficult to dismiss non-performing individuals [employed with the contractor] when these would have been referred to the service provider by the hospital itself for recruitment”.\nThe Times of Malta reported last November that procurement rules were being ignored by Mount Carmel when securing contracts. It was also reported that this also applied to contracts for farmed-out services such as cleaners, nurses, carers and security personnel.\nMinistry reacts \nIn a statement issued on Friday afternoon, the Health Ministry said that the hospital had increased its staff numbers by 120 in the year under review - 81 support workers and 37 clinicians. \nOver the past decade, the ministry said, the hospital had added an average of 83 people every year. The largest increase had happened between 2011 and 2012, when 304 people were added to the hospital's books. \nThe ministry said that many of the workers recruited in 2017 were needed \"to start addressing the serious deficiencies which had accumulated over the years\". \nSecurity personnel had clerical contracts\nWhy the NAO study?\nIn a report issued in May 2018, the NAO observed that outsourced security personnel at Mount Carmel Hospital were governed by a contract for clerical services. This led it to conduct an in-depth review to obtain a clearer picture on how the hospital was managing the contract.\nWhat was procured?\nIn July 2015, JF Services Ltd was tasked with providing 60 full-time clerical staff on a two-year contract.\nWhat happened then?\nIn May 2017, when the contract was supposedly coming to a close and Malta was in a full electoral mode (the election was held on June 3), a new call for tenders was expected to be issued. Instead, the contract was renewed through a direct order against public procurement rules.\nThe number of clerks at the hospital shot up from 60 to 156 in May 2017.\nWho recruited the clerks?\nThe NAO found no documentation to justify the increase. However, according to the former hospital COO, rather than of JF Services providing the extra recruits it was the Health Ministry that was recommending the new employees to the contractor and put on the government’s wage bill.\nWere the clerks necessary?\nNo. So much so that the NAO found that the ministry was using the clerks’ contract to recruit all kinds of unrelated personnel. These included security officers, drivers, carpenters, kitchen helpers, plasterers and tile setters.\nAre all these still on the payroll?\nYes.\nWhat did this exercise cost?\nAccording to the contract, taxpayers were forking out €27,000 a week for the contract but by the end of June 2017, election month, the cost ballooned to €62,000 a week. Over a 12-month period, this recruitment cost taxpayers an extra €1.8 million.\nWas this the only case?\nNo. The NAO found similar cases of abuse in at least another contract related to cleaning services, which is still in force through a direct order, against procurement rules.\nThe Times of Malta is informed that the same system is being adopted for other contracts including for the supply of nurses, carers and security personnel at the same institution.", "comment_count": 57, "id": 3717}, {"keywords": "", "author": "", "article_body": "A mother and a daughter from Għaxaq have been reported missing.\nThe police were alerted to the disappearance of Marija Lourdes Bonnici and her daughter Angele Bonnici on Wednesday afternoon.\nThey were last seen the day before at around 7am at their Għaxaq residence. \nAny information about the two can be passed on to the police, in a confidential manner, on 2122 4001 or 119.\nInformation can also be passed on to the officers at the Żejtun police station.", "comment_count": 5, "id": 3718}]