[{"keywords": "", "author": "Jacob Borg", "article_body": "Australian technology company Neurotech has severed all ties with Adrian Attard Trevisan after The Sunday Times of Malta reported he had produced a false PhD in neuroscience.\nNeurotech said in a public announcement it was “deeply disappointed” with the news. Dr Attard Trevisan’s “limited role” as a company adviser had been terminated, it said.\nDr Attard Trevisan is the inventor of a headband he once claimed could help autistic children become more in touch with their environment “by 500 per cent”.\nHis limited role as a company adviser had been terminated\nNeurotech said he ceased to be an employee in April 2016 and resigned as a director of the company last June. Neurotech took over Dr Attard Trevisan’s company, AAT Research, in 2016.\nThe Sunday Times of Malta reported that Dr Attard Trevisan listed the qualifications on a Neurotech prospectus to investors in 2016.\nNeurotech’s shares have fallen by 18 per cent this week.\nCompany filings from 2018 show Dr Attard Trevisan is a major shareholder in Neurotech.\nApart from the fake University College London PhD claim, Dr Attard Trevisan is being sued by a former employee for allegedly plagiarising sections of a PhD he obtained from Milan University in 2015.", "comment_count": 9, "id": 2519}, {"keywords": "", "author": "", "article_body": "Some of the drug found in St Paul's Bay.\nThree women and a man were arrested on Thursday afternoon after a police raid on a tenement in St Paul's Bay yielded cannabis and cocaine ready for trafficking.\nThe police said the raid followed days of observation and involved the Drug Squad and the Special Intervention Unit.\nThe arrested persons are aged between 20 and 33 and live in St Paul's Bay, Mellieħa and Rabat.\nA magisterial inquiry has been launched and investigations are continuing. ", "comment_count": 3, "id": 2520}, {"keywords": "", "author": "", "article_body": "The freedom which Malta achieved with the closure of the military bases 40 years ago was not an exercise in isolationism but a means to making the country equal with all other countries, Prime Minister Joseph Muscat said on Thursday.\nSpeaking at the foot of the Freedom Monument in Vittoriosa in a commemoration organised by the Labour Party, Dr Muscat said promises made 40 years - that Freedom Day would lead to progress and economic wellbeing, were being realised.\nWithout specifically mentioning Brexit, Dr Muscat said that at a time when around Europe and the world many spoke of freedom in terms of leaving some bloc or group, Malta was celebrating freedom which actually gave it the right to be present around the table with other countries on equal terms.\nFreedom was not about splendid isolation but a means to play an effective role in the world community.  \n\"Without freedom we could not set our course and be part of something which is larger. Those who try to use Freedom Day to whip up extreme nationalism never understood what (Prime Minister) Dom Mintoff sought to achieve,\" Dr Muscat said. \n\"The freedom which Mintoff, Borg Olivier and Vassalli sought was the freedom to make Malta equal to other countries, not to isolate it.\"\nFreedom Day was a point of arrival as well as a point of departure, setting Malta off on the road to progress in many spheres including social justice but also civil rights and equality. His regret, Dr Muscat said, was that some civil rights were not granted sooner.\nStill, more needed to be done in the area of equality.\nMore needed to be done for women in Malta to be truly at par with men. All needed to have the same pay for the same work, and all should have the same work opportunities.\nIt was for this reason that the government had launched a courageous initiative to bring about a stronger representation of women in national decision-making. It was unacceptable that just 27 women had been elected to parliament since elections were first held. It was indeed a pity that such a reform was not carried out earlier. \nConcluding, Dr Muscat said Freedom Day - March 31, 1979 - was a milestone which was part of a series of other historical milestones including the granting of Independence and the declaration of the Republic and all these days should be a source of unity and pride for the people.\nFollowing his address Dr Muscat lit the freedom torch at the top of the monument.  \n ", "comment_count": 60, "id": 2521}, {"keywords": "", "author": "Keith Micallef", "article_body": "A call for expressions of interest for the lease of the former Raffles disco in St Andrew’s for commercial use has been extended by two weeks, but the Labour Party which owns this prized asset is still seeking to choose the preferred proposal by July.\nIssued on February 11, the call was originally meant to close on March 29 but has now been extended to April 12.\nTimes of Malta sought an explanation for the extension and asked about the number of proposals, if any, which had been submitted to date.\nHowever, none of these questions were answered, with a party spokesman saying that they would be in a position to announce the number of submissions received after the closing date. As for the extension, he said that this was granted in reaction to various requests from prospective bidders.\nAccording to the expression of interest, the Labour Party is seeking to lease this Grade 1 scheduled property – the highest degree of protection enjoyed by historic buildings – for a period of not more than 65 years. \nThe objective of this call is to “receive and evaluate commercial and high-level business concepts for the development and commercialisation of the property”.\nHowever, the PL wants to retain ownership and derive a “competitive commercial return” from the lease or other arrangements of the property to the successful bidder.\nFurthermore, the terms of the call state that a formal request for proposals will be issued to shortlisted bidders following the initial evaluation by a selection committee, with the ultimate objective being to select the preferred bidder by July.\nThe property ended up in the possession of the Labour Party through a controversial parliamentary resolution in 1979.  Under this deal, the party was given three properties in St Andrew’s with an overall footprint of 14,000 square metres (the former Raffles Discotheque, Australia Hall and Hook House) and a factory in Marsa that is currently being used as the PL’s media house.\nIn return, the government had taken over the party’s headquarters at Freedom Press in Marsa, to be used by the Malta Shipbuilding.\nThough the PL had been given these properties on the understanding that it would relocate its headquarters there, the PN had criticised the deal as no such condition was set in the agreement. The deal had been branded by the Opposition as a gift to the party in government from taxpayer money.\nNo part of the former Raffles Discotheque can be demolished since it is still a Grade 1 scheduled building. Moreover, the call for expressions of interest notes that this property falls under the North Harbour Local Plan which indicates that its appropriate uses could be a mix of club, local council premises, office space, food and drink, non-residential institutions, education or assembly and leisure.\nHowever, proposals that could add social or other value to the Pembroke community would be considered favourably, as long as they maximise the commercial and financial viability, the PL is saying. ", "comment_count": 35, "id": 2522}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who turned up at the home of his sister’s ex-boyfriend, brandishing a firearm and causing a disturbance, was handed a suspended sentence and placed under a restraining order by a court on Thursday.\nRedeemer Cauchi, a 21 of Marsa, pleaded guilty to carrying a firearm at the time of his arrest, threatening his sister’s ex and other members of his family and breaching the peace.\nThe police were called in when the accused turned up outside the Tarxien residence, kicking up a disturbance and bearing a firearm which later proved not to have been loaded.\nMagistrate Josette Demicoli condemned Mr Cauchi to a 6-month jail term suspended for 18 months.\nThe court also ordered the confiscation of the weapon, whilst placing the accused under a restraining order.\nInspector Paul Camilleri prosecuted.\nLawyers Lennox Vella and Marisa Mifsud were defence counsel.\nLegal procurator Joeline Pace Ciscaldi and lawyer Roberto Montalto appeared parte civile.", "comment_count": 0, "id": 2523}, {"keywords": "", "author": "", "article_body": "Palumbo Malta has been ordered to pay five car owners a total of €1,380 in damages after establishing that their cars were damaged by specks of paint from the shipyard.\nThe case was instituted by Gasan Mamo Insurance after it paid its clients for the damages caused. \nIt was claimed that the cars, parked in Vittoriosa and Cospicua, were damaged by fine paint blown by the wind from the shipyard between January 6 and February 15, 2013.\nRead: Cars damaged by Palumbo works, residents claim\nThe shipyard had denied the claims, insisting that no spray painting took place between those dates and its facility was distant from where the cars were parked, and covered.\nBut court-appointed chemicals expert Prof. George Peplow established that the specks of paint on the cars were identical to those used by the shipyard on a ship in Dock 4, the Grande Brasile. \nIt also resulted that several Cottonera residents had complained to the police about similar pecks on their cars at the time.\nWeather conditions on the days when the paint was used were such that the specks of paint could have been carried by the prevailing wind. \nProf. Peplow examined specks lifted from more than 500 vehicles.\nThe damage to the cars was also confirmed by court expert Joseph Zammit and insurance surveyors.\nMagistrate Francesco Depasquale therefore ordered the shipyard to pay the insurance company €1,380 as well as court costs.\n ", "comment_count": 4, "id": 2524}, {"keywords": "", "author": "", "article_body": "Plans for an extension of the American University of Malta in Cottonera will lead to the complete loss of the only remaining public open spaces around Dock 1 and the privatisation of the Cottonera Waterfront, the environment NGO Flimkien Għal Ambjent Aħjar said on Thursday.\nIt said a development application proposes three new 5-storey blocks and extensive alterations to the Knights’ building. \nArchitect Tara Cassar, speaking on behalf of FAA, insisted that the historic waterfront should be regarded as part of the public realm providing the locality with value, identity and respite from the dense urban cores that characterise the Three Cities.\nREAD: AUM plans to turn public car park into dormitories\n\"It is essential that they are retained and protected for the enjoyment of the public,\" she said. \nThe FAA said the developers also intend demolishing most of the Knights’ building to accommodate more floor area for the private campus.\n\"Such a building in this historical and visually sensitive area should be restored and rehabilitated through best practice and not simply bulldozed to make way for incompatible uses to the detriment of cultural heritage,\" the NGO said. \nIt warned that the proposal will also seriously compromise views towards and around the Senglea Gate and bastions which should be safeguarded given their cultural significance and protected status within an Area of High Landscape Value.\n\"This application is an example of a poorly conceived proposal that will have a direct detrimental impact on the liveability, amenity and public health of the Three Cities and must be refused by the PA,\" the FAA said.\n ", "comment_count": 33, "id": 2525}, {"keywords": "", "author": "", "article_body": "A 30-year-old man from Hamrun was seriously injured on Thursday afternoon as a fierce fire destroyed several boats at a storage facility adjacent to the Polidano plant at Ħal-Farruġ.\nThe man had been working on a boat where the fire started. Another man suffered smoke inhalation.\nThe alarm was raised at about 3.10pm and a plume of dark smoke could be seen from several parts of Malta. \n  \nPeople who work in the vicinity or shop at the nearby Cash and Carry were evacuated.\nPhotos above and below - Matthew Mirabelli\n\n ", "comment_count": 1, "id": 2526}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "State funding of the national broadcaster has grown by at least 25 per cent over three years.\nFigures provided by Public Broadcasting Services, which runs Television Malta (TVM), Radio Malta and its affiliates, including an online portal, show that the annual subvention grew from €3.2 million in 2014 to more than €4 million in 2017.\nAccording to the figures, obtained following a request under the Freedom of Information Act, some TV programmes of a purely commercial nature were also being funded by the State, though it is not clear whether this is in line with the National Broadcasting Policy. The policy lays down that only non-commercially viable programmes of a social, culture and educational nature can be partially or fully funded by taxpayers. However, a National Audit Office investigation in 2010 revealed this was not always the case.\nThe data provided by PBS shows that while prior to 2013, under a Nationalist administration, Xarabank, the national TV’s most popular programme according to audience surveys, was afforded most public funds, subventions for the programme were cut drastically by the new administration.\nInversely, more public funds were channelled to other current affairs/discussion programmes, particularly those produced by MaltaToday managing editor Saviour Balzan.\nDuring the 2012/2013 TV schedule, more than €400,000 in public funds had been dedicated to Xarabank, the amount dropping to €54,000 by 2016/2017, the last schedule for which data is available.\nOn the other hand, Mr Balzan’s Reporter, which had received €749 in public funds in the 2012/2013 schedule, was allocated a subvention amounting to €79,836, €168,890 and €83,262 in the following three years.\nMr Balzan started producing a new discussion programme – Xtra – as from the 2016/2017 schedule for which PBS allocated almost €78,000.\nAnother discussion programme that saw an increase in public funding was Brian Hansford’s Realtà, while Reno Bugeja’s Dissett retained a constant public funding of about €50,000.\nMr Balzan was also tasked with the production of two other TVM programmes, cooking show Gourmet and Dwarna, a socio-psychological discussion presented by his sister, Mariella. Both programmes also got State funding.\nThe data shows that during the 2013/2014 and 2014/2015 scheduled, TimesTalk, an Allied Newspapers production, was allocated €84,000 and €103,000 of public funds. Though it was the most followed current affairs discussion programme on TVM, it was axed from the PBS schedule just a few weeks after the Panama Papers scandal broke.\nSenior PBS sources said that while most of the public funds were dedicated to cultural, educational and informative programmes, there were instances where the system whereby public funds were allocated was not as transparent as one would have liked it to be.\n“It is also true that, in the case of current affairs programmes, funds are used by the powers that be to pull some strings. However, this will always be the case as long as PBS is controlled by the government of the day,” they added.\nAfter the 2010 investigation, the National Audit Office had made a series of recommendations to ensure more transparency in the allocation of public service obligation funds to PBS.\nThese included better-defined rules and the need for the State broadcaster to endeavour to be more realistic in estimating revenue and the cost of each programme to be funded by taxpayers. However, the PBS sources said that “the situation has not improved since the NAO recommendations”.\nivan.camilleri@timesofmalta.com", "comment_count": 7, "id": 2527}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A thief who was caught red-handed as he left a Sliema block carrying items stolen from two apartments was handed a suspended sentence after pleading guilty before a magistrate on Thursday. \nThe thefts took place on Tuesday.\nProsecuting inspectors Saviour Baldacchino and Bernardette Valletta explained how police had been alerted to the presence of a stranger inside an apartment block in Sliema.\nPolicemen came across Francesco Loporcaro, 47, residing at Paola, as he was exiting the block with a bagful of items he had just stolen.\nMr Loporcaro was accused of stealing a watch, jewellery, fishing tackle and other items.\n“Colpevole, si’,” the Bari-born electrician pleaded without the slightest hesitation, adding that he regretted his actions and promised to cooperate with the police.\nDefence lawyer Joseph Brincat suggested that his client deserved a suspended sentence in view of his early guilty plea and his cooperation with the police.\nThe prosecution did not insist upon an effective jail term but pointed out that not all stolen items had been recovered. \nMagistrate Josette Demicoli handed down a 2-year jail term suspended for four years, warning Mr Loporcaro to steer clear of any other offence.", "comment_count": 0, "id": 2528}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Plans for the redevelopment of the former Wembley ice-cream factory in Msida into a seven-storey office block have been given the go-ahead, with the Planning Authority backing a contentious bold redesign for the mid-century building.  The application by Emil Bonello Ghio had originally foreseen an 18-storey high-rise on the site, but the plans were dramatically scaled back and, as unanimously approved by the Planning Authority, now foresee just seven floors with four basement parking levels.While the factory's façade, described by authorities as having high architectural and aesthetic value and proposed for scheduling, will be retained, the PA's case officer had originally expressed concern over the planned redesign. \nArchitect Ray Demicoli's proposed design features a bold vertical element in the same art deco style as the original façade, and involves dismantling the current structure and relocating it to the centre of the site.\nThe architect pointed to similar buildings, such as the Muscat Motors showroom nearby, and said eliminating the design element would jeopardise \"the entire scope of the iconic façade\".\nSimpler design recommended by the PA design committee, featuring a distinct extension and no central element.\nHowever, despite the backing of cultural heritage authorities, the plans met with opposition from the PA’s design committee, which insisted on a simpler redesign with a clearly distinct extension that did not compete with the original façade.\nThe committee argued that the proposed 'jukebox' design element was too prominent and would dominate not only the building but also the surrounding area.\nIt also noted that the neighbouring Muscat Motors showroom was a modest art deco structure that incorporated only a simple vertical feature as a central element. \nNevertheless, at a hearing on Thursday, the PA board expressed a clear preference for the architect's preferred design, particularly after noting that the Superintendence for Cultural Heritage (SCH) was in favour of dismantling and shifting the façade and that the building's interior did not have any particular heritage value. \nWhile the permit was approved unanimously, the board held back on approving the façade for procedural reasons. It is expected to be approved under a separate application in the coming weeks. ", "comment_count": 3, "id": 2529}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Gozitan man who preyed upon a 15-year-old boy to satisfy his sexual drive was jailed for five years and placed under a treatment order on Thursday.  \nThe sexual abuse came to light during a conversation between the boy and his mother. The 15-year-old had explained how he met the 50-year-old man at a place they both often frequented. He had made it a habit to step into the bathroom, stark naked, whenever he spotted the teen having a shower.\nAfter befriending the boy and getting on closer terms with him, the man had requested the boy’s telephone number so as to keep in touch.\nTrue to his word, the man had invited him to his home to show him his pet bird and ‘lovely dog’ .\nBut when they got there, the man had engaged in sexual acts with the 15-year old. The acts took place on three occasions.\nJoseph Haber, 58, was accused of defilement, holding the minor against his will, violent indecent assault and engaging in sexual acts with the boy.\nIn the course of proceedings, the boy testified about the alleged events, his version corroborated by a number of other testimonies including a social worker, police officers and three civilian witnesses.\nMagistrate Joseph Mifsud concluded that all the accusations had been proven, save for the second charge of having held the victim against his will.\nOn the strength of the minor’s testimony, there was no doubt that the activity engaged by the accused had amounted to libidinous acts, the court declared, thereby concluding that defilement, the violent indecent assault and the sexual acts with the minor had been proven.\nThe court declared Mr Haber guilty and condemned him to a five-year jail term, while placing him under a three-year treatment order so as to address his sexual drive towards underage persons.\nThe court also issued a three-year protection order in favour of the victim, while ordering the accused’s name to be registered as a sexual offender.\nFinally, the court issued a ban on the publication of the name of the minor, his relatives and the place where the abuse took place so as to avoid identification of the victim.", "comment_count": 0, "id": 2530}, {"keywords": "", "author": "Claire Caruana", "article_body": "Over 73,000 fines were issued against drivers caught speeding beyond 15 kilometres per hour above the legal limit, official data shows.\nThe camera installed in Nutar Żarb Street in Attard caught the most drivers off guard, totalling 13,127 contraventions in 2016, the year under review.\nAccording to data published by the National Statistics Office on Thursday, traffic-related contraventions issued by the police increased by two per cent from 2015, while tickets issued by wardens went down by 4.1 per cent. Most of the contraventions were issued in the Northern Harbour district.\nSt Paul's Bay registered the highest number of contraventions (5,573) issued by the police, while Sliema had the highest tally of contraventions issued by wardens.\nTraffic is on the increase. Photo: Shutterstock\n14 - average age of cars in Malta\nThe data also showed that for every thousand motor licences there were 1,423 vehicles on the road, with the total number of vehicles amounting to 358,947.\nWhile passenger cars accounted for 78.8 per cent of total licensed motor vehicles, motorcycles registered the highest increase at 16.7 per cent in 2016, the year under review.\nDriving licence holders amounted to 252,276, which marked an increase of 1.8 per cent over the previous year. The Northern Harbour district registered the largest number (27.6 per cent) while the Gozo and Comino district accounted for 9.1 per cent of the total.\nThe NSO also found that the average age of passenger cars in Malta stood at 14 years. Cars in the Southern Harbour district had the highest average age, 15.26 years, followed by the Gozo and Comino district, with an age of 14.58 years.\nMeanwhile, the number of public transport commuters totalled 43.2 million with just 4.6 per cent of them coming from the Gozo and Comino region.\nThe NSO data shows that last year passengers and vehicles travelling between Malta and Gozo increased by 7 per cent and 7.5 per cent respectively when compared to the previous year.\nPassenger traffic originating from Ċirkewwa was busiest on Friday and Saturday, while the highest numbers leaving from Mġarr were recorded on Saturday and Sunday.", "comment_count": 21, "id": 2531}, {"keywords": "", "author": "", "article_body": "Tower Road in Sliema was closed as a precautionary measure on Thursday afternoon when a wall around a construction site crashed into the site.\nThe wall collapsed around 12.30pm and no one was injured.\nMembers of the Civil Protection Department, an ambulance and the police went on site within minutes.\nThe officers on site confirmed that all workers were accounted for. \nIt is not yet known what caused the incident. \nPhoto: Matthew Xuereb", "comment_count": 22, "id": 2532}, {"keywords": "", "author": "Denise Grech ", "article_body": "It came out of the blue, just hours after the EU announced it was going to withdraw ships patrolling the Mediterranean for migrants attempting the perilous voyage.\nA group of 108 migrants were rescued by a merchant vessel off Libya but upon learning they were going to be re-routed back to Tripoli, five men decided to take matters into their hands. \nThe six crew members sought help from the Libyan coast guard, but it rejected them, saying it was \"out of service\".\nRead: 'We need to allow the Libyan coastguard to do its job' Muscat says after meeting Libyan PM\nThey landed in Malta on Thursday morning. The men who overpowered the crew were arrested, while some of the migrants went down on their knees and kissed the ground. \nRead: Five arrested as overpowered ship stormed by AFM, arrives in Malta", "comment_count": 0, "id": 2533}, {"keywords": "", "author": "Claire Caruana", "article_body": "The population of Malta and Gozo in 2017 peaked at 475,701, official statistics published on Thursday confirm, with those aged between 30 and 39 accounting for the greatest share.\nThe figures emerged from the publication of Regional Statistics Malta 2019 Edition, released by the National Statistics Office annually.\nAccording to the data, the highest increases in population occurred in the elderly population, while the number of those aged between 10 and 19 years of age registered the largest decrease, both in in Malta and in Gozo.\nRead: Population up 52,000 in Malta in five years – but only by 1,300 in Gozo\nLast year, Eurostat said that the rate of Malta’s population increase was 15 times more than that of the EU.\nThe NSO data also shows that the most common type of households in Malta was the two-person household, while in Gozo, houses with one person were the most common.\nOn income, the NSO data shows that the average household disposable income was highest in the Western district, at €32,754 and lowest in the Gozo and Comino district, at €22,867.\nExpenditure per capita on so-called “selected benefits” was highest in Mdina, Floriana, Santa Luċija and Vittoriosa. In these localities, the expenditure per capita exceeded €2,000 in each.\nMeanwhile, in Mellieħa, Munxar, Marsascala, St. Paul’s Bay, Pembroke, Swieqi and Mtarfa, such expenditure per capita was less than €900.\nOn the economy, the NSO figures show that in 2017, the gross value added at basic price increase by 9% in Malta and 10.9% in Gozo when compared to the previous year. \nAlmost all industries in the Malta region registered increases, the NSO found, except for the industries of agriculture, forestry and fishing and real estate activities. In Gozo, almost all industries in registered increases with the exception of the industries of agriculture, forestry and fishing.\nThe largest increases, both in Malta and Gozo, were recorded in the industry involving professional, scientific and technical activities and administrative and support service activities. ", "comment_count": 12, "id": 2534}, {"keywords": "", "author": "", "article_body": "European Union states and the European Parliament on Thursday provisionally agreed on a new EU border and coast guard law drafted and piloted by Maltese MEP Roberta Metsola.\nThe ‘Metsola law’ will see 10,000 additional new border and coast guards and operational staff deployed at Europe’s borders in an effort to address migration and cross border crime challenges.The ‘Metsola law’ will see 10,000 additional new border and coast guards at Europe’s borders.\nIt will see the process of return of those deemed not eligible for protection in Europe made more efficient and increase cooperation with third countries, with full guarantees for fundamental rights. The new law allows for all the necessary tools to be used at external borders to fight cross-border crime.\nCommenting on the law, Dr Metsola said she was delighted that a provisional agreement on the law was reached as it would address one of the major concerns of EU citizens.\nThe European border and coast guard law would overhaul Europe's border management. It would mean an additional 10,000 border and coast guards for Europe, more efficient returns, more tools to fight crime and will serve to allay security and crime concerns and aid in our migration strategy, Dr Metsola said.\n\"Europe's citizens were looking to us to deliver and we have, in record time. This is a huge win for Europe and a huge win for Malta and Gozo,\" she said.\nA final vote on the law will take place in April.", "comment_count": 10, "id": 2535}, {"keywords": "", "author": "", "article_body": "Updated at 1.40pm\nMEP David Casa has welcomed Turkey's decision to drop charges against investigative journalist Pelin Ünker in one of the cases she is facing.\nMs Ünker's case was due to continue in Istanbul on Thursday afternoon.\nEarlier on Thursday, 66 MEPs from across political groups in the European Parliament demanded in a declaration that charges in Turkey brought against Ms Ünker be dropped.\nA number of charges had been brought against the journalist after she reported facts resulting from the Paradise Papers and which the complainants in the case acknowledged to be true.\nThe MEPs described the charges against Ms Ünker as a “further blow to media freedom and freedom of expression in Turkey”. \n\nMr Casa said the charges against Ms Ünker were dropped in the case concerning her reporting on the son-in-law of President Erdoğan.\nNevertheless, she still faced 13 months in jail on a case over the same series of articles involving relatives of the Speaker of House Binali Yildirim.\nMr Casa has been campaigning for Ms Ünker over the last months and has described the action against the journalist as cruel and intolerable. \nHe said it was one's duty to stand with journalists and safeguard media freedom as this was one way of combatting injustice.\n\"Today’s decision is a positive development but the other charges against the journalist must also be dropped. There is still more work to be done”.\nIn February, Mr Casa visited Ms Ünker in Istanbul where he met with her legal team.\nMs Ünker visited Malta two weeks ago as Mr Casa's guest. During her visit she met activists and journalists to share experiences on the increasing international challenges to media freedom. She also addressed the Daphne Caruana Galizia vigil.\n ", "comment_count": 1, "id": 2536}, {"keywords": "", "author": "Claire Caruana", "article_body": "The teaching profession is in crisis, the MUT has warned, insisting that the government was not doing enough to address mounting concerns. \nAddressing a press conference to unveil a series of proposals on Thursday, Malta Union of Teachers head Marco Bonnici said a number of issues had led to serious problems in the profession.\nThis included a drastic increase in the number of students in schools as a result of the influx of foreigners, the changes in students' abilities, the introduction of several new subjects and reforms introduced by the government that required more educators. \nMr Bonnici insisted that while other areas were being heavily promoted to ensure that students opted for certain careers, the same could not be said for teaching. On the rare occasion that a campaign to attract students to teaching courses had been launched, this was half-baked and lacking effort, he said. \nThe MUT would also be calling for fiscal incentives to attract more students to the profession, something Mr Bonnici said had already been proposed but which the government had so far ignored. The union would also be calling for capping on the number of students accepted to university courses to be abolished. \nMr Bonnici again reiterated calls for an external audit to establish why teachers were leaving the profession as well as better conditions for those who return to work after a number of years away. The union would also be once again urging the government to introduce indemnity insurance for those injured while on the school grounds. \nThese proposals, he said, would be presented to the Education Ministry during a meeting in the coming days.  \n ", "comment_count": 1, "id": 2537}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The latest Air Malta audited accounts and financial statements are still not publicly available despite Tourism Minister Konrad Mizzi saying over the weekend that the national airline had made a “turnaround”.\nRegistry of Companies sources confirmed the documents normally deposited according to law following the official announcement of a company’s performance had not yet been filed.\nEfforts by Times of Malta to obtain a copy of the consolidated financial statements and accounts proved futile. A spokesman for Air Malta said he was not in a position to supply copies of the documents, which have, so far, not been posted on its website, either.\n“As per normal procedures, Air Malta will be filing its annual report and consolidated financial statements for the year ended March 2018 with the Registrar of Companies and uploading them on its website in the coming weeks,” the airline spokesman said when approached on Monday.\nFinancial operators deemed this is “rather strange”, adding that once a public announcement was made, as happened last Saturday, one would usually expect all available documentation to be made available for scrutiny.\nAir Malta chairman Charles Mangion said the company had turned an €11-million loss in the financial year ended March 2017 into an operational profit of €1.2 million.\nHe said operating revenue increased by €5.3 million mainly driven by an 11% growth in passengers, 8.5% more flights and a 2.8% increase in seat load factor. Operations expenses dropped by €6.5 million thanks to lower fuel, aircraft leases and maintenance costs.\nDr Mangion warned that it was still an uphill struggle.\nIn a 2011, the airline had agreed with the EU over a five-year restructuring plan aimed at returning to the black but, three years later, it posted larger than anticipated losses.\nUnder previous tourism minister Edward Zammit Lewis, Air Malta started trimming operations and sought a strategic partner but talks with Etihad via Alitalia failed.\nFollowing Labour’s re-election in 2017 and the appointment of Dr Mizzi as Tourism Minister, the strategy was changed, with the airline focusing on growth, restarting routes closed a few years before and hiving-off loss making operations, including ground handling. Many Air Malta employees were shed, either through an early retirement scheme or by putting them on the government’s payroll.\nAsked in Parliament last week whether Air Malta owed Enemed millions of euros in outstanding fuel payments, Dr Mizzi refused to reply, saying it was “commercially sensitive information”.\n ", "comment_count": 38, "id": 2538}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated at 1pm\nThe European Parliament insisted changes to Malta's rule of law and the protection of journalists are made sooner rather than later in a vote taken in Strasbourg on Thursday.\nA resolution with a number of recommendations on rule of law received overwhelming support, with 398 MEPs voting in favour and only 85 voting against. The majority of Socialist MEPs, the political group Malta's Labour Party belongs to, voted in favour of the recommendations.\nDutch MEP Sophie in’t Veld said last month the report contained \"severe criticism\" of the way the authorities had handled the investigation into journalist Daphne Caruana Galizia’s assassination. The report was approved by a cross-party majority of MEPs in the European Party’s civil liberties committee in February.\nThe report called for a full and independent public inquiry into Ms Caruana Galizia’s murder and into the response by the public authorities to it.Concern was expressed about the “hate speech and disparagement” of the memory of Ms Caruana Galizia.\nMEPs declared the Prime Minister’s chief of staff, Keith Schembri, and Tourism Minister Konrad Mizzi are “the only acting high-ranking government officials in any EU member state who were found to be beneficial owners of a legal entity revealed in the Panama Papers”.\nThe report pointed to shortcomings in the rule of law in the country that were identified by the Venice Commission and urged the Maltese government to implement all the commission’s recommendations without exception.\nDuring an EP debate about the report on Monday, firebrand MEP Ana Gomes said it was unacceptable how Prime Minister Joseph Muscat continued to “protect Daphne Caruana Galizia’s murderers”.\nEuropean Justice Commissioner Věra Jourová told the European Parliament during the debate the Commission had highlighted its concerns about the \"lack of efficiency\" with which corruption cases were investigated and prosecuted in Malta.\nWe emphasise the need for further checks and balances in our system\nThe civil liberties committee backed calls on the Maltese government to publicly and unambiguously condemn such acts and urged strong action to be taken against any public officials fuelling hate.\nIt also called for the immediate publication of the Egrant inquiry report and for Malta to stop selling EU passports.\nResolution 'protects Maltese and European values'\nNationalist MEP Roberta Metsola, who formed part of the rule of law missions to Malta and Slovakia, told Times of Malta the vote on Thursday was on a resolution that outlined a framework for future work on ensuring the pillars of democracy in Malta were safeguarded.\n“We emphasise the need for further checks and balances in our system that will mitigate any potential abuse and reinforce confidence in our country as an EU member state”, she said.\nFollowing the vote, she noted the resolution sought to protect both Maltese and European values.\nMEP David Casa also said it would have been a dereliction of duty to look the other way while institutions were captured to protect corrupt politicians to the detriment of people.  PN MEP Francis Zammit Dimech said the Maltese people deserved to live in a truly European country. \"we will continue to be their voice and to defend these values which we cherish,\" he said.  \nMEP Miriam Dalli said that various debates and discussions in parliament tried to give the impression that Malta does not care about its rule of law.\n\"It was only through intense works that this week we had amendments being submitted, including by the S&D, to start recognising the work being done by the Maltese government. I have always defended my country, and will continue to do so.\"\nLabour MEP Marlene Mizzi said the country was being \"politically and unjustly harassed\".\nEuropean Parliament members were not applying values of fairness, objectivity and non-discrimination when they voted in favour of the fourth resolution against Malta.\n“This shameful resolution against Malta was co-authored by one of our own Maltese MEPs as shadow rapporteur, who is also the LIBE coordinator for the European People’s Party. This is truly deplorable,” Ms Mizzi said.\n“Whilst I understand that there is still room for progress, and that no government or country is perfect, I will not accept that my country’s name is dragged through the mud over and over again without any respect for objectivity and integrity of facts,\" she said.\nAdditional reporting by Denise Grech", "comment_count": 61, "id": 2539}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated 2pm with PA decision\nThe Planning Authority on Thursday gave the go-ahead for a 200-apartment residential complex in Birżebbuġa, although the local council voted against the project due to fears for the safety of an important cave nearby. \nThe development on Triq Għar Dalam and surrounding streets will include 178 apartments and 22 penthouses spread over seven floors, three of them receded, with three underground parking levels.\nThe PA board approved the plans with 10 votes in favour and only one against. Local council representative Carmel Cacopardo voted against the project after the board refused to take up his proposal of a €1 million bank guarantee to ensure the safety of the nearby Għar il-Friefet. \nThe underground cave is a site of scientific significance and part of a greater of archaeological and geological importance surrounding Għar Dalam.\nA geological report cited during the hearing had concluded that the cave was naturally unstable and that vibrations during the construction phase could affect the cave’s integrity.\nThe PA board voted down Mr Cacopardo's proposal as the developer could not be held solely responsible for safeguarding the cave, which is some 60 metres away from where excavation will take place, and traversed by an overlying road.\nThe board, however, insisted that all excavation be carried out with circular saws to minimise vibrations, and that geological monitoring takes place. A €50,000 bank guarantee was imposed to ensure the conditions were followed. \nThe PA case officer had recommended the application for approval, noting that the area was zoned for residential use, while the Environment and Resources Authority (ERA) had also deemed the plans acceptable, citing a lack of significant environmental impacts.\nResidents, however, had voiced concerns over the noise and air pollution, as well as the parking problems, they say the development and its construction will bring with it.\nPlans for the site have been on the cards since an outline development permit was granted in 2011.\nA permit for seven blocks had been granted back in 1968 but only three were built, and after a cultural appreciation of Għar il-Friefet, the area was scheduled. The Marsaxlokk Bay Local Plan designated a substantial part of it as a ‘green area’.", "comment_count": 6, "id": 2540}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says state funding of the national broadcaster grew by at least 25% over three years. In another story, it quotes a study in which researching propose that foreign students should be redistributed in schools across Malta to avoid having “disadvantaged ghettos”.\nThe Malta Independent quotes the Prime Minister saying that the metro project is only feasible in Sliema.\nL-Orizzont says that €167 million have been invested in Valletta.\nIn-Nazzjon says Castille’s short term measures were leading to low wages.", "comment_count": 0, "id": 2541}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated at 8.55am with video \nA group of activists set up tents outside the Planning Authority's main office in Floriana on Thursday morning and said they would camp there in protest until at least Sunday, in a symbolic siege against planners' lethargy. \nActivists are angry that a promised fuel stations policy revision, which has been on the cards for more than a year, has not yet been published.\nThe group of about 25 set up tents outside the PA driveway, holding banners, chanting and banging drums. \nThe authority barred the gate and PA security officials kept an eye on activists from the other side of the gate.\nActivists have pitched their tents.\nFour uniformed police officers arrived at around 8.15am and asked protesters to ensure employees could still access the building, but did not otherwise intervene. Protestors also briefly moved their tents to allow employees to remove their cars from an internal car park. \nAt one point, security guards came out with water and coffee but the activists refused them.\nPA board chairman Vince Cassar and other board members, as well as other executive chairman Johann Buttigieg, walked past protestors without stopping as they arrived for scheduled board hearings.\nThe board hearings - none of which were related to fuel stations - went ahead as scheduled at 10am, with no acknowledgement of the protests going on outside.\nAddressing journalists, representatives of the activists demanded that the controversial fuel stations policy should be changed to rule out new or relocated stations immediately, as recommended by ERA, that the revised policy should be published immediately for consultation and that the final policy should be implemented after consultation without delay.\nMalta is 'under siege'\nGraffitti spokesman Andre Callus, who is among the protesters, said Malta was \"under siege\".\n\"Fuel stations are a symbol of this,\" he told Times of Malta. \"What can be more senseless than 3,000 square metre developments mushrooming all over the countryside?\"\n\"We have been waiting for this policy for a year and four months. [PA executive chairman] Johann Buttigieg said last November the policy was imminent, [planning minister] Ian Borg said the same last week and [environment minister] Jose Herrera this week, but we are still waiting.\"\n\"We don't want to have to carry out these actions but we are ready to keep going as long as is necessary.\"\nEarlier this week, Dr Herrera has admitted to a lack of agreement with Dr Borg over the prospect of fuel stations continuing to be built outside development zones.\nThe controversial 2015 policy allows fuel stations to ‘relocate’ from urban cores to up to 3,000 square metres of ODZ land. A revision announced in January 2018, intended to reduce the burden on agricultural land, has not yet been completed.\nProposals issued last April by the ERA, within Dr Herrera’s remit, included a complete ban on all new and relocated fuel stations on ODZ sites, but Dr Borg suggested last month that the ban may be applied only to new facilities.\n'Malta under siege from the PA and speculators', a banner reads.\nChants and banners outside the PA offices.\n'PA siege: why all these fuel pumps?' the banner reads.", "comment_count": 58, "id": 2542}, {"keywords": "", "author": "Herman Grech, Denise Grech", "article_body": "Updated Thursday 1.20pm\nA small tanker that was taken over by a group of migrants was stormed by Maltese soldiers early on Thursday and escorted to Malta.\nThe vessel, with 108 migrants on board, including 12 children and 19 women, docked at Boiler Wharf on Thursday around 8.30am. The migrants disembarked safely and the five hijackers were taken away in handcuffs.\nThere were 12 children on board. Photo: Jonathan Borg\nThe ship rescued the migrants off Libya and was returning them to a Libyan port on Wednesday when the bridge was taken over some six miles off the Libyan coast. The crew were then ordered to set course towards Malta.   \nThe Maltese authorities established contact with the captain of the tanker ElHiblu 1 when it was about 30 nautical miles away.\nAn AFM soldier guards the migrants on board. Photo: Jonathan Borg\nThe captain repeatedly said he was not in control of the vessel and that he and his crew were being forced and threatened by a number of migrants to proceed to Malta, the army said.\nA total of 108 migrants are believed to be on board.\nA Maltese patrol boat stopped the tanker at the edge of Maltese territorial waters. \nA special operations unit team, supported by patrol boats and a helicopter then boarded and secured the vessel, handing control of the ship to the captain.\nArmed soldiers in battle fatigues and flak jackets could be seen guarding the migrants as the ship entered Grand Harbour at about 8.30am.\nThe police quickly identified five suspected hijackers, who were handcuffed and taken away in a prison van.\nThey are expected to face charges of using force to illegally take over command of the ship and diverting it from its course.\nNo weapons appear to have been used and no one was injured, but the outnumbered crew members said they were threatened with assault unless they followed orders.  \n\n\n\nThe ship rescued the migrants and requested assistance. The captain explained on the radio that the migrants were very upset and did not want to be taken back to Libya.\nSea Eye said that as a result, 108 persons were now being \"criminalised and instrumentalised\". \n\"The EU will have to take responsibility for this renewed escalation if cargo ships have to take on government responsibilities which the Libyan Coast Guard is often unable to fulfil,\" Sea-Eye spokesman Gorden Isler said.\nItaly's Deputy Prime Minister Matteo Salvini described the migrants who took over the vessel as \"pirates\".\n ", "comment_count": 0, "id": 2543}, {"keywords": "", "author": "", "article_body": "The Finance Ministry has hit out at the Nationalist Party for 'seeking to interfere' in an evaluation of Malta by MoneyVal - the Committee of Experts on the Evaluation of Anti-Money Laundering Measures and the Financing of Terrorism.\nIt was reported on Sunday that Malta’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation, with the government now scrambling to push up its final score before the summer deadline.\nOn Wednesday and on previous occasions, Opposition leader Adrian Delia called on the government to take concrete action to strengthen Malta's reputation.\nThe Ministry of Finance in Valletta.\nThe Finance Ministry said the PN's latest attempt to interfere with the due process being carried out by MoneyVaL was ample proof that it was set to harm the country on the pretext of concern for Malta’s reputation.\n\"This Council of Europe mission has been carrying out such circa two-year evaluations about Malta, for the last 20 years. The Nationalist administrations have experienced these missions starting in 1998. The missions have always in the past carried their task serenely without undue pressure or interference from the political class,\" the ministry said. \n\"Not this time. While in opposition, the Nationalist Party is dead set on interfering and prejudicing the findings. As soon as it was communicated that MoneyVal will be carrying out its evaluation process for Malta, MEP David Casa asked to meet with MoneyVal officials to inform the independent mission about a number of allegations against Malta. This attempt was followed by a letter sent to MoneyVal by a number of MPs in the Council of Europe. This type of interference is unprecedented.\"\nThis claim was immediately denied by Mr Casa who tweeted that it was ridiculous.\n\nThe government said the mammoth MoneyVal evaluation exercise involving all the Maltese regulatory and supervisory authorities together with the intelligence and law enforcement forces started many months ago . It is now entering its 8th stage with seven more stages to go. A Maltese delegation will soon leave for France to engage in a face-to-face meeting with the MoneyVal officials to discuss certain issues needing clarifications in the preliminary report.\n\"At this delicate phase of the evaluation process, the Opposition decided to make use and publicise an internal leaked MoneyVal official document, which is still undergoing revisions, and removal of factual errors, all of which may result in changes to its conclusions and eventual recommendations,\" the ministry said.\nThe leaked document, it said, is an internal official draft, which is undergoing a due process, which applies equally to all the Council of Europe Member States.\n\"MoneyVal insists that this draft is confidential and as such, it is not even sent to any Council of Europe Member State, the EU or any international institution, not to hide anything, but because the evaluation is only complete when MoneyVal itself publishes it in July of this year after passing through all the stages\" the ministry added.\nThe Opposition was not only acting in an improper manner, by interfering in this due process, but also trying to harm the country by prejudicing the final evaluation. \nMinister should provide solutions and not baseless accusations - PNIn a statement, PN spokesman Mario de Marco said Minister Scicluna's reaction to the Moneyval report was the kind of reply that the country did not need at this delicate moment in time, when it was facing the prospect of being blacklisted as a financial jurisdiction. One would have expected the minister to provide a solid update to the nation, particularly those whose livelihoods depended on the financial services sector, about this worrying state of affairs, Dr de Marco said.\nHe added that one would have expected the minister to explain what was being done to avert a potential disaster. Instead the Minister lashed out with baseless accusations towards the Opposition.\nThe Opposition, he said, became aware of the contents of the preliminary Moneyval report when it was published by The Sunday Times of Malta.", "comment_count": 56, "id": 2544}, {"keywords": "", "author": "Claire Caruana", "article_body": "Laws to regulate hawkers selling fruit and vegetables at busy junctions remain elusive, despite the government saying in 2017 it would introduce more stringent rules.\nThe new rules, however, have yet to see the light of day with more vendors appearing on the side of roads as the weather gets warmer. Wayside stalls have also been noticed close to busy roundabouts, often leading to long tailbacks as drivers park their vehicles haphazardly to make their purchases.\nSelling from the side of roads is governed by the Food Safety Act, which covers food production, processing, storing, distribution, transportation and presentation for sale. The changes in the law announced in 2017 was aimed at including more specific rules for the different activities. \nThe idea had been to introduce the amendments through a legal notice aimed at making the law more sector-specific. However, such a legal notice has yet to be published.\nThe Commissioner for Environment and Planning, David Pace, who forms part of the Office of the Parliamentary Ombudsman, highlighted the health risks of consuming food while dining al fresco in 2017.\nThe grey area seems to be getting wider\nA spokesman from the Ministry of Health said that the matter was still being discussed, and that the Environmental Health Directorate will be issuing a set of sector-specific guidelines (not laws) explaining prerequisites specific to different food handling operations.\nContacted about the matter, the CEO of the Chamber for Small and Medium Enterprises (GRTU), Abigail Mamo, who has been vocal about the issue for years, said she was not aware of the rules ever being introduced.\nReiterating that street vendors in general needed to be regulated, Ms Mamo said that while some farmers had permission to sell their produce outside their fields, this did not mean anybody could set up shop anywhere they pleased.\n“We have been saying that this is a problem and a grey area for years. The grey area seems to be getting wider as people become more creative,” Ms Mamo said.\n“This is just one of the many issues related to street vendors that needs to be regulated.”\nShe insisted that those setting up such stalls at roundabouts, for instance, were breaking a series of rules, including those on traffic and health and safety.", "comment_count": 38, "id": 2545}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who allegedly broke down the front door of a Sliema residence, robbing its elderly occupant at knifepoint, was granted bail on Wednesday after pleading not guilty upon his arraignment.\nJassem Al Taher, a 36-year old Libyan national residing at Pembroke, was accused of having damaged the woman’s front door, threatened her with a knife, driven under the influence of drink as well as being drunk in public.\nA request for bail was strongly objected to by prosecuting officer Inspector Bernardette Valletta who pointed out that the alleged victim’s daughter knew the accused, thereby giving rise to the possibility of tampering with evidence.\nHowever, this argument was countered by defence lawyer Joseph Bonnici who claimed that such a hypothetical statement fell below the degree of proof required in criminal proceedings.\nMoreover, the court could impose strict bail conditions, the lawyer continued.\nMagistrate Monica Vella, upheld the request for bail against a deposit of €2000, a personal guarantee of €5000 and a strict order not to lay foot in Sliema.\nUpon being asked for a period of ten days within which to effect payment, the magistrate promptly replied, “Yes, but you’ll be spending them in prison.”", "comment_count": 0, "id": 2546}, {"keywords": "", "author": "", "article_body": "European member states on Wednesday pledged to take measures to ban single-use plastics, with Maltese MEPs strongly backing the call.\nThe proposal, which is designed to prevent and reduce the impact of certain plastic products on the environment, in particular the marine environment, sets a number of different policy measures to tackle these problematic single-use products, ranging from bans and reduction efforts to labelling and extended producer responsibility schemes.\nThe report voted on in Parliament calls on EU member states to take measures to reduce the consumption of food containers made of plastic and plastic cups for beverages.\nIt also sets out an ambitious binding target of at least 25 per cent of recycled plastic for Polyethylene terephthalate (PET) beverage bottles is established from 2025 onwards. By 2030, all plastic bottles will need to respect a target of at least 30 per cent recycled content.\nMaltese MEPs from both sides of the political spectrum backed the call, saying the policy change would help bring about a more environmentally-friendly mentality.\nEvery minute a truckload of plastic is ending up in our oceans- Miriam Dalli\n\"Every minute a truckload of plastic is ending up in our oceans,\" Labour MEP Miriam Dalli said. If nothing will be done, this figure will double by 2030, she added, calling for a change in mentality.\nPN MEP Roberta Metsola also encouraged politicians to support the ban, noting 75 per cent of waste in the ocean was plastic. However, she warned, the EU’s decision would not be enough. \"We can have the best laws in the world, but change has to happen on an individual level as well,\" she said.\nPN MEP Francis Zammit Dimech said a culture change was needed to ensure the sea would be enjoyed by future generations.\n\"Other small islands in the Mediterranean have become or are in the process of becoming free form single-use plastics, case in point islands which are few kilometres from our shores such as Pantelleria and Lampedusa,\" he said.", "comment_count": 5, "id": 2547}, {"keywords": "", "author": "", "article_body": "The European Parliament gave the final go-ahead on Wednesday for an ambitious target to reduce EU emissions for new cars by 2030.\nThe legislation, piloted by Labour MEP Miriam Dalli, sets a CO2 reduction target of 37.5 per cent for new cars and a CO2 reduction target for new vans of 31 per cent by 2030.\n\"This is a step forward to ensure that Europe remains ahead of the curve when it comes to zero- and low-emission vehicles’ technology instead of depending on imports. I am convinced that this transition can ensure the competitiveness of the automotive industry,\" Dr Dalli said following the final vote.\nManufacturers whose average emissions exceed the limits will also have to pay an excess emissions premium. By 2023, the European Commission will have to evaluate whether these amounts should be used to fund a fair transition towards zero-emission mobility or to support developing workers’ skills in the automotive sector.\nRead: Miriam Dalli's ambitious emissions proposal gets EP backing\nThe ambitious proposal to curb emissions has been a long time coming. When it was initially proposed last year, it had ruffled the feathers of car importers, who argued the emissions drive was unfair. \nDr Dalli told Euronews she held no fewer than 130 bilateral meetings with lobbyists from different sectors, including oil and fuel companies and environmental organisations. \nThe European Union eventually agreed on a compromise over how sharply to curb carbon dioxide emissions from cars and vans. ", "comment_count": 4, "id": 2548}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Independent MEP candidate Arnold Cassola is calling for more detailed geological studies before works kick off on the proposed Gozo-Malta tunnel.\nThe geological study carried out so far was only a partial and preliminary one, and certainly not enough to ensure the safety of the whole project, he said during a press conference.\nDr Cassola added that it would be irresponsible to issue tenders and start the work before such detailed studies were produced, studied and discussed publicly.\nFor the preliminary geological study, seven holes were bored on land and only two were bored in the sea. This was not enough and more holes should be bored in the sea before any decisions can be taken on the geological feasibility of the tunnel, the MEP hopeful said.\n“Geological studies have confirmed that the sea between Malta and Gozo is full of faults - a continuation of the faults present onshore in Malta. There are at least 10 faults in the seas between the two islands.”\nWatch: Gozo tunnel will be built and run by the private sector\nMr Mercieca had said on Times Talk that a private contractor will have to finance the building of the Gozo-Malta tunnel and would then take over its operation for a number of years depending on its final cost.\nMr Mercieca, head of the project’s steering committee, had noted that the toll set will also depend on the cost, but he insisted that the operator would break even well before the 100-year anticipated lifespan of the tunnel.\nDr Cassola said comments by former MP Franco Mercieca that over a billion tonnes of inert waste will be used for land reclamation were a “fallacy”.\n“When tunnelling, the rock will be bored and it will be reduced to dust. This means that if it were to be used for land reclamation it would cause more damage to the seabed, create more sea turbidity and allow less sunlight to pass through.”\nDr Cassola insisted that tenders could not be issued and work could not be undertaken before all geological studies, an Environmental Impact Assessment, and sociological and financial feasibility studies were completed and put up for public discussion.\n“If tenders are issued without all these studies having been made public beforehand, the responsibility would not only be political but also personal,” he said.", "comment_count": 4, "id": 2549}, {"keywords": "", "author": "Ivan Martin", "article_body": "The government was dragging its feet on the introduction of a mass transportation system while Malta had the worst air quality in Europe, Opposition leader Adrian Delia said on Wednesday.\nSpeaking during a conference organised at the Chamber of Commerce, Dr Delia said transport was one of the island's most pressing problems.\nThe only thing the government had done to address this was pour tarmac and widen a few roads. \nMalta needed a real solution now, and this was clearly a mass transportation system, he said. \nThe government however seemed to be using this as yet another excuse to fill the island with more foreigners. \nThe solution to all of the country's problems seemed to be to import more foreign workers, he said. \n\"Pensions - get more foreigners; tunnel to Gozo - get more foreigners to make it feasible. Soon we are going to be a tiny island, filled with foreigners,\" Dr Delia warned.\nHe was reacting to Prime Minister Joseph Muscat, who earlier told the same conference that a metro system would require a much larger population to be economically viable.  \nThe government was confusing the public with proposals that were sensational and meant only to grab votes at election time.\nImporting labour is not the answer\nDr Delia said that while the country was close to full employment, the other side of the government's foreign worker-driven policies was poor remuneration.\nWhere people really feeling the benefits of this economic model? And were wages growing? Dr Delia said the answer was a clear no.  \nIf the current trend persisted, there would soon be more foreigners in the Maltese workforce than there are Maltese. This was happening on an island with limited space and even more limited resources, he warned.\nEven worse, the majority of these imported workers were in low-wage sectors.\nTotal output may be on the rise, but this did not mean quality of life was also improving.\nAsked if he would therefore try and restrict the number of foreign workers on the island, Dr Delia said he would instead come up with policies that did not depend solely on an influx of labour.\nThe policies he was for, would see risk spread across various economic sectors – business leaders know not to put all their eggs in one basket, he said.\nReputation damage \nThe government might be planning a move into contentious areas like cryptocurrency, but this would be much more difficult if the country did not have a solid reputation, Dr Delia went on to argue.\nReplying to questions put by EMCS Malta's Stefano Mallia, Dr Delia said he had lost count of the number of damning reports to slam the island’s rule of law, democratic structures, and enforcement.\nMalta’s international reputation, he lamented, was shattered.\nGRECO, the International Monetary Fund, and most recently MoneyVal’s preliminary assessment of the island had come back with very worrying results he said.\nThe island now had three months to try and improve this poor showing in the MoneyVal report-“hardly enough time to turn things around”, he said.\n“So yes, let’s consider a move into innovative technologies and sectors, even if they may require some risks, but let’s ensure we have a rock solid reputation to be able to take this challenge on,” he said.\nTo this aim, the government should immediately implement the recommendations of the Council of Europe’s Venice Commission.\nMalta a tax haven?\nReacting to a European Parliament vote in favour of a resolution labelling Malta as having the characteristics of a tax haven, Dr Delia said it was not the first time other European member states had put pressure on the island to change its tax regime.\nHowever, when Malta had faced these challenges in the past, it had the benefit of a good reputation to hold up as a defence.\nDr Delia said he would not go around Europe tarnishing Malta or undermining the jurisdiction, but something needed to be done to fix the island’s reputation.\n“As an Opposition we will not defend the government but we will defend our country, and Maltese businesses. What is wrong is wrong. We can’t live in denial, we need to get our head out of the sand,” he said.\nBloated government and the construction boom\nLater during the conference, Dr Delia was asked for his views on the bloating of government with excessive public sector employment.\nHe said he would not go around firing people on the public payroll, but he would devise policies that saw workers only employed where necessary.\n“In one year the Water Services Corporation employed 100 plasters – we really needed them,” he quipped.\nAsked what about his views on the construction boom, Dr Delia said the PN was in no way dependant on the construction lobby. Its revenue streams were diverse and the party would not bend to the will of any large interests, he said.\nAsked what sort of policies the PN favoured in this sector, Dr Delia said one could not plan to have no development, but could plan for sustainable development.\nHe concluded by saying that the government might be planning to make Malta metropolitan, but what did that really mean? Does it mean that Malta would stop being an island in the Mediterranean and become one concrete block? He asked.", "comment_count": 56, "id": 2550}, {"keywords": "", "author": "", "article_body": "Mount Carmel Hospital issued a direct contract to hire 60 people for clerical work but ended up engaging 134, with many actually performing maintenance work and security duties, an investigation by the Auditor-General has found.\nFurthermore, in some cases, government officials were directly involved in referring individuals to the service provider so that they may be engaged and deployed at Mount Carmel Hospital under this contract. \nIn a report presented to the parliament, Auditor-General Charles Deguara said his investigation had found irregular engagements, contractual design flaws and a weak contract management function. \nThe National Audit Office (NAO) said the hospital was acquiring these services through a one year negotiated procedure, since a new tender was not awarded before another contract’s expiry in July 2018.  \nIt was extremely difficult to dismiss a number of non-performers, given that it itself had referred them for engagement\"\n\"Although the contract under review originally called for the deployment of approximately 60 full-time equivalents (FTEs), 134 FTEs were deployed as at September 2018,\" it said.\n\"NAO found that 47 of these outsourced personnel, although engaged through a contract for clerical services, have been deployed to carry out non-clerical responsibilities, such as maintenance and security duties.\n\"This audit has also shown that there have been instances in which government officials were directly involved in sourcing and referring individuals to the service provider so that they may be engaged and deployed at MCH under this contract.\"\nWhile those people engaged through this contract and deployed to work as clerks were delivering an acceptable level of work, some of those deployed to carry out non-clerical duties were not meeting the expected level of service.\nBut the hospital's management had told the office that it was extremely difficult to dismiss a number of non-performers, given that it itself had referred them for engagement to the service provider, the audit office said. \nCleaning services contract\nThe audit office also made a number of observations concerning a contract for cleaning services at Mount Carmel.,\nIt said the service was procured through a call for quotations even though it significantly exceeded the financial threshold for this method of procurement. No formal and documented contract was in place.\nAs in the clerical services contract, a number of deployed personnel carried out tasks not related to cleaning duties and the output of the outsourced personnel as well as the quality of the cleaning products being used were 'questionable'.\nRead the full report at www.nao.gov.mt  ", "comment_count": 27, "id": 2551}, {"keywords": "", "author": "Bertrand Borg, Denise Grech, AFP ", "article_body": "Updated at 7.13pm\nMigrants have taken over a merchant ship off the Libyan coast and are headed north, towards Malta.   \nThe El Hiblu 1 tanker was taken over by 108 migrants when it was six miles off the Libyan coast. The ship's captain had been heading for Libya after rescuing the migrants at sea when it was taken over by some of the people it rescued.\nIt then veered north. \nAn AFM spokeswoman confirmed reports of a \"pirated ship\". \n \nTwo Libyan coast guard ships are understood to be tailing the vessel, which flies a flag of Palau.\nIts last known contact was an alert sent out by its captain warning that it was under piracy. \nThe ship had set sail from Turkey and a number of Turkish nationals are among its crew.  Their condition is not known. \nMalta's AFM will refuse to allow the vessel to enter local waters, a spokeswoman said, adding that units were on standby for any eventual development. \nAt current speed, the ship is expected to reach Malta early on Thursday.          \nA government source told Times of Malta that around 77 of the ship's 108 rescued passengers are believed to be men, with the other 31 being women and children. \nCan authorities board the vessel? \nAuthorities could board the ship once it enters Maltese territorial waters and arguably its contiguous zone, which reaches 24 nautical miles off Malta’s shore, invoking the 1982 United Nations Law of the Sea Convention.\n\nThe subsequent 1988 Convention for the Suppression of Unlawful Acts of Violence Against the Safety of Maritime Navigation allows state parties to “establish jurisdiction” over vessels which have been subjected to a hostile takeover.\nThe convention was introduced to fill gaps in international maritime law which piracy laws did not cover, maritime law scholar Patricia Vella de Fremeaux told Times of Malta.\nIs it piracy?\nItalian Interior Minister Matteo Salvini described it as an \"act of piracy\" and an AFM spokesperson spoke of a \"pirated vessel\".\nBut according to the letter of the law, that is technically not correct. \nUnder international law, a hostile takeover must occur on the high seas for it to qualify as an act of piracy. In this case, the vessel had been taken over in a country's waters - Libya's - and by people on the same ship. Piracy under international law requires two vessels.\nThe distinction might appear academic, but it had legal ramifications, Prof. de Fremeaux said.\n“Acts of piracy are subject to universal jurisdiction, meaning any country can intervene,” she noted.\nWednesday's case echoes a similar incident which occurred last November, when a group of migrants rescued at sea and taken back to Libya refused to disembark the ship once it reached Misrata. \nThat days-long stand-off had only ended once military personnel stormed the ship. \n\n\n\nEU suspends naval patrols in Libya migrant operationEarlier on Wednesday the EU said it will suspend ship patrols that have rescued tens of thousands of migrants in the Mediterranean amid deep resistance by populist-led Rome.\nThe rescues were part of the EU's Operation Sophia which diplomats have decided to extend by six months beyond its March 31 expiry date, but without new ship deployments, the bloc announced.\nInstead, the operation will rely on air missions and close coordination with Libya despite the political chaos that has scarred the country since 2011.\n\"Member states have decided to extend the mandate of Operation Sophia for six months with a temporary suspension of its naval assets while member states continue working on a solution related to disembarkation,\" said EU spokeswoman Maja Kocijancic.\nHowever, Sophia \"is a maritime operation and it is clear that without naval resources, it will not be able to carry out its mandate effectively,\" she added.\nSince its launch in 2015, after a series of tragic shipwrecks, the mission has claimed the arrest of some 150 traffickers, and rescued 45,000 people.\nBut the election of a far right-populist government in Rome last year changed the fate of the mission, with authorities taking a much harsher stance towards rescued migrants heading for Italian shores.\nItaly's anger effectively put an end to rescue operations through Sophia a year ago, even as the EU credited the mission with having stopped smugglers taking migrants on dangerous sea crossings.\nSources told AFP the decision split the EU's 28 member states, with several countries wondering whether Sophia -- now a naval mission without a navy -- should be halted.\n 'Damage control' Efforts to reform Operation Sophia in the long term have beached on the broader question of how to reform the EU's so-called Dublin asylum rules, which stipulate that the country of first arrival must process asylum seekers.\nMatteo Salvini.\nUnder the stewardship of far-right Interior Minister Matteo Salvini, Rome has insisted it should not have to carry the burden of dealing with migrants rescued at sea. \nThe stance has seen Salvini gain in popularity ahead of EU elections set for May.\n\"Rationality went out of the window a long time ago,\" an EU diplomat told AFP on condition of anonymity.\n\"This is damage control in the hope that once election season is over we might actually come to our senses,\" the source added. \nOver the years, Europe has added new functions to the mission, which also trains the Libyan coastguard and controls the enforcement of a UN arms embargo on Libya, and illegal oil trafficking.\nEU cooperation with Libya has been credited with sharply reducing the number of migrants arriving from North Africa and the Middle East from a 2015 peak when Europe faced its worst migration crisis since World War II.\nActivists however decry rampant human rights abuses against migrants in Libya as they await passage to Europe and urge the EU to not outsource the problem to Tripoli.\nFor the moment, two ships patrol the central Mediterranean as part of Operation Sophia: Spain's \"Rayo\" and Italy's \"Luigi Rizzo\", which are supported by air assets from Spain, Italy, Poland and Luxembourg.", "comment_count": 0, "id": 2552}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A suspected loan shark who had allegedly demanded some €150,000 for a loan of €7,800, was cleared by a Magistrates’ Court declaring that the evidence put forward fell far short of the moral certainty required by law.\nAnthony Galea, 56, had been arraigned alongside his 27-year old son Gilbert on Christmas Eve in 2017, pleading not guilty to charges of having loaned money at excessive rates of interest, threatening their victim and causing him to fear violence, almost driving him to commit suicide.\nThe alleged victim had reportedly turned towards the younger man, requesting a loan of some €10,000 to refurbish his bakery and purchase equipment for the business.\nMr Galea junior had subsequently released a statement recounting how he had involved his father who had allegedly agreed to a loan of €7,800, signing a private writing to this effect with the alleged victim.\nYet, the borrower had eventually ended up facing demands of repayment to the tune of some €150,000. He was driven to such despair that he had even contemplated taking his own life were it not for the timely intervention of the police.\nCriminal action was instituted against both father and son who were arraigned jointly, both denying the charges.\nProceedings were subsequently separated, with those against the son still ongoing.\nWhen delivering judgment against the elder of the two money-lenders the court, presided over by magistrate Joseph Mifsud observed that the son’s statement released under police questioning was not admissible as evidence against the father.\nThat statement, which had served to implicate the father in the alleged criminal activity, was to be discarded as evidence against him since proceedings against the person making the statement had not been concluded, declared the court, resting its decision on a line of caselaw and established teachings on the subject.\nTurning to the testimony supplied by the alleged victim, the court observed that the accused’s name had only featured by way of reference by the son.\nThis amounted to hearsay evidence and was also inadmissible as valid proof against the accused, stated the court, adding that the prosecution had brought forward no evidence that Anthony Galea had actually been involved in the alleged usury.\n“There was no evidence that the alleged victim had in any manner, at any time met or communicated, directly or indirectly, with the accused Anthony Galea in respect of the alleged money loan,” declared the court.\nThe prosecution had presented, by way of documentary evidence, a private writing for a loan of €7,800 signed by the accused who had stated, under police interrogation, that he had occasionally lent out money in the past.\nHowever, the case at hand focused solely upon charges linked to a money-lending activity between the accused and the alleged victim between November 2015 and December 2017, the court observed.\n“The Court reiterates that it would be very dangerous and detrimental to a person’s fundamental rights if the criminal courts were to rest upon suppositions, conjectures and emotions when delivering judgment.”\nMoreover, the court warned against the dangers of overspending and living a life beyond one’s means until one ultimately turns to loan sharks.\n“Anyone who ends up entangled in usury will ruin his own life and that of those nearest to him,” the court remarked.\nIn the light of all evidence put forward, the court concluded that the prosecution had failed to prove its case, the evidence falling far short of the moral certainty required by law, thus acquitting the accused of all charges.\nThe court also lifted a freezing order which had been imposed upon all assets of the accused since January 2018.\nLawyers Arthur Azzopardi, Alfred Abela and Rene Darmanin were defence counsel. Franco Debono and Amadeus Cachia appeared parte civile.", "comment_count": 0, "id": 2553}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 2.03pm with video\nOpposition leader Adrian Delia on Wednesday did not answer questions about his alleged involvement in a money laundering racket, inviting reporters to set an appointment with him instead. The Sunday Times of Malta has reported that financial crimes investigators had found there was a reasonable suspicion that Dr Delia had been involved in laundering the proceeds of London brothels in the early 2000s.Shortly after receiving detailed questions about the FIAU’s findings from Times of Malta, Dr Delia called a press conference in which he said that he had learnt that financial transaction documents dating back to that period had been forged with his fake signature. \nAsked whether he would be calling for a magisterial inquiry into the FIAU findings , Dr Delia said he had already asked a magistrate to look into whether or not his signature had been forged on the documents. On Wednesday, the Opposition leader was evasive when asked questions on the matter, insisting he was late for another appointment. Journalists were instead directed to make an appointment with him.Dr Delia has yet to reply to the questions sent to the PN last week. \nMore to follow", "comment_count": 29, "id": 2554}, {"keywords": "", "author": "Claire Caruana", "article_body": "A quarter of students are \"hesitant and resistant towards multiculturalism\", a study on the well-being of foreign children in Malta has suggested. \nSome of the outcomes from the study were unveiled on Wednesday by Commissioner for Children Pauline Miceli, who said she asked for the study as the influx of foreigners on the island grew significantly in recent years. \nThe researchers found that while the majority of Maltese students have positive, open and tolerant views towards foreign children and multicultural integration, one fourth were still found to be hesitant towards integration of such peers. \nThe study also revealed that social interaction with foreign children is still limited overall, with most Maltese students still spending most if their time with \"native peers\". \nResearchers also found that the views of Maltese children depended on the nationality of the foreign children. The majority, the study showed, 'preferred' students who came from the West (Western Europe, North America and Australia). Children from Maghreb, Middle East and sub-Saharan Africa are \"the least liked\".\nConducted over the past two years, the research was carried out among 2,500 students who were both foreign and Maltese. They took part in four studies. \nThe full study will be published during a conference in April. Wednesday's presentation did not provide details about the study methodology, specific questions asked of respondents or the study's margin of error. \nHealthier, less bullying among foreign students\nWhile children of migrants were still likely to experience hardships, the researchers concluded that over all, foreign children were more likely to enjoy a better quality of life, with many experiencing less bullying than Maltese students. The foreigners also adopted healthier lifestyles, and were more likely to care for the environment and to be more caring. \nForeign children who did not come from the West, mainly asylum seekers, were found to be the most likely to be living in overcrowded homes. They also struggled with language barriers more and also encountered problems with accessing services and making friends.\nSpeaking at the unveiling, Family Minister Michael Falzon said that the study needed to be analysed by looking at the whole process. \n\"We have the Children’s Policy, for instance, which will ensure that children are protected. The truth is that whatever we say, the more time passes, the more we will have a cosmopolitan society. Let’s not forget that where you have different cultures, you will have different influences. This is not just now, it has happened for years,\" the minister said.        ", "comment_count": 12, "id": 2555}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated at 11.55am with more videos\nWith Malta’s current population, a mass transport system would only be feasible in the Sliema area, Joseph Muscat told a business sector crowd on Wednesday.\n“Would we have a system that just links Sliema to St Julian's?” he asked rhetorically when discussing the possibility of Malta ever having a metro system.  Read: Valletta to Gozo in 30 minutes: what a metro in Malta could look like\n“The key question is: do we want to grow, or not? Where do we want to go as a country? To stay the same? Or to truly become metropolitan?”\nDr Muscat was being interviewed at an event organised by consultancy EMCS Malta and held at the Malta Chamber of Commerce, Enterprise and Industry titled ‘state of the Maltese economy’.\nHe told the crowd that the government’s first priority was for the country to have an improved road network. This he said, was a must.\nRead: Drones to be used to analyse roads' condition\nBeyond that, it was no secret that the government had commissioned a report detailing the cost and feasibility of having a large-scale metro system. That report, conducted by UK engineering firm Arup, was now being updated, he said. \nCostings had been finalised and were “significant in GDP terms,” he said.\n“But now is not the right time” to reveal them, he added.\n\n\n\nMalta’s population was proving to be a stumbling block, he said, and unless it grew significantly a metro would only be an option if it was funded through people’s taxes.\n“This is a hard pill to swallow, but it’s the hard truth,” he said.\nAnother hard truth was that an eventual metro would be focused on the most densely-populated harbour areas, and could not cover the entire country.\nHe hinted that a metro in Gozo was simply not going to happen.\nEarlier in March, Times of Malta revealed how the Arup report had estimated that Gozo’s population would need to explode five-fold to reach 150,000 for a metro there to be viable.\nTurning Gozo into “another Sliema”, Dr Muscat said on Wednesday, was something that he did not think anyone was keen on.\n'Malta is not a tax haven'\nReacting to a European Parliament report, which on Tuesday found that Malta operates like a tax haven, Dr Muscat said the timing of its release had to be taken into consideration .\nTuesday’s report by the EP’s Tax3 committee named and shamed seven countries, including Malta, as having levels of foreign direct investment (FDI) that could only be explained to a limited extent by real economic activities taking place within the countries.\nDr Muscat said the report had come as the EP heads into an election cycle.\nMuscat reacted to an EP report which criticised tax regimes such as Malta's. Video: Chris Sant Fournier\nThe European Commission disagrees with this position, and any country that had been successful in the financial services sector had been labeled by the EP.\nDr Muscat said that while a few “local incidents” had been genuinely flagged at EU level, others had been extrapolated because of “Malta’s internal political bickering”.\nWithin the Maltese bubble, it was easy to think the focus was on the island, however the reality was that the scrutiny was of the entire financial services industry across the whole union, he said.\nReform \nDr Muscat attributed the country’s economic success to a government that was “fearless on reforms”.\nWhen a government stopped changing and evolving, then the economy started to stagnate, he said.\nThat said, business leaders played a huge role.\nThe Prime Minister thought back to his first car when discussing Malta's economy. Video: Chris Sant Fournier\nHe compared the island’s economy to his first car - a Mini Minor -  which he said used to run on fumes as he never had enough cash to fill the tank.\n“But somehow if you handled it correctly and trusted it, it would run,” he said.\nMaltese businesses, Dr Muscat mused, had taken signals from the government that it was willing to facilitate growth, and they had run with that.", "comment_count": 264, "id": 2556}, {"keywords": "", "author": "", "article_body": "The number of people registering for employment in February stood at 1,829, dropping by 8.8% when compared to the same month in 2018, the NSO said quoting data provided by Jobsplus.\nThe data indicated that registered unemployed dropped among all age groups.\nRegistrants decreased when compared to February 2018, irrespective of how long they had been registering. The largest drop was among persons who had been registering for more than a year.\nThe number of persons with a disability who were registering for work decreased by 71 when compared to the previous year, reaching 215. Men accounted for 71.2% of total registrants with a disability.\nThe largest share of males and females on the unemployment register sought occupations as clerical support workers with 18.2% and 36.9% respectively.", "comment_count": 1, "id": 2557}, {"keywords": "", "author": "", "article_body": "Learning Support Educators' quest for better working conditions should not be at the expense of children with disability, the Commission for the Rights of Persons with Disability (CRPD) said.\nIn a statement on Wednesday, it said it was concerned at recent statements issued by the teachers’ unions, which might adversely affect disabled schoolchildren.\n“While educators’ health and working conditions should be safeguarded, this could not be at the expense of the well-being and dignity of disabled children, some of the most vulnerable members of our society,” Commissioner for the Rights of Persons with Disability Oliver Scicluna said.\nThe Union of Professional Educators recently warned it would report the government to European Health and Safety authorities for difficult and deplorable working conditions. It said Learning Support Educators were getting badly injured at work after being made to lift children daily.\nLSEs supported students in the classroom in a variety of ways, assisting teachers with the delivery of the national curriculum by breaking down the lesson in a way that children understood.\nRead: Schools ‘cannot handle’ children with disability, parents say\nThe CRPD urged the government to take the necessary measures to safeguard the health of its educators and improve their working conditions. Not only should schools be accessible, but the necessary equipment, such as hoists and evacuation chairs, as well as appropriate training, should be available to assist LSEs in their duties. \nHowever LSEs’ quest for better working conditions should not be at the expense of disabled children. “We very much hope that disabled children will not become collateral damage in the battle for membership between the teachers’ unions.”\nCRPD said it was committed to making Maltese society an inclusive one, in a way that persons with disability reached their full potential in all aspects of life, enjoying a high quality of life thanks to equal opportunities.", "comment_count": 2, "id": 2558}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A British man who allegedly defrauded his 82-year old partner with whom he had since relocated to Gozo, is to be returned to his homeland after an extradition request in his regard was upheld by a Maltese Court.\nMark Anthony Saunders, 55, had been arraigned under arrest on March 16 after the police tracked him down in Gozo following an alert on the Schengen Information System posted on March 1.\nThe alert had been sparked by a European Arrest Warrant issued by a district judge in Birmingham last November, where Mr Saunders is wanted to face criminal proceedings over allegations of fraud.\nThe man, formerly employed in the UK as a carer with an elderly British couple, had entered into a relationship with the woman, following the death of her husband, and allegedly acquired some properties, half of which had been financed by the widow.\nThe couple eventually moved to Gozo in 2016 where they had been living ever since.\nUpon his arraignment, the man’s defence lawyer had insisted that the extradition request had stemmed from a malicious case instigated by the children of his client’s partner.\nThe wanted man had been remanded in custody pending the continuation of the hearing of the case before another court.\nFollowing that hearing, the court, presided over by magistrate Donatella Frendo Dimech, delivered its decision on Tuesday whereby, on the basis of the evidence put forward, it concluded that the offence for which the man was wanted back in the UK was an extraditable one in terms of law.\nThere was no reason prohibiting the man’s return, the court declared, thereby upholding the extradition request and committing him to custody pending his return which was not to be effected before the expiration of seven days from the order of committal and this, unless the man chose to file an appeal.\nFurthermore, the court declared that the man’s return was to be subject to the law of speciality, which, in simple terms, meant that the extradition was to be effected solely in connection with those offences mentioned in the warrant.\nInspector Mark Galea prosecuted.", "comment_count": 0, "id": 2559}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "All new cars sold in Malta would have to be fitted with technology that stops drivers from exceeding speed limits under proposed new vehicle safety rules being laid out in Brussels.The speed limitation technology is one of a range of safety features to be made mandatory from 2022, along with automated emergency braking and electronic data recorders, after a provisional agreement was reached by the European Commission.The package of measures still needs to be ratified by the European Parliament, which could see it toned down.Speed limitation devices, called intelligent speed assistance, or ISA, uses GPS data and sign recognition cameras to detect speed limits where the car is travelling.These normally sound a warning and automatically slow down the vehicle if it is exceeding the limit.However, drivers will be able to override the device simply by pushing hard on the accelerator. Motoring groups have argued that in certain situations, such as when trying to swiftly overtake a vehicle in front, speeding up could be safer.“Every year, 25,000 people lose their lives on our roads. The vast majority of these accidents are caused by human error. We can and must act to change this,” Commissioner Elżbieta Bieńkowska, responsible for the Internal Market, Industry, Entrepreneurship and SMEs, said.This can have the same impact as when safety belts were first introduced.“With the new advanced safety features that will become mandatory, we can have the same kind of impact as when the safety belts were first introduced. “Many of the new features already exist, in particular in high–end vehicles. Now we raise the safety level across the board, and pave the way for connected and automated mobility of the future.”The new mandatory safety measures also include warning of driver drowsiness and distraction (such as smartphone use while driving), intelligent speed assistance and cameras or sensors for reversing. Cars and vans will also be equipped with lane-keeping assistance and crash-test improved safety belts, while trucks and lorries will have specific requirements to improve drivers’ direct vision, and systems to detect and warn of cyclists and pedestrians, particularly while making turns. The Commission said the proposed measures are expected to help save more than 25,000 lives and avoid at least 140,000 serious injuries by 2038, contributing to the EU's long-term goal of moving close to zero fatalities and serious injuries by 2050.", "comment_count": 113, "id": 2560}, {"keywords": "", "author": "Denise Grech ", "article_body": "Around 500 people a year lose a part of their foot because of complications resulting from diabetes, academics have warned.\nOne in eight adults aged 25 to 64 suffer from diabetes, and 10,000 people are unaware they suffer from the disease.\nHaving diabetes increases risks of developing a wider range of foot issues, often starting with a small foot problem that can become more complicated over time.\nRead: Preventing foot complications in diabetes\nAround 15 to 20% of patients living with diabetes will develop a foot ulcer at some point during their lifetime.\nDuring a meeting with MEP Francis Zammit Dimech, representatives of the Diabetes Foot Research Group at the University of Malta warned around 500 people will lose a part of their foot annually because of diabetes.\nEvery 20 seconds a lower limb is amputated due to diabetes, according to the International Group on the Diabetic Foot. Over 80% of all amputations are caused by a foot ulcer and can be prevented.\nNoting several people in Malta were unaware they had diabetes, Dr Zammit Dimech called for the possibility of population-based screenings. He recommended an extensive standardised diabetes register that would facilitate the exchanged of data across the EU.\nDr Zammit Dimech reiterated his call for more investment in research, saying numbers in amputations were still relatively high.\n\"More commitment is needed to fight the silent epidemic,\" the PN MEP said.\nMajor amputations caused by diabetes fell by a third this year, according to statistics from the Health Ministry published earlier in the year.\nThe Times of Malta last year reported MEPs had raised warnings the government ignored medical practitioners’ advice on shorter free insulin needles. \nDr Zammit Dimech had said official requests by professionals for 4mm pen needles had been rejected. However, the Health Ministry had said the shorter needles could lead to incorrect dispensing if they were given to adolescents and adults instead of children. This was because the length might not be sufficient to reach the correct depth for best use of insulin, a spokesman for the ministry said.", "comment_count": 1, "id": 2561}, {"keywords": "", "author": "", "article_body": "For the third consecutive year, the University of Malta’s Institute of Digital Games has been ranked as one of the top graduate schools in the world by The Princeton Review.\nRanked in 17th spot, the institute has been constantly improving its position in these rankings and is one of the few graduate colleges to make the list from outside the US. The full lists are posted at Top Schools for Game Design 2019.\nInstitute director Georgios N. Yannakakis said it was great to see the research at the getting the attention it deserves.\n“Working with key players in the industry, such as Ubisoft, and with key research institutions in Europe, via EU funded projects, our students are able to practice their training on Artificial Intelligence on significant real world problems.\n“We’re a multi-disciplinary institute educating graduate students from philosophy and digital humanities, all the way to artificial intelligence and machine learning and aim for our students to be unique creative thinkers that can contribute to the video game industry and video game research, and the interconnections of the two,” he said.\nThe Princeton Review chose the schools for its top game design program lists this year based on a survey it conducted in 2018 of administrators at 150 institutions that offer game design courses, majors, or degree programs. Surveyed schools were in the US, Canada and Europe.\nThe survey collected information about the schools' game design programs in four areas: academics, faculty, technology, and career prospects. In all, more than 40 data points were analysed to tally the lists. The Princeton Review's reporting partner for this project, PC Gamer (a monthly magazine published by Future plc, has a feature on the ranking lists in its May issue. \nThe Princeton Review developed its “Top Game Design Schools\" project in 2009 with assistance from a national advisory board that helped design the project survey ranking list methodology. Board members included administrators and faculty from respected game design programmes, and professionals from some of the top gaming companies.\n ", "comment_count": 1, "id": 2562}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Cospicua council is among  the objectors to plans by the American  University of Malta to turn a public car park in the locality into student dormitories and accommodation.\nAccording to the new plans, submitted by architect Edwin Mintoff on behalf of the Sadeen Group, the Jordanian construction company that owns the AUM, a public car park at the back of the campus, next to the Palumbo dockyard, is set to be dug up. \nInstead, the AUM wants to build a private underground car park over which several storeys of student dormitories will be constructed. The plans include a large rooftop swimming pool.\nRepresentations made during the ongoing consultation process lamented the “takeover” of public space.\nCospicua mayor Alison Zerafa Civelli said her council would only support the project if there was a guarantee that 50% of the new 180 car park spaces would be reserved exclusively to residents, who would be able to use them free of charge. Half of the parking slots at street level should also be given to residents, she added.\nNoting that it was not against the proposed project, Ms Zerafa Civelli said her council was very concerned about the impact on the traffic flow.\n“The acute parking problem in our city is a reality that cannot be ignored,” she said, adding the council would only give  its support if specific conditions were “strictly” adhered to.\nParking problem in our city is a reality that cannot be ignored\nApart from the controversial car park, the AUM’s application includes the refurbishment of the Knights’ Building on Dock 1 and its use as part of the university, the building of a new wing covering most of the bastions in the background and the alteration of a public staircase that was built using EU funds.\nSome objectors feel height limitations for the area are not being respected, noting that the designs submitted did not match the historic surroundings, given that  this would be an extension to the  Knights’ Building.\nThis opinion is shared by the Planning Authority’s design advisory committee, which described the student accommodation building, which also sports a rooftop swimming pool, as “having a negative impact on the skyline”.\nAnnounced in 2015, the AUM project has so far struggled to take off because, despite a significant investment in the building of its Cospicua campus, the project has attracted fewer students than originally forecast.\nThe AUM was also mired in controversy, with many of its former academic staff  filing court action against the Jordanian owners, accusing them of ending their employment just days before the lapse of their contractual legal probation period.\nPrime Minister Joseph Muscat, an ardent supporter of the project, said a few weeks ago the AUM would only start building a new campus at Żonqor Point, Marsascala, once it managed to fill all its student vacancies in Cospicua. This statement is not reflected in the public contract entered into between the government and Sadeen Group.", "comment_count": 107, "id": 2563}, {"keywords": "", "author": "", "article_body": "Reżistenza said on Wednesday that the resolution approved during Tuesday’s plenary of the European Parliament was another confirmation that the malpractices adopted by Muscat’s administration were threatening the future of Maltese children.\nInternational institutions, it said, found that the country’s financial system had the characteristics of a tax haven.\nWhen dealing with such a delicate sector, reputation is of utmost importance. We are risking losing the reputation which we painstakingly built over the years in the area of financial services. \nIt called on the government to discontinue the golden passport and residency scheme with immediate effect, describing it as “an act of piracy”.\nReżistenza said it was imperative to re-establish the rule of law in Malta, the impartiality of the judiciary, decency in the way institutions functioned and that the masterminds of Daphne Caruana Galizia’s murder were identified and made to face justice without any further delay.\nSince Joseph Muscat came into power, it said, Malta became notorious as the EU’s bad boy. Dr Muscat set the narrative that by twisting established rules Malta was more cunning than its neighbours.\nHe kept perpetuating the myth that the country was becoming wealthier but he was stealing from children’s future.\n“While celebrating freedom from a foreign colonial power, we find ourselves living in the fiefdom of a feudal lord who survives by appealing to man’s worst instincts: greed and selfishness,” it said.", "comment_count": 36, "id": 2564}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta says Parliament could have as many as 12 new members as a result of proposals aimed at increasing female participation in politics. In another story, it says the European Parliament on Tuesday voted in favour of a resolution labelling Malta as having the characteristics of a tax haven.\nThe issue of female representation is also dealt with Malta Today and L-Orizzont on their front pages.\nMalta Today says the reform will lead to more women in Parliament and L-Orizzont that the number of women in Parliament have to go up to 40%.\nThe Malta Independent quotes the European Parliament saying that Malta and six other EU states display traits of a tax haven.\nIn-Nazzjon says Maltese MEPs defended Malta’s interests in Brussels.", "comment_count": 0, "id": 2565}, {"keywords": "", "author": "AFP", "article_body": "Sterling rallied yesterday on fresh hope that British Prime Minister Theresa May would avoid a chaotic no-deal Brexit, while global stock markets recovered.\nThe pound jumped as high as $1.3262 in early deals, before tempering the gains by the afternoon.\nThe European single currency fell as low as 85.25 pence on hopes of an orderly departure from the European Union on April 12.\nThe long-running saga took a fresh twist after Brexit hardliner Jacob Rees-Mogg declared on Twitter: “The choice seems to be Mrs May’s deal or no Brexit”.\nMr Rees-Mogg, head of the European Research Group of eurosceptic lawmakers and an MP for Ms May’s Conservatives, also said in a political podcast interview that “the PM will not deliver a no-deal Brexit.”\nOanda analyst Craig Erlam said it had been clear for months that “May’s strategy has been to  corner sceptics into backing  her deal”. \n“The idea that the risk of no deal or no Brexit would be enough to win enough votes may be starting to bear fruit just as parliament seeks to wrest control of the process,” he told AFP.\n“Securing the backing of a high profile ERG member like Rees-Mogg, albeit reluctantly, could dramatically improve May’s numbers. It’s now just a question of whether it’s too little too late.”\nThe remarks came one day after Britain’s Parliament seized the initiative from Ms May in a historic vote to give members of Parliament a broader say on what happens next.\n“Jacob Rees-Mogg appeared to be responsible for the pound perking up,” said Spreadex analyst Connor Campbell.\nMonday’s vote creates parliamentary time for MPs to come up with their own Brexit proposals as Britain tries to stave off a messy divorce in two weeks.\nThey will now choose whether to revoke Article 50 and cancel Brexit, hold another referendum, vote for a deal including a Customs union and single market membership, or leave the EU without a deal.\nHowever, even if they decide a majority course of action, the government is not legally bound to follow their instructions.\nMeanwhile global stocks rebounded after the previous day’s losses in many markets, though dealers nevertheless trod cautiously, still reeling from Monday’s pummelling which came on the back of a drop in benchmark 10-year Treasury bond yields below those for three-month bills for the first time since before the global financial crisis.\nThis so-called inverted yield curve shows investors are more willing to buy long-term debt, usually viewed as a higher risk, as they consider the short-term outlook more hazardous. Such a scenario has preceded several recessions in recent decades.", "comment_count": 13, "id": 2566}, {"keywords": "", "author": "Keith Micallef", "article_body": "All four workplace fatalities last year involved male construction workers who fell to their death.\nThe worrying trend, which emerged from the 2018 Occupational Health and Safety Authority annual report, comes in the wake of calls for tighter controls and safeguards in the construction industry.\nWhile the sector is booming, it is also attracting criticism on the increasing reliance of third country foreign workers and cheap labour. The state of affairs has prompted concern on the conditions these labourers are being made to work in.\nThere were 3,252 work-related injuries across all economic sectors last year that resulted in, at least, a day of sick leave. \nThough this amount was marginally higher than in 2017, the  figure translates to a lower injury rate per 1,000 workers. This seemingly contradictory trend is due to the fact that the rise in the number of workers in 2018 eclipsed the increase in accidents. \nFrom a wider perspective, the rate of 1,400 injuries per 100,000 workers recorded last year marks a continuous steady decline in injury rates since 2006.\nHowever, in terms of fatalities the situation is fluctuating with a rather irregular pattern. \nWhile in 2016 seven employees died while on duty, there was just one case the following year. Then, in 2018 the number quadrupled.\nIn its report, the OHSA noted that all four cases involved construction workers who fell from a height, including three foreigners. \nTwo of the victims were self-employed and two were engaged with a small contracting company.\nDuring 2018, the health and safety watchdog handled 1,858 building site notifications, which involved work lasting longer than 30 days on which more than  20 workers were simultaneously on site.\nIt said this sector relied on low-skilled, migrant workers, with most contractors being involved on multiple projects at the same time. \nThe OHSA blamed the legal interpretation given to the term “construction” for the recruitment of part-timers, self-employed or others whose registered occupation with JobsPlus was different.", "comment_count": 12, "id": 2567}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Former Gozo Minister and Labour MP Anton Refalo has fired a new public broadside against his successor, Justyne Caruana, for placing ‘fibre’ monuments in the centre of Gozo’s capital, Victoria.\nDr Refalo, currently the government-appointed chairman of Heritage Malta, called the recent unveiling of a monument dedicated to sculptor Wistin Camilleri by Dr Caruana as “shameful” and “degrading”. Resorting to his social media page, the ex-Labour heavyweight said that it was “shameful” that the Gozo capital now had monuments made out of fibreglass.\n\nWhile showering sculptor Camilleri with praise for his outstanding career, he said that a bronze monument should be commissioned in respect to this outstanding artist and not use cheap material such as fibreglass to be placed right in the centre of Gozo’s capital.\nMany of Dr Refalo’s ardent supporters joined in, writing critical comments of “the authorities” for this decision.\nSources close to the Gozo Ministry said that although they respect the former minister’s ‘expertise’ in the subject, his comments were “uncalled for” as the monument unveiled by  Dr Caruana was not a ‘new’ monument as described by the former minister.\n“The monument of sculptor Camilleri has been in place at a school in Għajnsielem since 2009 and remained there even during the time when Mr Refalo was Gozo Minister,” the sources said.\nAll that was done was to relocate the same monument\n“All that was done was to relocate the same monument to a central place near Villa Rundle in Victoria. We cannot understand why it was only now that Dr Refalo found fault with this monument as it was originally made of fibre.”\nIt is a known fact among Gozitans and observers of the local political scene that there is no love lost between Dr Refalo and Dr Caruana.\nAppointed Labour’s first Gozo Minister in 2013, on the party’s  return to power, Dr Refalo was replaced by Dr Caruana in 2017, despite getting more votes than her.\nUpon her appointment, one of the first decisions taken by Dr Caruana was to order a stop to the building of a new Gozo Court House, one of the major projects Dr Refalo was working on, ordering a complete change of the original designs and also changing its location.\nThrough the unexpected decision, the project has still not seen the light of day.\nAlthough following his replacement, Dr Refalo was visibly detached from the party and made it a point not to attend Labour activities, he recently mellowed his resistance. \nHis appointment as chairman of Heritage Malta by Prime Minister Joseph Muscat helped his reintegration in government affairs.", "comment_count": 10, "id": 2568}, {"keywords": "", "author": "", "article_body": "A large site in Iklin that hosts tarmac batching plants and private bitumen storage facilities is being used by the government’s waste management company as a storage facility for electronic waste.\nSources close to Wasteserv, which falls under the responsibility of Environment Minister José Hererra, said that the government has rented out storage space at Bitmac Ltd to store electronic waste from civic amenity sites.\nA €1 million contract was awarded to Bitmac Ltd without a call for tender. Bitmac is owned by three major companies involved in road construction.\n“It is very odd that such waste is to be stored on site of a batching plant with all the possible vulnerabilities that such a site offers,” sources said.\n“Large storage tanks of flammable bitumen are located on this site. Although an incident related to electronic waste is not common, one would not recommend storing such waste in an area where tarmac and bitumen are held,” they added.\nREAD: Overflowing civic amenity sites\nNo Planning Authority permit has been issued yet, but Wasteserv has already started transferring fridges, freezers and all kinds of electronic waste from its bulging civic amenity sites.\n“Truckloads of electronic waste are being dumped in the site without a plan. Another dumping site, far from people’s view, is being created,” the sources said.\nAsked to state if this operation is covered by permits, a spokesman for Wasteserv said that an environmental permit was issued by ERA but he refrained from giving details on the necessary planning permit.\nAccording to Wasteserv, the facility at Iklin will only be use for three years, until a Multi-Material Recovery Facility in Ħal-Far is built.\nThe latter facility has been in the pipeline for a number of year. Its aim is to act as a holding house for material earmarked for recycling.\n“Since it is expected that the new Ħal-Far facility will take two to three years to be completed, Wasteserv leased premises in the interim from the private sector through a negotiated procedure,” the spokesman said to justify the rental of the Bitmac batching plant premises.\nFollowing questions on this issue by Nationalist Party MP Chris Said, Dr Herrera told Parliament that the new storage facility was hired from V&C Contractors for €318,000 a year for the next three years.\nWasteserv has been under pressure as its civic amenity sites were transformed into heaps of uncontrolled waste due to mismanagement and lack of exports.\nThe mayor of Iklin has requested a meeting with Dr Herrera to discuss the matter.\n ", "comment_count": 26, "id": 2569}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man is being held behind bars after being accused of assaulting his father in an argument over money.  \nThe 33-year old Zejtun man was taken to court under arrest and accused of  having attacked and threatened his father, caused damage to his parents’ property, breached the peace, breached bail conditions and breached the conditions of a suspended sentence.\nDefence lawyer Martin Fenech was critical of a “high risk” assessment of the case made by support agency, Appoġġ, pointing out such assessments invariably classified domestic violence cases as “high risk” thus leading to arrests even in minor cases.\n“Suddenly everyone is high risk,” the lawyer remarked, adding that this practice was “rampant.”\nProsecuting Inspector Roderick Attard explained that the decision to arrest the man had been taken after the father had spoken to the police.\nNo injuries had been reported, said the inspector.\nIn submissions for bail, Dr Fenech argued that this had been a family argument. There was no fighting and nobody was injured at the end of the day, he said. \nThe lawyer further requested the court to provide the accused with the necessary assistance to tackle drink-related problems, adding that the man would take up residence with another relative should he be released from custody.\nMagistrate Caroline Farrugia Frendo, turned down the request for bail .after noting objections by the prosecution arguing that the man’s criminal record reflected his unruly character, further evidenced by earlier prosecution over similar charges.", "comment_count": 0, "id": 2570}, {"keywords": "", "author": "", "article_body": "A foreign man was arrested in Malta on Tuesday in “Operation Webmaster” an operation carried out simultaneously in 14 countries focused on funds derived from organised crime.\nThe operation was coordinated by Eurojust and Europol.\nThe Malta police said the arrest in Malta was carried out on the strength of a European Arrest Warrant and involved the police Intelligence Unit, the Economic Crimes Unit, the Vice Squad, the International Relations Unit and the Special Intervention Unit.\nFurther searches are underway.\nNo details were given about the arrested man other than that he will be taken to court in the coming days.\nOne News reported however that the arrested man is a 44-year-old Finn who was arrested for alleged money laundering. He is suspected to head a gang responsible for crimes in different parts of Europe. The arrest was made in Swieqi. ", "comment_count": 11, "id": 2571}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two men facing the prospects of a mandatory jail term over drug-related charges were handed a suspended sentence since the court was satisfied, in terms of recent legal amendments, that the offences were mainly attributable to their drug dependence.\nJason Abela, 47, and Denis Borg, 40, had been facing separate criminal proceedings over aggravated drug possession and trafficking with both cases stemming from events which had taken place several years ago.\nMr Abela had been arrested in 2002 after surveillance led to suspicion that he was trafficking heroin. Mr Borg had been arrested at the wheel of his car at Mrieħel in 2007, in possession of a pouch containing some €2,580 in cash and a transparent plastic bag with several sachets bearing a whitish powder, later certified as 25% pure cocaine.\nBoth men had confessed to a drug addiction at the time the events took place.\nOn the basis of all evidence, the court, presided over by magistrate Neville Camilleri, assigned both cases in 2015, concluded that the prosecution had proved its cases, declaring both accused guilty as charged.\nHowever, when meting out punishment, the court took note of various factors such as the time since the offences took place, the fact that both accused had no other pending lawsuits as well as the favourable social inquiry reports in their regard.\n“Jason has proved beyond any doubt that his drug addiction problem is way past him. It is now time for him to move forward and severe all lingering ties with his past, mainly through the court case and his attendance at Sedqa” had confirmed the Drug Offenders Rehabilitation Board.\nAs for Mr Borg, the board noted that the accused had “completed and graduated from the Caritas New Hope programme and kept attending aftercare sessions afterwards. At this point it is suggested that Mr Borg can be released from our services since he is fully rehabilitated within society and contributing wholly as a law abiding citizen.”\nIn the light of such recommendations and on the strength of the Drug Dependence (Treatment not Imprisonment) Act, the court concluded that there was enough evidence to show, on a balance of probabilities, that the offences had been mainly attributable to the accused’s drug dependence.\nFor this reason, the court could refrain from giving a mandatory prison sentence, handing down Mr Abela a 12-month jail term suspended for two years and a €500 fine, while condemning Mr Borg to a 16-month jail term suspended for three years and a €1000 fine.\nLawyer Joe Giglio, defence counsel to both men, hailed the decisions as \"landmark judgments.\"\nPolice Inspectors Norbert Ciappara, Malcolm Bondin and Frank Anthony Tabone prosecuted.", "comment_count": 0, "id": 2572}, {"keywords": "", "author": "", "article_body": "Identity Malta will kick start the process to have all passports and e-ID cards replaced with technologically advanced new e-ID cards and e-passports by the end of 2019.\nIn her address to the Reconnaissance High Security Printing Conference being held in Malta, Parliamentary Secretary for Citizenship Julia Farrugia Portelli said the new designs and specifications were being finalised.\nThe ID document will incorporate all features laid down in the EU proposal to strengthen identity card security and, unless there are any radical changes to the draft regulation, Malta plans to be among the first member states to start rolling out the new documents later this year.\nThe new travel and identification documents will be printed on a polycarbonate card using high definition laser technology. Furthermore, the new e-ID card will incorporate a contactless chip in order to capture additional biometric data. Additional security features will further prevent document counterfeit and the fraudulent use of other people’s identity.\nContrary to the 2014 nationwide mass roll out, the issuance of the new e-passport and e-ID is set to take place in gradual manner and over a number of years. Existing ID cards and passports will remain valid and fit for purpose until their expiry date. Upon renewal, Identity Malta Agency will then issue the new travel or identification document at no additional cost.", "comment_count": 8, "id": 2573}, {"keywords": "", "author": "", "article_body": "Updated at 5.27pm \nThe Ornis committee has voted down a proposal by hunters to lift a moratorium on the hunting of turtle doves in spring.The government’s consultative committee - made up of conservationists, hunters and regulators - met on Tuesday and decided against a proposal by the hunter’s lobby, FKNK, to open a turtle dove hunting season after a two-year ban.The Ornis Committee said in a statement that while the FKNK had voted in favour of its own proposal, BirdLife Malta and Environment and Resources Authority (ERA) representatives had voted against, with the chairman and three government appointees abstaining.Nevertheless, the committee recommended that the government immediately open discussions with the European Commission “for a long-term solution to be reached on the matter”, another of FKNK’s proposals. The hunters’ lobby had argued in a report submitted to the government and Opposition earlier this month that Malta was the only EU member state, out of 10 where turtle dove is hunted, which had imposed such a moratorium.\n\n\n\nIt also argued that Malta was the only state with a European Court of Justice verdict, dating back to September 2009, stating that the autumn season was not a satisfactory alternative to spring hunting.A vote in the Ornis Committee on recommending discussions with the EU was carried with the support of the FKNK, the chairman and the three government appointees.The moratorium on hunting turtle dove, a protected species environmentalists and EU lawmakers are adamant should be off-limits, was enforced by the government in 2017 after the Commission threatened legal action against if the practice was allowed to continue.For the past two years, hunters have only been allowed to hunt quail in spring.\nTurtle doves are considered a “near threatened” species across the EU as population numbers have been steadily decreasing since the 1980s.Environmentalists argue that, although technically illegal since 2017, turtle dove hunting has continued unabated since then, with the legal quail hunting season used as a smokescreen.\nGovernment and Birdlife react\nIn a statement, the government said that it would holding talks in Brussels to determine the principles upon which any eventual future derogations  on turtle dove would be applied. \n\"We remain committed to preserving Maltese cultural practices while respecting regulations and sustainability,\" the government said. \nBirdlife, on the other hand, argued that the Ornis vote was an indication that spring hunting should be phased out completely. \n\"Be bold,\" the NGO urged the government and prime minister, \"and take this signal either as a reason for spring hunting to be abolished altogether or, if a quail hunting season is still to be opened as recommended by Ornis last week, this should not extend further than mid-April to avoid the peak migration of turtle dove.\"\n ", "comment_count": 11, "id": 2574}, {"keywords": "", "author": "Ivan Martin", "article_body": "Parliament will grow by as much as 12 seats under proposals aimed at increasing female participation in politics.\nA public consultation document on the “under-represented sex” was launched on Tuesday, and puts forward a number of proposed changes aimed at promoting gender equality. \nMalta has a problem with women in politics \nAddressing a press conference to launch the consultation, Prime Minister Joseph Muscat said the reform would define who we wanted to be as a country.\nHe compared the proposed reform to when voting rights were extended to all men, to when women who knew how to read and write were eventually given the right to vote, and when that right was later extended to all women.  \nThe reform was not a quota, he said, adding that no one would be forced to vacate their seat to make way for anyone else.\nMuscat supports gender quotas \n\"These extra seats will not take the place of anyone elected by the people. What's more, they will all be elected by the people,\" he said, adding that the whole country would benefit from equal gender representation.  \nThinking behind the reform\nProf. Carmen Sammut, who chairs the technical committee behind the reform, explained that the proposals were not targeted only at women, but on the gender which was under-represented in Parliament.\nThe package of laws aims at achieving a critical mass of 33% of women in the House.\nThe scope of this corrective mechanism was for both sexes to reach at least 40 per cent of the seats in the House.\nThe gender with less than 40 per cent of the seat would be able to garner a maximum of a further 12 seats - shared equally across the political parties in the House, with six going to the government and six to the Opposition.\nRead: Head of new Democracy Committee promises more consultation\nThis, she said, would have no bearing on the difference in seats between the two parties.\nIf after a number of years, men became under-represented, then they would benefit from the same mechanism.\nThere were sectors, Prof. Sammut added, where women once lagged behind and were today on the front foot.\n'Hanging candidates'\nProf. Sammut explained that “hanging candidates” which had still been in the running but were never elected as all seats had already been filled, would be the first to be considered for these additional seats.\nThe wasted votes of hanging candidates from the over-represented sex who were not elected, would be utilized to elect a candidate from the under-represented sex.\n\nThese would be used to fill the extra 12 seats created by this proposed gender corrective mechanism.\nAlso, the wasted votes of hanging candidates of either sex which were eventually elected through a casual election, would also be used to elect candidates of the under-represented sex.\nThe proposals included a \"sunset clause\" that would see this reform potentially halted if there was no longer any need for it, but this would only be possible after 20 years.\nFamily-friendly measures, and state funding for political parties\nThe second proposal being put forward is for further family-friendly measures and gender mainstreaming in the House.\nThis would include sensitivity training for all members of Parliament, family-friendly working hours, and anti-discrimination measures, among other reforms.\nThis proposal also seeks to have the Speaker of the House set up a commission that would pave the way for these amendments.\nThe third proposals is for incentives in the form of state funding for political parties in order to ensure recruitment, training, and support for candidates from the under-represented sex.\nThe fourth and final proposal was for the electoral commission’s remit to be extended to include gender audits of political parties. These audits would evaluate initiatives and measures taken by the parties.\nReforms Parliamentary Secretary Julia Farrugia Portelli said that as a mother and a women, she wanted to see more women involved in politics.\nA building which had cost the taxpayer so much money, should be truly representative of both genders, she said.\nNaysayers will doubtless object - Muscat\nMeanwhile, Dr Muscat said that while he was certain some naysayers would object to the proposed reforms, these would be the same \"nos\" that had object to many other rights which we today took for granted. \nThe consultation, document, he said, had the unanimous backing of Cabinet and of the Parliamentary group.\nWhile the government looked forward to consulting with stakeholders, it would not be the one to stall this reform, he said. ", "comment_count": 127, "id": 2575}, {"keywords": "", "author": "", "article_body": "Just a week after a €32.4 million cocaine haul, Customs officers found 51.6kg of cocaine hidden in reefer containers at Malta Freeport on Tuesday.During routine screening of containers transiting Malta, seven containers with a high-risk route were selected for scanning by the Container Monitoring Unit, the Customs Department said. \nFollowing preliminary scans, two reefer container had irregularities which pointed to possible narcotics hidden behind panelling. Physical searches revealed 20 packets of cocaine, weighing 24kgs and worth approximately €2.7 million in one of the containers.  The second contained 23 packets of cocaine, weighing 27.6kgs worth €3.1 million.Both containers were loaded with fruit and had come from South America en-route to Albania.The case was handed over to the Police Anti Drug Squad, who are conducting investigations.\nThe duty magistrate is leading an inquiry assisted by a team of experts from the Police Forensics Unit. ", "comment_count": 19, "id": 2576}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Former Opposition leader Simon Busuttil’s right to defend his personal reputation has been vindicated by way of three judgments confirming €5,000 in damages won in three libel suits filed against the Labour Party media.\nA total of five suits had originally been instituted against it-Torċa, l-Orizzont as well as the PL TV station over a series of publications alleging that Dr Busuttil had attempted to obtain “damning evidence” from the Gaffarena family to use against former PN Minister John Dalli.The allegations said Dr Busuttil had met Joseph and his son Marco Gaffarena before the 2013 general election at the PN headquarters and demanded Daewoo papers in return for the granting of a petrol station permit, which the Gaffarena family had long been struggling to obtain.\nThe story first made its appearance on it-Torċa on August 2, 2015 with later related articles published on l-Orizzont and PL One News and One TV, alleging that Dr Busuttil, then PN Vice President, had allegedly attempted to bribe them in a bid to get at Mr Dalli.Josef Caruana, then editor of l-Orizzont, had allegedly based his story on information supplied by an anonymous source which was subsequently confirmed by Joseph Gaffarena when contacted by the paper.\nThe said meeting had allegedly been set up by former PN Minister Joseph Cassar who, when testifying in the course of the ensuing libel proceedings, had totally contradicted the version supplied by the Gaffarenas, his testimony being defined as “consistent” by the Magistrates’ Court.\nFollowing the five judgments, awarding a total of €7,000 in libel damages in favour of Dr Busuttil, three of those were appealed by Mr Josef Caruana, as former editor of l-Orizzont.\nWhen handing down judgment, the court of appeal, presided over by Mr Justice Anthony Ellul, concluded that Joseph Gaffarena’s version, fed to the PL media, had been nothing but “a complete setup” which l-Orizzont and it-Torċa had taken up as the “absolute truth,” without bothering to undertake any serious investigation to confirm the truth behind the allegations.\n“It was evident that there had been nothing except for a brief phone call by [Mr Caruana] to Gaffarena,” the court observed, adding that the former journalist and editor could not shy away from responsibility for the articles penned.\nNo evidence had been put forward to prove that the PL media had any some way attempted to contact Dr Cassar to confirm the allegations before publishing the story, the court said.\nNor was there evidence of any written questions sent by the newspaper to Dr Busuttil before the story went public, the court went on, declaring that it had no doubt that the articles at issue had intended to convey a clear message, namely that Dr Busuttil had met Mr Gaffarena, had requested documents needed as “damning evidence” against Mr Dalli and this in exchange for the petrol station permit.\nSuch a message, directly targeting the then Opposition Leader and thus a “very high profile political figure” were “in the public interest” and had been evidently taken up by a wide readership base.\nYet on the basis of all evidence put forward, the court found no reasons to depart from the conclusions reached by the Magistrates’ Court, declaring Joseph Gaffarena’s version as lacking in credibility and remarking upon his “negative and arrogant” stance at the witness stand, which defeated his own version of events.\n“I’ll die for [Labour],” the witness had declared, casting doubt upon the credibility of his story and even admitting under cross-examination that he had been “angry” when allegedly meeting Dr Busuttil.\nIn fact, it was evident that Mr Gaffarena harboured a “grudge” against Dr Busuttil who, at the time, had been directing harsh criticism against the PL, regularly mentioning the Gaffarena family over their Qormi petrol station permit and their involvement in the Old Mint Street property saga, the court observed.\nThe Gaffarena story had been pounced upon by the Labour Party media to strike back at Dr Busuttil, without however bothering to undertake any “serious fact checking exercise” and instead totally endorsing the Gaffarenas’ version.\nA person like Mr Caruana, with great experience in journalism, “ought to have proceeded with much greater caution,” the court observed, noting that the journalist and editor had failed to adopt “a professional and diligent approach” to check out the truth of the source.\nA phone call merely lasting minutes could never replace “professional and diligent research,” the court said, pointing out that the journalist ought to have smelt a rat “from the outset,” but had even failed to bother to confirm the story with Joseph Gaffarena’s own son, Marco, who had allegedly accompanied his father to the PN Headquarters.\nThe court dismissed the three appeals, confirming the €5,000 damages award in favour of Dr Busuttil, noting that “a good reputation was essential in political life as well as for one’s own personal dignity,” concluding that libel proceedings were intended to vindicate a person wrongly defamed and also to serve as deterrent against future defamatory declarations.\nLawyer Peter Fenech was counsel to Dr Busuttil.", "comment_count": 0, "id": 2577}, {"keywords": "", "author": "", "article_body": "Voter registration period should be extended by at least two weeks following an educational campaign and the correction of false information on the Electoral Commission website, Partit Demokratiku said.\nIt said in a statement said that following pressure from PD, the Electoral Office updated one of several webpages with the relevant information - but only the MEP election site was showing the correct information.\nThe Frequently Asked Questions excluded mentioning that citizens could register to vote by sending in the relevant form via post, or by handing it in to their local council or police station, as stipulated by law.\nPD pointed out that the Electoral Office in Valletta, with restricted opening hours, was surrounded by very limited infrastructure, such as parking facilities. This put people off from going there to register to vote, and many EU nationals said they would need half a day off work to be able to sort it out, which many would find difficulty in doing.\nMEP candidate Camilla Appelgren said EU citizens should be able to register to vote in an easy manner but many who went to councils after the recent update on Electoral Office webpage were denied this service.\n“Partit Demokratiku finds this situation worrying. Citizens and long term residents have ended up having to fight for their basic rights, and it is for this reason that Partit Demokratiku is asking for the extension of the voter registration period, which should be a matter of concern up to the highest levels of European democracy,\" it said.", "comment_count": 7, "id": 2578}, {"keywords": "", "author": "Jacob Borg", "article_body": "The European Parliament on Tuesday voted in favour of a resolution labelling Malta as having the characteristics of a tax haven.\nA report by the EP’s Tax3 committee named and shamed seven countries, including Malta, as having levels of foreign direct investment (FDI) that could only be explained to a limited extent by real economic activities taking place within these countries.\nThe Tax3 report on financial crimes, tax evasion and tax avoidance received majority support from the EP, with 505 MEPs voting in favour and 63 against.\nMalta has long been criticised for allowing foreign-owned companies to shift their profits to the island to benefit from lower taxes.\nThe report highlights how the high share of FDI in Malta, Luxembourg, Cyprus, the Netherlands and Ireland in particular is usually attributable to special purpose entities.\nTuesday’s vote calls on the European Commission to carry out “fitness checks” of relevant laws and policy initiatives aimed at addressing the use of letterbox companies in the context of tax fraud, tax evasion, aggressive tax planning and money laundering.\nThe vote agrees with calls by the European Commission to introduce a common corporate tax base across the EU.\nRead: Malta a fiscal black hole, says Oxfam\nReacting to Tuesday’s vote, Oxfam said it was good to see the EP recognise the role such countries play in helping corporations shift profits and dodge profits.\n“The EU is part of the problem. It must put its own house in order by clamping down on tax havens in Europe,” Oxfam said.\nSuccessive PN and Labour administrations have shunned the tax haven label. Finance Minister Edward Scicluna has repeatedly insisted that Malta is a cooperative jurisdiction that exchanges tax information with its foreign counterparts.\nMEPs also approved calls to remove the veto on tax issues, instead moving to a system where votes in Council on tax matters are taken by qualified majority.\nThe European Commission said in January that unanimity often could not be achieved on crucial tax initiatives, leading to costly delays and sub-optimal policies.\nDuring a debate about the Tax3 report on Monday, MEPs Alfred Sant and David Casa both spoke against harmonisation. Dr Sant argued that pushing towards tax harmonisation disregarded the fact that tax flexibility was the only remaining competitive tool for small peripheral economics in the single market. Mr Casa said he could not accept proposals that would limit national sovereignty on taxation.\nWhat does this mean for Malta? Apart from the bad publicity, Tuesday’s vote will probably not have many consequences for Malta in the short term.\nThe European Parliament’s and European Commission’s mandates come to an end in May. It remains to be seen whether the momentum for tax reforms will carry over into the next legislature.\nRemoving the veto on tax matters would require the unanimous approval of all EU countries.\nIn the longer run, the vote continues to add pressure on Malta to voluntarily bring its corporate tax system in line with accepted EU norms.\nThe high rate of foreign financial flows into Malta identified in the Tax3 report has knock-on implications for the country’s fight against money laundering.\nA national money-laundering risk assessment found that Malta’s large financial sector was one of the biggest drivers of the island’s high threat from the laundering of foreign proceeds of crime.\nThe Sunday Times of Malta reported that Malta’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation.", "comment_count": 92, "id": 2579}, {"keywords": "", "author": "", "article_body": "The European Parliament is forcing member states to take action to abolish the seasonal time change.\nA large majority on Tuesday voted in favour of the Transport and Tourism’s proposal to abolish the seasonal clock change in 2021.\nIt is up to member states to choose between summer or standard time. Those choosing summer time should do the switch on the last Sunday in March 2021. Countries that prefer to keep the standard time may do so from the last Sunday in October 2021.\n“We have done our work, now it is up to the member states to find a common approach to this issue as quickly as possible. Citizens are telling us that they are tired of changing time twice a year, they no longer want to confuse their biorhythms. We have to take this very seriously - especially the warnings from doctors about health hazards caused by the bi-annual time change,” Czech MEP Pavel Svoboda, responsible for the issue on behalf of the EPP Group, said.\n“It is widely known that the introduction of the time change years ago did not lead to the expected benefits, such as energy savings. On the contrary, there are indications that it has been detrimental to human health. The EPP Group therefore urges the member states to agree to abolish the seasonal clock change in 2021,\" Mr Svoboda added.\nRead: Maltese want to keep summer time all year round, survey shows\nAccording to the outcome of Tuesday's vote, member states should notify the European Commission by April 1, 2020 at the latest if they intended to change their standard time.\nBefore that, a coordination mechanism would be installed to ensure that member states make their decision in a coordinated and concerted manner. It would consist of one representative for each state and one of the Commission.\n“If we coordinate, we can find a good solution for all member states. The aim must be to avoid significant disruptions in the functioning of the internal market because of time differences, for example with timetables in the transport sector or flight schedules for airlines,” Mr Svoboda stated.\nShould significant problems arise because of the time arrangements notified by member states, the European Commission is empowered to trigger a 12-month delay of the legislation to change it to deal with the problems.\nIn an online consultation by the European Commission last year, more than 80% of the participants expressed their support for abolishing seasonal clock change.", "comment_count": 58, "id": 2580}, {"keywords": "", "author": "", "article_body": "A 50-year-old motorcyclist was grievously injured in a traffic accident in Luqa on Tuesday.\nThe accident happened in Triq l-Avjazzjoni at 9.45am.\nThe police said a 27-year-old man from Attard was driving a Fordson van when he crashed into the traffic lights. To try to avoid the pole, the motorcyclist lost control of his Honda CB600.\nHe was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2581}, {"keywords": "", "author": "", "article_body": "The Opposition has called on the government to take immediate action to restore the country's reputation in light of the preliminary findings of the MoneyVal report commissioned by the Council of Europe.\nThe Committee of Experts on the Evaluation of Anti-Money Laundering Measures and the Financing of Terrorism, known as Moneyval, gave Malta’s anti-money laundering regime a poor grade in an evaluation.In a statement, finance spokesman Mario de Marco said the government should start by acknowledging the problem it had created and then act to restore Malta's good name.\nFailure to do so would reduce Malta's attractiveness for foreign direct investment, and damage existing business sectors which sustained the livelihoods of thousands of Maltese families.\nIt was high time that tangible action was taken, the PN said, adding that the fact that Tourism Minister Konrad Mizzi still held a cabinet position was bad enough. The fact that he was now being touted to enter the leadership race as a potential Prime Minister did not augur well for the country, it warned. \"This administration needs to start thinking about the future. Failure to do so would rock Malta's economic future and the burden would be borne by the nation as a whole irrespective of one's political beliefs and affiliations,\" the statement continued.\nThe Opposition was duty bound to speak in the interest of future generations, who were not part of today's decision-making but who would suffer the consequences, Dr de Marco said.He added that in the face of yet another damning certificate on his handling of his ministerial portfolio, Finance Minister Edward Scicluna should walk the talk and take the natural decision one would expect in a democratic country where politicians assumed responsibility for their actions or inactions.", "comment_count": 32, "id": 2582}, {"keywords": "", "author": "Keith Micallef", "article_body": "Adoptions in 2018 reached a 10-year high, with 54 successful applications mostly from foreign countries, Social Policy Minister Michael Falzon announced.\nProspective parents applying for inter-country adoptions benefitted from a €10,000 government grant to cover part of the expenses.\nThe issue was on the agenda of a news conference on Tuesday, marking the launch of a national adoption strategy for public consultation. The document is based on 25 recommendations which are planned to be implemented by 2022.\nSocial Policy Minister Michael Falzon noted that the objective of this initiative was to facilitate adoptions while ensuring the best interest of children, which he stressed, must never be treated like commodities.\nDr Falzon noted that the government had recently concluded an agreement which would pave the way for adoptions from Bulgaria, while talks were being held with Moldova.\nAsked about adoptions from Russia, the minister acknowledged that the number of successful applications had dropped dramatically in from 2017 onwards as a result of the government’s decision to allow adoptions by same-sex couples.\nDr Falzon noted that talks with the Russian authorities were underway to resolve the matter, which he said was down to Russia’s different adoption laws.\nAs for local adoptions (involving parents living in Malta), he said a major stumbling block was that applications could only be considered if the prospective parents had been fostering the child for at least 10 years. This period was being reduced to five years, and in exceptional cases a court could waive this period completely, he added. The proposals are currently being debated in parliament.\nSubmissions for this public consultations document which can be downloaded from www.konsutazzjoni.gov.mt can be made until May 3.", "comment_count": 0, "id": 2583}, {"keywords": "", "author": "", "article_body": "“We are in uncharted territory,” Prime Minister Joseph Muscat told the House of Representatives on Monday when briefing MPs about a European Council summit held recently on Brexit.\nRepresentatives were told that the United Kingdom would be exiting the EU with no deal on April 12 if the House of Commons did not manage to agree on an alternative by the 11th of that month.\nIf UK Prime Minister Theresa May managed to obtain the Commons’ support for her deal before the 11th, the UK would have until May 23 to exit the European Union. \nRead: Parliament support 'not sufficient' for third Brexit vote - May\nThe European Council’s group of 27 member states had decided to proffer these two deadlines so as to ensure that the final decision on Brexit was taken by the United Kingdom, and not by the European Union, Dr Muscat said. \n“The deadlines also sent the message that it was time for decisions to be taken,” he added.\nDr Muscat said work was underway to modify a legal notice intended to permit the Electoral Commission to remove British citizens, who would no longer be EU citizens after the original Brexit date of March 29, from the electoral register ahead of the European Parliament elections in May. \n“Efforts were underway to prepare for all possible scenarios,” he said.\n“Malta’s plans for a no-deal Brexit had been described by the European Commission as “excellent,” and were among the most generous to UK citizens,” Dr Muscat added.\nOpposition leader Adrian Delia criticised the fact that small businesses had been left in the dark about the consequences of either a no-deal Brexit or Brexit following the Commons’ endorsement of Ms May’s deal. \nRead: UK government has 300 no-deal Brexit contingency plans\nOne concern was the effect that a no-deal Brexit would have on promises of sale in effect between Maltese sellers and British buyers, he said. \nDr Delia asked Dr Muscat to explain whether Malta’s position on tax harmonisation would be weakened within the EU following Brexit, as the UK had consistently supported Malta’s position against harmonisation.\nReferring to reports that Malta had “failed” a Moneyval assessment carried out last November, Dr Delia said that, should Malta fail to rectify its position in time, it would be blacklisted. \n“The consequences of this would be job losses in one of our country’s best-paying sectors,” he said.", "comment_count": 2, "id": 2584}, {"keywords": "", "author": "", "article_body": "A two-year-old boy has been transferred to Mater Dei from the Gozo Hospital after injuries sustained in an accident took a turn for the worse. \nThe accident occurred on Monday at Triq ix-Xlendi, Munxar, at 2.45pm.\nThe boy was in a Hyundai Accent that was being driven by a 47-year-old woman from Munxar. The woman lost control of the car and crashed into an electricity pole.\nAn ambulance took both to hospital, where the woman was certified to be uninjured and the boy to be suffering from slight injuries.\nBut his condition later took a turn for the worse and he was transferred to Mater Dei Hospital by helicopter.\nAn inquiry is being held.\nThe police are investigating.", "comment_count": 0, "id": 2585}, {"keywords": "", "author": "Denise Grech ", "article_body": "Six protected birds have been found shot since March, despite the hunting season being closed, Birdlife said.\nThe Ornis Committee last week recommended the opening of the spring hunt for quail between April 10 and 30. A decision on turtle doves is expected shortly. Spring hunting in 2018 was allowed between April 1 and 21.\nBirdlife said three protected birds had been found dead in the first week of March. A common kestrel was recovered from Baħar iċ-Ċagħaq on March 6 while two black-headed gulls were recovered from Salina two days earlier.\nAll three were found dead and the vet confirmed they had been shot.\nBirdlife also said that over the first weekend of spring, it was called to recover three further injured birds - a male kestrel, a marsh harrier and a Scopoli’s shearwater - which were confirmed shot by the government vet.\n\nThe male kestrel had sustained a gunshot injury to its left wing, while the female harrier had a broken right wing. The shearwater was found among boats in the sea. \n\"It was clear that the bird was shot out at sea but despite its grievous injury – a completely blasted right wing – managed to swim into the bay from where it was rescued,\" Birdlife said.\nThe illegalities come as hunters push for permission to shoot the turtle dove - a protected species environmentalists and lawmakers insist should be off-limits.", "comment_count": 23, "id": 2586}, {"keywords": "", "author": "", "article_body": "A consortium of media houses which includes the Times of Malta has been shortlisted for the European Press Prize 2019.\nForbidden Stories is a non-profit project founded by Freedom Voices Network. Spearheaded by Laurent Richard, the team behind the network featured in The Guardian (UK), La Repubblica (Italy), Times of Malta, Le Monde (France), OCCRP (global), France 2, radio France, IRPI, Süddeutsche Zeitung (Germany), Die Zeit (Germany), Reuters (international) and NDR (Germany).\nForbidden Voices’s mission is to continue and publish the work of other journalists facing threats, prison, or murder – which included that of the assassinated Maltese journalist Daphne Caruana Galizia.\nRead: Caruana Galizia's stories to be continued as international media houses study 750,000 files\nIn March 2018, Forbidden Stories had received the “Journalism Project of the Year Grand Prize” at the French Annual Journalism Summit.\nHundreds of journalists from all across Europe sent in their best work for the European Press Prize, with 23 stories from 17 different countries shortlisted.\nThe European Press Prize is awarded in four categories: Distinguished Reporting, Innovation, Opinion and Investigative Reporting. Forbidden Stories was nominated in the Innovation category.\nThe judges award a Special Award for excellent journalism to one striking entry which defies categories and disciplines. Each award is worth €10,000.", "comment_count": 3, "id": 2587}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Some 500 endemic killifish bużaqq will be reintroduced to Il-Magħluq marshland in Marsascala to bolster the endangered population as authorities begin works to improve the unique habitats at the site. \nIl-Magħluq, a protected Natura 2000 site, is one of only two saline marshlands in the south of Malta and currently the only habitat of the Maltese killifish sub-species. \nRead: Il-Magħluq dredging set to go ahead\nThe killifish, the only local fish that lives in brackish water, has been declining in numbers at Il-Magħluq due to litter, predators and poor water quality, leading environment agency Ambjent Malta to begin efforts to improve circulation by dredging silt and other material from the site.\nNature Trust director Vincent Attard, whose organisation collaborates on the management of the site, explained that the killifish population at Il-Magħluq had disappeared in the 1990s due to pollution, and was reintroduced from Il-Ballut in Marsaxlokk.\nHowever, the Marsaxlokk population died out shortly afterwards, while the one at Il-Magħluq had dwindled once more. \nMr Attard said a breeding programme, which had started with just five pairs, had now produced some 500 fish, which would slowly be reintroduced to the Marsascala marshland, and eventually the one in Marsaxlokk.\nBreeding programme produces some 500 fish\nAlexander Borg Galea from Ambjent Malta said the agency was currently applying for EU funding to carry out dredging, for which planning permits are already in hand, to upgrade the site. \nSilt and other material accumulated from the connecting valley system and the adjacent roads had impacted water circulation and the killifish population by drastically reducing the amount of oxygen in the water.\nDumping of rubbish ‒ as well as live ducks being brought to the site ‒ had also had a negative impact on the closed ecological system, he said. \n\nThe dredging works themselves will be carried out in such a way as to minimise the impact on the fish, avoiding the breeding season, which runs from April to June. The works will also come as a relief to nearby Marsascala residents and the local council, which has for years called for Il-Magħluq to be given attention to remedy the bad odours and general state of neglect. \nDuring a visit by Environment Minister José Herrera on Monday, authorities said the site would be equipped with CCTV cameras to cut down on dumping, while discussions are also underway for it to be included on hop-on-hop-off bus routes, promoting the site as an ecotourism stop-off.", "comment_count": 15, "id": 2588}, {"keywords": "", "author": "", "article_body": "A 57-year-old man from Mġarr was grievously injured on Monday when he fell from a height of around one storey while working at a residence.\nThe police said the accident happened in Triq San Pawl, Mġarr at around 8pm.\nThe man was taken to Mater Dei Hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 2589}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Tuesday’s newspapers.\nTimes of Malta says that according to a university-wide survey, the majority of University students are against the legalisation of abortion. In another story, the newspaper says Malta and several other European Union countries faced a backlash in the European Parliament on Monday after they were labelled by various MEPs as being tax havens. \nThe Malta Independent says the law prohibited the Commissioner for Standards in Public Life from looking into the situation of the Opposition leader.\nL-Orizzont quotes outgoing President Marie Louise Coleiro Preca saying that the General Workers’ Union was strong because it was built on solidarity.\nIn-Nazzjon describes the Moneyval committee report as another negative one for the government.", "comment_count": 0, "id": 2590}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Environment Minister José Herrera has admitted to a lack of agreement with Infrastructure Minister Ian Borg over the prospect of fuel stations continuing to be built outside development zones. \nDr Herrera, however, insisted the two ministers were “98% of the way” to reaching a conclusion on the long-promised review of the Fuel Stations Policy, which he said would be completed imminently. \nThe controversial 2015 policy allows fuel stations to ‘relocate’ from urban cores to up to 3,000 square metres of ODZ land. A revision announced in January 2018, intended to reduce the burden on agricultural land, has not yet been completed. \nProposals issued last April by the Environment and Resources Authority (ERA), within Dr Herrera’s remit, included a complete ban on all new and relocated fuel stations on ODZ sites, but Dr Borg suggested last month that the ban may be applied only to new facilities. \nAsked whether he was satisfied with this prospect, Dr Herrera said: “We are not in complete agreement. [Dr Borg] has his priorities and I have mine, but I believe we can reach a consensus. Ideally, we would not touch a square inch of countryside, but in truth you have to be more flexible.\n“There is already a strong agreement that – if in the worst case scenario you have to use ODZ because there is no other land left – the footprint should be much smaller than it was, and that it should be allowed in a very stringent manner on a case-by-case basis. \n“So we have made huge progress.”\nPA bulldozing over common good and people’s well-being\nDr Herrera also told the Times of Malta he did not believe the 15-month delay in issuing the new policy had any adverse impact on the environment as no fuel stations had been approved in that time. \nIn fact, two have been approved since the revision was announced, one a renewal, while six have been rejected and others withdrawn. Several new applications have also been submitted, which will all eventually be assessed under the existing, more permissive, policy. \nMoviment Graffitti activists protest delays in the fuel station policy revision at a Planning Authority hearing, in April, last year. Photo: Chris Sant Fournier\nMeanwhile, Moviment Graffitti warned on Monday that it would be carrying out “bigger and more forceful” direct action if the policy revision was not published immediately.\nThe group has on two occasions so far, last April and last September, halted Planning Authority hearings on fuel station proposals in Luqa and Bulebel, arguing that no decisions should be made while the review is pending.\nGraffitti accused the PA of taking the public for a ride by dragging its feet and allowing developers to continue submitting applications for ODZ fuel stations, which would then be assessed under the current policy.\n“Allowing so many massive fuel stations on natural and agricultural land in a small, over-built, country like Malta is simply insane,” the group said. \n“The PA is bulldozing over the common good and the people’s well-being in order to accommodate a few wealthy individuals.”", "comment_count": 31, "id": 2591}, {"keywords": "", "author": "Jacob Borg", "article_body": "The European Parliament will today vote on a Tax3 committee resolution, which, among other things, calls for a freeze on golden visa schemes.\nMalta and several other European Union countries faced a backlash in the European Parliament (EP) on Monday after they were labelled by various MEPs as being tax havens. \nDuring a debate about an EP Tax3 committee identifying seven EU countries as having tax haven characteristics, Maltese MEPs fended off calls for common tax rules.\nOn the Malta front, the Tax3 resolution also calls for a joint investigation team to address serious doubts about the independence of any ongoing investigations on 17 Black, with the support of Europol and Eurojust.\nIn the debate, Labour MEP Alfred Sant slammed “tax populism”.\nDr Sant lamented what he termed as a “bias” against smaller member states in the EP financial crimes’ committee report.\nHe said the report took a one-size-fits-all approach and disregarded the fact that tax flexibility was the only remaining competitive tool for small EU countries.\nNationalist MEP David Casa also countered the onslaught by MEPs demanding tax harmonisation.\nMr Casa said several proposals coming from the left would limit a country’s flexibility on taking decisions on their tax systems.\nNo progress as long as member states had ability to block moves\nDuring the debate, Pierre Moscovici, the European Commissioner responsible for taxation, called for unanimity on tax matters in council to be abolished.\nInstead, tax matters should be decided by a qualified majority, Mr Moscovici said.\nSpain MEP Miguel Urbán Crespo questioned when the Commission would name and shame Malta and Luxembourg as tax havens.\nMr Urbán Crespo said “astronomical” amounts of tax were dodged thanks to loopholes in EU countries.\nGerman MEP Werner Langen said no progress would be made as long as member states had the ability to block a move towards a common tax base.\nApart from the tax haven reference, the resolution also touches upon the murder of journalist Daphne Caruana Galizia. \nIt notes that Ms Caruana Galizia was working on the biggest data leak she had ever received at the time she was assassinated ‒ documents from Electrogas. \nIt also called for a joint investigation team to address serious doubts about the independence of any ongoing investigations on 17 Black, with the support of Europol and Eurojust.\nThe UAE-based company 17 Black was mentioned in leaked Panama Papers e-mails as one of two firms that would pay up to $2 million into offshore structures owned by Tourism Minister Konrad Mizzi and the Prime Minister’s chief of staff Keith Schembri. \nA joint investigation by the Times of Malta and Reuters revealed that 17 Black is owned by power station investor Yorgen Fenech. \nThe European Parliament resolution calls on the UAE to cooperate in the 17 Black investigation.", "comment_count": 68, "id": 2592}, {"keywords": "", "author": "Keith Micallef", "article_body": "An investigation into claims that sewage from the Malta Campsite facility in Armier was being discharged into adjacent garigue land drew a blank as it could not be established who was responsible.\nA few months ago, the same facility made headlines after it was slapped with an enforcement notice over a long list of planning breaches that are being contesting.\nThe probe over illegal dumping of raw sewage was launched in the wake of photographs received by the Times of Malta from an anonymous source. The images were forwarded to the Environment and Resources Authority last Wednesday.\nThe photographs photos featured murky liquid waste from a cesspit being dumped into the open by means of a hose jutting out from a manhole. The anonymous source who supplied the images claimed such an operation was not a one-off occurrence but something that had already happened before. \nContacted by Times of Malta, Malta Campsite administrator Vince Vella denied any wrongdoing saying the photos had been sent with the sole intention of tarnishing the facilities’ reputation.\nAn ERA spokeswoman confirmed that an investigation had been launched. An onsite inspection was only carried out on Friday afternoon, two days after the environment watchdog had been alerted about the matter.\nThe spokeswoman said no open manholes with sewage flowing out were found and no visible signs or particular smells of sewage were detected. Nonetheless, the regulator noted that the manhole in the photo was possibly the one located close to the campsite entrance.\nMeanwhile, proceedings related to the enforcement notice issued by the Planning Authority last October are still pending. \nAccording to the website of the Environment and Planning Review Tribunal, which is hearing the case, the first and only sitting was held last December, with the case being put off for an onsite inspection.\nAction to address one of the illegalities flagged in the enforcement notice started last month when a number of mobile homes that had been illegally placed outside the campsite’s footprint started being removed. \nThe operation was carried out twice because, the first time around, the planning watchdog intervened after it transpired that the structures were just being shifted to another side of the facility rather than removed altogether.\nThis newspaper received complaints that the site previously occupied by the mobile homes had been left in a mess, with debris scattered all over the place.", "comment_count": 7, "id": 2593}, {"keywords": "", "author": "Jacob Borg in Strasbourg", "article_body": "Portuguese MEP Ana Gomes told the European Parliament on Monday that it was unacceptable how Prime Minister Joseph Muscat “continues to protect [Daphne] Caruana Galizia’s murderers”.\nIn a lively debate about a resolution on the rule of law in Malta and Slovakia, the firebrand socialist MEP slammed the Maltese authorities for failing to arrest the people behind the journalist’s murder.\nMs Caruana Galizia was killed by a car bomb in October 2017.\nTwo months after the murder, 10 people were rounded up and three of them were charged with setting off the car bomb. The other seven were released without charge.\nRead: 3 to 5 other potential suspects in Caruana Galizia murder probe but...\nPrime Minister Muscat told journalists last week that charges would only be brought against more people allegedly involved in Ms Caruana Galizia’s assassination once enough evidence was secured to ensure a successful prosecution.\nThe resolution about Malta urges the European Commission to enter a dialogue with the government in the context of the rule of law framework, a three-stage process whereby Brussels issues an assessment, makes recommendations and monitors the member state’s follow-up.\nAna Gomes and Labour's Miriam Dalli argue after the former delivered her speech. The chairman asked the two socialists to continue their argument outside\nNationalist Party MEP Roberta Metsola said the resolution defended the values espoused by the Maltese people.\nShe said the resolution provided a framework on how to continue defending these values.\n“As a representative of the people of my country I must, I will, defend those values,” she said.\nMalta has already been on the receiving end of an opinion by the Venice Commission, highlighting deficiencies in its institutional set-up.\nThe request for the review by the EP committee was submitted by Dutch MP Pieter Omtzigt, who is preparing a report about the assassination and the rule of law in Malta.\nIn response to the Venice Commission’s recommendations, it was announced last week that the government would be splitting the Attorney General’s role, with the setting up of a separate prosecutor’s office.\nLabour MEPs in defence of government\nLabour MEP Miriam Dalli pointed out that the resolution made no mention of the government’s commitment to these changes.\nShe said further reforms, neglected by previous conservative administrations, required a two-thirds majority in government.\nFellow Labour MEP Alfred Sant said Malta fully respected the rule of law.\nHe said issues about the rule of law were being used to advance what he termed as “polarised and biased interests” arising from national politics.\n“Factually incorrect and skewed accusations are being made about Malta, so that so-called inquiries could be launched. Repeatedly, investigations of this type seek to tarnish the image of the island,” Dr Sant told the European Parliament.\nEU Justice Commissioner Věra Jourová said the Commission used all the tools available to it when faced with rule of law issues.\nShe cited recent action against Poland and Hungary as evidence that the Commission was willing to get tough with violators.\nThe EU Commissioner expressed her agreement that dialogue with Malta had to continue.\nShe said the Commission had highlighted its concerns about the “lack of efficiency” with which corruption cases were investigated and prosecuted.\nA final vote on the rule of law resolution, which among other things call for a public inquiry into Ms Caruana Galizia’s death and publication of the Egrant inquiry, will be held on Thursday.", "comment_count": 103, "id": 2594}, {"keywords": "", "author": "", "article_body": "A 12-year-old girl was hospitalised on Monday afternoon after being hit by a car in Marsaxlokk.\nThe police said she was hit by a BMW 318D driven by a 27-year-old man from Zabbar.\nThe accident happened at about 3pm in Triq Melqart. The girl's condition was described as serious. ", "comment_count": 1, "id": 2595}, {"keywords": "", "author": "Jacob Borg in Strasbourg", "article_body": "Malta along with several other EU countries faced a backlash in the European Parliament (EP) on Monday evening after being labelled by various MEPs as being tax havens.\nDuring a debate about an EP Tax3 committee report identifying seven EU countries as having tax haven characteristics, Maltese MEPs fended off calls for common tax rules.\nLabour MEP Alfred Sant slammed what he dubbed as “tax populism”.\nDr Sant lamented what he termed as a “bias” against smaller member states in the EP financial crimes’ committee report.\nHe said the report took a one size fits all approach and disregarded the fact that tax flexibility was the only remaining competitive tool for small EU countries.\nPN MEP David Casa also countered the onslaught by MEPs demanding tax harmonisation.\nMr Casa said that several proposals coming from the left would limit a country’s flexibility on taking decisions on their tax systems.\nDuring the debate, Pierre Moscovici, the European Commissioner responsible for taxation, called for unanimity on tax matters in Council to be abolished.\nInstead, tax matters should be decided by a qualified majority, Mr Moscovici said.\nSpanish MEP Miguel Urbán Crespo questioned when the Commission would name and shame Malta and Luxembourg as tax havens.\nMr Urbán Crespo said “astronomical” amounts of tax were dodged thanks to loopholes in EU countries.\nGerman MEP Werner Langen said no progress would be made as long as member states had the ability to block a move towards a common tax base.\nThe European Parliament will tomorrow vote on the Tax3 committee resolution, which, among other things, calls on a freeze of golden visa schemes.\nOn the Malta front, the Tax3 resolution also calls for a joint investigation team to address serious doubts about the independence of any ongoing investigations on 17 Black, with the support of Europol and Eurojust.", "comment_count": 16, "id": 2596}, {"keywords": "", "author": "", "article_body": "A new foundation - Tech.MT - has been set up by the government in collaboration with the Malta Chamber of Commerce to serve as a marketing arm for a technology-driven economy.\nParliamentary Secretary Silvio Schembri said the foundation will deliver the message of what makes Malta 'the powerhouse of economic innovation'.\n\"While the Malta Digital Innovation Authority will be focusing on its regulatory role, through its diligent efforts Tech.MT will ensure that Malta is positioned as an attractive working location within key tech areas as are Cloud Apps, Internet of Things, DLT, Artificial Intelligence, Regulatory Technology and Big Data Analytics,\" the parliamentary secretary said. \nThrough Tech.MT, Malta will be promoted in foreign fairs, conferences as well as educational institutions such as universities. \nTech.MT will be chaired by Mark Bugeja , who said that its vision is based on four main pillars: to promote Malta as a tech centre for innovative technologies within industry verticals, innovate, assist operators and investors, and attract talent.", "comment_count": 3, "id": 2597}, {"keywords": "", "author": "Ivan Martin", "article_body": "Sports clubs that invest to reduce energy consumption can now apply for a new government grant and save money on electricity bills.The scheme will be operated by the Energy and Water Agency in conjunction with Sports Malta, and will provide financial assistance to cover the entire costs if the investment does not exceed €20,000.\nIf sporting entities want to investment more, the grant will cover 90 per cent and reach up to €50,000.\nFunds can be used to purchase and install new solar water heaters, heat pumps in the case of no roof, smart lighting, and upgraded appliances.\nThe €500,000 scheme is expected to help associations cut their electricity consumption by around 20 percent. Addressing a press conference for the launch of the new fund, Engineer Charles Buttigieg said applications had opened on Monday and would be open until 6 June.SportMalta CEO Mark Cutajar said that all associations registered with the authority could apply for the scheme.", "comment_count": 0, "id": 2598}, {"keywords": "", "author": "Keith Micallef", "article_body": "Despite experiencing robust economic growth in recent years, workers in Malta are still getting paid way below the European average, according to the latest data published by the EU’s statistics office.\nIt transpires that, in 2016, the average hourly payment rate across all member states was €23 but in Malta it stood at nearly half of the amount ‒ €13 per hour.\nKnown as the average rate of compensation, the data shows the highest-paid employees are in Luxembourg and in the Brussels city region with an hourly rate of €44. On the other hand, workers in three regions in Bulgaria and the north-eastern region of Romania get less than a tenth of this amount, with €4 an hour. \nIn fact, both Eastern European countries ranked last, preceded by Poland, Hungary, Lithuania, Latvia and Croatia.\nApart from Luxembourg, which tops the list, the highest-paid employees are in Denmark, followed by Belgium and the Netherlands.\nMalta is ranked in 16th place in the list, just ahead of Greece, Portugal and Estonia and immediately behind Spain, Slovenia and Cyprus.\nFrom this analysis, which was carried out by region, it transpired that hourly compensation was often the highest in cities, with the exception of Oberbayern, in Germany, Inner London West in the United Kingdom, Bolzano in Italy, PaísVasco in Spain and Dytiki Makedonia in Greece.\nSeparate data published by EU agency Eurofound a fortnight ago showed that, this year, Malta had the lowest increase in the minimum wage across all member states. \nAccording to this review the hourly rate of Malta’s minimum wage went up from €4.25 last year to €4.33 in 2019, which translated to a 1.9 per cent increase. In comparison, the minimum wage in Spain rose by 22 per cent while in Greece it went up by 11 per cent.\nHowever, Malta’s minimum wage of €762 per month was still ranked at “medium level” alongside that in Portugal, Spain, Greece and Slovenia. Yet, when compared to the EU’s minimum wage average of €924, Malta lags significantly behind.\nThis trend prompted criticism from UĦM Voice of the Workers against the government’s policy of importing thousands of non-EU workers every year. According to the union, too much emphasis on cheap labour would eventually hit Maltese workers hard as they would be priced out from certain sectors of the labour market.", "comment_count": 46, "id": 2599}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated at 5.40pm \nThe majority of students are against the legalisation of abortion, according to a university-wide survey. \nA total of 58.4 per cent of the 733 university students who participated in the University Students' Council's survey believe that abortion should not be legalised, with 41.6 per cent in favour. \nA fifth of all respondents do not even think it should be legalised when the mother’s life is in danger.\nOpinion is split equally when it comes to cases of life-threatening illness on the child. A quarter strongly disagree with abortion in such cases, while another quarter agree.\nAnother 16.2 per cent and 16.6 per cent disagree and agree respectively.\nCases of rape also split opinion: one third strongly disagree and one third strongly agree with abortion in such cases. 15.8 per cent disagree and 11.5 per cent agree.\nRead: Abortion taboo broken on Facebook\nAt the moment, only Malta and Andorra prohibit abortion under any circumstance, with Nils Muižnieks, former Council of Europe’s commissioner for human rights, noting that the island’s ban on abortion contradicted the norms of international human rights law.\n\nThe ban denied women a range of fundamental human rights and the Maltese authorities should remedy this situation, he had said.\nMore recently, a UK-based charity providing financial assistance, practical information and accommodation to those living in countries with restrictive abortion laws, launched its service to residents in Malta and Gibraltar.\nMeanwhile, a pro-choice coalition, made up of civil society organisations and individuals who want to campaign for reproductive rights and justice in Malta has also just been set up.\nAccording to the KSU sample of 733 out of 11,000 students, abortion should not be legalised in cases of disability of the child (64.1 per cent), financial instability (66.7 per cent), any form of addiction (62.2 per cent), not being ready for parenthood (69.5 per cent) and teenage pregnancy (67 per cent).\nThe majority also said abortion should be illegal when presented with four scenarios - first three months of pregnancy being intrusive (60.2 per cent) or non-invasive (55.3 per cent); second trimester (84.2 per cent), or the last trimester (91.7 per cent).\nMost of the students were opposed to abortion in several scenarios. Photo: Shutterstock\nSlightly less than two-thirds of the respondents - 63.6 per cent - were women, which is comparable to the University student body's gender composition.\nBefore the survey kicked off, KSU’s social policy commission had agreed that the results would reflect the council’s position on behalf of all University of Malta student representatives and students.\nA public consultation session was also held before the survey was issued and distributed to all students via email.\nEventually, the Social Policy Office met up with Prof. Liberato Camilleri to analyse the results via SPSS and prepare the report.\nRespondents answered using a web-based questionnaire. Researchers estimated a 3.5 per cent margin of error assuming a 95 per cent confidence level. ", "comment_count": 79, "id": 2600}, {"keywords": "", "author": "", "article_body": "A man died at a construction site in St Julian’s on Monday afternoon, the police have confirmed. The victim, an Italian who lived in St Julian’s, was approximately 40 years old. \nHe fell from an undisclosed height at the site on Triq Francis Zammit. Paramedics pronounced him dead at the scene. \nMagistrate Rachel Montebello is leading an inquiry into the workplace death. ", "comment_count": 0, "id": 2601}, {"keywords": "", "author": "", "article_body": "Two men were denied bail on Monday after pleading not guilty to a number of minor thefts.\nPaul Gauci Borda, 23, and Omar Bekbak, 30, both from Gzira were accused of having stolen tools from a parked vehicle on Sunday.  \nGauci Borda was also accused of stealing deodorants, two charity donation boxes and a number of bottles of alcohol from several shops. Bekbak was charged with breaching bail and a probation order.\nLawyer Martin Fenech entered not guilty pleas for the accused, arguing that the crimes were not serious. Prosecuting inspector Jonathan Ransley retorted that the fact that they are stealing stupid things meant that their problem was very serious indeed.\nMagistrate Rachel Montebello heard how the men, who appeared drowsy and rested their heads on the desk in front of them, were heavy drug users.\nFamily members wept as a request for bail was denied, after the court took a look at the accused’s criminal records and said it was “entirely unconvinced” that they  could be trusted to observe their bail conditions.\nThe court, however, recommended that the Director of Prisons to make necessary arrangements to give the accused the medical assistance they needed.", "comment_count": 0, "id": 2602}, {"keywords": "", "author": "Jacob Borg", "article_body": "The European Parliament will this evening hold a debate about the rule of law in Malta and Slovakia, with a resolution expected to call for the publication of the Egrant inquiry report, the holding of a public inquiry into journalist Daphne Caruana Galizia’s assassination and a halt to Malta’s passport sales scheme.\nA cross-party group of MEPs on the civil liberties committee adopted the draft resolution in February, expressing serious concerns over the fight against corruption and organised crime, the impartiality of law enforcement and judicial independence in Malta and Slovakia.\nSince the draft resolution was adopted, authorities in Slovakia charged entrepreneur Marian Kocner, who has business links in Malta, with masterminding the murder of Slovakian journalist Jan Kuciak.\nMr Kuciak had been investigating the Slovakian millionaire’s business affairs prior to his murder.\nPrime Minister Joseph Muscat told journalists last week that charges would only be brought against more people allegedly involved in Ms Caruana Galizia’s assassination once enough evidence was secured to ensure a successful prosecution.\nThree men were arrested and charged two months after she was killed in an October 2017 car bombing. Seven other men were also arrested in December 2017 but released without charge.\nThe resolution about Malta urges the European Commission to enter into a dialogue with the government in the context of the rule of law framework, a three-stage process whereby Brussels issues an assessment, makes recommendations and monitors the member state’s follow-up.\nMalta has already been on the receiving end of an opinion by the Venice Commission, highlighting deficiencies in its institutional setup. The request for the review was submitted by Dutch MP Pieter Omtzigt, who is preparing a report about the assassination and the rule of law in Malta.\nIn response to the Venice Commission’s recommendations, it was announced last week that the government would be splitting the Attorney General’s role, with the setting up of a separate prosecutor’s office.\nNo precise timelines have been given as to when other Venice Commission recommendations, including the setting up of a judicial appointments committee independent from the government, will be implemented.", "comment_count": 42, "id": 2603}, {"keywords": "", "author": "", "article_body": "A nurse and a nursing aide who left a frail patient to chew on chicken without supervision have been found guilty of causing his death in 2012.\nNurse David Sant and nursing aide Carol Bonnici were working at Karin Grech Hospital in March 2012 when the 64-year-old dementia patient was found lying face-down on a bathroom floor, dead. He had gone missing from his ward and was found to have choked. \nThe two hospital workers were found guilty of involuntary homicide on Monday and fined €7,000 and €4,000 respectively. Chief nurse Maria Bondin, who also faced charges, was cleared of all wrongdoing by magistrate Donatella Frendo Dimech.\nThe court found that the two workers had, despite their good intentions, failed in their duties.\nThe court heard how the victim, who had suffered a stroke, had been given chicken to eat on the day of his death. Chicken was considered suitable food for him, provided that it was properly mashed and that the patient was supervised as he ate.\nFollowing the patient's death, new rules for what constituted 'soft food' were introduced.\nA note stuck to the patient’s bed read “Position for Feeding: seated/propped up” and “Supervise during feeding.\nHis wife neverthless told the court how she would often find her husband eating alone, without supervision.\nNurse Sant was responsible for the patient, with Ms Bonnici as his aide. The two had six patients in their care, with nurse Bondin in charge of the ward.\nAt the time of the incident, Ms Bonnici had been feeding another patient in another room.\nMagistrate Frendo Dimech began hearing the case in 2018, with it having been handed to her from a different magistrate. \nStatements the accused had given to the police were discarded as there was no lawyer present during interrogation.\nSimilarly, the court discarded a report drawn up by the Mater Dei Hospital legal office about the internal inquiry, which had been presented but not confirmed on oath and therefore had no probatory value.\nThe court found that Ms Bonnici had fallen short of the standard of diligence expected of her. It found that Mr Sant was also negligent and had admitted that he had not checked whether the patient had actually eaten.\nHis failure to supervise led to the death of a patient entrusted to his care, the magistrate ruled.\nHe knew that the patient liked to eat, that he was at risk of choking and that his dementia made him prone to wandering, the court said. All this meant there was a greater duty to supervise him when there was food around, it added.\nThe court however noted that there were attenuating factors at play at the time. Mr Sant was looking after a trainee nurse, while Ms Bonnici was feeding a patient who was far more vulnerable than the victim.\nThey also reported to work earlier than they had to, which was a testament to their dedication, the court said.\nChief nurse Bondin, on the other hand, had done nothing wrong, the court said.\n“On the contrary, in the very unfortunate circumstances of this case, Maria Bondin did everything she could to ensure that the patient is given the best care. Her efforts to save his life were also noted,” the magistrate said.\nThe court found Mr Sant and Ms Bonnici guilty of involuntary homicide, but said that their negligence did not merit effective prison time.\nNeither could be considered a threat to society, the magistrate said, and society would not benefit from their imprisonment.\nBoth had clean criminal records and their negligence was not due to not caring, she added.\nThe court noted that it was not requested to liquidate damages.\nIt cleared Maria Bondin of all guilt, and fined Mr Sant and Ms Bonnici, who were also ordered to pay the €1,644 due to court experts in the case.\nSuperintendent Dr Jeffrey Azzopardi prosecuted and Dr Stefano Filletti represented the patient's family.\nLawyers Stephen Tonna Lowell and Kris Scicluna represented Mr Sant and Ms Bonnici. Lawyers Michael Scriha and Lucio Scriha represented Ms Bondin. ", "comment_count": 0, "id": 2604}, {"keywords": "", "author": "", "article_body": "A car was destroyed after bursting into flames in Ta' Xbiex early on Monday.\nAn eyewitness said the incident took place at 3 am while the vehicle was parked on Triq Giuseppe Cali.  \nAnother two cars were damaged. Firefighters put out the flames.\nThis was the second such incident in a few months, with another car having been similarly destroyed nearby.\nA magisterial inquiry is underway.\nPhotos by Ken Cowan.\nPhoto: Ken Cowan\n \n \n ", "comment_count": 0, "id": 2605}, {"keywords": "", "author": "", "article_body": "The European Commission has promised to work with Maltese authorities on ways to tackle illegal fishing by Tunisian boats, which are undermining lampuki catches, according to the Nationalist Party.\nMEP candidate Peter Agius said the Commission would take measures to address the difficulties faced by Maltese fishermen in spite of new regulations.\nMr Agius said that proof of Tunisian incursions had been submitted, saying that the cooperation of Tunisian authorities was imperative.\nMeasures might also be considered through the General Fisheries Commission for the Mediterranean, he said, adding that other species like swordfish might be affected as the same fishing equipment was used.", "comment_count": 2, "id": 2606}, {"keywords": "", "author": "", "article_body": "The female participation rate has been improving for years and in the last quarter of 2018 it seems to have broken another barrier: there were more women than men aged 15-24 – as a percentage - who were active.\nThe category had 55.2 per cent of men active, compared with 56.6 for women.\nThe next category up, those aged 25-54, still had men in the lead, although the percentage for women is going up in both this category and the 55-64 one, compared with a year ago.\nJobsPlus chairman Clyde Caruana had said recently that while the older cohort of women may still feature very little in the workplace, as they move out of the working age category, they are being replaced by younger ones.\n“I estimate that in the next four to five years, Malta will reach the EU average for female participation. It is encouraging that in the 25-29 age group, we have the highest female employment rate in the EU, even higher than in Scandinavia. And it is likely that the 30-34 age group will soon also top the rankings.”\nThe National Statistics Office figures for the labour force released on Monday showed that there were 239,427 working out of 412,385 people available for work, up from 227,167 of the 401,510 available a year earlier.\nThis represents increase of 5.4 per cent in employment.\n \n\nOn average, out of every 100 persons aged between 15 to 64 years, 72 were employed.  The male employment rate for this age bracket was 82.3 per cent while that for females stood at 61.5 per cent.\nThe NSO figures showed that there were 4,463 over 65s working, compared with 3,552 a year earlier. However, the numbers of employees start to dwindle as from the 25-34 for both men and women.\nSelf-employed persons accounted for 14.1 per cent of all persons with a main job. The majority of employed persons worked on a full-time basis totaling 204,683 and a further 34,744 had a part-time job as their primary employment.\nThe unemployment rate for the fourth quarter of 2018, stood at 3.5 per cent, with the main reason for inactivity being that persons had reached retirement age or took up early retirement (42.1 per cent).", "comment_count": 14, "id": 2607}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Moviment Graffitti has warned the Planning Authority that it will be carrying out “bigger and more forceful” direct action if the long-promised fuel station policy revision is not published immediately.“We have tried everything – e-mails, articles, protests, press conferences - to make the PA revise a policy which the authorities themselves acknowledge as harmful, to no avail,” Moviment Graffitti said in a statement. “This leaves us with no other option but to resort to further direct actions.”The group said it was “beyond ridiculous” that a revision of the “extremely damaging” policy had still not been issued nearly 15 months after the review was announced.The 2015 policy allows fuel stations to ‘relocate’ from urban cores to up to 3,000 square metres of land outside development zones.Numerous such developments have been approved since despite consistent warnings from the Environment and Resources Authority (ERA) over the take-up of agricultural land.ERA’s proposals for the revision were passed on in April last year, and included a complete ban on all new and relocated fuel stations on ODZ sites, but there has been no word since on when the final document will be issued.Planning minister Ian Borg hinted last month that the proposed ban may apply only to new facilities, leaving existing fuel stations free to relocate to ODZ sites.Moviment Graffitti on Monday accused the PA of taking the public for a ride by dragging its feet and allowing developers to continue submitting applications for ODZ fuel stations, which would then be assessed under the current policy.“Allowing so many massive fuel stations on natural and agricultural land in a small, over-built, country like Malta is simply insane, the group said. “The PA is bulldozing over the common good and the people’s wellbeing in order to accommodate a few wealthy individuals.”Graffitti has on two occasions, last April and last September, halted PA hearings on fuel station proposals in Luqa and Bulebel, arguing that no decisions should be made while the policy review is pending. The Bulebel application was ultimately rejected by the board, while the Luqa proposal was approved, committing 3,000 square metres of agricultural land on Qormi Road to the development.", "comment_count": 11, "id": 2608}, {"keywords": "", "author": "Ivan Martin", "article_body": "Air Malta apron workers gathered in front of the Office of the Prime Minister on Monday morning to protest against the sudden changes in their working conditions.\nAround 50 workers gathered in Valletta insisting on a meeting with Tourism Minister Konrad Mizzi, as they lament changes to their shifts.\nLoader Charles Cuschieri told the Times of Malta that a new shift system has been forced on several departments of the national airline, which meant they would have to work “unacceptable” hours.\nWorkers who gathered on the steps of the Auberge de Castille said the decisions ostensibly were being taken by Air Malta’s senior management without the consent of Dr Mizzi.\n“So we came here to see what’s going on,” one irate employee said.\nAir Malta has been in the headlines recently, as the company last week posted a profit for the first time in more than a decade.\nThe profit of €1.2 million was the result of an increase in revenue of over €7 million generated by a rise in passenger traffic of around 11 per cent and decreasing fuel costs.\nThe airline had registered a loss of €10.8 million in 2017.", "comment_count": 47, "id": 2609}, {"keywords": "", "author": "Ivan Martin", "article_body": "Malta’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation, with the government now scrambling to push up its final score before the summer deadline. \nThe Committee of Experts on the Evaluation of Anti-Money Laundering Measures and the Financing of Terrorism, known as Moneyval for short, is a permanent monitoring body of the Council of Europe. It assesses compliance with the principal international standards to counter money laundering and the effectiveness of their implementation.\nA senior source told The Sunday Times of Malta that a draft report by Moneyval had “failed” Malta when it evaluated the country’s actions and preparedness in complying with rigid anti-money laundering legislation.\nHowever, veteran financial service practitioners said that while this might appear  “alarming”, there was still time to improve. \n“Countries do often fail in the draft report and then manage to turn it around for the final document, so I wouldn’t be surprised if the country’s final score is better than this,” one source said. \nA government spokesman last night emphasised that the evaluation was still far from complete and would only be so when Moneyval publishes it in July after another eight stages in the process.\nRead: 'Malta sending out message that financial crimes go unpunished'\nA source privy to the details of the investigation said that unless the draft grade were improved, a chain of events would be set off that could end in the country being blacklisted.\nNo problems - 'on paper'\nThe source explained that Moneyval, which conducted a mission in Malta in November 2018, had not found any major problems with Malta’s laws and the measures the island has ‘on paper’.  The island was found to be largely compliant.\nHowever, it had raised concerns about how effectively these laws were being implemented by State organs such as the police and the Malta Financial Services Authority.\nThis second section can see a country’s anti-money laundering effectiveness graded as either ‘high’, ‘substantial’, ‘moderate’, or ‘low’ – sort of like an A to F grading scale in exams, moderate being considered a fail and low being considered a “terrible grade”, the source said. \nHow did Malta do?\nThe source said that out of 11 sections of effectiveness graded – ranging from international cooperation to local supervisory functions and policing – none were considered good enough to score a ‘high’.\nCountries often fail in the draft report and manage to turn it around\n“Half” were only found to be ‘moderate’, “just one or two” were considered good enough to be ‘substantial’, with the rest ranked as ‘low’, the worst grade possible. \nThe source said the government had already spent “millions of euros” in consultancy fees in a bid to impress the Moneyval mission, however, the effort had come up short. \n“In one area alone – risk management – the government spent some €800,000 in consultancy and advice, but we still failed that section,” the source said.\nNext month Maltese officials will travel to Strasbourg for a grilling as part of the assessment, and then the government will engage in a dialogue with the Council of Europe experts.  Then, in July, the final document will be voted on in a special plenary. \nOnce the document is approved, Malta will be given a long list of recommendations that it will have to implement, likely under some form of supervision, within one year.\nThe source said that if progress was not deemed sufficient, the worst possible scenario could see the island ultimately put on a blacklist, adding that several high-level meetings had been held with heads of State organs and the administration to discuss the way forward. \nHow did the government react?\nAsked for the government’s position on the draft and what it was doing to address the situation, the government spokesman said the document was an internal draft undergoing a due process which applied equally to all Council of Europe members.\n“Moneyval insists that this draft is confidential and in fact not even sent to any EU or international institution; not to hide anything, but because the evaluation is only complete when Moneyval itself publishes it in July after passing through all the stages. In fact there are still eight more stages in the process,” he said.\nHe added that the disclosure of extracts from this draft document was unethical because it interfered in this due process and this would harm the country by prejudicing the final evaluation.\n“Moneyval aims to improve the capacities of national authorities to fight money laundering and the financing of terrorism more effectively. Let us allow our institutions to undergo this exercise without interference.”\nGovernment sources indicated that an investment drive had already begun in a number of areas highlighted for shortcomings.\nThe Financial Intelligence Analysis Unit, which has been in the spotlight over the past few years after handling several high-level money-laundering investigations involving politicians, recently saw its budget explode from €1.6 million to €10.6 million.\nSimilar investments were expected for the police’s Economic Crimes Unit, while the Malta Financial Services Authority is already undergoing a significant restructuring exercise.\nThe government sources also said that Finance Minister Edward Scicluna did not seem to be losing sleep over the draft report, saying he appeared “surprisingly cool” given the magnitude of the task at hand.    ", "comment_count": 62, "id": 2610}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Equipped with just decades-old photographs and scant information about her uncle who had passed away in the 1930s, an Australian woman still managed to trace her relatives following an appeal in the Times of Malta.\nCoral-Anne Laurence only had old photographs and scant information about her family, who lived in Corradino.\nCoral-Anne Laurence flew over with her family, looking for the relatives of a boy whose heart-broken mother had destroyed all existing photos of him when he died aged nine.\nFrederick Mudle was born in Malta more than 90 years ago to Emily and Henry, head groundsman of the then Corradino football grounds. \nMs Laurence, the daughter of one of his sisters, Norah Jane, had said she would love to pay her respects to her uncle. However, the only information she had was the date of his death, the cause – “cardiac paralysis per endocarditis” – and that he had been buried at the Santa Maria Addolorata Cemetery.\nWhen James Ishmael, Ms Laurence’s second cousin, read her appeal in the Times of Malta he started looking for the boy’s resting place, successfully locating it.\nMr Ishmael’s mother, the late Harriet, had sought refuge in the bomb shelter on the Corradino naval football grounds with her relatives, including her cousin, Norah Jane. Although Mr Ishmael was aware of his extended family, he had no idea where his relatives were, where to start looking or whether any of them were still alive. \nFollowing Ms Laurence’s appeal, he met her and her family together with his wife Josephine, brother Raymond and cousins Patrick Gabarretta and Antoinette Camilleri. The meeting was for Ms Laurence an amazing life episode. She had always wondered whether there was any surviving family in Malta.\nIt was a mixture of happiness and sadness for me\n“Once the story about my search for little uncle Frederick’s grave was printed in the newspaper, within a day or so I made contact with many second and third cousins I never knew existed. \n“Some lived in Malta and one in the United States,” she said.\nWhen she met her cousins, she immediately felt at home with them and it was amazing to look at the old photos that they had all brought with them, she remarked.\nHer cousins had organised a temporary plaque to place on the grave.\n“It was a mixture of happiness and sadness for me,” she said.\n“It gives me great comfort that this nine-year-old boy, who was lost so many years ago, will now no longer be alone. I kept in constant contact with the many family members back home in Australia and they were all feeling very much like me. \n“Extremely grateful that, after all these years, we have found each other,” Ms Laurence added.\nTogether with her husband and son she also visited the Hibernians football grounds and they were shown around by the present groundsman.\nThey were even able to go into the house where her mother and family lived and were shown the entrance to the bomb shelter where they lived during the war.", "comment_count": 1, "id": 2611}, {"keywords": "", "author": "", "article_body": "Updated 9.25am\nA 30-year-old Romanian worker was seriously hurt when a forklifter overturned at Palumbo's dockyard in Cospicua.\nThe police said that the forklifter was being driven by another Romanian, a 20-year-old, who was not hurt.\nThe accident took place on Sunday at 11.15pm.\nA spokesman for Palumbo said that welfare of employees was always a top priority and that the 'yard complies with the highest international safety standards.\n\"We will continue to provide our employee with all the support he requires following this unfortunate incident and are in the process of establishing the cause,\" the spokesman said.\nInvestigations are ongoing.", "comment_count": 0, "id": 2612}, {"keywords": "", "author": "Jacob Borg", "article_body": "A Maltese man who in 2012 gave hope to parents with autistic children, by claiming a “neurofeedback” headband he invented could help autistic youngsters, misled the public by touting false credentials as a PhD in neuroscience, The Sunday Times of Malta can reveal.\nInventor Adrian Attard Trevisan spent three years between 2012 and 2015 parading himself as having a doctorate degree in neuroscience from University College London (UCL) when he was marketing the headband, known as Mente.\nAccording to the inventor, the €1,400 Mente device uses a “neurofeedback system” that analyses brainwaves and plays back custom sounds that have calming effects on autistic children.\nHe only obtained an actual PhD, in human physiology, from Milan University in 2015.\nAlong the way, he received flattering coverage from the media, a product launch by Prime Minister Joseph Muscat’s wife as well as an endorsement by the Prime Minister himself.\nDr Attard Trevisan set up a company called AAT Research through which the device was marketed and sold.\nA former employee at AAT Research who spoke to The Sunday Times of Malta said it was always clear that the young inventor was out of his depth.\n“This guy got a lot of exposure, including by the media and your own newspaper. This gave him credibility. All this credibility was built on him presenting himself as a doctor, a PhD in neuroscience.\n“If you weren’t dealing with him technically on a day-to-day basis, you would not realise that he wasn’t what he was claiming to be,” the employee said.\n‘It was a mistake’\nWhen confronted by The Sunday Times of Malta about the false PhD credentials, Dr Attard Trevisan admitted to what he termed a “mistake” that, he added, was limited to two references in articles in which he claimed to have a doctorate degree from UCL.\nDr Attard Trevisan said he was hoping to finalise his PhD in the UK but a number of issues prevented him from doing so. He says he then transferred his research to Milan from where he obtained the PhD.\nResearch by The Sunday Times of Malta shows this “mistake” was repeated on all of the inventor’s social media platforms and plenty of promotional material by AAT Research about the Mente device over the years.\nAdrian Attard Previsan presented himself as a doctor in a 2012 promotional video. This is an abridged version of the full video.\nReferences to the UCL PhD have since been removed from his social media pages.\nThe inventor is now being sued for “plagiarising” a portion of this Milan PhD by the former AAT Research employee, who discovered chunks of his research had been passed off as that of Dr Attard Trevisan.\nA spokesman for UCL’s neuroscience department said that their only records for Adrian Attard Trevisan were from when he registered for a Master’s degree that was never completed.\nHe was also registered for a PhD at the University of Bedfordshire, but this was never completed.\nFake neuroscience claims continued after Milan PhD\nThe duplicity about the neuroscience PhD continued even after Dr Attard Trevisan obtained an actual PhD from Milan.\nIn a blogpost uploaded by Dr Attard Trevisan’s company AAT research in 2015, it was boldly claimed the inventor had successfully defended his “second doctoral thesis” at the Milan University.\nQuestioned about this blogpost, Dr Attard Trevisan said he had not written the blog himself.\nAn AAT Research blogspot in 2015.\nDr Attard Trevisan says since leaving AAT Research in 2016, the company went on to replicate his research results about the autism headband in an “international” study.\nAsked what studies were carried out to back up his claims in 2012 that the device improved autistic children’s abilities to be in touch with their environment by 500 per cent, Dr Attard Trevisan said this was tested by a questionnaire before and after using the device.\nIf you weren’t dealing with him technically on a day to day basis, you would not realise that he wasn’t what he was claiming to be\nDr Attard Trevisan admitted that this was not an independent test and there was no control group to compare the results with.\nA parent who bought an early version of the device told The Sunday Times of Malta he had long given up using it.\n“I saw no difference at all in my child’s behaviour. I continued using it for a while because it became part of my son’s routine, but stopped bothering after a few months,” the parent said.\n‘I did not gain anything’\nQuestioned what led him to tout the false PhD credentials from UCL, if not to mislead people, Dr Attard Trevisan hit back by saying it had not made any difference.\n“Tell me, what did I gain by this? Did I actually gain anything? I did not financially gain anything. This was a mistake. I spent a number of years at different universities and my research was published.\n“If it was misrepresentation to make a quick buck, I would understand. Believe me I didn’t [make a quick buck]… It would have propelled me if I was still riding on the wave of it.\n“When I saw a little bit of popularity coming through, I exited the company and started something new”.\nDr Attard Trevisan said he made up for his “mistake” by taking his research and formalising it in a PhD from Milan.\nHe insisted that the “misrepresentation” about the UCL PhD should not be used to destroy the research about the Mente device.\nEndorsement from PM\nRecords show that AAT Research received public funding from the Malta Council for Science and Technology (MCST).\nDr Attard Trevisan said AAT Research never received a penny from this as it was a commercial partnership, for research that had nothing to do with autism.\nThe Mente device was formally launched in January 2015 by Marigold Foundation chairwoman Michelle Muscat, although it had been on sale long before then.\nDr Attard Trevisan also received a ringing endorsement of his work by Prime Minister Joseph Muscat during a visit to AAT Research in 2016.\nJoseph Muscat pays a visit to AAT in 2016, during which he endorses Dr Attard Trevisan's work\n“This is a person who sold everything he had in order to create and register the patents on his research which is today considered cutting edge.\n“In the field of autism, as well as other related fields such as depression, traditional cures are being combined with information technology by means of technology,” Dr Muscat said of the inventor’s research during a visit to AAT Research’s office in March 2016.\nIn 2016, AAT Research was taken over by an Australian company called Neurotech.\nPromotional material by Neurotech from that period presents Dr Attard Trevisan as a key developer of the autism headband, with a PhD in neuroscience from UCL and PhD in human physiology from Milan.\n‘Aware of allegations’\nContacted by The Sunday Times of Malta, a spokesman for Neurotech said the company had recently become aware of “some allegations against Dr Attard Trevisan”.\nThe spokesman said he was unable to respond to questions about Dr Attard Trevisan, as they related to matters that predated Neurotech, or are about Dr Attard Trevisan personally.\n“At the time of listing Neurotech on the Australian Securities Exchange (ASX: NTI) all reasonable due diligence was undertaken by our lawyers and other advisors to review publications and validate the CVs of the directors at that time.\n“Dr Attard Trevisan has not been employed by the company in any full-time operational capacity since 2016 and in 2018 he resigned as director of the company. More recently he has been contracted as an independent advisor to provide a limited number of hours to review specific future projects that the company is considering,” the spokesman said.\nThe Neurotech spokesman said Mente was helping autistic children to live better lives and they continue to work closely with families, clinics and the neuroscience community to further validate and improve the outcomes that Mente enables.\n“We also look forward to launching a new model for Mente in 2019, specifically designed to make the therapy easier to access through clinics,” the spokesman said.", "comment_count": 77, "id": 2613}, {"keywords": "", "author": "", "article_body": "Sunday lunch at a restaurant in Mġarr turned out to be a dramatic affair, with a fight leaving one man seriously injured.\nThe police said that they were called to intervene at 5.30pm when things got out of hand at the restaurant in Triq il-Magħkuba. Several people had got embroiled in the fight but a 56-year-old man from Msida was seriously injured and had to be hospitalised.\nHis condition was later reported as being serious.\nInvestigations are still under way.", "comment_count": 0, "id": 2614}, {"keywords": "", "author": "Claire Caruana", "article_body": "Slashing drink-driving alcohol limits had little to no impact on traffic accidents, with intoxicated motorists still getting behind the wheel, according to insurers.\nAlcohol limits for motorists were slashed to almost half in January last year but the impact was so “minimal” that insurance companies reporting no improvements in accidents involving drivers who had consumed extra drink.\nSpeaking to the Times of Malta ahead of a conference on drink-driving next month, Malta Insurers Association head Adrian Galea reiterated concerns that the changes to laws were not effective, insisting that the number of people caught drunk behind the wheel was not realistic.\n“When one considers that, over the past five years, 946 people were arraigned over drink-driving charges and of these only 548 were found guilty, it is clear not enough is being done,” Mr Galea said.\nWhile the insurers were “happy” with the government’s decision to slash the limits, something which they had argued in favour of for years, the changes were “not of much use” if the rules were not being properly enforced.\n“Do we honestly believe that only two people every week are driving under the influence? This is why our association believes that some changes in the law are required to allow enforcement to be effective,” Mr Galea said.\n“Even this on its own won’t solve the problem. There has to be a motivation for people to be self-disciplined, therefore, more awareness among motorists of the huge risks related to driving under the influence of both alcohol and drugs is also necessary,” Mr Galea added.\nProposals for legislative changes\nIn recent months, insurers have repeatedly expressed scepticism on the low number of people caught breaking the drink-driving rules. They stepped up calls for action after this newspaper reported earlier this year that only three people were caught driving under the influence of alcohol on New Year’s Eve and none on Christmas Eve. \nAccording to the revised rules, motorists are considered to be under the influence of alcohol if they are found to have 22 microgrammes of alcohol in 100 millilitres of breath. This means that a man of average build is limited to just under a pint of beer or a large glass of wine while women can consume no more than half a pint of beer or a small glass of wine.\nAt the forthcoming conference insurers plan to unveil a series of proposals for legislative changes. \nTransport Minister Ian Borg and Family Minister Michael Falzon are expected to address the conference and experts will raise legal issues. The event is also expected to be addressed by a person who experienced the death of a relative as a result of a motor accident.", "comment_count": 48, "id": 2615}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to Monday's front pages:\nThe Times of Malta reports on the new alcohol policy and its impact on drink-driving, as well as on the claim by Opposition leader Adrian Delia that his signature had been falsified.\nThe JobsPlus chairman warns in the Malta Independent that the unskilled would be the most badly affected by rapid wage increases, which also carried a reminder that the European Parliament would on Monday discuss the rule of law in Malta and Slovakia.\nL-Orizzont reports on Prime Minister Joseph Muscat saying that Air Malta could become the primary airline for the whole of the Mediterranean. It also interviews a woman whose mother had put her up for adoption - rather than having her aborted.\nIn-Nazzjon featured Dr Delia saying that nothing would prevent him from fighting corruption and exposing the government's hold on institutions.", "comment_count": 1, "id": 2616}, {"keywords": "", "author": "Joseph Grech", "article_body": "Located just next door to the University, the new Youth Hub officially opened on Wednesday provides a welcoming, multi-functional space that also offers practical support and friendship.\nWhen a ‘Youth Hub’ was inaugurated last Wednesday at Dar Manwel Magri, the Jesuit residence near the University of Malta, the project involved more than simply removing a little-used library in a large area at the front of residence and replacing it with easy chairs for students to ‘chill out’ in.\nThe opening of wide doors at the front of the building, located next door to one of the University’s main entrances, has facilitated access to its entire ground floor, while the Jesuit community has moved its living quarters to the first floor. Previously people had to climb a long flight of stairs to reach the main door.\nMost of the books previously held at the Jesuits’ library have been donated to the MUSEUM library in Blata l-Bajda, while some went to the Jesuits’ Mount St Joseph retreat house in Mosta.\nThe project’s realisation is a long-held dream come true for the local Jesuit community. Provincial delegate Fr Michael Bugeja SJ pointed out that Fr Gianfranco Matarazzo SJ, provincial of the new Euro-Mediterranean Province of which Malta forms part, gave the project the green light soon after the new province was created two years ago.\nThe project, he added, was perfectly in line with one of the Jesuit Order’s four recently adopted ‘Universal Apostolic Preferences’ for the forthcoming decade – that of ‘Journeying with youth’.\nIt is hoped the Youth Hub will act as a magnet, attracting more than just casual drop-ins, but that individual students, youth groups, communities and lecturers will be encouraged to use to full capacity the building’s various other facilities.\nThe small rooms and a large hall on the ground floor offer versatile space for individual or group study, collaboration, conversation, presentations, discussion or simply a comfortable place to hold meetings and seminars, or meet and greet guests. Such meeting places are sometimes lacking on campus.\nThe support the place can offer will complement the academic work of students on campus, which inevitably creates periods of stress\nThe ground floor also hosts a large kitchen and dining area, and a prayer room, while a small number of bedrooms on the first floor are available for short stays.\nUltimately, the Jesuits’ hope is that at the Youth Hub, students and staff will find a welcoming space that provides them with practical support in their daily concerns, while the Jesuits will have additional opportunities to befriend them and engage at a deeper level of human and spiritual formation. A member of University Chaplaincy staff, student volunteers or a Jesuit community member will always be present to welcome visitors.\nUniversity chaplain Fr Patrick Magro, who also lives at the residence, said: “We occasionally have groups of students who ask to spend a few days with us during their study periods, during live-ins in preparation for voluntary work experiences and in the run-up to Easter.” This weekend a visiting group of Spanish students from a Jesuit university college was being hosted at the residence.\nThe project’s next phase involves installing a lift to the first floor and ‘doing up’ the central building’s courtyard to include seating.\nIn the near future, the fields at the back of the Jesuit residence are expected to be deve­loped to include a new University residence for foreign students and visiting academic staff, as well as new buildings hosting the faculties of education and social wellbeing. So rather than being at the periphery of the campus, the Youth Hub will find itself more at the centre of life on campus.\nUniversity Rector Prof. Alfred Vella, who was present for the inauguration, recalled that this year marked the 250th anniversary since the University was formally set up in 1769 after the Jesuits were expelled from Malta by Grand Master Manuel Pinto. The University took over the Collegium Melitense, which the Jesuits had founded in Valletta in 1592. But relations between the University and the Jesuits have long since improved, and there is a long tradition of Jesuits being appointed as University chaplains.\nThe project enjoys the University’s full support, and following meetings between Prof. Vella and Fr Magro, the University is studying ways of offering practical support to the pro­ject through the provision of staff and services.\nProf. Vella remarked that the Youth Hub’s location right next door to the University was very appropriate as the support the place could offer would complement the academic work the students undertook on the campus, which inevitably created periods of stress. “Even University staff will find the place very useful,” the rector joked, “and slowly, slowly we may take over this place too”.\nAuxiliary Bishop Mgr Joseph Galea Curmi, who blessed the Youth Hub, thanked the Jesuit province for the project, adding that it was also in line with Pope Francis’s call for the promotion of a “culture of encounter”.", "comment_count": 1, "id": 2617}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Finance Minister Edward Scicluna is under pressure to sign a permit that would allow a member of Dubai’s ruling family to buy the project to build hundreds of apartments on the site of the former Mistra Village tourist complex in Xemxija, The Sunday Times of Malta can reveal.\nThe Dubai sheik, whose name is not being divulged for data protection reasons, is asking the Office of the Prime Minister to be issued with a special AIP (Acquisition of Immovable Property) permit, which would enable him to purchase the entire project from Gemxija Crown Holdings, the Maltese company which owns the development.\nPressure to comply is being exerted on the Finance Ministry by various quarters, particularly senior officials at the OPM.\nHowever, the Finance Minister, Edward Scicluna, has been advised not to issue the permit as this would constitute a clear breach of the Immovable Property (Acquisition by non-residents) Act.\n“Such a permit, if granted, will be totally illegal and the Finance Ministry would be breaching the law and might be challenged. This legal advice has already been delivered to the minister,” a legal source told this newspaper.\nSuch a permit, if granted, would be totally illegal and the Finance Ministry would be breaching the law and might be challenged\n“If the minister signs such a permit, as the law stipulates that Prof. Scicluna needs to personally sign the file for such an important matter, the minister might be exposing himself to a flagrant breach of the law.”\nThe potential buy-out is deemed by OPM senior officials as being in Malta’s economic interests.\nA senior government source said: “So far the project has not started as it is a known secret that the Maltese developers behind it do not have the necessary funds to see it through.\nThe development on the site of the former Mistra Village holiday complex is planned to incorporate more than 700 apartments in a 12-storey development. Photo: Jonathan Borg\n“The potential deal with the Dubai sheik might mean that the project could start. It is in the government’s interest to keep the feel-good factor and the property boom going as long as possible.”\nAsked to confirm that the OPM was exerting pressure on the minister to grant the permit, a spokesman for the Finance Minister only said that such an application has been filed.\n“The application in question is still being studied.”\nAsked to state whether a similar AIP permit had ever been granted, the spokesman did not reply. The Sunday Times of Malta can confirm that it has not.\nRules for foreign-owned property\nDuring the pre-2004 accession negotiations with the EU, Malta successfully negotiated a special deal with Brussels to protect Maltese citizens from foreign land and property speculators.\nAccording to EU treaties, all EU citizens are to be considered as equal, but Malta obtained a special derogation to limit how much property EU citizens could buy and for what reasons.\nUnder this arrangement, all EU citizens can only acquire a second home in Malta so long as they use it for strictly residential purposes. They are not even allowed to buy a property to rent out.\nThrough the AIP permit mechanism, EU citizens require a permit from the Finance Ministry before they even sign a contract to buy their property.\nThe rules, however, are even more stringent for third country citizens – such as the Dubai sheik. They are only allowed to buy a single property on the island and use it exclusively for personal residential purposes.\nThe only exception to the rule are properties in so-called Special Designated Areas (SDA), mainly high-end development projects such as Portmaso and Tigne’, where no limits on sale of properties apply.\nHowever, the Mistra Village is not included in the list of SDAs.\nThe Mistra Village story so far\nOriginally built in the 1980s, Mistra Village was developed into a tourist complex by the Corinthia Group of Companies. Though at first it was successful, it had started to decline in popularity along the years, closing doors in the early 2000s.\nThe land was later sold by Corinthia to Gemxija Crown Ltd, owned by the Montebello brothers, who had also built the not so successful Marsa A3 Towers project and bought the Jerma Palace to turn into apartments.\nHowever, serious financial difficulties hit the group and despite a permit granted in 2013 to develop the Mistra Village into apartment blocks, the development never took off.\nLast January, the Planning Authority issued a renewal of the permit giving Gemxija Crown five more years to start.\nThe Dubai sheik then filed his application with the Finance Ministry to be granted a special AIP permit that would allow him to take over the project. The OPM was aware of what was going on.\nThe plan\nAccording to the latest development permit, the former tourist village is to be turned into a residential development consisting of 744 apartments, 1,800 square metres of retail space, 1,000 square metres of restaurants and a car park for 1,600 cars.\nThe Dubai sheik, if granted the government’s green light, would be spending hundreds of millions on the project that would culminate in selling apartments to Maltese and foreign buyers.\nThe total floorspace footprint of the project is 134,600 square metres, equivalent to the size of 19 full-size football pitches.\nWhat the law states\nAny non-resident person wishing to acquire immovable property in Malta needs to fill in the necessary forms issued by the Finance Ministry.\nA dwelling house is to be solely used as a residence by the applicant and his family and for no other purpose. It may not be sold in part or converted into more than one dwelling house.\nA garage must be used solely as such by the applicant and his family or as an extension to be integrated with the applicant’s existing dwelling.\nA plot of land must be developed into one complete single residence ready for occupation within two years from the issue of the permit and must be used solely as a residence by the applicant and his family and for no other reason.\n ", "comment_count": 103, "id": 2618}]