[{"keywords": "", "author": "Edwina Brincat", "article_body": "A man was given probation in lieu of an effective jail term after a court of appeal deemed it would be “unjust” to remand him in custody and risk undoing all his efforts at getting his life back on track.\nReginald Bugeja, now 46, had been facing the prospects of 18 months behind bars over a string of thefts committed 19 years ago when the accused, then in the grip of drugs, had fallen into criminal circles.\nThe man had been convicted before a Magistrates’ Court in 2014 over four separate thefts in March 2000 involving items from a Birkirkara hotel, seven television sets, a car stereo and tools from a Santa Venera garage.\nAn appeal was filed by the accused on grounds of the quantum of punishment in view of the lapse of time since the thefts were committed, during which time the accused had undergone a complete transformation.\nThe Court of Criminal Appeal, presided over by Madam Justice Edwina Grima, observed that the appellant’s first brush with the law dated back to when he was 16, after the loss of a parent at the age of 10.\nThe young man started taking drugs and eventually become embroiled in criminal circles, his last brush with the law dating back to 2006.\nHowever, pending the appeal proceedings, the man had undergone a complete transformation, kicking his addiction and placing his life back on track.\nAlthough there was no doubt that the punishment meted out by the first court fell within legal parameters, it would be “unjust” to send the accused behind bars, stated the court, after closely examining the reports put forward by probation officers and noting that the man had indeed “embarked upon the right path”.\nIn light of such evidence, “it would be more worthwhile for the accused and society at large for the appellant to be closely monitored outside the confines of prison so as to ensure that he had fully quit the drug habit,” the court declared, placing the appellant under a three-year probation order which would afford him the necessary psychological support.\nLawyer Edward Gatt was defence counsel.", "comment_count": 0, "id": 419}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The official publication of guidelines on the way superyachts pay VAT has brought an end to the threat of action by the European Commission, with the yachting industry breathing a sigh of relief that it is back to business.\nThe European Commission had sent official warnings a year ago over yachting VAT regimes in Malta, Greece and Cyprus, and later to France and Italy.\nIt had given Malta notice of infringement proceedings, objecting to the way in which only a percentage of the full VAT rate was charged, depending on the percentage of time that a yacht spent in EU waters. This was seen as offering a tax advantage to the island.\nHowever, the industry and government had come together to protest a few months later, with a detailed reply sent in November 2018  being favourably received by the Commission.\nResponding in December, the Commission said that the case against Malta would be dropped once the guidelines were officially published. This was done on March 1, with the case against Malta now closed.\nHow Malta had reached a compromise\nFinance Minister Edward Scicluna explained on Wednesday that, in a nutshell, Malta had compromised on the percentages being charged, allowing for them to be changed retroactively depending on the actual time that the yacht had spent in or out of EU waters.\n\n\n\n \n“The Commission picked on Malta in a very public way. I am very proud of the way that the industry and government came together to make arguments in a proper manner and to protect us from unfair criticism,” he said, adding that this was one of the few sector where Malta did have natural resources to maximise.\n“We are open for business with the industry now reassured.”\n'Our calculations will prove to be right'\nA spokesman for the Malta Chamber of Commerce, Enterprise and Industry’s Yachting Services Business Section said that it was confident that time would vindicate Malta’s initial regime.\n“The percentages of VAT charged through our legislation were based on very detailed studies – which were never published – about the activity of superyachts, which travel considerably over a season. And the larger the yacht, the more they tend to travel.\nMalta has over 750 yachts over 24m on its flag registry. File photo.\n“We are quite convinced that once the information is gathered on their actual activity, it will show that our original percentages were quite accurate,” he told the Times of Malta.\nAddressing the press conference, the head of the section, Alison Vassallo, said that there were more than 750 yachts longer than 24 metres registered in Malta.\nMalta’s VAT regime had been adopted over 10 years ago and has been one of the various factors which resulted in the growth of the sector, which – according to a study conducted by EY on behalf of the chamber – generates over €100 million worth of value-added, over and above the tax revenue and direct income from the maritime registration.\nMalta currently has the world’s largest flag registry for yachts over 24 metres.", "comment_count": 3, "id": 420}, {"keywords": "", "author": "", "article_body": "Local farmers should be given the opportunity to buy diesel at reduced prices like their counterparts in many other EU member states, the Nationalist Party said on Wednesday.\nMaltese farmers were paying double what Sicilian ones paid, MEP candidate Peter Agius said at a press conference in which he called for subsidies to help local agriculture.\n\"Farmers in EU countries buy tractors with red diesel specifically marked for agricultural use,” Dr Agius said.\n“Many farmers tell us farmers in Sicily buy fuel at €0.60c per litre, while they have to pay €1.20. This situation leaves a direct impact on the competitiveness of the Maltese and Gozitan farmers in their competition with foreign imports,” he said.\nDr Agius said that while most EU member states granted subsidies to farmers -either for their electricity or fuel costs - this was not the case in Malta.\nStanding alongside PN agricultural spokesman Edwin Vassallo, Dr Agius argued that local farmers were also getting the short end of the stick when it came to buying pesticides and herbicides.\nSome of these were being sold for double the price they sell for in Sicily, he said.\nThis situation was making it hard for local farmers to compete with foreign imported products, which account for around 70 per cent of al locally sold fruit and vegetables, he said.\nThe PN called on the government to immediately launch a direct subsidy scheme on energy for arable and livestock farmers.\nThese subsidies could be within the parameters of an aid scheme for farmers approved by the European Commission as state aid. ‘\n“We need a serious policy on agriculture, which promotes and gives value to the local produce, and at the same time strengthens the competitiveness of local farmers when faced with competition from foreign produce,” he said.", "comment_count": 6, "id": 421}, {"keywords": "", "author": "", "article_body": "More funds for prevention, early diagnosis and higher-quality treatment are the main proposals of a Nationalist Party policy document on the fight against cancer.\nShadow health minister Stephen Spiteri presented 30 proposals to better respond to the disease during a news conference outside Mater Dei Hospital.\nThe PN is calling for more investment to promote healthy lifestyles and for the authorities to consider population-based prostate cancer screening. It is also proposing that EU funds are dedicated to further cancer research among children, incentives are offered for investment in cancer medicine and make better use of European reference networks.\nThe party feels there should be psychological support to those affected, especially children, and to assist in patients’ participation in international clinical trials.\nAnother proposal is for the breast screening clinic to be better funded and for a young adults section to be set up at the oncology hospital.\n30 proposals to better respond to the disease\nThe policy document outlines measures for exchanging information with other EU member states prior to rolling out certain policies and calls for Malta to sign the Council of Europe Convention for Bioethics, which gives more rights to patients and researchers.\nFurthermore, the PN wants to make cancer vaccines more accessible.\nNationalist MEP Francis Zammit Dimech said the policy document had been discussed in Brussels with major European stakeholders as well as with medical professionals and researchers.\nStatistics released by the National Cancer Platform earlier this year indicate that an average of one in every four deaths in Malta is caused by cancer, with the disease accounting for 29 per cent of all male deaths and 24 per cent in the case of females.\nMedical practitioners estimate that about 40 per cent of cancers could be preventable, with cigarette smoking and excess body weight the most common cancer-causing risk factors.\nResearchers say that the cancer death rate has been falling across the EU, although the total number of deaths is rising due to population increases.", "comment_count": 3, "id": 422}, {"keywords": "", "author": "Claire Caruana", "article_body": "A customer centre was inaugurated on Wednesday at Crane Currency's Malta plant to showcase the currency printer's work to its clients.\nPrime Minister Joseph Muscat, who unveiled a commemorative plaque, hailed the company’s achievements, saying that in just 53 weeks, not only was the facility up and running but it had “exceeded expectations”.\nDr Muscat said that although the company had initially envisioned employing some 200 people, this number had already shot up to 350 workers.\nHe insisted that each job with the currency printer was a “quality job”, with employees enjoying not only good wages but also good career prospects.\nCrane Currency, he said, was the biggest investment the island had in 30 years.\nThe company started production in 2017, printing its one billionth banknote at its Malta facility 10 months later.\nMalta Enterprise has financed the €27 million tailor-made factory in Ħal Far and the government agreed to guarantee most of the loans needed by Crane to buy its machinery and plant equipment.\nMalta Enterprise further agreed to subsidise interest rates on loans acquired from Bank of Valletta.\nThe facility had made headlines before opening its doors after it emerged that the company of Prime Minister chief of staff, Keith Schembri, would be servicing the Crane Currency machines. When announcing the deal, Dr Muscat had described his top aide as being the “catalyst in making sure things got done”.\nWhile Dr Muscat had said that there was no conflict of interest involving Mr Schembri,  the chief of staff later admitted in a statement that his company “may” be tasked with servicing the Komori machines if Crane Currency decided to buy them, “as had been the case with the other company in the currency industry that operates in Malta”.", "comment_count": 9, "id": 423}, {"keywords": "", "author": "Claire Caruana", "article_body": "The prime minister will be deciding whether or not to publish the entire Egrant inquiry report once a court hands down a decision on whether the Opposition should have a copy.\nIn reply to questions by the Times of Malta on Wednesday, Prime Minister Joseph Muscat said that despite having promised to publish the report, he had refrained from doing so out of respect towards the proceedings in court instituted by the leader of the opposition.\n“I will keep my promises but I think that out of respect towards the courts, now that there is a case in court, which I did not open, and which I am to understand will be decided in the coming weeks, I think that out of courtesy and respect towards the institutions, I will await the court decision.\n\n“I will then see what this will say and then I will decide,” Dr Muscat said.\nPressed further to say whether he would still go ahead and publish the entire report, as per his promise in July, even if the court decides to not give Dr Delia access to the entire report, the Prime Minister insisted that he would go through the court judgement, review the reasons behind the decision and then decide.\n“I have no intention to not publish what is in the inquiry. Had I known what the conclusions would say, I would have stopped there as that would have been enough but I made the pledge before I knew what the conclusions of the report were,” he went on.\nThe court is expected to decide on whether to provide the Opposition with a copy of the report on May 14.", "comment_count": 25, "id": 424}, {"keywords": "", "author": "Claire Caruana", "article_body": "Prime Minister Joseph Muscat on Wednesday morning insisted that the masterminds behind the murder of Daphne Caruana Galizia will be charged once there is all the evidence in hand.\nDr Muscat took questions from journalists following the inauguration of a Crane Currency centre designed to showcase the company’s work to its clients.\nAsked whether the police were close to charging the masterminds who ordered the car bomb that killed Ms Caruana Galizia following reports in November that the investigation was “at a very advanced stage”, Dr Muscat insisted that he would not comment on specific details. This, he said, “was of no good to anyone” and reiterated that the investigations needed to take their course.\n“This is for the simple reason that to prosecute there has to be all the evidence in place and I do not think that it is in anyone’s interest to take action and then a year or two down the line, when the processes get underway, it emerges that there isn’t enough evidence against those being charged in court.\n“I am not saying that there isn’t, I am just saying that we need to let the prosecutors do their work,” Dr Muscat insisted. He then went on to “appeal to the media” to not give criminals an advantage when they came to phrase certain issues.\nThe Sunday Times of Malta reported last month that the police needed to gather more “rock solid evidence” before interrogating and proceeding against other suspects believed to be closely connected with the journalist’s murder.\nIn November, sources had told The Sunday Times of Malta that the investigation into those behind the car bomb was at a “very advanced stage”.\n ", "comment_count": 219, "id": 425}, {"keywords": "", "author": "", "article_body": "Minister Helena Dalli’s husband has filed a judicial protest claiming that his rights were breached by an appeals court, which dismissed a libel case he had opened over articles in the Times of Malta.\nPatrick Dalli had filed two libel suits against former Times of Malta journalist Caroline Muscat over a series of articles investigating irregularities in works carried out in Dalli’s property in Żejtun.\nIn July last year the Court of Magistrates had condemned Muscat to pay a total of €10,000 in libel damages, but this judgment was overturned on appeal earlier this month.\nIn the judicial protest against the Justice Minister, director of courts and attorney general, Mr Dalli attacked the reasoning used by the Court of Appeal.\nThe court had gone beyond the facts of the case he said, using “totally incorrect and surprising” arguments and “passing comment on his financial liquidity”.He argued that the court had not taken into account real estate assets and what he was set to gain from the sale of properties.\nMr Dalli dismissed the articles about his Żejtun works as “venomous and untrue” journalism provoked simply because he was married to an MP.\nIn the appeals court ruling, Mr. Justice Anthony Ellul had praised Mr Dalli’s wife, minister Helena Dalli, for taking the criticism on the chin.\n“[This is] a classical example where the libel laws were not used by a public person as a political weapon against freedom of expression, and it serves as an example,” the judge had said.  \nMr Dalli said that that compliment had been given “sarcastically and cynically” and said the reasoning given in the judgments prejudiced his right to family life, he said.\nMr Dallia said he is seeking legal remedy and would be holding defendants liable to damages if this was not forthcoming.\nThe protest was signed by lawyers Edward Gatt and Mark Vassallo. ", "comment_count": 0, "id": 426}, {"keywords": "", "author": "Edwina Brincat, Philip Leone-Ganado", "article_body": "Jordan Azzopardi, the suspected mastermind behind a cocaine and heroin trafficking ring faced court today for the start of the compilation of evidence. The court heard that:\n\nPolice tracked Azzopardi's operations for several months, raiding trafficking houses in Birkirkara, Balzan, Marsa, Gżira and Pietà;\nThe houses were sophisticated operations, equipped with stone barricades, CCTV, and acid tanks to destroy the drugs in the case of a raid;\nPolice also uncovered a counterfeit cash scheme where Azzopardi and two accomplices would make small purchases with fake €100 notes;\nAzzopardi was arrested on March 13. He attempted to flee but was captured a short distance away;\nPolice searched a residence and garage in Madliena and a farmhouse in Madliena, discovering drugs and drug paraphernalia, weapons, cash, and numerous laptops and car keys. \n\nAs it happened:\n1.05pm\nThe prosecution asks for the counterfeit banknotes to be examined by the Central Bank. The court upholds the request and orders the Central Bank governor to appoint an official to carry out the examination and report to the court. Mr Azzopardi has pleaded not guilty.\nDefence lawyer Arthur Azzopardi also requests the court registrar to appear at the next sitting to show a list of pending cases against the two men who supplied information to the police.\nThe case has been adjourned until March 29. \n12.55pm\nAnother police officer now takes the stand. He gives a similar testimony about the black Skoda Fabia and the trail of counterfeit notes. Inside the car, he said, were a male driver and a woman in the passenger's seat, soon joined by a third man. \nPolice tracked the car to Għargħur, checking out a number of shops visited by the trio. Shopkeepers described an \"elderly looking man, dressed in black\" tendering a €100 note. Officers identified themselves as police and collected the suspected counterfeit notes. \nThe witness identifies Azzopardi and the 30-year old woman in court. \n12.50pm\nNext to the stand is a sergeant from the Drugs Squad, who recounts his involvement in Azzopardi's arrest on March 13. He says he saw a man, the 66-year old Abdilla, exit a shop and followed his car - the black Skoda Fabia - to San Ġwann, where the man entered and exited another shop. \nWhen police entered, the shopkeeper asked whether they had come because of the €100 he had just received, and which he said seemed fishy.\nThe sergeant says his suspicions were confirmed, and he followed the suspect's trail, checking for other counterfeit currency at the shops he visited. \n12.45pm\nBefore stepping off the stand at the end of his testimony, Inspector Mark Anthony Mercieca is cross-examined over the 30-year old woman's case. He is asked babout the key found in her possession and the search warrant.\nOn Azzopardi's case, he is asked about the credibility of the two male witnesses who had given information. The inspector says one of the men had been investigated over drug related charges.\n12.40pm\nThe police inspector provides some more details about the counterfeiting side of Azzopardi's activities. Mario Abdilla, the third man police had spotted in Azzopardi's car, told police Azzopardi would get him to 'cash' €100 notes, giving him €10 in return. The two would meet at McDonald's car park in Għargħur.\nHowever, it emerged at the arraignment on Friday that Abdilla had ended up empty-handed. \nUpon exiting the shops after spending the fake notes, Abdilla would hand cash to the woman who was waiting for his return in the car. Abdilla was arraigned with the other two on Friday, admitted, and was jailed. \n12.35pm\nAfter searching a house in Madliena and garage nearby, the police inspector testifies, Azzopardi was told the police wanted to search a farmhouse in San Martin, and asked to speak to a lawyer.\nThat day, he had a slight accident at the police headquarters when he slipped down some stairs and was taken to hospital for treatment, the inspector says. Police went to the farmhouse with Azzopardi the next day. He indicated the key to the door. Police cars had been patrolling the villa since morning.\nInside were several car keys, bullets, cannabis grinders, and a loaded firearm inside a bedroom cabinet. Also inside were five laptops and an extra passport, spoons with a whitish substance and other drug paraphernalia. \nAfter the search Azzopardi was conducted back to the police lockup where he spoke to his lawyers. \n12.30pm\nThe police inspector is now describing the arrest of Azzopardi and two suspected accomplices. The 30-year old woman was arrested at a Madliena residence, while Azzopardi attempted to flee before being captured at a McDonalds car park in Għargħur. \nThe woman refused to cooperate, the police inspector says. A key in her possession opened the Madliena premises. On Azzopardi's person, police found two mobiles, two suspected cannabis joints and eight keys in separate bunches. A search of the house also yielded cannabis buds, an amount of cash, keys to two cars, a knuckle-duster and several laptops.\nThe search continued on to a garage in the vicinity, also owned by Azzopardi.\n12.25pm\nShadowing of Jordan Azzopardi revealed he was using a black Skoda, with a woman in the passenger seat. A third person, 66-year-old Mario Abdilla, would often enter shops in the Sliema area, paying for small purchases with a fake €100 note. \n12.20pm\nInspector Mark Anthony Mercieca testifies that the trafficking-houses were equipped with stone barricades, acid tanks and CCTV. Acid was used to dispose of the drugs to prevent discovery by police. According to one arrested man, Jordan Azzopardi was allegedly violent against his workers and users. Police began surveillance on Azzopardi directly. \n12.15pm\nInspector Mark Anthony Mercieca is the first to testify. Over the past months, he says, police received information that Jordan Azzopardi was trafficking drugs from various locations.\nSurveillance operations kicked off and police carried out their first raid in October in Birkirkara, followed by another raid at Savoy Gardens, Gżira. One man arrested indicated Azzopardi as his supplier.\nFurther raids were carried out in Balzan, Marsa, Gżira and Pietà, leading to the identification of Azzopardi as the mastermind behind the trafficking and the setting-up of the various operations. \n12.10pm\nJordan Azzopardi has been escorted from the lock-up and is brought into court, smartly dressed in a blue suit. Seated at the other end of the dock is the 30-year old mother-of-five, whose name cannot be published, also arraigned last Friday in relation to the same case.\nMagistrate Doreen Clarke is presiding. Lawyers Alfred Abela and Rene Darmanin are appearing for the accused. Lawyer Arthur Azzopardi is representing Mr Azzopardi.\n12pm\nJordan Azzopardi, 29, from Madliena, who stated that he worked in the waste sector, has pleaded not guilty to a multitude of charges ranging from trafficking and aggravated possession of cocaine, heroin and cannabis to criminal conspiracy and circulation of fake cash.\nHe is also charged with defrauding three shops in San Ġwann and Sliema, having an unlicensed weapon, making threats and hurting a third party and also breach of bail.\nHe was one of three, including a 30-year old mother of five, arrested during police raids in Madliena and St Paul’s Bay over two days last week. He did not request bail.\nThe sitting is scheduled to begin shortly.", "comment_count": 0, "id": 427}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Malta’s economic surplus should be invested in increased paternity and equal parental leave, which would help bridge the gender employment and pay gap in the long-run, according to Nationalist MEP David Casa.\n“Malta has a growing economy and the government has been boasting a surplus. Wouldn’t it be better if this surplus is invested in initiatives that will also benefit the government in the long run by bridging the gender gap?” he asked.\nMr Casa was speaking to the Times of Malta as the proposed Work-Life Balance directive, which he led and negotiated – a first for a Maltese MEP – awaits a final vote in the European Parliament in April before becoming law.\nDavid Casa\nThe directive would introduce 10 days of paternity leave, remunerated at not less than the national sick pay level, and two months of paid leave for each parent that can be used until the child is eight years old.\nThe aim of the directive was to ensure parents shared the responsibility of their children’s upbringing from the very beginning, Mr Casa said.\nFathers in Malta enjoyed only a single day of birth leave, meaning that if their child was born towards the end of the year and the mother suffered post-natal complications, the father would not be able to lend a hand because he would have probably used up all his leave for the year, Mr Casa noted.\nThe directive has divided opinion, with some saying the 10-day paternity provision is not enough and others questioning the financial burden of increasing paternity leave entitlement.\nMr Casa said his team had tried to find the middle ground as it faced resistance from some employers, who argued this was going too far, while unions insisted it was not enough.\nThough the government needed to consult with businesses and small and medium enterprises, birth leave was a social service, something that was paid up by the State worldwide, he pointed out.\nThe proposed standards were the minimum that would set uniformity across the EU while remuneration was up to the individual member states.\nIn Malta, mothers have 18 weeks of paid leave with a further four months of unpaid leave available for either parent to use. The four-month period was usually used by the mother and Mr Casa noted that their pension suffered as a result since they did not pay national insurance contributions during those particular four months.\nWe shouldn’t look at these rights as an extra expense but as a change in mentality\nApart from introducing 10 days of paid paternity leave, the EU directive would lay down that those four months parental leave would also be paid and made available to parents during their child’s first eight years. This measure would be non-transferrable, meaning that two months have to be taken by the father and another two months by the mother, in consultation with the employer.\nMaternity leave provisions, which are the remit of individual member states, will not be affected by the directive.\n“This is a small step to start bridging the gender gap, which costs Malta millions of euros each year. Equal parental leave will help start closing the gap as women will continue working and, therefore, making their national insurance contributions,” Mr Casa said.\nLosing a female employee was also a burden on the employer who would have to find a new recruit and provide training.\nThe directive would also introduce the right for employees to request flexible working arrangements and five days of annual leave being granted to workers to care for sick relatives.\nAs with its other provisions, the five-day entitlement was just a minimum condition. In Belgium, for example, rather than five days every year, workers are allowed the equivalent of a whole year in carer’s leave throughout their career, Mr Casa added.\nAnother option would be for the government to accumulate an employee’s carers’ leave over the years so they can use it when they really need it. This would also help governments save money in the long-term, considering that residential and geriatric care was partly-subsidised by the State.\n“The directive is a good start. I’m convinced that, after a few years, we will start seeing a big positive effect on our economies,” he said.\n“We shouldn’t look at these rights as an extra expense but as a change in mentality.\n“Women have careers and we need them to remain working as they make an important contribution to societies. It is unfair that they have to sacrifice their career,” he remarked.\nAsked about increasing paternity leave and whether the government was willing to carry the financial burden of the directive, a spokesman for the Equality Minister said the government was “fully committed towards sustaining a strong work-life balance”.\nIt had a mandate to do so and had already introduced several measures to this end, such as the increased vacation leave in compensation for public holidays falling on weekends, he said.\nAs it did in previous transpositions of EU directives, the government would engage with all social partners and interested parties to identify the best way to implement the directive.", "comment_count": 56, "id": 428}, {"keywords": "", "author": "", "article_body": "The Democratic Party on Monday will be voting alongside the government in parliament for the setting up of a Regional Development Authority for Gozo, breaking ranks with the Nationalist Party, which is to vote against.\nThe PD said on Monday that the authority was in line with its vision for Gozo, reducing the ability of the minister responsible for Gozo to run it like his or her own personal fiefdom.\nBut the Nationalist Party argued last month that the authority would be appointed and controlled by the minister.\nPN leader Adrian Delia told a press conference that the PN wanted to see the setting up a regional council for Gozo that would be elected directly by Gozitans and would have executive powers on all that affected Gozo and its development.\nThe PD in its statement on Monday said it hoped that the Labour government, \"now notoriously famous for its toxic tentacles in supposedly autonomous state institutions\" would give the new authority for Gozo the space to deliver what it had been created to produce.\n\"Legislating is useless unless the will exists to give life to that legislation,” stated party leader Godfrey Farrugia.  ", "comment_count": 4, "id": 429}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 4.30pm, adds Birdlife press conference\nHunters are expected to ask for permission to shoot a protected bird when they lobby for a spring hunting season at a decisive meeting scheduled for Wednesday.\nAs the migration season, which sees thousands of birds fly over the island, fast approaches, the government’s consultative Ornis Committee will meet this afternoon to discuss whether or not a spring hunting season should be opened this year.\nMade up of conservationists, hunters and regulators, the committee makes recommendations, which the government then decides whether to approve and implement.\nWednesday’s meeting, being held behind closed doors, is expected to see hunters push for this year’s season to allow them to hunt for turtle dove, a protected species environmentalists and EU lawmakers are adamant should be off-limits. The government had declared a moratorium on turtle dove hunting in 2017 after the European Commission had threatened legal action against the island if the practice was allowed to continue.\nFor the past two years, hunters have only been allowed to hunt quail in spring.\nSpring hunting is not allowed by the EU’s Birds Directive but member states can apply an exception, known as a derogation, which has to be justified with the Commission afterwards.\nTurtle doves are considered a “near threatened” species across the EU as population numbers have been steadily decreasing since the 1980s.\nSources said hunters are expected to urge the committee to recommend Malta invokes the directive exception and allow hunting, not just for quail but for turtle doves, too, as soon as this coming season.\nThe sources told the Times of Malta the hunters’ lobby, FKNK, had drafted a document in which it argues that turtle dove numbers have not been impacted by the government’s imposed moratorium and, therefore, hunting them is far more sustainable than environmentalists had previously claimed.\nRead: Just 2,000 hunters and trappers reported catches in 2017\nGovernment sources indicated the lobby group had already expressed its wish for turtle doves to be put back on the hunting menu in recent months.\nThe sources were coy on whether the government was likely to meet such demands, saying only the authorities were being “cautious”.\nAlthough turtle dove hunting has been technically illegal since 2017, environmentalists argue that it nevertheless continued unabated. They say the government introduced the moratorium to placate Brussels while opening a quail hunting season in spring as a “smokescreen”, giving hunters a way out to shoot turtle dove under the EU’s radar.\n“The spring hunting season was limited to quail on paper but it was open during the peak migration of turtle doves. The result was hunters shooting this species illegally,” veteran conservationist and BirdLife Malta CEO Mark Sultana said.\nDuring last year’s spring season, BirdLife had reportedly recorded 148 “illegal killing incidents”. A third involved protected turtle doves.\nDon't risk being taken to EU court, conservationists warn\nThe government would risk Brussels stepping in to block spring hunting altogether if turtle doves were put back on hunters’ list, Birdlife Malta warned on Wednesday.\nBirdlife Malta CEO Mark Sultana\nAddressing a press conference, Birdlife chief executive Mark Sultana told reporters that if the government buckled to pressure from the hunting lobby and allowed them to shoot at turtle doves this year, the likelihood would be that the European Commission would take the island to the European Court of Justice.\nThis, he said, could even see the Commission push for an interim measure that would stop the government from opening any hunting season whatsoever.\nMr Sultana was reacting to reports that the hunting lobby would this evening be lobbying the government to put turtle doves – a species classified as “vulnerable” – back on the hunting menu.\nThe government, he said, had already shown it was willing to accommodate hunters but it should not buckle to pressure just because the European Parliament elections were fast approaching.\nMr Sultana also took aim at hunters’ claims that spring hunting was a Maltese tradition.\n“Spring hunting is something done by only a small number of people, and does not unite the country – quite the contrary,” he said.", "comment_count": 79, "id": 430}, {"keywords": "", "author": "", "article_body": "The following are the top stories in the newspapers on Wednesday.\nTimes of Malta reveals that hunters are expected to ask for permission to shoot turtle dove when they lobby for a spring hunting season at a decisive meeting of the Ornis committee on Wednesday.\nIt also reports that extensive excavation works to turn a rural area in Xewkija into a park and ride facility and a bus terminus have started although planning permits have still to be issued.\nThe Malta Independent says most unions and associations are in favour of retaining summertime all year round. It also says a development application for 60 dwellings near Madliena has been withdrawn. \nIn-Nazzjon and Malta Today lead with a PN proposal for a hybrid vote-counting system to ensure transparency as electronic vote-counting is introduced. \nMalta Today also reports that the authorities are investigating three cases of measles.\nl-orizzont says the compilation of evidence starts in court on Wednesday against Jordan Azzopardi, who is alleged by the police to be a drug trafficking circle mastermind.  ", "comment_count": 0, "id": 431}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "St Julian’s residents are rallying to protect one of the oldest preserved streetscapes in the town from development plans they say would destroy the area’s intangible heritage.\nA development application recently published by the Planning Authority proposes the demolition of a pair of adjacent two-storey houses in the upper part of St Elias Street, to be replaced by a six-storey apartment block.\nWhile the houses themselves are believed to hold little heritage value, the area is characterised by a largely uniform row of two-storey houses, many of which have been restored in recent years.\n“This is the core of St Julian’s. It is within the boundaries of the old walled city, which was mentioned in a census from before the time of the Knights,” resident John Vassallo told the Times of Malta. “Compared to what has happened in Sliema and the rest of St Julian’s, it still has a quaint and picturesque quality.”\nDr Vassallo, who is organising opposition to the project, said the proposal would stick out like a sore thumb in the narrow street due to its height and contrasting architectural style.\nHe called for the application to be rejected on the basis of planning policies limiting the height and protecting the aesthetic context of the area, as well as on the basis of the intangible heritage the streetscape represented.\n“There is a value in the streetscape of an old village core,” he said. “This is being challenged by people with no sense of beauty, no sense of continuity and no sense of a cultural way of life.”\nResidents, together with heritage groups, are expected to file formal objections before the close of public consultation on April 4.\nEarlier this month, Planning Authority board chairman Vince Cassar lamented the loss of Malta’s traditional streetscapes as the regulator voted to reject plans for an apartment block in place of a scheduled 19th-century Sliema townhouse in a well-preserved row on Cathedral Street.\nMr Cassar insisted on that occasion mistakes committed in the past could not continue to be used to justify new damaging developments.", "comment_count": 60, "id": 432}, {"keywords": "", "author": "", "article_body": "Updated Wednesday 3.35pm\nCocaine with an estimated value of €32.4 million was found hidden inside four containers at the Malta Freeport, Customs announced on Tuesday evening.  \nThe drug haul was made after Customs officials scanned 12 containers coming from a country in South America and bound for an unnamed EU member state. \nFour of the containers, which were loaded with fruit, were flagged during scans.\nIn three of them, packets were spotted in refrigerant compressor compartments. In the other, suspicious packages were noted hidden behind the panelling of an inner compartment.\nPhysical searches of the four containers revealed their true contents. The containers were carrying 96kg, 82.8kg, 64.8kg and 44.4kg of cocaine respectively.\nIn total, Customs officials found 240 packets of the drug weighing a total of 288kg.\nThis was the second largest cocaine haul ever by the customs at the Freeport. It did not seem any Maltese were involved.\nAddressing a news conference on Wednesday, Customs director general Joseph Chetcuti said a new specialised unit at the Freeport which started operations in January last year.\nIn the past 15 months this led to the discovery of 16 tonnes of cannabis and 633 kilograms of cocaine.\nFinance Minister Edward Scicluna hailed the haul as a very good certificate for the Maltese authorities in the fight against organised crime and drug trafficking.\nTourism Minister Konrad Mizzi, who is also responsible for the Freeport, noted that similar equipment would soon be installed at the Malta International Airport.\n\n\n\nThe case is now the subject of a police anti drug squad investigation. An inquiry is also being held. \nOther big cocaine hauls were made by Customs last year.\nIn February of 2018, 100kg of cocaine were detected in a container at the Freeport and sent under controlled delivery  to Croatia, where a huge criminal gang was arrested.\nIn November, 44kg of pure cocaine was found in a container reefer arriving from Equador.\nAnother €5 million worth of cocaine was found in container headed to Greece in December.", "comment_count": 51, "id": 433}, {"keywords": "", "author": "", "article_body": "A report proposing lifting the moratorium on spring hunting has been submitted to the government and the Nationalist Party by the Federation for Hunting and Conservation.\nThe report, “Traditional Turtle Dove Hunting in Spring on the Maltese Islands – Lifting of the Moratorium”, is based on research and studies undertaken by the FKNK since the introduction of the moratorium in 2016.\nThe FKNK said that, on the basis of the findings, results, discussions and relative validation analysis made in the report, the FKNK believed that the Maltese government can immediately lift the current moratorium.\nIt said that since the report thoroughly demonstrated that Malta’s turtle dove spring harvest had a nil effect on the breeding populations in Europe’s reference population countries, the government could apply a derogation to permit turtle dove hunting in the spring of 2019.\nThe report, the FKNK said, was carried out without prejudice to the hunting of the quail in spring. \nThe FKNK urged the government to show its political will and immediately open discussions with the European Commission for a long term solution to be reached on the matter.", "comment_count": 25, "id": 434}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Pressure is being mounted on the Finance Ministry to approve the renewal of a lucrative IT contract provided at Mater Dei Hospital by a company owned by the husband of Health Minister Chris Fearne’s chief of staff, Finance Ministry, sources told Times of Malta.\nHealth Minister Chris Fearne with Carmen Sammut.\nThe sources said that as a contract connected to the maintenance of the Patient Administration System – known as CPAS – is coming to an end in a few months’ time, pressure is being mounted on the Finance Ministry to approve a direct order contract to Cursor Ltd to continue with the job without the need for a new tender.\n“They (the Health Ministry) want us to issue the CPAS contract renewal through a direct order to the same company supplying the system since 2013. This is not on and we are resisting it as technology changes and other operators should be given a chance. However, pressure is increasing week-in-week-out and it will soon reach our minister,” a senior official said on condition of anonymity.\nAsked to state when the current contract with Cursor Ltd will expire, how much has the company been paid so far and whether a new public tender will be issued, a spokeswoman for the Health Ministry at first refused to give any information citing “commercial and confidential” reasons.\nHowever, when Times of Malta insisted there was nothing commercial in stating when the current contract will elapse, the spokeswoman said this will expire in November. However, she did not reply on whether a new public call, according to government procurement rules, will be made.\nOwned by Mark Sammut, a former collaborator of disgraced Nationalist Party finance minister John Dalli, Cursor Ltd has been the recipient of a number of government tenders and direct orders in the past years despite that its owner was also a senior Transport Malta official when the authority was headed by former Labour CEO James Piscopo.\nPressure is increasing week in week out and it will soon reach our minister\nHis contract was terminated as soon as Transport Minister Ian Borg took over.\nMr Sammut’s wife, Carmen, the owner of Mall Systems Ltd – another IT company registered at the same offices as Cursor Ltd and the recipient of a number of other government jobs – was recently recruited by Health Minister Chris Fearne as his ministry’s chief of staff.\nDespite industry sources claiming clear conflicts of interest in Ms Sammut’s new role and her connections to the IT companies providing services to the government, including the Health Ministry, Mr Fearne defended his choice stating his chief of staff was not directly involved in the IT business.\nMr Fearne is considered to have embarked on an unofficial campaign trail to replace Prime Minister Joseph Muscat as Labour leader when he steps down. Sources insist that Ms Sammut, hailing from his constituency, is exclusively working on his bid.", "comment_count": 20, "id": 435}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The relaxation of the rule of law, especially among European Union newcomers, could become a dangerous tendency, Andrius Kubilius, who is running to be the next secretary general of the Council of Europe, has warned.\nThe Council of Europe, founded in 1949, is an international organisation aimed at upholding human rights, democracy and the rule of law in Europe. It has 47 members.\nLast year, the Council of Europe’s rule of law experts – or the Venice Commission – said Malta needed better checks and balances to ensure a proper rule of law system on the island.\nMr Kubilius, a former Lithuanian Prime Minister, said during a brief visit to the island he was still getting familiar with the rule of law situation in the various member states, however, he called on all governments to carefully heed the commission’s advice and implement recommendations.\n“When looking into rule of law and democracy issues I’ve noticed that the relaxation of standards, especially among EU newcomers, can become quite a dangerous tendency,” he remarked.\nMr Kubilius added he was optimistic about the current discussion within the EU in creating some link between structural assistance and rule of law values in each country. If a country failed in implementing rule of law standards, then it could have problems getting access to structural assistance, he continued.\nThere had to be some kind of early warning system that raised the alarm about increasing populism in member states\nSince the announcement of his candidature, the issue of a “crisis” featured in conversations Mr Kubilius had with European ambassadors.\n“I joked that since I faced two economic crises during my tenures as prime minister in Lithuania [1999 to 2000 and 2008 to 2012], I am fit for the job,” he said.\nMr Kubilius referred to a “situational crisis” the Council of Europe was dealing with following the suspension of the Russian delegation’s voting rights as a consequence of Crimea’s annexation, followed by Russia’s decision to stop contributing to the CoE’s budget.\nHe said that while, on one hand, it was important to have the Russian delegation on board, on the other hand it was also essential for the CoE to retain authority in defence of its values.\nHailing from Lithuania, he believes he could help the Russia-sceptics and the Russians reach some middle ground.\nAnother challenge the organisation was facing was a deficit of proper understanding of a long-term plan when it came to democracy, he said.\nWhile democracy in Europe was being increasingly challenged by the rise of populism and radicalism, the CoE had no proper legal or institutional framework, he pointed out. There had to be some kind of early warning system that raised the alarm about increasing populism in member states, Mr Kubilius added.\nHe was asked about abortion rights in Malta, following comments by Nils Muižnieks, who served as the CoE’s commissioner for human rights from 2012 to 2018, that the island’s ban on abortion contradicted the norms of international human rights law.\nThe ban denied women a range of fundamental human rights and the Maltese authorities should remedy this situation, he had said.\nMr Kubilius noted that, while a total liberal approach was not acceptable, from a human point of view it was no easy situation for women.\n“We need to look at the issue from the point of view of the women considering abortion and show sympathy if they are suffering,” he said.\nAcknowledging he was not familiar with Maltese regulations, he proposed taking a look at the Lithuanian example. There, he said, abortion was legal until the 12th week of pregnancy and up to 22 weeks for medical reasons.", "comment_count": 15, "id": 436}, {"keywords": "", "author": "", "article_body": "Just when you thought it was safe to pack your umbrellas and take out your beachwear, you might want to rethink your plans. \nThree days of showers and strong winds are forecast, starting from Wednesday, according to the Meteorological Office.\nRain and wind, reaching gale force strength, are expected on Wednesday and Thursday, the first day of spring.\nA thunderstorm is forecast for Friday as an upper level trough forms over the central Mediterranean.\nThe weather is expected to be fine by the weekend. \nMalta has been basking in sunshine and warm weather since Saturday, a welcome reprieve after a wet winter and the most violent storm since 1982.\nRead: Destruction across Malta as gale-force winds batter islands\nThe MIA weather forecast.", "comment_count": 11, "id": 437}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "An appeal is expected to be heard this week over the Planning Authority’s refusal to allow the development of six townhouses at a 400-year-old garden in the heart of Lija.\nThe developer filed the appeal after the Planning Authority last December turned down his request to demolish the large garden on the corner of Triq Annibale Preca in Lija and Triq Sant’Antnin in Balzan. \nThe refusal came following a storm of objections over the plans.\nThe application would have seen the excavation of the 17th-century garden measuring around 920 square metres, including protected citrus trees and garden rubble walls, to create eight basement garages and six two-storey townhouses with swimming pools.\nAll of the proposed dwellings are four-bedroom units, having a gross floor area exceeding 200 square metres. Alterations to the existing townhouse, which includes baroque-period architectural features, were also mentioned in the application.\nThe applicant not only filed an appeal but also submitted fresh plans that reduced the number of proposed townhouses to three. However, the garden itself will still be taken over, particularly with swimming pools. \nSources close to the industry said this was an odd move since the appeal is over the refusal to allow the original plan.  \nThe Superintendence of Cultural Heritage had vehemently opposed the project, saying that the site was an established garden forming part of a property “of evident architectural and historical value”. \nWorld War II shelters also recorded in the vicinity\nMoreover, it said, the property was located within the urban conservation area and was in the vicinity of San Anton Palace, which was a scheduled property.\nWorld War II shelters were also recorded in the vicinity of the proposed works, it added.\n“The Superintendence notes that the proposed development is both intensive and extensive, with an undeniable and negative impact both on the property and on the streetscapes in two streets within the urban conservation area,” it added.\nThe Lija local council had also objected to the destruction of the 400-year-old garden at the crossroads of the Three Villages.\nThe council’s was one of 150 objections submitted to the PA, many citing the loss of the historic garden, the increase in traffic and the intensification of development in an urban conservation area, which objectors say will also set a precedent.\nThe PA said the developer could not submit fresh drawings at this stage as this changed the substance of the proposal. \nIt said it stuck to its original position opposing the planned development and argued that the appeal should be thrown out.", "comment_count": 33, "id": 438}, {"keywords": "", "author": "Keith Micallef", "article_body": "Roadworks by State agency Infrastructure Malta at Il-Lunzjata, in the limits of Rabat, have resumed just days after the Environment and Resources Authority issued a stop and compliance order.\nThe environment watchdog intervened in the wake of complaints that a project to resurface some country roads was being carried out in breach of environmental regulations. \nThough the agency is refuting the claims, this was the second such incident in a few days. \nIn the first instance, work in the area of Wied l-Isqof, also in the limits of Rabat, fuelled outrage amid concerns that country lanes were being transformed into fully-fledge arterial roads. Subsequently, the ERA issued a stop notice saying the work was causing environmental destruction. \nIn the case of Il-Lunzjata, the alarm bells were sounded last Sunday by biodiversity expert Alfred Baldacchino. In an e-mail to the ERA, he expressed his concern that such works would result in further destruction of biodiversity.\nHe insisted that he was not against improving access to farmers as long as this would not encroach on adjacent virgin land, outside the road’s footprint. \nReplying to questions from the Times of Malta, an ERA spokeswoman on Monday said that a stop and compliance order had been issued. \nIt has also taken note of the concerns being raised\nHowever, following an on-site visit, it transpired that work at Il-Lunzjata had resumed. Though the Times of Malta alerted the ERA about the matter, it could not be established if work had resumed with the authority’s consent or not.  \nAn Infrastructure Malta spokesman denied that roads were being widened. While making no reference whatsoever to the stop and compliance order issued by the ERA, he noted that the latter were being consulted on any additional protective measures or interventions that may be necessary. \n“It has also taken note of the environmental concerns being raised about these road improvement works.\n“The agency is following the guidance of the authorities to ensure that while the required improvements for farmers are implemented without further delays, the surrounding rural environment is duly safeguarded,” the spokesman said. \nInfrastructure Malta pointed out that the project was part of a wider plan to reconstruct over 40 kilometres of rural roads.  \nThe spokesman said that concrete, asphalt and other materials were being replaced with stronger foundations and new surface layers.\nAs for the criticism that all vegetation at the side of the road was being destroyed and covered in concrete, the agency said, that this was necessary to strengthen the foundations. It added that reinforced concrete was being used to prevent certain roads from caving in.", "comment_count": 14, "id": 439}, {"keywords": "", "author": "Keith Micallef", "article_body": "The Nationalist Party is proposing a “hybrid system” to resolve what it claims to be serious issues in the electronic counting system, set to be used in the upcoming European and council elections.\nUnder this system, each ballot is manually inspected to verify there is no visible mark which could make the voter identifiable, before it is electronically scanned to determine the voter’s preferences.\nMoreover, the PN is proposing that political parties will only have access to the scans of the ballots for a number of hours during the counting process, rather than up to three months after the election, as the government is proposing.\nDetails of the amendments to the electoral laws being put forward by the PN were outlined on Tuesday during a news conference at the party headquarters by Secretary General Clyde Puli, together with MP Karol Aquilina and Angelito Sciberras from Elcom (the party’s electoral office).\nRead: E-counting system flaws could lead to voter fraud, warns PN\nLast December, the PN had denounced the electronic voting system as flawed, following a number of mock tests. According to the party, the system had been tampered with - without the electoral commission’s knowing.\nMoreover, certain marks on the ballot sheet were not detected, thus fuelling concerns of corrupt practices. The PN had sounded the alarm bells that the system could be abused so that voters would be able to identify themselves, and hence open up the possibility of vote buying.\nIn view of this, the party is now proposing that prior to scanning the ballots, each one of them should be manually inspected to verify it has no physical mark which could make it identifiable.\nMr Puli noted that even a dot could give rise to certain doubts. He added that from recent mock tests on some 600 ballots which were deliberately marked, about 5 per cent were not detected. On the other hand, he said that increasing the sensitivity of the scanners would result in all votes being flagged as dubious.\nMr Puli insisted that this manual process would not delay the process, saying the electronic scanning would still start at about 7am on Sunday, with the final count set to be known in the evening. However, he acknowledged that about 20 per cent of the ballots would be expected to be flagged as dubious, and consequently would have to be counted in the traditional manner.\nOn the other hand, it was pointed out that ballot boxes could be opened up as soon as they reach the counting hall, to speed up pre-scanning process.\nUnder this system the counting hall set up will be similar, with the exception of large monitors to see the voting documents’ scan. Moreover, political parties will still be able to take samples to get a clear indication of the result, and to verify that the final result is in line with their projections.\nThe second PN proposal is to have access to the scanned images of the ballots during the counting process only. Moreover, the party wants to introduce a fine of up to €10,000 and up to a 12-month jail term, for anybody caught stealing these scans.\nMr Puli said that from the talks held so far with the electoral commission there seemed to be the basis for an agreement.", "comment_count": 23, "id": 440}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man charged with drug-trafficking, facing the prospect of life imprisonment, walked out of court free late on Monday night after a week-long trial which ended in a 'not guilty' verdict. A smiling Mr Cardona celebrates the verdict.\nEdward Cardona, 36, from St Paul’s Bay, stood accused of conspiring to traffic cocaine as well as the aggravated possession of the drug in a case which owes its origins to the arrest of a female drug courier at Malta International Airport in 2013.\nOn that occasion, the suspect was found to have been carrying a number of drug-filled capsules inside her stomach, with subsequent hospital checks yielding some 73 capsules bearing almost one kilo of cocaine with a street value of €57,513.\nThe star witness at the trial, whose name could not be published under court order, had told investigators how she had been instructed by an Algerian man from Spain called ‘Obi’, to smuggle the drug into Malta and hand it over to pre-determined customers.\nIn the course of her collaboration with the police, the woman had allegedly recounted how she had visited the island several times, before being stopped and arrested at the airport in July 2013.\nThe woman had cooperated with investigators, later taking part in a controlled delivery operation which led to the arrest of another foreigner.\nDuring her interrogation, the drug mule had recounted an earlier visit to the island back in December 2012 when she had allegedly met “a tall, fat and bald man resembling Uncle Fester from the Addams’ Family,” in order to hand over some 70 capsules of cocaine and a further 20 grams of the drug, in terms of his agreement with ‘Obi’.\nThe woman had identified the accused from six photos shown to her by the police, later confirming her statement under oath.\nThat statement had placed investigators on the tracks of Mr Cardona, who was ultimately arraigned in 2013 over charges of his involvement in the drug-trafficking conspiracy as well as possession of cocaine in circumstances indicating that the drug was not for his personal use.\nThe proceedings had resulted in Mr Cardona’s trial by jury, kicking off on Monday March 11, in the course of which the prosecution had summoned various witnesses, among these the former dru mule who had undergone separate proceedings and had been convicted of importing cocaine on three separate occasions prior to her arrest.\nAlthough the witness had failed to identify Mr Cardona in the course of the compilation of evidence, she identified the accused at the trial, the prosecution arguing that the woman was a credible and consistent witness.\nHowever, the defence team, led by Franco Debono, cast doubt upon the credibility of the witness who confirmed that she had been shown a photo of the suspect by the police - before being asked to identify him as the person whom she had met back in December 2012.\nThe defence argued that the whole identification process had been contaminated, further pointing out that no identification parade had been conducted.\nThis fact, coupled with the fact that the witness had failed to recognise the accused in the compilation stage but had done so at the trial, could lead to a miscarriage of justice, Dr Debono had argued, when making lengthy submissions in the closing stages of the trial.\nThe jurors were “to dismiss the whole identification procedure as inadequate and vitiated”, Dr Debono had concluded.\nAfter almost five hours of deliberation, the jurors returned with a not guilty verdict that read 7-2 in respect of the first ground of drug-trafficking conspiracy and a unanimous verdict of not guilty in respect of the aggravated possession of cocaine.\nIn the light of this verdict, Mr Justice Giovanni Grixti, presiding over his first trial by jury, pronounced the accused not guilty and ordered his immediate release from custody.\nLawyers Nadia Attard and Ann Marie Cutajar from the Office of the Attorney General are prosecuting. Lawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 441}, {"keywords": "", "author": "", "article_body": "Public Health authorities are investigating three separate, unrelated, confirmed cases of measles, as precautions are taken to ensure these cases remain isolated.\nIn 2018, there were five imported cases and one case of local transmission. Since there was no sustained transmission, Malta has till now maintained the status of elimination of measles.\nThe Public Health Authority’s strategic action for measles includes vaccination, early identification of cases, isolation, management of cases, and contact tracing.\nMeasles cases primarily occur in unvaccinated populations in both adults and children.\nLarge outbreaks with fatalities are ongoing in many European countries that had previously eliminated or interrupted endemic transmission. In January 2019, Romania, Italy, Poland, and France had the highest case counts with 261, 165, 133, and 124 cases, respectively and notable increases were reported in Italy, Poland, France, and Austria.\nJust 10 countries were responsible for three-quarters of a global surge in measles cases last year, the UN children's agency said recently.\nNinety-eight countries reported more cases of measles in 2018 compared with 2017, and the world body warned that conflict, complacency and the growing anti-vaccine movement threatened to undo decades of work to tame the disease.\nBut the World Health Organisation last year said cases worldwide had soared nearly 50% in 2018, killing around 136,000 people.\nMeasles can spread with minimal contact through the air via infectious droplets when a person coughs or sneezes. It can be prevented with vaccination with measles vaccine (part of the MMR) which is included in the National Immunisation Schedule.", "comment_count": 10, "id": 442}, {"keywords": "", "author": "", "article_body": "Updated 12.20pm\nTwo pensioners have been hospitalised after their car hit concrete barriers being used to separate lanes during roadworks on Triq Aldo Moro in Marsa.\nThe car, a Mercedes Benz, overturned, trapping the 76-year-old driver from Birkirkara, and his 74-year-old female passenger.\nPolice later said the man was seriously injured but that the woman was only slightly hurt.\nInvestigations are still under way.", "comment_count": 0, "id": 443}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Lija residents are objecting to plans for a five-storey apartment block in a street just outside the village core which currently features only two-storey terraced houses.\nResidents say the proposal in Triq tal-Mirakli, similar to several that have increased across the island since changes to planning policies encouraging such developments, would jar with the streetscape and would have a cascading effect on its surroundings. \nIn representations to the Planning Authority, they argue that the excessive height would tower over neighbouring buildings – all built in similar architectural styles – and that planning policy dictates a more sensitive approach with respect to the existing surroundings.\nThey also argue that the building’s depth would project into surrounding third-party citrus gardens, which they say had so far provided the only greenery in the area.\nMoreover, residents raised concerns about the effect excavations could have, as the row of houses were all built over shared ground beams in the 1970s, over a backfilled quarry known to have been used for the building of the Lija parish church. \nThe Lija local council has not objected to the development, which is open for public consultation until March 29 and has yet to be assessed by the PA. \nResidents say the application is symptomatic of wider changes in Lija and neighbouring towns, where terraced streets are increasingly playing host to more intensive residential developments which are seen as changing the areas’ character. \nBoutique hotel for Lija village core\nThe Planning Authority is also considering a controversial proposal to demolish a traditional farm building within the Lija urban conservation area to build a 24-room boutique hotel, extending into adjacent ODZ fields to include a swimming pool and other facilities. \nConcerns have been raised by both the Environment and Resources Authority (ERA) and the Superintendence for Cultural Heritage (SCH), with the latter highlighting the Merino Street building’s important traditional architectural features and the effect on neighbouring properties. \nResidents have warned that the hotel – rising to a maximum of four floors in a predominantly two-storey area – will have a negative impact on the residential area. \nThe Lija local council has also objected, citing the “unacceptable visual impact” and the “ruin” of the surrounding agricultural area. \nThe council also took issue with the lack of parking facilities in the plans, which it said would exacerbate existing problems and increase traffic congestion in the town.", "comment_count": 68, "id": 444}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A construction firm which planned to build a makeshift ‘village’ to host Turkish construction workers is in pole position to turn some of its ‘unused’ prefabricated units into classrooms for government schools.\nUNEC Ltd a few weeks ago hit the headlines over plans to host Turkish construction workers in a quarry.\nUNEC Ltd submitted the cheapest offer in a tender issued by the Education Ministry for mobile classrooms to host students in St Paul’s Bay and Żejtun, making it the most likely supplier.\nAccording to normal government rules, public tenders are awarded to the cheapest offer, as long as they meet the required criteria.\nIndustry sources said that UNEC Ltd, a subsidiary of construction magnates Bonnici Brothers, made an offer of less than €300,000, opting to “turn their sights on the Education Ministry\" after they had to shelve their 'village' plans.\nThe two other offers received were also submitted by construction firms – Bava Holdings Ltd and Vassallo Builders Ltd – quoting prices much higher than those offered by the Bonnici Brothers subsidiary.\nSome four years ago, due to bad planning and an influx in the population of St Paul’s Bay - particularly through migration - the Education Ministry had to turn to the use of mobile classrooms as the primary school could not cope.\nPlans to build a new school for the area were also severely delayed as the agency responsible for the project, the Foundation for Tomorrow’s Schools, was engulfed in mismanagement and claims of corruption. One of its top managers, a canvasser of the Education Minister, is undergoing criminal charges.\nIn spite of a public commitment by the Education Minister to open the new school next September, a new tender was still issued to buy new mobile classrooms for St Paul’s Bay. Ministry sources described the move as: “Plan B in case the project is delayed once again”.\nAt the same time, the ministry admitted that mobile classrooms are to be introduced at Żejtun’s Secondary as a temporary measure until works on an extension to the school are completed. Even in this case, work has been hit by delays.\nMeanwhile, construction industry sources expressed surprise at UNEC Ltd's offer, since the company normally trades in heavy plant for construction including mechanical shovels, bulldozers and large machinery.\n“Obviously, the fact that their planned quarry village project had to be abandoned posed a problem as to how to get rid of those mobile homes,” the sources said.\nLast month, the Times if Malta unveiled Bonnici Brothers' plans to build a container and tent village in a quarry in Mqabba to host hundreds of Turkish workers imported to the island for large construction jobs.\nThe employees, paid much better than their average wage in Turkey but still low by Maltese standards, were imported by TACA Construction – an Ankara-based company – which won various projects on the island.\nFollowing the story, Bonnici Brothers stopped the erection of their ‘quarry village’ and TACA announced that it had abandoned its plans to build a temporary residences.", "comment_count": 110, "id": 445}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Tuesday's newspapers:\nThe Times of Malta reports that the prefabricated units that were to be used to house Turkish temporary workers will instead be used as classrooms. It also features the meeting on the Gozo tunnel held on Monday night, during which it was revealed that the ferries pollute 13 times as much as the vehicles that they carry.\nIn-Nazzjon reports on the party’s 30 proposals to cut down on cancer.\nL-Orizzont says that Air Malta has managed to reverse €12 million losses in just one year, as well as stressing that it is parents’ duty to vaccinate their children.\nThe Malta Independent points out that the revision to the fuel station policy is still nowhere in sight, and also reports on the US State Department’s annual report which flagged human rights concerns in Malta.", "comment_count": 0, "id": 446}, {"keywords": "", "author": "", "article_body": "On March 5, 2019 Mapfre MSV Life plc announced the bonus rates for With Profits Plans for the year ended December 31, 2018. \nA Regular Bonus Rate of 2.35 per cent was declared on the company’s core products namely the comprehensive flexi plan (regular and single premium policies), the single premium plan and on the with-profits options of the investment bond, retirement plan and the personal pension plan.  \nA regular bonus rate of 2.25 per cent was declared on the comprehensive life plan (regular and single premium policies) while on the old series endowment and whole life policies, a regular bonus of 1.50 per cent of the basic sum assured plus bonuses was declared. \nIn addition, the board also announced the declaration of a final bonus in respect of comprehensive life plans (single and regular premium), comprehensive flexi plans (single and regular premium) and single premium plans that have been in force for more than 10 years.\nThe final bonus will be paid on claims payable as a result of death or maturity between March 5 and the next bonus declaration, at a rate of one per cent for every year in force after the 10th year of the policy. This final bonus will be paid on the value of the policy account as at the date of death or maturity.\nThe board also approved a regular bonus of 2.25 per cent on those secure growth policies which formed part of the portfolio of business transferred to Mapfre MSV Life from Assicurazioni Generali SpA during 2000. Finally the board also approved a regular bonus of 0.85 per cent on the Alico 78 policies and a regular bonus of 1.10 per cent on the Alico 66 polices which formed part of the portfolio of business transferred to Mapfre MSV Life in 2011 from American Life Insurance Company (Alico).\nOne of the largest managed savings funds in Malta\nThe with-profits fund stood at €1.89 billion at December 31 (2017: €1.79 billion). The fund registered a total negative investment return of €43.1 million compared to a positive €63.9 million in 2017. This represents a negative 2.15 per cent (after fees) net investment return compared with a positive 3.85 per cent in 2017.  \nThe chairman of Mapfre MSV Life, John Cassar White stated: “Although the Mapfre MSV with-profits fund is invested in a very diverse portfolio of assets and is underpinned by a rigorous and prudent investment management process, 2018 was a very difficult and unusual year for long term investors like Mapfre MSV Life as all major assets classes globally registered negative returns. Rarely have real returns been negative across all asset classes in any year and this event happened only twice in the last 25 years. 2018 was also marked by exceptionally volatile equity markets. The S&P 500 plummeted nine per cent in the last month of the year as concerns about recession risk and the future path of interest rate hikes gripped investors − a stark contrast to the growth exuberance that characterised the start of 2018. December’s performance dragged the S&P 500 into the red for the year, marking the first negative calendar year for US equities since 2008.”\nHe added how: “The investment strategy of the Mapfre MSV Life with-profits fund is to hold a diversified range of quality assets and currencies that mitigates against market risk. This asset diversification together with the robust investment management process, the quality of the asset managers engaged and the company’s strong track record of investment management give us confidence that the fund will continue to benefit from upturns in investment markets while minimising the negative impact of increased market volatility.”\nThe chief executive officer of Mapfre MSV Life, David G. Curmi, stated: “The money of our with- profits policyholders is invested in the Mapfre MSV Life with-profits fund. With assets under management of over €1.89 billion and over 74,000 with-profits plans in force, the Mapfre MSV Life with-profits fund is one of the largest managed savings funds in Malta. The size and strength of our fund allows us to invest in a very wide range of global assets.\n“The objective of the Mapfre MSV Life with-profits fund is to offer competitive long-term real returns by smoothing the peaks and troughs of day-to-day market movements while at the same time providing an underlying capital guarantee. This means that with- profits investments remain a good choice for investors seeking steady growth from a spread of investments over the longer term with some downside protection. In these uncertain times the benefits of smoothing and guarantees can provide advantages to with-profits policyholders over other forms of investment.”\nMapfre MSV Life plc (C-15722) is authorised by the Malta Financial Services Authority to carry on Long Term Business under the Insurance Business Act, 1998. Investment returns can go down as well as up and the past is not necessarily a guide to future performance. Changes in the rate of exchange of currencies may also affect the value of investments. \nCom. No: MMSV180319.", "comment_count": 1, "id": 447}, {"keywords": "", "author": "", "article_body": "A 19-year-old Maltese man was stopped from harming himself while he was being held in custody at the police headquarters.\nThe police managed to stop him in time but the man was sent to Mater Dei as a precaution.\nThe incident took place at 7pm on Monday.", "comment_count": 0, "id": 448}, {"keywords": "", "author": "Ivan Martin", "article_body": "Updated 8.20pm\nThe Gozo ferries churned out 13 times the pollution that their cargo of vehicles would generate if they drove through a tunnel instead, a town hall debate on the proposed permanent link heard on Monday night.\nThe debate, organised by the heritage NGO Wirt Ghawdex, drew dozens of concerned Gozitans who filled the main hall of the Don Bosco Oratory in Victoria on Monday evening.\nFormer MP Franco Mercieca from the Malta-Gozo steering committee got the evening underway, laying into “myths” about the proposed tunnel, which he said were clouding the debate.\nThe fear that traffic would increase, should the ferries be replaced by a tunnel, was not necessarily true, he said.\nOn concerns of increased pollution, Dr Mercieca said a recent study had found that the ferries churned out around 13 times that expected to come from traffic in the tunnel.\n“And in the future, once the tunnel is complete, we will be looking at much more green cars - with even less pollution,” he said.\nWhat about the risk of over-development spreading to Gozo if a tunnel were dug? Dr Mercieca said localities like Marsalforn had already been ruined through over-development. The solution to too much building was proper planning regulations, he argued.\n“People say Gozo will lose its charm with a tunnel. But Gozo is losing its Gozitans, and if it loses those, there will be no Gozo left,” Dr Mercieca concluded.\nHe was followed by another seven speakers who addressed the crowd.\nJoe Muscat from the Gozo Tourism Association said the organisation would be drafting a survey and study to see how the tunnel would impact the sister island’s tourism industry. Would Gozo become a day trip destination? Would Gozo still be a different destination to Malta? Or would it become an add-on for a half-day drive around?\nThe solution to Gozo’s problems, he said, was not a tunnel, but to bring Gozo up to the standard of the mainland.\n“Let us make sure that the tunnel does not become the Brexit of Gozo,” Mr Muscat said.\nIf applause could be a gauge of the audience’s position, then those who gathered in the hall seem to be against the introduction of a tunnel.\nSean Zammit from the Association of Gozitan Employees Working in Malta questioned whether the tunnel was truly intended to address Gozitan workers’ problems.\nWas change necessary? Yes, the current situation was not acceptable, he argued, but a vehicular tunnel was not necessarily the solution.\nThe possibility of improving the existing ferry system through the introduction of a fourth ferry, together with a park and ride system and a fast ferry, were raised.\nWeighing in on fears raised earlier by Dr Mercieca about Gozo’s “brain drain problem”, Mr Zammit said this would be solved by bringing quality jobs to the island and not by digging a tunnel.\nJohn Pace, who used to head Gozo General Hospital, expressed concerns that the tunnel was not a solution to Gozo’s problems. Surely, he said, the existing ferry system could be improved to meet commuters’ needs.\nAnd as for Gozitan students? According to the GUG the majority felt a tunnel would be detrimental to the peace and tranquility of the sister isle - a sentiment that drew appeals from the crowd.\nThat said, waking up at 5am to make an 8am lecture in Malta was also not sustainable.\nSamuel Azzopardi of the Gozitan Regional Committee said the matter had been discussed by Gozo’s mayors during a meeting last month to reach a common position. They agreed that an improved link was not only justified but needed.\nAround 3,000 people have signed a parliamentary petition opposing the planned tunnel, which they claim would cause “irreversible harm”. The petition calls on legislators to prevent the permanent link from being built, warning that the tunnel would bring with it increased traffic, noise and air pollution.\nGovernment plans for a 13-kilometre tunnel running from Manikata to Nadur, which could be completed within five years, have drawn criticism over the effect of increased traffic on the sister island, as well as environmental impacts at the entrance and exit points.\nCritics have also raised concern about the massive amount of construction waste the project would generate and the controversial prospect of land reclamation being presented as the only means of addressing the issue.\nStudies, however, have consistently pointed to high levels of support for the project.\nA Social Impact Assessment carried out by Marvin Formosa in 2017 found that around 82 per cent of Gozitan respondents were in favour of the tunnel, with most citing reduced travelling times between the two islands and the lack of weather-related disruption compared to the ferry.\nA later study by Vincent Marmara for Transport Malta confirmed these conclusions and also found similar levels of support among Maltese people. The vast majority of respondents said they would travel between Malta and Gozo more frequently if the tunnel were to be built.\nAlthough environmental studies are still being carried out, the government has made clear its intentions to forge ahead with the project, with a call for tenders planned to be issued in the coming months.\nPrime Minister Joseph Muscat has said the tunnel would be followed by the introduction of free public transport linking Gozo to the airport, Mater Dei Hospital and other strategic locations across Malta, but has ruled out a rail system.\nA call for offers regarding the Malta-Gozo tunnel project is expected to be published within the few weeks.\nThe government has already submitted plans concerning the project to the EU Journal and a 'Prior Information Notice' was published in the EU’s official gazette of record earlier this year.", "comment_count": 100, "id": 449}, {"keywords": "", "author": "Luke Scicluna", "article_body": "The Opposition would be demanding that the accounts of the Local Enforcement System Agency (LESA) be tabled in the House of Representatives, said MP Robert Cutajar.\nMr Cutajar referred to the LESA reform in negative terms, arguing that local councils had lost the sway that they had once had over where local wardens - now known as community officers - were deployed. The MP also questioned whether the new post of LESA deputy CEO was a new opportunity for someone close to the government to continue “to eat at the trough”.\nMr Cutajar was speaking in the context of amendments to the Local Councils Act, in favour of which the Opposition would be voting. He expressed the Opposition’s dissatisfaction with the fact that not all of its proposals had been taken on board, with some ignored and others put off for possible future consideration.\nThe Opposition had made 80 proposals concerning local councils, 25 years after their introduction in 1994 by a Nationalist government.\nHe added that the Opposition would be holding the Government to its €700 million electoral promise to resurface 700 roads over the next seven years, but that it would not accept the undertaking of works without prior consultation with local councils, highlighting that Infrastructure Malta had taken over the responsibilities formerly associated with the latter.", "comment_count": 2, "id": 450}, {"keywords": "", "author": "", "article_body": "A total of 65 schoolchildren got fewer than 25 marks out of a 100 in their Maltese and English exams in the 2017/2018 academic year, as part of the assessment when completing primary school.\nThese represent 2.8 per cent of the total assessed.\nEducation Minister Evarist Bartolo was replying to a parliamentary question by MP Ivan Bartolo on the levels of illiteracy for children who had completed their primary school education.\nThere were also 83 students who were exempted from the exams, either because of learning difficulties, because there were forecign, or because they had been in Malta for less than two years.\nThe students came form various localities as per below, with Qormi leading the table with eight students, and Birkirkara not far behind with seven.\nQormi 8Birkirkara 7Attard 4Cospicua 4Naxxar 4Għaxaq 4Ħamrun 3\nTwo each: Mosta, Mqabba, San Ġwann, Sta Venera, Żabbar, Żurrieq.\nOne each: Balzan, Birżebbuġa, Buġibba, Dingli, Marsaxlokk, Mellieħa, Mġarr, Msida, Qawra, Qrendi, Sta Lucia, St Paul's Bay,Swatar, Swieqi, Valletta, Vittoriosa, Xgħajra, Żejtun.", "comment_count": 9, "id": 451}, {"keywords": "", "author": "", "article_body": "The prison director has rebutted claims made by one of Daphne Caruana Galizia’s murder suspects that he had suffered “inhuman and degrading treatment,” and stated that such allegations were “totally unfounded”.\nThe director also reserved the right to sue for damages suffered through such defamatory allegations.\nThe prison director’s reply filed in the First Hall, Civil Court rebutted claims made last week by George Degiorgio in a judicial letter, after an earlier letter, filed in December failed to have the desired effect.\nIn his second letter, Mr Degiorgio claimed that “no concrete steps” had been taken by the prison authorities to provide him with adequate medical care for the “persistent and unbearable pain in his shoulder”.\nHowever, the prison director described the allegations as “frivolous, vexatious and defamatory,” explaining that last December Mr Degiorgio had actually been accompanied to a private hospital for an MRI.\nLater that same month, a consultant orthopaedist from Mater Dei Hospital had visited the patient in prison, administering an injection and prescribing medication for daily administration.\nIn January, the consultant had recommended physiotherapy which was refused by Mr Degiorgio who insisted instead on seeking a second opinion, saying that “should he want physiotherapy he would personally ask for it”.\nThe judicial reply made reference to correspondence with the chairman of Mater Dei’s Orthopedic Department who said that once Mr Degiorgio had already been examined by a medical specialist and refused the recommended treatment, it was “final”.\nThe department had “done more than he possibly could” to accommodate Mr Degiorgio, the prison director said.\nInhuman and degrading treatment is defined by the European Courts as causing ‘intense physical and mental suffering,’ which was certainly not the case in respect of Mr Degiorgio who was asked to desist from any such further allegations.\nLawyer Mario Mifsud signed the reply.", "comment_count": 0, "id": 452}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man has ended up in jail after being caught red-handed trying to pay with counterfeit banknotes when purchasing items at a Paceville club at the weekend.\nNnemeka Henry Ajuonuma, a 28-year-old Nigerian asylum seeker residing at the Ħal Far tent village, ended up on the wrong side of the law when he handed over a fake €50 note at a Paceville bar in the early hours of Sunday morning.\nThe police were alerted and the fraudster was soon identified, with a search yielding a total of 11 of the €50 banknotes.\nProsecuting inspectors Shaun Friggieri and Leeroy Balzan Engerer explained how the man, who works as a galvanizer, had collaborated fully, claiming that a third party had allegedly handed him the fake money ‘free of charge’.\nThe man had “knowingly” tried to use the counterfeit currency, inspector Friggieri explained, prompting legal aid defence counsel Martin Fenech to remark that this was an opinion.\nAsked whether he was pleading guilty or not guilty, the accused replied: “It’s true.”\nWhen making submissions on punishment, Dr Fenech pointed out that the man had filed an early guilty plea, had cooperated fully with the police and had possessed a relatively minimal amount of fake cash, the total being €550.\nThe prosecution added that the accused had expressed remorse for what he had done but stressed the gravity of the crime since the harm done could be amplified if the fake notes had ended up in circulation.\nUpon the accused’s admission and after hearing submissions by both parties the court, presided over by magistrate Ian Farrugia, declared him guilty and condemned him to a 2-year effective jail term, the minimum prescribed by law.", "comment_count": 0, "id": 453}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A fight between a waiter and a taxi driver outside a hotel in Floriana on Sunday left a taxi driver grievously injured with his alleged aggressor – a waiter – claiming that he had acted in self defence.\nPetar Mladenovic, a 23-year old Serb working as a waiter, was arrested and arraigned on Monday, charged with grievously injuring the cab driver and breaching the peace, in the course of a violent argument that allegedly broke out at around 4am on Sunday.\nThe taxi driver suffered injuries to his nose and lip, prosecuting Inspector Jeffrey Scicluna informed the court.\nThe waiter had been subsequently arrested, claiming to have acted in self defence after being allegedly attacked by a group of taxi drivers.\nThe taxi driver and his wife, however, had a different version, telling police how the accused had allegedly attacked them while they sat in their vehicle, the court was told.\nThe waiter pleaded not guilty and requested bail, his lawyer Stephanie Abela pointing out that the man had limited financial means and worked long hours.\nAfter hearing submissions by both parties, the court, presided over by magistrate Ian Farrugia, upheld the request against a deposit of €500, a personal guarantee of €500, an order to sign the bail book once a week and a strict warning not to approach the alleged victims, directly or indirectly.\nInvestigations into the incident are ongoing.", "comment_count": 0, "id": 454}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some €13 million has been dedicated to building a comprehensive new crafts village in Ta' Qali.\nThe ‘village’, which has long been on the cards, will house around 70 artisanal workshops and other operators who have entered into agreements with the authorities to co-finance the building of a new establishments.\nKarl Azzopardi, chief executive of Malta Industrial Parks, told Times of Malta that operators had been offered up to €70,000 to build new facilities in the village.\nThese would have to be finalised by 2020 and follow design guidelines drafted as part of the EU funding application.\nHe said that a new foundation had also been set up, among operators, to breath new life into the village and to administer a calendar of events. They would also be responsible for upkeep.\nMinister Chris Cardona\nMeanwhile, the authorities have just penned an agreement with the Education Ministry to incorporate the village into school activities and other educational campaigns.\nAddressing a press conference at the village, EU Funds Parliamentary Secretary Aaron Farrugia said the European Regional Development Fund had been tapped to finance this project, as well as the Xewkija industrial park in Gozo.\nOther funds were also being utilised to help keep these crafts and skills alive.\nEconomy Minister Chris Cardona said the project would have spaces to entice and entertain visitors, adding that the crafts village was going to be “an experience”.\nReminiscing over the long road this project had taken, Dr Cardona said he remembered how, back in 2013, when he had first been tasked with seeing the project through, he had been taken aback at how long it had been left on the back burner.\n“There were many plans, but no one had ever asked for the funds to actually make this village a reality,” he said.\nOne of the long standing Ta Qali artisans told Times of Malta that the past few months of construction - which had seen new roads laid over subterranean service culverts - had seen business grind to a halt.\n“Now we are looking to the future, and hope this project will revitalise this area and make the crafts village a destination for Maltese and tourists alike,” he said.\nA look at the newly revamped crafts village. Photo: Matthew Mirabelli", "comment_count": 30, "id": 455}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Libyan man who is facing proceedings for allegedly raping and beating an Italian woman with whom he had an affair in Malta, was warned by a court on Monday to not to even look at the woman.\nInspector Lara Butters told the court that the victim had filed a report last May when an argument had broken out with the accused, Ali S. Ali Saad, 38.\nThe woman had told the police that she had been receiving messages and phone calls from Ali Saad before he finally turned up at her apartment and demanded to know why there was another man there. As a row broke out between the estranged couple, Ali Saad allegedly pushed her onto the sofa and beat her, causing her slight injuries.\nIn an attempt to find a way out of the situation, the woman convinced him to go with her to a pizzeria.\nOnce there, she locked herself inside a bathroom and dialled the police for help.\nThe inspector said the woman had later told investigators how she had been raped by the alleged aggressor on one occasion, some four months previously, while in his car at Baħar ic-Cagħaq.\nThe couple had had an affair, but the accused kept harassing her with messages, causing her to experience panic attacks.\nMr Ali Saad denied the charges, claiming that the woman’s injuries were self-inflicted.\nAs for the alleged rape, he said that he had found the woman naked in his car upon returning to the vehicle after leaving to buy water.\nInspector Butters exhibited a number of chat logs from Viber and Facebook between the accused and the alleged victim, which showed that the man just would not give up.\nAt the end of the sitting, Magistrate Ian Farrugia issued a protection order in favour of the woman, warning the accused not to approach her in any way.\n“This is not a joke. It’s a court order and you cannot approach her,” said the magistrate, adding that if the two walked past each other “and he gives her so much as a bad look, I will have him arrested.”", "comment_count": 0, "id": 456}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Spanish authorities were expected to take a closer look at the involvement of Maltese companies and “other entities” suspected of having played a role in an international tuna smuggling racket, sources close to the investigation said.\n“There are players in Spain and in Malta that are still on the radar. It is our understanding that this is an issue of widespread abuse that was not limited to just one or two people in Malta,” a source privy to details of the Spanish probe said.\nThe ongoing investigations, the source added, were not limited to fishing irregularities and smuggling but would also look into money laundering and “other fraudulent activities”.\nThe source was speaking shortly after a Spanish judge accepted a request by a lower court in Valencia to open an investigation into the alleged practice of smuggling illegally-fattened tuna from Malta into Spain.\nThe judge of the Spanish National Court announced last week the investigation would be picking up where Spanish environmental crimes investigators had left off when they arrested 79 people as part of an international crackdown code named Operation Tarantelo last summer.\nAlthough none of those arrested were Maltese, the investigation has already made waves locally.\nFisheries Department director general Andreina Fenech Farrugia was last month suspended in the wake of alleged leaked transcripts of phone intercepts from the investigation.\nThe Spanish media alleged that in the recorded calls she was heard demanding money from a Spanish tuna kingpin. She denies the claims made in her regard, insisting she never accepted or asked for any money for her personally.\nThe Spanish operator, Josè Fuentes Garcia, who has a presence in Malta, and Maltese MFF Ltd, owned by former Elbros owner Saviour Ellul, both also featured in the phone transcripts.\nSources in the Spanish investigation told the Times of Malta MFF and Mare Blu, owned by Mr Garcia, were the only two companies mentioned in the case. However, they were informed that most operators in the sector had a finger in the pie of the black market dealings one way or another.\nMalta police sources said they were in regular contact with Europol and the Spanish authorities to discuss developments in the tuna laundering racket.\nThe Maltese tuna ranching industry is being investigated by two magistrates as part of two separate inquiries. One was now at a “very advanced stage”, a senior Maltese law enforcement source said.\nSpanish investigation sources said irregular tuna catches, which originated from Italy and Malta, would often start to decay en route to the Spanish market but still got sold to consumers. The main problem with supplying such tuna to the market was the dramatic increase in harmful histamines in the meat.\nHistamine can be toxic from 50 milligrams per kilo of product, although EU sanitary regulations allow an absolute maximum of 200 milligrams.\nThe Spanish sources, however, said consumers who ended up hospitalised in Seville ate tuna containing 2,584 milligrams per kilo. Histamines in such proportions can cause heart failure and lung disease, according to an expert report incorporated in the Spanish court case.", "comment_count": 25, "id": 457}, {"keywords": "", "author": "", "article_body": "Updated at 12.35pm with photo\nPresident Marie-Louise Coleiro Preca was involved in a car crash on Monday when her official car was wedged against the central barrier of a main road in Paola. \nThe incident happened on Vjal Sir Paul Boffa and is believed to have been caused by a foreign-registered trailer truck.\nPresident Coleiro Preca was on her way to San Anton Palace to meet Irish employment minister Regina Doherty at the time. \nMalta's head of state was unhurt in the incident and was whisked away in another vehicle while police worked to clear the accident site. \nThe President was not hurt in the crash. Photo: DOI", "comment_count": 0, "id": 458}, {"keywords": "", "author": "", "article_body": "The parish priests of Gozo have reiterated a call made in 2011 for a study on the pros and cons of a tunnel between Gozo and Malta.\nAt a meeting chaired by Gozo Bishop Mario Grech, the parish priests said Gozo was continuing to suffer double insularity which was hindering its development.\nThey were also well aware of the problems encountered by workers and students who needed to cross to Malta regularly. \nThe parish priests said they believed better accessibility would improve the rhythm of economic development.\nThey, therefore, welcomed the current debate on a permanent link and called for a comprehensive study on the economic environmental and social impact which such a link would have. ", "comment_count": 26, "id": 459}, {"keywords": "", "author": "Jacob Borg", "article_body": "The accountability of the police and Attorney General is “deficient” and reports on allegations related to money laundering, corruption and abuse of power are often not followed up with charges, the European Commission has said in a country report about Malta.\nThe government has been rocked by allegations of high-level corruption over the past years, with little consequence for those involved.\nPrime Minister Joseph Muscat has continued to protect his top aide Keith Schembri and Tourism Minister Konrad Mizzi after their plans to receive payments totalling $2 million via offshore companies were revealed in the Panama Papers.\nThe police failed to open an investigation when their plans were revealed in 2016 and former Opposition leader Simon Busuttil had to ask the courts to take action.\nRead: Simon Busuttil embarks on new Panama Papers battle\nMalta’s anti-corruption institutional framework presents “serious shortcomings”, the Commission said in its report.\nThe report flags up the “structural flaws” inherent in Malta’s corruption watchdog, the Permanent Commission against Corruption. These flaws hindered the Commission’s ability to fulfil its role independently and effectively, it said.\nThe facts that its membership and appointment of special experts depended on the Prime Minister and its findings were reported to the Justice Minister were viewed as problematic by the Commission.\nVery limited transparency\n“It is unclear what follow-up measures have been taken on the Permanent Commission against Corruption reports or why only one case was forwarded to the police for further investigation.”\nA 2017 report by the corruption watchdog said it was “morally convinced”an attempt had been made by former Labour secretary general Jimmy Magro to solicit a kickback on a public waste management tender.\nThe police never took any action against Mr Magro. The former Labour official has since filed court proceedings claiming  he suffered huge reputational and financial damage thanks to the corruption watchdog’s report.\nReferring to last year’s opinion by the Venice Commission about Malta’s institutional setup, the European Commission report acknowledges the “long standing” double role of the Attorney General as an adviser/representative of the government and as a prosecutor.\nIt said the police’s economic crimes unit appears understaffed although a major reform is planned to increase its capacity in 2020.\nAccording to the report, the unit investigated 20 bribery cases in 2016, nine in 2017 and eight until October 2018. Two people were indicted in 2016, one in 2017 and none in 2018.\nConflicts of interest by sitting MPs also came under the Commission’s microscope: part-time salaries received by MPs affect their ability to operate independently from the government, and this practice was exacerbated by the appointments of MPs to important paid posts such as heads of a public authority.\nThe Labour government had ushered in changes allowing MPs to sit on government boards and head authorities shortly after sweeping into power in 2013.\nOn Malta’s controversial passport sale scheme, Brussels said transparency and governance could be improved, also noting the lack of a regulator and “very limited transparency” as regards the Maltese residence scheme for wealthy investors.", "comment_count": 45, "id": 460}, {"keywords": "", "author": "", "article_body": "A shoe shop in Fgura has been broken into twice in one month by what appears to be the exact same thief.\nThe hoodie-wearing criminal, who sports a distinctly sizeable nose, first forced his way into the Tata Italia store on Żabbar road around three weeks ago.\nOn Saturday night, he returned.\nThe shop's CCTV cameras captured the man stroll past the shop at just after 1.30am, glancing at it as he walked by. \nHe stopped a couple of doors down and sat down on the ground there, behind a tree, to prepare his attack. \n\nTen minutes later, he returned to the shoe store with intent. He walked right up to the shop door and tried to force it open using a metal rod, while peering anxiously around him to check for passers-by. As cars approached, he crouched behind a row of planters and then resumed his break-in attempt when the coast was clear.\nThe first time round he got €70, but this time he got nothing\nAfter well over a minute of prodding and pushing, the lock finally gave way and the thief was in. Twenty seconds later, he was back out again and running away. \n“There was no money in the till,” shop owner Graziella Galdes told Times of Malta. “The first time round he got €70, but this time he got nothing”.\n\nSpate of thefts\nThe shoe shop is believed to be one of several stores in the area targeted by burglars in recent months, and Ms Galdes said residents and business owners are now living in fear that they would be targeted next. “A wave of robbery is sweeping through Paola and Fgura,” she warned. “We need more protection”.\nWith CCTV and an alarm system seemingly not enough to deter criminals, Ms Galdes said she now has no option other than to install a steel shutter. On Facebook, Ms Galdes struck a defiant tone. “I swear that before I find you I won’t rest. If I follow all the CCTVs in Żabbar Road it will lead me somewhere. We are in Malta not New York,” she wrote, addressing the thief. “If the police want to get you they can, if they won’t…. I will”. Do you have information about this crime? Contact the police on 112. Spotted something worth sharing? Get in touch on mynews@timesofmalta.com", "comment_count": 16, "id": 461}, {"keywords": "", "author": "Ramona Depares", "article_body": "The problems prompting full-time farmers to give up on the career remain largely ignored, according to the founder of the farmers’ lobby group, Għaqda Bdiewa Attivi.\nQuoting an Agricultural Ministry report which stated that up to 70 per cent of farming land is unused, Malcolm Borg pointed to the lack of traceability at the Pitkali vegetable market and the current construction boom as two of the main culprits for the “slow, agonising death” of the agricultural sector.\n“Reality is that, unless the situation at the Pitkali is not tackled, it is going to be very difficult to improve the lot of local farmers. Farmers who go to sell their produce at the market in Ta’ Qali find themselves relying solely on the honesty of the middleman, who is in a position to fix the selling price without being accountable to anyone,” Mr Borg said.\nThe Pitkali market operates on an auction system, where the middleman negotiates with buyers – hoteliers, supermarkets, grocery stores and the like – in order to find a price that is acceptable to all.\n“I still meet farmers who tell me that they had an entire box of cauliflowers which was supposedly sold for a grand total of 50 cents. Or, sometimes, they get told that no buyers were found for their produce and it had to be thrown away. There is no way of checking whether this is true or not, as there is no traceability of money and goods.”\nThe unfairness of the situation, Mr Borg continued, was one of the biggest contributors to the dwindling number of farmers.\nWatch: “Malta's agriculture will die unless…”\n“Farming is already a very tough job, in and of itself. There are so many variables to contend with, such as weather, climate change problems, nature itself, endless toil... But farmers are used to this, it is not the hardship that discourages them. It is when everything goes well and yet, they are cheated out of a fair selling price.”\nTo further illustrate his point, Mr Borg recounts how a few years back, a strike by the Pitkalija middlemen had caused farmers to sell directly to the buyers. On that occasion, he remembers, they made three times as much money as they would usually have.\nWhat if Malta ends up isolated for a longer time period? We are not equipped to be self-sustainable, and the more time passes the worse it gets\n“No traceability equals no accountability. Who knows what is happening behind the scenes? The younger ones, especially, start wondering whether this is worth the hard work, if they cannot even make a decent profit when the harvest is good,” he said.\nAsked why no attempts have been made to address the situation, Mr Borg described this as “a mystery”, before going on to say that one of the contributing causes is likely to be the fact that there has never been either organised lobbying, nor political interest.\n“Farming comprises only two per cent of GDP, so the frustration has never really been translated to action.”\nMeanwhile the number of Maltese full-time farmers has been steadily dwindling over the years, with the total number standing at 1,372 as of 2013. In stark contrast, the construction industry is experiencing a long-term boom, with the number of residential building permits issued by the Planning Authority increasing by more than a third in 2015, the sharpest spike in recent years according to most recent statistics.\nRead: 'L-aħħar bidwi' could be a Maltese reality in 15 years' time\n“It is a well-known correlation, that when the construction industry is at its strongest, farming is at its weakest, with many farmers who get discouraged opting for one of the many available jobs in construction instead.\n“Farming is dying a slow, agonising death,” Mr Borg said, adding that he personally knew a number of full-time farmers who had invested heavily in their business but who still couldn’t make ends meet and who packed it in to try their luck in the construction sector.\nAsked what would be the ripple effects of the death of the local agriculture industry – especially bearing in mind that many supermarkets stock fresh produce from Sicily – Mr Borg reminded me that it does not take a massive natural disaster to remind us that Malta is completely not self-sufficient.\n“As has happened in the recent past, all it takes is for a couple of days of stormy seas for the ferry connections not to work, resulting in empty supermarket shelves. This has already happened. What if Malta ends up isolated for a longer time period? We are not equipped to be self-sustainable, and the more time passes the worse it gets,” he replied.\nBut of course, it’s not just about the practicalities. Heritage and cultural identity also present a reason as to why the Maltese should feel the need to protect the agriculture sector at all costs.\n“The Maltese almond is pretty much extinct, as is the Maltese chick-pea. The latter used to grow in the wild. How often do you come across them, nowadays?” he asked.\n“We expect high-quality food but we depend on others. And the truth is that most people remain blissfully unaware of exactly how unable to feed ourselves we are,” he concluded. ", "comment_count": 56, "id": 462}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta is among a few countries where a backlash against journalists was recorded after stories were published in the wake of the the Panama Papers, according to a review of the impact of the massive documents leak.\nIssued by the Reuters Institute ahead of the collaborative journalism project’s three-year anniversary, the review shows that while nearly one in five countries or international bodies made “substantive legal, regulatory or policy changes” in the wake of the Panama Papers, nothing of the sort happened in Malta.\nThe researchers recalled the car bomb that killed Daphne Caruana Galizia as one example of the backlash against journalists that ensued after the global journalistic investigation.\nOther countries where such “backlash” was reported included Panama, Venezuela, Ecuador, Tunisia, China, Congo, Finland, Hong Kong, Namibia, Niger, Russia, Slovakia, Turkey and Ukraine. The researchers described this cluster of countries as including “several notably authoritarian regimes”.\nMalta did not make any policy changes\nAlthough 17 per cent of the countries reviewed experienced “at least one instance of backlash”, the researchers deemed Ms Caruana Galizia’s murder as one of the “most severe” instances of such form of impact.\n“Backlash against journalists who had worked on the Panama Papers was seen in 17 per cent of countries studied, concentrated in those countries where press freedom is poor in general. One notable instance includes the assassination of Maltese journalist Daphne Caruana Galizia in October 2017,” the reviewers noted.\nWhile no “deliberative” changes – results that occur when policymakers hold formal discussions of policy problems and their solutions – were recorded in Malta, there was an instance of what researchers called “individualistic outcome”.\nDescribed by the researchers as consequences for people or companies implicated in the Panama Papers directly or indirectly, the study lists the closure of Pilatus Bank by the European Central Bank as one such outcome.\nLeaked documents\nIt all started when an anonymous source had contacted German newspaper Süddeutsche Zeitung submitting encrypted internal documents from Mossack Fonseca, a Panamanian law firm that sold anonymous offshore companies around the world. The shell companies enabled their owners to cover up their business dealings, no matter how shady.\nIn the months that followed, the number of documents continued to grow far beyond the original leak. Ultimately, Süddeutsche Zeitung acquired about 2.6 terabytes of data, making the leak the biggest that journalists had ever worked with. After months of analysis, the first news stories were broken on April 3, 2016.\nThe Panama Papers include about 11.5 million documents, primarily consisting of e-mails, pdf files, photo files and excerpts of an internal Mossack Fonseca database. They covered the period spanning from the 1970s to the spring of 2016.", "comment_count": 73, "id": 463}, {"keywords": "", "author": "Claire Caruana", "article_body": "Measures to address Malta’s declining fertility rate need to be stepped up if the situation is to improve in the coming years, an economist has warned.\nIn comments to The Sunday Times of Malta in the wake of a Eurostat report that revealed the Maltese are having the least number of babies in Europe, Stephanie Fabri said that the first step when tackling the situation should be to “take stock” of the local situation.\nRead: Maltese are having the fewest babies in Europe\n“We need to understand the local determinants of low fertility rates. Based on this thorough locally-based analysis, the government would be in a much better position to design specific policies that encourage families to have more children.\n“While it is good to look at what is working in other countries, it is important to implement a nation-wide study of our own. This is because the determinants of fertility rate may include socio-economic factors that are specific to our country and not others,” explained Dr Fabri, who has specialised in public policy and is a former economist at the Strategic Policy Secretariat within the OPM.\nShe noted that in recent years, there have been several improvements when it comes to childcare services and family-friendly measures. This, Dr Fabri believes, had likely prevented the fertility rate from declining even more.\nThe Eurostat data revealed that the rate in Malta currently stands at 1.26 babies per woman.\nBut despite being the lowest, is the rate actually a reflection of the state of the economy?\n“Low fertility rates are common among developed countries. In fact, the World Population Review report shows that the highest fertility rates are present in developing countries such as Somalia and Niger,” the economist said.\nThere were a number of reasons why a country could be experiencing such low rates, she said. This included interrelated socio-economic elements such as unemployment, uncertain labour market conditions, age at the time of marriage, mean age of women at birth of first child, household income and investment in human capital.\n“The first two reasons are unlikely to be the situation in the local context given that the economy has not gone through major unemployment or labour market shocks in recent decades. The average age of marriage and mean age of women at birth of first child both increased over the past decade so these elements might be contributing to low fertility rates.\n“With regard to household income, various studies show that as the average household income rises (a determinant of economic growth), fertility rates decline, especially for middle income households. This is mainly due to the rising costs of raising children which is a factor affecting most countries across Europe, combined with increased investment in children, especially in their education,” Dr Fabri went on to point out.\nOther reasons for lower fertility include self-development involving educational and work commitments. Within this context, the increase of women in Malta’s labour market may also be associated with lower fertility levels due to increased commitments at work.\nDr Fabri said the low rate has a “considerable economic impact” on Malta given that the country depends on human capital to generate economic growth.\nLow fertility rates change the composition of the population\n“As a result, this may lead to significant challenges in achieving reasonable levels of economic growth in the future. In that case, Malta would need large inflows of immigrants. Another important element to mention is that, because low fertility rates change the composition of the population to that of an ageing population, elderly cost care may increase while the tax base declines. This is likely to enhance the vulnerability of the elderly within the economic context.”\nBut is it all bad?\nWhile Dr Fabri believes that there are serious economic implications as a result of low fertility rates, fewer births might not have the significant negative economic implications as many may think. \nTechnological advancements such as Artificial Intelligence and automation, for instance, may lead to lower demand for labour to sustain economic growth. However, one needed to interpret this with caution, she added.\n“There are also arguments in favour of the environment, whereby a less densely populated country is likely to have lower levels of pollution,” she said.", "comment_count": 188, "id": 464}, {"keywords": "", "author": "", "article_body": "The following are the top stories in the newspapers on Monday - \nTimes of Malta reports that Spanish investigators have widened their net in the tuna racket probe that involves Malta.\nThe Malta Independent says that concerns about lost open space and the modernisation of the area have been raised following proposals by the American University of Malta for the Dock 1 area in Cospicua. It also quotes the head of the cycling advocacy group saying that whoever wrote the government strategy on cycling is not a cyclist. \nl-orizzont reports that Canadian company Supreme Cannabis is considering the possibility of setting up a factory to produce medical cannabis in Malta.  \nIn-Nazzjon quotes PN leader Adrian Delia saying the PN brought about positive change for Malta because it was able to plan long term, in contrast to the present government. ", "comment_count": 0, "id": 465}, {"keywords": "", "author": "", "article_body": "Guests of the Bellavista Hotel in Qawra were briefly evacuated on Sunday evening after a blaze was sparked.\nSources said the fire had broken out in a laundry room and was quickly brought under control by staff and fire-fighters from the Civil Protection Department.\nThe guests were evacuated as a precaution.\nNo one was injured.\nOn Tuesday a fire broke out at the spa of the Qawra Palace Hotel, also briefly causing the evacuation of guests.\nAn estimated 21 people and a member of the Civil Protection Department, received first aid treatment for smoke inhalation.\nPhoto - Matthew Mirabelli.", "comment_count": 13, "id": 466}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The legal firm of former tourism minister Edward Zammit Lewis will earn at least €45,000 more this year thanks to a new government consultancy job given to him by the Office of the Prime Minister a few weeks ago.\nThe latest government contract awarded to Dr Zammit Lewis, who is one of Prime Minster Joseph Muscat’s inner circle of friends, is for legal services to the National Development and Social Fund. This is an entity which falls under the OPM and is responsible for the administration of cash coming from the sale of passports.\nAccording to the contract, signed in November and tabled in Parliament last week following a PQ put by former PN leader Simon Busuttil, Dr Zammit Lewis and his legal partner Veronique Dalli will be giving legal advice to the cash-for-passports administrators at the rate of €90 per hour, from taxpayers’ money.\nThe contract guarantees earnings of at least €45,000 a year: “Based on two hours per diem as per Expression of Interest issued (and as per rate quoted by us), the minimum amount to be paid is circa €45,000 (VAT included) per annum,” the contract stipulates.\nThe minimum to be paid is circa €45,000\nTabling the contract, Prime Minister Joseph Muscat emphasised that the MP’s firm is one of two providing legal services to the passports fund and that so far a total of €2,700 have been paid out.\nHe insisted that the former minister, now a backbencher, has no other consultancy job with any other entity within the OPM.\nSoon after losing his Cabinet seat in June 2017, after failing to be elected to Parliament on his own steam, Dr Zammit Lewis was given a raft of government jobs, including a lucrative one from Identity Malta, which falls under Dr Muscat’s remit.\nAsked whether Dr Muscat, in stating that Dr Zammit Lewis had only one consultancy job at the OPM, had made a mistake, a spokesman for the Prime Minister insisted that the reply to Parliament was correct.\nReminded about his Identity Malta job, the spokesman clarified that this contract came to end last month (in February).\nAccording to the contract, Dr Zammit Lewis started his new consultancy job with the passport funds agency on November 13, when his contract with Identity Malta was still in force.\nApart from the €100 an hour paid by Identity Malta, since the last elections Dr Zammit Lewis has also been recruited as a legal advisor to the Ministry for Water and Energy at €4,333 a month, and as a legal advisor at the Lands Authority under the remit of Transport Minister Ian Borg.\nLast January, Dr Zammit Lewis made an impassioned plea to Dr Muscat not to resign, saying this was “crucial”.\nivan.camilleri@timesofmalta.com", "comment_count": 25, "id": 467}, {"keywords": "", "author": "", "article_body": "Updated Monday - \nThousands of people packed St Julian's seafront on Sunday to celebrate St Patrick's Day in the traditional way - with a pint, or two, of Guinness.\nTraditional Irish music blared from loudspeakers and people started converging early in the afternoon, many of them wearing green.\nHowever, while it was all fun and games for revellers, residents complained that the annual event was a “massive headache”.\n“Why in God’s name should we be expected to put up with thousands of people littering and doing all sorts of things at our front door, thumping music till the early morning, chaos on the streets? Shouldn’t this be organised somewhere more appropriate,” resident Mary Anne Agius said.\nOf course, revellers saw it differently yesterday. Dressed in a green T-shirt and a leprechaun mask, Jacob Cauchi, 24, said the event was one he and his friends looked forward to every year\n.Shouldn’t this be organised somewhere more appropriate\n“It’s just a bit of fun. We all get to enjoy the day together. People celebrate St Patrick’s Day all over the world, why not Malta?” he said, as he took a swig from his pint of Guinness.\nSt Julian’s deputy mayor Albert Buttigieg said the local council had tried its best to come up with solutions to minimise inconvenience to residents\n.“We held a meeting with stakeholders to try and find the best way to address St Patrick’s Day,” he said.\nThe council organised a park and ride system to deal with the rush of cars to the area. The main roads had been shut off to vehicles and traffic police directed the flow of cars in and out of the area. Wardens had also been called in to patrol the side streets and a dedicated hotline was set up to process residents’ complaints.\nThe council also brought bar owners together to share the cost of a street cleaning contractor to clear away the mess of bottles, cans and other rubbish normally left behind.\nMost streets were clean by Monday morning. \nVALLETTA PARADE\nEarlier, a colourful parade kicked off St Patrick's Day celebrations in Valletta.\n'Bishop St Patrick' and the enigmatic heroine 'Molly Malone' joined the Irish ambassador at the head of the parade down Republic Street, featuring a number of Irish characters and Irish music. More Irish music and dance, notably the stepdance, were performed on a stage at St George's Square.\nThe activity is organised every year by the Irish-Maltese Circle. \nThose taking part included Claddagh Crooners, South Belfast School of Irish Dancing and the Marsa scouts band. \nThe start of the parade in Valletta. Pictures - Anna Marie Navarro.  \n ", "comment_count": 42, "id": 468}, {"keywords": "", "author": "Denise Grech", "article_body": "Two Romanian men ended up in court on Sunday after having allegedly knocked on doors in several localities soliciting donations for a charity which does not exist.\nThe two were tracked down and arrested after complaints made on Facebook by a number of people.\nAdrian Ene, 28, the first to be arraigned, was accused of handing out leaflets where he falsely claimed to suffer disabilities and asking for donations.\nHe told the court he had no idea he was committing fraud.\nHe initially pleaded guilty to the arrest, saying he did not know what the leaflet contained and that he was sorry. Someone approached him and told him to hand out the leaflet to out to people, he said.\n“If you let me go I will go back to my country,” he told the court. He also said he had been sleeping in a car for four days.\nHowever, upon being informed the penalty for his case was effective imprisonment, Mr Ene changed his mind and pleaded not guilty.\nLeonard Tanase, 28, was similarly accused of fraud. He pleaded not guilty and told the court he had no residence and no job.\nThe men were kept under arrest as the case continues.\nLawyer Francine Abela appeared for the accused. The court was presided by magistrate Caroline Farrugia Frendo.", "comment_count": 0, "id": 469}, {"keywords": "", "author": "Keith Micallef", "article_body": "Removing the George Cross from the Maltese flag on the pretext that this is a remnant of colonial times is as absurd as proposing to raze Valletta to the ground, historian Joe Pirotta believes.\n“If we reach the absurd stage of starting to remove colonial vestiges, we might as well start by demolishing Valletta as it was built by the Knights of St John, who were autocratic rulers after all.”\nProf. Pirotta spoke to The Sunday Times of Malta following the controversial idea floated by broadcaster Charles Xuereb on #TimesTalk. Mr Xuereb, a Francophile, called for the removal of the George Cross and the relocation of colonial monuments to less prominent sites.\nAwarded in April 1942 by King George VI, at a time when Malta was part of the British Empire, the medal symbolised the defiance of its people against the relentless attacks from the Axis powers.\n\nThe medal, the second highest award of the United Kingdom honours system, was incorporated in the Maltese flag as from 1943.\nThe prominent historian noted that Maltese still cherished this medal and were greatly honoured to have been awarded such a prestigious recognition for their gallantry.\n“The idea that Malta got dragged in WWII because it was part of a British colony is an absurdity, as history tells us that during this conflict countries which declared themselves neutral were nonetheless invaded by the Axis powers,” he added.\nProf. Pirotta’s criticism was echoed by Fondazzjoni Wirt Artna executive chairman Mario Farrugia, who told this newspaper that removing the George Cross would be “an insult” to all those who stood up against Nazism and Fascism. \n“The George Cross has become part and parcel of Malta’s long history. If such a proposal were to be taken on board it would pave the way to renouncing 95 per cent of Malta’s heritage as it predates 1964 when Malta became an independent State,” Mr Farrugia said.\nHe noted that the island’s rich history was mainly due to the influence of the various kingdoms, rulers and empires which reigned over Malta for thousands of years.\n“This idea by Mr Xuereb is an anachronistic one dating back to the 1950s when many countries achieved independence. Seventy years down the line, those countries which had subscribed to the idea are regretting the decision as it is only now that they realised the heritage they had lost,” Mr Farrugia remarked.\n“The George Cross has become as famous as the Maltese Cross and despite having been awarded by the British Empire it is nowadays mostly associated with Malta and its identity within the Commonwealth,” he added.\nFrom a military perspective, Mr Farrugia noted that Malta’s contribution was crucial to changing the tide of war in North Africa, which ultimately marked the beginning of the end for the Axis.\n“Regretfully, many Maltese are not aware of our role in WWII to disrupt German and Italian supplies and consequently tend to underestimate the importance of the George Cross,” he added.\n“Had Malta fallen, history would not have been the same. Far from being a romantic view, this is a fact,” Mr Farrugia said.", "comment_count": 93, "id": 470}, {"keywords": "", "author": "Denise Grech ", "article_body": "A man who lived in a warehouse was fined €800 by a court on Sunday after admitting to an altercation with his boss over unpaid wages.  \nAdrian Wiencek, a Pole, came to Malta to work and had been living at a warehouse, where he worked as a driver.\nThe 28-year-old had claimed that he had not been paid since December and was left with no money to buy food or to send back home to his family, the court heard.\nAs frustration grew, he got into an argument with his boss and ended up damaging microwaves and other appliances.\nMr Wiencek pleaded guilty and pledged not to do it again.\nHe was handed a 20-month jail term suspended for four years and fined €800, with the court taking into consideration that he had cooperated with the police.\nLawyer Francine Abela appeared for the accused. Inspector Roderick Spiteri prosecuted.\n ", "comment_count": 0, "id": 471}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Nationalist Party will not shy away from cleaning up the mess that Prime Minister Joseph Muscat will leave behind when he bows out of local politics, PN leader Adrian Delia said on Sunday. \nSpeaking at a party gathering in Msida, Dr Delia said the Labour administration’s policies and lack of long term planning had taken the country to the brink of disaster.\nPrime Minister Muscat, he said, will not be around to have to deal with the fall-out, after having vowed to leave local politics after 10-years – a deadline that is fast approaching.\nDr Delia said the Labour Party’s plan for getting into office had been carried out just to allow a snatch-and-grab of the country's assets.\nThe consequences of today's actions, he said, would be felt tomorrow.\n“The PN had never shied away from addressing the challenges and big problems, no matter how grave the situation. Once again we come before you, and say we are here to take the country forward and do what needs to be done,” he said to a round of applause from the party faithful.\nThe country’s bleak prospects\nThe bulk of Dr Delia’s Sunday speech saw the PN leader detail how youths were facing a future where they could not afford to put a roof over their heads.\nA future where cheap labour flooded the jobs market, and where the birth rate continued to plummet.\nRead: Maltese having the fewest babies in Europe\nThe fibre of what made citizens Maltese was being changed. And, the ‘society that cares’ was the victim of this “frenzied change without a plan”, he said. “That is how Joseph Muscat is changing our society – for the worse,” Dr Delia warned.\nMsida: a university town\nEarlier in his speech, Dr Delia mapped out his vision for Msida to be transformed into a university town and a maritime centre.\nMsida could become a vibrant, attractive University town. (Shutterstock)\nThe PN, he said, believed in the potential of Msida, a place that houses Junior College and the University. Abroad, towns like this, were full of life.\n“Between the marinas, the waterfront, the university… you could make Msida one of the nicest destinations on the island,” he said. But, alas, he said, the present government had even kept Msida primary school closed for two years. \nCars, transport and cancer factories\nDr Delia referred to a recent study that found that deaths as a result of poor from air quality were far worse than previously thought.\nResearch published in the European Heart Journal used new data on the health impacts of air pollution to estimate that about 800,000 people a year across the EU die early and that the average person loses two years of life.\nMalta’s figures – which compare to previous estimates of between 250 and 270 early deaths for the same period – are slightly worse than the EU average.\nCompared to the population, Malta experiences 137 early deaths per 100,000 people, when the EU average stands at 129 per 100,000.\n“We were told no more cancer factories. But this is the situation we are facing. We used to say we were the worst in Europe for air quality – but it is actually twice as bad as we had feared,” he said.\nAnd what was the government’s solution? Nothing but a guarantee that it would only get worse, as 900 cars-a-month, month-on-month, were being added to the roads. \nNot forgetting Gozo\nOn the sister island, Dr Delia said so much had been promised, but so little actually delivered.\n“[Joseph] Muscat promised a casino, a bridge – which then became a tunnel, an air strip, a cruise terminal, a revamped health system, and what did Gozo actually get?” He asked.\nThe government, he said, had been trying to pull the wool over Gozitan’s eyes – but the lack of results spoke for themselves.\nThis was why he was, and would continue to, visiting Gozo every week.", "comment_count": 85, "id": 472}, {"keywords": "", "author": "Claire Caruana", "article_body": "The government will be unveiling a new sports strategy in the coming weeks as part of efforts to raise standards, Prime Minister Joseph Muscat announced on Sunday.\nAddressing Labour Party supporters in Siġġiewi, Dr Muscat, who has just returned from Abu Dhabi after visiting athletes competing in the Special Olympics currently underway there, said that the government was working on ensuring sports standards are raised.\nCongratulating the athletes in Abu Dhabi who had already won several medals, Dr Muscat said that the Maltese team served as a “symbol of equality”.\n“It is such a beautiful thing to honour these youths who are a symbol of equality. They serve as a symbol that Malta wants to celebrate the success of everyone. They teach us that they are not happy with participating but they want to win, despite their different abilities,” Dr Muscat went on.\nHe insisted that ensuring sports standards were of the highest in the world would continue to improve the nation’s quality of life, something that the government had already succeeded in doing in recent years.\nDr Muscat said that this also meant that the government would not only make sure that more people with disabilities had a job so that they too could enjoy a good quality of life, but it would also be strengthening measures aimed that at those who were absolutely unable to work.\n“We will continue to increase the budget so that those people who cannot work would get an allowance that is at least as much as the minimum wage. \n\n“We can only do this because we have a very strong economy that is growing,” the Prime Minister said.\nReferring to what he said is a constant stream of positive reports by various credit rating agencies, Dr Muscat said that these reports were important because they served as a reference point to investors.\nHe then went on to chastise the Opposition for suggesting that the government was paying these agencies to secure positive reports. When hearing such statements by the Nationalist Party, Dr Muscat went on, he did not know whether “to laugh or cry” over the absurdity of the arguments.\n“The Opposition needs to get their act together and start making stronger arguments,” he warned.\nPensioners apply for more than €100m in govt bonds\nOutlining other measures by the government, Dr Muscat said that pensioners had applied for more than €100,000,000 in bonds offered by the government. Aimed at those who were over 62 and capped at €10,000 per pensioner, Dr Muscat said that the scheme served as proof that people trusted the government. The measure, he went on, also meant that apart from higher pensions, the elderly were also enjoying an added bonus through interest from the bonds. The bonds offer 3% interest, twice an ordinary bank fixed account.\nHe also referred to the VAT refunds on vehicle registration tax handed out to those who registered their cars between 2004 and 2008. The European Commission had declared, back in 2009, that it was illegal to include registration tax in the taxable amount of VAT levied on car sales. Refunds have since been handed out to thousands of families, Dr Muscat said.\n“That is the difference between this government and the PN governments of the past. When we promise something, we are sure that we will be able to keep that promise.\n“This is a movement that changes the future. People want change, it always has, and we will continue to provide that,” Dr Muscat said.\nNew Zealand attack shock\nAt the beginning of his speech, the Prime Minister also spoke briefly about the brutal massacre in New Zealand on Friday that saw 49 people killed. Expressing condolences to the people of New Zealand, Dr Muscat said that the attack showed that it was wrong to link one religion or one nation to such attacks.\nOn the reference to Malta on the rifle of the gunman, who inscribed ‘Malta 1565’ on the foregrip of the weapon, Dr Muscat said that whoever thought that the country or its history has “anything to with hate or terror” was wrong.\n“Today, more than ever before, our country is a symbol of peace, equality and a nation that welcomes everyone. We have always been this way and we will remain like that,” the Prime Minister insisted.\n\n \n ", "comment_count": 22, "id": 473}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Could Malta be about to see an explosion in its fledgling community of YouTube content creators? With the long-awaited announcement that Maltese video makers will finally be able to monetise their work, the country’s most popular YouTuber believes so.\nWith more than two million subscribers and just shy of 400 million total views on his videos, the 24-year old Grandayy (who asked for his real name not to be used) has achieved huge international success and has been endorsed by some of the top names on the video-sharing platform.\nWhile Grandayy had already been earning money through what is known as multi-channel networks – and in fact works full-time on his YouTube channel despite graduating as a doctor – monetisation remained closed to smaller Maltese creators, unlike those in other countries.\nThis changed last Thursday when YouTube announced that its Partnership Programme, which had long been available to video makers abroad, had been opened to Malta, meaning content creators will now get a share of advertising revenue for their videos.\nHaving the option to apply for monetisation directly with YouTube… is a great incentive to keep working hard\n“I think this new development will surely help inspire more Maltese content creators, as having the option to apply for monetisation directly with YouTube, when your channel is still relatively small, is a great incentive to keep working hard and producing more video content,” Grandayy told The Sunday Times of Malta.\nThe potential revenue is not to be sniffed at. Top YouTubers can earn hundreds of thousands from the platform: Grandayy said his own income was “nowhere even remotely close” to a €500,000 figure quoted in a new report, but he earns enough that he sees YouTube as a viable career for him now and in the future.\nYouTuber Grandayy’s avatar\nGrandayy believes his success lies in the specific appeal of his content: starting out making content in and about the videogame Minecraft, he soon segued into memes – internet-specific jokes and images – music remixes and parodies.\nThis sort of content, he believes, is always growing in popularity and would soon be a mainstream form of comedy as it largely already is among teenagers and young adults.\n“Unfortunately, with Malta being so small, the only real way to make it on YouTube is to make content for an international audience, since it’s pretty much impossible to get enough views to make significant revenue just from a solely Maltese audience,” he said.\n“This shouldn’t really be a bad thing either though. Connecting with an international audience can be really interesting and it teaches you a lot of things as well.”\nAs for life as a full-time YouTuber, Grandayy finds it rewarding, but perhaps not as idyllic as some would imagine.\n“I pretty much live on the computer,” he said. “I have to spend a lot of time brainstorming for ideas, video editing, just browsing memes on the internet, interacting with the community on social media etc. There are no vacations, weekends or sick days for me, but I still love it, all things considered.”", "comment_count": 2, "id": 474}, {"keywords": "", "author": "Jacob Borg", "article_body": "As an Air Malta flight to Algiers revs up its engines, the crew give each other a knowing glance. It will be another easy flight.\nOf the over 100 passengers booked on the flight, only eight have actually turned up.\nAir Malta’s former general sales agent for Algeria, Alex Fezouine, who was on that flight in 2015, says it was all too common to have 90 per cent no-show rates for these return flights.\nHe suspects that a racket operating right next door to Malta’s consulate in Algiers was selling Algerians false documentation and facilitating the process for them to obtain a Schengen visa to visit the island and then jet off to mainland Europe, never to return to Algeria.\n“[Schengen] visa sellers have taken over the consulate [in Algiers] and the airline and started only sending illegal immigrants to Europe, through Malta of course,” Mr Fezouine wrote in an April 2015 e-mail to Prime Minister Joseph Muscat.\nAlgerians applying for a Schengen visa needed to show proof of a local hotel booking and return flight from the island when applying for visas at Malta’s consulate in Algiers.\nREAD: Visa vetting at Malta's Algiers consulate was 'less than optimal', NAO finds\nAt the time of the alleged racket the consulate was headed by Robert Falzon, the Prime Minister’s first cousin, once removed.\nMr Fezouine took his suspicions of a visa-racket operating right outside the consulate’s door to Mr Falzon, and later to the Prime Minister, Foreign Minister and the Maltese police.\nThe Maltese-Algerian businessman, who runs a travel agency that was accused of receiving preferential treatment from the consulate prior to him blowing the whistle on the alleged racket, told The Sunday Times of Malta that the police did not show much interest in investigating the visa allegations.\nFamily ties with PM\nMr Fezouine said Police Commissioner Lawrence Cutajar, at the time an Assistant Commissioner responsible for immigration, cited the consul’s family ties to the Prime Minister as a complicating factor in the investigation.\nReplying to questions, Mr Cutajar assured The Sunday Times of Malta that a full investigation was carried out and a report forwarded to the National Audit Office.\nThe NAO’s probe, published in January, discovered that 5,083 people flew in from Algeria between March 2014 and September 2015.\nDuring the same period, only 2,664 people departed from Malta to Algeria.\nThis means arrivals from Algeria outstripped departures from Malta by almost 50 per cent.\nMr Fezouine insists the racket operated with complicity of people working in Malta’s consulate.\nHe says the police told him that he had not given them any proof of this racket.\n“What were they expecting, a receipt from those operating the racket? All the police had to do was observe the passengers getting off the incoming flight from Algeria. They would scramble to the Air Malta desk upon landing to book themselves on the next flight to Paris”.\nVisas for up to €8,000\nThose operating the racket charged €4,000-€8,000 to provide visa applicants with proof of employment, pay slips, bank account and social security details, Mr Fezouine says.\nThe applicants would then be hustled off to a company housed in the same building as the consulate and contracted to process the visa applications.\nMr Fezouine said an investigation of the documents received by the police as part of the visa screening process would also have been a good starting point for an investigation.\n“How could you have individuals from lots of different locations all supposedly working for the same company and presenting the same payslips,” he questioned.\nHe claims the immigration police in Malta became progressively more frustrated with the arrivals from Algiers and started shipping off people to detention in Ħal Far until their return flight, even when this was not necessarily warranted.\nMr Fezouine said he had to intervene one time when two Algerians from a tobacco distribution company who had their hotel booking cancelled due to overbooking were shipped off to detention in Ħal Far after the police found out their bookings at the original hotel did not exist.\nThe two Algerians were re-booked into another hotel and released, Mr Fezouine said, but around 10 people on the same flight were detained until their return flight the following week.\n‘They needn’t go back’\nAsked if the immigration police took to detaining Algerians on the Air Malta flight to prevent them from travelling to other destinations, the Police Commissioner told The Sunday Times of Malta that all third country nationals arriving in Malta needed to fulfil the necessary entry conditions.\n“Those not doing so are refused entry and sent back. Algerians are not excluded,” the Police Commissioner said.\nQuestioned about the ‘ghost flights’ back to Algeria where only a fraction of the people booked on the return Air Malta flight showed up, Mr Cutajar said people issued with Schengen visas did not necessarily need to travel back to their country of origin from Malta.\n“They may legally travel to other Schengen Member States within the term of validity of their visa, he said.\nMr Fezouine, who is well connected with the Algerian government, even offered to arrange the necessary logistics to fly the Maltese police out to the consulate in Algiers to witness the racket in action.\n“Money was literally changing hands underneath the consul’s balcony. The police would have been able to see it all. Bribery. Fraud. Forgery”.\nMr Fezouine said in his April 2015 e-mail to the Prime Minister that the Algerian police were reluctant to act, particularly due to the potential diplomatic repercussions.\nAll the police had to do was observe the passengers getting off the incoming flight from Algeria\nAn Algerian diplomatic mission to Malta held discussions with then Foreign Minister George Vella as well as the Prime Minister about the high rate of Algerians not returning to the country after obtain their visas from Malta’s consul in Algiers\nMr Fezouine, who attended these meetings, said the Algerians knew it was a sensitive topic given that the Prime Minister’s relative was the consul in Algiers.\nHe said Dr Vella pointed towards figures showing that the visa refusal rate was in line with the average of other European countries.\nQuestioned about the concerns raised by Mr Fezouine, a spokeswoman for the Prime Minister’s office said the Maltese-Algerian never applied for whistleblower protection.\n“Mr Fezouine filed a report with the authorities. As with any other report, the police investigated the allegations in the report. The conclusions of the police investigation were submitted to the NAO, which carried out a thorough investigation.\n“The NAO report concluded that on this case the government had taken satisfactory actions following the allegations, since it directed the reports to the police. The European Commission also looked into the said allegations,” the spokeswoman said.\nQuestions sent to Air Malta about the ‘ghost flights’ were not answered by the time of writing.\nPaying the price?\nMr Fezouine says he paid the price for raising his concerns about the visa scheme, becoming a virtual pariah in Malta after enjoying decades of good relations with the authorities having long assisted Malta business links with Algeria.\nHe says the consulate started holding up the visa process for his travel agency clients or providing them with visas that had already expired by the time their passports were picked up.\nThe NAO says in its report that from late 2014 to August 2015, various allegations were made by his travel agency XL Travel regarding irregularities in the issuance of visas by the consulate.\nIt however noted that in the period immediately preceding this, XL Travel was at the centre of multiple accusations levelled by an unnamed person, alleging that the travel firm was receiving preferential treatment from the consulate.\nThe report says XL Travel was also on the receiving end of accusations by an unnamed individual involving the fraudulent issuance of visas.\nThe NAO notes in its report that the relationship between his travel agency, XL travel, and the consulate, became “strained” in October 2014. The NAO found correspondence between the consul and Air Malta on October 27, 2014, referring to the fact that XL Travel was promoting a Malta-Paris stay on social media.\nThe consul advised Air Malta to stop XL Travel from mentioning the facilitation of Schengen visas, as this was attracting visa shoppers.\nIn apparent contrast to the Police Commissioner’s replies to this newspaper, the consul asserted in this correspondence that a visa for such a travel itinerary [involving onward travel from Malta] could not be issued.\nIn December 2014, the NAO said that the consul referred correspondence from XL alleging wrongdoing in the visa processing to the police.\nAccording to the NAO, the consul insinuated that the allegations were being driven by the fact that he [Robert Falzon] had introduced XL Travel’s replacement as Air Malta’s agents to the airline, as well as the recent refusal of visas to XL Travel clients.\nMr Fezouine insists that he resigned from his position as an Air Malta agent after becoming disgusted with the inaction over the ‘ghost flights’ and visa racket.\nIn March, two months after the NAO’s report was published, Mr Fezouine was informed by Identity Malta that his Maltese citizenship was being revoked as it “appears to have been obtained by fraud”.\nAfter PN MP Jason Azzopardi last week accused the government of maliciously revoking Mr Fezouine’s citizenship, Julia Farrugia Portelli, the Parliamentary Secretary for Citizenship, pointed towards a 2002 court judgement annulling his marriage to a Maltese woman in 1995.\nThe court said it was obvious that Mr Fezouine had married the woman to gain Maltese citizenship.\nMr Fezouine denies this is the case and intends to ask for an internal inquiry.\nHe says he is not very optimistic about the outcome, as the committee of inquiry, chaired by retired judge Philip Scibberas, cannot revoke the Identity Malta decision but merely forward a recommendation to the minister in charge of citizenship.\nThe citizenship portfolio falls under the Prime Minister’s ultimate control.\nWhat were the NAO’s findings?\nThe NAO established that the government was aware of the allegations. It deemed action taken by the government as appropriate, as both the consul and the Foreign Minister informed the police about the alleged irregularities.\nThe NAO said the police took action by seeking the views of persons of interest, in particular the consul and the “Algerian travel agent”, from whom most allegations originated.\n“Whether any other action could have been taken by the government remains subject to debate, conditioned by the context within which the consulate was operating, as well as its operational set up.\n“Moreover, the NAO acknowledges that there were aspects of the allegations beyond the control of the consulate, particularly the involvement of VFS and other agents in the visa process,” the report said.\nThe NAO’s analysis found that 484 of the 6,779, visas issued between March 2014 and September 2015, were not recommended for approval by the immigration police, yet the visas were subsequently approved by the consul. \nThe police recommended these visas for refusal because the applicants’ intentions to leave EU territory before the expiry of their visa could not be ascertained and justification for the purpose and conditions of the intended stay was not provided, the report said. \nConversely, it was also discovered that there were 865 applications where the police posted no adverse remarks yet the consul refused the issuance of a visa. \nE-mail correspondence obtained by the NAO led auditors to “note” that the consul initially lacked the necessary experience for the running of a consulate. \nThe report also revealed that Malta was mentioned in two alerts issued by Frontex about the possible illegal immigration of Algerian nationals and Maltese visas obtained fraudulently in Algiers.\nAccording to the Frontex alerts, Algerian women and children were departing Algiers with a transit through Marseille in France to the final destination in Malta. However, their intention was to stay in the EU territory, possibly France, given that at times they only had tickets to Marseille and without money to justify their stay as tourists in Malta. \nThe NAO said the investigation of alleged payments to government officials for preferential treatment in the obtaining of visas did not fall within its remit.\njacob.borg@timesofmalta.com", "comment_count": 81, "id": 475}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta interviews the Algerian man who made allegations about irregularities in the granting of Maltese visas in Algeria.\nIt also reports how a Briton has claimed sexual abuse by a priest in Malta several decades ago.\nThe Malta Independent on Sunday interviews the CEO of the Malta Financial Services Authority, who says a new organisational structure will strengthen supervision and governance. The newspaper also quotes the Dean of the Faculty of Laws saying the manner of appointment of members of the judiciary over the years gave rise to friends-of-friends criterion.\nMaltaToday reports that Air Malta has made its first profit in 16 years. It also says the Judicial Appointments Committee has said that Yana Micallef Stafrace should not be appointed a magistrate because as her term as magistrate so far has been too short.  \nIl-Mument's main focus is on the leadership race in the Labour Party, saying Konrad Mizzi was forced to deny he had a meeting with Chris Fearne.\nIt-Torċa reports how a contractor who supplies temporary workers pays them half pay even though he is paid for them in the same way as permanent workers. It also reports that a public consultation on the National Strategy for Adoptions will be held on March 25.\nKullĦadd under the heading 'Unacceptable' says MEP David Casa wants a journalist to reveal his source. \nIllum highlights the plight of a 65-year-old woman who risks being kicked out of her flat. It also reports that two Boeing 737 Max aircraft were banned by Malta last week. Two aircraft of this type crashed over the past few months and the type has now been grounded. ", "comment_count": 1, "id": 476}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A British man who claims to have suffered repeated sexual abuse at the hands of a Maltese priest in a local school four decades ago, when he was 10 years old, has finally decided to open up about the harrowing experience that scarred him for life.\nThe 50-year-old Englishman kept his story a secret for many years. Now, however, his psychiatrist is recommending he seeks closure on the incidents that marred his childhood and deeply troubled his teenage and adult years.\nSaying he was encouraged by the recent conviction of former Vatican treasurer Cardinal George Pell for historic child sex abuse, the man has reported the matter to the police and the Curia’s Safeguarding Commission.\nThe Sunday Times of Malta has chosen not to publish his name, the name of the priest he accuses of abuse, or of the school where the abuse allegedly took place between May 1979 and September 1981. The priest has since passed away.\nThe commission, which is tasked with investigating sexual abuse claims against members of the clergy said it is investigating the claim and is collaborating with the police on the matter.\nThe man told The Sunday Times of Malta in an emotional Skype call that the abuse took place sporadically over the three years he spent at the school as a boarder. His family had moved to Malta because his father had a job here.\nHis brother, who is slightly older, attended the same school.  \nThe man said he had buried what had happened to him until he was 27, when he wrote a letter to his parents from jail, where he was doing time for petty thefts to fund a drug habit.\n“From the time it happened, I started rebelling. I lost interest in education and I distrusted educators,” he said.\n“When I look back, I am convinced that the troubles I had in my youth and my adult years are a direct result of what happened because I’m not the person I should be. I am speaking up because I want accountability. I am sure there were other people who suffered at the hands of this priest and others who have a good impression of him because they did not know what was really happening.\n“I still get flashbacks and nightmares of the abuse,” he said.\nHe describes himself as having been a naughty lad who struggled to abide by rules.\nHis discipline came in the form of the ‘fish’ – a stiff piece of leather shaped like a fish used to strike the palm of the hand, usually six times depending on the severity of the offence.\nHowever, this particular priest, he recounted, began asking him to bare his buttocks instead. And that was when the sexual abuse started, taking place in different parts of the school, including the dormitories, the vestibule of the chapel, the washroom and the school secretary’s office.\nFrom when it happened, I started rebelling. I lost interest in education and I distrusted educators\nHe said that one night, at around 9pm, the priest entered the dorm and asked him and a friend to accompany him to rearrange some books in thesecretary’s office.\n“He was sitting at his desk. I stood a little way away but he told me to come closer as he wasn’t going to hurt me. He asked me to read some passages from a book on his desk. I was nervous and struggled to read.\n“He put his hand at the base of my back and asked me to try again. While I was reading he moved his hand inside my pyjamas,” he recounted as he went on to describe the sexual abuse in more graphic detail.\nThe priest then told him: “God will always forgive you”. “He told me that I must not tell anyone about this and I’d be one of his special boys. He even told me he would do the same to my brother and that God would punish me if I told anyone.\n“He then left the room and locked me in. He was gone for what seemed like hours but came back and gave me a packet of Bourbon biscuits, which were my favourite,” the man recalled with immense difficulty.\nThe next incident took place a couple of months later in the vestibule of the chapel after the priest invited him to be an altar boy during a Mass he was about to celebrate. The priest caught him sipping Mass wine from the bottle but he did not get angry at him.\nHowever, he later forced him to perform a sexual act on him, saying God was forgiving the boy for what he had done. He then proceeded to celebrate Mass.\nSimilar incidents followed and once the priest penetrated him with his fingers, the man claimed.\nThe abuse, he said, affected him so deeply that he left the school and refused to return.\n“I remember having suicidal thoughts at 12. Why I never did it is something that puzzles me to this day.\n“The actions of this man changed me. I became a child who always blamed myself for being abused. My mother, father and siblings had to endure some quite horrendous behaviour. I left my schooling with little qualifications and exam results.\n“My erratic behaviour continued into my late teens when I became a violent young man with many arrests, court appearances and convictions. It was only in my late 20s after a spell in prison that I started to get my life together.”\nHe said compensation was not his “driving force” for reporting the case. “I cannot live without getting solace and accountability. I want them to investigate and then do the right thing.”\nThe man has a 17-year-old son and a two-year-old daughter from another relationship after the breakdown of his marriage. He said his father never accepted the abuse and never wanted to speak about it up to the day he passed away. His mother, who is 75, still lives with regret for trusting him with the priest.\n“I’m speaking about it because it was recommended I seek closure and to give others the courage to speak up. But I am also doing it for my mum,” the man said, fighting hard to hold back tears.\nmatthew.xuereb@timesofmalta.com", "comment_count": 123, "id": 477}, {"keywords": "Education", "author": "", "article_body": "Last Monday, Commonwealth Day was commemorated at St Margaret College secondary school, Verdala, at a morning assembly addressed by the Queen’s Young Leaders Group and their founder teacher, Martin Azzopardi. During this year’s commemoration, themed A Connected Commonwealth, all governments, institutions and ordinary people in these countries were called upon to work together to promote development and peace, to protect the natural environment and seas, to cooperate on trade, and to encourage inclusive economic empowerment and participation in sport for all people, particularly women, youth and marginalised communities. The Commonwealth, which this year is marking its 70th anniversary, gathers over two billion people in its 53 member countries, most of which were under British rule. Photo shows Mr Azzopardi (left) addressing the assembly with members of the group Grazia Magro, Aidan Bugeja, Matthew Megrahi, Sarah Sharafaddin, Yasmine Grima, Mariah Sciberras, Neil Busuttil and Trisman Camilleri.", "comment_count": 0, "id": 478}, {"keywords": "Education", "author": "", "article_body": "An estimated 200 delegates from 41 countries are expected to attend the second International Conference on Bilingualism being held from March 25 to 27 at the University of Malta’s Valletta campus.\nTopics to be discussed include bilingual acquisition and learning; translanguaging; biculturalism; bilingual/multilingual education; language policy and practices in bilingual/multilingual schools; code-switching; varieties of English; bilingual language use in different contexts; language attitudes; language and identity; linguistic landscapes; and bilingual issues in literature and translation.\nThree international experts – Prof. Jasone Cenoz, Prof. Anne Pauwels and Prof. David Lasagabaster – will deliver the keynote speeches during the three-day conference. \nThe conference is organised by the Department of English at the University’s Faculty of Arts. For further information e-mail Prof. Lydia Sciriha at lydia.sciriha@um.edu.mt.\nFor further information visit the website below.\nhttps://www.um.edu.mt/events/bilingualism2019", "comment_count": 0, "id": 479}, {"keywords": "Education", "author": "Jackson Levi Said", "article_body": "Humans have been pondering about the inner workings of the Universe for as long as there have been humans. Albeit through different questions, the quest to understand the Universe has been irrevocably entangled with our history and remains an intensely studied topic. This is the field of cosmology.\nBut how do we map out the history of the Universe from the Big Bang to the present? And what is the future of the cosmos?\nThe first major tsunami in cosmology in recent times came in 1998 when two international collaborations were attempting to make precise measurements of how fast the Universe is expanding. They did this using a special kind of exploding star called Type 1A supernovae, which acts as a so-called standard candle at various distances.\nSince these stars act identically across the Universe we can measure how far away they are moving from us. What these teams found startled the whole community. It turns out that the Universe is not only expanding but accelerating in this expansion.\nUp to this point in time, it was fairly universally accepted that the Universe came from an initial Big Bang event that propelled everything in the Universe to move away from each other.\nHowever, given that we always experience gravity to pull things together, it was very unexpected that the Universe would currently be accelerating outward. In fact, both collaborations were awarded the Nobel prize for Physics in 2011.\nThe fact of the accelerating Universe is called dark energy and has been verified numerous times since this first observation.\nTo explain this astonishing discovery, scientists used an old idea by Albert Einstein called the cosmological constant. This entails adding a constant to the Einstein equations for the Universe, which he had initially used in 1917 to describe the Universe as being static. He later abandoned the idea when Edwin Hubble in 1929 found that the Universe is expanding. The idea was resuscitated to explain the 1998 observation of an accelerating Universe. This is now called the standard model of cosmology.\nThe Universe is not only expanding but accelerating in this expansion\nConcurrently, scientists have been working on building space-based satellites to make precision measurements of the early Universe to better test this standard model of cosmology.\nThe first of these missions was called COBE, which confirmed several important features of the Big Bang theory. This was part-led by George Smoot, who won the Nobel prize for these discoveries, and who also opened the Institute of Space Sciences and Astronomy at the University of Malta.\nThe second mission was also run by Nasa, and called WMap. However, the most recent of these missions, Planck, was run by the European Space Agency. The Planck mission was enormously successful in increasing our certainty in many aspects of cosmology, such as the kinds of particles we see in the Universe and the main stages of the early Universe, as well as a better breakdown of the ingredients that make up the Universe. However, it also found a potential problem with our standard cosmological model.\nBy making precise measurements of the early Universe and comparing this with the Type 1A supernovae observations we can test whether the theory gives a consistent picture of the rate of accelerating expansion at present. On this point, the Planck mission found a significant tension between these two observations, which would mean that the standard model of cosmology may need to be slightly modified or potentially entirely redrawn.\nThis observation has led to a reinvigorated examination of Einstein’s theory of gravity and potential alternatives that may better explain the evolution of the Universe, and the role of dark matter in galaxies.\n‘Understanding the Universe’ public conference\nLeading figures in the cosmology community are meeting in Malta this week to discuss potential paths to reviewing the standard model of cosmology and discuss other issues in current cosmological models.\nGiven the strong public interest in this work, a public conference entitled ‘Cosmology@Malta 2019: Understanding the Universe’ is being held at the University of Malta’s Valletta campus on Thursday at 7pm.\nTwo of the speakers, Prof. Mariam Bouhmadi Lopez from the University of Bilbao, Spain, and Prof. Emmanuel Saridakis from the National Technical University of Athens, Greece, will discuss our current understanding of the Universe and outstanding problems that the community is working on.\nThe event is being held by the University of Malta’s Institute of Space Sciences and Astronomy in collaboration with the Faculty of Science and Malta Café Scientifique.\nAdmission is free but registration is mandatory as space is limited. To secure a place, register at the link below.\nhttps://bit.ly/2EN8TZg\nDr Jackson Levi Said is a lecturer at the University of Malta’s Institute of Space Sciences and Astronomy.", "comment_count": 0, "id": 480}, {"keywords": "Gozo", "author": "", "article_body": "A commemorative event in honour of Mro Joseph Vella, who passed away on February 25 last year, was held at Villa Rundle Gardens, Victoria. Gozo Minister Justyne Caruana (pictured) unveiled a bust dedicated to Prof. Vella, followed by the laying of wreaths. The bust is the work of Joseph Scerri. During the unveiling, the La Stella Band, under the direction of Mro John Galea, played Prof. Vella’s Dejjem f’Qalbna (Always in Our Hearts). Commemorative talks were given by Paul Cassar and Cecilia Xuereb. Other talks by Pierre-Henri Xuereb and Jennifer Margaret Barker were read by Nikki Vella, Mro Vella’s son, and Colin Attard respectively. Musical excerpts were executed. The ceremony was concluded by a thankful address by Alan, Prof. Vella’s other son. The ceremony, which started with a band march by the La Stella Band from the Astra Theatre to Villa Rundle, was organised by the Gozo Ministry and the La Stella Philharmonic Society.", "comment_count": 0, "id": 481}, {"keywords": "Gozo", "author": "", "article_body": "A Way of the Cross was inaugurated at Ta’ Passi in Għajnsielem, the same place where Betlehem f’Għajnsielem is held annually. The Way of the Cross, organised by the Għajnsielem Dramatic Company, was blessed by Għajnsielem archpriest Canon Frankie Bajada. The project, including a 15-metre-high cross and the Passion stations, took five weeks to complete. The steel structure of the cross is covered by wooden pallets and is lit up in the evening. The cross and the stations were built by a group of volunteers under the guidance of Għajnsielem mayor Franco Ciangura. Several companies helped in the construction of the project by offering various items. Help was also forthcoming from the Gozo Ministry and Għajnsielem council. Various activities will be held by the dramatic company during Holy Week and Easter.", "comment_count": 0, "id": 482}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Minister Justyne Caruana has inaugurated the restored WWII air raid shelters at the Citadel in Victoria. The shelters underwent extensive restoration by Wirt Għawdex in collaboration with the Gozo Ministry.\nDr Caruana expressed her satisfaction that this historical site was now open to the public and that the continuing cooperation between Wirt Għawdex and the Ministry will see more projects in 2019.\nIn the Public Works records it is noted that in July/August 1940 some Gozitans sought the help of government public works diggers to construct private shelters for them as they realised that the thick walls of their homes would not provide enough protection from possible air raids. Those Gozitans who could afford to have a private shelter commissioned diggers as the government was not yet in a position to provide public shelters. In fact, private shelters were already being used in Malta.\nThe restored shelter complex was excavated in early 1941 and consisted of 32 individual rooms along 150 metres of tunnels underneath the St Martin demi-bastion. Its main entrance is on the main roadway up to the main gate with an emergency exit within the ditch.\nThe government would only dig out the central corridors and then families had to pay for the digging of their own private shelters. Those who opted for a private shelter had to follow certain conditions and restrictions such as the size of the cubicle, digging had to be finished within a month and no doors allowed on any of the cubicles.\nThe rehabilitation of the shelters also included the installation of an LED lighting system, motion sensors, a sound system and information panels.", "comment_count": 0, "id": 483}, {"keywords": "Gozo", "author": "", "article_body": "The musical Wojtyla – God’s Clarion Call was staged at the Don Bosco Oratory, Victoria, over the weekend. The musical was produced in collaboration with the Fondazzjoni Santa Cecilia (Gozo) to mark 40 years from the beginning of the pontificate of John Paul II as well as the 70th anniversary of the Don Bosco Oratory in St Augustine Square.\nThe musical drama was entirely a Gozitan production with over 90 actors, dancers and musicians. Jamie Camilleri played Karol Wojtyla, supported by established actors and singers as well as several emerging talents. The orchestra was under the direction of Mro Antoine Mercieca who also composed the music to the lyrics by Joseph W. Psaila. Saviour Cremona was artistic director.", "comment_count": 0, "id": 484}, {"keywords": "Gozo", "author": "", "article_body": "The Speech Language Unit at Gozo General Hospital celebrated European Day of Speech and Language Therapy for the first time by organising a seminar entitled ‘Autism... Because it Matters’ at the Gozo Ministry in Victoria.\n\nGozo Minister Justyne Caruana introduced the seminar which was sponsored by Eco Gozo and Steward Health Care Malta. The seminar dealt with the role of speech language pathologists and speech and language therapy services. Angela Scerri Cassar (right) was one of the speakers who addressed the seminar.", "comment_count": 0, "id": 485}, {"keywords": "", "author": "Sarah Carabott", "article_body": "It is yet unclear how parliamentary petitions, some of which have garnered thousands of signatures, are being processed. \nDuring a recent House Business Committee meeting, Democratic Party MP Godfrey Farrugia questioned why the petitions committee had not processed any of the petitions presented during the current legislature.  \nThe meeting was told that the committee had drafted a set of guidelines setting terms of reference on which the petitions filed by the public will be considered valid or not but they had not been finalised.\nThere are currently 10 parliamentary petitions online, six of which have been closed for signatures. \nOne of those that closed last year objected to an extension for an existing tuna farm operation off the north-east coast garnering some 1,865 signatures.\nAnother petition calling for the protection of embryos, which attracted more than 8,780 signatories, had created quite a stir last year with the Gift of Life Foundation calling for an independent investigation into why it had become impossible to sign it. \nSpeaker Anġlu Farrugia had clarified that submissions could not be received because of an update carried out by Google to its reCaptcha software, which is widely used to prevent spam submissions. \nIn the previous weeks the number of signatures had mysteriously decreased and the deadline allowing signatures was also suddenly brought forward. \nIt has temporarily stopped people’s right to petition Parliament\nAmong the open popular petitions, one is urging for the transformation of Manoel Island into a national heritage park. It closes on April 14 and has some 7,340 signatures, while a Stop the Malta-Gozo Tunnel petition has raked in 3,015 signatures so far.\nDr Farrugia told the Times of Malta that the delay in setting guidelines for the petitions had become a stumbling block.  \n“It has temporarily stopped a means whereby people’s right to petition Parliament be processed. Timely execution is of essence. I hope that the conditions imposed will not hinder freedom of expression and association,” he said.\nDr Farrugia noted that the European Parliament has always considered petitions as a key element of participatory democracy.\nThis was one of the fundamental rights of European citizens: any citizen, acting individually or jointly with others, may at any time exercise his right of petitioning the European Parliament under Article 227 of the Treaty on the Functioning of the EU, he added.\nQuestions sent to the House of Representatives at the end of February remained unanswered by the time of going to print.\nThe House was among others asked whether these included a grandfather clause, therefore exempting the existing open or closed petitions from any requirements stipulated by the new guidelines and what happens to parliamentary petitions once they close for signatures.", "comment_count": 8, "id": 486}, {"keywords": "", "author": "Claire Caruana", "article_body": "Students who leave school early report suffering from “intense health-related problems” more than those who further their studies, a study has confirmed. \nPublished on Friday, a study by lead researcher Milosh Raykov and the National Observatory for Living with Dignity, found that people who ended their education early, at about the age of 14 years, experienced intense health-related problems more often than their counterparts who studied until they were much older. \nAccording to the researchers, almost half (42 per cent) of those who abandoned their studies early complained of physical ailments, which was only made worse by the low income they earned and the high levels of job insecurity they experienced. \nThey also found that early school-leavers and their families were “more frequently deprived of satisfying their basic needs”. \nStudents’ social background was also found to be a determining factor of their success in school. According to the researchers, it emerged through their analysis that the education attainment of both parents was “significantly associated with early exit from formal education”. \n“72 per cent of employees with low educational attainment (elementary or incomplete secondary education) have mothers with the same education attainment, eight per cent of them obtain a post-secondary certificate and only three per cent of them obtain a university degree,” they noted. \nFathers’ educational attainment was also found to impact the level of education children went on to achieve.\n72 per cent of employees with low educational attainment have mothers with the same education attainment\nCall for new forms of interventions\nConcluding their study with a series of recommendations, the researchers insisted that “some additional measures and new forms of interventions” were required for the early school-leaving rate to be slashed.\nIt was also recommended to step up efforts to identify the capacity of those with low educational attainment to re-engage in formal education and to gain the skills, knowledge and credentials that will improve their prospects in the labour market. \nSpeaking at the unveiling of the study, President Marie-Louise Coleiro Preca said the work provides “relevant evidence” that would help with understanding the reasons behind early school-leaving. \n“I hope that these important insights are taken into consideration by politicians and policymakers, who have a mandate to secure the best future prospects for each and every one of them, with concurrent benefits for economic growth and social cohesion,” the President said. \nShe insisted that ensuring students did not abandon their studies before securing the necessary qualifications was especially important because it aided in breaking the cycles of deprivation, poverty and social exclusion. \nRead: Malta ‘unlikely’ to reach EU's school-leaving target\nAhead of the study’s publication, the Times of Malta reported that the researchers had also come to the conclusion that it was “unlikely” Malta would manage to slash the early school-leavers’ rate to 10 per cent in line with the European Union’s 2020 targets. \nAlso speaking at the unveiling of the results, Observatory head Carmel Borg said it was worrying that such trends were still emerging when Malta had compulsory education until the age of 16. \n“Things are moving and the results are there. But I still feel very edgy that the numbers are very high. Are we okay with the passes we have? Have we set the bar too low?” the head of the Observatory, which falls within the President’s Foundation for the Well-being of Society, argued.", "comment_count": 13, "id": 487}, {"keywords": "", "author": "", "article_body": "The Finance Ministry has welcomed the latest credit rating report, published by Standard and Poor’s, which affirmed Malta’s short and long-term sovereign credit rating with a positive outlook. Standard and Poor’s attributes Malta’s positive rating to its strong growth performance, recurring current account surpluses driven by its large services exports, and the improving government budgetary and debt positions, and fiscal management.\nStandard and Poor’s expect Malta’s headline GDP growth performance to, likely, exceed that of peers at similar income levels and stages of development. This, it adds, reflects the authorities’ commitment to growth-enhancing policies.\nThe credit rating report notes that Malta’s real GDP growth accelerated to 7.6 per cent on average in the 2014 to 2018 period. It also acknowledges that the structural shifts in the economy created new employment opportunities causing the unemployment rate to decline further to 3.8 per cent in 2018, the lowest in two decades.Minister for Finance Edward Scicluna said: “The credit rating report acknowledges the Maltese authorities’ efforts to strengthen supervisory standaRernal risks to growth pointed out by the credit rating agency, we are actively monitoring such risks by promoting further diversification and registering broad-based economic growth.”", "comment_count": 57, "id": 488}, {"keywords": "", "author": "", "article_body": "The owner of a wild cat being controversially kept on top of a Fgura house hit back at critics by uploading a video showing him embracing the exotic animal feared by many.\n\nEtienne Gracey uploaded the clip on the social media network showing him embracing the puma in a clear act of defiance against critics who believe such animals should not be kept in such spaces. The animal appears to be in a relaxed state as it snuggles with its owner.\nA video of the puma pacing on top of the roof uploaded last Thursday sparked outrage even though the Environment Ministry said the animal is registered with the authorities and meets the requirements laid down by regulations.\nA separate video uploaded shows the puma's rooftop enclosure, complete with a water feature. The caption says: \"I Love you too my son, and bdw i bought this house all for you its just a birthday present xxx\".\nAccording to the law, dangerous animals can only be kept in a licensed zoo unless permission is granted by the director of veterinary services for them to be kept in adequate enclosures.\nMany resorted to social media to lament that just because a warped law permits such exotic animals to be kept in a cage it does not make it right.", "comment_count": 84, "id": 489}, {"keywords": "", "author": "Denise Grech ", "article_body": "Gibraltar-based gaming group 888 Holdings has moved a step closer to shift some of its operations to Malta in a bid to counter Brexit insecurity.\nThe company announced in its 2018 financial results, announced a few days ago, it had obtained a gambling licence in Malta where it planned to relocate some of its operations.\nThe group said it started restructuring its European-facing business last year. The exercise is expected to be completed by the end of this month.\n“This would see part of the group’s operations migrated to other EU member states, most notably Malta, where the group is now a licensed operator,” it reported. The Malta licence was obtained at the end of last year, when it also got permission to operate in Sweden.\nTurning to Brexit concerns, the company said it was unable to control political changes of this nature.\nHowever, it said it would continue serving European markets with no disruptions to its business through its gaming licence in Malta and by establishing a server farm in Ireland.\nIt was unable to control political changes of this nature\nThe company posted higher profits though revenue was down after its UK business was hit by tighter regulation and higher taxes. Pre-tax profit rose to €96.2 million and revenue was down to €478.3 million from €479.3 million in 2017, according to the financial results.\nWhen asked about its expansion plans to Malta, a spokeswoman only referred the Times of Malta to the financial results.\nThe Paradise Papers had indicated that the company already had a registered office in Ta’ Xbiex, through the holding company VHL Financing Limited.\nMalta, like Gibraltar, is seen as an attractive location for gambling and gaming industries because of their low taxes. The country is seen as the main beneficiary in the industry, particularly in case of a hard Brexit.\nGibraltar is fighting back trying to assure companies they would still be able to operate within the same regime even when the UK left the EU. Still, companies continue to consider Malta as a Plan B.", "comment_count": 28, "id": 490}, {"keywords": "", "author": "", "article_body": "Updated 4.15pm with PL reaction\nAttempts to silence journalists and activists should not go unnoticed, a Turkish journalist who is currently facing a prison term of 13 months, urged the Maltese public on Saturday.\nAddressing journalists alongside Nationalist MEP David Casa, Pelin Ünker said: “My message to you is that we must not allow ourselves to be silenced. Journalists and civil society activists must work together, even across borders. Those of us who paid the ultimate price must never be forgotten.\"\nMs Ünker is currently facing a prison term after reporting on the Paradise Papers that exposed people at the levels of power in the Turkish government. She was recently found to have defamed her country's former prime minister and two of his sons.\nThe journalist, who is part of the International Consortium of Investigative Journalists, said politicians play a fundamental role in ensuring that laws are in place to protect journalists but they also help when they create pressure for action to counter attacks on journalists and activists. \nMr Casa said that without true media freedom, without free press, there can no be democracy. Journalists are facing increasing pressure that can take many forms. When all efforts are exhausted they are jailed or even assassinated.\nHe said politicians must show due respect to the role of the investigative journalist. Public officials must also do so, and understand that the role of the media is after all to hold power to account.\nThe Labour Party said Mr Casa can never be taken seriously when speaking about the role and freedom of the media.\nOnly on Friday, Mr Casa’s lawyer, Jason Azzopardi, tried to press a journalist in court to reveal his source, the PL said in a statement. \n\"Casa continuously calls for the protection of whistleblowers in Turkey and worldwide, but in the case of Malta, he expects to know the whistleblowers so he could personally attack them.\"", "comment_count": 19, "id": 491}, {"keywords": "", "author": "", "article_body": "Malta has signed and ratified an optional protocol to the Convention on the Elimination of All Forms of Discrimination against Women (Cedaw).\nThe protocol grants additional rights to women who have suffered discrimination.\nThough Malta ratified the UN convention in 1991, it had yet ratify an optional protocol allowing women who had been discriminated against and who had exhausted all local remedies to take their case before a Cedaw investigative board.\nThe protocol was signed by Equality Minister Helena Dalli during the 63rd session of the Commission on the Status of Women.\nDr Dalli said the ratification was particularly significant and timely as consultation with regard to gender equality mainstreaming legislation and policy was open until April 8.", "comment_count": 6, "id": 492}, {"keywords": "", "author": "", "article_body": "The Democratic Party has pledged to cut all single-use plastics from its events and challenged other political parties to do the same.\n\"It's time to cut the crap,\" MEP candidate Camilla Appelgren said, adding that one of the reasons she joined PD was the party’s firm commitment to lead by example on environmental issues.\nThe PD’s presence at clean-ups for years was now being followed up by an even firmer and clearer commitment towards the environment.\n“Together we have written a pledge which we are inviting other political parties, local councils, businesses and individuals to take up, which includes replacing plastic confetti with paper,\" she said.\nMEP candidate Martin Cauchi Inglott said there were many ways through which one could reduce one’s carbon footprint and which could also have added benefits. ", "comment_count": 12, "id": 493}, {"keywords": "", "author": "Keith Micallef", "article_body": "A 42-year-old man who works in a bakery pleaded not guilty to threatening his estranged partner with a gun and a knife.\nHe was granted bail against a deposit of €500 and a personal guarantee of €8,000.\nDerin Mangion, from Ħal Far, who has a daughter with the alleged victim, was charged before duty Magistrate Claire Stafrace Zammit.\nThe court heard that the relationship between the two had deteriorated in recent days, amid rising tension.\nPolice inspector Elton Taliana said the police intervened after a report filed by the victim. However, neither the firearm nor the knife used in the alleged incident on Thursday had been found.\nThe defendant was also accused of relapsing, sending threatening messages through his mobile phone and disturbing public peace.\nLawyers Franco Debono and Marion Camilleri were defence counsel.", "comment_count": 0, "id": 494}, {"keywords": "", "author": "", "article_body": "A development application for a 14-storey block, 11 of the above street level on the site of the Toyota showroom in Triq l-Imdina, Żebbuġ, has been filed.\nAddressing a news conference, AD chairman Carmel Cacopardo said the applicant was seeking permission to build an 11-storey tower above the ground with three additional floors of underground on an area of 11,000 square metres.\nAltenattiva Demokratika, he said, has already been in contact with several residents who were worried since the tower would have a considerable impact on them and the neighbourhood.\nMr Cacopardo noted that it was not stated anywhere in the Planning Authority policies that such buildings in Żebbuġ should be approved. The development was considered a medium-height building and the planning policies reserved these to specific locations. Planning policies, he said, were often written in ambiguous language that often left room for interpretation which favoured the powerful. The excuses used were usually regeneration or job creation.\nThe proposed development would include a supermarket, shops, offices and health facilities, a gym and a car park for 908 cars. The most obvious impact was of the building was that it would ruin the skyline.\nIt would also generate more traffic in a place which could not take more and more cars, congestion and traffic. It would generate shadows on the neighbouring properties and some residents could just throw away their photovoltaic panels or solar water heaters.\n\"Powerful interests have turned their sight on Żebbuġ. Residents need our help and support in the ongoing fight against uncontrolled development and so called ‘business friendly’ policies which have no respect for anyone but seek to bend over backwards to make sure that profits come before people\" Mr Cacopardo said.", "comment_count": 14, "id": 495}, {"keywords": "", "author": "Keith Micallef", "article_body": "A 55-year-old Briton who is wanted in the UK over allegations of defrauding his 82-year-old partner with whom he has been living in Għajnsielem for a number of years has been remanded in custody after objecting to an extradition request. \nMark Anthony Saunders, was arraigned before Magistrate Claire Stafrace Zammit, following the issuance of an international arrest warrant from a court in Birmingham on March 1.\nPolice sources told Times of Malta the case dates back a number of years when, back in the UK, the defendant, who used to work as a care worker, had been engaged by an elderly couple to look after the husband.\nFollowing the latter’s death, the accused had allegedly acquired some properties, half of which were financed by the widow. Subsequently, the defendant entered into a relationship with her and they moved to Gozo in 2016.\nDuring proceedings, lawyer Manuel Mallia, who appeared for the defendant, insisted that this was a malicious case instigated by the children of his client’s partner.\nWhile claiming that this was the second such attempt against the defendant, he insisted that this was more of a civil case than a criminal one. \nOn his part the accused, who is now retired, insisted that he was looking forward to the proceedings to prove he had moved to Malta at his partner’s request. \nThe case continues on Thursday when another court will be considering the merits of the extradition request. \nPolice inspector Mark Galea prosecuted.", "comment_count": 0, "id": 496}, {"keywords": "", "author": "Keith Micallef", "article_body": "A car dealer from Siġġiewi has been remanded in custody after pleading not guilty to trafficking cannabis and cocaine.\nAlthough no details were divulged during the arraignment on Saturday, before duty Magistrate Claire Stafrace Zammit, police sources said the man, Charles Borg, 45, was arrested after he was found in possession of cannabis, weighing 15 kilos.\nHe was also found in possession of 80 grams of cocaine.\nPolice inspector Anthony Scerri told the court that the crimes were committing within 100 metres of a school or places frequented by youths. The accused was also charged with relapsing.\nNo request for bail was made. Lawyer Joe Giglio was defence counsel.", "comment_count": 0, "id": 497}, {"keywords": "", "author": "", "article_body": "As member states prepare for May’s European Parliament elections, the latest Parlemeter survey shows a growing appreciation of the EU by Europeans and an improved awareness on the forthcoming European Parliament elections. \nIn Malta, where elections will be held on Saturday, May 25, the voting age has been lowered to 16 years for the first time. During a series of interviews, Times of Malta found that the majority of students intend to vote in the upcoming European Parliament elections, although some believe they are not informed enough to do so. Moreover, the majority of students interviewed said people should exercise their right to vote, while others identified certain conditions that should be met before youths can cast a well-informed vote.\nOne of the pertinent issues that students feel Europeans are currently faced with is migration. Some interviewees said the distribution of migrants across the EU countries should be addressed by the MEPs elected in the upcoming elections, while others added there should be more tolerance to diversity within Europe.\nFor one Junior College student, the fact that Brexit is looming without the UK having finalised its terms of exit from the European Union was a worrisome subject. Another important issue cited by several students was the global environmental threat of climate change.\n“I feel like we’re not doing enough to help the environment,” said one student, adding that this is one of the most important things that MEPs should be aiming to tackle. Students also said that over-construction and the lack of walking and cycling passages could be changed by the elected MEPs.\nOther students at the University of Malta said that gender equality is an area they think MEPs should be addressing. This includes pushing for women’s rights, equal pay and encouraging more women to enter into politics.\nWhen asked what values the MEPs – who will be acting as their voice for the coming five years – should possess, replies varied. One respondent said: “They should be willing to listen to different opinions, not only from other politicians, but also from working professionals, such as scientists in the case of climate change.”\nAnother student added he would like to see Malta’s representatives at the European Parliament putting Malta first. Compassion, level-headedness and a positive way of thinking and approaching discussions with other countries were also given importance.\nThe act of voting is regarded not just as a right, but as a duty by many students. Voting is an integral part of the democratic process and students feel that members of society should be engaging in this act in a conscious and informed manner.\n“If they have a right, they should go and vote because we have to decide what we want for our future,” said one of the students. Others also highlighted the importance of voicing your opinion and taking responsibility for the future of Europe through this democratic act.\n‘The EU is about balance’\nMark Harwood, director of the Institute for European Studies, University of Malta\nMalta enters the 2019 European Elections as an anomaly of sorts. We are a small State on the periphery of Europe, far from Brussels with limited potential to ensure our voice is heard in a union of 500 million people and yet we are one of the most informed and fully engaged countries in the EU. In previous European Parliament elections we registered the highest turnout of any country where voting is not obligatory and there is little to suspect that we will not repeat this high turnout on May 25.\nFrom the interviews undertaken with students, it’s encouraging to see young people engaging with the elections and articulating their concerns. Many of the issues they highlight, including migration and the environment have been perennial concerns of the Maltese as expressed in Eurobarometer surveys throughout the years. In terms of Brexit and the gender gap, these are issues which appear to be a growing concern, both locally and abroad.\nHowever, while many people look to the EU to solve national problems, the EU does not always have the right to involve itself in certain matters, like taxation, social policy or culture. In these and other areas, the member states wish to maintain their control and exclude the EU from significant involvement. This has been seen clearly in the area of irregular migration where the EU has limited competence and where the member states differ on how to tackle irregular migration flows.\nThis has not stopped the EU from trying to help share the burden of irregular migration on entry-point countries but the scheme is voluntary and based on solidarity among the member states with some countries refusing to participate.\nThe same can be said for the environment. The EU is a global leader in combatting climate change but its environmental policy does not stretch to issues like over-construction or cycling paths. These issues belong to the national government and it is national politicians who must address the issue. This does not stop the EU from encouraging the use of more environmentally friendly modes of transport, such as cycling, through the financing of projects such as the EuroVelo 8 which creates a cycle route across the northern Mediterranean, but the EU cannot dictate to Malta the need for more infrastructure for cyclists.\nIn terms of gender-based inequality, the EU has fought discrimination for decades and has sought to promote gender equality, even within its own institutions, trying to ensure gender balance within the College of Commissioners as well as with long-term plans for strategic engagement for gender equality in the Union. However, the European Commission is often restricted in what it can do in this area to raising awareness, encouraging reforms and facilitating learning among the member states.\nUltimately the EU is about balance, doing things at the appropriate level. If an issue is tackled best at the national level, it should be dealt with by the individual member states and much of the reforms needed in Malta on gender equality will have to come from our politicians and not the EU, but the EU can point the way.\nTherefore, as we move towards the elections it is heartening to see high levels of engagement among our voters and the hope will be that the more engaged voters encourage all those around them to vote on May 25.\nA service brought to you by the European Parliament Office in Malta.", "comment_count": 2, "id": 498}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta will increase its focus on solar energy under a new 2030 plan though development policies and lack of available land could hamper the shift.\nThe draft National Energy and Climate Plan, newly published for public consultation, lays out the government’s strategy for the next decade under the EU’s long-term climate goals and Paris Agreement commitments.\nIt lays out key objectives for Malta of a 19% reduction in greenhouse gas emissions and a 13% share of renewable energy in final energy consumption by 2030.\nBuilding on a move towards solar energy generation in the current renewable energy plan, the draft document includes extensions on measures to incentivise large-scale solar farms and rooftop photovoltaic panels. It suggests that solar output could reach a 260 megawatt peak by 2030 – implying a total footprint of about 3.4 square kilometres – compared to a planned 160 megawatts and a 2.7 square-kilometre footprint in 2020.\nThis would contribute to between 30 and 40% of Malta’s renewable energy contribution while heating and cooling – primarily heat pumps – will contribute 40 to 54%.\nWaste-to-energy electricity generation from the major incinerator planned to be completed by 2023 is expected to contribute only “a relatively small share”.\nPrioritisation of PV systems, however, could, according to the plan, be hampered by the rapid decrease in the land available for solar farm developments, pushing up costs.\nBetween 30 and 40% of Malta’s renewable energy contribution\nMoreover, planning policies encouraging the development of apartment blocks pose further problems both because of the reduction of available roof space and also by the increase in overshadowing.\nThe plan warns that interest in investment in renewable energy appears to be waning, with real estate investment being prioritised due to its shorter payback period and perceived longer-term benefits.\nIt points to the low take-up on the government’s second competitive call for large-scale solar installations, where the total bids amounted to just half of the capacity on offer.\nThe plan proposes discussions with banks to include incentives for the installation of PVs and solar water heaters in loan policies, as well as incentive schemes for developers and real estate agents.\nIt also proposes building on the government’s communal photovoltaic farm project at the site Il-Fiddien, allowing people without access to a private roof to buy into the shift.\nAlso stressed is the importance of solar water heaters, with the government aiming to provide support for the installation of 1,500 systems every year in the next decade ‒ compared to 400 a year under previous plans ‒ although it notes that the past few years have seen a downward trend in such systems as preferences move to PV panels.\nThe draft plan does not include any assessment of the impact the planned policies and measures are projected to have, stating only that this analysis will be included in the final plan that must be submitted to the European Commission by the end of the year.\nThe plan, which is open to public consultation until April 10, also includes the government’s 2030 measures on energy security, internal energy market, energy efficiency and research, innovation and competitiveness.", "comment_count": 17, "id": 499}, {"keywords": "", "author": "", "article_body": "Residents, NGOs and three local councils have filed two lawsuits regarding the db Group City Center Project on the former ITS site.\nThe lawsuits were made possible through an overwhelming public response to a crowdfunding initiative last October, when over €26,000 were raised to cover legal expenses for actions against the project.\nAs part of the latest raft of legal actions, the appellants are appealing the recent decision of the Planning Tribunal.\nWhile the tribunal ruled in the appellants’ favour on a number of important points, it also rejected a number of valid arguments that were crucial to the health and wellbeing of the community and the infrastructure's capacity to support intensive development of the sort.\nThe residents, NGOs and councils are appealing for a transparent and sustainable resolution regarding a number of legal points which are still unresolved.\nThey have also filed an action for judicial review in court. They stated that the PA’s decision to issue the permit for the db Group project was in breach of Maltese law since the process did not follow the principle of natural justice and relevant legal procedures.\nThe communities and NGOs involved said they were committed to continue fighting this unsustainable and over-intensive project for as long as necessary.\n“Projects of this extreme dimension cannot be allowed to engulf whole communities putting an inordinate strain on the infrastructure, whilst being approved far before any rational and long-term measures are ensured. The attitude of ‘Build first and cope with the fall-out later’ must stop,\" they said.\nThe €300 million City Centre project, which includes a 37-storey tower and 17-storey hotel, was approved by the Planning Authority in September despite an unprecedented 4,500 objections from the public, local councils and NGOs.\nAn appeal against the decision was filed in November by 17 entities, including Pembroke, Swieqi and St Julian’s local councils and several environmental groups, following a crowdfunding drive.\nThe two actions in court were undertaken by the Pembroke, St Julian’s and Swieqi councils, Moviment Graffitti, Flimkien għal Ambjent Aħjar, Din l-Art Ħelwa and Friends of the Earth Malta and nine residents.", "comment_count": 6, "id": 500}, {"keywords": "", "author": "", "article_body": "The church’s Peace and Justice Commission has prepared a reflection document based on the church’s social teachings in preparation for May’s European Parliament elections.\nThe document, which may be read here, is intended to serve as a tool for Christians to continue carrying out their duties and responsibilities in society which did not start and end with voting but continued in everyday life.\nIt speaks on social and environmental issues which affect Maltese and European societies, and is aimed to be used by priests in preparation for Sunday homilies during lent, as well as by those who wanted to reflect on their role as Christians in society.\nThe reflections are based on the gospel and human stories dealing with* social justice, the distribution of wealth and opportunities, poverty and social exclusion;\n* safeguarding the environment, including food waste;\n* global peace and the reality of arms exports;\n* respect to human rights and dignity, which are threatened by unjust economic practices.\nThe themes relate to a document launched by the Justice and Peace Europe commissions. They focus on the four issues which require solutions at a European level and which the JPE would like to see implemented in the EP’s next legislature.\nThey affect people directly and indirectly and were linked to daily choices.\nThe commission said it was not saying that these proposals to be the best or the only ones Europe needed but it was trying to shed light on how the Christian faith could enhance daily living in society in a practical manner.", "comment_count": 8, "id": 501}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A young man who had probably unknowingly witnessed the brutal murder of a young Dutch woman in Santa Venera last summer gave a chilling account of his experience in court in compilation proceedings against the accused.\n“I just heard shouting. It was like the woman was possessed. No words. I heard screams… subsiding slowly until it was replaced by a gurgling sound,” said the son of the landlady who, merely days before the incident, had leased her studio flat in Triq l-Istampaturi to the accused.\nHis testimony had to be momentarily suspended when the witness claimed to be feeling unwell.\nMr Jelle Rijpma, a 22-year old Dutchman, stands accused with murdering Shannon Mak, his former girlfriend and work colleague, in the course of a violent row in the early hours of August 3, 2018.\nUpon resuming the testimony, the young man recounted how on that night, at around 2.30am, he had removed his headphones and ventured out onto the balcony of his family flat so as to smoke a cigarette.\nIn the darkness, he heard noises and a female voice shouting, the man recalled.\n“I didn’t see anything. Just heard shouting. It was a woman like sort of possessed.”\nAt that point of the testimony, parte civile lawyer Stefano Filletti stepped in, asking questions to elicit further details from the witness.\n“Was it words or a noise you heard?” asked the lawyer.\n“No words. It was screaming and I cannot explain,” came the reply.\n“How long did it last?” was Dr Filletti’s next question.\n“I’ve no idea how long but it went on for some time… It seemed to be coming from behind. There was a sort of echo because of the close proximity of the buildings across the street,” the young man said, assisted by an interpreter who translated his testimony to English for the benefit of the accused who sat listening attentively at the dock.There’s a dead woman lying next to your car, the neighbour told me\n“How did it stop? Was there one abrupt stop or did it subside gradually?” Dr Filletti went on.\n“It continued for some time, getting lower slowly until it stopped. It was not on and off. Then there was like a gurgling sound. Like bubbles,” the witness explained, concluding his account.\n“Did you hear any noise or voice of another person?” was the final question.\n“No,” came the reply, before the young man presented in court the lease agreement which his mother had concluded, just days before the murder, with Jelle Rijpma, whom the witness identified in court before taking his leave.\nDuring the same sitting, a resident living at Triq il-Mastrudaxxi, recounted the shocking experience of spotting the murder victim lying close to the rear wheel of her car on that August morning.\nIt was close to 6.30am when the lady ventured out of her home to set off on a normal day’s work.\n“There’s a dead woman lying next to your car,” called out one neighbour across the road.\n“I was in shock,” recalled the witness as she explained how she had caught sight of the victim’s body lying between the rear left wheel of her vehicle and a garden wall.\n“I saw her clearly. She had smudged make-up, blood, her legs fully exposed since her skirt was pulled up. It was as though someone had left her there on the road.”\nPolice officers had then asked the witness to move away since the scene of crime had to be preserved.\nThe witness next recalled how she had spoken to the inquiring magistrate who shortly arrived on site, explaining the layout of the area and the various CCTV cameras monitoring the streets in the vicinity all the way to St Joseph High Road.\nShown photos taken by forensic experts at the scene of crime, the witness identified the victim and her own car which had also been searched at the time of the incident, confirming “It was exactly what I saw.”\nInspectors Kurt Zahra and Robert Vella prosecuted. Lawyer Leontine Calleja was defence counsel.", "comment_count": 0, "id": 502}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Justice Ministry, headed by Owen Bonnici, spent more than €650,000 on consultancies last year, according to new information released in Parliament.\nThe Arts Council, one of the entities falling under the remit of the Justice Minister, was by far the biggest spender among Dr Bonnici’s entities, dishing out hundreds of thousands of euros in consultancy services to various companies and individuals, mostly connected to the Labour Party.\nFormer PN officer and TV host Lou Bondi, who was immediately put on the government’s payroll soon after Labour’s return to power in 2013, continued to offer his ‘advice’ to Albert Marshal’s council for another year, pocketing over €51,000 in taxpayer money last year.\nRead: Despite warning, ministry gave €4.5m direct orders in six months\nOther beneficiaries of the Arts Council consultancies were Natius Farrugia, Zurrieq’s Labour mayor, who has been engaged to help the council deal with local councils on cultural activities, and Ikona Artworks, which has been servicing the Labour Party and the Office of the Prime Minister for the past years.\nFormer PBS CEO Anton Attard was also engaged by Mr Marshall, currently also occupying the post of the deputy chairman of PBS, to assist the council on the organisation of national festivities.\n\nThe Arts Council has frequently made headlines in the past years over its spending spree when it comes to direct orders and consultancies.\nThis was also picked up by the National Audit Office, which harshly criticised the methodology of how the council was spending public funds, particularly by dishing out direct orders without issuing public calls for offers. It had highlighted a number of issues, including the lack of good governance in the running of the Arts Council.\nRead: Arts Council: no financial statements, €2.1 million in direct orders\nAccording to the latest information available, during the first half of 2018, the Arts Council issued 65 direct orders worth €1.5 million.\nThese also included a direct order to Felix Busuttil, now a Labour Party candidate for the upcoming MEP elections.\nFollowing four repetitive parliamentary questions submitted by Nationalist MP Jason Azzopardi, Dr Bonnici published a list of consultants engaged by his various entities last year.\nLawyer Andy Ellul, a former police officer with close connections to the Labour Party, was paid over €5,000 for legal services to Fondazzjoni Kreattivita, while former Ambassador George Buttigieg is getting over €17,000 a year for his advice to the Medicines Authority.", "comment_count": 93, "id": 503}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Saturday’s newspapers.\nTimes of Malta says more than 1,500 people operating AirBnB-style accommodation registered following a clampdown by the Malta Tourism Authority. In another story, the newspaper says a “substantial” amount of the €13 million stolen from Bank of Valletta during a cyberattack last month has been recovered.\nThe Malta Independent leads with the mass shootings at New Zealand mosques which left 49 people dead.\nIn-Nazzjon quotes PN leader Adrian Delia calling for a strong agriculture sector.\nL-Orizzont quotes Tourism Minister Konrad Mizzi speaking on a strategic vision for tourism leading to 2025.", "comment_count": 0, "id": 504}, {"keywords": "", "author": "Denise Grech ", "article_body": "More than 1,500 people operating AirBnB-style accommodation registered following a clampdown by the Malta Tourism Authority.\nHoteliers have long sounded warnings that AirBnB-style operators were operating without going through the proper channels. They were operating without being taxed and consequently gaining an unfair advantage, Malta Hoteliers and Restaurant Association president Tony Zahra said.\nFollowing insistence by multiple hoteliers, the MTA was calling people up after finding their listings on popular websites such as Booking.com to ask them to register.\n“In fact, over the past few months, more than 1,500 people have registered,” Tourism Minister Konrad Mizzi told stakeholders.\nAuthorities were also in talks with AirBnB to request licences from Malta-based operators and exploring ways of requesting AirBnB to collect the contribution on their behalf, he said.\nThe government would be reviewing the taxation system of those who wished to provide accommodation through their apartments, the Tourism Minister said.\nConceding there was an “issue with registration”, Dr Mizzi said the taxation system would be reviewed to incentivise people to comply. \nNon-collective accommodation, including AirBnB properties, were now occupying a similar space as four- or five-star hotels, he said. Over the last quarter there was a double-digit growth in non-collective accommodation, he added, noting the accommodation booking platforms were offering competitive rates.\nGrowth in non-collective accommodation, such as AirBnB, was outpacing that of hotels, a survey by Deloitte warned yesterday.\nThe number of people seeking accommodation in hotels was still on the rise, but at a conservative level, the survey found.\nCommenting on the figures, Mr Zahra said the association was planning a short- and long-term plan to address the threat of AirBnB and other non-collective accommodation.\n“We have to make sure we are offering value for money, but we also have to make sure we continue working hard to remain successful,” he said.\nNon-collective accommodation such as AirBnB might start eating into hotels’ profitability, financial advisor Raphael Aloisio warned.\nThe shift towards non-collective accommodation could also be partly explained by the increase in the number of tourists coming to Malta to stay with a family. As more foreign workers came to Malta, the number of relatives visiting them and not staying at hotels grew as well, the survey found.\nThe data also showed that while tourist numbers were on the rise, tourist expenditure remained flat in 2018. \nThe impact of AirBnB has been rapid and substantial. Only a decade after it was launched, it already racked up some 6,800 listings in Malta by 2018. Properties might be listed in various ways, for individual rooms as well as for a whole unit.", "comment_count": 37, "id": 505}, {"keywords": "", "author": "", "article_body": "A police operation resulted in a find of 15kg of cannabis in a car being driven by a 45-year-old man.\nA further 300g of cannabis and 80g of cocaine were subsequently found at the man's home on Thursday evening.\nThe man, who comes in Valletta but lives from Żebbuġ, will be charged in court in the near future.", "comment_count": 0, "id": 506}, {"keywords": "", "author": "Denise Grech ", "article_body": "We soon might be seeing festivals celebrating plastic instead of annual strawberry festivals, Opposition leader Adrian Delia said on Friday.\nSpeaking in Mġarr, where the annual strawberry festival takes place, Dr Delia insisted the government did not care about agriculture. \nThe government took away everything: power from local councils and funding from farmers, he said. He noted there was a decrease in budgetary measures helping farmers.\nHe also warned of recent statistics showing we were consuming less Maltese produce.\nThe Nationalist Party is proposing to tap into European regulations to promote fresh Maltese produce. It is also proposing that farms and farming land could be transferred to other relatives besides children, as is the case under current regulations.\nThe Maltese countryside was also important to us, he said, adding that the Nationalist Party wanted farming to continue. The window of opportunity to save our countryside and natural environment was closing, he warned.\nRead: The PN's proposals on agriculture\nTurning to reports that air quality deaths in Malta were more than twice what was previously thought, Dr Delia said close to 600 people died prematurely because of the dwindling air quality.\nThe government did not care about that which surrounds us, he said, adding the farming sector needed to be given priority. ", "comment_count": 19, "id": 507}, {"keywords": "", "author": "", "article_body": "The authorities have ordered the withdrawal from the market on three baby products after tests revealed that a number of them pose a serious risk to consumers, infants and babies.\nThe authorities instructed operators to remove the products from the market and return them to their supplier, warning that enforcement action would be taken against those who did not do so.\nThe tests were carried out by the Technical Regulations Division within the Malta Competition and Consumer Affairs Authority as part of the Prosafe Joint Action Market Surveillance.\nThe BabyGo-Sleeper changing table is not compliant with the applicable standard (EN 12221-1:2008+A1:2013) since the width and length of the changing unit are less than those required by the standard. Also, the changing table and cot collapsed during the strength test specified in the standard and the function of the sample was impaired.The BabyGo-Sleeper travel cot is not compliant with the applicable standard (EN 716-1:2017) due to a number of holes, gaps and openings at the corners of the cot, between the fabric and the frame and between the textile lid and the structure of the cot on each side of the green textile lid. Additionally, on the outside of the cot, there is a pocket which poses head entrapment risks. Finally, the folding mechanism of the travel cot disengages when the force stipulated by the standard is applied.\nThe Infantino-Swift baby carrier (pr190547b) is not compliant with the applicable standard (EN 13209-2:2015) due to a failure in the durability test as stipulated by the standard. The baby carrier broke when tested with the load specified in the standard after less than one third of the cycles required by the same standard.\nThe Clippasafe-Carramio baby carrier (pr190547c) is not compliant with the applicable standard (EN 13209-2:2015) due to a failure in the durability test as stipulated by the standard. The baby carrier broke when tested with the load after less than one half of the cycles required by the same standard.Consumers who had bought these products should refrain from using them and return them to the retailer they bought them from. For further information e-mail marketsurveillance@mccaa.org.mt", "comment_count": 0, "id": 508}, {"keywords": "", "author": "Edwina Brincat      ", "article_body": "A man police believe to be a drug trafficking and counterfeit cash kingpin will remain in custody after pleading not guilty to charges against him on Friday. \nJordan Azzopardi, 29, from Madliena, who stated that he worked in the waste sector, pleaded not guilty to a multitude of charges ranging from trafficking and aggravated possession of cocaine, heroin and cannabis to criminal conspiracy and circulation of fake cash.\nHe was also charged with defrauding three shops in San Ġwann and Sliema, having an unlicensed weapon, making threats and hurting a third party and also breach of bail.\nMr Azzopardi was arrested during police raids in Madliena and St Paul’s Bay over the past two days. He did not request bail.\nTwo other suspects, allegedly involved in the circulation of false bank notes, were also arrested in the raids and were arraigned separately at staggered intervals in the course of Friday afternoon.\nThe first to be arraigned was a 30-year old mother. The court agreed to ban publication of her name, to safeguard the interests of her five children.\nThe woman pleaded not guilty to being involved in a criminal conspiracy, fraudulently  circulating fake cash and defrauding three stores in San Ġwann and Sliema. She was also charged with cannabis possession.\nAnswering solely that she was “self-employed,” the woman chose not to reply when asked to supply her address as part of the routine questions by the court’s deputy registrar.\nNo request for bail was made by the woman’s defence lawyer. \nLater in the afternoon, the third suspect member in the fake cash racket was arraigned.\nMario Abdilla, a 66-year old from Valletta but currently without a fixed address or job, pleaded guilty to his involvement in the conspiracy.\nProsecuting inspectors Mark Mercieca and Shaun Friggieri told the court that Mr Abdilla would visit shops, allegedly on the instructions of his co-conspirators, to buy a low-value item using a high-value fake bank note.\nHe had reportedly been promised some €10 for each transaction, the court was told. However, he ended up empty-handed, with his co-conspirators allegedly pocketing the money he was owed.\nAssisted by legal aid lawyer Christopher Chircop, Mr Abdilla admitted to his wrongdoing and was handed a three-year effective jail term after the court took note of his early guilty plea,  his collaboration and his conviction sheet.\nThe court finally recommended that the man be afforded help by the Prison Director so as to overcome his drug problem.\nLawyers Alfred Abela and Arthur Azzopardi were counsel to Mr Azzopardi and the mother.\nInspectors Mark Mercieca, Justine Grech and Shaun Friggieri prosecuted.", "comment_count": 1, "id": 509}, {"keywords": "", "author": "", "article_body": "Malta would agree to the UK’s request for a Brexit extension, providing the request was justified and would help lead to an orderly exit, Prime Minister Joseph Muscat said on Friday. “The ball is in the UK’s court after its Parliament voted against the present deal with the EU. It also voted against leaving the EU without a deal. So the current situation means the UK needs to either accept the deal, or not exit the EU at all”, the Prime Minister said in a statement.He said the European Union would not change its position because it would not compromise over the principles it was built upon: “It is not a case of stubbornness by the EU, but a case of being realistic.”Dr Muscat explained that there were a number of challenges for the UK if given an extension.\n“Primarily, the EU treaties are clear: the UK will be expected to organise the European Parliament elections in May, even though these will not have any relevance in the long-term. It is also clear that the UK cannot have a veto on an EU budget that it will not be part of.”\nEU leaders on Friday called for clarity from Britain before considering any delay to Brexit after a series of chaotic votes by MPs just two weeks before the deeply divided country is due to leave the bloc.\nQuitting the EU after 46 years on March 29 remains the legal default unless EU leaders unanimously grant Britain an extension, with the issue likely to dominate a March 21-22 EU summit in Brussels.\nThe length of any possible delay will depend on the outcome of another parliamentary vote on the twice massively rejected Brexit deal struck by Ms May with EU leaders.\nThe government said it would ask for a \"technical\" delay until June 30 to pass necessary legislation if MPs finally approve the deal next week.\nIf MPs vote against it for a third time, the government has warned it will be forced to seek a much longer delay.\n\"It is very clear that the next steps, the next proposal on how to move forward must come from Britain,\" German Chancellor Angela Merkel's spokesman Steffen Seibert said in Berlin on Friday.\nFrench President Emmanuel Macron's office said that if the current deal is rejected again \"a clear and new alternative plan\" must be presented or else Britain would have to leave the EU with no agreement.\nThe British government is hoping that talk of a long delay to Brexit will persuade hardliners in May's own Conservative Party and its ally, the Democratic Unionist Party (DUP), to get behind her deal.", "comment_count": 41, "id": 510}, {"keywords": "", "author": "", "article_body": "The prevailing atmosphere of secrecy, hidden contracts, mysterious conditions of employment for persons occupying various positions of trust were all fomenting a belief that merit is no longer a necessary precondition of success, Malta Employers’ Association president Dolores Sammut Bonnici warned.\n“The fact that even the Commissioner for Data Protection’s warnings and decisions have been repeatedly ignored speaks volumes and sends dangerous messages that strike at the heart of governance and business ethics. These issues can only be ignored at the risk of losing what the country has managed to build over so many years,” she told the MEA’s annual general meeting.\nShe warned that governance issues were adversely affecting Malta’s international reputation and that this was not going to be changed by arguments as to whether this was a perception or reality, or whether certain incidents were being given more international coverage than they deserve.\n“The harsh truth is that Malta is suffering severe reputational damage, and we are in the international limelight for reasons not to our liking,” she continued, saying that quite apart from the international reaction, it was also affecting the nature of human and business relationships in Malta and Gozo.\n“There is an emerging feeling of mistrust, a misguided belief that successful business is the result of shady dealings, speculation and ruthless competition,” she warned.\nThe harsh truth is that Malta is suffering severe reputational damage\n“Honest business is not an oxymoron. Many businesses in Malta are family owned and have been providing decent employment for entire generations, through hard work, personal sacrifice, and risk taking. Terms such as short-termism and one-off transactional profits do not feature in their business plans.\n“Yet we observe too many instant rags to riches stories around us today, which is placing the entire business community in a bad light. Employees are likewise perplexed when information is leaked about remuneration packages of persons of trust and government consultants, who are in some cases unqualified to what they are supposed to do, and with no accountability to their actions,” she said.", "comment_count": 18, "id": 511}, {"keywords": "", "author": "", "article_body": "The Great Siege of Malta was among the historic battles scribbled on the rifle of a gunman who brutally massacred dozens of people at a mosque in New Zealand on Friday.\n'Malta 1565' was inscribed on the foregrip of the AR-style rifle used by a 28-year-old Australian called Brenton Tarrant who live-streamed the attack from a head-mounted camera. \nThe siege, the climax of an escalating contest between a Christian alliance and the Islamic Ottoman Empire for control of the Mediterranean, was among the crusades references and anti-Muslim rhetoric written on the rifle. \nThe Great Siege is often invoked by right-winger and anti-migrant factions in Malta to hit out at migration flows. \nAnother still image shows the inscription ‘Malta 1571’ in reference to the Battle of Lepanto.\nIn photographs from a now deleted Twitter account associated with the suspect that match the weaponry seen in his live-streamed video, there is also a reference to 'Vienna 1683', the year the Ottoman Empire suffered a defeat in its siege of the city at the Battle of Kahlenberg.\nThe suspected terrorist Brenton Tarrant.\nRead: Mosque gunman published manifesto, live-streamed shooting\nAlongside the slogan “Here’s your migration compact” — an allusion to a United Nations deal signed last year that has been opposed by the US, Poland, Austria and Hungary — it names at least four of the turning points in wars between Christianity and Islam, according to the Times of London.\nOther phrases point to a familiarity with contemporary white supremacist propaganda.\nA total of 49 people were killed - 41 were killed at Masjid Al Noor Mosque, seven at Linwood Masjid Mosque and one died at hospital, another 48 are in hospital with gunshot wounds and 20 are in critical condition.\nIt is the biggest terrorist attack in New Zealand.\n ", "comment_count": 25, "id": 512}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Interracial tensions in Paceville are a serious cause for concern, a lawyer warned the court on Friday, saying that provocation was on the rise.\nLawyer Joe Giglio was making submissions to the court on behalf of his client, the flatmate of one of two men accused of breaking an Albanian man's arm in Paceville last Sunday.\n“Unfortunately, I am informed that the facts which could have led to this arraignment are the result of realities in our country today. Tensions between Serbs and Albanians which existed abroad have now spilled over into Paceville where a group of Albanians were provoking Serbs,” he explained, pointing out that the already overloaded officers on duty at the St Julian’s police station were having to contend with this additional problem.\nDr Giglio argued that although the alleged violent episode had taken place on Sunday, the police only arrested the two suspects on Wednesday evening.\n“No urgency was felt on the 11 and 12 March,” Dr Giglio continued, “so why keep this man under arrest now?”\nThe lawyer also noted that the prosecution had apparently waited for the officers who had taken the victim’s report on Sunday to return to duty on Wednesday before proceeding with the arrest.\nThe men were arraigned on Friday, after the report by the victimled to the discovery of an alleged drug-trafficking ring.\nAlexsander Petrovski, 42, a Macedonian plasterer living Msida, was the first to be arraigned, pleading not guilty to his alleged involvement in the conspiracy to traffic cannabis and cocaine.\nHe was further charged with the aggravated possession and trafficking of cannabis, cannabis resin, cocaine and ecstasy, which offences were allegedly committed within 100 metres of a place frequently visited by youngsters.\nProsecuting Inspector Joseph Xerri informed the court that police had searched an Msida flat on Thursday upon suspicion of drug-trafficking activity.\nInside the room occupied by the accused, the search party had discovered the various drugs. Other illicit substances were also found upon the accused who returned to the flat to find the police there. He reportedly confirmed that the drugs were his, the court was told.\nThe man pleaded not guilty to the charges. The court, presided over by magistrate Charmaine Galea, froze all the assets of the accused, save a yearly allowance of some €13,000 as allowed by the law.\nShortly after, two other Serbian men, one of them the flatmate of the Macedonian, were escorted into the courtroom facing joint charges in relation to the incident concerning the Albanian man. One of them also faced drug-related charges.\nNenad Anic, 39, a cleaner residing in Mellieħa, and Nemanja Vucicevic, 31, a security guard residing in Msida, both pleaded not guilty to grievous bodily harm. They were charged with assaulting their victim, breaching the peace and worked as private wardens without the necessary licence.\nMr Anic was separately charged with possessing a knuckleduster, which is a prohibited weapon.\nMr Vucicevic was separately charged with trafficking cannabis and cocaine at a Paceville club, as well as with his involvement in the conspiracy to traffic and the aggravated possession of the drugs, within 100 metres of a place frequently visited by youths.\nBoth men pleaded not guilty.\nLegal aid counsel to Mr Vucicevic, Christopher Chircop, also requested bail, arguing that his client had cooperated with the police and had not tried to escape from Malta “for four whole days.”\nAfter hearing submissions by both defence lawyers and prosecuting Inspector Joseph Xerri, the court turned down the request for bail in respect of Mr Vucicevic in view of the gravity of the charges.\nThe other co-accused was, however, granted bail against a deposit of €500, a personal guarantee of €5,000 and an order to sign the bail book twice weekly. He was also warned not to approach the victim or other prosecution witnesses.\nThe court also issued a Protection Order in favour of the Albanian victim.", "comment_count": 0, "id": 513}, {"keywords": "", "author": "Denise Grech ", "article_body": "AirBnB owners and people providing accommodation to tourists were not going through the proper channels and were gaining an unfair advantage, Malta Hotels and Restaurants Association president Tony Zahra warned.\n“We’re not talking about a level playing field; we’re talking about people who are not paying their taxes and who are not paying their MTA fees,” he said.\nHe also warned Malta might see its tourist numbers decrease because other countries like Egypt and Tunisia had resolved safety concerns.\nMr Zahra also warned bed overcapacity would bring with it “some tough competition where there will possibly be no winners and only the strongest will survive”.\n“I would strongly advise those planning accommodation projects to seek professional advice before they start spending money on plans or even worse on the project itself,” he said.\nGrowth in non-collective accommodation, such as AirBnB, is outpacing that of hotels, a survey by Deloitte warned on Friday.\nThe problem of overcapacity was only getting worse over time, Mr Zahra warned. Development was growing but non-collective accommodation was “the elephant in the room”, he said.\nThe number of people seeking accommodation in hotels was still on the rise, but at a conservative level, the Deloitte survey found.\nAnd while tourist numbers were on the rise, tourist expenditure remained flat in 2018, the survey found.\nNon-collective accommodation such as AirBnB might start eating into hotels' profitability, Raphael Aloisio warned.\nHotel accommodation, however, was also in short supply, he added.\nCommenting on the figures, Mr Zahra warned that hotel accommodation figures would no longer be positive in the future.\n\n\"We are operating at a level which is extremely competitive, and we have to react at the correct time,@ he said.\nHe also said the association was planning a short-term and long-term plan to address the threat of AirBnB and other non-collective accommodation.\n\"We have to make sure we are offering value for money, but we also have to make sure we continue working hard to remain successful,\" he said.", "comment_count": 43, "id": 514}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An Iranian national in Malta on a student visa has been handed a 4-year effective jail term after admitting to a series of frauds and thefts involving mainly iPhones and mobiles.\nMohammed Kaveh Tahmasebi Ghareh Shiran, 24, was arraigned on Friday after police investigations zoomed in upon him as the suspect behind six cases of fraud, the theft of two iPhones, the theft of a cheque book as well as another theft of an elderly lady’s handbag containing cash and a mobile phone.\n“I’m a student here. I did something wrong. I don’t want to lie,” said the soft-spoken man, hands clasped before him, head bent low, when pleading guilty to the series of offences which involved some €32,000 worth of items.\nInspectors Shawn Pawney and Wayne Camilleri explained how the first report about the theft of the two iPhones, worth €3,000, from an electronics chain store at Pietà, had kicked off investigations which soon put police on the tracks of the suspect.\nStaff at the store had informed the police that a cheque book had been used several times throughout February and March to purchase iPhones and netbooks. \nInvestigators eventually traced the lawful owner from whom the cheque book had been stolen on February 26. The man, a Maltese, had been unaware of the fact that his cheque book was being used.\nHowever, investigators ultimately zoomed in on the suspect after the latter was identified by a third party who spotted him running off with a handbag he had robbed from a 76-year old pedestrian at Ħamrun on Wednesday afternoon.\nFurther investigations linked the man to the various instances of fraud.\nUpon his arraignment, the young man pleaded guilty, confirming his admission after being given due time by the court to reconsider his plea and after being warned of the possible punishment which could vary between 3 to 9 years.\nThe court, presided over by magistrate Charmaine Galea, handed down a 4-year effective jail term after considering his early guilty plea and the fact that he had collaborated with the police.\nDefence lawyer Christopher Chircop, assisting as legal aid, gave notice of appeal.", "comment_count": 0, "id": 515}, {"keywords": "", "author": "Jacob Borg", "article_body": "Bank of Valletta announced on Friday that it would not be paying out a cash dividend this year and was setting aside €75 million as a litigation provision.\nSpeaking during a press conference, BOV chairman Deo Scerri said the bank’s profit without the litigation provision was €146.2 million, an increase of 5.8 per cent when compared to the previous year.\nBOV was last year slapped with a €363 million precautionary warrant by an Italian court. The claim was filed by liquidators of the Deiulemar group and representatives of 13,000 Italian bondholders who lost all their life savings in a fraud scheme dating back to 2009.\nMr Scerri said BOV’s board intended to resume dividend payments in line with the dividend policy as soon as it was prudent.\nHe said the board had instead resolved to issue bonus shares at a ratio of one for every 10 ordinary shares held in the bank.\nMr Scerri said 2018 was a challenging year for the bank, both in terms of the legal challenges necessitating the litigation provision, as well as an increase in competition, including from non-banks.\nThe bank saw an eight per cent increase in costs, mainly attributed to an increase in human resources, with a particularly focus on compliance and anti-money laundering functions.\nMr Scerri acknowledged that the increase in due diligence checks had impacted the customer experience when opening a new bank account.\nHe vowed that the bank would continue investing in improving the efficiency and accessibility of these bank account opening processes.\n\n‘Attacks still ongoing’ \nThe BOV chairman said the bank was still under assault from hackers, one month after €13 million was stolen through a cyberattack.\nMr Scerri said the attack could have happened to anyone.\nExplaining how the attack happened, Mr Scerri said a bank employee opened up a phishing e-mail that made its way through BOV’s filters.\nThe bank’s chairman said the employee failed to report that his computer screen went blank after opening it up.\nBOV has recovered €5.6 million so far and is in the process of recovering a further €4.4 million. Mr Scerri said BOV would take all the necessary action to recover the remaining funds, although he expressed doubts as to whether this would be possible. \nHe declined to elaborate on the timelines between the employee opening the e-mail and the money leaving the bank.\n“Action was taken within hours of the money leaving the bank. It could have been much worse. There was some inconvenience to clients, but within 24 hours the bank was up and running again,” he said.", "comment_count": 44, "id": 516}, {"keywords": "", "author": "", "article_body": "The police have caught the mastermind behind a cocaine and heroin trafficking ring following raids in Madliena and St Paul’s Bay in the past 48 hours.\nDuring the raids, they arrested a 30-year-old woman from Cospicua and two men, a 66-year-old without a fixed address and a 29-year-old man from Qawra.\nThe police found cannabis and cocaine, electronic scales and other items used in the trafficking of dangerous drugs during the raids, as well as fake euro notes and a 0.25 caliber, unlicenced weapon. \nAn inquiry is being held.\nThe 29-year-old is believed to be a heroin and cocaine trafficking kingpin in Madliena and St Paul's Bay. \nPolice said that that its Special Intervention Unit and other sections of the force had carried out raids in Birkirkara, Gżira, Marsa and Pietà and arrested several people in connection with the case in the past months.  More are to be arrested in future, they added. \nThe 66-year-old and the woman are to be charged on Friday with circulating fake cash and associating themselves with third persons for this aim.\nThe 29-year-old is to be charged with trafficking and possession of cocaine, heroin, and cannabis, grievously injuring third persons, and being in possession of a firearm without a police licence. He will also be charged with association with third persons to circulate fake case and relapsing.", "comment_count": 5, "id": 517}, {"keywords": "", "author": "", "article_body": "A fraudster tricking people into thinking they are collecting money to help Malta’s disabled community is believed to have pocketed hundreds of euros in donations.\nThe Commission for the Rights of Persons with a Disability said that at least one person was going round several different towns and villages asking for money, ostensibly on behalf of persons with a disability. A photo shows hundreds in donations.\nPeople are being asked to donate to help the ‘national association for children with a disability and deaf-mute’ raise money. No such organisation exists.\nA photo of a clipboard with supposed donations collected features donors who have given anything from €200 to €20 to this supposed cause.\nThe photo also features a disabled person icon and a reversed version of the Maltese flag, with a George Cross in the bottom right corner. \nIn a Facebook post, the CRPD warned people to keep their wits about them.  The Commission for the Rights of Persons with a Disability (CRPD) would like to clarify that it does not collect funds and does not authorise anyone to collect money on its behalf,” the organisation said.", "comment_count": 3, "id": 518}]