[{"keywords": "", "author": "", "article_body": "An urgent call for blood donation has been issued by the National Transfusion Service.\nThe Service said in an email that reserve was low and urged people to donate blood, possible today (Sunday).\nIt said that on Sunday a number of people with chronic illnesses, including cancer, went to hospital for blood infusions to be ready for another cycle of chemotherapy in the coming days.\nMoreover, an intensive week of scheduled operations starts on Monday.\nThe Blood Donation Centre, located just outside St Luke’s Hospital in Gwardamanġa, is open daily from 8am to 6pm, weekends included.\nThose from the Paola area can donate blood at the Mobile Blood Donation Unit in Antoine de Paule Square up to 1pm\nDonors should take with them their ID card, driving licence or Maltese passport.", "comment_count": 3, "id": 319}, {"keywords": "", "author": "", "article_body": "Dazzling fireworks display\nFireworks lit up the Valletta skies late on Tuesday during the International Fireworks Festival. The festival came to a close last night at the Floriana Granaries.\nWhat made the headlines\nKonrad Mizzi and Keith Schembri\nEvidence of crime could exist in Panama Papers – court: A court upheld a request by former Opposition leader Simon Busuttil for evidence in the Panama Papers scandal to be preserved, in the process acknowledging that a crime could have taken place. In a decree by Magistrate Doreen Clarke, the court said the documents presented by Dr Busuttil and NGO Repubblika gave credence to the request for an inquiry to preserve evidence. The magistrate said a series of facts were presented that could indicate a crime took place. This decree came over three years since the Panama Papers scandal first broke in Malta. The court said the list of potential crimes presented to it were not fully covered by another inquiry being led by Magistrate Charmaine Galea. For this purpose, the court ordered that the evidence presented to it form part of the inquiry being led by Dr Galea. The inquiry by Dr Galea is looking into the ownership of the Dubai company17 Black. Evidence implicating Tourism Minister Konrad Mizzi, the Prime Minister’s chief of staff Keith Schembri, Nexia BT’s Brian Tonna and Karl Cini as well as LNG tanker agent Mario Pullicino, will now form part of this inquiry. A joint investigation by the Times of Malta and Reuters last year revealed that 17 Black is owned by Tumas Group CEO Yorgen Fenech, who forms part of the Electrogas power station consortium. A previous request for a broad inquiry into the Panama Papers filed in 2017 was turned down on appeal in January. In a tweet, Dr Busuttil said the decision was “one small step for justice but one giant leap for Malta”.\nAG to handle prosecutions in Magistrates’ Court, not police: Prosecutions in the Magistrates’ Court will no longer be led by the police but by the Attorney General’s Office, Justice Minister Owen Bonnici told a press conference. This radical change is part of a Bill that seeks to address a series of shortcomings in Malta’s judicial setup, which were flagged last year by a group of Council of Europe experts known as the Venice Commission. Dr Bonnici said the reform would lead to the setting up of the Office of State Advocate, who would take over the Attorney General’s function as the government’s chief legal adviser.\nFuel used in Floriana arch arson: Investigators concluded that fuel was used to burn down Floriana’s historic arch last week, in a case that was ‘definitely arson’, sources said. The 120-year-old wooden arch, which dated back to 1899, was brought out to celebrate the feast of St Publius this weekend. It was destroyed in a fire that raged for 90 minutes and also extensively damaged four cars parked nearby.\nSome ODZ sites may be suitable for fuel station relocation: Some outside development zone (ODZ) sites that do not host agriculture or animal husbandry could be considered for the relocation of fuel stations, according to a proposed policy launched for public consultation. The new policy will guide the future evaluation of applications related only to the relocation of existing fuel stations.\nMaltapost asks for 10c rise in tariffs: Maltapost is asking for a 10-cent tariff increase for single-piece mail items over a three-year period on grounds it has been delivering the service at a loss for a number of years. In the case of single-piece mail items weighing under 50 grams, Maltapost is proposing to increase the existing tariff of 26c per item by 4c this year, 3c next year and 3c in 2021. Increases are also being proposed for other mail items.\n‘Whistleblowers still face challenges’: Whistleblowers continue to face significant challenges when coming forward with information, a report by the Council of Europe concluded. It mentioned how in January 2018, Cyprus issued a European arrest warrant against Maria Efimova, a former employee of a Cypriot bank who had provided information to Daphne Caruana Galizia, the late Maltese journalist who was killed in a car bomb attack in 2017. “Ms Efimova left Malta in August 2017, reportedly fearing for her life after giving evidence on allegations involving supposed business dealings of the Maltese Prime Minister’s wife. Ms Efimova has applied for asylum in Greece, where courts have so far denied Malta’s extradition requests,” the report said.\nPhysiotherapy department ‘in shambles’: Physiotherapists working at the old hospital are struggling to treat patients as a result of sub-standard facilities, forcing their union to threaten “serious action”, the Times of Malta reported. Situated at St Luke’s Hospital and run by Steward Health Care, the US company that took over the 30-year government concession to manage three hospitals, the physiotherapy department is the only one of its kind on the island.\nWhat trended\nThe artful dodger\nPrime Minister Joseph Muscat’s refusal to say if he had ever asked his top aide and close friend Keith Schembri what his plans were for the Dubai-based company 17 Black not surprisingly led to quite an uproar online.\nDr Muscat was questioned by the media after a court on Monday ordered evidence from the Panama Papers scandal to be preserved, saying that a crime may have been committed by Mr Schembri and Tourism Minister Konrad Mizzi.\n“Isn’t it funny that whenever a serious question comes up, the Prime Minister seems in a hurry to leave? Artful dodger indeed,” Dylan said.\n“So basically we can do whatever we want, no questions asked, until an inquiry is scheduled,” Aron said.\nEvarist concurred: “According to the Prime Minister’s reasoning we should not be curious and ask questions, not even when an inquiry is scheduled. We should just wait....and wait.....and wait.”\nTo which Michel responded: “Indeed so they can fill their pockets!”\nDenis commented that this was yet another example of Joseph Muscat’s mastery “in the art of slippery and evasive politics” where he never gives a straight answer and which has earned him the title of ‘The artful dodger of Europe’.\nA perhaps summed up the thoughts of many: “I don’t believe him. He never asked Keith, his right-hand man?”\n“It probably slipped his mind,” Iain said, tongue in cheek.\n‘Only in Malta’\nThere was plenty of online sympathy for restaurateur Claude Camilleri who decided to pack up his business and consider leaving Malta after years of having to put up with parked caravans outside his terraced restaurant in Mistra.\n“Join the queue Claude and it is a long queue of both locals and foreign that are packing up and leaving this jungle!” Joe said.\n“Reading this article was simply heartbreaking. So you have a legitimate businessman, trying to make money in an honest way, only to be discouraged and deterred by a bunch of hamalli that this country simply does not need,” remarked J.\nAccording to Charles under this government everyone is free to do as they want as law and order doesn’t exist in our country “which is being run by crooks”.\n“Enforcement is nowhere. This attitude is not going to make us the best in Europe Mr Prime Minister,” V said.\nBJ said he wasn’t surprised by what he read. “The selfish few ruining the livelihood of hard working people for their own gain and contributing nothing to the local economy. The well-used ‘only in Malta’ phrase comes to mind.”\nWhat they said\n\n“If possible, I would not want the Maltese to be picking up rubbish from the streets. Every job should be dignified but I do not want a situation where the foreigner is comfortable and the Maltese breaking their backs.”\nPrime Minister Joseph Muscat speaking during a debate on TVM weekly show Extra with PN leader Adrian Delia.\n“The European way of life is what we Europeans have in common, what defines us. It is our common values of democracy, freedom, freedom of the press, and the respect of the rule of law. We are seeing with concern the developments in Malta. This is damaging the image of the country European-wide.”\nEuropean People’s Party leader Manfred Weber speaking at the Nationalist Party’s General Council.\n“I am not willing to discuss or compromise on this point.”\nAlternattiva Demokratika chairman Carmel Cacopardo insisting that spring hunting was by definition unsustainable, during a debate organised by Birdlife for MEP candidates.\n\n “I try to defend my country as much as I can but there are some questions that are impossible to answer.”\nFormer Prime Minister Lawrence Gonzi speaking on Times Talk about how, when he travels abroad, he is questioned about Malta’s international reputation since the Panama Papers scandal.\n“Malta can show how big a small country can be when it comes to fundamental values.”\nEuropean Commission First Vice-President Frans Timmermans, the European Socialists’ candidate for the post of European Commission president, addressing a Labour Party May Day mass meeting in Valletta.", "comment_count": 1, "id": 320}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The 31-year-old taxi driver who lost his life in a head-on collision in Burmarrad early Saturday was driving well over the speed limit and was not wearing his seatbelt, a preliminary investigation has revealed.\nA source close to the investigation told The Sunday Times of Malta that Safi resident Christen Cachia was driving his white Peugeot 207 at well over 100 kilometres per hour when it slammed into an oncoming Peugeot Partner, also a taxi, being driven by a 59-year-old from Żejtun.\nThe crash took place on Burmarrad Road at 12.15am. Four young Scottish tourists aged 18 to 24, who were inside the taxi van heading towards Mosta, sustained slight injuries.\nHowever, the van driver was not wearing his seat belt either and was seriously injured, the source said. Mr Cachia was travelling towards Buġibba while the taxi van was taking the Scots from Café Del Mar in Buġibba to Numero Uno in Ta’ Qali, where the popular Lost and Found party was being held. According to eyewitnesses who spoke to the police, the collision sent the smaller vehicle flying into the air.\nMr Cachia was flung out of the car with the force of the impact. The car then hit a wall at the side of the road and came to rest in a service ditch facing the opposite direction.\nParamedics worked frantically to save his life. He was given CPR for over an hour before being pronounced dead at Mater Dei Hospital.\nMr Cachia, a former Armed Forces of Malta soldier, leaves behind a young daughter.\nThe preliminary investigation shows that his taxi was within the speed limit when it passed the speed camera but then accelerated rapidly. The wet conditions may have contributed to the accident.\nAs the news of his death reached his hometown, tributes poured in online for the victim who was the ex-licensee of the locality’s fireworks factory. He was also heavily involved in the village feast and was a much-loved member of the Safi community.", "comment_count": 0, "id": 321}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Sunday’s front pages.\nThe Sunday Times of Malta says Marco Gaffarena, the protagonist of a 2016 property scandal which led to the sacking of a parliamentary secretary, is developing a block of apartments on a site he had been ordered by a court to return to the government. In another story, the newspaper says Prime Minister Joseph Muscat and his family racked up the air miles in 2018 but their travels appear to have had little effect on their bank balance, with Dr Muscat declaring the same amount for the fifth year in a row. The newspaper also says a preliminary investigation shows that the 31-year-old taxi driver who lost his life in a head-on collision in Burmarrad early on Saturday was driving well over the speed limit and was not wearing his seatbelt.\nThe Malta Independent on Sunday quotes Ahmed Bugre, the director of the Foundation for Shelter and Support to Migrants, saying that there has been no news whatsoever regarding the case of Lassana Cisse, who was killed in a drive-by shooting in Ħal Far on April 6.\nMalta Today leads with a survey showing Labour 15 points ahead in the forthcoming European elections, a vote margin of over 45,000.\nIllum leads with a story on the results the political parties are aiming for in the European elections.\nKullħadd says the Nationalist Party’s strategy is to keep leader Adrian Delia from meeting journalists as much as possible.\nIt-Torċa forecasts a 16% difference between parties in the European elections.\nIl-Mument says foreigners paid by Maltese taxes are campaigning for Konrad Mizzi to become leader of the Labour Party.", "comment_count": 0, "id": 322}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Marco Gaffarena, the protagonist of a 2016 property scandal which led to the sacking of a parliamentary secretary, is developing a block of apartments on a site he had been ordered by a court to return to the government.\nThe site in question is a shop situated at 73, Manuel Dimech Street, Sliema. It was one of several government properties found to have been illegally bartered in a deal with Mr Gaffarena. In return for the properties he gave the government half a palazzo in Valletta’s Old Mint Street.\nThe deal was subsequently struck down by the court, which ordered that Mr Gaffarena return all government property that he had acquired under the arrangement.\nHowever, an investigation carried out by The Sunday Times of Malta over the past few weeks has established that the shop which had to be returned to the government now forms part of a mega development being carried out by Mr Gaffarena to turn it and an old townhouse into a block of luxury apartments.\nAccording to plans approved by the Planning Authority and seen by the newspaper, there will be at least two bedrooms in the place of where the shop now stands. Works were underway on the site when the newspaper paid a visit some days ago.\nIn January 2016, an inquiry by the National Audit Office had slammed the government over its negotiations with Mr Gaffarena, describing it as a textbook case of lack of good governance and transparency.\nDeclaring the deal to be irregular, the NAO had recommended that the government take steps to take back possession of the public property traded under the deal.\nIt’s a court decision which all media reported\nIn order to counter the political flack over the scandal, Prime Minister Joseph Muscat had sacked then parliamentary secretary Michael Falzon (today a Cabinet minister) and opened a court case against Mr Gaffarena and the Lands Department to take the government property back.\nIn March 2018, the court decided in favour of the Prime Minister, ordering the nullification of the deal with Mr Gaffarena and the return of all the property to the government including the Sliema shop.\nIn a statement, the Office of the Prime Minister had described the court decision as a win for the Prime Minster in “safeguarding public property”.\nAsked a few weeks ago whether the government has indeed taken back all the public property from Mr Gaffarena, a spokesman for the Prime Minster said this was the case.\n“The Prime Minster took political and legal action over the said case to safeguard people’s interests. He won the case in court on behalf of the people, which ruled that the lands obtained as part of the expropriation deal should be returned to the government”.\nPressed on whether the OPM was sure that the properties in question have indeed been returned to the government, the spokesman said that “it’s a court decision which all media reported”.\nThe Lands Authority has told The Sunday Times of Malta that although Mr Gaffarena filed an appeal against the court decision, “there is a warrant of prohibitory injunction in place safeguarding any transfers of property involved in this case”.\nAt first, the authority conveyed the impression that the development does not involve the government-owned shop but only the adjacent private property (Nr 74) acquired by Mr Gaffarena in 2013.\nHowever, when The Sunday Times of Malta pointed out that the shop was part and parcel of the plans approved by the Planning Authority, and that works were actually being carried out there, a spokesman said the authority was not aware of this.\n“Any works on 73, Manuel Dimech Street, do not have the blessing of the Lands Authority,” the spokesman said.\n“Although the application was made on property 74 and notwithstanding that the LA was never a consultee (nor informed or had any reports) of works on Number 73 (the shop), the LA will take all available legal steps to continue safeguarding its property.”\nSo far, The Sunday Times of Malta is not aware of any legal steps that may have been taken by the authority or the government to stop the private development of public property, as works by Mr Gaffarena on his apartment block continue unabated.\nGaffarena scandal timeline\nMay 2013: Labour returns to power. Marco Gaffarena signs deal to acquire an old townhouse at 74, Manuel Dimech Street, Sliema.\nApril 2015: Following negotiations with the government, the Lands Department grants Mr Gafferena title over 73, Manuel Dimech Street, an adjacent shop. This makes his development possible.\nMay 2015: Mr Gaffarena applies for a development permit from the Planning Authority to turn the two properties into a block of apartments.\nJanuary 2016: NAO investigation finds irregularities by the government and Mr Gaffarena over the Old Mint Street property transfer and states that all government property handed over to Mr Gaffarena, including the Manuel Dimech shop (Nr 73) have to be returned to the public. Prime Minister sacks parliamentary secretary Michael Falzon.\nJanuary 2016: Dr Muscat files a court case against Mr Gaffarena and the Lands Department to revoke all the property deals done under his watch.\nApril 2017: The Planning Authority grants permission to Mr Gaffarena to develop his property in Sliema including the shop which was supposed to be returned to the government. The Lands Authority does not intervene.\nMarch 27, 2018: The court decides against Mr Gaffarena and the Lands Authority, revokes all property deals with Mr Gaffarena and orders the return of all public assets to the government including the Sliema shop. The government issues a statement welcoming the court decision and praising the Prime Minister’s action to “safeguard public property”.\nApril 10, 2018: Mr Gaffarena files an appeal against the court decision.\nApril 16, 2018: He gives notice to Planning Authority that development work is to start on his Manuel Dimech property including the shop, which was supposed to have been returned to the government.\nLast week: Works carry on: the shop is being turned into a bedroom for one of Mr Gaffarena’s new apartments.\n ", "comment_count": 96, "id": 323}, {"keywords": "Environment", "author": "Gabriel Pullicino", "article_body": "Fish is a popular food in Malta. It is an important part of our diet and culture. Fresh and frozen fish is sold in markets, fish shops and supermarkets. But how sustainable are our practices?\n\nFish quotas regulate fishing of certain species of fish. These catch limits are expressed in tons or numbers. When the catch limits for a fish are reached, the season closes, prohibiting further fishing for that type of fish.\nThe NGO Fish4tomorrow was formed in 2010. It aims to raise local awareness on the importance of seafood from sustainable sources. When interviewed about sustainability of local fishing practices, Fish4tomorrow spokesman J D Farrugia said that whereas in previous years there used to be an abundance of fish, nowadays the Maltese waters are void. Fish such as grouper, white sea bream, red snapper, red scorpionfish, dentex and the common pandora have practically vanished from the fish market. If one finds them, they sell at high prices and may be imported.\nFarrugia explained that small-scale artisanal fishers using lines with hooks (konzijiet) have little impact on the fish populations they catch and the surrounding environment. However, large fishing operations such as bottom trawling have negative effects on fish stocks, the environment and also other species that they are not targeting, such as sharks, dolphins and turtles. They catch fish in such high quantities that practically no fish are left to breed in the area, thus the shoal cannot regenerate.\nTuna is being ranched locally. Young tuna individuals entering the Mediterranean Sea are caught before they spawn, taken to tuna pens, fattened, grown and exported. The tuna do not reproduce in captivity, thus it is killed before it reproduces.\nMoreover tons of mackerel are used to feed tuna (25 kilograms of mackerel is needed to produce one kilogram of tuna). All these factors make tuna unsustainable.\nAnother detrimental factor is the large amounts of traps and nets abandoned at sea. Fish get trapped and they attract predators, which in turn get caught. This is referred to as ghost fishing.\nWhen asked about the level of awareness of Maltese fishermen, Farrugia said that many traditional fishers were aware of the importance of fishing in ways which do not harm the environment. The government ran a campaign on sustainable fishing a few years ago. But in another interview, a full-time and a part-time fisherman both said that while they were advised on issues such as health and safety and diversification, they were not trained in sustainable fishing techniques. They claimed that the officials themselves did not know the way forward and there is not a team of officials and that officials change frequently.\nWhereas in previous years there used to be an abundance of fish, nowadays the Maltese waters are void\nThe full-time fisherman said the trade is no longer viable and if the government were to introduce the decommissioning scheme, most fishermen would go for it. He explained that if a fish is not easily available, he cannot diversify because there are restrictions.\nAs regards consumers, Farrugia said that there is a need for more awareness. The NGO has created tools such as the Quickfish Guide to help consumers make responsible choices that ensure the viability of local fish stocks for future generations. Fish4tomorrow also organises awareness-raising events such as pop-up dinners called From Our Sea. Here, people book places to the event and a chef prepares a tasty menu of local, seasonal and sustainable seafood. In this way, consumers can see that sustainable seafood such as bogue (vopi) or Atlantic mackerel (kavall) are actually very tasty as well as caught in an environmentally-responsible manner.\nA frozen fish product with the MSC label.\nThe Marine Stewardship Council (MSC) is an international non-profit organisation. Its goal is to end overfishing and to ensure that this and future generations can continue to enjoy wild seafood. It urges people to choose certified sustainable seafood with the blue fish label. The ecolabel is only applied to wild fish or seafood from fisheries that have been certified by the MSC as sustainable. Sustainable fishing means leaving enough fish in the ocean, respecting habitats and ensuring people who depend on fishing can maintain their livelihoods.\nA survey was carried out to assess the level of awareness of Maltese consumers about the MSC label. Data was collected from 30 consumers. The results were as follows:\n• 87 per cent of the consumers interviewed recognised that the label was related to fish.\n• Only 13 per cent of the consumers knew that this label is related to sustainable fishing.\n• 30 per cent of the consumers had an idea of what sustainable fishing is. They described it as “controlled fishing”, “releasing small fish”, “not exceeding the quotas”, and “catching fish in the right season”.\n• 55 per cent had heard the phrase, but did not know what it meant.\n• 15 per cent had never heard about sustainable fishing.\nVisits to popular fisheries and a fish market showed that none of the locally caught fish displayed the MSC label. A survey of products in a major supermarket in the Sliema/St Julian’s area showed that 90 per cent of the imported frozen fish had the MSC label. On the other hand, only 25 per cent of the imported frozen fish in a small grocery store had the MSC label. In all cases, none of the locally packed fish had the MSC label.\nRecommendations\nIt is important to stop the exploitation of popular fish, such as steak fish. Currently a lot of fish is not eaten because there is not enough promotion for this kind of fish even though it is very cheap, highly sustainable and quite good. Horse Mackerel (sawrell), Frigate Mackerel (tumbrell), Pompano (strilja) and Atlantic Bonito (plamtu) are available, tasty and easy to prepare.\nIt is important to keep fish consumption high while giving the consumer a wider and more sustainable choice. Consumers can be educated through various means such as TV programmes, activities through local councils or those held in fishing villages. Leaflets and posters promoting consumption of sustainable fish can be displayed in fish shops.\nIt is important to save fish stocks, the ecosystems and at the same time safeguard the livelihood of people who depend on fishing. Moreover local traditions and culture related to fishing must be preserved.\nGabriel Pullicino, 12, is a Year 8 student at St Augustine College. This article was submitted as part of the Young Reporters for the Environment programme. To view other students’ entries, visit www.yremalta.org.", "comment_count": 0, "id": 324}, {"keywords": "Education", "author": "", "article_body": "Two postgraduate students from the University of Malta recently took part in a workshop in Athens, Greece, as part of the European project ‘Sustainable Intervention Technologies for controlling food Safety and Stability’ (Suit4Food) on the training the next generation of food technologists. They were accompanied by two resident University academics, Prof. Vasilis Valdramidis and Dr Edward Duca.\nPeople are demanding higher quality food that tastes better and stays fresher for longer. Also, food-borne disease outbreaks are a constant treat that needs vigilance to prevent and control.\nSuit4Food was set up to bring together teaching and industrial staff who are currently working on different aspects of food technologies, food safety, kinetic modelling, harmonisation of global food safety regulations and legislation, public engagement for food technology uptake, knowledge transfer and entrepreneurship development.\nThe workshop dealt with the development of sound standard operating procedures (SOPs), optimisation of alternative sustainable intervention technologies for food processing, transferring knowledge to industry to support food industry and food management on topics such as traceability and food safety.\nThe activities of Suit4Food will ensure further visibility of University of Malta students’ capabilities to the industrial world.\nSuit4Food is a University of Malta project funded by Erasmusplus Key Action 2: Strategic Partnerships of the European Union, funded by the European Union Programmes Agency (EUPA). This project has been funded with support from the European Commission.", "comment_count": 0, "id": 325}, {"keywords": "Education", "author": "", "article_body": "A group of foreign adults and children resident in Malta have been taught Maltese, English as well as waste separation at source after attending classes organised by the Sliema local council in cooperation with St Clare College and the National Literacy Agency.\nThe €30,000 co-financed EU educational project tapped into the EU’s Asylum Migration Integration Fund programme. It was the first time the council benefitted from such an EU-funded project.\nDuring the certificate awards ceremony, held at the college’s Sliema primary, Education Minister Evarist Bartolo encouraged other councils to learn from the Sliema council’s experience and engage in social and community-based projects that can tap EU funding.\nSliema councillor Paul Radmilli was the project leader.", "comment_count": 2, "id": 326}, {"keywords": "Education", "author": "", "article_body": "Maria Theuma will deliver a presentation entitled ‘So Very Hideous an Idea’ – The Girl, the Doll and the Cyborg’ on Tuesday, at 6pm in Hall D2, 3rd floor, Gateway Building, University of Malta, Msida.\nIn her presentation, Theuma will address the problem of maintaining a productive discussion surrounding the politics and aesthetics of gender, by looking at how the ‘girl’ strategically figures and operates within techno-culture and, more broadly, posthumanism. It aims to explore the prospect of a technofeminism within which bodies, desires and bio-textual intimacies need not necessarily be erased, and, potentially, might even thrive.\nTheuma is a PhD candidate in the University’s Department of English, where she is researching the relation between posthumanist aesthetics and beauty.\nStudents and the public are encouraged to attend the presentation, which will be followed by a discussion. It forms part of the Work in Progress in the Social Studies seminar series.­", "comment_count": 0, "id": 327}, {"keywords": "Education", "author": "", "article_body": "Chiswick House School, San Ġwann, recently organised a Victorian Day during which Level 3 pupils, dressed in costumes of the era, stepped back in time to explore the past world of the Victorians. By discovering about the past the pupils were able to compare what life was like then to now.\nThe activity tied in with the theme ‘Past worlds and magical lands’ whereby Level 3 pupils at the school are giving a contemporary twist to traditional and fairy tales such as Alice in Wonderland, which was written in the Victorian Era.\nThis wonderful and very exciting activity for pupils was organised with the support of parents, guardians and staff.", "comment_count": 0, "id": 328}, {"keywords": "Gozo", "author": "", "article_body": "To mark World Book Day, several book donations were made to various libraries in Gozo. Gozo Minister Justyne Caruana presented books to the Public Library in Victoria, while a group of students from Monza, Italy, presented a set of children’s books to the Gozo College Rabat Primary School library. The students were led by teachers Valeria Monzio, Alessandra Gatti, Paolo Colombo and Felice Cattaneo.\nSr Francesca Abela, St Francis Primary School headmistress, presented books on Mother Margherita De Brincat, foundress of the Franciscan Sisters of the Heart of Jesus, to the Seminary School library.\nOther book donations to the Seminary were made by Sheila Wagstaff, who presented a number of reference books, and by the school secretary Can. Karm Curmi, who donated biography books to the Seminary. ", "comment_count": 0, "id": 329}, {"keywords": "Gozo", "author": "", "article_body": "Welsh author Karla Brading, who was in Gozo, attended a book signing at Bargate bookshop in Victoria. Brading is the author of several novels and traditional ghost stories from her native Wales, including The Inn of Waking Shadows and The Valley of Whispers.", "comment_count": 0, "id": 330}, {"keywords": "Gozo", "author": "", "article_body": "The April edition of Il-Ħajja f’Għawdex takes readers underneath the Citadel bastions in Victoria on a visit to the newly restored wartime shelter complex. A quaint photo takes one further back in time, to when the present church of Ta’ Pinu was still a ‘work in progress’. Readers will also be able to enjoy a socio-linguistic snapshot of the many dialects still in use in Gozo and learn about the subtle ways islanders adjust their speech to suit audience and context.\nA biography of a saintly monarch and articles on Moses the lawmaker, a new bishop in Perù who hails from Żebbuġ, fauna literature, horse-racing and the evergreen topic of inter-island connectivity all form part of the content, not to mention more of the series of didactic anecdotes taken from everyday life and a detailed interview on a mosaic sacred art studio that has been making a name for itself in Gozo and beyond.", "comment_count": 0, "id": 331}, {"keywords": "Gozo", "author": "", "article_body": "The Victoria Scout Group organised a four-day camp at Dwejra during the Easter holidays. Around 80 members from the Cub Scouts, Scouts, Venture Scouts and Rovers together with their leaders attended the camp. The strong winds which hit the island on Easter Sunday and Monday destroyed several tents, including the one housing the kitchen. The marquee, which usually serves as a dining shelter, had to be used by the kitchen team. The group now has to replace the kitchen tent before its next camp in summer. In spite of the disruptions, each section followed its programme linked to the theme ‘The Great Siege’. Activities included nature hikes, crafts, gadget-building, pioneering projects, obstacle courses, cooking sessions, a clean-up of the area, various games and badge work. The group lived to Lord Robert Baden-Powell’s dictum: ‘A scout smiles and whistles under all circumstances’.", "comment_count": 0, "id": 332}, {"keywords": "Gozo", "author": "", "article_body": "The Aurora Youth Movement organised a bake sale during an open day at the Leone Band Club as part of the festivities marking April 29, 1956, the date when the Leone Philharmonic Society confirmed its close ties with the Cathedral church by donating the statue of Santa Marija to the cathedral in Victoria.\nMusical sessions were also organised throughout the day. Picture shows, from left, Amy Said, Zack Portelli, Mariella Sultana (AYM president), Thomas Bajada (secretary, Leone Philharmonic Society), Sione Grima, Sarah Camilleri and Samantha Vella.", "comment_count": 0, "id": 333}, {"keywords": "Gozo", "author": "", "article_body": "Għajnsielm archpriest, Canon Frankie Bajada, blessed two mosaics by Team Mosaic Għajnsielem. The works feature flowers in Garden Street and sea-themed low walls at the belvedere above Xatt l-Aħmar.  The team, headed by mosaicist Mary Portelli, met regularly over the past months to ensure that the renovation of the belvedere is finished in time. Being close to a popular diving site, the topic of the mosaic is the sea. The low wall on the cliff edge side has been transformed into a rolling wave while the planter on the western side depicts an underwater scene sporting fish and a diver.\nFollowing calls by Għajnsielem council, white crockery was collected and broken into small pieces to create the sea foam, while the coloured tesserae were used for mosaic flowers that adorn a roundabout in Garden Street.", "comment_count": 0, "id": 334}, {"keywords": "", "author": "Claire Caruana", "article_body": "Health Minister Chris Fearne insisted on Friday that the equipment at the physiotherapy department was “good” despite complaints by staff that there was not a single working treadmill there.\nTimes of Malta reported earlier this week that the physiotherapy department, situated at St Luke’s Hospital and run by Steward Health Care, is in such a bad state that staff there struggled to treat their patients.\nAsked about the situation, Mr Fearne insisted with the newspaper that renovation works at the department were in the pipeline and would start soon.\nWhen it was pointed out to him that staff had been promised improvements ever since the US company took over the 30-year government concession to manage three hospitals, Mr Fearne said that the idea behind the PPP was to improve the state of the hospitals.\nThe building, yes, has to be renovated\nHe would not say, however, when such works would start.\nMr Fearne also would not say whether he still believed that Steward was “the real thing”, a label he had attributed to the company when it took over from the previous concessionaire, Vitals.\nOn whether he was concerned about the claims by the physiotherapists that they could not provide the best possible service to their patients, Mr Fearne shrugged off the concerns, insisting that those treated at the department were getting “a very good service”.\n“I repeat, patients are getting a very good service. Obviously, the environment and the equipment is important. The equipment there is good. The building, yes, has to be renovated,” the minister went on.\nWhen it was repeatedly pointed out to him that the only treadmill at the department, used for therapy sessions to help patients walk, had not worked for months, Mr Fearne told this newspaper he had “already answered that question” and walked away.\nPatients from Mater Dei, and some from Karin Grech wards, are all treated at the physiotherapy department at St Luke’s. While the migration to Mater Dei took place in 2007, the physiotherapy department remained at the old hospital and was first taken over by Vitals, the previous concessionaire, and then Steward.", "comment_count": 24, "id": 335}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Public Broadcasting Services was receiving tens of thousands of euros in “indirect state-aid” in the form of advertising by direct order, industry observers told the Times of Malta.\nIn addition to the millions of euros in annual state funding under the legitimate public service obligation arrangement, the state broadcaster, which owns TVM, Radio Malta and an online web portal, gets additional funds via direct orders for non-commercial adverts and programme sponsorships.\nRead: National broadcaster gets more state funding\nThe direct orders were being allocated either directly to the state company running the TV and radio stations or through contracts with individual broadcasters producing and airing programmes broadcast by PBS, the observers pointed out, wondering whether such advertising and sponsorship allocations were under EU state aid rules.\n“The amount of funding being given to PBS through government coffers for these so-called public service obligation programmes is already questionable because many of the programmes so financed seem to fall outside the remit of the national broadcasting policy,” an observer familiar with both PBS and EU laws said.\nThe fact that the state broadcasting station was also receiving tens of thousands of euros in advertising and sponsorships from state entities without any form of competition and through direct orders was no-go and should be investigated by both the National Audit Office and the EU, he added.\nTimes of Malta is informed that a direct order amounting to over €73,000 was allotted by the Environment and Resources Authority for advertising in various programmes.\nOther programmes, including those by Malta Today managing director, Saviour Balzan, also have similar arrangements, in addition to payments made by PBS for the production of the shows. \nTransport Malta has allocated PBS two direct orders in connection with a Back to School campaign. It receives €17,700 to air traffic updates on another magazine programme called TVAM.\nIndustry observers said PBS should publicly clarify whether public funds are used to run its online news portal that competes directly with other privately-funded news portals. They noted that the national broadcasting policy does not make funding provisions for the news portal.\nFigures obtained following a request under the Freedom of Information Act shows that public funding to sustain PBS operations increased from €3.2 million in 2014 to €4 million in 2017, up 25 per cent.", "comment_count": 5, "id": 336}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Lands Authority chairman Lino Farrugia Sacco told Times of Malta the CEO should reply to questions on a controversial promotion approved to one of the main protagonists of the 2016 Gaffarena scandal.\nJudge Farrugia Sacco was asked via e-mail who had approved the promotion of Charles Camilleri and how the official, who had resigned from the regulator’s precursor, the Land Department, following the scandal had been reinstated.\nWhen the questions remained unanswered and the newspaper pointed out that, as the head of a publicly-funded entity, he was in duty bound to explain, the retired judge said CEO James Piscopo should reply.\nStill, the questions remain unanswered.\nTimes of Malta reported last month that, on the recommendation of Mr Piscopo, the regulator’s board of governors approved the promotion of Mr Camilleri as acting chief officer responsible for the same office he used to manage prior to the Gaffarena debacle.\nREAD: New claims by official on Gaffarena scandal\nAn inquiry conducted by the National Auditor had singled out Mr Camilleri as one of the three main protagonists that led to “irregularities” in clear breach of the fundamental principles of good governance, transparency and fairness. The other two were then parliamentary secretary (now minister) Michael Falzon, who had subsequently resigned, and then director general Ray Camilleri, who, too, has since resigned.\nAfter resigning, Mr Camilleri had moved to another government department and Prime Minister Joseph Muscat had described Mr Camilleri’s “removal” as a sign of accountability.\nThe newspaper is informed that, despite the fact that many officials on the Lands Authority’s board were not “happy” with having Mr Camilleri back into the same position he occupied when the irregularities occurred, it was only Nationalist MP Ryan Callus who formally objected.\nThe Auditor General had established that businessman Marco Gaffarena had acquired €3.4 million in land and cash from the government for the expropriation of half a building in Valletta valued at €900,000.\nIn a sworn statement following his resignation in 2016, Mr Camilleri had said he had acted the way he did because he felt threatened and under pressure by Mr Gaffarena and a liaison officer representing the parliamentary secretary.\nQuestions sent to Judge Lino Farrugia Sacco:\n▪ When did Charles Camilleri return to the Lands Authority (date) and in what position?\n▪ Did his employment with the Lands Authority follow a call? If not, who approved his return and in what grade?\n▪ Did your board approve Mr Camilleri’s employment?\n▪ Did Mr Camilleri apply for his latest promotion to acting chief officer? If not, who recommended his promotion?\n▪ Did your board approve Mr Camilleri’s promotion?\n▪ When is Mr Camilleri’s statutory retirement date?", "comment_count": 21, "id": 337}, {"keywords": "", "author": "", "article_body": "A Scrabble competition held recently in Malta will be recorded in the history books after players set a new world record for the most points scored in a tournament game.\nThe new record, which combines the two players’ final scores in a Scrabble game, was registered during the 12th Malta International Scrabble Open, MISO12, an annual tournament organised by the Malta Scrabble Club, which is affiliated with the World English Scrabble Players Association (WESPA).\nIn all, 57 players from 15 countries participated. The event attracted over 300 players since its maiden edition in 2008. The competition is held in three stages over an entire week.\nIt came hot on the heels of the 36th Malta National Scrabble Championship, which ran from early January to late April.\nWESPA chairman Elie Dangoor announced that the combined score during the seventh round was 1,213 points, the highest ever in tournament competition. The previous record was 1,157.\nThe game was between Englishman David Webb, the winner of the 2016 MISO, and his countryman, Bob Violett, who managed to score an impressive 502 points, but lost to his opponent’s 711-point score.\nMany casual games fail to reach even a total of 400 points. Players are not actually competing to see which pair can score the highest combined total but will be competing indi-vidually by trying to outscore each other.\nThe Malta Scrabble Club is represented in the biennial WESPA Championship (WESPAC), which is effectively the World Cup of English Scrabble.\nThe next edition of WESPAC will held in November, in Goa, India. Malta is set to be represented by three players.", "comment_count": 3, "id": 338}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Smart Supermarket complex in Birkirkara is set for a comprehensive redevelopment after years of what the Planning Authority called “unorganised piecemeal expansion”.\nA permit approved by the PA on Thursday will see the demolition of the existing buildings and the reconstruction of five underground car-park levels, retail and food outlets, a bakery, offices and other facilities all linked to the predominant supermarket complex.\nThe building will maintain the current two levels above ground, after earlier plans for a larger four-floor structure were withdrawn. The underground levels will provide parking spaces for 988 cars.\nApart from reorganising the current establishment, the PA’s case officer said the project would “improve the overall area from an aesthetic point of view”, as well as improve on current vehicle operations, reducing the supermarket’s current impact on the neighbouring area.\nUnorganised piecemeal expansion\nThe Smart supermarket complex site has over the years grown to include two separate plots on Naxxar Road, plots on Triq Ganu and Triq Domenico Cachia and a row of houses on Triq il-Mitħna, collectively covering a massive 12,000 square metre area.\nThe redevelopment permit, which will include a holistic design, was approved in a\npublic hearing following a positive recommendation from the PA case officer.\nOnly deputy chair Elizabeth Ellul voted against, citing the fact that the building exceeded the area’s height limitation. There were no objections to the proposal from the Birkirkara local council, the Environment and Resources Authority (ERA), Transport Malta or other entities.\nTraffic studies indicated that the impact of the additional cars on the area and traffic junctions was acceptable and that the proposed parking was enough to cater for demand. A large section of the proposed commercial area has not yet been designated for any particular use, to allow the owners to cater for new customer demands, and will be subject to a fresh application process in the  future.", "comment_count": 36, "id": 339}, {"keywords": "", "author": "", "article_body": "The insatiable greed of developers aided and abetted by the \"PLPN duo\" has led to overdevelopment and the destruction of open spaces and fields all over Malta and Gozo, Alternattiva Demokratika said.\nAddressing a news conference near the Torri Cumbo in the outskirts of Mosta, AD chairman Carmel Cacopardo said the land where the conference was being held had changed status from outside development zone to inside the scheme.\nIt measures some 40,500 square metres and around two years ago a Planning Control application had been rejected by the Planning Authority.\nBut the authority would now consider an application calling for the area to be developed into three-storey buildings with semi-basements, at a height of 17.5 metres above street level.\nMr Cacopardo said he objected to the development on behalf of AD earlier in the week arguing that:\n* it was identical to the original application which had been refused;\n* the development proposed was very intensive, with too few open spaces;\n*  the proposal ignored the fact that Mosta cemetery needs to grow and did not take into account the minimum distance required by law for a cemetery to be away from a residential area;\n* Torri Cumbo was cultural heritage which required a buffer zone;\n* the proposal should be accompanied by justification and rationale as well as details of the social and environmental impacts. The cumulative impact of the developement and of other development in the area should also be assessed.\nMr Cacopardo noted that there was no hint of any impact assessments in the development proposal. There was not even any assessment of impacts in the previous refused application.\nThis, he said, was not the only area bearing the brunt of the 2006 rationalisation decision in favour of speculators.\nAnother example was that along Triq Dun Mikiel Xerri in Attard. AD said that unless the Labour Party changed its mind since its 2006 vote against the rationalisation, it should be consistent and take the necessary steps against rampant development and land speculation.", "comment_count": 13, "id": 340}, {"keywords": "", "author": "", "article_body": "A 21-year-old man was charged with trying to sell drugs at the Lost and Found party after he was allegedly caught with 50 pills and eight sachets of cocaine and cannabis.\nLennon Pulis, from St Paul’s Bay, was caught during random inspections carried out by Drug Squad police at one of the venues of the Lost and Founds party being organised in Malta this weekend.\nHe was charged with trafficking cocaine and ecstasy, being in possession of both drugs which were found in circumstances denoting it was not for his personal use, being in possession of cannabis and committing drug-related crime within 100 metres of a place frequented by youngsters.\nMagistrate Charmaine Galea granted him bail against a €2,000 deposit and a €10,000 personal guarantee.\nPolice Inspector Jonathan Cassar prosecuted while lawyers Marion Camilleri and Franco Debono appeared for the man.", "comment_count": 0, "id": 341}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Two men were remanded in custody after pleading not guilty to conspiring to import and deal in 130 kilogramme of cannabis grass found in a garage in in Żejtun. \nThe men were apprehended following weeks of surveillance by the police who were acting on a tip-off. The drugs were found packed in luggage. \nJerome Azzopardi, 21, and Jonathan Cassar, 34, both from Cospicua, were charged with conspiring to import drugs into Malta and with the aggravated possession of cannabis grass. \nMr Cassar alone was on Saturday further charged with being a relapser. \nPolice inspector Jonathan Cassar told Magistrate Charmaine Galea that the two were caught following a tip-off that they could have been involved in drug trafficking. \nHe said the police were still investigating the case as it was convinced that the haul was part of a bigger organised crime activity. \nMr Azzopardi’s request for bail was turned down while Mr Cassar did not request to be released on bail at this stage. \nThe court, however, upheld a request by the police to freeze the men’s assets. Lawyer Roberto Montalto appeared for Mr Azzopardi while lawyers Franco Debono, Marion Camilleri and Amadeus Cachia appeared for Mr Cassar.", "comment_count": 0, "id": 342}, {"keywords": "", "author": "", "article_body": "A video has emerged of a highly-protected bird after it was shot down at the Addolorata Cemetery, a protected area. \nThe black kite was shot down on Saturday despite the closure of the contested spring hunting season.\nPolice have been called in and are investigating the case, Birdlife Malta said, pointing out that shots were reported being heard by members of the public in various areas.\nBlack kites are more commonly seen in spring rather than autumn, yet are not as common on migration as other birds of prey seen during spring.\nTheir appearance is unmistakable with a forked tail and their large size. As with other birds of prey, black kites do not like traversing large tracts of open sea, especially in inclement weather.\nThe kite would have possibly arrived in Malta the day before, and would have been just leaving its roost this morning waiting for the weather to warm up, BLM said. \n\nTurtle dove also shot down\nJust an hour after BirdLife Malta was called to recover the injured black kite, the eNGO received another call regarding a turtle dove which was found injured just outside a school at Vittoriosa. The turtle dove was found bleeding from a wing and is being taken to the government vet.\n\"This year’s spring hunting season, which closed last Tuesday, served as a smokescreen for hunters to illegally target the turtle dove in spite of the fact it was supposedly only open for quail. This, following a conscious decision by the government to open a hunting season whose dates extended well into the peak migration period of the vulnerable turtle dove,\" BLM said.\nThe total of known illegally shot protected birds so far in 2019 now stands at 36\nRead: Two protected birds shot, hours before start of spring hunting season", "comment_count": 39, "id": 343}, {"keywords": "", "author": "", "article_body": "A petition has been raised by a group to put pressure on Joseph Muscat to stay on as prime minister. \n\"Joseph, Malta bżonnok\" (Joseph, Malta needs you) is a campaign launched by the group which calls itself Interess ta' Malta, led by former General Workers' Union boss Tony Zarb, and former Labour officials Manuel Cuschieri and Guża Cassar.\n\"We believe the majority believe in Joseph Muscat's capabilities and we therefore feel we need to unite so that he continues leading the country on the right path,\" they told a news conference. They said people from all sectors of society acknowledge the Prime Minister's capabilities. \nThe organisers hope they can present the petition to Dr Muscat in the shortest possible time. \nDr Muscat has repeatedly declared since the last general election that he will not seek another term, and two terms as Prime Minister are enough. He has not, however, said when he will step down and whether he will step down from both the government and the party leadership.\nRead: Joseph Muscat insists: I will step down by next election\nMeanwhile, at least two ministers have started campaigning behind the scenes to step into the party and prime minister's role once Dr Muscat announces his retirement. \nThe petition is available from here.\n ", "comment_count": 56, "id": 344}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Malta has consistently been missing its emissions targets and has the worst air quality in Europe, Environment Shadow Minister Jason Azzopardi charged on Saturday morning. \nThe country has been paying Bulgaria around €200,000 a year because it cannot reach its targets, a report the government has never denied. It also has the worst track record for recycling. \nRead: Malta again fails emission test, has to pay \"hundreds of thousands\"\n“The Socialist government and the environment are not compatible. Euronews described us as the dirty man of Europe. 600 people die every year as a result of the bad air quality,” he said. \nDr Azzopardi said all this is happening because the government did not have a proper plan for the environment, especially to be able to deal with the increase in the country’s population. \nHe said Nationalist Party leader Adrian Delia asked Prime Minister Joseph Muscat during a debate this week about Malta’s carrying capacity but the question remained unanswered because the government has no plan.\n“What is Malta’s maximum capacity? This country is becoming unlivable. We not only need a good quality of life but we also need to have clean air to breathe,” he said. \nMEP candidate Michael Briguglio said the party had strong proposals where it wanted to see the country in the future and how it could reach its targets. \nAmong the proposals, the PN is insisting that the country reaches its environment targets. It also wants to achieve a modal shift in transport, which is not simply widening roads but the effective use of public transport. Moreover, it is proposing to use EU funds to be able to improve the state of the environment.", "comment_count": 50, "id": 345}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Take the PN with a \"bucket – not a pinch – of salt\", especially after its U-turn on the Gozo-Malta tunnel, Joseph Muscat told supporters on Saturday.\nThe Nationalist Party had promised to support the tunnel twice and backed the construction of a permanent link in Parliament last month, but it was now getting cold feet, he said in Xagħra.\nThe Labour leader said the PN had proposed the tunnel while in government in 2012, before carrying out any studies before promising the tunnel during the 2013 and 2017 election campaigns.\nFollowing Labour’s election to government in 2013, former Opposition leader Simon Busuttil had even accused the Labour government of dragging its feet over the link, as feasibility studies were being carried out. \nLabour promised the tunnel in 2017, and all three parties in Parliament gave unanimous support to the link last month. \n“But during the televised debate on Thursday night, Opposition leader Adrian Delia expressed concern over the tunnel and said we should carry out studies and hold a consultation before we decide on whether to go ahead with the project,\" Dr Muscat said.\n“While the Opposition came up with the idea, promised it twice, and agreed with it in parliament, it was now against its construction. We promised it once and we will build it.”\nThis was a lesson for the Gozitans who should acknowledge that the PL was the only party that took them seriously, he added.\n“However, the biggest lesson for all Gozitans and Maltese is that PN will not implement whatever they promise. All they care about is getting your vote.”\nDr Muscat said he looked forward to the electorate’s judgment during the MEP and council elections on May 25, however, he warned party supporters to remain grounded and ignore those who said this was going to be an easy win for Labour.\nDuring the launch of the PL candidates, Dr Muscat warned about the \"PN's strategy\" to field few candidates - a tactic that would have undermined 10,000 voters in Gozo.\nNo reaction to 'rubbish' criticism\nIn Xagħra, the Prime Minister made no reference to the reactions sparked after Thursday's televised debate with the PN leader during which he said he would rather see foreigners, rather than Maltese, carry out certain non-skilled jobs, such as picking up rubbish or doing manual labour out in the sun.\nThe statement came under criticism by several, including left-wing activists Moviment Graffitti who said that the “classist and racist” rhetoric ran directly counter to socialism.\nHowever, addressing the same Xagħra audience, Home Affairs Minister Michael Farrugia said that while the PN wanted foreigners to occupy the highest posts, the PL wanted the Maltese to have high-skilled posts, while the foreigners filled positions that the Maltese did not want to or did not have the right skills for.\nMeanwile, as the PN wanted Malta to become a hub for illegal migration in the Mediterranean, the PL had shown its belief in relocation, repatriation and burden sharing, he claimed.\n ", "comment_count": 42, "id": 346}, {"keywords": "", "author": "", "article_body": "Reports of burglaries in Sliema were down by 30 per cent compared to the last year of the Nationalist administration, according to the Home Affairs Minister. Burglars have been removing locks from front doors to gain entry as can be seen in this photo from a Sliema apartment they targeted last month.\nA total of 76 burglaries had been reported from Sliema in 2012, the highest on record, Michael Farrugia said, in comparison to the 55 reported last year.\nHe did not mention the number of break-ins in Sliema this year. The Sunday Times reported sources close to the police saying there have been dozens of thefts in recent weeks, with the majority of them targeting apartments rather than larger houses. In one case a whole apartment block was burgled.\nRead: Sleeping family locked in as burglars ransack villa\nIn a statement, the Labour Party urged Nationalist leader Adrian Delia to stop basing his politics on exaggerations, fear and misinformation. \nSpeaking in Sliema on Friday night, Dr Delia said some residents are being forced to install up to three doors because of the crime in the locality. \n ", "comment_count": 3, "id": 347}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Children and adults with severe allergies are living in a state of anxiety as Malta is one of several countries hit by a shortage of the EpiPen, a life-saving medication in the event of an attack.\nEpiPens, the leading brand of epinephrine autoinjectors used to treat anaphylaxis, are in low supply internationally and Malta’s supplier is finding difficulty securing any from the international supplier.\nThe product, which administers epinephrine intramuscularly, is simple enough to be used by parents, teachers or friends at the first sign of anaphylaxis. EpiPens deliver a shot of epinephrine in a potentially fatal situation. \nOne patient who spoke to the Times of Malta on condition of anonymity said he was literally living “minute-by-minute” as the EpiPen that he relies on is not available and does not seem to be available anytime soon. “I had two allergic reactions in quick succession and I am now without an EpiPen,” he said.If something happens, only God knows what my future holds\n“If something happens, only God knows what my future holds. We literally depend on the EpiPen. Our lives depends on it.”\nAnother patient explained that while he only needed an EpiPen once in all of last year, this year he had to use two in the space of just nine days after suffering successive allergic reactions.\n“It’s a matter of life or death. Without the EpiPen, death is closer unless you have someone to get the help you need as quickly as possible,” he added.\n“I have none left but luckily I have relatives coming to Malta from abroad so they’re bringing me two along with them,” he said.\nEach EpiPen costs €70 and has a shelf-life of just three to four months. EpiPens are usually prescribed in two doses – for adults and children. It is recommended that people carry two pens as the first one may not work on its own.\nThe main supplier of EpiPens in Malta, JV Pharma, told the Times of Malta when contacted that there was an international shortage and they were having difficulties securing stock from its own suppliers abroad.\nSources said the manufacturer was acquired by another company and there was a drop in production during the changeover.\nThe sources said that since it has such a short shelf life, many pharmacists do not stock them unless they know they have a steady request for them from their loyal customers.\nAccording to pharmacists, even though the expiry date will state a particular month, the device will be valid until the last day of that month.\nEven if a device is out-of-date, it can still be used in an emergency as long as the liquid inside is not cloudy or discoloured, according to pharmacists. A spokeswoman for the Health Ministry said that while the State did not import the EpiPen directly, it still had a stock for emergency use.\n\nWhat to do?\n\nIf a patient suffers an attack and has no EpiPen, he/she or a relative should immediately call 112. In severe cases, untreated anaphylaxis can lead to death within half an hour.\nHave the person lie still on his or her back.\nLoosen tight clothing and cover the person with a blanket. Don’t give the person anything to drink.\nIf there’s vomiting or bleeding from the mouth, turn the person on his or her side to prevent choking.\nIf there are no signs of breathing, coughing or movement, begin CPR. Do uninterrupted chest presses – about 100 every minute – until paramedics arrive.", "comment_count": 18, "id": 348}, {"keywords": "", "author": "", "article_body": "Sunday Circle is back with a new edition full of interesting interviews, features, personalities and prizes.\nGrab the print edition with The Sunday Times of Malta tomorrow or download the digital issue free.\nThere are gifts and offers from House of Beauty, Franks and Chemimart, as well as a grand prize up for grabs – an overnight stay at Hilton Malta and dinner at Blue Elephant.\nDon’t miss an in-depth interview with exclusive video with singer and X-Factor Malta judge Alexandra Alden.\nPlus an interview with video with Freddie Portelli, Malta’s own king of rock’n’roll, where he speaks about the upcoming release of a new track.\nThe magazine this month also turns the spotlight on Mother’s Day, with a very touching interview with a foster mother who has faced obstacles, sickness and fears to give a new life to two little girls. There’s also arts, fashion, shopping and personality interviews to enjoy!\nIf you have not done so already, download the digital version of Sunday Circle by looking up TOMMag on Google Play and Apple Store. It’s free!\nSunday Circle is published by Allied Newspapers Ltd.", "comment_count": 0, "id": 349}, {"keywords": "", "author": "", "article_body": "Plans are under way to develop four new tunnels and reconstruct St Andrew’s Road to help solve the traffic problem, improve the safety and efficiency of the arterial connections in Pembroke, St Julian’s and other nearby areas and localities.\nPembroke-St Julian’s Connections is a new project extending from the Coast Road to Regional Road, before the Manwel Dimech Bridge and the northern portals of the Ta’ Giorni tunnels, Infrastructure Malta announced on Saturday.\nOn Friday, the authority submitted the project’s initial development applications to the Planning Authority, to launch public consultations and request the necessary authorisation as part of the permitting procedures.\nThis project includes the reconstruction of St Andrew’s Road and part of the Coast Road in a new four-lane design, to eliminate several traffic lights junctions and other bottlenecks along this route, as well as build four new tunnels to facilitate safer and quicker access to and from Pembroke, Paceville, St Julian’s and Swieqi.\nThrough these upgrades, Infrastructure Malta said it is optimising the capacity and connections of the region’s road network to reduce traffic in several residential roads in Pembroke, Swieqi and St Julian’s, and the resulting air pollution and accident risks, while developing the necessary infrastructure to meet the area’s future transportation requirements.\nThe area has been choked with traffic for years, with the problem expected to be exacerbated as a result of the new St George's Bay db project. \nPhoto: Infrastructure Malta\nTunnel to connect Coast Road to St George's Bay\nThe longest of the four new tunnels will connect the southern end of the Coast Road (High Ridge area) to St George’s Bay. This new 1.5-kilometre underground link will include two lanes, one in each direction. It will completely bypass the residential areas of Pembroke and Swieqi, while providing quicker connections to the Paceville and St Julian’s seafront areas from the northern parts of Malta.\nUnlike previous proposals, the new infrastructure will improve public access to several areas in and around Paceville and St Julian’s, and not to specific developments only, IM said.\nA 500-metre one-lane tunnel will link the northbound carriageway of Regional Road, before reaching the Paceville traffic lights junction, to Pembroke (Walter Ganado Street), for easier access to this locality from the southern part of Malta.\nThe third tunnel will connect the same carriageway of Regional Road to St George’s Bay, to provide a safer and quicker alternative to the existing Paceville traffic lights junction.\nA fourth, 115-metre underground connection will start at Church Street (Millenium Chapel area) and exit at Spinola Bay (St George’s Road), creating a new exit from Paceville while reducing congestion difficulties in several nearby adjoining roads and junctions.\nAnother new connection between Olive Street, in The Gardens area of St Julian’s, and Regional Road’s southbound carriageway, just before the Manwel Dimech Bridge, will also be developed. This new link will make it easier for residents in this area to travel to and from their their homes without having to use the Paceville or Spinola junctions, which are being upgraded as well.\nSt Andrew's Road to be reconstructed\nSt Andrew’s Road and the southern end of the Coast Road will be reconstructed to eliminate several parts of this TEN-T road corridor that currently narrow down to one lane in each direction.\nThe Pembroke-St Julian’s Connections project will widen these roads to four lanes, whilst eliminating a number of bottlenecks, including the optimisation of the Paceville junction, the Pembroke T-junction with Walter Ganado Street and the Swieqi priority intersection opposite the Luxol Grounds.\nThese upgrades will lead to significant travel time reductions in this arterial road corridor, while reducing accident risks and congestion pollution in several nearby residential roads, particularly in Pembroke and St Julian’s, the authority said.\nInfrastructure Malta said it will continue meeting several stakeholders, including the local councils that will benefit from this project, to further refine these plans and make sure that this part of the country’s arterial road network is adequately consolidated to meet current and future transportation requirements.\nWhilst the Pembroke-St Julian’s Connections plans will be made publicly available by the Planning Authority as part of the permitting process launched on Friday, an outline design of the four tunnel routes and the main upgrades being proposed is available on Infrastructure Malta’s Facebook Page.", "comment_count": 68, "id": 350}, {"keywords": "", "author": "", "article_body": "Updated 7.45pm, body of second fisherman found \nTwo men died and another two were hospitalised after their fishing boat capsized off Żonqor Point during the night. \nVideo: Jonathan Borg\nOne of the dead, a 29-year-old Moroccan national was found immediately but the body of the other missing fisherman, a Sicilian, was only found in the afternoon in the limits of Pembroke following an intense search by the Armed Forces of Malta.\nIt is being transported to the AFM's base in Haywharf.\nAn image of the search this morning. Photo: Kenneth Gafa.\nThe incident off Marsascala was reported around 4am, sparking an immediate response from the AFM and the Civil Protection Department.\nTwo of those on board the 45-foot vessel, a 35-year-old and a 29-year-old, both Sicilian, managed to swim to shore and were picked up by the CPD, the police said. \nThe search under way on Saturday morning. Video: John Sammut\nA seagull hovers of the radio mast of the boat. Photo: Jonathan Borg\nStrong south-easterly winds hit the island overnight, whipping up rough seas. \nThe radio mast of the capsized boat was visible as rescuers tried to find for the missing man throughout the day. \nThe area is notorious for shipwrecks, with the best known being the tanker Angel Gabriel, which was destroyed during a violent storm in September 1969.\n\nPhoto: John Sammut\nThe Angel Gabriel shipwreck in 1969. Photo: Frank Attard\n \n ", "comment_count": 0, "id": 351}, {"keywords": "", "author": "", "article_body": "A taxi driver died and another was seriously injured in a head-on crash in Burmarrad early on Saturday. The victim: Christen Cachia\nThe crash took place on Burmarrad Road at 12.15am and involved two Peugeots, one of them a passenger van.\nThe lighter vehicle was thrown off the road with the force of impact.\nChristen Cachia, a 31-year-old man from Safi who was driving one of the taxis was critically injured and succumbed to his injuries in hospital.\nThe other driver, a 59-year-old from Żejtun, was seriously injured.\nFour young Scottish tourists - aged 18 to 24 -  who were in one of the taxis heading towards Mosta suffered slight injuries.\nTributes poured online for the victim, a former Armed Forces of Malta soldier, who also had a young daughter.\nA magisterial inquiry is under way. ", "comment_count": 0, "id": 352}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that children and adults with severe allergies are livingin a state of anxiety as Malta is one of several countries hit by a shortage of the EpiPen, a lifesaving medication in the event of an attack. Another story says a man who accompanied his underage girlfriend to the police station to falsely report rapeended up arrested after she told the police the two were having intimate relations.\nL-orizzont quotes the General Workers' Union general secretary saying that all work should be respected and dignified. It also reports about the €6 million investment at the Mġarr port.\nIn-Nazzjon reports that Malta had plunged 12 places in the World Press Freedom Index.\nThe Malta Independent quotes Joseph Muscat denying the Opposition leader's accusation that he wants to create a classist society. It also reports that a retired judge was to analyse threatening phone messages sent to Daphne Caruana Galizia. ", "comment_count": 0, "id": 353}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Unless they are obstructing traffic, the transport watchdog cannot take any action about illegally parked caravans.\nTransport Malta (TM) also has its hands tied when it comes to unmotorised campers and trailers as they are not registered with the authority, a spokesman told the Times of Malta.\nTM was replying to questions sent after caravans descended on Mistra Bay for the summer, to the annoyance of bathers and a businessman who is considering closing his restaurant and leaving Malta.\nRead: 'I'm packing up and leaving the island' - Mistra restaurateur gives up\nClaude Camilleri told the Times of Malta that he has been losing clients since campers started parking their caravans just outside his terraced restaurant around 2008.\nHe flagged the issue with ministers, the Malta Tourism Authority, the police and the local council among others, and even filed a criminal complaint against the police for their lack of enforcement.\nFor Mr Camilleri, the lack of enforcement showed a sense of impunity.\n“I have given up. We renovated the place two years ago, investing tens of thousands of euros, but we have decided we will move abroad. This is an issue that has been dragging on for years,” he said.\nWhen contacted, Mellieħa mayor John Buttigieg said that while motor caravans could park by the side as they have a road licence and insurance, the owners cannot place barbecues, chairs, tables and other beach furniture beside the vehicles, or pull out an extendable canopy.\nMeanwhile, towed caravans need a parking permit, and the council does not issue permits for such campers anywhere in the locality.\nThe council itself has drawn the attention of the police and TM about enforcement issues.\nTM confirmed with this newspaper that a caravan which has an inbuilt engine could park on public roads just like a standard vehicle. “Naturally, the vehicle must observe traffic regulations,” a spokesman said.\nHowever, unmotorised campers and trailers can only be parked on the road if secured to or towed by a vehicle. \nAny other potential breach of regulations or irregularities would be within the remit of other entities, the spokesman added.\nBut since unmotorised campers and trailers were not registered with the authority, there was a limit to what actions the authority could take against the owners, unless the vehicles were obstructing the flow of traffic, the TM spokesman noted. \nQuestions sent to the police but have so far remained unanswered.", "comment_count": 67, "id": 354}, {"keywords": "", "author": "", "article_body": "A 50-year-old man was seriously injured in Valletta on Friday.\nThe police said the accident happened in Triq San Pawl at 4.45pm.\nThe victim, a 50-year-old British man who lives in Sliema, fell on a Renault Fluence that was being driven by a 27-year-old from Qormi.\nHe was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 355}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The parvis of a chapel originally built in 1550 and rebuilt almost a century later was bulldozed during a road widening project, Times of Malta has learnt.\nThe chapel, dedicated to St James, lies on the road behind the Addolorata Cemetery chapel, between Paola and Luqa.\nMore than a metre of the parvis was destroyed by jackhammers over the weekend, sparking the anger of Luqa residents who reported the matter to the parish priest, Fr Michael Zammit.\n“Had residents not told me about it, I would not have realised what was happening. No one bothered speaking to us in advance. They just went there and demolished part of the parvis to reduce it to a pavement, with all the dangers it brings along. This is national heritage we are dealing with,” Fr Zammit said when contacted.\nThe chapel belongs to the Luqa parish though it lies on the boundary with Santa Luċija.Infrastructure Malta will be repairing and upgrading the concrete slab\nFr Zammit said Mass was held there once a year to mark the feast of the patron saint in July, which, he noted, was usually well-attended. It is occasionally also used for private Mass. The chapel was, until recently, looked after by an elderly couple but they had to give up the job and another couple had now assumed responsibility.\n\nThe Archbishop’s Curia’s administrative secretary, Michael Pace Ross said the Church had been assured by the architect and the Roads Ministry that the parvis would not be touched during the project.\nThe widening of the road would lead to traffic passing closer to the chapel and would have an impact on the historic building, which was rebuilt in 1623 and was restored in recent years, he said.\n“Roads are being widened at the expense of heritage, culture and the environment,” Mr Pace Ross remarked.\nA spokesman for Infrastructure Malta said the parvis, which he described as a “concrete slab”, had to be removed to make way for a footpath.\n“Part of the existing concrete slab in front of the chapel needed to be temporarily removed to build the foundations of the new footpath, in line with the plans and new road alignment approved by the Planning Authority.\n“Once the footpath is constructed, Infrastructure Malta will be repairing and upgrading the concrete slab and its low boundary wall to make it safer and more accessible to people who visit this chapel,” he said.\nHe added that the reconstruction of Luqa Road would also see the introduction of a new cycling and walking track, among other upgrades.\nBeneath the new road surface, Infrastructure Malta is laying a new 1.2-kilometre long potable water pipeline and several telecommunications networks to help improve the quality of the services in nearby localities. A new 1.8-kilometre long storm water system is also being built along the sides of the road.\nThe rebuilding of Triq Ħal-Luqa is co-financed by the European Union, within the framework of the European Regional Development Fund.", "comment_count": 139, "id": 356}, {"keywords": "", "author": "", "article_body": "The Institute of Maltese Journalists has joined international press associations and civil society groups in reminding the public of how essential the free press is to the maintaining the freedoms everyone took forgranted.\nIt reiterated that libel suits against independent media should only be used as a last resort and should never be used to silence and deter journalists from following a story. IGM said it remained concerned at the risk to the local press of SLAPP lawsuits filed in foreign jurisdictions and called on the authorities to provide the necessary guarantees against such threats.\nRead: Minister slaps down SLAPP amendments meant to protect journalists\nIGM appeals to all election candidates and political activists not to use, and to understand the dangers of anti-media rhetoric.\nThe media, it said, had an obligation to inform the public about the people asking to be their representatives on the local and European stage and for this to happen, the press had to be allowed to do their job without fear of repercussion.\nIGM therefore joins the International Federation of Journalists (IFJ) in its campaign for safe and independent election coverage. “Elections represent a test of political commitment to democracy, when the impulse to manipulate media and control information is strongest among ruling parties and candidates running for office,” IFJ president Philippe Leruth said.\nThe IGM pointed out that, in recent years, journalists were repeatedly harassed or intimidated online, driven to a certain extent by a de-legitimisation of journalists and the press by those unwilling to open themselves up to the scrutiny required of them in their position.\nCitizens could only form informed opinions if they had clear answers to pertinent questions, and information based on factual truth.\nThe institute also remembered slain journalist Daphne Caruana Galizia, who was killed over a year-and-a-half ago, by someone who wanted to deprive the public of information, it said. It called on the authorities to do all in their power to bring all those responsible to justice as quickly as possible.\n“As long as we remain in the dark about why Daphne was killed, we can never be truly free to do our work. Those who believed that killing a journalist was a viable way to cover up a story must be shown that they were mistaken,” the IGM said.", "comment_count": 28, "id": 357}, {"keywords": "", "author": "Edwina Brincat", "article_body": "An unnamed mother of five arrested in the raids which landed drug kingpin Jordan Azzopardi behind bars has been granted bail.\nThe 30-year-old woman was arrested in March after she exited a Madliena apartment having parted company, earlier on, with Mr Azzopardi who was subsequently arrested at a McDonald’s car park in Għargħur.\nOn that same evening, a police surveillance team trailing the suspected drug lord who had been driving a black Skoda, making various stops at shops in the Sliema and San Ġwann area, had noticed a woman seated at his side.\nRead: Series of thefts linked to drug kingpin, court hears\nUpon reaching the Għargħur car park, that woman, later identified as the mother-of-five, had driven away in another vehicle, making her way to Madliena with investigators on her tracks.\nShe was eventually arrested as she re-emerged from the residence, the key to which was discovered in her possession.\nThe woman was arraigned alongside Mr Azzopardi and a third person, 66-year-old Mario Abdilla, who had admitted to his involvement in the fake cash racket, allegedly masterminded by Mr Azzopardi.\nMr Abdilla had been given a three-year effective jail term upon his own admission of guilt.\nThe woman had pleaded not guilty to being involved in a criminal conspiracy, fraudulently circulating fake cash and defrauding three stores in San Ġwann and Sliema. She was also charged with cannabis possession.\nMeanwhile, as the compilation of evidence continued against Mr Azzopardi and the woman, whose name was banned from publication to safeguard the interests of her children, the defence filed a bail application for each of the co-accused, reserving discussion thereof in respect of Mr Azzopardi to a later stage.\nOn Friday, the Criminal Court, presided over by Madame Justice Edwina Grima, upheld the application in respect of the young mother, observing that all civilian witnesses, save for one who was currently behind bars, had testified.\nPointing out that this fact had been confirmed by the prosecution, while taking note of the woman’s clean criminal record and the fact that both parties had argued that as a mother of five, the risk of absconding was minimised, the court accorded bail against a deposit of €15,000, a personal guarantee of €30,000, a duty to sign the bail book on a daily basis and to abide by a curfew between 10pm and 6am.\nThe compilation of evidence continues in June.\nInspectors Mark Anthony Mercieca and Justine Grech are prosecuting. Lawyers Arthur Azzopardi and Alfred Abela are defence counsel.", "comment_count": 0, "id": 358}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The proposal to allow 16-year-olds to run for the post of mayor has been ditched following public consultation on the local councils' reform that will kick in after May 25.\nSixteen-year-olds will however be able to contest local elections.\nThe reform will see a \"substantial increase in the honoraria\" handed out to regional presidents, mayors, deputy mayors, local councillors, and the head of the local councils' association.\nThe proposal to do away with administrative committees has been included in the reform. Instead, a councillor will be responsible for particular hamlet communities.\nEach councillor will also be assigned particular responsibilities such as taking care of cleanliness, physical education and activities in the locality, social integration and animal welfare among others.\nMeanwhile, Regional Committees will be rebranded into Regional Councils. Both regional and local councils will enjoy the same Local Government status, and the Constitution will be amended to reflect this change.\nAmong others, regional councils will have the responsibility to coordinate the public's access to school facilities during after-school hours.\nThey will also carry out scientific research to gather feedback from residents.\nPresenting the finalised reform, Parliamentary Secretary for Local Governance Silvio Parnis said the changes will not remain on paper and once implemented will ensure \"local councils of excellence\" after May 25.\nThe reform is being implemented 25 years following the introduction of local councils in Malta.\nThe consultation about the reform included the participation of the Opposition, the councils, people living in the south and north of Malta and Gozitans.\nOther changes:\n-The simplification of rules regulating activities, which would also make their application uniform across localities.\n-Increased autonomy in the employment of people by the local government\n-Participation by residents in the local councils' business plan", "comment_count": 8, "id": 359}, {"keywords": "", "author": "", "article_body": "Gozo commuters had to wait in long queues at Mġarr Harbour on Wednesday after the Labour Party chartered one of the three Gozo channel ferries in service for its May Day rally in Valletta, Times of Malta was told. \nGozo University Group president Rachel Galea said last year the chartering of the vessel to transport Labour supporters to Valletta was becoming an annual affair, despite complaints. Yet, last year’s complaints seem to have fallen on deaf ears, with commuters again reporting finding problems to make the crossing.\n“They did not inform people beforehand,” a commuter who said he remained stuck in Gozo, said. The sentiment was shared by many who were faced with a “chaotic” situation, which they did not expect.\nCommuters faced with a ‘chaotic’ situation\nTraffic congestion appeared to get worse at about 7pm, when the chartered ferry was on her way to take Gozitan Labour supporters back home, some of those affected said.\nHowever, Gozo Channel chairman Joe Cordina insisted the situation was “much better” than previous years because May Day this year did not fall on Monday or Friday. It was always worse when Workers’ Day fell on a long weekend, he noted.\nMr Cordina questioned the interests of the commuters who complained about the matter.\nThe chairman, who is also the mayor of Xagħra, defended the use of the ferry to transport Labour supporters, saying there should be no reason why someone who paid for the use of a ferry should not be allowed to use it.\nAsked how much it cost to charter the ferry, Mr Cordina he said he could not remember the figure. Two years ago, he had told this newspaper it cost about €4,000.", "comment_count": 25, "id": 360}, {"keywords": "", "author": "", "article_body": "A 61-year-old woman was seriously injured on Friday when she was crushed against a wall in Marsalforn.\nThe woman, a Chinese national who lives in the Gozitan seaside town, was walking in Pjazza San Pawl when a parked Iveco van rolled towards her. It crushed her against a wall. \nThe police said the accident was reported at noon.\nThe woman was taken to Gozo General Hospital by ambulance.\nPolice said they are investigating.", "comment_count": 0, "id": 361}, {"keywords": "", "author": "Claire Caruana", "article_body": "Dentists working in the public sector will start benefiting from improved working conditions after the government and the UĦM Voice of the Workers finalised a new sectoral agreement. \nThis will be the first new agreement for dentists since 1993, Health Minister Chris Fearne said ahead of the signing. \n\"Dentists were working with an agreement that was almost historic. There were talks, even industrial action, but today we will be signing a new agreement. Obviously, the new conditions are better. I am glad to see that this will ensure that patients will be offered a better services,\" Mr Fearne said, noting that discussions were held in the context of a number of issues with the public dentistry department.\nRead: Calls for foreign dentists are undermining local ones, union complains\nAcknowledging that there are still people on the waiting lists, Mr Fearne said that the new agreement will address this because the number of new dentists will increase significantly. In the past, he said, dentists often opted to work in the private sector because their salaries there would be better. \nOn his part, UHM chief Josef Vella said that the process to come to an agreement was not a short one, adding, however, that he was honour that two sides were finally signing such an agreement. \n\"This sectoral agreement provides a structure to dentists and it also gives them the opportunity to continue furthering their specialisations. I now want to make sure that what we have in the agreement is honoured and implemented,\" Mr Vella said. ", "comment_count": 1, "id": 362}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who allegedly encouraged his underage girlfriend to falsely report that she had been raped by a friend of the couple has ended up being charged with defilement himself.\nThe 25-year-old technician from Ħamrun was escorted to court under arrest on Friday afternoon, where he pleaded not guilty to charges of defiling the girl, who is 10 years his junior, engaging in sexual acts with her and creating circumstances for the purpose of having a third party falsely accused of violent rape.\nThe man was further charged with causing his girlfriend to fear violence, breaching bail conditions and being in possession of cannabis which he failed to prove as being for personal use.\nHe was also charged with being a relapser.\nAlthough details were scanty during the hearing, sources said that the man had accompanied his girlfriend to the police station to report that a friend of theirs had forced himself upon her, engaging in non-consensual sex.\nHowever, once inside, the girl had admitted that she was having sex with her boyfriend and that her earlier story had not been true. So the girl’s boyfriend was arrested.\nNo request for bail was made at this stage.\nThe court, presided over by magistrate Charmaine Galea, ordered a ban on the publication of all names, further ordering that the ban be posted within the building of the Court.\nInspectors John Spiteri and Kylie Borg prosecuted. Lawyers Alfred Abela and Arthur Azzopardi were defence counsel.", "comment_count": 0, "id": 363}, {"keywords": "", "author": "Edwina Brincat       ", "article_body": "Threatening messages sent to Daphne Caruana Galizia’s mobile phone are to be identified by a retired judge and handed over to the court, a magistrate ordered on Friday. A woman holds up a portrait of Ms Caruana Galizia at a vigil marking one year since her assassination. Photo: Chris Sant Fournier\nThe decision was taken during a session in the compilation of evidence against brothers George and Alfred Degiorgio and Vincent Muscat, the three suspects currently accused of having murdered the journalist using a car bomb outside her Bidnija home on October 16, 2017.\nMr Justice Michael Mallia will analyse mobile phone messages sent on WhatsApp to Ms Caruana Galizia and identify any which amounted to threats. He will do this without disclosing the messages’ sources, the court, presided over by magistrate Claire Stafrace Zammit, said.\nBoth the defence and prosecution agreed to having the retired judge undertake this task.\nAssessing Ms Caruana Galizia’s mobile phone was first raised by defence lawyers earlier on in proceedings, with the prosecution suggesting that an expert, ideally a retired member of the bench well-versed in criminal law, should be appointed to handle the task.\nEarlier on in the sitting, IT court-appointed expert Keith Cutajar returned to the witness stand to explain that expert data recovery firms overseas had warned him that it was extremely difficult to restore a corrupted micro SD card.\nData from the physical phone has not been extracted and it will be messages from WhatsApp which may be downloaded. \nDr Cutajar had been tasked with contacting the firms to try and restore data from a Toshiba micro SD card in an earlier court sitting.\nThe particular micro SD card, which was made by Toshiba, was known to be problematic, he explained. The manufacturer had even halted production of that particular type of card and posted a warning on its website advising users to avoid using it to store data.\nExtracting data from it would risk removing its outer coating and irreversibly damaging it, the expert explained, confirming, upon cross-examination by defence lawyer William Cuschieri that the original exhibit had never left his possession.\nDr Cutajar said he had only sent the foreign experts photos of the card taken using specialised equipment.\n“They didn’t even know what the case was about,” Dr Cutajar told the court.\nAnother witness, Jason Pavia, representing Vodafone, was summoned again following the defence’s insistence on knowing how many phones had made contact with a particular cell tower at a particular time close to the incident.\n“It’s not a simple question,” the defence argued, as Mr Pavia explained that all data had been retrieved from the system by their technical expert and handed over to investigators.\nProsecuting Inspector Kurt Zahra intervened, stating that it was the police’s task to actually check that data.\nThe case continues later this month.\nLawyers William Cuschieri, Martin Fenech, Josette Sultana and Mark Sant were defence counsel.Lawyers Jason Azzopardi, Eve Borg Costanzi and Therese Comodini Cachia are parte civile.Inspectors Keith Arnaud and Kurt Zahra are prosecuting, assisted by Dr Philip Galea Farrugia, Deputy AG.", "comment_count": 0, "id": 364}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Mobile phones, a device many motorists carry with them while commuting, could be the solution to one of Malta’s biggest challenges – traffic.\nAccording to research by Maurice Saliba, mobile data can help detect and predict traffic patterns for better management, something that the authorities have yet to explore.\nEven when not in use, a mobile phone is constantly sending signals to the hundreds of radio antennas spread out across the island.\nThe frequency of these signals helped Mr Saliba to understand how many people use which routes – and at what time – to travel between home and work.\nMost people switch to WiFi networks when they arrive home or at their workplace, meaning that most use their mobile data while commuting, allowing for a clearer picture of their commute.\nMr Saliba carried out the research for his postgraduate studies, and recently published a paper called Vehicular traffic ﬂow intensity detection and prediction through mobile data usage, together with Charlie Abela and Colin Layfield from the Department of Artificial Intelligence.\n\nMobile data connections recorded at 6am. Swipe from the right side of the image to compare data to one hour later, at 7am. \nThe method developed by Mr Saliba, who manages GO’s service provisioning and support systems, allowed him to understand people’s preferred route to get to work, trip delays and hotspots.\nHe could also use the data to predict traffic flow in the afternoons, which usually reflects that of the morning.\nThe novelty with Mr Saliba’s work is that he focused on data usage, rather than voice calls, which is what is usually used in most cases abroad. The data was anonymised and audited, meaning there can be no traceability and therefore no infringement of data protection.\nThe most commuted road is Aldo Moro in Marsa\n“The method is most effective when it comes to traffic demand, rather than congestion, and needs very little manpower to be applied by the authorities. “It would be especially handy when transport authorities need to change road infrastructure, as they can create alternative routes and the data collected through mobile usage would provide predicted flows.”\nUsing such methods would require incentivising telecom providers to share their data, however, the possibilities were endless.\nThe authorities would even be able to know how many tourists were on the road compared to residents, and also when Gozitans cross back to the island after heading to Malta for work.\nKnow your traffic:\nOn weekends, traffic peaks around noon and late in the evening.\nAfter 6pm trip delays are higher on Sundays than on Saturdays. On Sundays, an average trip delay is 12 minutes while on Saturdays expected delays are eight minutes long.\nDuring the week, the average morning trip delay steadily rises between 6am and 7am.\nThe most commuted road is Aldo Moro in Marsa, followed by Tal-Balal road in San Ġwann and the roundabout that leads to Mikiel Anton Vassalli Road in St Julian’s.", "comment_count": 10, "id": 365}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Nationalist and Labour Party MEP candidates appealed to the hunting and environmental lobbies to find common ground, while insisting the controversial tradition should not be restrained.At a debate organised by Birdlife on Friday PN candidates Peter Agius and Frank Psaila and PL candidates Alfred Sant and Robert Micallef all adopted a near-identical stance when asked about the spring hunting and finch trapping practices, both under sustained pressure from the EU.Labour MEP Dr Sant criticised the “crusade to shut down this pastime” and insisted Maltese hunters faced restrictions that did not exist elsewhere, referring to other member states’ derogations from the Birds Directive.“There has to be a space for the two communities [hunters and environmentalists] to coexist; there is a lot of common ground,” he said. His views were echoed by the PN’s Dr Agius, who said hunters were facing “unfair restrictions” and that a balance had to be struck between conservation and tradition. “Nearly all hunters and trappers want the practice to be sustainable and within the bounds of the law, and Birdlife can be at the forefront of pushing this sustainability,” he said, highlighting a proposal by the hunters’ lobby for a turtle dove breeding programme to replace the numbers shot.His colleague Dr Psaila hit the same notes: a “centuries-long tradition” could not be stopped, hunters should obey the law but should not be deprived of something that brought them joy, the two sides had to “learn to co-exist”.\nSmaller parties speak differentlyOnly the smaller party representatives bucked this trend, with Alternattiva Demokratika chairman Carmel Cacopardo insisting that spring hunting was by definition unsustainable.“I am not willing to discuss or compromise on this point,” he said. “The derogations that are acceptable are those related to safety, agriculture and research, and it is dishonest to portray the spring hunting derogation in that light.”PD candidate Anthony Buttigieg was also unequivocal, saying he would work to end spring hunting if elected. Questioned on party leader Godfrey Farrugia’s more sympathetic stance, he countered that the same Dr Farrugia had worked to reduce hunting hours at Majjistral park. Birdlife CEO Mark Sultana, responding to the candidates’ statements, said the NGO had already agreed to sit down with the hunting lobby to discuss common ground, primarily tackling illegalities. But he called out the two parties for placing the responsibility on NGOs when, he said, they should be showing the way by working together to ensure genuine protection for the environment. While dominated by the hunting issue, the debate also touched on questions ranging from emissions and climate change to the protection of ODZ (outside development zone) areas and the Gozo tunnel. Moderator Nathaniel Attard from Birdlife said the organisation was disappointed that of 41 MEP candidates who had been sent a list of questions about their positions on environmental issues, only six had responded.\nOther than those on the panel, only a handful of candidates took up the invitation to attend the debate: AD's Mina Tolu, independent candidate Arnold Cassola, Felix Busuttil (PL), Antoine Borg (independent) and Martin Cauchi Inglott (PD).", "comment_count": 21, "id": 366}, {"keywords": "", "author": "Claire Caruana", "article_body": "Updated at 3pm with video\nBrexit lead negotiator Michel Barnier said on Friday that the EU was open to being “more ambitious” in talks, if the UK wished. Addressing a press conference with Prime Minister Joseph Muscat, Mr Barnier told journalists however, that it was crucial to protect the EU’s fundamental principles, even when being more “open” during talks with the UK. “An orderly Brexit is the best possible start for a new and close relationship with the UK. In any case, UK will remain an economic partner,” Mr Barnier said. Thanking Malta for its part in the negotiations, Mr Barnier said that following talks with the government earlier on Friday morning, he would also be meeting various stakeholders in order to ensure there is open dialogue. On his part, Dr Muscat reiterated that ball is firmly in Britain's court, adding that he “really and truly” hoped that talks in the UK would lead to a decision that would “unblock the situation”. “We have a very good level of preparedness both in the case of a deal or no deal scenario. I believe that we will continue to work in this direction with very concrete plans,” the Prime Minister said.\nVideo filming courtesy of Newsbook.", "comment_count": 9, "id": 367}, {"keywords": "", "author": "", "article_body": "Weeks of surveillance have led a massive haul of cannabis plants, with two Maltese men expected to be arraigned in the coming hours.\nPolice said that the Drug Squad arrested the men – aged 22 and 34 from Cospicua – after 130 kg of the plants were found in a garage in Żejtun.\nAn inquiry was opened by duty magistrate Natasha Galea Sciberras, while police investigations are still under way.", "comment_count": 0, "id": 368}, {"keywords": "", "author": "Keith Micallef", "article_body": "Plans to expand the Panorama Hotel in Mellieħa have been scaled down by the developer who is now proposing to build one and not three additional storeys.\nThe proposal fuelled controversy amid concerns it would create an eyesore, distort the village’s skyline due to its close proximity to the parish church and result in overdevelopment.\nLocated on the top of a ridge, the five-storey hotel built in 1966 commands breath-taking views of Għadira Bay.\nV&C Developments filed an application last August to build two additional storeys and, subsequently, submitted fresh plans to include an additional penthouse level.\nApart from residents, the Mellieħa council had also objected to the development on grounds it would breach the height limitation adjustment policy for hotels. Though the latter allows for two extra storeys or even more in certain circumstances, the council had argued that the development in question did not qualify for such extension as its footprint was below the minimum requirement.\nObjections had also been raised by the Superintendence of Cultural Heritage, which noted the hotel’s “extremely prominent” location would “further negatively impact” long-distance views of the nearby Grade 1 scheduled parish church.\nThe developer has now submitted fresh plans showing that the project has been scaled down to just one additional floor. The applicant is citing a development permit issued in 2010, through which the planning authority had already given the green light for an additional floor, on condition this would be receded. This condition had been deemed crucial, as the planning watchdog had originally refused the request. Following an appeal, the decision had been overturned on grounds that the construction of an extra floor would not be considered as an additional storey as long as it would be receded.\nMoreover, the permit stated that if the hotel would cease operations, the recessed floor would have to be removed. For some reason, this project did not materialise and was shelved.\nNine years down the line, this permit is being invoked to justify the building of an extra floor, even though the exiting proposal would still result in the development of the entire footprint.", "comment_count": 0, "id": 369}, {"keywords": "", "author": "", "article_body": "Joseph Muscat is using “classist and racist” rhetoric that runs directly counter to socialism to justify some workers’ disastrous working conditions and salaries, left-wing activists Moviment Graffitti said on Friday.The Cleansing Department hard at work in Sliema.\nDr Muscat argued on Thursday that he did not want Maltese citizens to be “picking up rubbish” or doing manual work in the sun.\n“Every job should be dignified but I do not want a situation where the foreigner is comfortable and the Maltese breaking their backs,” Dr Muscat said in a televised debate with Opposition leader Adrian Delia.\nThe comments incensed many, including Moviment Graffitti activists, who argued that Dr Muscat was trying to make “classist and racist” distinctions between workers and giving big business the impression that foreign labourers were somehow intrinsically less valuable than Maltese ones.\n“It is disgusting to try to divide workers based on their nationality, to protect the interests of the wealthy minority which is exploiting workers to fatten their pockets,” Moviment Graffitti said.\nDuring the televised debate, Dr Delia continued to deride Dr Muscat’s Labour Party as the “socialist” party – a label that Moviment Graffitti said the Prime Minister was not worthy of wearing.\nMentalities like Dr Muscat’s, the group said, are the opposite of everything socialism represents. Socialism seeks to ensure that all work is dignified and that all workers are respected, irrespective of their origins, because all work and all workers are needed and important,” the group added.", "comment_count": 177, "id": 370}, {"keywords": "", "author": "", "article_body": "An underwater video has captured the shocking state of the water and seabed in Kalkara, prompting Partit Demokratiku to call for a stronger ERA that can enforce the protection of the environment and monitoring of projects.\n“A permit for works at Esplora (PA/04834/18) has led to waste in the waters of Kalkara and therefore Partit Demokratiku is asking whether the terms of any contract made for the works have been breached, and why the permit was given in the first place should there have been no proper provisions to protect the harbour. While the ERA has cleared illegally dumped waste aboveground, there is waste underwater which persists,” the party said.", "comment_count": 25, "id": 371}, {"keywords": "", "author": "", "article_body": "The scheme set up to collect electric and electronic waste from Malta – WEEE Malta – managed to collect 1,500 tonnes of white goods in 2018, an increase of 40 per cent over the previous year.\nHowever, while the collection for recycling of items like fridges and television was very effective, many other items like washing machines, cookers and air-conditioners were ‘disappearing’ unless they were being collected by the producers in the scheme.\nWEEE Malta was set up three years ago and ensures that this waste is recycled either in Malta or overseas where appropriate. However, the rate of collection and recycling is still well below the EU targets.\nOver 6,000 tonnes of white goods were sold in Malta last year.", "comment_count": 2, "id": 372}, {"keywords": "", "author": "", "article_body": "Lifesaving medicine for diabetics that costs up to €130 is not yet on the national formularly despite multiple appeals by healthcare professionals, MEP Francis Zammit Dimech has noted.\nDr Zammit Dimech, who co-chairs the EU diabetes working group, urged the government to follow in the footsteps of other EU member states, such as the UK, in making GLP-1 Agonists and SGLT2 inhibitors available to public healthcare patients, and not just privately.\nDr Zammit Dimech, who is contesting this month’s MEP elections, also said that many families with diabetic children were still waiting to receive continuous blood glucose monitors, despite government promises to make these available.\nCGM can help kids to monitor their sugar level without needing to prick their fingers several times a day.\nRead: Diabetics should get free needles, says Zammit Dimech", "comment_count": 11, "id": 373}, {"keywords": "", "author": "", "article_body": "Journalists, students and academics got a crash course in social media giant Google's news tools during a workshop on Thursday afternoon. \nThe Google search and verification workshop covered verification, data visualisation, advanced search techniques and how to find and use real-time search data in stories.\nPresented by Abigail Edge, Google News Lab's Teaching Fellow for the UK and Ireland, the event was organised by Google, Times of Malta and the University of Malta’s Faculty of Media and Knowledge Sciences.\nThe Google News Initiative is the social media giant's effort to work with the news industry to help journalism thrive in the digital age.\nKeep in touch with events organised by Times of Malta through our Facebook page.\n\n ", "comment_count": 0, "id": 374}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Former MP Charlo Bonnici is chairing an internal disciplinary and ethics board appointed by the Nationalist Party to probe the conduct of Herman Schiavone who suspended himself from the parliamentary group last month.\nDr Schiavone made the decision after it emerged he and general council president Kristy Debono met Tumas Group CEO Yorgen Fenech, who also owns Dubai company 17 Black.\nParty insiders told the Times of Malta that the board is formed of “close collaborators” of leader Adrian Delia. They included former MP Michael Asciak, administrative council president David Stellini and Nazju Abela, an activist from Rabat.\nNo formal announcement has been made by the PN so far.\nThe disciplinary board, the sources said, would summon Dr Schiavone and then decide whether disciplinary action should be taken against him. However, nothing was likely to happen before the MEP and local elections later this month to avoid having the controversy surfacing during the campaign, they added.\nContacted yesterday, Dr Schiavone said he had not yet been summoned by the board.\nInsisting there was nothing wrong in meeting Mr Fenech and asking him for a conference sponsorship, he said that he felt “serene”.\nNothing wrong in meeting Mr Fenech\nThe meeting, which was revealed by The Sunday Times of Malta last month, led to harsh criticism, particularly among party activists.\nAccording to a leaked e-mail, 17 Black had been indicated by Nexia BT as one of the companies transferring funds to secret Panama companies set up by Tourism Minister Konrad Mizzi and the Prime Minister’s chief of staff, Keith Schembri, after the 2013 election.\nParty activists had called for the resignation of both Dr Schiavone and Ms Debono, arguing that a party fighting corruption could not be taken seriously by the electorate if, at the same time, its MPs were seeking sponsorships from the owner of 17 Black who also formed part of a consortium involved in the controversial Electrogas power station deal.\nDr Schiavone had specified that he had come up with the idea of having meeting the Tumas Group and that neither Dr Delia nor Ms Debono were aware he would be meeting Mr Fenech.\nThe last time the PN had set up a disciplinary board was shortly before the PN leadership contest to looking into allegations associating Dr Delia with suspected money laundering operations and proceeds from prostitution.\nThe party administrative council had called upon Dr Delia to reconsider his candidacy after the ethics committee concluded that though it was mindful of Dr Delia’s professional secrecy, there were aspects of the allegations that were not clear and needed to be explained, including an alleged Barclays offshore account in his name in Jersey and the source of those funds.\nDr Delia went ahead with his candidacy and won the leadership race.", "comment_count": 19, "id": 375}, {"keywords": "", "author": "", "article_body": "Updated at 4.30pm\nIndependent MEP candidate Arnold Cassola will boycott two successive episodes of TV talk show Xarabank, saying the format discriminates in favour of Malta's two major parties. \nProf. Cassola announced his decision on Friday morning, saying in a statement that he would play no part in the \"sham\" programme set up by Xarabank presenter Peppi Azzopardi. \nXarabank will dedicate two successive episodes to the MEP elections. Each of the shows will feature three PN candidates, two PL candidates and one activist on the panel. \nIndependent candidates and candidates from smaller parties will be relegated to the audience, Prof. Cassola said. \n\"To compensate, Peppi [Azzopardi] and company offered me the possibility of driving some sort of go-kart or answering fast YES/NO questions ..... but not on politics! To bring out the human element, they said. How sweet!” Prof. Cassola wrote.\n\"They have five years to bring out the human element in you and they do nothing.\"Then they want to bring it out during a political campaign, three weeks before elections. Enjoy your sham show tonight and next week, Peppi.”\nAlleanza Bidla will also boycott show\nWithin hours of Prof. Cassola's boycott announcement, Ivan Grech Mintoff's Alleanza Bidla said it would also not feature, calling the programme a \"tool\" used by the powers-that-be. \n\"They wanted to give us four minutes to explain our views. This is an insult,\" said Mr Grech Mintoff. \n\nXarabank is Malta's longest-running TV talk show, and remains one of the most popular shows on local television. ", "comment_count": 40, "id": 376}, {"keywords": "", "author": "Jacob Borg", "article_body": "A crocodile skull, bears and lynx skins, a boa constrictor and shortfin mako shark jaws were among the items seized last year by the Environment and Resources Authority after being imported illegally.\nThe ERA admits in its 2018 annual report the trade of certain species and artefacts was a challenge.\nThe regulator, which carries out inspections at points of entry and departure in a bid to quell the illegal trade of such items, said 70 per cent of such operations concerned movements outside the EU.\nIn 2016, the government launched a crackdown on the importation of poison- ous and venomous pets as well as other dangerous animals such as cheetahs, jaguars, leopards, lions, tigers and pumas.\nThe environment watchdog conducted 305 inspections in special areas of conservation. The annual report said 303 investigative cases were logged and investigated in 2018, up 180 per cent over the 168 registered the year before.\nThe trade of certain species and artefacts was a challenge\nThe regulator’s responsibilities also span environmental compliance of industrial sectors, including oil and fuel terminals, power stations, hotels, fuel stations, fish-farms and quarries, among others. It said such compliance work was based on a risk management system, which took various factors into account, apart from ad-hoc circumstances that had to be dealt with.\nThe ERA conducted 228 inspections on permitted facilities last year and a further 255 inspections resulted from reports or complaints. A total of 212 cases were logged and investigated, an increase from the 153 of 2017.\nIt also evaluated more than 90 blast monitoring reports concerning hard-stone quarries and analysed 184 reports submitted as an obligation emanating from permits it issued.\nInspections at sea on fish farms were carried out nearly on a daily basis during the summer months and early autumn, the report said.\nChairman Victor Axiak noted in the annual report that the ERA’s work continued unabated in spite of financial and other constraints.\nProf. Axiak told the Times of Malta this week the regulator faced challenges as part of its growing up process. These included budgetary constraints and human resources and, during its first three years, the watchdog went through a “phenomenal” recruitment process, he noted.", "comment_count": 3, "id": 377}, {"keywords": "", "author": "Claire Caruana", "article_body": "Whistleblowers continue to face significant challenges when coming forward with information, a report by the Council of Europe concluded, pointing to the case of Maria Efimova as an example.\nThe assessment of the state of freedom of expression in member states was issued to mark World Press Freedom Day, being celebrated on Friday.\nAccording to the report, which evaluates the findings of the Council of Europe’s monitoring mechanisms and bodies throughout the previous year, while the European Commission proposed a directive on the protection of whistleblowers reporting on potential breaches of European Union law, in practice the situation was different.\n“Whistleblowers continue to face significant challenges. In January 2018, Cyprus issued a European arrest warrant against Maria Efimova, a former employee of a Cypriot bank who had provided information to Daphne Caruana Galizia, the late Maltese journalist who was killed in a car bomb attack in 2017.\nIn possession of information about corruption\n“Ms Efimova left Malta in August 2017, reportedly fearing for her life after giving evidence on allegations involving supposed business dealings of the Maltese Prime Minister’s wife. Ms Efimova has applied for asylum in Greece, where courts have so far denied Malta’s extradition requests,” the report comments.\nMs Efimova made the headlines in connection with her claims to Ms Caruana Galizia that Prime Minister Joseph Muscat’s wife, Michelle, is the owner of the once-secret company, Egrant. A magisterial inquiry concluded last year there was no evidence that Dr Muscat or his wife owned the company.\nMs Efimova has successfully resisted efforts to be extradited to Malta from Greece to face court proceedings instituted against her by Ta’ Xbiex-based Pilatus Bank, whose licence was withdrawn by the European Central Bank after its former chairman was arrested in the US in connection with allegations of money laundering and fraud.\nThe government branded whistleblower laws it enacted in 2013 as “the best and most robust” in Europe. However, MEPs have been pushing for better protection in all member states, including Malta.\nA former official of the government’s anti-money laundering unit (FIAU), Jonathan Ferris, who was sacked before his probation period was up, had initiated legal action against the authorities after being denied whistleblower status.\nIn a judicial protest, Mr Ferris, who had also served as police inspector, had said that the whistleblowing unit within the Office of the Prime Minister had asked him to reveal all the information he had in hand before being granted whistleblower status.\nHis lawyers say he is in possession of information about corruption, abuse of power and money laundering that took place over the past few years and still persisted.", "comment_count": 127, "id": 378}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe Times of Malta followed the televised debate between the prime minister and Opposition leader, and leads with the former's statement that the Maltese should not have to do the lower paid jobs like picking litter. It also reports that in spite of some protections, it is still not easy to be a whistleblower.\nThe former story was also picked up by The Malta Independent, with the topic of immigration being hotly debated. The newspaper also quotes the head of the Malta Development Association, Sandro Chetcuti, who had said four years ago that developers should make hay while the sun shines, but that this time was now over.\nIn-Nazzjon also leads with the debate, saying that Opposition leader Adrian Delia was solid, prepared and decisive.\nL-Orizzont reports that Larimov Muscat was appointed head of its youth section, and disagrees with In-Nazzjon's assessment of Dr Delia's performance in the debate, saying he was uncertain while Joseph Muscat was determined.\n ", "comment_count": 0, "id": 379}, {"keywords": "", "author": "Claire Caruana", "article_body": "Prime Minister Joseph Muscat said he would rather see foreigners, rather than Maltese, carry out certain non-skilled jobs, such as picking up rubbish or doing manual labour out in the sun.\nDr Muscat made the contentious statement during a televised debate on Thursday night with Opposition leader Adrian Delia ahead of the European Parliament and local elections later this month.\n“I want the Maltese youths to get the skilled jobs. If I had to be given a choice, I would want Maltese workers to be managers or doctors. I would want them to move ahead as teachers and then I would get those helping workers in the sun to be foreigners.\n“If possible, I do not want the Maltese to be picking up rubbish from the streets. Every job should be dignified but I do not want a situation where the foreigner is comfortable and the Maltese breaking their backs,” Dr Muscat said during the debate on TVM weekly show Extra.\nQuick to react to Dr Muscat’s claim, Dr Delia said that this was a “fundamental statement” which translated to “a classist system”. This, he added, was not what the Nationalist Party wanted, insisting that instead it was crucial that the country’s limitations are acknowledged.A fundamental statement... which translated to a classist system- Adrian Delia\nRebutting claims by the Prime Minister that he was being “inconsistent” in his claims and was attempting to scare people with an influx of foreigners, Dr Delia said he had no problem with anyone settling on the island, as long as the government had a plan on how to handle such a situation.\nRead: 'Clans' of foreigners are 'making society poorer' - Delia\n“No, this is not a contradiction. We have an electoral manifesto and we were very precise on this. We need to be just with those who really do need our protection. But we have to be tough on those who abuse those who are most vulnerable.\n“The government has created new niches and sectors, and that’s good, but this sort of economy is not sustainable. The impact on the country is great. We are being told this economy is not sustainable. We want the government to tell us whether studies on the carrying capacity have been carried out,” Dr Delia insisted.\n\n'I'm not against independent murder inquiry'\nMoving on to calls for a public and independent inquiry into the murder of journalist Daphne Caruana Galizia, Dr Muscat said he was never against such an inquiry. What he did not want, he claimed, was two inquiries at the same time which could undermine each other.\n“We want to get to the bottom of who was behind the murder,” Dr Muscat said.\nOn this point, Dr Delia quickly fired questions at the Prime Minister, asking him why he had insisted that he would resign if there were any links to the Panama company Egrant but then would not sack his chief of staff Keith Schembri and Tourism Minister Konrad Mizzi, after it was revealed that they had opened secret companies.We want to get to the bottom of who was behind the murder\nDr Muscat replied: “First of all, there is the will of the people. But then there are the inquiries by Dr Delia’s predecessor that are still under way. I could have come here and listed all the allegations against you, as your predecessor would have done. Now, I expect you use the same scale on yourself.\"\nMass transport system 'only way forward'\nOn traffic issues and solutions to the problem, Dr Delia said a PN government would take measures by not introducing so many new cars on the roads every day, reiterating that the economy cannot continue to be made stronger “by growing the population”.\nHis party believes modes of mass transport systems were the way forward.\n“We will come to a situation where public transport will be free. This is our goal and we will keep our promise on this. The Opposition believes in mass transport systems.\"\nBut the prime minister said such a system would necessitate masses of people unless taxes were to be raised.\nAsked whether the result of the upcoming elections serves as an electoral test, Dr Delia reiterated that he would continue leading the party no matter the results, insisting he had a duty to the members who trusted him to lead the PN to the next general election.", "comment_count": 386, "id": 380}, {"keywords": "", "author": "Denise Grech ", "article_body": "The number of migrants arriving in Malta by boat skyrocketed following unrest in Libya, with the number reaching 1,455 last year compared to 23 in 2017.\nStatistics by immigration police show that boat arrivals decreased drastically from 2015 (104 people) to 2016 (25 people), but shot up last year.\nAlmost a quarter of the arrivals were children (23 per cent), with 65 per cent of those arrivals being unaccompanied minors, data provided by immigration police showed.\nThe figures, published by the United Nations High Commissioner for Refugees, provide a snapshot of the situation of migration since 2018. During the past year, Malta has been a protagonist of several stand-offs with Italy over taking in rescue vessels stuck at sea.\nThe burden-sharing system adopted by Malta in several ad-hoc agreements has “resulted a lot of anxiety,” European Asylum Support Office interim leader Jamil Addou said.\nMalta and Italy have both shut their ports to a number of NGO ships. This has resulted in some rescue vessels being unable to save lives fleeing persecution in Libya.\nMost of the nationalities arriving to Malta were Sudanese (28 per cent) and Bangladeshi (17 per cent), the figures show.\nSpeaking during a debate on migration at Europe house, Integra’s Maria Pisani said the results highlighted that people will move “as long as there is desperation”.\nIn a press conference prior to the debate, the UNHCR called for responsible rhetoric and constructive dialogue on migration in the run-up to the European elections in three weeks’ time.\nThe latest Eurobarometer polls show the vast majority of Maltese once again listed migration as the top-most concern at EU level.\nDuring the debate, UNHCR representative to Malta Kahin Ismail said it was “quite understandable” that communities may have apprehensions and anxieties about newcomers. It was also understandable that people would feel concerned over the government’s plans for migrants’ integration, he added.\nFaced with domestic pressure, including the upcoming MEP elections, countries have taken a stronger stance on migration, Mr Addou added.\n“It is the responsibility of all of us, and particularly elected officials, political parties and prospective candidates to use responsible rhetoric when discussing issues of migration, asylum and refugees, because words matter and they do impact the various communities in Malta,” Mr Ismail said.", "comment_count": 0, "id": 381}, {"keywords": "", "author": "Keith Micallef", "article_body": "Days after insisting that the situation of illegal dumping of animal waste in sewers was under control, the Water Services Corporation has changed tack saying it would be sealing manholes.\nThe change in approach came in the wake of the disruption caused at its largest sewage treatment plant at Ta’ Barkat in Xgħajra, which processes 80 per cent of Malta’s sewage.\nThe plant had to be shut down for a number of hours after being clogged with all sorts of animal waste ranging from a cow’s carcass, pigs’ heads and large quantities of fish originating from unlicensed aquaculture operations.\nA police investigation has been launched.\nThe operation involved cleansing the sewage gallery leading to the plant and pumping station, and the removal of tons of material which caused the clogging.\nFortunately, there was no damage to core plant infrastructure as the screening equipment served its purpose.\nSealing of manholes part of a number of other measures\nApart from resulting in raw sewage being discharged into the sea, the plant’s temporary closure affected farmers as it halted the production of new water – the term used for a class of water produced from wastewater used for irrigation. \nWatch:Sewage plant back up and running following massive clean-up\nA fortnight ago, WSC CEO Richard Bilocca told the Times of Malta that despite persistent abusive practices such as the dumping of slurry and other waste in sewers, the situation in Malta was under control.\nMr Bilocca had made this point when asked why the corporation had not installed similar equipment to that at its only plant in Gozo, which could process slurry separately from domestic waste.\nThis apparatus at the Ras il-Ħobż plant in Għajnsielem, is capable of converting a bowser full of slurry to a skip-load of solid waste in just 15 minutes. Since the turn of the year, when this equipment came into operation, incidents of illegal dumping in Gozo had stopped, while the plant itself was consuming less power and producing less sludge.\nThe WSC CEO had insisted that for the time being there was no urgent need to install similar equipment at Ta’ Barkat and the small plants at Sant Antnin in Marsa-scala, and Iċ-Ċumnija in Mellieħa.\nMr Bilocca had said that in Malta other systems had been devised to stabilise the situation.\nThe WSC has now taken the drastic decision to seal thousands of manholes to prevent illegal dumping. Such a measure had been taken in Gozo prior to the installation of the new equipment.\nReplying to questions from the Times of Malta, a WSC spokesman said the sealing of manholes would be part of a number of other supportive measures similar to the ones implemented in Gozo.\nHe added that, more drastic measures could be in the pipeline, if certain abuses persisted.", "comment_count": 6, "id": 382}, {"keywords": "", "author": "", "article_body": "The only way to control a drunk passenger on a recent Ryanair flight to Malta was for two other men to “pin him down to the ground” for a large part of the flight, according to a witness.\nAn RTÉ reporter who happened to be on the flight from Dublin to Malta described the scene as “quite scary”, with many passengers “inebriated” before take-off.\nMany of the 180 passengers on board were heading for a dance festival in Malta. \nBrawls broke out during the flight, punches were thrown and another man was held up to the window of the plane by his neck, Kieran Dineen said.\nHe recounted how people would not settle into their seats as the plane was preparing to depart, and that once in the air, a considerable amount of duty free liquor was bought and consumed.\nPeople were jumping in and out of their seats with some passengers shouting at the stewards or giving them “hand gestures to show that they weren’t really interested in what they thought”.\n“There was one man handing out a big bottle of vodka for people to take sips out of. So it was quite scary because there was always the chance that things would spill over,” he told Irish media.\nThe airline issued a statement saying: “Crew on Dublin to Malta flight requested police assistance upon arrival after several passengers became disruptive in flight, the aircraft landed normally and the police removed and detained these individuals.\nThe airline said it would “not tolerate unruly or disruptive behaviour at any time and the safety and comfort of our customers, crew and aircraft is our number one priority. This is now a matter for local police”.\nTwo men were arraigned on Wednesday charged with drunk and disorderly behaviour. They were each fined €1,500.\nThere was another arraignment on similar lines on Thursday  relating to an incident on an Air Malta flight. The passenger, who was tipsy, interfered with the crew’s inflight duties and caused a disturbance, was a 21-year old Briton.\nHe pleaded guilty and was also fined €1,500, the court taking note of his early guilty plea, full cooperation with police and the fact that the prosecution did not insist upon an effective jail term.", "comment_count": 0, "id": 383}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A driver allegedly told two police officers he was not scared of running over two police officers, claiming his cousin has already run over an officer in the past.\nJustin James Grima, the 24-year old driver from Tarxien, was granted bail on Thursday.\nHe was arrested on Easter Saturday afternoon on St Joseph High Road in Ħamrun after being stopped by a traffic policeman in connection with the dark tinted windows of his Mitsubishi Shogun.\nThe man allegedly refused to obey legitimate police orders, sparking off an incident. He persistently refused to hand over his van keys and ended up knocking over a police motorbike before ultimately being arrested.\nHe was arraigned on Easter Sunday, pleading not guilty to multiple charges, including threatening the two police officers, willfully damaging the police motorbike, reckless driving, refusing to obey legitimate police orders, breach of peace and a number of other driving offences.\nDuring the first hearing of the compilation of evidence last Friday, the court had heard how the driver had told the officers at the scene of the incident that he had allegedly been ferrying a sick child to the Floriana health centre.\nOne of the officers had testified to noticing a woman seated next to the driver of the Mitsubishi, with a young child on her lap, when he had first approached the vehicle and the driver lowered his window.\nThe driver had dropped off the woman and child at the Mile End area before making a U-turn, ignoring police orders to stop.\nWitness was visibly uncomfortable \nAs the compilation continued on Thursday, one civilian witness, a woman working at a nearby shop, recounted under oath how on that particular afternoon she heard a commotion outside and had ventured out of the shop where she spotted “an angry man” arguing in an agitated voice with a police officer.\nThe woman, visibly uncomfortable at the witness stand, identified that man as the accused and recalled how she had noticed a number of other officers on site but had gone back inside the shop after being told to do so by the police for her own safety.\nA number of officers testified over their involvement in the incident, one sergeant, who had arrived on site after receiving a call for assistance, recalling how he had asked the accused to hand over his ID card.\nThe man had duly obeyed, refusing, however, to hand over his keys, fearing that the police would seize his van.\nAs the hearing drew to an end a fresh request for bail was upheld against a deposit of €4,000, a personal guarantee of €20,000, an order to sign the bail book three times a week and to abide by a curfew.\nThe accused is also to be monitored by a probation officer and to address his anger management problem. The court further issued a Protection Order in favour of the policemen involved in the incident.\nThe case continues in June.\nInspectors Pierguido Saliba and Matthew Galea prosecuted. Lawyers Franco Debono and Amadeus Cachia were defence counsel.", "comment_count": 0, "id": 384}, {"keywords": "", "author": "", "article_body": "The driver of a motorcycle ended up in hospital after a collision with a car on Labour Avenue in Marsa.\nThe police said that the accident occurred at 1.45pm.\nThe motorcycle was being driven by a 39-year-old man from Paola, while the car was being driven by a 50-year-old person, also from Paola.\nInvestigations are still under way.", "comment_count": 0, "id": 385}, {"keywords": "", "author": "", "article_body": "The EU has managed to make tremendous inroads into fighting and banning single-use plastics – but the time has come to take the fight across the world, MEP Roberta Metsola has warned.\n“We have to revolutionise our thinking on single-use plastics. In Europe we managed to push through a ban on most plastics, but we need to take that thinking global. We need a universal treaty to end the environmental disaster caused by single-use plastics,” she said, echoing calls for a Global Treaty to ban most plastics.\nThe call for a new treaty was first floated by EPP lead candidate Manfred Weber during his visit to Malta a few days ago.\nA dramatic 90 of plastic waste that finds itself in our seas comes from sources outside Europe.\n“As the world did when it came to climate change, we need to come together in the war on plastic and find lasting solutions. We are the first generation of politicians who know the extent of the damage caused and we are already the last generation who can do something about it. We must be ambitious and we must be bold.”\nThe MEP Metsola called on Malta and Gozo to become the first Mediterranean plastic-free islands.", "comment_count": 7, "id": 386}, {"keywords": "", "author": "", "article_body": "The Cleansing and Maintenance Division within the Secretariat for Consumer Rights, Public Cleansing and Support for the Capital City has invested in human resources, machinery and cleaning equipment to increase efficiency in cleaning and maintaining Valletta.\nThe bulk of the €250,000 investment was spent on three new low emission vehicles, which comply with a legal notice that came into force last year which regulates how, at what time and what type of vehicle must collect waste.\nThe other €50,000 worth of investments include a pedestrian mechanical sweeper, water bowsers so that streets and pavements can be washed at night, and specific machine for pavement cleaning.\nSeveral waste containers, including a side container for recyclable waste, and a number of ashtrays were also installed.\nA number of workers have been specifically assigned to clean the streets of Valletta any time during the day, while technical staff were also recruited. Interventions were made to repair and maintain street furniture, traffic bollards, paving, fountains, rainwater drains and decorative light bulbs.\nAnyone who encounters the need to report illegal waste can make use of the Cleansing and Maintenance Division mobile app ‘Clean and Upkeep’ or the freephone 1718.", "comment_count": 22, "id": 387}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Years of putting up with parked caravans in Mistra have driven a restaurateur up the wall, forcing him to pack up his business and consider leaving Malta.\nClaude Camilleri has been losing clients since campers started parking their caravans just outside his terraced restaurant around 2008.\n“People come to dine here for the view and instead end up eating right next to caravans, rowdy people barbecuing and swearing.\n“We have flagged the issue with ministers, the Malta Tourism Authority, the police and the local council among others, and even filed a criminal complaint against the police for their lack of enforcement,” he said.\nMellieħa mayor John Buttigieg told Times of Malta that while motor caravans could park by the side as they have a road license and insurance, the owners cannot place barbecues, chairs, tables and other beach furniture beside the vehicles, or pull out an extendable canopy.\nMeanwhile, towed caravans need a parking permit, and the council does not issue permits for such campers anywhere in the locality.\n“The council has drawn the attention of the police and Transport Malta as it’s an issue of enforcement,” he said.\nThe mayor added that every year beachgoers complained to the council that public space was being taken up through summer by these caravans, their extendable furniture and canopies.\nFor Mr Camilleri, the lack of enforcement showed a sense of impunity.\n“I have given up. We renovated the place two years ago, investing tens of thousands, but we have decided we will move abroad. This is an issue that has been dragging on for years,” he said.\nCaravans and campers have already descended on Mistra Bay\nMr Camilleri said that the planning authority had even issued an enforcement notice in 2011, and that the issue of caravans becoming a permanent feature at Mistra Bay was also detrimental to bathers.\nIn 2013, a Times of Malta report had prompted PA enforcement officers to request two caravan owners to leave from the foreshore.\nThis order was given in accordance with the enforcement order issued two years before. Back then, according to the authority, the onus to remove the rest of the caravans rested on the police as they were on the road.\nAt the end of August of 2013, the PA had issued eviction orders ordering the dismantling of tents along the foreshore at Mistra and Armier.", "comment_count": 147, "id": 388}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Three teenage party goers had their partying plans cut short on Wednesday when they landed themselves on the wrong side of the law, pleading guilty to the unlawful possession of drugs upon their arraignment on Thursday.Bradley William James, Paul Bailey Mullarkey and Grace Olivia Murray, all 19-year old British citizens, were arrested while partying at the Splash and Fun Park, the venue of one of several parties taking place around the island at Wednesday’s public holiday.Members of the Drugs Squad dispatched to the particular venue, had arrested the three youths after finding them in possession of psychotropic and other restricted drugs.A search had also been carried out later inside a room shared by all three suspects at a St Paul’s Bay residence, the prosecution explained, when outlining the circumstances leading up to Thursday’s arraignment.All three were charged with unauthorised possession of ecstasy and ketamine. Mr James was separately and additionally charged with possessing cocaine without proving that the drug was for his personal use.All three were arraigned separately, pleading guilty to the charges.Mr James, who had possessed fixed ecstasy pills and 1.237 grams of the other drugs, was conditionally discharged for two years. Mr Mullarkey and Ms Murray, who had possessed larger amounts of the illicit substances, were fined €950 and €875 respectively, which fines were to be paid immediately.\nThe young lady, huddled in a light throw which covered up her beachwear, was crying throughout most of the hearing.\nHer crying resumed upon hearing that she was to pay an €875 fine immediately to obtain her release from preventive arrest. Apparently, she did not have sufficient means to pay it there and then.When meting out punishment the court, presided over by magistrate Natasha Galea Sciberras, took note of the accused’s early guilty plea, their full cooperation and the amount of drugs found in their possession, further ordering the destruction of the drugs.Inspector Justine Grech prosecuted.Lawyer Francine Abela was legal aid counsel to all three youths.", "comment_count": 0, "id": 389}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Two foreign-owned firms are expected to share the profits from some €70 million worth of public road-rebuilding contracts, outpricing major Maltese competitors who are now fuming, Times of Malta is informed.\nIn contrast, industry sources pointed out, taxpayers should be relieved knowing they would save millions of euros because a Turkish and a Sicilian company were likely be doing the job considerably cheaper than Maltese contractors would have done.\nInfrastructure Malta issued a €70 million call for tenders last February for the rebuilding of about 150 roads as part of the government’s €700-million pledge to redo all thoroughfares.\nBecause of the volume of work involved, the tender was divided into six lots, so contractors could bid for different jobs, allowing them to share the work with others. However, the sources said, at the closing date of this tender, it resulted that the various Maltese consortia formed specifically for the project had submitted bids that cost much more than those of foreign competitors.\nThe difference in the offers is not a few thousands\nThe indications were that Turkish firm, Excel Sis Enerji Uretim Construction, whose major shareholder is based in Istanbul, would likely snatch four of the lots, as its offer was about €20 million below the cheapest price quoted by the competing Maltese consortium, the sources added.\nThe other two lots were expected to be allocated to Building Energy Technologies Ltd, a firm owned by two Sicilian businessmen from Agrigento. In this case, the sources noted, the bid was about €12 million, or €6 million per lot, cheaper.\nTimes of Malta was told that Maltese businessmen, with apparently no track record in the road-building industry, could be involved as partners with the Turkish company. However, no further details were immediately available.\n“Maltese road builders, including the big guns, such as Bonnici Brothers, Polidano, Schembri, Penza and others, were promised by the powers-that-be before the last election they will get so much work they would not even manage to do it all,” the sources said.\nSome of them invested tens of millions of euros in new facilities, including tarmac batching plants, in an attempt to get as much work as possible.\n“However, as things are turning out, although they still get contracts worth millions in direct orders on ‘minor’ jobs, the most lucrative work is ending up being done by foreign firms because they (the Maltese) are too expensive,” the sources commented.\nMaltese road-building contractors are known to have protested with both the Prime Minister and the Transport Minister about this state of affairs. According to the sources they were informally told that, since the jobs involved EU procurement rules, there was not much that could be done.\nOfficials at Infrastructure Malta told this newspaper the prices being quoted by foreign firms indicated that Maltese contractors could well have been overcharging the government for years.\n“The difference in the offers is not a few thousands. We are speaking of many millions for the same jobs,” one official said.\nThe tender is still being evaluated by the Contracts Department and no announcements have been made so far. However, the industry sources said they would be very surprised if the foreign firms were not successful given their much cheaper bids.\nThis is not the first time Maltese road builders have been outpriced. Last year, Maltese companies lost a €40-million contract for the building of the Marsa junction to another Turkish firm, Ayhanlar Yol Asfaltlama.\nTrinita JV, a consortium formed of RM Construction Ltd, V&C Contractors and Schembri Barbros, had vehemently complained and also unsuccessfully filed an appeal in front of the Public Contracts Review Board.\n ", "comment_count": 99, "id": 390}, {"keywords": "", "author": "", "article_body": "Two tourists sustained serious injuries after they were beaten by two bouncers after they allegedly tried to re-enter a club they had been ejected from.\nAndrew Michael Wunder, 25, claims two security guards attacked him and his friend, when the two tried to get back into the Paceville establishment.\n\"My friend got kicked out when he unbuttoned his shirt because he did not know it breached the rules. I went to tell them to let him back in and apologise but they started getting aggressive and calling us names,\" Mr Wunder said.\n\"I got frustrated and deliberately spilled a drink on the floor, at which point the two bouncers attacked me,\" Mr Wunder told Times of Malta.\nHe also claimed the two bouncers adopted a very \"condescending\" and \"homophobic\" tone when they were addressing the two men. \nThe friend then tried to pull the bouncers off Mr Wunder but was pushed hard into a metal rod erected outside the establishment. \nPhotos uploaded on social media show Mr Wunder's bleeding face, while his friend  sustained arm injuries.\nThe two resorted to help from police patrolling the area but when the bouncer was confronted, the police \"blindly believed\" his version of events.They should only kick me out... not beat me up\n\"He told them that we had been involved in a fight, when that wasn't the case,\" Mr Wunder said.\nAttempts to reach out to the club owner were in vain.\nThe incident upset the 25-year-old, but it did not put a damper on his two-week holiday in Malta. \n\"I think homophobia is one thing, that is hard to change, but the hyper-masculine aggression that the bouncers use with people is a problem. They shouldn’t react this way with people who simply pour a drink on the floor,\" he said.\n\"They should only kick me out... not beat me up,\" Mr Wunder added.\nGay activist Clayton Mercieca, who highlighted the incident online, insisted entertainment bouncers should not resort to violence at every opportunity they get.\n\"This is wrong on so many levels,\" he said.", "comment_count": 52, "id": 391}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A local consultancy group and two of its directors have filed four libel suits against The Shift News and Matthew Caruana Galizia over a series of publications alleging that the group was involved in tax fraud with the prime suspect behind Jan Kuciak’s assassination.\nFollowing the murder of the 27-year old Slovak journalist, shot dead with his girlfriend in February, 2018, Mr Caruana Galizia, whose mother had also been assassinated four months earlier, had tweeted that Marian Kocner, the chief suspect behind Kuciak’s murder, allegedly used Malta for “money laundering and tax evasion”.\nHe alleged that the Slovak businessman had used shell and holding companies set up and administered by lawyer Christian Ellul and accountant Karl Schranz of Ellul and Schranz Group, “a sort of mini Mossack Fonseca”.\nKocner’s daughter had been married to Christian Ellul, but the two had since divorced.\nMr Caruana Galizia had alleged that Kuciak had been investigating tax fraud by Kocner and his Maltese advisors. “Yet nothing was done… and guess who won the fight,” Mr Caruana Galizia had tweeted.\nThose tweets had been taken up by The Shift News, which had posted an article on the same subject titled “The man charged with Jan Kuciak’s murder, his links to Malta and what a safe can reveal,” also retweeting Mr Caruana Galizia’s tweets.\nThe publications prompted the filing of four libel suits, two of them by E&S Consultancy against Mr Caruana Galizia and Caroline Muscat of The Shift News, and two others against Mr Caruana Galizia by Christian Ellul and Karl Shranz respectively.\nDuring the first hearing of all four suits on Thursday, the court, presided over by magistrate Rachel Montebello, dealt with preliminary issues. Since it appeared that Mr Caruana Galizia had not yet been served with notification of the applications filed in his regard, the court adjourned the hearing for further information. As for the other suit, the court granted the respondents 15 days within which to file their reply.\nThe cases continue later this month.\nLawyers Joseph Giglio and Sarah Mifsud are counsel to the applicants. Lawyer Andrew Borg Cardona is counsel to to Ms Muscat and The ShiftNews.", "comment_count": 0, "id": 392}, {"keywords": "", "author": "Keith Micallef", "article_body": "Criminal charges will no longer be issued by the police but by the Attorney General, once a Bill which provides for the setting up of a State Advocate become law.\nThe latter would take over the AG’s existing role of government’s legal counsel.\nDetails of these reforms were announced on Thursday by Justice Minister Owen Bonnici in a news conference during which he launched the Bill.\nThe main objective of the Bill is to split the AG’s existing dual function of prosecutor general and government’s legal advisor. The changes were announced in the wake of the shortcomings flagged last year by a group of experts from the Council of Europe, known as the Venice Commission. \nThe Bill, expected to be published in the Government Gazette in the coming days, also provides for the AG’s Office to take over all court prosecutions in the criminal court of magistrates, which are currently handled by the police. However, such change would not be implemented immediately, but gradually, to enable the AG’s office to have enough staff within its prosecution unit.\nAlthough the Bill was announced a few weeks ago, Dr Bonnici on Thursday spoke about changes in the manner in which the AG and the State Advocate would be appointed.\nOriginally, the government had insisted it would be following the existing model of the appointments being the sole prerogative of the Prime Minister.\nHowever, the government is now proposing to adopt the same mechanism used in the selection of judges for EU institutions whereby there would be an open call and the applicants would appear before a panel of experts. The latter would then make their recommendation to the Prime Minister, who would have the last say on whether or not to take the board’s advice. \nDr Bonnici pointed out that Peter Grech will remain Attorney General when this reform came into force. Another change was that the AG would have the right to inquire with the police on the state of any pending investigation.\nThe Justice Minister said that the Bill addressed another shortcoming flagged by the Venice Commission with respect to the existing system whereby the same person who investigated decided whether to file charges.\nConsequently, the issuance of charges would be taken over by the AG’s office. “This will bring Malta in line with European best practices,” he said.\nAlthough this Bill will be amending the Constitution, Dr Bonnici noted that none of the proposed provisions would require a two-thirds parliamentary majority to be approved. He added that it was the government’s intention is to have it approved by Parliament before this rose for the summer recess. \nAs in the case of the AG, the State Advocate would have security of tenure and it would only be possible to remove him from Office through a two-thirds Parliamentary majority. Both institutions would eventually be housed in the building which until recently housed the museum of fine arts in Valletta. This building is currently being renovated. ", "comment_count": 6, "id": 393}, {"keywords": "", "author": "", "article_body": "The Democratic Party will be able to use the party's orange colour next to its candidates' names on ballot sheets, despite protests from the Labour Party.\nPD lodged its request with the Electoral Commission to be assigned the orange colour for the European Parliament elections. However, PL claimed that the colour could be confused with its red party colour.\nThe party said it has been known as Tal-Oranġjo since its foundation, with the colour orange being registered as its official colour and nowadays forming part of its identity.\n\"In fact, many are those who know the party as Tal-Oranġjo rather than as Partit Demokratiku. Orange was even adopted by parliament’s website to represent PD MPs and other matters pertaining to the party.\"\nPD pointed out that Labour had persisted in its objection, even when, in a spirit of compromise, it accepted to be represented by a shade of orange other than its own.\n\"This colour is clearly distinct from red and confusing one with the other is inconceivable. It is also worth mentioning that there are other features in the ballot paper that distinguish one party from another.\"\nAccording to the electoral law, the assignment of colours to the various parties is at the Electoral Commission’s discretion.\nPD said it appreciated the fact its arguments were taken into consideration and thanked the commission for accepting its request. \nReason prevailed, it said, adding that in a climate of political tribalism, PD continued to strive to offer a ray of hope to the Maltese people.\nArnold Cassola's logo by Ġorġ Mallia\nMeanwhile, Arnold Cassola, who has fought a separate battle to have his logo on the ballot sheet, said the decision by the commission to allow independent candidates a logo was a historic first.\nSo far, the law has been mistakenly interpreted as allowing logos for party candidates only, the independent candidate said.\nProf. Cassola contested the interpretation, adding that the ballot sheet actually specified that the logo was the \"badge of candidate\" and not the \"badge of party\". \n\"Some of the by now well-known party trolls have rushed to denigrate the Cassola logo, in their attempt to minimise the little blow suffered by the two-party establishment that, till now, has always decided on who could sport a logo or not.\"", "comment_count": 14, "id": 394}, {"keywords": "", "author": "", "article_body": "Alternattiva Demokratika has filed an objection to the proposed construction of a six-floor hotel in Għadira.\nMellieħa council candidate Luke Caruana and chairman Carmel Cacopardo said the objection was being submitted primarily because the proposed hotel fell within the valley and was outside development zone.\nMr Caruana said valleys should be protected and outside development zones should not be considered for development under any circumstance. Development areas were already too large and there was no reason to extend them for commercial interests to the detriment of the environment.\nThe proposed construction was located right next to the Omm il-Ħniena cemetery.\nThis created additional issues with the development application. If approved, it would impede possible extensions to the cemetery which by its very nature can only exist in an ODZ.”", "comment_count": 1, "id": 395}, {"keywords": "", "author": "", "article_body": "Din l-Art Ħelwa welcomed the publication of the draft Policy Guidance for Fuel Stations and stressed that no further development permits for fuel stations should be granted until this was finalised.\nThe new policy is intended to repeal that of 2015, which enabled the unnecessary take-up of land outside development zones by fuel stations causing damage to arable and undeveloped land without ensuring proper benefit to the community, the NGO pointed out.\nRead: Fuel stations review: Quo vadis?\nThat policy, it said, was an example of poor planning and manifested a lack of respect for the country’s fast diminishing open spaces.\nWhile welcoming the draft policy, Din l-Art Ħelwa regretted the inordinate length of time it took the Planning Authority to publish it for public consultation and urged the government to ensure it was now given priority and concluded in a timely manner.\nThe granting of a permit for the construction of a fuel station at Burmarrad only days before the policy was issued was a sorry example of bad management and the lack of a holistic vision by the authorities, it said.\nRead: Revised fuel stations policy better, provided 'loopholes are removed' - Graffitti", "comment_count": 3, "id": 396}, {"keywords": "", "author": "", "article_body": "A new doctors' group has been set up, saying it would advocate for safe, accessible, comprehensive, evidence-based reproductive healthcare in Malta, including safe access to abortion,\nIn a statement, Doctors for Choice Malta, a group of anonymous \"independent medical professionals\", said women continued to be denied true autonomy over their bodies.\nMalta has the strictest anti-abortion laws in the world, making it a criminal offence for any woman seeking access to it.\n\"They are deprived of their right to seek safe, high quality healthcare. Women who require abortion services do so because of unique, and often complex, medical, psychological or social reasons. Malta's present legislation results in a violation of human rights and denial of patients’ right to safe health services. This ultimately leads to poorer health outcomes.\"\nThey said that like all reputable international health organisations, which include the World Health Organisation, the Royal Society of Obstetricians and Gynaecologists, the Federation of International Gynaecologists and Obstetricians, they believed that safe access to abortion was a healthcare issue.\nCriminalisation of abortion made it \"dangerous\" for women who needed this health service.\n\"We have established Doctors for Choice Malta to support women’s right to easily access comprehensive, reproductive health services. They should be able to make a fully informed choice on their pregnancy, including the option to choose safe abortion in a controlled, empathetic environment. Women should have the final decision without any interference,\" they said.", "comment_count": 283, "id": 397}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Thursday’s newspapers.\nTimes of Malta says two foreign-owned firms are expected to share the profits from some €70 million worth of public road-rebuilding contracts, outpricing major Maltese competitors who are now fuming. In another story, the newspaper says Maltapost is asking for a 10c tariff increase for single-piece mail items over a three-year period on grounds it has been delivering the service at a loss for a number of years.\nThe Malta Independent quotes Prime Minister Joseph Muscat saying that the vision of his government is based on the three pillars of infrastructure, inclusion and innovation.\nL-Orizzont also leads with the Prime Minister’s May 1 address during which he called on the people to be protagonists rather than spectators.\nIn-Nazzjon leads with statement by PN leader Adrian Delia that the Nationalist Party was the voice of the people.", "comment_count": 0, "id": 398}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Lost Bob Marley records discovered rotting in a London hotel basement by a Maltese businessman will go under the hammer later this month at an auction expected to reach tens of thousands of pounds.\nThe 24-track tapes, known in music circles as “the lost masters”, feature previously-unheard recordings of some of the Jamaican reggae superstar’s greatest songs, recorded live at the Lyceum and Rainbow in London and the Pavilion in Paris in the 1970s.Joe Gatt (right) and Louis Hoover with some of the tapes.\nIt was just chance, and a painstaking restoration process, that saved them from being lost forever.\nTwo years ago, Joe Gatt, who has lived in the UK since 1971, received a call from a friend who worked for a clearing company, informing him he had found some discarded and severely-damaged Bob Marley tapes sitting in cardboard boxes in a waterlogged basement.\nMr Gatt, already a great Marley fan who had been in the audience for the storied 1975 Lyceum performance, immediately knew he was onto a potential treasure but the extent of the damage the tapes had endured made it seem unlikely they could ever be heard in their full glory.\n“There were fragments falling off the reel and white gunge on them,” he told the Times of Malta.\n“I spoke to a friend, Louis Hoover, a jazz singer, who had more contacts in the music industry and we found someone [sound technician specialist Martin Nichols] who said he could restore them.”\nThe restoration was a long road but Mr Gatt eventually sat down to hear the outcome. Bob Marley is one of the best-selling artists of all time.\n“We weren’t expecting much, we thought it would be all crackling. But we heard them and we couldn’t believe it,” he said.\n“We couldn’t believe the beautiful sound that came out when he put the volume up. We just started hugging each other.\n“I feel lucky enough just to have seen Bob Marley live. To find these tapes 40 years later is just amazing.”\nNow, Mr Gatt and the team that has been built to manage the process have decided the time has come for the records to be sold.\n“We want them to go to a good home,” he said.\nThe records will be sold in three lots by Liverpool auction company Omega, which estimates they will sell at £25,000 per lot (€29,000), though some online posts suggest the final price could be double that.\nThat would make it among the biggest sales for Omega, which specialises in music memorabilia and has previously sold unreleased David Bowie recordings for nearly £50,000 and a Bible owned and containing handwritten notes by Elvis Presley for £59,000.", "comment_count": 6, "id": 399}, {"keywords": "", "author": "Keith Micallef", "article_body": "Maltapost is asking for a 10c tariff increase for single-piece mail items over a three-year period on grounds it has been delivering the service at a loss for a number of years.\nThe proposal, submitted to the Malta Communications Authority, was part of a wide-ranging upward revision of tariffs for both domestic single-piece and bulk-mail items.\nThe proposed tariff structure has been published for public consultation, which closes on May 15.\nRead: Maltapost wants stamp of approval for new tariffs\nIn the case of single-piece mail items weighing under 50 grams, which is by far the most popular service on offer, Maltapost is proposing to increase the existing tariff of 26c per item by 4c this year, 3c next year and 3c in 2021.\nOver a three-year period, it would translate to a 10c upward revision or a 38%increase.\nHowever, the highest increase is being proposed for single-mail items between 151 and 200 grams, with the tariff more than doubling from 82c per item to €1.85 by 2021. In its proposal, Maltapost pointed out that this category represented less than one per cent of domestic mail flows.\nDelivering the service at a loss for a number of years\nNo fee increase is being requested for additional weight above 200g, which will remain at 20c per 50g.\nA 29% (12c) increase is being proposed for items weighing between 51 and 100g while a 19% rise is being requested in the next category (101g-200g). Both of revisions are over a three-year period too.\nRead: Maltapost registered mail tariffs more than double\nThe post operator is also asking for a rise in the tariffs of bulk-mail items, which is the term used for a large number of items (50 or more) in identical size and format that are handled directly at a post office counter. In this category, users are charged at a rate lower than single-piece items.\nUnder the proposed tariffs, the increase would be of 25% for items weighing up to 50g and 11% in the 51g-100g category.\nMaltapost submitted that the profitability of mail services had been in decline for years and was only just within the acceptable range of return set by the MCA. This trend was due to annual increases in staff costs and other factors including inflation.\nHowever, the MCA said it had some concerns on the proposed tariffs and was not in agreement with certain aspects. In the consultation document, the regulator said it was carrying out cost-accounting reviews and assessing the compatibility of the proposed changes with ensuring the availability of an affordable service.\nThe changes proposed by Maltapost\n\n\n\nSingle-piece tariffs\nCurrent\nYr 1 (2019)\nYr 2 (2020)\nYr 3 (2021)\n\n\n0-50g \n€0.26\n€0.30\n€0.33\n€0.36\n\n\n51-100g \n€0.42\n€0.50\n€0.52\n€0.54\n\n\n101g-150g \n€0.62\n€0.70\n€0.72\n€0.74\n\n\n151g-200g \n€0.82\n€1.45\n€1.65\n€1.85\n\n\n201g-2kg \n€0.20 (for each additional 50g)\n€0.20 (for each additional 50g)\n€0.20 (for each additional 50g)\n€0.20 (for each additional 50g)\n\n\n \n \n \n \n \n\n\nBulk mail tariffs\nCurrent\nYr 1 (2019)\nYr 2 (2020)\nYr 3 (2021)\n\n\n0-50g \n€0.24\n€0.28\n€0.29\n€0.30\n\n\n51-100g \n€0.36\n€0.38\n€0.39\n€0.40\n\n\n101g-2kg \n€0.20 (for each additional 50g)\n€0.20 (for each additional 50g)\n€0.20  (for each additional 50g)\n€0.20 (for each additional 50g)", "comment_count": 56, "id": 400}, {"keywords": "", "author": "Denise Grech ", "article_body": "A 44-year-old man murdered just a few weeks ago left behind three children in the Ivory Coast, his friends said. \nLassana Cisse was killed on April 6 in a drive-by shooting in Ħal Far that has provoked shock among the migrant community. Two other men were injured in the attack. \nAround 100 friends and well-wishers gathered last weekend to honour the memory of Lassana, who was shot to death by a mystery killer in a crime that has puzzled investigators.\nDuring that event, friends told Times of Malta that Mr Cisse's children had been told of their father’s murder.\nLassana Cisse's friend Ousamane Dicko speaks. Video: Chris Sant Fournier\nKnown to his friends as ‘Lass’, Mr Cisse was described as a gentle man who never had any problems with anyone. \nOusmane Dicko, who had known Mr Cisse since 2011, said people were shocked by the news.\n“What had he done to this person for them to kill him,” Mr Dicko said. “When they kill a person like this, you do not know if tomorrow it is going to be you.”\nWhen they kill a person like this, you do not know if tomorrow it is going to be you\nThe rest of the migrant community now lives in fear, he admitted. The man appealed for the authorities to find the person responsible and ensure that this never happens again. \nAccording to Mr Dicko, migrants are sometimes on the receiving end of comments telling them to “go back to your country” and they are sometimes physically pushed, but violence is now clearly on the rise.\nThe memorial event in Ħal Far was attended, among others, by President Emeritus Marie-Louise Coleiro Preca, who told those gathered that the community had lost “one of our brothers”.", "comment_count": 0, "id": 401}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Prime Minister Joseph Muscat described the forthcoming European Parliament and local council elections as a “choice between hope and fear” during a political rally in Valletta marking Workers’ Day.Dr Muscat continued his attack on the Opposition’s “fearmongering” over immigration, urging voters to choose “inclusion” over “isolation”, while playing up the government’s advances in the social justice sphere over the last five years.“You cannot play the European while seeding fear and hate towards those who are not Maltese,” Dr Muscat said. “This is too similar to the language of the far-right. Our country has always been part of a broader family, but where we used to look outwards for opportunity, now others look to us.“This party brought this country freedom but it understands that freedom is not isolation.”\n\nTaking the stage after speeches by deputy leader Chris Fearne and Frans Timmermans, the European Socialists’ candidate for the post of Commission president, Dr Muscat said the Labour Party remained focused on the three core principles of equality, social justice and social mobility.“We have taken a country with a deficit and turned it into a surplus, not through austerity but through growth,” he said. “We are pro-business because we are pro-work. A country looking for work opportunities has turned into a country looking for workers.”He highlighted the undertaking of the “largest social housing project in 40 years”, and said the government would soon be announcing a further increase in this regard.\nHe also referred to plans to introduce ‘quotas’ to boost female representation in Parliament, which he said would ensure equality of opportunity for young women, as well as measures such as free childcare and school transport, and the removal of exam fees.Poverty, he said, had been cut by two-thirds, and workers’ priorities were turning towards having more time to spend with their families.\nEuropean Commission vice-president Frans Timmermans addresses the crowd. Photo: Jonathan Borg.\nReferencing again the as-yet-undetailed massive ‘open space project’ he has drip-fed in recent days, Dr Muscat said: “We have to figure out how to provide for these new priorities. We would be making a mistake if we did not recognise the new aspirations of a changing society.” Speaking before the Prime Minister, Mr Timmermans said Dr Muscat’s leadership would help Maltese people achieve their aspirations of “better equality, better social justice, better environment, and better public transport”.He also said Malta could show leadership on social justice and equality on an international level, referring to achievements in the field of LGBT rights. “Malta can show how big a small country can be when it comes to fundamental values,” he said.", "comment_count": 144, "id": 402}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Planning Authority has received a new application to develop a 400-year-old garden at the crossroads of the Three Villages in a fresh attempt to forge ahead with a project that has already been refused. \nThe refusal came following a storm of objections to the request to demolish the large garden and the adjacent baroque residence on the corner of Triq Annibale Preca in Lija and Triq Sant’Antnin in Balzan. \nThe original proposal would have seen the excavation of the 17th-century garden measuring around 920 square metres, including protected citrus trees and garden rubble walls, to create eight basement garages and six two-storey townhouses with swimming pools.\nAll of the proposed dwellings are four-bedroom units, having a gross floor area exceeding 200 square metres. Alterations to the existing townhouse, which includes baroque-period architectural features, were also mentioned in the application.\nOn appealing the decision not to grant permission, the developer submitted fresh plans that re-duced the number of proposed two-storey townhouses to three. \nHowever, the garden itself will still be taken over, particularly with swimming pools. \nAccording to industry sources, the Planning Authority cannot consider the fresh plans during the appeal, which is still pending, so the developer filed a separate application with the new plans. \nAccording to the new plan, there will also be an underlying four-car garage. \nThe existing baroque house will also be split up into a number of individual residences. \nThe development is both intensive and extensive\nThe Superintendence of Cultural Heritage had vehemently opposed the project, saying that the site was an established garden forming part of a property “of evident architectural and historical value”.\nMoreover, it said the property was located within the urban conservation area and was in the vicinity of San Anton Palace, which was a scheduled property.\nWorld War II shelters were also recorded in the vicinity of the proposed works, it added.\n“The Superintendence notes that the proposed development is both intensive and extensive, with an undeniable and negative impact both on the property and on the streetscapes in two streets within the urban conservation area,” it added.\nThe Lija local council had also objected to the destruction of the 400-year-old garden at the crossroads of the Three Villages.\nThe council’s was one of 150 objections submitted to the PA, many citing the loss of the historic garden, the increase in traffic and the intensification of development in an urban conservation area, which objectors say will also set a precedent.\nThose who objected to the first application will now need to submit a fresh objection to the new plans.", "comment_count": 12, "id": 403}, {"keywords": "", "author": "", "article_body": "Updated 5.55pm\nPassengers booked on a Ryanair flight to Treviso woke up in the dead of night early on Wednesday to make sure they made it on time for their 6.50am departure.\nTen hours later, they were still at Malta International Airport, waiting for their flight to leave. The flight eventually left at 5.37pm.\n“It’s dreadful,” a passenger told Times of Malta. “They could have sent us home and told us to come back in the afternoon. Instead they told us nothing.”\nFlight plans seemed to have been derailed shortly before take-off, the passenger wrote on Facebook.\nPassengers were herded out of the MIA departures terminal in preparation for boarding.\n“We could see the plane. Little puffs of black smoke kept coming out of it,” he recalled. \nA short while later, an airline representative told passengers to return inside – where they remained all day.\nTimes of Malta sought comment from Ryanair. \nSpokesman Rachel McFaul said: “This flight from Malta to Venice Treviso was regrettably delayed ahead of take-off due to a minor technical issue with the aircraft.\n\"Affected customers were informed by email and SMS text message and provided with three sets of refreshment vouchers, before departing to Venice Treviso later that day. Ryanair sincerely apologised to customers for the delay.”\nWhile many were sympathetic to the passenger's complaints about a lack of communication, others too exception to his post. \n\"Be thankful because in Malta we have incredible and very professional engineers and I'm sure they're doing their best to fix it as soon as possible,\" one wrote.\n\"That time on the ground and delays is costing a fortune to the airline. Nobody wants delays.\" \nUnder EU rules, passengers aboard the flight to Treviso will be able to claim €250 in compensation for the lengthy delay.\n ", "comment_count": 14, "id": 404}, {"keywords": "", "author": "Ramona Depares", "article_body": "As Malta gets ready to rock Tel Aviv with this year’s Eurovision Song Contest entry, the spectre of political allies and strategic voting has already raised its head.\nThis year’s entry is an upbeat, dance-friendly track that will see 18-year-old Michela Pace shimmying to Chameleon in front of thousands. Many are wondering whether it will face the same fate as Christabelle’s Taboo last year.\nHowever, new data released by Casumo reveals a previously-unsuspected ally for Malta – Croatia. The data, which the online gaming company published after analysing the voting records of every Eurovision final between 1956 and 2018, shows that of the 23 times Malta has been given top marks, most times these came from Croatia and Bosnia. \nMalta has, in fact, received more ‘maximum point’ votes from Croatia than any other country in the competition.\nCountry firm believer in good neighbourly relations\nOther countries that appear to give Malta a favourable eye include Denmark, Ireland, Portugal, Slovenia, Sweden and the UK, each of which have awarded Malta top vote twice. \n\nWe were also the favourites for Luxembourg, Norway, Russia, Spain and Turkey once.\nMalta itself seems to be a firm believer in good neighbourly relations, with its biggest favourite being Italy, which was awarded top score five times. Italy is followed by, perhaps unexpectedly, Azerbaijan.\nDisappointingly, the study also showed that Malta does not have a ‘fixed’ points ally that it can count on year after year. In fact, on the list of participating countries, Malta scores a rather dismal 27th for top points.\nTopping the list of top votes received is the United Kingdom, which was the recipient of the most coveted spot 111 times.", "comment_count": 29, "id": 405}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Applications for fuel stations outside development zones that could have been headed towards approval may find a more difficult road ahead under a revised planning policy just published for public consultation.\nThe Times of Malta analysed pending applications and found that nearly all would breach provisions in the new fuel stations policy, under which they will be assessed if they are still there when the policy comes into effect.\nImplementation, however, is at least months away. Should the applications be decided before then, they would benefit from assessment under the more permissive 2015 policy, which first opened the door to the controversial practice of relocating from urban cores to much larger ODZ sites.\n\nPending applications in Birżebbuġa, Żebbuġ, Marsascala and Attard would all seemingly need to be reduced in size by about a third to fit within the new policy’s maximum footprint of 1,000 square metres, compared to 3,000 square metres in the 2015 policy.\nOther applications in Żebbuġ and Mqabba, meanwhile, may fall foul of a new restriction on ‘new’ fuel stations being built on ODZ land. The new policy permits only relocated stations, meaning an urban facility would need to be decommissioned at the same time.\nMoreover, many of these applications propose development on agricultural land, which has been ruled out by the new policy.\nIt is worth noting, however, that the existing policy already contained a prohibition on the use of “good quality” agricultural land and this restriction has been circumvented in the past, most recently with a fuel station approved in Burmarrad last month.\nBefore and now.\nMoviment Graffitti, which has led several protests against such developments and against the delays in the policy review, cautiously welcomed the revised policy.\nThe group warned, however, that there would be no point in proposing changes if pending applications continued to be decided under the old policy, now that this was being ushered out. It called for a moratorium until the full implementation of the new policy.\nIn the 15 months since the policy review was announced, the Planning Authority continued to decide on pending applications.\nHowever, most of these have, in recent weeks, been listed on the PA’s public servers as “suspended”, suggesting they are not being actively processed. By the time of writing, the planning watchdog had not responded to questions on whether it would continue to process these applications.\nThe revised policy is open for consultation for six weeks and could face another consultation period if the PA subsequently makes changes. \nIt would then need to be discussed in Parliament’s environment committee before being approved at ministerial level.\nNote: This is not a full list of all pending ODZ fuel station proposals. Several more do not have full application data available on the PA servers.\n\nTriq L-Imdina, Żebbuġ\nCurrently suspended, the proposal would create a new fuel station on Triq l-Imdina, Żebbuġ. The site, around 2,800 square metres, is partly built up but the ERA says the structures are of dubious legality and that the site’s degradation does not justify the development. As a new station in ODZ, it would likely not be permitted.\n\nTriq Sant’Antnin, Marsascala\nThe Planning Authority approved a 1,500-square-metre fuel station on abandoned agricultural land off Triq Sant’Antnin – relocated from Floriana – in December 2018 but the developers returned just a few months later with plans to extend it by another 1,000 square metres. The application for an extension is suspended.\n\nTriq L-Imdina, Żebbuġ\nCurrently suspended, this application would relocate a fuel station from Triq Testaferrata, Ta’ Xbiex, to about 3,000 square metres of fallow agricultural land. The Environment and Resources Authority has said it would result in the “further deterioration” of the area’s landscape and specifically called for it to await the implementation of the revised policy.\n\nTriq Ħal Far, Birżebbuġa\nUnder this active application, a single fuel pump in Victoria would be transformed into a sprawling 3,000-square- metre facility on agricultural land off Triq Ħal Far, Birżebbuġa. A previous application was turned down as the site was not eligible for a new fuel station. The developer then acquired the Victoria licence and returned with the current plans.\n\nL-Andar Ta’ Fuq, Triq Valletta, Mqabba\nThis application, currently suspended, is for a new fuel station instead of an existing open storage yard and, therefore, within one of the areas specifically designated in the new policy (as in the old one) as suitable for fuel stations. However, as a new station in ODZ, it would nevertheless seem to fall foul of the policy.\n\nTriq Villabate, Marsascala\nCurrently suspended, this proposal involves the relocation of a fuel station from Tal-Qroqq to around 1,800 square metres on the road between Żabbar and Marsascala. The site is not itself agricultural land but is within an agricultural area and surrounded by fields. It is not clear how it would be assessed under the new policy.\n\nTriq L-Imdina, Attard\nThe active application in Triq l-Imdina will relocate a kerbside station in Triq il-Wied, Msida, to about 3,000 square metres of ODZ land. According to environmental studies, it will result in the “permanent loss of potentially good quality agricultural land”. The ERA has objected to its size and location.", "comment_count": 1, "id": 406}, {"keywords": "", "author": "", "article_body": "A man was hospitalised after the horse he was riding died during training at the Marsa racetrack on Wednesday morning.\nPolice said that the incident occurred at 9am, but no details were available as to what could have caused the horse to die.\nThe man was a 59-year-old from Luqa.\nPolice said investigations are still under way.\n ", "comment_count": 0, "id": 407}, {"keywords": "", "author": "Denise Grech ", "article_body": "The tax rebate cheques sent out by the government are an insult and a joke, PN leader Adrian Delia said on Wednesday.\nSpeaking during an interview on Net FM, Dr Delia questioned the timing of the tax rebate cheques sent in the post a few weeks ago. The cheques always came round before an election or if there was \"some battle the government wants to wage\", he said.\n\"People are realising the government is making fun of them,\" Dr Delia said, adding it was a populist move to try to buy off people's vote. The government instead, should look at improving our taxation system, he added.\nSpeaking on Workers' Day, Dr Delia said the government needed to look at better incentives to improve the economy. The government had conceded it needed a long-term plan, with Finance Minister Edward Scicluna admitting authorities were looking to take a more prudent approach to economic growth following unprecedented development.\nThis, Dr Delia said, meant the government justified all that the Opposition has been saying in the past 18 months since he was elected. \nEconomic growth in Malta was like a cake, he said: the cake kept on growing, but people’s slice of the cake remained stuck at the same size. Our wages registered the lowest increase in Europe, while prices for essentials kept going up, he added.\n\"The government has not succeeded to govern in giving people their equal share,\" he concluded.\n'A fight between Nationalism and Socialism'\nDr Delia obliquely addressed comments by Prime Minister Joseph Muscat that the upcoming May elections were a choice between the two party leaders.\nThe choice, the Opposition leader insisted, was between the Nationalist and a Socialist party.\nThe government will not change following the European Parliament elections, however, the election could trigger a change in the government’s attitude, Dr Delia reiterated.\nThe Prime Minister \"does not want to accept this fight,\" he said. \"[Dr Muscat] did not support the EU and he did not support local councils,\" Dr Delia said. The Prime Minister recently told supporters local councils were never his \"favourite thing\".\nThe European Socialist and Democrat Party, which the Maltese Labour Party formed a part of, supported abortion and tax harmonisation, Dr Delia warned. A vote for Labour MEPs would signal support for these two measures, he added.\nMEPs’ work was also crucial to defend Malta by criticising the government on a European level, he said. The government has captured the police force, the Armed Forces and a number of other institutions, he added.\n“It is fundamental that we have at least three MEPs that can protect us,” he said.He encouraged people to go out and vote for change.\n'Prioritise Maltese agriculture,' Delia tells Manfred Weber\nEuropean People’s Party head Manfred Weber promised to prioritise helping Maltese agriculture if elected as president of the European Commission, Dr Delia said.\nThe government wants to destroy farmers, farms and the fishing industry, the PN leader warned.\n“With tears in their eyes, farmers have told me [the industry] does not have another 10 or 15 years left,” Dr Delia added. Unlike the government, the PN was making a strong declaration that it supported Maltese produce.\n\nLabour 'afraid of challenges'\nThe Labour party was always afraid of challenges – first by saying EU membership would be too challenging and then by taking power away from councils, Dr Delia said.\nSpeaking on the 15-year anniversary of EU membership, Dr Delia said the PN had always shown trust in its youth, in workers and in small businesses.\nFrom the 1980s onwards, the PN had always shown that trust in the Maltese workforce was fundamental, he said.\nDr Delia ended his interview by encouraging people to donate to the party’s ongoing fund-raising marathon, saying the party did not have a government that could use its resources for its campaign.\n“We depend on people’s generosity and participation,” he said.", "comment_count": 53, "id": 408}, {"keywords": "", "author": "", "article_body": "Independent MEP candidates will be allowed to have their logos on this month’s electoral ballot, the Electoral Commission has told Arnold Cassola.The decision was made following a complaint filed by Prof. Cassola, who is running as an independent MEP candidate in the elections.\nProf. Cassola had contested the Electoral Commission’s reasoning that logos could only be displayed alongside the names of candidates belonging to political parties.Prof. Cassola pushed to have his logo included on ballot sheets.\n“Hats off to the Electoral Commission,” Prof. Cassola said. “Despite being all nominated by the PL and the PN, the members of the Commission – when confronted by my strong arguments – decided to eliminate the disadvantage independent candidates faced\".Article 49 (6) of the General Elections Act allows candidates to display their badge before their name on ballot sheets “indicating the political party, if any, to which the candidate belongs”.\nOpinion: What I stand for - Arnold CassolaProf. Cassola had argued that nothing in that article suggested that independent candidates were precluded from displaying a logo on ballot sheets. “You are saying, by way of example, that ‘doctors deserve a pension; therefore anyone who is not a doctor does not deserve a pension’. This is absurd reasoning,” he wrote in his plea. His appeal must have resonated with commission members, who informed Prof. Cassola that independent candidates would be allowed to display their logo on ballot sheets.Maltese go to the polls to elect their European Parliament members on May 25.", "comment_count": 9, "id": 409}, {"keywords": "", "author": "", "article_body": "Two passengers were fined €1,500 each for being drunk and disorderly on a plane.\nThe men, a 23-year-old from Ireland and a 23-year-old Briton, were charged on Wednesday in front of magistrate Ian Farrugia with hindering the airline crew who were trying to carry out their duties, and with disturbing public peace.\nThe prosecution was led by inspector Silvio Magro.\n ", "comment_count": 0, "id": 410}, {"keywords": "", "author": "Denise Grech ", "article_body": "The Nationalist Party on Wednesday called for industries with \"higher value added\" investment, reiterating calls for a long-term plan in economic growth. \nSpeaking on Labour day at the party headquarters, PN MP Karl Gouder said the economic plan being pushed by the Labour government would create trouble for the country in both the short-term and long-term. \nThe government was depending on population growth for economic growth, Mr Gouder said, adding that foreign workers being brought into the country were not being treated well. It was unacceptable that workers were being paid as little as €1 an hour, he added. \nDespite economic growth, EU data show wages in Malta had the lowest increases, he added.\n\"We expect that in a good economic climate, we would be doing better than this,\" Mr Gouder said.\nMEP candidate Michael Mercieca reiterated calls for sectors with higher value-added investment, saying industries should not depend on workers with lower wages to thrive. \nTurning to statistics showing Malta had the second number of early school leavers in Europe, Mr Mercieca said the country needed to ensure there would be no \"skills-gap\". \nStudents and workers should be able to compete for high-level jobs with high wages, Mr Mercieca said. ", "comment_count": 26, "id": 411}, {"keywords": "", "author": "", "article_body": "Malta would not be allowed into the European Union if it were applying for membership today, Simon Busuttil has argued.\nIn a Talking Point published on the 15th anniversary of Malta’s membership to the EU, the MP and former Opposition leader writes that Joseph Muscat’s government “has eroded our democratic pillars to such an extent that, were we a candidate for membership today, they would simply not let us in”. The front page of the Times of Malta on March 10, 2003, when EU membership referendum results were announced.\nEU membership – “the single most important episode for our country since independence,” Dr Busuttil writes – has changed the course of Maltese history and opened up doors which would otherwise have remained shut, he writes.\nThe MP, who served as the head of the Malta-EU Information Centre during accession talks and went on to serve as an MEP, nevertheless reveals a measure of disappointment in the way the EU handled rule of law concerns about Malta.\n“I expected the EU to be quicker and stronger in helping us fight the corruption,” he writes, noting that Brussels could also have done more to help Malta on immigration and on the “scandalous” citizenship scheme.\nMalta’s experience, he argues, suggests that the European Union imposes anti-corruption and good governance requirements on applicants seeking to join, “but then lets down its guard after they join”.\nNevertheless, he notes, having EU citizenship is “priceless” and the balance 15 years on is undoubtedly positive.\nThe MP takes a dig at those who vocally and vehemently opposed EU membership, saying that 15 years on the Labour Party’s talk of “partnership” and a “Switzerland in the Mediterranean” deal still ring hollow.\n“Not a single country has a partnership with the EU on the lines they promised 15 years ago,” he notes, adding that Brexit negotiations had proven how futile it was for a country to try and get the benefits of EU membership without actually joining.\nDr Busuttil also takes a dig at those who spearheaded that opposition and who now use the EU to their personal benefit.\n“In a textbook case of hypocrisy and opportunism, the anti-EU brigade, led by Alfred Sant and Joseph Muscat, have now shamelessly jumped on the EU bandwagon,” Dr Busuttil writes.\nRead Simon Busuttil’s opinion piece in full.", "comment_count": 112, "id": 412}, {"keywords": "", "author": "Keith Micallef", "article_body": "An application has been filed for a nine-storey aparthotel comprising 118 rooms, underground parking and shops on a tract of agricultural land in Mellieħa, outside the development zone.\nSpanning over an area of 5,550 square metres, the proposed development lies in Marfa Road, adjacent to the cemetery dedicated to Our Lady of Mercy.\nCarol Peralta is listed as the applicant, while the project’s architect is former Labour Minister Charles Buhagiar who owns Med Design Associates Ltd.\nNationalist Party MP Robert Cutajar sounded the alarm bells on this application filed last March, through a Facebook post uploaded on Tuesday.\nWhile branding such proposal as “obscene” he announced that he would be raising the matter in the House of Representatives through a parliamentary question.\nMr Cutajar, a former mayor of Mellieħa, has asked Planning Minister Ian Borg, whether the authorities will be considering this application favourably or not.\n\nHis reaction prompted an immediate response from Labour MP Clayton Bartolo, a former Mellieħa councillor, who expressed himself against this development due to its location on ODZ land.\nThe developer is proposing to excavate the existing site for the construction of a three-star aparthotel and ancillary facilities comprising 38 parking spaces at basement level, four shops, a restaurant, two bars and lounges, a gymnasium, and two pools. Though the application states that there will be 118 rooms over six floors, plans submitted so far indicate that the overall height of the building will be nine storeys. The applicant is also pledging to landscape the area and carry out maintenance on existing rubble walls.\nThough no objections to the planning authority had yet been submitted by the time of writing, the initial feedback on Facebook was negative, due to concerns of over development and loss of virgin land.\nPrior to this application, this particular site had already been earmarked for a similar development in 2008, but the application had been withdrawn.\nConcerns about over development in this locality have been fuelled by a recent controversial decision to approve an eight-storey hotel, within a residential zone on the other side of this village close to Selmun.\nThough this development by J Portelli Projects which includes 120 residential units, shops, a hotel and underground parking was recommended for refusal as it breached the height limitation policy of this area, the Planning Authority board overruled the case officer’s opinion. This controversial decision was justified on the grounds of a separate policy which allowed a degree of flexibility when deciding such applications. Subsequently, the Mellieħa council decided to file an appeal.\nMeanwhile, a further application this time to increase the Panorama Hotel to eight storeys is still pending. This proposed development had also prompted fierce objections from residents, amid concerns that its close proximity to the parish church, and its location on top of a ridge would create an eyesore.", "comment_count": 32, "id": 413}, {"keywords": "", "author": "Jacob Borg", "article_body": "Efforts by the Environment and Resources Authority continued unabated despite “financial and other constraints”, its chairman, Victor Axiak, said in an annual report. \nThe ERA was set up in 2016 after the planning and environment functions that used to be carried out by the Malta Environment and Planning Authority were split up. It is now the government entity on the frontline of protecting Malta’s environment.\nThe environment watchdog levied 11 administrative fines on individuals, commercial companies and parastatal agencies, totalling €157,845, last year\nContacted by the Times of Malta to elaborate about the constraints he mentioned, Prof. Axiak said the ERA faced challenges as part of its growing up process as a new regulator. These included budgetary constraints and human resources and, during the first three years, the watchdog went through a “phenomenal” recruitment process, the chairman said.\nSuch fast recruitment, he said, evidently led to challenges such as how staff would mature on the job and come to grips with the often complex environmental issues. As a new regulator, the ERA had to earn the respect of other entities, specific sectors of the community and the public, Prof. Axiak remarked.\nThe annual report delves into the findings of the 2018 state of the environment report and acknowledges the pressures being placed on the environment by the country’s growing population. This meant more waste was being produced and more traffic congestion, impacting the environment.\nThe challenge, the environment watchdog pointed out, was to find low-impact solutions that sustained the requirements of a high population density.\nThe state of the environment report confirmed that waste, excluding that emanating from the construction industry, was a challenge that could be tackled with action being taken in the sector. This was partly because so much of Malta’s consumables and food was imported, meaning more packaging was necessary than if such goods were made locally.\nThe regulator recalled that the report showed Malta was doing “incredibly well” in some areas.\nMarine protected areas now covered 11 times the size of Malta and 93 per cent of all bathing waters were of excellent quality.\nOne of the most welcome results of the report showed there was a 98 per cent increase in environmental expenditure by the government on the 2008 level.\nThe environment watchdog levied 11 administrative fines on individuals, commercial companies and parastatal agencies, totalling €157,845, last year. These covered various contraventions, including non-abidance with permit conditions, pollution of the sea and removal of trees.", "comment_count": 28, "id": 414}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Wednesday's newspapers\"\nThe Times of Malta reports that the Environment and Resources Authority is being hampered by a lack of resources. It also says that the fate of pending fuel stations applications is in the balance.\nL-Orizzont leads with the GWU's call for all workers to received double pay when they work on Sundays and public holidays. It also features its president's message for May 1, Workers' Day.\nIn-Nazzjon says that in spite of the opening of a criminal inquiry into chief of staff Keith Schembri, the Prime Minister is not calling on his to resign as he had previously promised.\nThe Malta Independent chooses the same story, adding that minister Kornad Mizzi will also not stand down in spite of the criminal action being taken. It also reports that a former magistrate has applied to build a hotel in an ODZ area of Mellieħa.\nMalta Today leads with a report that the construction watchdog is still at the White Paper stage, and also quotes Jeffrey Pullicino Orlando's positive reaction to a court's decision that the blog posts of the late Daphne Caruana Galizia were 'intrusive' and 'gosship'.", "comment_count": 0, "id": 415}, {"keywords": "", "author": "", "article_body": "Maltese beekeepers are missing out on EU subsidies due to the “copy paste implementation” of European rules that make no distinction between small member states and larger countries, an MEP candidate has lamented.   \nPeter Agius, who is running on the Nationalist Party ticket in the forthcoming May 25 election, levelled this criticism when meeting beekeepers. \n“Rules designed for Poland and France, where the average agricultural holding is 100 times bigger than Malta’s are making it impossible for them to tap into the €125 EU funding subsidy per bee box,” Dr Agius said. \nHe added that EU rules could have been adapted to suit the needs of the apiculture industry in Malta, as part of the ongoing efforts to protect home-grown Apis Mellifera Rutneri, which is an endemic bee particularly well suited to Malta. \n“Instead, we have a copy-paste approach, forcing beekeepers to move bee boxes every year with a view to promote an objective, which makes sense in France but is totally ridiculous in Malta,” he said. \nWhile EU rules foresee bee box movements to ensure wider pollination on holdings spanning kilometres, in Malta such a measure is “futile” given that a bee can travel five kilometres and the existing bee boxes cover Malta and Gozo’s pollination needs 10 times over. \nMoreover, Dr Agius noted that Malta’s implementation measures required evidence of a title deal with the farmer, which he said was very difficult to obtain. Such restrictions meant that Maltese beekeepers could not tap EU funds, he said.\nThe MEP candidate called on the Maltese government to adapt European Union rules to the needs of various economic sectors in collaboration with MEPs who could also amend EU legislation. \nDr Agius warned that failure to do so could lead to disenchantment about the benefits of European Union membership, and ultimately lead to confrontation with Brussels.", "comment_count": 10, "id": 416}, {"keywords": "", "author": "", "article_body": "Police sergeant Simon Schembri will be resuming duty within the police force as from Wednesday, months after a horrific hit-and-run incident, the police said.\nIn a post on Facebook, the police said PS Schembri will be helping the Community and Media Relations Unit, particularly through school visits and talks.\nNamed Officer of the Year in January, the 48-year-old traffic policeman lost an arm in 2018 when he was dragged several metres under a car in a hit-and-run after he tried to stop 17-year-old Liam Debono, who was speeding.\nThe youth stands charged with attempted murder and is out on bail after pleading not guilty to the charges.\n ", "comment_count": 22, "id": 417}, {"keywords": "", "author": "", "article_body": "The acute shortage of social housing units within the government’s stock of properties has meant that last year only one out of every 27 applicants on the waiting list was successful. \nIn 2018, the Housing Authority allocated 116 properties, which was less than half the number of social housing applications received during this period – which totalled 286. \nLooking at the bigger picture, however, the situation is grimmer as the overall number of pending applications has reached 3,172 – 27 times the number of units allocated last year.\nMeanwhile, schemes launched in 2018 in a bid to increase the government’s stock of properties for those in need had modest success. \nOne of these incentives was to encourage elderly people who had moved to retirement homes to return their government property to the authority in return for receiving a 20 per cent increase in their pension. However, this measure only yielded 14 properties.\nIn 2018, a separate scheme was launched where owners of vacant private properties would receive a grant to restore them, in return for hiring out the same dwelling to the Housing Authority for a 10-year period. Only 29 applications were filed, of which 10 were accepted and a further 11 were still pending. \nEnforcement was by far the most successful measure adopted by the authority as it yielded 87 properties. \nThe sharp rise in population has accentuated the problem\nIn such cases, the authority would take back the dwellings on the strength of periodic inspections to determine if the tenants were those entitled to live there, and that no unauthorised use was being made of the same property. \nThough the issue of social housing goes back decades, the sharp rise in population, mainly due to the influx of foreign workers, has accentuated the problem, as properties are becoming less affordable. \nAccording to a recent study by KPMG, the estimated overall growth in price level of properties increased between 20 and 25 per cent between 2016-2017.\nFaced by this situation, the government has launched a massive investment to build over 1,000 units across the country. \nNonetheless, it is still facing criticism that no short-term measures are being taken as this project is still a long way from materialising. \nMeanwhile, the social housing waiting list keeps rising. However, the authority stepped up its efforts to support tenants renting private properties through an annual subsidy of up to €2,000 each. Last year, 2,186 applicants benefitted with the overall amount of subsidies increasing by €868,000 over 2017, up to €2.4 million.", "comment_count": 9, "id": 418}]