[{"keywords": "", "author": "", "article_body": "The following are the main stories in Monday's newspapers.\nTimes of Malta reports that the doctors’ lobby highlighted concerns over a Malta-based online medical school during a recent meeting with education minister Evarist Bartolo.\nThe Malta Independent says a proposed solar farm in an Mġarr quarry would have more than 17,000 solar panels. \nOrizzont quotes Prime Minister Joseph Muscat discussing the Labour Party's plans to ensure further growth.\nNazzjon quotes Opposition leader Adrian Delia's calls for the new President to be one that can ensure unity in the country.", "comment_count": 0, "id": 1319}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Michela Pace is on her way to the next Eurovision song contest in Tel-Aviv after winning the first season of X-Factor Malta but it is not yet clear how the song she will present will be selected.\nX-Factor producer Anton Attard told Times of Malta on Sunday nothing had yet been established on the process or timings for choosing the song to represent Malta at the song contest in May, including whether this would be an internal selection.\nBoth song and singer have in previous years been chosen together during the Malta Eurovision Song Contest, although in 2016, an international jury panel selected Ira Losco’s song Walk on Water from a shortlist of 10 after the singer had won the national competition with a different song.\nBut with X-Factor replacing the previous competition this year as a means of choosing the singer, the process for selecting the song remains up in the air.\nThat has not stopped the public from putting forward its suggestions, with more than 2,500 people signing a petition yesterday calling for second-placed Owen Leuellen to join Ms Pace at the Eurovision after the rapper cut very good impressions on the final night with a memorable duet alongside his mentor, Ms Losco.\n18-year-old Gozitan Michela Pace beats tough competition\nIt was, however, 18-year-old Gozitan Ms Pace who emerged triumphant on Saturday, beating tough competition in the final round to secure a Sony record deal along with her Eurovision spot.\nShe took top spot ahead of fellow finalists Mr Leuellen, Nicole Frendo and Petra, singing a duet with renowned tenor Joseph Calleja and Lady Gaga’s Shallow, as well as paying homage to her Gozitan homeland with The Tramps’ classic Inti Djamant (you are a diamond) in the second round.\nMs Pace received a hero’s welcome as she returned to Gozo yesterday, after a call from the Gozo Ministry for the public to make their way to Victoria to cheer her on her arrival.\nPoliticians of all hues congratulated Ms Pace for her victory yesterday, with the Labour and Nationalist parties both issuing statements to that effect, along with President Marie-Louise Coleiro Preca.\nHer victory capped the maiden season of the internationally-syndicated show, which took the United Kingdom by storm when it first aired in 2004.\nIts debut in Malta proved an immediate success, with Broadcasting Authority figures released late in 2018 showing it had wrestled TVM top dog status from Friday night staple Xarabank.", "comment_count": 22, "id": 1320}, {"keywords": "", "author": "Ivan Martin", "article_body": "Concerns over a Malta-based online medical school were flagged during a recent meeting between Education Minister Evarist Bartolo and the doctors’ lobby, the Times of Malta has learnt.\nSources said the Medical Association of Malta requested the meeting to voice concerns this could be serving as a back door for doctors with questionable qualifications to work in EU hospitals. It could also pose a risk to the island’s reputation as a centre of excellence in medical training, the doctors’ representatives told Mr Bartolo.\n“This is a matter of concern for us because we want to ensure Malta retains its good international standing as a centre of learning,” Martin Balzan, president of the doctors’ union, said.\nFrank Montgomery, who chairs the Standing Committee of European Doctors, said last week the medical courses via online correspondence had been the topic of discussion at a recent members’ meeting. The German doctors’ lobby has expressed worries about the private medical school its operations.\nThe European Digital University, which runs the online medical school, took umbrage at what Prof. Montgomery said on the matter. In a ‘right of reply’ (see below), it said his comments “unfortunately” cast doubts on the credibility and seriousness of the quality and reliability of the Maltese accreditation system.\nThe EDU was licensed by the Maltese education authorities last year. Its website says that “the innovative EDU study model provides the best possible education in clinical medicine to young people with an intrinsic passion for becoming a physician”.\nMr Bartolo told this newspaper the authorities were being “very rigorous” in reviewing the company’s requests to certify physicians. \nWhile the government was all for innovation, it was also aware that medical education had to be treated sensitively, he said.\nEuropean quality standards\nAll EDU quality standards adhered to the guidelines of the National Commission for Further and Higher Education and were, therefore, based on the European quality standards, Holm Keller, director of the Kalkara-based Digital Education Holdings Ltd, insisted.\nThis is the right of reply he sent to this newspaper on Friday:\n“The main thrust of the article ‘Fears over online “medical school” in Malta’ (January 24) was that of putting forward the views of Frank Montgomery on whose opinion the article is effectively solely based.\n“These views, in essence, unfortunately cast doubts on the credibility and seriousness of the quality and reliability of the Maltese accreditation system. They are also inexplicably dismissive of the method of regulation of innovative digital developments in this sector.\n“It is to be noted that while Prof. Montgomery seeks to cast such doubts, he does not make any comment of the standing and reputation of the private German hospitals that provide the practical training as an integral part of the courses offered by the European Digital University.\n“In putting forward Prof. Montgomery’s views, the article in question states, with reference to the European Digital University, that ‘He said he was informed the company had only decided to come to Malta as it had been informed it would be given the go-ahead by the authorities in a relatively short period of time’. Nothing could be further from the truth.\n“The identification of Malta as an ideal hub for the development of digital technology, with a particular emphasis on the health and medical sphere, dates back to 2012. This is when the promoters of the EDU decided to come to Malta and this was done on the basis of Malta’s publicly-stated pledge and commitment of setting the island as a centre of excellence in research and technological innovation. The choice of Malta was, in fact, solely and exclusively brought about since Malta was the first member State to implement and transpose the EU directive on digital universities into national law and to mandate a national body accordingly.\n“The article goes on to state that ‘Clearance, he remarked, was given in less than two months, again raising concerns of the level of due diligence’. \n“Yet again, this assertion is completely untrue and grossly misleading.\n“The presentation of the application was the final stage of years of planning and presentation that were the subject of detailed and highly-stringent verification and consideration. Far from having been concluded in ‘…less than two months’, the actual accreditation process for the provider and programme accreditation of the Bachelor of Medicine course started on June 21, 2017 and lasted until June 5, 2018.\n“The National Commission for Further and Higher Education licensed the EDU as an institution of higher education on June 5, 2018. As a higher education institution, the EDU is licensed to deliver programmes classified from Level 5 up to Level 6 of the Malta Qualifications Framework, providing that these programmes have been formally recognised and/or accredited by the National Commission for Further and Higher Education.\n“The Master of Medicine programme, which will lead to a degree as a medical doctor, is currently in review according to the accreditation process of the NCFHE.\n“Detailed CVs and publication lists have been provided to NCFHE and a full list of medical teachers can be found on the EDU website online. The medical faculty comprises highly-recognised academic staff from around the globe.\n“All EDU quality standards adhere to the guidelines of the NCFHE and are, hence, based on the European quality standards. The current Bachelor of Medicine programme has followed a rigorous accreditation cycle as set by the NCFHE and followed the Maltese Qualification Framework aligned with the European Qualification Framework.”", "comment_count": 29, "id": 1321}, {"keywords": "", "author": "Ivan Martin", "article_body": "John’s parents had him on a grey October day in 1986.\nThey had him when they were too young and too scared, and most importantly for John, they had him against their wishes.\nJohn’s parents had him, but he never had them.\nThe orphanage that John called home until his 16th birthday had four large external walls and three caring matrons. It had barred windows, creaky ceiling fans and loose floor tiles. In the main hall where meals were served, a large clock tick-tick-tocked the days away.\n“What’s that expression? ‘Time heals all wounds’? Yeah, well it doesn’t,” he tells The Sunday Times of Malta.\nWhile he has mostly fond childhood memories of his time at the orphanage, feelings of abandonment and worthlessness from never knowing his parents have haunted his adult life. \n“It defined me. I was someone not even my mother wanted to know. I didn’t want to know me,” he says.\nWhen John first attempted suicide, adrenaline took over his senses but not the sour scraping of bone-on-bone.\nReaching for a lighter, John’s arm breaks the beam of pale yellow sunlight through the pall of cigarette smoke in his Floriana bedroom.\nHe explains how somewhere between his last leg leaving the table, and his body falling through the air, his resolve to take matters into his own hands had soon turned into regret.\nThe courage of his convictions, he says, had crumbled before his electrical cable-noose had even gone stiff.\nIt is the memory of that instant fear of death, he says, that remains with him today.\nJohn remembers the smells and sights of that day; the taste of iron that filled his mouth when he bit through his tongue, the red-hot heat that burst from his cheeks, and the fetid odour of the cold sweat that ran down his back.\nCertain he had snapped his neck, John said he sat on the floor and felt to see if bone had broken through skin – it had not.\nWhat’s that expression? ‘Time heals all wounds’? Yeah, well it doesn’t\nHis short hanging had lasted all of five seconds, but the story that followed was one of repeated attempts and repeated regrets.\nThis was the start of an abusive relationship with self-harm, he says, that would soon compound his methadone and gambling problems – a behaviour of abuse that now extended to hurting himself to escape chronic depression and feelings of worthlessness.\nHis leg pulsing anxiously, you could easily miss the needle bruising along his arm if another shaft of morning sunlight had not shot once more through the swirling cigarette smoke and landed just above his wrist.\n“I prostituted myself, man. There isn’t much worse than that – to buy drugs and f***ing pastizzi and cigarettes. It makes me feel sick.”\nSurvivors of attempted suicide in Malta are not called survivors, John says, “they are not called anything at all really”.\n“Because, they don’t exist. Maybe on a list in an office somewhere, for professors. But that’s it, people like me are nobodies,” he says.\nJohn said his short stay at hospital after his first suicide attempt saw him walk out of Mater Dei’s front door holding a lighter, some loose change and a two-page pamphlet on mental health awareness – a far cry from the support and comfort he so desperately needed.\n“I didn’t tell them [the medical staff] that it was a suicide attempt and we didn’t really talk about it,” he said.\nThis is not a new problem. Last year Mental Health Commissioner John Cachia warned that men were slipping through the cracks. He sounded a bugle call to the authorities that the country’s focus had to be on increased awareness at an individual level, within families and across society, with early intervention and improved treatment options. Too many men, he warned, were seeking suicide as a way out.\nThe Health Ministry say they have focused their efforts towards improving the provision of mental health at the State hospital.\nPatients presenting cases of self-harm are normally treated at Mater Dei but some others are also admitted to Mount Carmel Hospital. Some are followed by staff at psychiatric outpatients for some weeks. Meanwhile, an outreach team has been introduced to follow people with mental health issues at their own home.\nAt the same time, a liaison psychiatry team takes care of Mater Dei inpatients.\nA specialised nurse leads a team of six psychiatric nurses, two social workers, three nursing aides, three care workers, an assistant psychologist and a clerk at Mater Dei.\n“I don’t know who needs to hear my story, maybe no one,” John said.\n“I just think that if someone is thinking of committing suicide, then they need to pick up their phone and tell someone. And if you wake up in hospital like I did, then tell your doctor that you need real help.” \nSuicide numbers\nSince 2010, Malta’s Crisis Resolution Centre – Malta’s only dedicated institution to suicide situations, has received between 15 and 20 crisis calls every week – many of these are linked to suicide or self-harm.\nSeven years of data collected by the centre shows that on average, around 30 people take their own lives every year. \nThe police have registered more than 200 suicide deaths between 2010 and last year, with the vast majority being men. \nA Suicide Watch dedicated line can be reached on 9933 9966, via the Crisis Resolution Malta Facebook page or by email on crisismalta@gmail.com", "comment_count": 0, "id": 1322}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The busy construction industry and the density of traffic on Malta’s roads make left-hand drive vehicles an added danger, according to the Road Safety Council executive chairman.\nPierre Vella says Malta’s roads are already busy, with more large trucks  around due to the busier construction industry. But the fact that a lot the trucks are left-hand drive is making the roads even more dangerous.\n“Any left-hand drive vehicle, whether commercial or not, is dangerous due to the higher number of blind spots, and this is adding to the danger,” he said.\nMr Vella was contacted following an appeal made by the parents of a motorcyclist crushed by a left-hand drive truck in January 2016.\nMotorcyclist Johanna Boni was run over by a cement mixer in Labour Avenue, Naxxar, at about 8am on January 5, 2016. The 27-year-old was riding her Kawasaki ER6N to work on that fateful morning.\n“I think trucks must be subjected to stricter checks. Trucks must not be loaded more than a certain amount. Left-hand drive trucks must disappear... those which come from abroad must have a co-driver because the blind spot is too dangerous. This is my biggest worry. They are killers on our roads,” Josephine Boni, Johanna Boni’s mother, said.\nMr Vella said that following this case, the council had discussed the imposition of stricter rules but these never saw the light of day. “We discussed them internally as a council but never pursued them,” Mr Vella admitted.\nOne of the aspects they had discussed was the introduction of a co-driver. “We had suggested a co-driver who would be scouting the proper right-hand side of the truck. In other countries, such as the UK, this is already the norm,” he said.\nMr Vella said they also discussed the possibility of having a larger number of external mirrors on the right-hand side which would, to a certain extent, make good for the lack of visibility.\nHe said he believed that left-hand drive vehicles needed to be properly identified as such and the council had discussed the possibility of proper signage, with a big LHD on the back of the vehicle as well as on the right-hand side, so as to warn drivers of the possible dangers and blind spots.\nThe VRT test does not differentiate between right- or left-hand drive trucks. Neither do Transport Malta’s statistics make any distinction, with sources close to the transport watchdog saying that there were no statistics on the number of LHD trucks currently registered to drive on Malta’s roads.\nAccording to the Royal Society for the Prevention of Accidents in the UK, in 2011, 18 people were killed, 47 seriously injured and 720 slightly injured in road accidents involving foreign-registered left-hand drive heavy goods vehicles.\nIts research indicated that left-hand drive vehicles are 3.4 times more likely to be involved in crashes than right-hand drive vehicles. They suggested better mirrors that reduce the driver’s blind spot to be fitted and were behind schemes to supply free Fresnel lenses to drivers as they enter the country.\nThe EU is also discussing a new regulation of trucks to replace the bottom panels of the driver’s and passenger’s door with glass so as to see any cyclists or motorcyclists.  \nThe third Joanna Boni memorial ride was held today.", "comment_count": 36, "id": 1323}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Marouska Pisani Bugeja, who until two years ago was a top official at the PN’s media arm, was recently put on the government’s payroll with a financial package of over €34,000 for a part-time role, The Sunday Times of Malta is informed.\nMs Pisani Bugeja was recruited directly by Parliamentary Secretary for EU Funds and Social Dialogue Aaron Farrugia, without a public call, to advise him on “matters related to communications”.\nAaron Farrugia’s new advisor Marouska Pisani Bugeja.\nHowever, the 36-year-old has kept her full-time job as business development manager at WeMedia, the company which produces TV programmes for the State broadcaster, including the popular programme Xarabank.\nAsked whether her full-time job, which involves seeking new business opportunities for WeMedia including sponsorships and adverts, and her job with the parliamentary secretary might put her in a conflit of loyalties, a spokeswoman for Dr Farrugia said “Ms Pisani Bugeja has no conflict of interest”.\nPoliticians, particularly novice ones like Dr Farrugia, are known to be keen to appear on mainstream TV stations and popular programmes in order to boost their political profile.\nSources close to Net TV, the PN’s TV station, told the newspaper that many were surprised by the sudden departure of Ms Pisani Bugeja from her top post at the station in 2016.\nAs Dr Farrugia’s advisor, Ms Pisani Bugeja is contracted to work 30 hours a week for the parliamentary secretary and is paid €18.23 per hour. She is also entitled to a communication allowance of €815 a year and a car allowance of €4,659 per annum, boosting her part-time job remuneration to over €34,000.\nAsked to state what expertise Ms Pisani Bugeja holds when it comes to EU funds and social dialogue, Dr Farrugia’s restricted portfolio, the spokeswoman did not reply.\nHowever she said that Ms Pisani Bugeja has “18 years of experience in the media industry”.\nAs a parliamentary secretary, Dr Farrugia already employs a full-time official as a communications coordinator whose job description includes media advice. A former Malta Today reporter was employed in this job.\nLast year, after her appointment with the parliamentary secretary, Ms Pisani Bugeja was also made company secretary of Dot Media & Consulting Ltd, a private media company owned by Duncan Pisani and Kearon Bruno, the vice-president of the Forum Zgħazagħ Laburisti.\n ", "comment_count": 109, "id": 1324}, {"keywords": "", "author": "Fiona Galea Debono", "article_body": "The application for a huge development in Pietà is forcing renowned Italian director Marco Pagot to rethink his plan to turn an elegant scheduled house into a ‘meeting point for artists’\nA Milanese director’s “dream” to rehabilitate a scheduled historical home in Malta is being dashed as he faces the unexpected development of a massive block of flats behind his Guardamangia villa.\nA Planning Authority application to build 114 apartments in St Monika Street on the site of two modernist houses and part of a garden has shaken the foundations of Marco Pagot’s hefty investment to buy, restore and transform Casa Gwardamangia into a “meeting point for artists”, having immediately and instinctively perceived the potential of this old house.\n“I do not exclude the possibility of abandoning the project after two years of research,” said a disillusioned Mr Pagot, a renowned director, screenwriter and creator of TV programmes, who has worked around the world, producing series and books. “Maybe, if necessary, I could apply these to another pro­ject in another place,” he conceded\n“I did not choose to live in Pietà to find myself swamped by a block of seven floors. This project in St Monika Street, in the style of the notorious Vele di Scampia in Naples, will completely change not only the garden and my project, but the entire area,” he said.\nWhen he got wind of the application, simulations of the development in question were created in the context of the villa, and the proposed seven floors will tower over the house and garden, meaning “there is no doubt that my project will lose all its potential value”.\nMr Pagot thinks “Malta should reconcile its economic interests with respect for its origins, its history and the image it has in the world. I understand the economic aspects of speculation, but I believe that man should rediscover respect for others and try to make his own interests coincide with a wider well-being. Of course, I am not only talking about respect towards Casa Gwardamagia and myself; I’m speaking about the entire community of Pietà and Malta.\n“The island attracts visitors due to its history and certainly not for new developments, which, in most cases, have no architectural value. If its beauty were to be suffocated by these mediocre structures, foreign investors would probably turn to other destinations.”\nWhen Mr Pagot had to rebuild the simple dividing wall between Casa Gwardamangia and the neighbouring garden, he said he abided by precise limitations, maintaining a height that would not exceed that of the church parvis.\n“I accepted these conditions, of course, seeing this as proof of how much Pietà was attentive to the protection of aspects of Maltese history.”\nThe proposed development also brings with it parking problems – one of the gravest issues Mr Pagot has encountered in Malta, with Pietà being certainly no exception.\nRead: Pietà council shoots down massive development project\n“The very limited number of car spaces the development would provide shows the lack of attention to the complications this would cause.\n“In Tokyo, where I lived for six years, every apartment had to provide at least two parking spaces. In this case, there will be a shortage of around 100 to 150. Who will take care of this?”\nThe island attracts visitors due to its history and certainly not for new developments\nMr Pagot’s architect, Joanna Spiteri Staines, a partner at Openworkstudio, who specialises in the restoration of old buildings, described the “under siege scheduled” garden as “exotic” and “full of beautiful trees”, the former owner being an expert at growing avocado.\nAt most, she said, the property could have been more modestly developed, surrounding the garden, rather than including an “outrageous” seven floors.\nAn application has been submitted to the Planning Authority to build 114 apartments in St Monika Street, Pietà.\nIn the space of a week, apart from the news about Casa Gwardamangia, she also received a call from the owner of an “out of this world”, pre-Great Siege, Grade 1 scheduled building in Tarxien, which is also at risk; and was contacted by another disillusioned person to value a villa that is now being overlooked by yet another development.\nAn application to build a “non-descript” block of flats across the road from the Tarxien house would ruin the streetscape, Ms Spiteri Staines said, adding that doing this in a relatively unspoilt street was setting a dangerous precedent, which would have a domino effect.\n“After all, it is the context that matters,” she said, giving as an example of plonking Michelangelo’s David in front of a block of flats instead of in Florence’s Piazza della Signoria. “The beauty and importance of the statue would be lost. And if we cannot appreciate the beauty of David in its context, that makes us a bunch of savages.”\nThe property, which has been in the family for three centuries, should have a buffer zone in front of the house too and not just behind, she insisted. The owner, she said, had been fighting in court to have the surrounding area properly protected.\n“In the Guardamangia case, we are talking about a 300-year-old house that is being devalued,” continued Ms Spiteri Staines, who also does pro bono work for Din l-Art Ħelwa to help save Malta’s heri­tage and environment.\nIf there is no buffer zone between urban conservation areas and new build and mass develop­ment, people’s homes are being devalued at the stroke of a pen with these applications, and this after they would have spent a fortune on restoration and rehabi­li­tation, Ms Spiteri Staines stressed.\n“Moreover, the body in place to protect their value and our heri­tage should be fighting for protection of our heritage, streetscapes and controlling urban development to respect the context rather than enabling these applications to go through.”\nThe situation is devastating and Ms Spiteri Staines said it is down to “those who would sell their mother to make a quick buck, and those whose attitude is: ‘if you can’t beat them, join them’, claiming that if others did it, why should they have their garden permanently in the shade of a block of flats. You can’t really blame the latter either,” she admits.\n“We need to see more buffer zones and more buildings being scheduled. The policies and deve­lopment guidelines of the Planning Authority talk ad nauseam about respecting the context, but this is totally overlooked by the decision-making boards,” she said, adding that the Superintendence of Cultural Heritage is still understaffed, but trying its utmost to reverse this negative trend.\nA good example of the protection of a buffer zone and the community’s fight against the ruin of the context of a monument was the area surrounding the Gourgon Tower in Lija in 2008, she said.\nMs Spiteri Staines is calling for a master plan for Guaradmangia that would give deserved value to all the historical buildings in the area.\n“We should have a vision for this area, which is totally undervalued and horrendously exploited by overdevelopment, when in truth, it has so much potential,” she said, adding that the buildings on Pietà’s waterfront are as old as the Pinto Stores and the whole area could be another Valletta Waterfront, with the road pushed out into the sea, or passing through a tunnel.\nReferring to the Public Domain Act, a relatively new, but as yet unused, tool for the State to buy sights of cultural, historical and social importance for the country, Ms Spiteri Staines encouraged it to buy Villa Guardamangia, further up the road, and turn it into a British museum.\nOnce the Queen’s residence and now on the market, she said Villa Guardamangia should be the first attempt to give due importance to the 150 years of British rule in Malta, celebrating, discussing and shedding light on this era.\n“It is a tidal wave of development and destruction and we are not even seeing it,” Ms Spiteri Staines said. “But with vision, we can control development, rather than let deve­lopment lead the way, leaving us with the only option to be reactive.”\nThe ancient Greeks used to say that a society grows great when old men plant trees in whose shade they know they shall never sit. In Malta, we seem to have turned this concept on its head.\n“It is hard to abandon a dream, but, undoubtedly, if the Santa Monika project is approved, I would no longer have a reason to make Casa Gwardamangia my main home,” Mr Pagot admitted.\nThe vision for a historical home\nAfter hearing stories of Malta’s charm, in 2016 Marco Pagot travelled to the island to search for a home in which to “create and dream”. \n“I immediately saw in Malta the possibility to have a home where I could work with other artists on the creation of new projects. I was looking for a quiet corner, a bit cut off from the real world, and when I set eyes on Casa Gwardamangia, I immediately understood that it could fit the bill,” he recalls.\nDespite being abandoned for over 40 years, the house’s structure and its wild garden were of unique design and proportions, he found. He began to write a screen­play with Casa Gwardamangia as the protagonist – and to think of a future with ‘her’.\nOnce he bought the property, the project kicked off. The idea was to create a guesthouse for artists to unite in a serene and enchanting environment, with  events designed for them to present and share their works.\nDriven by the idea to preserve the image of old Malta, the plan was that any new build would be as minimally invasive as possible, hidden under the garden, or replicating the style of the island at the time of construction of the house.\nThis is how the respectful relationship with heritage and historical buildings should be – almost human. But it all may collapse under the long arm of the laws of the jungle.", "comment_count": 11, "id": 1325}, {"keywords": "", "author": "", "article_body": "Three men were arrested on Saturday during a police raid at a residence in Gżira.\nThe police said on Sunday the men, aged between 30 and 48, live in Gżira and Sliema.\nThe raid, by the Speical Intervention Unit and the Traffic Section, was carried out after the police received information that drug trafficking and abuse was taking place at the residence, in Triq tas-Sliema, at several hours of the day.\nThe arrested men were found in possession of sachets containing cocaine and heroin. Items related to the sale of drugs, such as electronic scales, were also found at the residence. These indicated that the drugs found were ready to be trafficked.\nAn inquiry is being held.", "comment_count": 1, "id": 1326}, {"keywords": "", "author": "Jacob Borg", "article_body": "Hundreds of bikers on Sunday set off for a ride in memory of Johanna Boni, who was crushed to death by a cement mixer in Labour Avenue, Naxxar, on January 5, 2016. \nThe 27-year-old was riding her Kawasaki ER6N to work when the accident happened on that fateful morning.\nSunday's memorial ride saw bikers from all walks of life set off from Luxol for a procession to the site of her death in Naxxar. \nWatch: Parents feel 'abandoned' one year after Johanna's death\nFunds gathered during the ride were donated to the Simon Schembri Blue Light Foundation.\nSince her death, Johanna’s parents have embarked on a campaign to ban left-hand drive trucks like the one that killed her daughter. \nHer parents are still seeking closure over the incident that robbed them of their only daughter on that fateful January day.\nWatch: A grieving family still waiting for closure, two years on\nThey also never found Johanna’s Samsung Galaxy S4 smartphone, which went missing from the site of the accident and which contained images, videos and messages which they are longing to see.\nPhoto: Matthew Mirabelli", "comment_count": 11, "id": 1327}, {"keywords": "", "author": "Claire Caruana", "article_body": "Members of the European Parliament are again calling on the European Commission to address shortcomings in Malta’s rule of law and are asking the EU executive whether it sees scope for “constructive dialogue” with the government on the issues flagged up.\nReferring to the report drawn up by the Venice Commission in December following a fact-finding mission to the island to probe the state of the rule of law, three MEPs from different political groupings – Jeroen Lenaers (European People’s Party), Ana Gomes (Party of European Socialists) and Monica Macovei (European Conservatives and Reformists) – asked the Commission whether it agreed there is “a serious risk for the rule of law in Malta”.\nIn their questions, the three MEPs also asked whether the Commission was “willing to engage in a constructive dialogue under the rule of law framework”.\nRead: What rule of law experts said about Malta - and why it matters\nIn comments to The Sunday Times of Malta on Saturday, Dutch MEP Jeroen Lenaers said the questions had been prompted by the belief in Brussels that “the situation in Malta remains of concern”.\nThere are very serious deficiencies with the system\n“There are very serious deficiencies with the system there that the Venice Commission has objectively  identified, which when combined with the very serious allegations of abuse of power, impunity, corruption, the way the government continues to react to the assassination of Daphne Caruana Galizia, and the continued sale of EU citizenship, gives rise to grave concerns,” Mr Lenaers said.\nIn its opinion on Malta published in December, the Venice Commission, an advisory body of the Council of Europe composed of independent experts in the field of constitutional law, concluded that better checks and balances were required for the proper functioning of the rule of law. It also remarked that the wide power enjoyed by the Prime Minister created a serious risk for the rule of law.\nRead: Government will implement Venice Commission recommendations - Muscat\n“We have not seen anything like a strong enough response from the Maltese government – which continues to act as if what they do in Malta has no effect on other member states,” the Dutch MEP went on.\nThe Commission, he argued, had a role to ensure that every Member State acted in line with the values enshrined in the EU treaties.\n“Malta is not an exception. This is not about punishing any Member State, we want dialogue, and it is about trying to improve the situation, protecting the rights of both Maltese and EU citizens and the rights of every citizen in other Member States.\n“We have a system based on the rule of law, justice and mutual trust that must be protected, or the very integrity of our entire system will come under fire.”\nAt the European Parliament, questions are addressed by MEPs to other EU institutions and bodies and serve as a direct form of parliamentary scrutiny of these other institutions and bodies. Written questions, as were the ones submitted by the three MEPs on Malta, require a written answer.\nRule of law NGO Repubblika formally set up\nForty individuals on Friday night formally set up Repubblika, a non-governmental organisation that seeks to promote democracy and the rule of law in Malta.\nRepubblika has been set up to promote civil rights, democratic life, the rule of law, free speech, personal freedoms, social inclusion, environmental conservation, economic sustainability and equality of access.\nThis will be done by means of active participation in the national discourse and related educational, social and charitable initiatives.\nMembers approved the election of Repubblika’s first executive committee which will be chaired by Marion Pace Asciaq. Robert Aquilina is general secretary and Paula Fleri-Soler is treasurer.\nRepubblika will now apply for registration with the Commissioner for Voluntary Organisations and in the Register for Legal Persons as required at law.\nThe founding members approved the organisation’s statute that is now published on Repubblika’s Facebook page at www.facebook.com/Repubblika.", "comment_count": 24, "id": 1328}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Corinthia Group managed to obtain a far better land deal than the db Group, according to a comparative analysis of their acquisitions along the same peninsula at St George’s Bay.\nThe db Group, which owns the Seabank Hotel in Mellieħa, acquired the right to commercialise public land – which is estimated to be worth a conservative €400 million at current market prices – for a premium of €15 million. On the other hand, the international hotel chain Corinthia is acquiring a commercial concession worth €700 million for just €17 million, according to a draft deed that must still be approved by Parliament.\nThe analysis was carried out by a group of property experts together with The Sunday Times of Malta.\nThe db Group is planning to build a five-star hotel and a residential 38-storey tower on 24,000 square metres of public land at the former ITS site. The Corinthia, which has three hotels on the peninsula, wants to turn a land concession exclusively for tourism purposes into a deal for apartments and offices to be included on a tract of 60,000 square metres.\nCorinthia’s chairman Alfred Pisani and his team of negotiators appear to have secured several advantages over Seabank’s negotiators, led by chairman Silvio Debono.\nThe latter, for example, are obliged to fork out the whole of the €15 million premium over a specified seven-year period while the former will only have to fork out €4 million three years after the deed is signed.\nCorinthia’s payment of the remaining €13 million, into public coffers, is based on how much of the commercial area it decides to develop and eventually sell.\n“The balance in the sum of €13 million shall, subject to any reductions in accordance with the previous clause 10 below, be payable on a pro rata basis with respect to each portion of net internal saleable area designated for Office and/or Residential use on the Effective Date,” the still unpublished draft deed states.\nThe property experts consulted by the newspaper emphasised their “disgust” at the way the government is negotiating valuable public land.\nThe two deeds, they said, showed how the Corinthia had managed to obtain a “far better” deal from Konrad Mizzi, the Tourism Minister who represented the government on the two deals.\n“Obviously, Corinthia had the advantage of negotiating terms which had already been made public on the ITS deed. Thus, as expected, the government was not really in a position to negotiate after the ‘ridiculous’ terms given to the Seabank db Group,” one expert said.\n“For sure, Maltese citizens will be worse off from all this, as their land is going to be speculated for the benefit of a few families instead of the common good.”\nRead: Corinthia deal talks reopen after warning on state aid\nDr Mizzi admitted in Parliament that negotiations with the Corinthia Group were based on the same parameters as those given to the Seabank db Group.\nPrime Minster Joseph Muscat – who last week admitted that the government was now taking a second look at the negotiations following the public outcry – argued that he did not want to discriminate against Corinthia. This was a clear reference to the terms already given by the government to the db Group.\nWhen it became public in 2018, the Seabank deal was slammed by the business community and the Opposition. It is now being investigated by the National Audit Office. Yet, permits have been issued for the db project to go ahead while the government based the Corinthia deal on its ‘dubious’ parameters.\nWhen compared, the two deeds look very similar in the terms and allowances negotiated with the government. However, the Corinthia’s wins out on a number of counts.\nWhile both deals are for an empythuetical grant of 99 years, Corinthia has also been given the right of first refusal upon the termination of the original grant.\nRead: Developers say government selling land at below market prices\nIt was also granted unlimited rights to reclaim the seabed around the peninsula, a potentially lucrative clause which the ITS deal does not include.\nCorinthia says it has no intention of using its land reclamation rights but when asked if it was ready to drop them, the group argued that this was up to the government.\nAlso, while db will have to fork out a minimum investment of €150 million in order to build their mixed development, Corinthia are only obliged to fork out €100 million for the first phase, which will take at least another decade to complete.\nCorinthia has declared that for now, it only has the intention of completing the first phase, which will include the upgrading of the Corinthia Hotel St George’s Bay – without demolishing the current structure – and the building of 18,000 square metres of sea-view serviced apartments for sale.\nIt is only in the event that they decide to go for the full development of the peninsula, which allows them to build and sell up to 100,000 square metres of apartments and office/retail areas, that they will have an obligation to invest up to €300 million. No dates are set in the deed on when the whole project should be completed.\nIn another advantageous move for Corinthia, the government also conceded that the hotel group may renegotiate the whole deal in the event of a change in the country’s economic climate.\nAccording to a specific clause inserted in the draft deed, if at some point in future “economic and other relevant conditions are not conducive to the implementation of the full Project and that the full Project is only attainable if FSHL (the Corinthia company) is to endure disproportionate economic hardship, then both sides shall agree in good faith on the optimum timing and best course of action at such point, in the best interests of both Parties, including the national economy”.\nRead: Stop trafficking public land, NGO tells government\nAccording to experts, this clause guarantees Corinthia a “risk-free” development.\nWhile rights to the ITS site was subject to a public call for tenders – which surprisingly only the Seabank db Group submitted despite Corinthia’s initial interest– the rights to the rest of the peninsula were not.\nThe Corinthia argues that it already has possession of the land, which was granted to them in the 1990s for exclusive hotel use. However, the new deed will change the parameters of the concession, granting the hotel chain new rights to speculate with public land.\nAccording to laws, this can only be done through a public tender and after a new parliamentary resolution. Under the current deeds, the Corinthia Group cannot build and sell any commercial property on the land.\nThe draft deed needs to be approved by a simple majority in Parliament, which is expected to debate the matter in February.\nPaceville plot asking Price: €16 million\nA 1,075 square metre plot of land in Paceville, not far from the St George’s Bay peninsula, is on sale for €16 million.\nThe plot is described on the websites of estate agents as “a unique and rare opportunity to purchase one of Paceville’s last remaining large sites” for mixed development.\nCorinthia’s concession for the development of commercial property on a far larger tract of land was, by contrast, given away by the government for a premium payment of just €17 million. The Paceville plot is also far inferior to the St George’s Bay site, being inland.\nThe Times of Malta reported last week that the government has been given legal advice that the Corinthia deal might expose it to an infringement of EU State aid rules as it may put real estate developers on an uneven playing field.\nThe government denied this but admitted it has re-opened negotiations with Corinthia.\n\n\n\n \nSeabank db Group – ITS deal\nCorinthia – San Gorg Peninsula deal\n\n\nPublic Tender\nYES\nNO\n\n\nSite Size\n23,975 sq metres\n60,975 sq metres\n\n\nMaximum commercial building size allowed (GFA)\n58,502 sq metres\n100,000 sq metres\n\n\nLand reclamation\nNO\nYES - Unlimited\n\n\nDuration\n99 years\n99 years\n\n\nMinimum investment obligation\n€150 million\n€100 million – Phase 1\n\n\nEstimated current market price of concession\n€409.5 million\n€700 million\n\n\nPremium payment agreed with government\n€15 million\n€17 million\n\n\nPayment  terms\nStaggered over 7 years\nStaggered – according to development phases (can take decades)\n\n\nPayment upon deed\n€5 million\n€1 million\n\n\nConversion of temporary to perpetual emphyteusis by third parties\nYES\nYES\n\n\nObligation of conversion to perpetual emphyteusis\nNO\nYes – by third parties or Corinthia after two years from sale\n\n\nRight to sell (transfer) concession\nYES – with government consent\nYES – with government consent\n\n\n\n ", "comment_count": 22, "id": 1329}, {"keywords": "", "author": "", "article_body": "A 39-year old man was arraigned in court on Sunday on charges of domestic violence.The man, who cannot be named by court order, pleaded not guilty to slightly injuring his partner at their home on Friday, and to causing her to live in fear of violence over the previous years.Magistrate Audrey Demicoli issued a protection order in favour of the victim, but accepted a request for bail after the defence said the accused would reside at a different address. He was ordered not to make contact with his partner, among other bail conditions.Inspector Joanna Piscopo led the prosecution while lawyer Arthur Azzopardi appeared for the accused.", "comment_count": 0, "id": 1330}, {"keywords": "", "author": "", "article_body": "A man being held in police custody attempted to self-harm but was stopped before he could do any damage to himself, the police said in a statement on Sunday.\nThe 59-year-old was being held at police headquarters in Floriana at the time. A police officer intervened just in time and the man was unhurt. He was nevertheless taken to Mater Dei Hospital as a precautionary measure, the police added.\nInvestigations into the incident are under way, they said.", "comment_count": 0, "id": 1331}, {"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia on Sunday challenged Prime Minister Joseph Muscat to appoint a President “from the opposing camp”.\nAddressing a political activity in Rabat, Dr Delia said the PN made taken such a step many years ago with the appointment of George Abela.\nHe said the PN had also voted in favour of Marie Louise Coleiro Preca’s appointment and hailed her efforts on the social front.\nMs Coleiro’s Preca’s term as president expires in a few months.\n“The country needs unity. If you really love your country, appoint a President from the opposite camp. Send a signal of unity, Dr Delia challenged.\nTurning to a recent study that analysed living conditions in 187 different countries, Dr Delia noted that the only positive results for Malta were about its climate, as this was “the only thing the government did not have control over”.\nHe said the report ranked Malta as the “biggest loser” in a quality of life index.\nCorinthia Group 'give away'\nDr Delia had strong words about the government’s deal to “give land away” on the cheap to the Corinthia Group.\nRather than selling passports to fund a social housing project worth €50 million, Dr Delia questioned how many people could have been given a roof over their heads if land worth €700 million had not simply been given away to Corinthia.\nHe said the funds obtained by the government through passport sales paled in comparison to the reputation damage done to Malta through the scheme.\n“The government has sold the very thing that makes us Maltese. It has sold what is most precious to us”, Dr Delia said.\nThe Opposition leader said that a PN government would reverse every contract that robbed the people and make those who had signed them pay, using all possible tools permitted by law.\nA 'short-term' economyOn the economy, Dr Delia blasted the government’s short-term approach to economic growth.\nHe said the only plan the government had for sustaining this growth was by increasing the country’s population.Malta was already one of the most densely populated countries in the world, Dr Delia said.\nHe said the government’s vision was for a cosmopolitan Malta with towers everywhere, with Maltese living in tiny spaces or underground.", "comment_count": 38, "id": 1332}, {"keywords": "", "author": "Keith Micallef", "article_body": "The controversial Corinthia project in St George’s Bay is not about building a new hotel, but part of a giant leap in the tourism sector from which everyone would benefit, Prime Minister Joseph Muscat said on Sunday.\n“This year we estimate that Malta shall attract about three million tourists. How more can we handle? We need to start focusing on attracting big spenders,” Dr Muscat said.\nAddressing a political activity in Żebbuġ, he insisted that it was an illusion thinking that government could press “pause button” on the economy. Throughout his address he reiterated that Malta had come to a crossroad. “We either opt for the status quo, or else strive to make the next giant leap,” he said.\nDr Muscat insisted that Malta’s present infrastructure had reached its limit and would not be able to cater for further economic growth.\n“This leap brings about risks and sacrifices, but also huge rewards. This choice will become even more pronounced as time goes by,” he said.\n'The future is high-end'\nCiting the case of tourism, he said that the way forward was to cater for those who spend €5,000 per night rather than price-sensitive tourists as the current model. In this respect he said that Malta lacked certain type of high-end facilities where such people could spend their money.\nHe said that investments like the one Corinthia wants and which is yet to be approved by parliament, would make it possible for the Maltese to earn a living from tourism, as they would lead to higher wages. On the other hand he said refusing such projects, would mean having minimum wage jobs which were only attracting foreigners.\nAccording to The Sunday Times of Malta, the price in the draft deed for this plot of land measuring 61,000 square metres was of €17 million, even though its value on the market was of about €700 million.\nReferring to the controversy over the price at which this land was being given to the Corinthia Group, the Prime Minister said the Opposition had no credibility on the matter.\nHe reminded his audience that the Nationalist government had sold Smart City at just €1.75 per square metre, and then pointed out that in 2014 the PN was in favour of the Corinthia project.\n“Since, then we have raised the price even higher, and now they are against it,” Dr Muscat said.\n“This is not about a hotel, and whoever thinks so lacks vision. This is about where we want to go as a country,” he said.\nBlockchain criticism betrays PN's real feelings\nThe Prime Minister also referred to the closure of a blockchain company a few days ago, saying this had exposed the PN’s true colours.\nWhile noting that this was the only one to go out of businesses out of 259 applications received since November, he said that the manner in which the Opposition pounced on the closure spoke volumes. It betrayed what the PN had said before, when it welcomed the start of the blockchain industry, the Prime Minister said.\n'Joseph, stay'\nThe political activity was also addressed by former Tourism Minister Edward Zammit Lewis who once again appeal to Dr Muscat to reconsider his decision of resigning during this legislature.\n“Our challenge after next May’s elections is to persuade Joseph to remain until the next general election,” he said.", "comment_count": 55, "id": 1333}, {"keywords": "", "author": "Claire Caruana", "article_body": "Sunday Mass attendance is projected to decline further over the coming years until it sinks to only 10 per cent of Malta’s Catholic population by 2040.\nThe figure emerges from the Malta Sunday Mass Attendance Census 2017, which has just been published, giving raw data that includes detailed statistics such as attendance by age, parish, gender and level of education. It did not include Gozo. \nHeadline figures were announced last April, putting Mass attendance on December 2 and 3, 2017, at just under 37 per cent of a Catholic population that leaves out those under seven years of age or who could not attend due to illness.  \nTaken every 10 years, five such censuses have been carried out so far by Discern, the Institute for Research on the Sign of the Times.\nThe first was taken in 1967 and showed 81.9 per cent attendance. A curve plotted from that census to the latest one shows a steady decline which, if projected into the future, gives a 20 per cent attendance in 2030 and 10 per cent around 2040.\nOpinion: That shocking Mass statistic - Fr Joe Borg\nThe number of Catholics in Malta, including foreigners, was estimated to be 361,372 at the end of 2016, or 84.4 per cent of the total population. \nIn a foreword to the publication, Rev. Joe Inguanez, the chairman of Discern, acknowledges the “regularly falling” Sunday Mass attendance and stresses the need for renewal of the liturgy “so that leavers and absentees will return to Sunday Mass”.\nHe concluded with a plea for Jesus to help the Maltese Church “read the sign of the times and act quickly according to His Holy will”.\n\n \nThe age factor\nAttracting younger people to Mass is a losing battle, according to the census, which confirms the perception that those who adhere to the Sunday Mass obligation under Church law are an aging population.\nWell over half of the attendees (58 per cent) were over 50\nWell over half of the attendees were over 50 years old. A drop in attendance was seen across all age groups with the exception of those aged 65 and over. However, the younger generations are staying away in droves. According to the data, the number of Catholic youngsters up to 14 who go to Sunday Mass has halved from 42 per cent in 2005 to a mere 22 per cent in 2017. The figure is even worse for those in the slightly older cohort: a drop from 40 per cent to 19 per cent among those aged 15 to 24.\nOpinion: Mass attendance figures are a reality check - Auxiliary Bishop \nAttendance of those in the 25-49 age group has increased marginally to 46 per cent, from 44.5 in 2005, but declines are again seen in the 50-64 cohort (61 to 46 per cent) and 65-79 age group (69 to 67 per cent). Attendance by those 80+ rose from 52 per cent to 56 per cent.\nParishes\nAttendance declined in all 70 parishes with the exception of Manikata, Dingli and Fleur-de-Lys, the census found.\nIt was noted that parishes with higher attendance rates were likely to have higher numbers of younger people going to church while attendees tended to be older in parishes with low rates.\nThe census also identified a trend that saw residents leaving their parish to attend Mass elsewhere.\nSunday Mass attendence as percentage of Catholic population in each cohort.\nMass times\nThose who attend Mass on a Saturday rose by 1.8 percentage points from 2005. In fact, nearly one third of attendees preferred Saturday Mass to Sunday.\nSaturday also seems attractive to the younger age groups, with 36.3 per cent of those attending at 8pm falling within this age bracket. However, 80 per cent of Saturday attendees preferred the 5pm to 6.30pm time slots, while the most popular on Sunday morning was the 11 o’clock Mass.\nHigh belief in God\nMeanwhile, the Archdiocese also carried out a survey, conducted by Misco, on people’s views on faith, religion and Catholicism, conducted among a random sample of 1,000 respondents between December 4 and 8, 2017 aged 16 and over.\nMain findings:▪ 95% believe in God▪ 92% believe they are Catholic▪ 69% would become baptised today▪ 61% consider religion to be very important▪ 64% believe there is life after death ▪ 37% state that one must follow a religion if one believes in God", "comment_count": 274, "id": 1334}, {"keywords": "", "author": "", "article_body": "Updated at 11.40am  \nCare workers, nursing aides and health assistants working in public hospitals and residential care facilities have been reminded by their union to only attend to patients if accompanied by a colleague.\nThe General Workers Union said on Sunday that it had issued directives to its members in the healthcare sector after receiving reports that some had been the victims of “unfounded allegations”.\nA union spokesman said that it was going public with its industrial action after attempts to resolve the matter discreetly had failed. \n“We cannot allow our members to be put in a compromising situation in which they cannot defend themselves,” said GWU public sector secretary Jeremy Camilleri.\nMr Camilleri told Times of Malta that the directives have been in place for some four weeks, after an allegation by a patient “was the straw that broke the camel’s back”.\n“As the name implies, nursing aides should be assisting nurses, however, for the 18 months, supervision by nurses was lacking. When, for example, patients allege that nursing aides are rough with them, there are no witnesses to prove otherwise.”\nThe GWU has other related directives in place - nursing aides and care workers have for some time refused to bathe patients on their own. The new directives extended this order, meaning that now they will not carry out any of their roles if they are unaccompanied by another staff member, Mr Camilleri explained.\nThe directives affect nursing aides, health assistants, care workers, assistant care workers and other such employees.", "comment_count": 0, "id": 1335}, {"keywords": "", "author": "Ramona Depares", "article_body": "Two weeks ago Alexiei Dingli resigned from a 10-year tenure as Valletta mayor. He tells Ramona Depares how the future of the city is in jeopardy.\nWhat are the biggest challenges that Valletta currently faces?\nI like to describe Valletta as having different realities. Its residential community is the soul of the city; the businesses keep it alive and also employ a number of people from within the community itself; then, there are also the realities that it is a tourist hub and an administrative centre.\nThe challenge lies in balancing all its conflicting needs. During my tenure, at times it felt like I was being sandwiched between the different needs of each faction. This, while trying ensure that the interests of Valletta are given priority.\nThe truth is that Valletta residents are under threat\nWhat about the specifics?\nThe current wave of construction, which leans too much towards the commercial interests as opposed to the interests of the city itself, is one of the biggest challenges.\nI cannot imagine Valletta without its residents, but this is the direction that the city is taking.\nWe need to take a macro approach that takes into consideration how the details of a commercial decision will affect residents. But this is not an approach that is being favoured by the entities responsible.\nAs an example, consider when restaurants are granted permits outside of the commercial zones, in the residential area. Such permits trigger multiple consequences on the daily lives of residents living nearby. Parking problems increase; in the warmer weather, people are likely to hang outside smoking and chattering; there will be more noise…\nAs mayor, I always supported businesses, but all these details need to be considered too. As things stand, they are ignored.\nWhy is this happening?\nIf we look at the way permits are granted, it seems to be Planning Authority policy that if there’s already a restaurant in the vicinity, then there’s no reason not to grant new commercial licences. But a more holistic policy is needed, not this piecemeal approach.\nHow can this impasse be solved?\nI favour balance. Let’s take boutique hotels as an example. The city did need these kind of hotels – but now we simply have too many.\nWe need to restrain this indiscriminate granting of construction permits. Are all these hotels viable? My worry is that you get ‘cowboys’ jumping on the bandwagon, thinking that they will make a quick buck without carrying out market research. Will the demand for these hotels be kept up a decade down the line?\nWe have seen gentrification happening to other places and the only models that worked out are those that are based on a mixed model. But we are not following that model. Permits are issued to those who can afford them and, slowly, we are killing Valletta.\nHow is construction killing Valletta?\nI cannot accept seeing residents being pushed out of their homes. I encounter situations where, because they refuse to sell, the entire building on top of them is developed anyway and they end up living on a construction site for years.\nThere have also been cases where the landlord starts creating too many problems with the lease in the hope that the residents decide to leave. The truth is that Valletta residents are under threat.\nHow has your mayorship affected your view of the city?\nAs a child, Valletta was my playground. Becoming a mayor was a learning curve, of course. You’re not trained to become one.\nI became more sensitive to certain pressing details, and my frustration increased. I suddenly started noticing when people took out their garbage bags at the wrong time, and could not understand why.\nBecoming mayor also made me think more about the long-term future of the city. I never looked at Valletta 2018; I look at Valletta 2030, or even 2040. No-one discusses this.\nWhere will the city be in 30 years’ time? The entities are too fragmented and they only look at the issues they face, individually. This is why Valletta needs genuine residents, to secure a future.\nI cannot imagine Valletta without its residents but this is the direction that the city is taking\nAre there residents that are not genuine?\nThere are a lot of speculators buying property and re-selling it in the short term. They do not live there, they do not become part of the community and they add nothing to the city.\nI know many instances where people bought properties in Valletta and literally left them in the same state in which they bought them – then they resold them at a profit after a couple of years.\nOthers buy properties and rent out these places on a short-term basis. This is what I mean by Valletta needs genuine residents; people who will buy a place and actually live there.\nResidents who do live there and who complain that their needs are not given priority are often told that this is the price one pays for living in Valletta. What is your reaction to this?\nResidents were there before the businesses. They were there when there were no restaurants and when Valletta would become a ghost town by 6pm. Residents are the soul of Valletta. They have more right to be there than others.\nSo where do you see Valletta in 10 years’ time?\nI’d like to be optimistic. I see the regeneration and restoration process nearing completion; a revolution in the transport system. Valletta is small enough to manage an alternative, greener transport solution.\nI see Valletta becoming more liveable, becoming a space where you can raise a family, and where you can find places of entertainment too. I see it achieving this balance. This is what I’d like to see, of course.\nYou are known for being very passionate about your home city. What led you to resign from the post of mayor a few months before elections were due?\nI wanted to give more importance and time to my full-time profession at University and to my family. Being mayor of Valletta is very time-consuming, of course. It was the best time for me to do this.\nWhat are some of the achievements that you look back on with satisfaction?\nThere were many moments of satisfaction, because I was lucky enough to have a great team. Concluding the bid for Valletta 2018 comes to mind. We were being interviewed for the second time and we showcased a video of a young boy playing music. One of the judges asked, what would make us rate Valletta 2018 as a success, down the line.\nI replied that I’d consider the city’s tenure a success if it paved the way for allowing that boy to foster his talent on a professional level.\nThis reply must have struck a chord, because soon after we were informed that we had won the title. It was a defining moment, the start of a very exciting time for Valletta.\nThe renovation of Saint George’s Square was another proud moment. I used to describe it as the most beautiful car park in Europe.\nRemoving it was not an easy decision to take, on a political level. The business community was extremely upset. But the move catapulted an entire change in mentality. Once the square started being restored, we seemed to realise that not every small space needs to be turned into a car park. The restoration of St George’s Square was a catalyst.", "comment_count": 69, "id": 1336}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The Planning Authority last week threw out an application to develop part of a garden that once formed part of the servants’ quarters of a scheduled 18th century palazzo in Żejtun.\nThe application was seeking to build 20 residential units and underlying garages in a part of the garden of Villa Curmi in Żejtun. But the Planning Authority upheld concerns of the Superintendence of Cultural Heritage which called for the garden to be safeguarded. Not all the garden is covered by the protection afforded to the palazzo and its grounds.\nThe application’s case officer had recommended refusal since the garden contained features such as walls of historical and architectural significance and therefore merited protection.\nThe building was constructed in the 18th century by Paolo Curmi, who went on to become mayor of Żejtun in the 1800s.\nIts gardens are divided into three parts. An internal courtyard with an ornate gateway and steps leads to the largest part. This has a central passageway leading to a belvedere that overlooks the garden.\nThe third part, which was reserved for the servants, is accessible through the main garden or through the servants’ quarters which lie next door to the massive palazzo.\nIn the end, common sense prevailed. Let us continue working towards protecting Żejtun’s heritage\nIn 2006, the Planning Authority scheduled Villa Curmi and the servants’ quarters as a Grade 2 building of architectural and historical importance. Only part of the garden was given the same level of protection.\nReacting to the Planning Authority’s decision, Wirt iż-Żejtun president Ruben Abela said: “Common sense has prevailed. The Planning Authority gave due considera­tion to our objections as well as those of the Żejtun council, residents, the Superintendence as well as the reccom­endation to refuse by the Planning Directorate.\n“In the end, common sense prevailed. Let us continue working towards protecting Żejtun’s heritage.”\nThe application had sought to develop part of the historic garden to construct 12 basement garages for two dozen cars, four maisonettes at ground floor level, and 16 apartments spread over four floors.\nThe Superintendence of Cultural Heritage objected to the proposed encroachment onto scheduled property, saying it had already sustained a number of extensive encroachments and any further intrusions could not be tolerated.", "comment_count": 5, "id": 1337}, {"keywords": "", "author": "", "article_body": "State visit to Turkey\nTurkish President Recep Tayyip Erdogan and President Marie-Louise Coleiro Preca shake hands as they pose for a photo at the end of an official welcoming ceremony at the presidential complex in Ankara, Turkey, on Thursday. Dr Coleiro Preca was on a two-day State visit to Turkey, where she also led a Maltese business delegation.\nWhat made the headlines\nMega projects approved: A permit for a sprawling residential development rising to 12 storeys on the site of the former Mistra Village in Xemxija was renewed by the Planning Authority. The project includes 744 residential units, shops, restaurants, offices, a clubhouse and over 1,600 parking spaces. A permit was first issued in 2013 but no work was ever done, forcing the developers to apply to renew the permit. The Planning Authority also gave the go-ahead for a 12-storey residential development at Smart City. The Shoreline project will include about 400 luxury flats, almost 14,000 square metres of rentable commercial space, mostly shops, and another 1,500 square metres of bars and restaurants.\nMalta has been selling passports since 2014. Photo: Jonathan Borg\nBulgaria, Cyprus and Malta targeted by Commission over ‘golden visas and passports’: The European Commission urged Member States to crack down on schemes granting ‘golden visas and passports’ to foreign investors, warning they can bring corruption and money laundering in their wake. It published a report urging members to curb the practice of giving foreigners – often Chinese, Russians and Americans – residency or citizenship in return for investment. The Commission complained that Bulgaria, Cyprus and Malta run schemes granting foreign investors citizenship without requiring them to live in those EU countries or show “genuine connections” to them. The Commission also said residence permits pose serious security risks to Member States.\nFears over online ‘medical school’ based in Malta: European doctors expressed concern that a Malta-based online medical school could be used as a backdoor for underqualified doctors to work in EU hospitals. Frank Montgomery, who chairs the Standing Committee of European Doctors, an EU-wide doctors’ lobby, told the Times of Malta a Malta-based company offering medical courses via online correspondence had been the topic of discussion at a recent meeting of its members, adding that they did not know the level of qualifications within this organisation. The contentious programme is offered by the European Digital University, which was licensed by the Maltese education authorities last year.\nPalumbo father and son jailed in Sicily: Palumbo Shipyards boss Antonio Palumbo and his son Raffaele were sentenced to six years in prison over illegal waste dumping in Sicily. The two Neapolitan businessmen were among seven men found guilty by a Messina court last week, which ruled that they had facilitated illegal dumping between 2011 and 2013. Their lawyers will be appealing the sentence. Antonio Palumbo has consistently maintained that the case was politically motivated.\nNo deal Brexit will cost Malta €6m: Malta would have to fork out an additional €6 million a year in contributions to the European budget in the event of the UK leaving the EU without a deal, Prime Minister Joseph Muscat told Parliament. Dr Muscat told a press conference earlier in the day that in the event of a no-deal Brexit, Britons already living in Malta would be required to apply for a residence permit that would be valid for 10 years, which could be renewed.\nMalta ‘biggest loser’ in quality of life study: Malta was labelled “the biggest loser” in a Quality of Life Index that analysed living conditions in 187 different countries. Malta fell from 19th best for quality of life to 38th in The Expat Insider 2018 report. According to the researchers, living in Malta was deemed as being “not as peaceful as it seems”. One UK expat reported that “corruption seems endemic at all levels of society” and an Irish respondent noted that “the horrendous corruption in every aspect of governance is appalling”.\nCorinthia deal talks reopen after warning: The government reopened talks with the Corinthia Group to modify existing deals on projects on the St George’s Bay peninsula after receiving legal advice that EU State aid rules could be breached, the Times of Malta revealed. The advice came from a reputable Brussels-based legal firm, which noted that if the present draft deal was cleared, the government could face a legal challenge by interested parties over breach of EU State aid rules.\nFuel pumps off limits after 6pm: Consumers were not able to purchase fuel after petrol stations closed at 6pm as a result of a partial strike announced by the GRTU. Fuel station owners decided to strike after the government rejected their proposal for a higher profit margin following years of negotiations. Station owners also agreed to withhold licensing fees due to the Regulator for Energy and Water Services. The strike was lifted for a day on Friday pending talks with the government yesterday.\nWhat trended\n‘Trade unionism or cartelling?’\nFuel hoses dried up at 6pm for much of this week, as fuel station owners took a tough stance in negotiations with the government.\nJudging by online readers’ reaction, the sabre-rattling backfired.\n“Is this trade unionism or cartelling?” asked Gergely.\nKaren was not buying station owners’ pleas. “If it were such an unprofitable business, there wouldn’t be constant new applications for petrol stations every 400m or so!” she wrote.\n“This is awesome,” cheered Milos. “So you can improve your health and walk for a change!”\nEnvironmental awareness\nWhat if people frustrated by environmental degradation dragged themselves away from their keyboard and planted 10 trees each instead?\nThat seed of an idea appears to be gradually taking root across the country, with thousands of members signing up to the Grow 10 Trees movement and around 100 actively involved.\n Compliments rained down on Adrian Gatt and his environmental brainchild, with many readers thrilled by the idea.\nBut no comment board is complete without its share of contrarians.\n“Imagine if one complained successfully to save 10 mature trees in ADDITION to the new 10 saplings planted,” argued Matthew. “Educate the children about that, dude”.\nJoseph was enthused by the concept, but concerned about the way activists were going about their arborial mission.\n“From the picture I can see that a sapling was planted just two feet from a very mature tree,” he wrote, adding “that is going to make it impossible for the sapling to grow”.\nChris’ vein of scepticism ran far deeper. “Look at the ruined square in Paola,” he sighed, recalling how authorities had also made a big song and dance about planting trees in the Marsascala family park. All had been forgotten, he claimed. “Except for a few, all are dead”.\nPeter the Customs dog\nPeter the Customs dog sniffed out a passenger carrying €26,000 in undeclared cash at Malta International Airport this week.\nThe coup prompted a fair few chuckles among our readers.\n“Is he up for adoption?” asked a hopeful Matthew.\n“We need a Peter in charge of the Economic Crimes Division,” mused C.\n“Job well done Peter,” Deborah congratulated, before she took a jab at the government’s diplomatic recruitment strategy. “Maybe you should be Ambassador to Montenegro”.\nWhat they said\n“Any of you who are thinking of staying home come election day – who may be thinking that this is a wise thing to do – will be voting for Joseph Muscat, you will be giving consensus to Konrad Mizzi.”\nNationalist Party leader Adrian Delia warning PN supporters thinking of withholding their vote during next year’s local and European elections that they would be playing into the hands of the Labour Party.\n“You have nothing to worry about, even if there is a no-deal.”\nPrime Minister Joseph Muscat assuring Britons living in Malta that their status will be protected even if the UK leaves the EU without a deal.\n\n“We speak about opening a golden gate to Europe for some privileged people who have the money to pay for citizenship or residence. We are looking at it with concern.”\nEuropean Justice Commissioner Vera Jourova speaking during the publication of a report by the Commission which warned that the sale of passports by EU Member States could lead to corruption and money laundering.\n“Human rights will always be threatened and I’m convinced that this will be an ongoing struggle in any democracy. That is why we have to remember the Holocaust every year.”\nPatrick Siegele, director of the Anne Frank Centre in Berlin, speaking to the Times of Malta ahead of International Holocaust Remembrance Day which is commemorated today.\n\n“What has happened to us? In which hole did we shove and bury our compassion, our values and our basic humanity?”\nNationalist MP Mario de Marco, writing in the Times of Malta, about how people are ignoring the plight of migrants who drown in the Mediterranean.", "comment_count": 0, "id": 1338}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Sunday.\nThe Sunday Times of Malta reports that billions of euros in transactions are being investigated at Satabank, with investigators saying they were completely stunned by the extent of suspected malfeasance at the now-closed bank.\nThe newspaper also reports that the Corinthia Group’s St Julian’s land deal appears to be even better than the hotly-contested one db Group clinched for its City Centre project.\nThe Malta Independent on Sunday writes that Edward Scicluna, Helena Dalli, Miriam Dalli and Louis Grech are all in the running to become Malta’s next EU commissioner once Karmenu Vella’s term is up.\nMalta Today reports that the Planning Authority was on a permit spree last year, approving a record-breaking 13,000 applications. \nIt-Torċa reports that the Nationalist Party wanted to give the Corinthia Group “more land with less money” than a deal currently being negotiated with the government.\nIl-Mument dissects a photo of Cabinet minister celebrating the Prime Minister’s birthday, saying that behind the smiles, ministers are jostling for position and sniping at one another.\nIllum writes that medical procurement firm Technoline received another €3 million from the Health Ministry, despite minister Chris Fearne’s pledge to rip up a contract signed with the company.\nKullħadd leads with claims that retired auditor Godfrey Leone Ganado, who is being sued by MP Rosianne Cutajar for libel, has ties to a person being investigated by the FBI for money laundering suspicions.", "comment_count": 0, "id": 1339}, {"keywords": "", "author": "", "article_body": "A 31-year-old man was rushed to hospital on Sunday morning after being badly hurt in a crash on a slip road leading to the Marsa-Ħamrun bypass.\nThe man, who is from San Ġwann and was behind of a Toyota Vitz, collided with a Toyota Raktis being driven by a 35-year-old Dutchman who lives in Paola. An infant was also riding in that car, the police said.\nBoth vehicles crashed on a slip road leading to the bypass from Triq Diċembru 13. The road was temporarily closed to traffic while officials cleared it of crash debris.\nParamedics took all three incident victims to hospital. While the Dutch driver and the baby were only slightly injured, the 31-year-old is understood to have been more seriously hurt.", "comment_count": 0, "id": 1340}, {"keywords": "", "author": "Ivan Martin", "article_body": "Billions of euros in suspicious transactions through Satabank are under investigation.\nFinancial regulators and police are looking into a cornucopia of cases with suspected links to fuel smuggling, drug trafficking, the Mafia and black listed countries, a senior source privy to the case has told The Sunday Times of Malta.   \n“This makes previous cases of money laundering through a Maltese financial institution look like child’s play,” the source said.\n“The extent to which crime seems to have infiltrated this bank is quite astounding. It is one of the most complex cases we have ever had to deal with.” All 12,000 of Satabank’s accounts were effectively frozen by the Malta Financial Services Authority last October, with EY (formerly Ernst and Young) appointed to administer the bank’s assets in “the best interests of depositors”.\nThe move came after a joint inspection and audit by the Malta Financial Services Authority and Financial Intelligence Analysis Unit last year found shortcomings in the bank’s anti-money laundering procedures. The police have since been roped in, as well as a magistrate to help facilitate the investigations.\nThe extent of the problem\nDetails of what irregularities were discovered at the bank have so far been held under lock and key.\nSources however have now told The Sunday Times of Malta that the extent of the alleged irregularities detected at the bank in recent months had exceeded what the authorities had initially expected. \nThey explained that tens of billions of euros in transactions had passed through the Paceville bank during its four years of operation and investigators now believe as much as half of these may have been “high risk and highly suspicious”. \n“There are accounts through which hundreds of millions were channelled, with very lax controls, and in some cases from questionable sources. Each account is now being analysed to make sure that only ‘clean funds’ are released. It is a painstaking process,” one source said.\nThe extent to which crime seems to have infiltrated this bank is quite astounding\n'This is a huge mess'\nMeanwhile another high-ranking source, from a financial regulatory body, said the extent of the rot discovered in the Satabank probe begged the question of how the bank was given a licence to operate on the island in the first place.\n“The aggressive business model of on-boarding clients with limited due diligence, and processing transactions with very weak governance and anti-money laundering procedures, certainly attracted many people, but it also attracted the worst kind of people. This is a huge mess,” claimed a source who is involved in overseeing the case.    \nSatabank was compared to the popular UK-based financial services application Revolut, which allows relatively small peer-to-peer payments with lax controls.\n“It is one thing to move €50 from one person to another on Revolut, it is another to move €50 million with basically the same level of oversight,” he alleged.\n“In fact, the bank hardly operated as a bank at all – it was more of a payment institution through which more than €30 billion were channelled as payments and transactions,” the source said.   \nPrior to the bank gaining its licence in Malta, Satabank’s Bulgarian co-owner Christo Georgiev ran an e-money business in Luxembourg. He has since faced a number of international investigations into alleged wrongdoing.\nThe group the bank forms part of had voluntarily surrendered its electronic money institution licence issued by Luxembourg shortly after Satabank was given its licence in Malta. \nThe action against the beleaguered bank comes after a change in the MFSA’s top brass last year. Sources within the watchdog said that although the bank had been on the MFSA’s radar since late 2016, interest had intensified last year and a comprehensive compliance review had so alarmed the authority that a freezing order – the most severe action possible – was issued soon after.  \nThe move, however, did raise some eyebrows at it saw many ordinary clients who held accounts at the bank unable to access their funds. The authorities eventually released some of the regular funds to these clients after the review had already started.  \nAnother shock came at the outset of the probe when investigators learnt that the bank’s servers were not even located on the island – a direct violation of its licence. \n“So at the very start of the investigation, a request had to be made, through the competent authorities in other jurisdictions, to get our hands on terabytes of information. It was already clear, at that early stage, that there were going to be problems with this case,” a source said.\nSatabank for sale\nThe future for Satabank could include a surprise twist.\nA number of interested parties, including banks and foreign financial institutions with a presence in Malta, have expressed their interest in taking over the bank, sources said.\nThis would see a shareholding transfer on the basis of a new business model, technology platform, service portfolio, governance structures and remediation plan.\nSuch a shareholding change, the sources said, would need a business case analysis and compliance review including a thorough due diligence before any recommendations would be made to the European Central Bank for their consideration.\nMeanwhile, the sources said this was seen as favourable for the jurisdiction as more banks were needed.", "comment_count": 43, "id": 1341}, {"keywords": "", "author": "Jacob Borg", "article_body": "A former supermarket chain co-owned by the Deputy Prime Minister’s chief of staff, Carmen Sammut, had been pursued by the Inland Revenue Department for unpaid taxes and penalties totalling €2.9 million, the Times of Malta has learnt.\nWhen contacted about the matter a few days ago, Ms Sammut said she could “positively confirm that the company in question had no outstanding dues of any kind”. She did not respond to a follow-up request asking for evidence that the tax dues had been settled.\nThe tax authorities had stepped up their pursuit of unpaid taxes by Pirella Supermarkets Ltd through a judicial letter in 2017, demanding the immediate payment of €861,200 in unpaid taxes and €2.1 million in interest and penalty fees.\nThe tax arrears cover the years 2005-2012 when Ms Sammut was both a director and shareholder of the family-owned firm. She had resigned from the board of directors in September 2017. Last year, the Inland Revenue Department had filed another judicial letter, again demanding the company settle the€2.9 million tax bill. \nThe company in question had no outstanding dues of any kind\nPirella is also known to be in breach of the Companies Act because the last time it filed accounts was in 2005, according to the registry of the Malta Financial Services Authority. Companies are obliged by law to submit annual audited accounts to the MFSA. \nMs Sammut did not reply to questions why no audited accounts had been filed for over a decade. \nApart from the shares in Pirella, she also has a number of other business interests, including an apartment block, which, until a few years ago, was being used as an unlicensed hotel. Ms Sammut and her husband and business partner, Mark Sammut, have since acquired the necessary licences to offer tourist accommodation. \nTimes of Malta last November flagged a potential conflict of interest over Ms Sammut’s sole shareholding of an IT company providing services at Mater Dei Hospital. Cursor Limited, owned by her husband, won a number of government contracts in recent years, including for the development of an electronic messaging system for Mater Dei. This company also provided services to the transport regulator when he served as a Transport Malta director.\nTransport Malta had shrugged off complaints of conflict of interest saying Dr Sammut was not a director of the IT company and that his interests had been transferred to his wife.\njacob.borg@timesofmalta.com", "comment_count": 19, "id": 1342}, {"keywords": "Environment", "author": "Alex Vella", "article_body": "February will see the last cold days of winter through. Although the season will still have 21 days to run, the weather is normally milder in March.\nWith this in mind, the walks chosen for February are along tracks inland, as much as possible away from exposed coastal areas of our tiny island, with some cultural content thrown in for spice.\nValleys are targeted this month because they provide the nearness to nature that ramblers long for and enjoy. At this time of year, valleys are filled with native flora in full flush before blooming as spring approaches. They also offer cover from biting winds and the cold elements.\nOur valleys are small but charming in their diversity of micro habitats as deep gorges open up to wider expanses of flat valley beds – about enough to relieve ramblers from the hubbub of development.\nAn even greater disaster is that the Planning Authority does not give blanket protection to our valleys by not permitting any development whatsoever within them\nWhat a pity that there are still some who still treat valleys as their dumping ground! The long-running deficiency of local road-network planning has brought about the situation where our roads become rivers during storms while some of our valleys run dry. It was an undeclared admission of failure that underground tunnels had to be dug to relieve flooding from badly planned roads, when valleys were nature’s simple solution to carry water away.\nAn even greater disaster is that the Planning Authority does not give blanket protection to our valleys by not permitting any development whatsoever within them, and even by establishing a buffer zone to protect them. No civil servant of the authority has ever been held accountable for the deterioration of our valleys by way of irregular permits, lack of enforcement and endorsing abuse within these scheduled areas.\nOn the contrary the slackening of regulations brought about by the recent amendments to rural policies are achieving what they were intended to do – promoting government policy of economic growth at all costs, even through encouraging urbanisation of outside development zones. Evidence of this are the shockingly immoral applications to bring about the total collapse (there is no better description) of the intrinsic nature of our valleys.\nThat the PA even considers such applications is immoral in itself; to approve them is diabolical. Cases in point are the valleys of Wied Għomor and those of Burmarrad, included in this month’s walks.\nSome may say: “Such is progress. It’s the economy stupid!” But can we continue to let economics be the sole driver and measure of success for our society?\nXemxija\nFebruary walks\nSunday, February 3: Two valleys converging on Burmarrad – a moderate walk of some three hours starting at the roundabout near Ta’ Alla u Ommu.\nSunday, February 10: Country lanes of the south – a hard walk with rough terrain and inclines along lanes and coast between Marsascala and St Peter’s Pool. Start point: Marsascala parish church.\nWednesday, February 13: New villages around Wied Għomor – starting at San Ġwann parish church, this easy to moderate walk takes ramblers along San Ġwann, Swieqi and St Julian’s, passing through Wied Għomor.\nSunday, February 17: Xemxija to Majjistral through Miżieb – a moderate walk on rough terrain with steep inclines, setting off from Xemxija Bay towards Manikata, taking some four hours.\nSaturday, February 23: An easy village walk of two hours with cultural and historical interest around various old districts of Żabbar, ending up with a guided one-hour visit of the Sanctuary Museum. Starting point – Mediatrix Square, Żabbar, at 9am.\nWednesday, February 27: Għallis walk – starting at the chapel of San Pawl tat-Tarġa, Naxxar, this easy walk includes the Widna (the primordial stone radar), Qalet Marku Tower and the Magħtab complex in three hours of moderate walking.\nAll walks on Sunday mornings start at 9am, while those on Wednesday afternoons start at 2pm. Everybody is invited to join in the walks. However, it is important that beginners choose an easy walk to start with and then decide on the harder walks. The Ramblers’ Association takes great care in picking the trail but every individual who freely chooses to walk or stop at his/her discretion is solely responsible for his/her safety. For further information visit the websites above or phone 9949 7080.\nAlex Vella is executive president of the Ramblers’ Association of Malta.\nwww.ramblersmalta.org\nwww.facebook.com/ramblersmalta\nSan Pawl tat-Tarġa\nMiżieb", "comment_count": 0, "id": 1343}, {"keywords": "Education", "author": "", "article_body": "A group of 24 students from Giovanni Curmi Higher Secondary School, Naxxar, recently took part in the latest edition of the Euroscola programme at the European Parliament in Strasbourg.\nThe participants from Malta and various other countries met in the hemicycle chamber where each delegation introduced their respective country and school. Angelica Ebejer and Gillian Grech introduced the Naxxar school.\nThe students were then split into their different groups to debated on topics on which they had conducted research beforehand. The topics were related to the work being conducted by the EU on issues such as the environment, Europe’s future, youth employment, security and human rights, migration and the coming MEP elections.\nSome students were chosen as representatives of their respective groups, and back at the chamber, they presented their groups’ reports. This was followed by a debate where students from the plenary floor were invited to voiced their opinion. All the students were subsequently given the opportunity to vote on related resolutions through the electronic voting system normally used by MEPs. The trip also included excursions to the city of Strasbourg and the town of Colmar.\nThe Maltese students were chosen to participate in the event after sitting for an exam set by the European Commission Representation in Malta. The delegation of students from Giovanni Curmi Higher Secondary School were accompanied by teachers Christine Bezzina, Josephine Falzon and Elton Grech.", "comment_count": 1, "id": 1344}, {"keywords": "Education", "author": "", "article_body": "Highlights of vocational and applied research studies carried out last year by the researchers and professionals at the Malta College of Arts, Science and Technology (Mcast) and the University of Malta have recently been published.\n\nThe Mcast Journal of Applied Research and Practice (Vol. 2, Issue 1, 2018) features articles on research conducted on the following topics:\n• ‘The macroeconomic factors affecting property prices in Malta’ by Luke Vella;\n• ‘How effective is apprenticeship to learning? A student perspective’ by Martina Vella;\n• ‘The effect of consumer characteristics and behaviour on pork consumption in Malta. A quantitative study’ by Joseph Abela;\n• ‘The attitudes of Maltese consumers towards renewable energy: An investigation’ by Carmelina Frendo;\n• ‘A coach’s perception; Major factors influencing late goal-scoring patterns in Maltese football’ by Kenneth Costantino;\n• ‘Typing biometrics as a form of passive user authentication’ by Darren Cilia and Frankie Inguanez;\n• ‘The impact on education of children admitted in care after experiencing abuse’ by Neil Zammit and Charlotte Moore;\n• ‘Malta’s higher education dimension: Analysing the extent of complexity in change’ by Colin Borg; and\n• ‘An evaluation of the implications of thermography within the healthcare setting’ by Cassandra Sturgeon.\nThe journal serves as a platform to showcase the varied nature of the applied research and innovative practice at Mcast, reflecting the various aspects of vocational specialisation that the college focuses on. It is published biannually and is aimed at researchers, academics and practitioners.\nThe editorial board for this edition was composed of Alex Rizzo, Christian Camilleri, Jevon Vella, Rosienne Farrugia and Doreen Micallef.\nTo access an electronic copy of the journal, visit the link below.\nhttps://libraryembed.mcast.edu.mt/rfm/source/research/journal/mcast_journal_jan_2018_web.pdf", "comment_count": 1, "id": 1345}, {"keywords": "Education", "author": "", "article_body": "The school hall of St Margaret College Middle School, Cospicua, was recently transformed into a colourful ‘language market’ promoting the different cultures of the eight languages taught at the school: Maltese, English, French, Spanish, German, Italian, Chinese and Arabic.\nThe aim behind the event was to promote cultural diversity and enable the students to enjoy and appreciate the identity of each culture through a variety of activities. These included traditional dances on stage, exhibitions of souvenirs and artefacts as well as sampling of various food and drinks reflecting the identity and heri­tage of the different cultures.\nA number of ambassadors from the countries promoted as well as educational officers also visited the event, which was organised by teachers and students.", "comment_count": 0, "id": 1346}, {"keywords": "Education", "author": "", "article_body": "The orchestra of the University of Malta’s G.F. Abela Junior College recently released its second CD album to commemorate the college’s 20th anniversary.\nThe orchestra, which was set up in October 1998, has since performed over 400 concerts comprising a wide repertoire ranging from popular classics to pop, rock, and jazz music, both locally and in other European colleges. It won the Horace Mercieca Award at the Gozo International Celebration in 2013, the Jury Special Prize at the Vodaphone Freezone 2nd International High School Contest, Istanbul, in 2016, and the first Concorso Internazionale per Orchestre Scholastiche Musicale – Categoria Istituti Superiori in 2017.\nThe new album, entitled In Christmas Mood, contains 18 Christmas-themed vocal and instrumental tracks, including classics such as White Christmas (Berlin), Christmas Lullaby (Rutter), A Marshmallow World (De Rose), Mille Cherubini In Coro (Schubert), Bell Carol Rock (M. Leontovych), and I’m Walking In The Air (Blake); music from films The Prince of Egypt (Schwartz) and from Harry Potter And The Goblet Of Fire (Doyle); popular marches by Bizet and Strauss, and another entitled Il-Benniena tal-Bambin, written by orchestra director Mro Manoel Pirotta.\nFor the recording of the CD the orchestra was joined by singers Soraya and Solange Cardona, Annalise Psaila, Kyle Cutajar, who were all trained by Soprano Ruth Casingena, and Amy Pace, coached by Priscilla Giordano Psaila.\nThe album was recorded in the college’s auditorium by the late Vanni Farrugia, who passed away in September 2017, assisted by recording engineer, Alan Schembri. Its jacket was designed by graphic designer Yan Edward Pirotta.\nThe CD album is on sale at €10 from the Junior College principal’s office or by calling Mro Pirotta on 9988 6056.", "comment_count": 0, "id": 1347}, {"keywords": "Education", "author": "", "article_body": "The 11th edition of the new series of Xjenza Online was recently issued by the Malta Chamber of Scientists.\nThe edition includes articles on the following topics:\n• The oral health status of the Gozitan community;\n• Road courtesy: A prerogative of gender, age and car size;\n• Examining the structural validity of the Strengths and Difficulties Questionnaire (SDQ) in a multilevel framework;\n• Xenophobic and homophobic attitudes in online news portal comments in Malta;\n• A Maltese study of intracranial vascular malformations;\n• An analysis of trade union membership in Malta;\nThe first issue under the new editor-in-chief\n• Bridging the gap between yoga and science: a mini review;\n• Cannabis medicine offers hope for severe paediatric epilepsies;\n• Malta as the new hub for the inverse problems community.\nThe authors include Nikolai Attard, Gabriella Gatt, Maria Luisa Gainza-Cirauqui, Emad Alzoubi, Simon Attard-Montalto, Liberato Camilleri, Carmel Cefai, Stavros Assimakopoulos, Theresia Dalli, Manwel Debono, Gabriele Deidda and Giuseppe Di Giovanni.\nXjenza Online is a peer-reviewed, free open access international journal that published research articles, original re­search reports, reviews, short communications and scientific commentaries in all fields of science. The journal not only provides a dedicated forum for publishing high-quality research articles in all areas of science in Malta but also provides a training platform on scientific publishing for a wide range of potential authors, including students and young researchers, in a peer-reviewed environment.\nThis is the first issue to be produced under direction of the journal’s new editor-in-chief, Prof. Cristiana Sebu, and the editorial board. Prof. Sebu succeeded Prof. Giuseppe Di Giovanni, who revived the journal in 2013 and was its editor-in-chief for five years, steadily improving its quality and standards. Previous editors were Prof. Angela Xuereb and Prof. Joseph Grima.\nThe Malta Chamber of Scientists is a learned society representative of scientists from all disciplines and socio-economic sectors. Membership may be obtained in mms.org.mt.\nFor further information on the latest edition of Xjenza Online, visit the link below.\nhttp://www.mcs.org.mt/xjenza", "comment_count": 0, "id": 1348}, {"keywords": "Gozo", "author": "", "article_body": "To mark the 400th anniversary of the Madonna Ta’ Pinu painting – the work of Bartolomeo Amadeo Perugino – the Gozo Diocese is holding a Marian Year which ends on the eve of the feast of Santa Marija. The painting is being taken for a day in all 15 parishes in Gozo, with a stop also at the Gozo General Hospital last week.\nGozo Bishop Mario Grech said the aim of this initiative was that every parish community would be close to Our Lady and renew their devotion to Our Lady of Ta’ Pinu.\nEvery parish is organising a prayer vigil until midnight.\nThe miraculous image was taken out of Ta’ Pinu Sanctuary three times - twice to Victoria: in June 1949 at the conclusion of the Marian Congress in Gozo and in November 1950 on the occasion of the special feast when Pope Pius XII proclaimed the Assumption Dogma. In April 2010, the painting was taken to the Granaries in Floriana for the visit of Pope Benedict XVI, who had placed a golden rose in front of it and encouraged Christians to pray in front of the image, while calling her the Queen of Family.\nThe touring of the image comes to an end today with a pilgrimage from near the Pilgrim’s Monument on the road leading to Ta’ Pinu, where the painting will be taken back to its shrine.\nThe Ta’ Pinu painting in Nadur is pictured on the right.", "comment_count": 0, "id": 1349}, {"keywords": "Education", "author": "Christine Rossi", "article_body": "Today is Holocaust Memorial Day, the international day marking the anniversary of the liberation of Auschwitz-Birkenau, the largest Nazi death camp. It is a day when we remember a world scarred by genocide – not only under Nazi persecution, but also the genocides in Cambodia, Rwanda, Bosnia and Darfur.\nLast October, a group of students and teachers from St Aloysius’ College secondary school, Birkirkara, visited Nazi death camps in Poland. The group, which included three teachers and 16 fifth form students, spent four days in Poland and visited both Auschwitz and Birkenau camps.\nThomas Sciberras Herrera, a fifth form student who formed part of the group, said the visit to the camps left a very strong im­pact on the students. “As we were walking in and out of the rooms, in the different barracks, we could see thousands of shoes, crutches, wheelchairs, baby clothes and luggage. We could not help but feel shock while visiting the furnaces that were used to burn the Jews. After visiting the camps, we felt so disturbed; none of us had words to describe the horror of what our eyes had just witnessed,” he said.\nThe  tour guide informed the group that her grandparents had been killed in the gas chambers at Birkenau camp and that when he realised he was losing the war Hitler had ordered all the gas chambers to be demolished.\nRoberta Vella, the educator who organised the visit, said that being a Social Studies teacher she al­ways found it essential and interesting to learn about the past, especially about World War II.\nA crematorium at Auschwitz where hundreds of corpses could be burned every day.\n“I pass on this knowledge to my students during our discussions of topics such as politics, and most students showed a lot of interest in them,” she said.\n “However, they also found it difficult to perceive how people lived in totalitarian States and were constantly asking me to organise an educational visit to Poland – particularly to Auschwitz camp. They finally convinced me, and with the full support of the school management, I organise the visit.”\nAsked whether the experience was too powerful even though as a teacher she knew so much about it, Vella admitted that reading about it is one thing, but being there, in person, is another.\n“I will never forget the feeling of sadness I felt being there, especially while in the crematorium building and in the room where all innocent victims were led to supposedly ‘take a shower’. I will carry that feeling forever and I am also sure the students will remember it too. It was definitely an eye-opener, an experience of growth for all of us,” she said.\nVella encouraged other schools to take the initiative to organise such educational visits. “Through such experiences we learn more about the value of appreciating one’s own life and that of others. These experiences teach us to cherish what we have and be more willing to help and support people in need. They help us empathise more and take action,” she said.\nHolocaust Memorial Day is not meant to be a day to dwell on the past, but rather to learn from it, and take action to create a safer future. In their daily life, students need to realise the consequences of prejudice and of the language of hatred.\nStudents must be moved to challenge. Living in our fragile and vulnerable world, a world still prone to genocide, our young people, need to understand that they cannot be complacent.  \nPersonally, I really feel that this has been an opportunity for our students to reflect on what Fr Pedro Arrupe, the Jesuit General, dreamt all Jesuit students to be: men and women for others.", "comment_count": 0, "id": 1350}, {"keywords": "Gozo", "author": "", "article_body": "Last Sunday, Xagħra celebrated the feast of St Anthony the Abbot with a concelebrated Mass led by Gozo Bishop Mario Grech at the chapel dedicated to the saint at Tal-Qaċċa area and band marches by the Victory Band of Xagħra. In the morning, archpriest Mgr Carmelo Refalo blessed horses at St Anthony Square. Mgr Refalo, assisted by altar boys, handed bread to participants in keeping with the tradition of giving bread and wine to the poor during the feast of St Anthony. In the afternoon, there were activities for children at the square.", "comment_count": 0, "id": 1351}, {"keywords": "Gozo", "author": "", "article_body": "Pranzu Statali is a poema in historical fiction which conceives a grand conclusion to Valletta 18 with a State banquet for the protagonists of the history of Malta throughout the ages, from Calypso and Odysseus to present day Prime Minister Joseph Muscat. This particular fictional setting, however, gives the reader an opportunity to delve in historical situations as rendered by eminent research in the historiography of these islands.\n\nOne hundred and forty heroes and anti-heroes meet under the glare of the lights of the banquet hall… they greet one another or glance with suspicion at each other. They discuss or debate controversies. Someone tries to redeem oneself from the condemnation attributed by first impressions in history pages… some are prompted by waiters to raise thorny issues which would be fodder for the bloggers.\nThis is the sixth publication by former editor of Il-Ħajja f’Għawdex Joseph W. Psaila.", "comment_count": 0, "id": 1352}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Live, a non-governmental and voluntary educational organisation run by Barbara Day, celebrated Gozo’s young writers for the fifth consecutive year at the Gozo College Middle School in Victoria. Around 268 students showcased their talent by reading an extract of their own writing and share their inspirations with Gozo Minister Justyne Caruana, heads of schools, department heads and a large number of students and family members. The deadline of the next writing competition, sponsored by EcoGozo, is April 2019. Picture shows Directorate for Learning and Assessment Programmes assistant director Alice Micallef presenting a certificate to Ally Zerafa, a student at the Happy School.", "comment_count": 1, "id": 1353}, {"keywords": "Gozo", "author": "", "article_body": "• Goosebumps 2: Haunted Halloween (PG) will be screened at the Don Bosco Oratory, Victoria, today at 5.30pm.\n• A special prayer meeting for children will be held at the Don Bosco Oratory, Victoria, tomorrow at 5pm. The meeting, led by Fr Michael Said, is in preparation for the feast of St John Bosco next Sunday. All children present will be given a token. A prayer meeting for adolescents and youths will be held at the Oratory chapel on Friday at 8pm. The meeting will be led by the Maltese youth group ‘The Call’. A festive buffet dinner will be held on Saturday evening at Ta’ FrenĊ Restaurant. For reservations call 9948 7751.\n• A blood donation session will be held at Xewkija District Health Centre on Tuesday from 1pm to 5pm.\n• A Don Bosco Grand Concert, ‘A Classic Showcase’, will be held at the Don Bosco Theatre in Victoria next Sunday at 7pm. Entrance is free.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1354}, {"keywords": "", "author": "", "article_body": "Michela Pace will be flying the Maltese flag in Tel Aviv come May for Eurovision 2019 after being crowned the first-ever winner of X Factor Malta.\nThe 18-year-old beat Owen Leuellen, Nicole Frendo and Petra to the title, with her soaring voice winning over TV audiences and wowing the crowd at the MFCC in Ta’ Qali.\nMichela’s victory means she will now sign a record deal with Sony and go on to represent Malta at the 2019 Eurovision Song Contest, which will be held in Israel.\nThe four finalists were first whittled down to three and then two, with first Petra and then Nicole bowing out.\nThat left Owen Leuellen and Michela Pace to vie for the title, and the two gave it their all in a final round. But there could only be one winner.\nMichela began the final night just as she had started her X Factor journey, with a performance Bonnie Tyler’s Total Eclipse of the Heart.\nMaltese tenor Joseph Calleja joined her on stage for a duet between rounds, and she then paid homage to her Gozitan homeland in singing The Tramps’ classic Inti Djamant in the second round.\nShe channeled Lady Gaga for her final song, belting out Shallow with as much might as she could muster.\nRecord viewers and even political controversy\nHer victory caps the maiden season of an internationally-syndicated show which took the UK by storm when it first aired in 2004.\nMalta’s version of the show captured the public’s imagination, courted controversy and even seemed to inspire policy makers.\nBroadcasting Authority figures released late in 2018 revealed it had managed to wrestle TVM top dog status from Friday night staple Xarabank.\nThe show made national headlines in October, when Equality Minister Helena Dalli stood up in parliament and took the show’s producers to task for having done “untold damage” to LGBTIQ youth by airing a segment in which a contestant said they “used to lead a homosexual lifestyle” until they found religion.\nThe Gozo Ministry was far more enthusiastic about the show: late in December, it announced that it would be paying for young Gozitans to watch the show live, under the pretence that doing so would support young Gozitans “in their journey to become professional artists”.\nCorrection: A previous version stated that Ms Pace is 17-years-old. She is 18.", "comment_count": 46, "id": 1355}, {"keywords": "", "author": "", "article_body": "The engineering courses offered by Mcast are currently still being restructured to ensure they are “on equal footing” with those offered at the University of Malta, the Chamber of Engineers has insisted.\nThe chamber’s comments came in the wake of a Times of Malta report earlier this week revealing that a group of some 150 engineers, calling themselves the Warranted Engineers Action Group (WEAG), have banded together and are mulling legal action against the government’s Engineering Profession Board over warrants handed to Mcast students. \nThe chamber, a non-governmental organisation, said it noted “with concern” the group’s actions, deeming these as“not being beneficial to the stance of the engineering profession in Malta”.\nThe WEAG have insisted that a report auditing the programmes offered at both the college and the University had yet to be made public. In light of this, they were also questioning whether the course offered at Mcast was on par with that of the University since, as of September, warrants started being issued to graduates from both institutions. \nThe chamber said that it had issued a position paper following the report by the Accreditation Agency Specialised in Accrediting Degree Programmes in Engineering, Informatics, the Natural Sciences and Mathematics (ASIIN), outlining a series of observations and requests. \nThe profession needs a solid academic base\nWhile the course offered by Mcast was split into two components of two consecutive years, the one offered by the University involved the attainment of qualifications over four consecutive years, the chamber noted, adding that this raised certain concerns. \n“Discrepancy in the attainment of academic qualifications leads to a deficit in public safety, especially that concerning the safety of employees or self-employed persons and which includes also the protection of recipients of services or even a third party. It was, therefore, the opinion of the chamber that the issue of public safety should be considered a justifiable measure to eliminate such deficit in the attainment of academic qualifications through an engineering degree offered by Mcast,” the body said.\nMcast, the chamber said, should amend the present conditional requirements relating to the engineering courses to be in conformity with those established by the Engineering Profession Board, so that engineering degrees issued by both the University and Mcast will be put “on equal footing”.\n“We need to move away from the concept that engineering can also be considered a vocational degree because due to the complexities of modern-day technology, the profession needs a solid academic base that is only given through proper academic teaching,” the chamber went on. \nThe chamber claimed that the government’s board has already requested that Mcast restructure their engineering degree to make it equivalent to other courses that are already recognised. The review of the course content, it said, was being managed by the board through the nomination of two independent experts. \nclaire.caruana@timesofmalta.com", "comment_count": 29, "id": 1356}, {"keywords": "", "author": "Ivan Martin", "article_body": "Some €6 million held in four Maltese gaming companies has been seized by the Palermo courts as part of anti-Mafia crackdown, Italian media has reported. The Court of Palermo ordered the asset seizure last week on the back of a request by the Sicilian police, according to La Repubblica.The case is focused on Phoenix International Ltd, which operated several online betting sites, including B2875.com, Bsport24.com and B28sport.com in Malta, before the Maltese authorities last year suspended its license.The suspension had followed raids on dozens of internet cafés by Italian police, in a Palermo-centred anti-mafia operation dubbed 'Game Over'.  Among the 23 individuals arrested in the operation was B2875 owner Benedetto Bacchi, the so-called ‘betting king’ who reportedly controlled a network of 700 betting shops across Italy.\nRead: Malta-based gaming firms in anti-Mafia inquiryMr Bacchi’s betting shops – officially ‘data transmission centres’ or CTDs – featured terminals that connected to the Malta-licensed Phoenix gambling sites.The unauthorised operations reportedly generated undeclared revenue of €1 million each every month, with a chunk of that sum allegedly kicked back to Cosa Nostra members. Mr Bacchi and many of his co-accused have been formally charged with money laundering, mafia association, fraud and numerous other offenses linked to organised crime. Among the co-accused is Mafia clan boss Francesco Nania.\nMeanwhile, the Sicilian police have also requested action be taken on 11 properties across Sicily, a number of vehicles, and several other companies believed to be linked to the racket.", "comment_count": 9, "id": 1357}, {"keywords": "", "author": "", "article_body": "Updated at 6.28pm\nFuel pumps will remain open throughout the night on Saturday and Sunday, the GRTU said on Saturday, following a “positive” meeting with Energy Minister Joe Mizzi.\nIn a brief statement, the Chamber of Small and Medium Enterprises said that it would be meeting fuel station owners on Monday to present a proposal negotiated with the government.\nAlthough it gave no indication of what the offer consisted of, the GRTU said it would not lead to higher fuel prices.\n“Consumers will not be impacted,” the union pledged, as it said industrial action - which was suspended on Friday as a sign of \"good will\" - would remain on hold until its Monday meeting. \nIn a separate statement, the Energy Ministry said the union had accepted a deal which would not hurt consumers' or businesses' pockets. \nFuel station owners began shutting down their pumps at 6pm every day from last Monday, as a sign of protest after failing to strike a deal with the government about how they would finance pump upgrades which must be in place by next year.\nOperators must refurbish their stations by 2020 to ensure they are in line with requirements set by the environment and energy regulators, ERA and REWS.\nThey say the upgrades could cost as much as €500,000 per station and that they cannot afford to undertake the works without a helping hand from the government.\nThe government has pointed to a 2011 decision to increase fuel stations’ profit margins, and argued that giving in to station owners’ demands would necessitate an increase in fuel prices.", "comment_count": 9, "id": 1358}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The worst genocide in human history might have happened 75 years ago, but its impact lingers on, according to Patrick Siegele, director of the Anne Frank Centre in Berlin.\nThe devastation caused by the Holocaust taught the world that stereotyping could turn into discrimination, racism and antisemitism, which in turn could lead to the murder of a whole population, Mr Siegele told the Times of Malta ahead of the International Holocaust Remembrance Day.\nHe referred to a recent study by the Fundamental Rights Agency which shows that 90 per cent of Jews in nine countries observe that antisemitism is on the rise, while 34 per cent avoid visiting Jewish events or sites because they did not feel safe. \n“Although ideal, I don’t believe we will ever live in a society without discrimination. Human rights will always be threatened and I’m convinced that this will be an ongoing struggle in any democracy. That is why we have to remember the Holocaust every year.”\nThis week Mr Siegele toured schools in Malta at the invitation of the President’s Foundation for the Well-being of Society, sharing Anne Frank’s story in a bid to humanise the theoretical issues of discrimination and human rights.\nHe noted that the story of Anne Frank was also a story of people who offered help – people took a stand despite the dangers. If it was possible to defend human rights during a time of harsh dictatorship, then it was definitely possible to take a stand nowadays, Mr Siegele added.\nAs keynote speaker at the Holocaust Remembrance Day at San Anton Palace, Mr Siegele meanwhile noted that the impact of the Nazi regime injustices has lingered to this day.\nPatrick Siegele, director of the Anne Frank Centre in Berlin. Photo: Matthew Mirabelli\nOne “profoundly sad” example is that of LGBT men: about 10,000 men, mostly German and Austrian, were deported to concentration camps, including Auschwitz. \nFar from receiving any kind of compensation or recognition of what they had gone through, those who survived continued to face criminalisation afterwards.\nSexual relations between men remained punishable in Germany until 1969. Only in 2017 did these men, whether they were sentenced under the Nazis or in post-war Germany, receive the right to compensation, a change that came too late for most, he said. \nThe story of one of these men – Wolfgang Lauinger – is told at the Berlin centre. He died in December 2017 aged 99, soon after his first compensation claim was rejected.\nTomorrow the world marks the liberation of the Auschwitz-Birkenau concentration camp in 1945. For years the remembrance was largely confined to Israel, Germany and the US, where most of the survivors live. \nThe UN declared January 27 as the International Remembrance Day for the Victims of the Holocaust in 2005. Nowadays, the remembrance alliance consists of 31 member countries, including Malta.", "comment_count": 42, "id": 1359}, {"keywords": "", "author": "", "article_body": "Updated 5.10pm\nTwo men were badly burnt and rushed to hospital on Saturday afternoon after a fire broke out near a fireworks factory in Żebbuġ.\nParamedics rushed Wied Qirda shortly after 3pm following reports that people had been seriously injured in an incident a few metres away from the main complex.\nThe men, both Żebbuġ residents and aged 58 and 26, were burning some material close to the factory at the time. \nFirefighters, paramedics and members of the Armed Forces' Explosive Ordnance Disposal Unit were all involved in the emergency response. \nBoth men are being treated for grievous burns at Mater Dei Hospital, sources said. \nMagistrate Audrey Demicoli is leading an inquiry into the incident.", "comment_count": 0, "id": 1360}, {"keywords": "", "author": "", "article_body": "The last remaining NGO rescue vessel in the central Mediterranean remains stuck off Sicily’s eastern coast, with Italy’s government refusing the Sea-Watch 3 entry despite the vessel receiving an invitation from the mayor of Syracuse.\n34 adults and 13 children are stuck aboard the ship, which rescued them off the Libyan coast and has since been stranded, with Italy steadfastly refusing it entry first at Lampedusa and then in Sicily.\nThe ship and its crew reached Syracuse on Thursday as a bitter storm raged across the region. Their plight appeared near its end when the city’s mayor said the ship and its passengers were welcome to disembark.\nBut Italy’s federal government, which has adopted a hardline stance towards migrant arrivals and declared the country’s ports closed to all NGO rescue vessels, had other ideas.\nAs the Sea-Watch 3 neared land, it was assigned a berth out at sea, ensuring it remained off land, the NGO said in a statement.\nCatania’s prosecutor has since issued an order to allow the 13 minors aboard the vessel to disembark. But that order might end up being counterproductive, the NGO fears.\n\n\n\n ", "comment_count": 0, "id": 1361}, {"keywords": "", "author": "", "article_body": "A government department whose services were sought by many, especially notaries and their staff, remained neglected for many years and was “in shambles with the situation now being almost inhuman”, the Times of Malta was told.\nFormerly a division of Identity Malta, the Land Registry, in West Street, Valletta, resembled a building hit by enemy fire during World War II, a frequent client complained to this newspaper.\n“We have been telling the government, particularly the Transport Ministry responsible for the department, about the embarrassing situation for a long time”, an employee said, insisting on anonymity.\n“The building is falling to pieces and it is not even adequate to be used as a pigsty. Still, no one ever bothered to take the initiative. The place has not been plastered or whitewashed for long years,” another staff member commented.\nA senior official who has been working there for many years said the office, which mostly dealt with the registration of promises of sale and sale contracts of land and buildings worth millions of euros, remarked that the situation had been deteriorating and had now become almost “ridiculous”.\nRead: What do land surveyors do?\n“Apart from the state of the building, which is almost dangerous with structural cracks appearing everywhere, basic requirements, such as regular cleaning and maintenance, are not met.\nDustbins remain full, files are all over the place and the toilets are almost no-go areas. Filth is everywhere\n“Dustbins remain full, files are all over the place and the toilets are almost no-go areas. Filth is everywhere and it seems many of our clients have accepted this as a permanent state of affairs,” the official added.\nBut, according to the reports reaching this newspaper, the physical state of the department is not the only problem there.\n\nA staff member claimed that “many senior employees” seemed to have ample time on their hands to do private work. “It is an open secret that some employees are ‘attached’ to certain notaries and their private offices and give them priority in their requirements,” another said.\nA notary who spoke to this newspaper on condition of confidentiality admitted that people in his profession were aware of “who works for who in the department”, adding  the practice was practically “accepted” now.\nJust a few days ago, the government announced that the department, where about 25 employees work, would be transformed into a new state-owned agency, independent of Identity Malta. Both staff members and clients expressed the hope the move would give a fresh start to the department, though others expressed scepticism, arguing that some senior officials at the registry had too much to lose if things were reformed and operations progressed in a proper and orderly manner.\nQuestions to the Transport Ministry on the state of affairs of the building hosting the department and its future plans to reform the archaic system used in the way the registry operated remained unanswered at the time of writing.\nivan.camilleri@timesofmalta.com", "comment_count": 6, "id": 1362}, {"keywords": "", "author": "", "article_body": "Updated at 4pm with government statement\nA blockchain company's decision to sack its workers just six months after setting up in Malta shows the government has no plan how to entice investment, the Nationalist Party charged on Saturday.\nThe company DQR has been forced to fire most of its 65 staff and freeze its operations in Malta after one of its main investors, the German Bitcoin mining company Genesis Mining, ran into difficulties, according to Lovin Malta. \nBack then, parliamentary secretary for the digital economy Silvio Schembri hailed it as one of the largest blockchain companies in the world and said its presence “will cement Malta’s reputation as the Blockchain Island”.\nCryptocurrency markets have had a torrid time over the past 12 months, with prices crashing from all-time highs and struggling to regain momentum. \nPN spokesperson Kristy Debono said in a statement that the government can only see through its vision of turning Malta into a 'blockchain island' if it draws the interest of renowned companies that could provide their expertise and invest in Maltese workers.\n\"Instead of spouting empty words, the government should ensure we are not amateurs where it comes to the economy and that due diligence is carried out properly when giving out licences. We can't continue denting our reputation and credibility,\" she said. \n'Just out to criticise' - PL\nMr Schembri's secretariat soon hit back with a statement of its own, in which it noted that the PN had declined to take part in any of the six public consultations held concerning blockchain legislation and the sector. \nIn the statement, the digital economy secretariat accused the Opposition of being \"against economic innovation and blockchain\" and said that the government and financial regulator would continue to work to ensure the sector grewin Malta. ", "comment_count": 82, "id": 1363}, {"keywords": "", "author": "", "article_body": "After ruining substantial stretches of land, land speculators have turned their attention to coastal waters to satisfy their never-ending greed, Alternattiva Demokratika warned on Saturday.\nThe indications that the Environment and Resources Authority has identified the coastline between Ricasoli and Żonqor Point as the most suitable part of the coastline for land reclamation is worrying, AD chairman Carmel Cacopardo told a news conference along the Xgħajra promenade.\nRead: Just one place in Malta is suitable for major land reclamation, experts sayAlthough no definite decision has yet been taken, the identification by ERA of this zone is the result of pressures to find a site suitable for the dumping of inert waste resulting from large-scale projects such as the proposed tunnel between Malta and Gozo as well as the dB project at ITS and the Corinthia project on the Pembroke peninsula.\nThese projects which could well yield around one and a half million cubic metres of construction waste, Mr Cacopardo said.Projects which could well yield around one and a half million cubic metres of construction wasteThis area has already been used as a dumping site for construction waste from other large scale projects, such as the MIDI mega-project on the Tigne peninsula. It is also severely degraded as a result of the sewage outfall.AD is aware that the government is in receipt of around 20 expressions of interest for projects involving land reclamation along various stretches of the coastline. \nIt is also known that the most conspicuous are projects between Portomaso and Baħar iċ-Ċagħaq, notably the recent request related to the Corinthia project on the Pembroke peninsula and the area linked to Portomaso which formed part of the discarded Paceville Masterplan.\n\"Government is unfortunately committed in favour of land reclamation in principle and hence declarations from government officials distancing themselves from the ERA indications are not credible,\" Mr Cacopardo said.", "comment_count": 36, "id": 1364}, {"keywords": "", "author": "", "article_body": "Forty individuals on Friday night formally set up Repubblika, a non-governmental organisation that wants to promote democracy and the rule of law in Malta.\nRepubblika has been set up to promote civil rights, democratic life, the rule of law, free speech, personal freedoms, social inclusion, environmental conservation, economic sustainability and equality of access, by means of active participation in the national discourse and related educational, social and charitable initiatives.\nMembers approved the election of the first executive committee for Repubblika that will be chaired by Marion Pace Asciaq. Dr Robert Aquilina is general secretary and Paula Fleri-Soler is treasurer.\nRepubblika will now apply for registration with the Commissioner for Voluntary Organisations and in the Register for Legal Persons as required at law.\nThe founding members approved the organisation’s statute that is now published on Repubblika’s Facebook page at www.facebook.com/Repubblika\n ", "comment_count": 27, "id": 1365}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Valletta 2018 Foundation spent more than €40,000 on parties, receptions, dinners and alcohol during the first eight months of last year. V18 chairman Jason Micallef. Photo: DOI\nThe information emerged in Parliament from Culture Minister Owen Bonnici in reply to a question by Nationalist MP Jason Azzopardi. The data supplied covers all the entities that fall within the minister’s remit. \nAccording to the figures, until the end of August last year, the Valletta 2018 Foundation, tasked with overseeing the European Capital of Culture festivities, spent €40,231 on parties, receptions, dinners, the purchasing of alcohol and “other similar things”.\nThroughout the previous year, the foundation spent about €5,573 on such activities, the tabled data shows.  \nDuring first eight months of the year Malta Philharmonic Orchestra also splurged on similar activities, spending some €18,689. The figure was slightly lower than that spent throughout the entire previous year, when €19,736 was forked out. \nOther entities, including the Arts Council Malta, the Medicines Authority and the Public Broadcasting Services, the numbers show, did not exceed the €5,000 mark, spending various amounts that ranged from €150 to €3,300. \nAccording to the data, for the first time in a number of years the Public Broadcasting Services (PBS) spent far less than usual on parties, receptions and alcohol.\nWhile in 2017 the PBS spent some €17,658 on such activities, by August last year, it had only forked out just over €2,300. This was the lowest amount spent since 2013 where every year since, the PBS had forked out more than €10,000 per year on parties and receptions, the data shows.\nIn recent months, the Times of Malta has also reported other government entities’ spending on parties, receptions and the purchasing of alcohol, notable that by the Malta Financial Services Authority. In 2017, the authority had spent €55,355, a bill that was found to be significantly higher than that of other authorities.", "comment_count": 36, "id": 1366}, {"keywords": "", "author": "", "article_body": "A new board for affordable accommodation has been set up with the intention of studying, proposing and help with a plan of action. \nSet up by the Parliamentary Secretariat for Social Accommodation, the board is also expected to focus on viability of pilot projects intended to create more buildings at affordable rates.\nHeaded by Joe Bartolo, the board will form part of the Housing Authority.\nParliamentary Secretary Roderick Galdes said the concept was different from the traditional concepts of social accommodation. \n\"The government's aim is to help and not disrupt the market. The aim is to create a market which can meet everyone's budget.\"\nSimilar models of housing were available around Europe where land is handed over to social enterprises which administer a project at cheaper market rates, the secretariat explained in a statement.\nHousing Authority chief executive Leonid McKay said the project will help to drive social mobility to assist all families. ", "comment_count": 8, "id": 1367}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "The Malta Council for Science and Technology, which manages a multi-million euro budget, has been without a board of directors for the past 18 months.\nAlthough the Office of the Prime Minister had said last year the directors’ appointment was “imminent”, this “inexplicably” did not yet happen and decisions were being made by its chairman and CEO, Jeffrey Pullicino Orlando, council sources said.MCST chairman and CEO, Jeffrey Pullicino Orlando.\nDr Pullicino Orlando, a dentist, is a former Nationalist MP who unsuccessfully contested the last general election on a Labour ticket.\nAll administrative matters, including procurement and recruitment, were being handled by Dr Pullicino Orlando, they pointed out.\n“The situation is more complicated because the executive chairman is not present all the time since he still has to attend his private clinic,” a senior official said. This meant, he added, that decisions were either not made or were taking a long time to be made, apart from the fact that there was nobody at the chairman’s level or above to then vet such decisions.\nIt is not yet known why the directorship posts have remained vacant since June 2017.\nWhen the Times of Malta reported on the matter last summer, the government had said the appointment of the board was “imminent”. This is also declared in the science agency’s website.\nThe executive chairman is not present all the time\nAsked again on Friday about the state of affairs and why the board was still not appointed, a spokesman for the Office of the Prime Minister reiterated this would be done soon. Asked for a timeline, the spokeswoman said it would happen by the end of March.\nThe previous Nationalist government had appointed Dr Pullicino Orlando as non-executive chairman. Then, following Labour’s return to power in 2013 and the departure of the CEO, Dr Pullicino Orlando assumed an executive role and was given an annual package of €60,000.\nAfter the Times of Malta had spoken to the MCST receptionist and his assistant at his Żebbuġ clinic, it resulted that Dr Pullicino Orlando usually spent one day a week at the science agency’s office in Bighi. He had, however, insisted that he still spent 40 hours a week doing MCST-related work, most of which consisted of meetings outside his office.\nThe last annual report published by the agency covers 2015.", "comment_count": 33, "id": 1368}, {"keywords": "", "author": "", "article_body": "The Foreign Affairs and Trade Promotion Ministry has launched a call for development projects, subsidised by a 90% government grant, to be implemented by CVO-registered NGOs in north and Sub-Saharan Africa and the Middle East, preferably where Malta has diplomatic representation. Partnering with NGOs through such projects represents one way the Maltese government applies its Official Development Assistance (ODA) and its commitment towards reaching the sustainable development targets of the 2030 agenda, the ministry said in a statement.\nMalta’s overseas development commitments signal Malta’s intention to engage proactively with Africa, in particular, through a combined trade and development policy. These projects help build more resilient communities, improve access to proper healthcare and create opportunities in the educational sector that collectively aim to improve people’s lives.“Annual calls for projects in support of development and capacity-building projects are an expression of partnership and commitment to change in line with Malta’s international commitments. NGOs are valued partners. Their people-to-people approach through local partnerships ensures that these funds can make a real difference to local communities”, Minister Carmelo Abela said.Appreciative of the direct role that NGOs have in implementing the external dimension of the 2030 agenda, over the past year, the ministry embarked on a consultation exercise to understand needs based on their first-hand experience.\nThe 90% grant share shall be awarded on the ODA-eligible project costs at a capping of €75,000 per project and within the limits of the ministry’s financial provision for ODA projects for 2019.Project proposals are to be exclusively submitted online on www.vofunding.org.mt by not later than noon of Friday, 15th February 2019.", "comment_count": 6, "id": 1369}, {"keywords": "", "author": "Jacob Borg", "article_body": "Nationalist MPs are still being kept in the dark about a meeting date for the parliamentary group, according to information reaching the Times of Malta.\nThe group has never convened since Opposition leader Adrian Delia was accused of domestic violence by his estranged wife in December.\nDr Delia has denied the allegations and refused to entertain any discussions about his ongoing separation.\nA number of Nationalist MPs have privately called for his resignation but have repeatedly stopped short of making their demands public.\nDr Delia said last week he was not informed when the parliamentary group would be meeting.\nRead: PN leader postponing ‘showdown’ with MPs\nDespite parliament approaching its third week of business since the Christmas recess, the Times of Malta is informed that no meeting date has yet been communicated to MPs.\nRead: PN MPs left in the dark as Delia fails to reconvene group\nMuch like the parliamentary group, a meeting date for the executive committee, the party’s second-highest decision-making body, also remained elusive, PN sources said.\nPN executive committee president Mark Anthony Sammut said earlier this month a meeting would inevitably discuss the allegations against Dr Delia. However, the party sources said that no date had yet been communicated by secretary general Clyde Puli.\nQuestions to the PN about both meetings were not answered by the time of writing. \nThe party’s administrative council declared its “unconditional support” for Dr Delia earlier this month. \nApart from the domestic violence allegations, Dr Delia is also facing questions about his personal finances and a police investigation about suspicious money laundering operations connected to a London prostitution ring years ago in which he had been involved as a lawyer. He denies any wrongdoing.\nThe Sunday Times of Malta reported last month Dr Delia’s alleged involvement in the London racket dated back to 2004, when a Barclays International account in Jersey held in Dr Delia’s name was reportedly used to process the payments of rents for the London properties involved in the racket.", "comment_count": 35, "id": 1370}, {"keywords": "", "author": "", "article_body": "These are the main stories featured in Saturday's newspapers:\nTimes of Malta reports that a former supermarket chain co-owned by the Deputy Prime Minister’s chief of staff had been pursued by the Inland Revenue Department for unpaid taxes and penalties totalling €2.9 million. It also reports that small and medium enterprises have shot down an EU directive through which men will benefit from 10 days of paternity leave while employers said they will not fork out a cent.\nL-orizzont quotes Prime Minister Joseph Muscat saying unemployment had been slashed by 75 per cent in six years. It also reports that Astracast employees will be getting their pays until the company's date of closure.\nIn-Nazzjon focuses on the state of the Corradino Correction Facility, saying that prisoners had been reported taking drugs while others were on hunger strike. \nThe Malta Independent says MCAST was waiting for the teachers' union to lift directives as educators' salaries were finally paid out. ", "comment_count": 1, "id": 1371}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Updated 5.20 with A4E reaction\nSmall and medium enterprises have shot down an EU directive through which men will benefit from 10 days of paternity leave while employers said they will not fork out a cent.\nThe European Parliament and Council of Ministers have agreed on a new Work Life Balance Directive, which will, among others, introduce a 10-day paternity leave remunerated at not less than the national sick pay level – up from the current one-day allowance.\nRead: New rights for parents and carers agreed upon in European directive\nReacting, the Chamber for Small and Medium Enterprises (GRTU) said it would be better for member states to assess the most effective way to increase women’s participation in the labour market as well as to promote equal participation of women and men in caring parental tasks. \nIntroducing paternity leave at European level was not considered appropriate and the GRTU disagreed with it, CEO Abigail Mamo told the Times of Malta. \nWhile the EU pushed for harmonisation on a topic of extreme diversity, for Malta this was considered a big step not because employers were against the participation of fathers but because human resources “are what they are and small and micro companies will find this most burdensome”.\nTo put things into perspective, Ms Mamo said that in 2017, Malta had 7,712 births. This meant that from 7,712 extra days of birth leave, Malta would see an overnight increase to 77,120 extra days of leave. \nThe figure, she said, was astronomical.\n“The absence of these employees from work already creates a big difficulty for businesses, even if one had to exclude the cost. We reiterate that in the context of already scarce human resources, this is difficult news to deal with.”\nThe absence of these employees from work already creates a big difficulty\nThe level of payment for any type of leave arrangement should not be at the European level to decide, she said, adding that the competence of member states and social partners needed to be respected. \nApart from paternity leave, the new directive, led and negotiated by Maltese MEP David Casa, will introduce new rights such as flexible working arrangements and a five-day carers leave for those who need to take care of relatives.\nThe next step is for the Parliament’s plenary to vote on the final agreement in the coming weeks. After that, the directive should start being adopted by governments in all EU states.\nAccording to the Malta Employers’ Association, providing better options when combining work and family life was based on the belief that such entitlements would result in net economic benefits even if they entailed an element of disruption at the workplace. \n“Theoretically it should lead to a higher participation rate and better retention of skilled employees which is, of course, beneficial to companies,” director Joseph Farrugia said. \nHowever, he pointed out that the agreement failed to specify who would be funding these measures, as it has left it up to member states to decide. \n“The MEA shall strongly resist any further financial burdens on employers, and insist that, in line with many other countries, it is government who has to finance such social services.”\nMeanwhile, the Malta Chamber and the Malta Hotels and Restaurants Association urged the government to consult extensively with employer organisations to avoid additional costs on businesses.\nRead: Employers don't want workers getting any more time off\nThe Malta Business Bureau – the EU research and advisory arm of the two – lobbied actively in Brussels in order to reduce the impact on business operators over the implementation of the proposed directive.\nThe MBB, while cautious on the directive itself, welcomed the compromise deal that would allow member states to determine the level of remuneration for employees for parental and carers’ leave in their own labour market, rather than this being set by the EU. \nThe directive also determined that paternity leave will be paid at not less than the level of sick leave of the respective member state. \n“In this case, subsidiarity prevailed, whereby decisions will be taken closer to citizens and reflect national economic realities,” MBB president Simon De Cesare said.\nLook at positive long-term effect - Casa \nNationalist MEP David Casa, said while he understood the business community being sceptical about providing additional rights to parents the issue being discussed is 10 days of leave for fathers when a child is born.\n\"From the perspective of the employee this constitutes a right that on average would be used once or twice during these crucial times in a worker’s life. In comparison to far more generous parental rights in many member states, for Malta, implementing this minimum standard, is a step in the right direction.\"\nThe directive does not establish how the leave is paid because this would go beyond the EP's competence.\n\"My strong appeal to the Maltese government is to ensure that the financial cost of these measures does not fall on business. But I also appeal to the business community to take account of the positive long-term impact of the directive.\"\nMr Casa said the higher than average gap in Malta means the country has a lot to gain than other member states through a reduction in this gap and by assisting women in reaching their full potential in the workplace.\n\"I look forward to discussing more precisely what has been negotiated in this directive, and the positive impact it will have, together with the business community as well as unions in the coming days and weeks.\"\nA good move for paternity rights - A4E\nThe Association for Equality welcomed the new EU directive, saying it was a positive step towards ensuring more equality for fathers. \n\"The existing two-day paternity leave is a huge injustice and 10 days is the least that fathers should be granted,\" the A4E said. \nEnsuring that half of parental leave would be paid was also a positive step, they said, especially if fathers received their full salary during this time. \n\"A4E urges the government to move towards the swift transposition of this directive and hopes that payment levels will be high,\" the organisation said. \nIt urged the government to step in and invest to ensure the directive was fully implemented.\n\"Payment for these family related leaves should not fall on the shoulders of employers but should be seen as an investment in families by government – especially in a context of falling birth rates, which are below the replacement rate,\" A4E said. ", "comment_count": 135, "id": 1372}, {"keywords": "", "author": "Keith Micallef", "article_body": "Hopes that the competition watchdog was coming out of limbo following a three-year hiatus were dashed after it transpired that law changes presented in 2018 are being “reviewed” in the wake of a recent judgment.\nConsequently, the Competition Office will remain toothless as it can neither impose fines nor lead its own investigations to determine if a breach was committed or not.\nThis development came to light through a parliamentary question tabled by Opposition MP Chris Said who asked Justice Minister Owen Bonnici whether the saga would end anytime soon. The minister replied that the Bill comprising the necessary changes to the law would be published sometime in 2019.\nThe issue revolves around a landmark May 2016 Court of Appeal judgment, which found that certain provisions of the Competition Act were unconstitutional.\nThe case had been instituted by the Federation of Estate Agents, which had felt aggrieved by the decision of the Director for Competition to proceed against it over alleged breaches of the law. It argued that only a proper court could decide such matters given that, in case of ‘guilt’, it could be fined up to €1.25 million.\nFollowing the judgment, the Competition Office announced it would be refraining from imposing any fines until the situation was remedied.\nThe issue revolves around a landmark 2016 judgment\nIn January 2017, the government opted to address the situation through constitutional amendments but the changes were shot down by the Opposition amid fears these would dilute the right of a fair hearing.\nThe Justice Ministry had a bite at the cherry last August when it published a Bill for public consultation. The main thrust of the proposal was to abolish the Competition and Consumer Appeals Tribunal so decisions by the regulator could be challenged before the Civil Court (commercial section).\nThe proposed amendments had a positive feedback but the government faced a fresh set-back last November, this time following a legal challenge filed by San Lucian Oil Company Limited, a member of Falzon Group Holding.\nThe Falzon Group had taken the Competition Office to court following a ruling in January 2017, whereby it was found guilty by the Director for Competition of colluding with the owner of M&N Camilleri fuel station of Rabat to fix the price of diesel.\nThough no fine had been imposed in line with the 2016 judgment, the oil company contested the decision on grounds that such proceedings should have been heard before a court because competition law breaches were of criminal nature.\nThe court upheld the oil company’s arguments, saying the Competition Office was not empowered to hold its own proceedings to determine if a breach had been committed or not.\nFollowing this decision, Times of Malta had enquired with the Justice Ministry on the way forward but no reply was ever received. The issue surfaced again in Parliament on Wednesday.\nIn his reply to Dr Said’s parliamentary question, Dr Bonnici said that, in light of the recent judgment, the amendments proposed last year were being “revised”.\nIn another reply, he pointed out that the new Bill would be published “this year”.", "comment_count": 1, "id": 1373}, {"keywords": "", "author": "", "article_body": "Mater Dei Hospital has joined the movement calling for a reduction in single-use plastic by replacing its employees’ plastic cutlery with metal ones.\nAs from February 1, the hospital will stop usage of disposable plastic cutlery by its employees.\nThis initiative will see the elimination of some two million pieces of plastic items per year.\nGoing a step further, the hospital is asking planned in-patients or visitors to bring their own cutlery, to drop the dependency on single-use plastics.\nThe hospital noted that patient meals would continue to be supplied with disposable cutlery sets.", "comment_count": 20, "id": 1374}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Monte di Pietà official at whose home the police had discovered gold items and pawning tickets has been cleared of abusing his official function almost 13 years after criminal proceedings had kicked off.\nJoseph Mifsud had originally been targeted by prosecution over alleged wrongdoing dating back to 2001 when the police were alerted to “suspect underhand criminal activity” at the State pawning shop, after an internal inquiry had revealed that pawned items had gone missing from the Monte’s vaults.\nInvestigators had later searched the suspect’s home where they discovered a number of valuables and some 11 pawning tickets.\nCriminal charges were issued against the official who was alleged to have borrowed money by pawning several personal gold items and taking those valuables back home without first redeeming the loan.\nA high-ranking officer at the Monte, testifying in the proceedings, had explained how the pawner would obtain a “calculated capital advance” after his valuable was assessed by an appraiser.\nThe loan would be accompanied by a pawning ticket, a counterfoil copy of which was kept at the Monte, the senior official had explained, adding that the original ticket would be affixed to the counterfoil only once the loan had been redeemed with interest.\nIn this case, investigators had allegedly found the missing gold, together with a number of pawning tickets, in the name of ‘Rose Mifsud’, at the accused’s home.\nWhen the case was reassigned to a different court, presided over by magistrate Donatella Frendo Dimech, in November 2016, it was observed, first and foremost, that the police statement released by the accused, at a time when the right to legal assistance in the pre-arraignment stage “was still far off from taking root in our procedural laws,” was no longer valid as evidence against him.\nApart from this, however, the court also noted various shortcomings which weakened the prosecution’s case.\nAll the tickets retrieved from the accused’s home had indicated the pawner as ‘Rose Mifsud wife of Gino,’ save for one ticket in the name of ‘Rose Mifsud wife of Joseph,’ the court observed, noting further that no ticket had been issued in the name of the accused.\nMoreover, the prosecution had not ‘even remotely’ proven that this woman was actually the accused’s wife, nor that her address was actually the accused’s home.\nAlthough the seized items had been exhibited in court inside a ‘sealed box containing gold items’, among those items had also been silver items and other precious jewels, as well as a handbag and a silver purse, together with the 11 unredeemed pawning tickets.\nThe prosecution had failed to present a list of the items as well as any receipt or seizure note referring to said valuables, the court observed.\nThere had been “an absolute failure” on the part of the prosecution to determine which of the items discovered at the accused’s home corresponded to the unredeemed tickets, the court observed, pointing out the lack of an expert valuation which could have enabled the court to establish the missing link.\nIt was clearly evident that the police had actually “seized more valuables than those relative to the pawning tickets,” the court continued, noting that in fact the police had claimed to have seized some Lm6,000 worth of gold, far in excess of the Lm2,150 indicated on the pawn tickets.\nIn the light of such circumstances, the court concluded that the prosecution had evidently chosen not to delay proceedings unnecessarily, basing its charges upon the ‘evidence’ retrieved from the official’s home and pinning its case upon his statement released during the interrogation.\nOnce that statement was subsequently discarded, on the strength of recent jurisprudence, the prosecution’s case was “irreparably prejudiced,” the court declared, pronouncing an acquittal.\nLawyer Arthur Azzopardi was defence counsel.", "comment_count": 0, "id": 1375}, {"keywords": "", "author": "", "article_body": "Two brothers were arrested on Thursday following a police raid at a residence in Birkirkara.\nThe police said on Friday the raid was carried out after they observed several young people going in and out of the house at several times of the day over several days.\nAt the residence, the police found sachets containing a green substance - a synthetic drug - ready to be trafficked, as well as sachets containing cannabis and a number ecstasy pills. They also found cash, clocks and other items which are still being investigated.\nBesides the two men, aged 18 and 22, a 44-year-old woman with her eight-year-old son was also at the residence, in Triq Santa Tereża, Birkirkara.\nBecause of the bad hygienic conditions at the place as well as the minor’s exposure to drugs, the police sought the assistance of the Child Protection Services Unit within Appoġġ who went on site to see to the interests of the minors.\nAn inquiry is being held, the police are investigating.", "comment_count": 0, "id": 1376}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man currently serving an 18-year jail term over a road rage incident in 2005 is protesting a fresh breach of his right to a fair hearing after his constitutional case was adjourned for judgment 13 times over a one-and-a-half year span.\nStephen Pirotta, 48, has been serving time behind bars ever since his conviction in 2010 following a trial by jury for stabbing a motorist in the chest as the latter sat in his car at Qormi.\nAlmost two years ago, in February 2016, the man had filed a constitutional application claiming that his right to a fair hearing had been breached during the interrogation stage preceding the attempted murder proceedings.\nMr Pirotta had released his statement to the police in September 2005, when the right to legal assistance during the investigation and interrogation stage was non-existent within the Maltese legal scenario.\nThe man subsequently faced trial, was convicted and even had his jail term confirmed on appeal.\nYet in more recent times, the principle of legal assistance in the pre-trial phase was acknowledged not only by a long line of EU judgments, but also by local jurisprudence, such as the judgment delivered in Brian Vella vs AG in December 2018.\nIn that case, a statement released by the accused at a time when a one-hour consultation with his lawyer was permissible at law, was declared inadmissible as evidence against the accused.\nIt was precisely in the light of this scenario that Mr Pirotta had filed a constitutional case seeking adequate redress.\nHowever, that case, currently pending before the First Hall, Civil Court, had been adjourned for judgment 13 times over the past one-year-and-a-half, prompting the applicant to file a judicial protest, holding the State responsible for damages, while reserving the right to take ulterior action.\nWhile acknowledging that adjournments for health reasons were always justified, and while closing an eye to some “one or two” adjournments for unspecified reasons, this did not appear to be the case, the protesting party said.\nIn the majority of instances, the adjournments were put down to the fact that ‘the court needed some more time to deliver judgment,’ Mr Pirotta’s lawyers observed, arguing that this delay was resulting in a further breach of their client’s rights.\nCourt practice and procedure and good order rules distinguished between ordinary and constitutional cases, stressing that the latter deserved to be treated with ‘certain urgency’, the lawyers continued.\nThirteen adjournments over one-year-and-a-half were “not acceptable and constituted a blatant breach of the Constitution and the European Convention,” the protest concluded, declaring that the State was to be held responsible for damages, while reserving the right to ulterior action.\nLawyers Franco Debono, Marion Camilleri and Amadeus Cachia signed the judicial protest.", "comment_count": 0, "id": 1377}, {"keywords": "", "author": "Ivan Martin", "article_body": "Fuel pumping stations will be working all night on Friday as a sign of “good will”, the GRTU said on Friday.\nFuel has not been available after fuel stations close at 6pm all week as part of a nationwide industrial dispute.\nThe action was announced on Monday night following a lengthy meeting with station owners which saw a decision taken for fuel to only be sold while stations are open.\nThe GRTU has warned that the measures could escalate.\nThe two sides have been at loggerheads for months over the implementation of a plan whereby all fuel stations have to upgrade their facilities by next year.\nSuch obligation is dictated by requirements set by the Environment Resources Authority and the Regulator for Energy and Water Services.\nThough the government had made an offer, fuel station owners deemed it below their expectations, saying it would not be enough to cover an estimated expense exceeding €500,000 to modernise each facility.\nHowever, in a statement issued today, the GRTU said pumping stations had suspended the action pending a meeting with Resources Minister Joe Mizzi to be held on Saturday.\nPumping stations, the GRTU said, wanted to be of the least inconvenience to consumers.\nDespite the show of good will, the chamber said the suspension was temporary and if an agreement was not reached following Saturday's meeting the action could continue.\nStation owners have also been withholding licensing payments due to the resources authority.\nEarlier in January, the government rejected their proposal for a higher profit margin.\nThe government last week said it had made an alternative proposal to fuel station owners. No details of the proposals, however, were released by either side.\nIn another statement on Friday, the Consumers’ Association said it was concerned about the threat that the fuel pump owners' strike could continue to escalate.\nIt noted that fuel pumps had already been given an increase in 2011 as compensation to bring the fuel pumps in line with EU standards by 2020.\nThis meant that consumers had been paying for these standards to be reached for long enough.\nIt also meant that the subsidy had been given for the past seven years and rather than using it to improve the pumps, it was turned into profit.\nThe association said it was not at all pleased that it had become the norm that after an agreement is reached, the party getting a subsidy did not keep to its side of the bargain.\nThis could also be seen in the case of the gas distributors agreement. In 2015 they had been given compensation and their obligations included giving a receipt and the establishment of a call centre.\nThe association said it had brought this to the responsible authority a long time ago but nothing had been done.\nIt said it could not understand the justification as to why certain sectors should be given a subsidy to guarantee they acted in line with established standards.\nWhen the VRT was introduced, car owners were not given any subsidy because it was their duty to ensure that their vehicle met the required standards.\nWhile it hoped an agreement that would not be detrimental to consumers was reached, it encouraged the government to ensure that the responsible authorities started to consider more the interests of consumers and ensured that agreements reached were implemented.\n ", "comment_count": 0, "id": 1378}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man with a persistent drug problem was granted bail under a temporary supervision order after being arrested behind the wheel of a car which turned out to have been stolen shortly before Christmas.\nRoderick Cilia, a 41-year-old driver from Għaxaq, pleaded not guilty to knowingly receiving the Toyota Yaris which had been stolen from its owner who had left it parked in Marsa on December 20.\nThe man was further charged with tampering with the car licence disc and the Transport Malta registration mark, as well as with driving the car without an insurance cover, breaching two suspended sentences and the conditions of a previous bail decree.\nProsecuting Inspector Robert Vella explained how an anonymous phone call to the Żejtun police station, where the man went to sign the bail book, alleging that there was ‘something not in order’ with the vehicle driven by the man, had placed the police on his tracks.\nAfter one such appointment with the bail book, the police had followed the man and, after checking his car, had discovered that the chassis number corresponded with that of a stolen vehicle. The number plates too turned out to have been stolen.\nThe suspect had told the police how he had bought the car for some €50 from an unknown third party, the prosecution explained.\nUpon his arraignment, the man denied the charges, his defence lawyer Franco Debono drawing the attention of the court to the fact that his client had a drug problem and that bail under supervision would be the ideal way forward.\nThe prosecution disagreed in view of the nature of the offences, the lack of trustworthiness of the accused as well as the fact that the man had wasted various opportunities granted by the courts.\nAfter hearing submissions, the court, presided over by magistrate Josette Demicoli, upheld the request for bail against a deposit of €750, a personal guarantee of €4,000 and an obligation to sign the bail book three times a week.\nHe was also placed under a curfew as well as a temporary supervision order so that a probation officer might help him to “seriously tackle his drug addiction”.\n“To avoid all these problems you must start from today to tackle your addiction seriously,” were the magistrate’s parting words of advice.\nInspector Wayne Camilleri also prosecuted. Lawyer Damian Cassar was also defence counsel.", "comment_count": 0, "id": 1379}, {"keywords": "", "author": "", "article_body": "The “vain promises” of progress made by moguls “interested in swelling their coffers” should not be taken at face value, the Church’s Environment Commission has warned.\nIn a statement issued on Friday afternoon, the Commission expressed its disdain at the “monster” cranes which littered Malta’s skyline but struck a hopeful note in noting that the number of people and communities willing to oppose unsustainable development was on the rise.Corinthia Group boss Alfred Pisani.\n“The irony of it all is that whoever is interested in simply swelling his coffers tries to have everyone believe that Malta cannot do without such development as this is a sign of progress,” the Commission said.\nIts statement comes just one day after Corinthia Group chairman Alfred Pisani appeared to liken opponents to his group’s St George's Bay plans to Luddites.\n“People once feared the introduction of the computer,” he argued on TVAM. “You must always accept progress”.\nThe Corinthia Group is currently renegotiating a deal it has with the government to allow it to develop two tower blocks on the St Julian’s peninsula for office and residential use.\nUnder the initial terms set by the government, the group would pay just €17 million for that privilege.\nSpeaking on TV, Mr Pisani emphasised the group’s plans to develop a six-star hotel on the site and argued that the country needed such developments to attract high-spending tourists.\n“I am convinced that in years to come, people will say ‘what if we had stopped them’,” he said.\nThe Church Environmental Commission did not subscribe to that point of view, and highlighted the increasing number of people, communities and organisations who were sticking their necks out to oppose large-scale development.\nIn many cases, the Commission noted, local councillors had set their political differences aside and joined forces to back their communities.\n“It is fundamental that the authorities give due importance to what the communities have to say in deciding over cases of particular significance,” the Commission warned.\n“Citizens have long been hearing about so-called studies (yet never made public) which predict that Malta needs more construction to improve the quality of life of the Maltese,” it chastised.\n“This prediction does not seem to be occurring, and we are witnessing a growing discontent at the way our natural and urban environment is being destroyed.\n“This, and not the vain promises of individuals who may have ulterior motives, are the real signs of the times which should be heeded by whoever is responsible for Malta’s future.”", "comment_count": 81, "id": 1380}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A suspected drug user who escaped police arrest on Tuesday, only to be recaptured two days later, has been remanded in custody.\nLyon Bonnici, 29, from Floriana, was targeted by an RIU patrol in his home town on January 22 at around 1am while behind the wheel of a vehicle.\nA search of the car yielded several small allegedly drug-filled bags, prompting the officers to inform the driver that he was being placed under arrest.\nUpon hearing this, the man had allegedly fled the scene, only to be arrested the two days later at Floriana.\nThe events leading up to Friday’s arraignment were relayed in court by prosecuting inspectors Jeffrey Scicluna and Priscilla Caruana Lee, who charged the suspect with the possession of heroin in circumstances which denoted that it was not solely for his personal use.\nHe was also accused of cannabis possession, as well as for failing to obey legitimate police orders, relapsing and breaching a suspended sentence.\nThe man pleaded not guilty to the charges.\nWhen making submissions on bail, defence lawyer Franco Debono explained that his client had allegedly panicked and escaped – but was heading to the police station when he was eventually arrested.\nAfter hearing these submissions, the court, presided over by magistrate Joseph Mifsud, turned down the request for bail at this stage, even in view of the fact that the man escaped from police arrest.\nLawyer Marion Camilleri was also defence counsel.", "comment_count": 0, "id": 1381}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Drastic action to solve the pension crisis would have to be taken within five years, a top life insurance company executive predicted.\nDavid Curmi, CEO of Mapfre MSV Life, said yesterday that when he spoke of action he had in mind the introduction of enrolment in saving schemes as the default option for workers, albeit with an opt-off clause should they so wish.\nDavid Curmi\nSuch ‘soft compulsion’ schemes had been introduced successfully in the UK and were also being considered by Ireland, he said.\nThe pensions crisis was mounting as the number of those over 65 years old increased as a percentage of the population. In 20 years’ time, the number would double compared to those of working age, meaning that while there were now four workers whose ‘pay as you go’ contributions would cover each pensioner, the problematic scenario would be much more pronounced by 2039, Mr Curmi told a business breakfast on the economy organised by Mapfre Middlesea and Mapfre MSV Life.\nHe pointed out that Malta would be dedicating 16 per cent of its GDP to pensions within 20 years, if not earlier, which was well above the OECD average. “This is because we are decades late in getting the younger generation to save,” he said, adding that the private pension incentives introduced over the past few years were simply “not enough”.\nDecades late in getting the younger generation to save\nFinanceMalta head Kenneth Farrugia referred to the effects of Brexit, noting that those operating in Malta with a view to passporting to the UK would certainly be hit. Most of such operators were active in asset management, insurance and family businesses.\nHe said that small- and medium-sized businesses in the UK aimed at passporting into the EU would be affected because they tended to hold off on decision-making till the last moment. Still the impact had not yet been quantified, Mr Farrugia noted, predicting that they would rely on a wholesale shift to other member states or opt for co-location within the EU.\nBrexit – whether hard or soft – would not make any difference to the larger financial services companies that had bases in both the UK and the EU because all they needed to do was tweak operations and headcount between them, he continued.\nCompanies that served the British market would also not have to worry much as did companies from outside the EU that chose the UK because it was a leading financial centre but did not do business there. The latter would sustain minimal impact unless they used the UK to passport services into the EU, in which case they would have quite a problem. The issue, he stressed, was that with so little clarity over what would happen, very little could be quantified.\n“The UK could, once it is out of the EU, negotiate its own free trade agreements but, so far, none have been formalised and it is still not clear what will happen,” Mr Farrugia said.\nThe head of the University of Malta’s Research, Innovation and Development Trust, Wilfred Kenely, argued that, while the going was good, now was the time for the island to invest in research and development. Malta’s R&D as a percentage of GDP stood at just 0.6 per cent and it could only get smaller unless action was taken, he remarked.\nSpanish Ambassador Consuelo Femenia Guardiola noted that better air connectivity could have a positive effect on relations between the two countries, saying low-cost airlines alone were not enough. “I believe there are enough flows between the countries to justify more scheduled direct links. I appreciate that these are commercial decisions but it is an idea worth looking into,” she told the audience.", "comment_count": 182, "id": 1382}, {"keywords": "", "author": "", "article_body": "In December, the number of persons registering for work stood at 1,765decreasing by 18.6 per cent when compared to the corresponding month in2017.\nData provided by Jobsplus for December 2018 indicated a decline of 409 persons registering under Part I and an increase of seven among those registering under Part II of the unemployment register, when compared to the same month in 2017\nRegistrants for work decreased when compared to December 2017, irrespective of how long they had been registering for work. The largest decrease in registrants was recorded among persons who had been registering for more than one year, the National Statistics Office said on Friday.\nThe registered unemployment rate in July 2018 stood at 0.9 per cent of the labour supply, (excluding part-time employment): 1.0 per cent for men and 0.7 per cent for women\nThe head of JobsPlus, Clyde Caruana, recently told The Sunday Times of Malta that of the unemployed, the majority – 1,400 – is what economists call the ‘frictionally unemployed’: those who are in between jobs or on the way to jobs, leaving only 400 who are pragmatically speaking not employable for various reasons.\nIn a statement, the government said the number of registered unemployed was the lowest in Maltese history. The number was less than a fourth what it was in 2013, when there was a change in government.\n ", "comment_count": 4, "id": 1383}, {"keywords": "", "author": "Claire Caruana", "article_body": "Around 150 children are currently under care order, Family Minister Michael Falzon said on Friday morning, as he unveiled the final version of the Child Protection Act.\nSpeaking during a joint press conference with the Opposition before the act’s second reading in parliament soon, Dr Falzon said the changes to the law would impact hundreds of children who were often robbed of their childhood because of the situations they faced on a daily basis.\nDr Falzon said the 150 children placed under care order was a conservative figure.\nBy inviting the Opposition to the event, the minister said the government wanted to send the message that there were certain issues that should never be politicised - the protection of children being one of them.\nNationalist MP Claudio Grech, present at the press conference, said the Opposition believed that parliament was made up of two sides and it wanted to be an essential part of the process to draft the act.\n“We want to do whatever is possible to ensure that no child is robbed of their childhood. We know that a lot of children who are robbed of their childhood end up going down certain paths later on in life,” the Opposition spokesman said.\nOutlining the changes that would come into force once the act is approved, Dr Falzon said that among these were those on the appointment of directors, the reporting to the authorities, the appointment of a children’s lawyer as well as strengthening of the board that oversees fostering.\nThe new act, the minister added, was not set in stone and would be updated according to the children’s needs as these change over the years.", "comment_count": 0, "id": 1384}, {"keywords": "", "author": "", "article_body": "Minister for Foreign Affairs and Trade Promotion Carmelo Abela has underlined Malta’s commitment to forge stronger ties with Turkey.\nWhile addressing a Turkey-Malta Business Council Meeting in Istanbul, the minister said trade relations between Malta and Turkey stand on a solid platform, as both countries continue to maintain the steady economic growth experienced in recent years. These sectors include the Maltese-Turkish Joint Economic and Trade Commission (JETCO), cooperation in health care and medical science, maritime cooperation as well as collaboration in education.\nThe Turkey-Malta Business Forum, which was organised as part of a state visit to Turkey by President of Malta Marie-Louise Coleiro Preca.\nPolitical consultations also focused on Turkey’s EU aspirations. Malta conveyed its long-lasting support for Turkey on its path to align with the EU acquis, based on Malta’s conviction that Turkey is a key partner for the EU. This state visit unfolds a month after the most recent visit to Malta by Minister of Foreign Affairs of Turkey Mevlüt Çavuşoğlu in December 2018, and following several exchanges at the highest levels.\nThe Maltese delegation was accompanied by Malta’s Ambassador to Turkey Carmel Vassallo and the Consul General in Istanbul Franklin Aquilina. Ambassador Fiona Formosa, Permanent Secretary at the Ministry for Foreign Affairs and Trade Promotion was also part of the delegation.", "comment_count": 22, "id": 1385}, {"keywords": "", "author": "Claire Caruana", "article_body": "A St George’s Bay resident is taking judicial action to ensure the land deal with the Corinthia Group would not be in breach of the law.\nIvan Mifsud made the request in a judicial protest against Prime Minister Joseph Muscat and Tourism Minister Konrad Mizzi.\nHe referred to the Civil Code, which laid down that the seashore and the seabed were property in the public domain. Though the law did allow for the possibility of administrative permits being issued to build on land considered to be public domain, this should only be allowed if such building was consistent with the nature of the land in question, he said.\n“The law on public domain does not permit the government to give parts of the seashore or the seabed to private commercial entities so that it buries, destroys and builds with the intention to advance its commercial interests,” Dr Mifsud argued in the protest.\nHe noted that the government could not grant unlimited rights to the Corinthia Group to reclaim the seabed around the peninsula it occupied at St George’s Bay.\nAs a Maltese citizen residing in the area, he said he wanted to ask the Prime Minister and the Tourism Minister to make sure laws were not broken and that the interests of the public were safeguarded.\nDr Mifsud is willing to take the matter as far as necessary\nLawyer Natalino Caruana de Brincat, who signed the judicial protest, told this newspaper his client was acting alone and that his move was not motivated by the action of any particular party or group. Dr Mifsud was willing to take the matter as far as necessary, the lawyer pointed out, adding he would not rule out any further legal action being taken in the future.\nThe Sunday Times of Malta reported last month Corinthia would be given a concession to build 100,000 square metres of commercial and residential real estate and offices, including towers. It also said that, apart from the St George’s Bay peninsula being awarded to Corinthia for at least 99 years at a fraction of the prevailing market prices, the government had conceded to allow the developer to reclaim the seabed around the entire peninsula.\nRead: Business community silent as Corinthia deal goes ahead\nThe Times of Malta reported a few days ago that talks with Corinthia reopened after it received legal advice the proposed deal could be in breach of EU State aid rules, though the government denied it had received such advice.\nAccording to a draft deed, still unpublished, Corinthia will pay a premium of €17 million for the land occupying most of the peninsula. Payments will be made over a number of years according to how much real estate was built and sold. On the basis of this agreement, the hotel chain would pay about €4 million in the first three years from the signing of the deed.\nRead: Corinthia given rights to reclaim and build on peninsula seabed\nBoth the Nationalist Party and the Democratic Party said they would vote against the deal when it was presented in Parliament.", "comment_count": 51, "id": 1386}, {"keywords": "", "author": "Sarah Carabott", "article_body": "An explorer who survived Shackleton’s disastrous trans-Atlantic expedition and an Australian farmer who fell ill with typhoid in Gallipoli are two of the 10,000 people buried in Malta being honoured by a new heritage tourism project.\nThe Commonwealth War Graves Commission yesterday launched an initiative aimed at highlighting Malta’s wartime past, providing, among others, tours at the Mtarfa and Pietà cemeteries by local volunteers.\nLaunched by the commission’s director general Victoria Wallace, the project encourages Maltese and tourists to visit the war grave cemeteries to honour people who fell in the two world wars.\nDuring World War I, Malta earned the title ‘Nurse of the Mediterranean’, with almost 140,000 service personnel being treated in 27 hospitals. One volunteer nurse, Helen Batchelor-Taylor, arrived here in September of 1915 at the height of the Gallipoli Campaign when hundreds of soldiers were arriving for treatment every day. She helped tend to the wounded and is buried at the Pietà Military Cemetery.\nThe island became the most heavily bombed place on earth in World War II. People who died, including those who were killed during operation Husky, are all buried in military cemeteries.\nAccording to assistant historian Max Dutton, the aim of the initiative is to help visitors understand the past through the stories of the people buried at the cemeteries in a similar way that visitors learn about the past by looking at artefacts in museums.\nThe commission also launched Stories from Malta, a crowd-sourcing project appealing for information on men and women commemorated in Malta. Almost 6,000 Commonwealth service people lie buried in Malta’s cemeteries or commemorated by name on memorials to the missing. This included those who worked alongside British forces, such as dockyard employees, others who worked for the Ministry of Defence and those who were treated at the nearby Mtarfa Military hospital, he noted.\nThose buried at the Mtarfa cemetery include Hugh Alexander Pollock, English writer Enid Blyton’s first husband, who had moved to Malta because of the climate’s health benefits for his daughter.\n\nThe commission is responsible for the commemoration of almost 1.7 million members of the Commonwealth forces who gave their lives in the two world wars. The graves of these men and women are found in 153 countries and regions worldwide. It also cares for almost 4,000 non-war graves.\nThe initiative is supported by the Malta Tourism Authority, Fondazzjoni Wirt Artna and the Malta Aviation Museum Foundation.\nMore information can be obtained by visiting www.cwgc. org, sending an e-mail to maltatours@cwgc.org or by calling 2145 0107.\nwww.cwgc.org", "comment_count": 6, "id": 1387}, {"keywords": "", "author": "", "article_body": "NGO rescue ship Sea Watch 3 has been allowed to anchor off Syracuse in Sicily by the Italian coastguard, as the sea conditions have worsened.\nThe ship is carrying 47 migrants, which it rescued on January 19 in Libyan waters, and which since then has not been allowed to disembark them.\nThe coastguard said the rescue had been undertaken without the coordination of the relevant search and rescue centre.\nRead: Migrant rescue ship stranded at sea again\nOnce the migrants were taken on board, the weather turned much worse and the ship went first towards Lampedusa and then to Sicily seeking shelter.\nItaly's deputy prime minister Matteo Salvini has insisted the boat will not be allowed to dock amid a clampdown against migrant NGO rescue vessels. \nAs the sea worsened, the ship was assigned to a point 2km offshore, which was considered to be a safer option for those on board. The boat is being monitored by coastguard and customs vessels.\nA spokesman for the NGO on Monday told Times of Malta that while they had made contact with the Maltese and Italian authorities, both were adamant that the vessel should instead reach out to their Libyan counterparts as they were the competent rescue coordinating authority.\nThe spokesman said repeated efforts to contact the Libyan coast guard and other Libyan authorities in recent days had proven unsuccessful as they remained unresponsive.", "comment_count": 0, "id": 1388}, {"keywords": "", "author": "Jacob Borg", "article_body": "An insurance mogul who set up shop in Malta in 2014 is reportedly being investigated by the FBI for alleged offences that could potentially include financial crimes, the Times of Malta has learnt.\nAmerican entrepreneur Greg Lindberg is reportedly facing a grand jury investigation after prosecutors last September seized records from North Carolina’s Department of Insurance.\nMedia reports in the US said the subpoenas listed several broad categories of potential offences, including those related to drug, financial services or money laundering.\nMr Lindberg did not respond to a request for comment by the Times of Malta.\nMedia scrutiny in the US has also focused on millions of dollars given by Mr Lindberg to the Republican party and donations to the Democratic party.\nThe American investor registered reinsurance company Standard Re in April 2015. It was given a Class 1 and Class 2 insurance licence by the Malta Financial Services Authority.\nWe cannot disclose details of any investigations we carry out\nAsked if any issues had been flagged about Mr Lindberg, a spokesman for the MFSA said confidentiality requirements prevented him from answering.\n“The [MFSA’s] supervisory work is confidential by nature and we cannot disclose details of any investigations we carry out or are carrying out or the nature of any intelligence and information exchanges with our counterparts,” the spokesman said.\nHe pointed out that Standard Re surrendered its licence towards the end of last year.\nA source familiar with the company’s operations insisted with the Times of Malta the decision to surrender the licence was a purely commercial one that had nothing to do with the yet unsubstantiated allegations involving Mr Lindberg.\nApart from Standard Re, Mr Lindberg is also linked to other financial interests in Malta, including Standard Advisory Services Ltd, which holds an MFSA investment services licence.\nAlthough the entrepreneur no longer appears to have any public links to Standard Advisory Services on the MFSA’s company registry, filings with the US Security and Exchange Commission shows he still indirectly holds the controlling interests in it through other companies.\nThe company registered a profit of €18 million in 2017, up from €124,000 the previous year.", "comment_count": 45, "id": 1389}, {"keywords": "", "author": "Claire Caruana", "article_body": "Malta has been labelled as “the biggest loser” in a Quality of Life Index that analysed living conditions in 187 different countries.\nThe island fell from 19th best for quality of life to 38th in The Expat Insider 2018 report.\nAccording to the researchers, living in Malta was deemed as being “not as peaceful as it seems”.\n“Many expats seem to feel increasingly affected by the political situation. Only five in nine expats in Malta (56 per cent) give the country’s political stability a positive rating, compared to a global average of 63 per cent,” the report authors said.\nOne UK expat reported that “corruption seems endemic at all levels of society” and an Irish respondent noted that “the horrendous corruption in every aspect of governance is appalling”.\nThe horrendous corruption in every aspect of governance is appalling\nAbout one in six expats (18 per cent) said they were unhappy with what they perceived as “lack of peacefulness” on the island.\nInformation for this year’s report was compiled between February 15 and March 7 last year, with about 18,135 expats, representing 178 nationalities and living in 187 countries, taking part.\nResearchers asked participants to rate up to 48 different factors concerning various aspects of life abroad on a scale of one to seven.\nTo draw up the final index, the authors broke down the data into six categories. Malta was ranked among the top 20 countries in just one category, the leisure options, where it was ranked 13th. Despite being the highest ranking posted by Malta when compared to the other five categories, the listing was below the previous year’s, when leisure options on the island were ranked eighth best.\nExpats were also far less happy last year when compared to 2017, the ranking for personal happiness slipping to 29th place from seventh.\nExpats’ views on the state of their health and well-being as well as safety and security changed significantly in a year. While in 2017 Malta ranked 21st in both categories, it dropped to 35th place for health and well-being and even lower, 38th, in terms of safety and security.\nIn a new category introduced this year, digital life, Malta was ranked in 42nd place.\nOverall, Taiwan, Portugal and Spain were found to have the best quality of life, ranking at the top of the list. At the other end of the scale were Myanmar, Saudi Arabia and Kuwait.", "comment_count": 366, "id": 1390}, {"keywords": "", "author": "", "article_body": "These are the stories which made to the front pages of Friday's newspapers:\nThe Times of Malta reports that Malta has lost considerable ranking in a quality of life study. It also reports MSV Life CEO David Curmi saying that within around just five years, the government will have to introduce second pillar pensions if it is to stave off a crisis.\nThe Malta Independent reports that some of the Wasteserv sites appear to be operating with expired permits. The newspaper also says that the fuel station talks had stalled because of new negotiators on the government side.\nIn-Nazzjon reports on a Swieqi resident who filed a judicial protest against the Corinthia deal, as well as on a directive about work life balance in which Nationalist MEP David Casa had been involved.\nL-Orizzont follows up on the tragic death of a 4-year-old with an interview with the head of the Crisis Resolution Team, as well as reporting a court case which revealed how parents took their 18-yer-old daughter down to Marsa to pimp her.", "comment_count": 0, "id": 1391}, {"keywords": "", "author": "Stephanie Fsadni", "article_body": "The world’s largest game jam event is taking place this weekend and Malta is getting a piece of the action.\n\nThe Global Game Jam is like a hackathon focused on game development, where participants are given 48 hours to create a game from scratch, that is from the initial concept stage to the creation of a prototype and production. \nEnthusiasts from about 295 sites in 60 countries will gather tomorrow afternoon, watch a short video keynote with advice from leading game developers and learn the year’s secret theme. All sites are then challenged to complete games based on that theme by Sunday afternoon.\nThe 55 Maltese participants will assemble at the Institute of Digital Games at the University of Malta, which has been organising the local jam since the institute was founded in 2013. This year, registrations closed early due to high demand.\nJasper Schellekens, research support officer at the institute, told Times of Malta that the event has seen an increase in interest and participation over the years. \nHe attributes this partly to the fact that a varied range of skills are required to make a game and thus the event does not only attract students of the institute.\n\n“When we’re talking about digital games, a programmer is essential but there is a role for non-programming participants regardless of background. Depending on the type of game the team is working on, artists, sound designers and writers can find a role. But even beyond that, any discipline can provide the foundations for a game play,” he pointed out.\nThe jam is not just restricted to video games but one can also try their hands at designing board games. A board game titled …And Then We Held Hands, created at the 2014 Malta Global Game Jam by David Chircop (an institute graduate) and Yannick Massa, went on to win the Golden Geek Best Print and Play Board Game category at the Golden Geek Awards.\nThe global event carries the tagline “innovation, experimentation and collaboration”, three important pillars of the games industry that are endorsed by the institute.\n“We want our students to do more than just fit into the game-making ‘factory’, we want our students to push the boundaries and think critically about every game design decision,” said Mr Schellekens.\n“The games made at the jam are not for commercial release, which is an excellent opportunity to experiment and innovate without fear of the bottom line. It is also crucial that our students are able to be a productive part of a game design team.”\n\nStudents may also get involved in all the production steps, show their potential and add a project to their portfolio. Besides, the jam provides a valuable reality check.\n“Game designers often have epic plans in mind for their game but epic plans require epic budgets and other tools and resources that may not be available, so the constraints placed by the game jam can teach the students where they can cut and what they need to keep,” noted Mr Schellekens. \nWe want our students to push the boundaries and think critically\nThe institute stays open round the clock during the jam, with staff members and volunteers on site. Participants can avail themselves of workstations with game-making software installed and can browse a board game and a video game library for inspiration. Soft drinks, water, snacks and a lot of fruit “to keep jammers’ brains at peak performance” are also supplied. \nMr Schellekens emphasised that the jam is not a competition but more of a social event, where the focus is on the experience and having fun. \nSo, what happens to the end products?\n“We’ll play them! During the jam there is a part dedicated to try out everyone’s games. The full code is also uploaded on the Malta Global Game Jam website, so people can download the games. Some teams choose to develop their ideas further such as…And Then We Held Hands team, some may use games in their portfolio, others may just leave it aside as a lesson learned.”\nWhatever the outcome, the game jam provides a great challenge and experience, ensured Mr Schellekens.\n“It is almost always a guarantee that you will come out of a game jam more tired but better than you were before. Provided you survive, of course.”\nTwo characters from the digital game We Do created during the Malta Global Game Jam 2018.\nThe Malta Global Game Jam kicks off on Friday with guest speaker Tomasz Kisilewicz, lead artist at 11 bit studios, who has worked on the critically acclaimed games This War of Mine and Frostpunk. Visit http://maltagamejam.institutedigitalgames.com/ for more information.\nThe Institute of Digital Games runs other regular events that are open to the public, including monthly lectures on the topic of games. The next one, titled ‘Sound and the Feeling of Presence in Video Games’ will be delivered by professor Mark Grimshaw-Aagaard from ITU Copenhagen on February 25 at 4pm. For more information, visit http://www.game.edu.mt/.", "comment_count": 1, "id": 1392}, {"keywords": "", "author": "Claire Caruana", "article_body": "Alternative markets for the purchase of most of the 1,870 medicinal products bought from the UK were identified in case of a no-deal Brexit, Health Minister Chris Fearne said on Wednesday.\nMr Fearne told Parliament an alternative market for about 80 of the products in question had yet to be found, adding that the government was working closely with the European Medicines Authority to address the situation. The government had also started stockpiling certain medicine to avoid problems in case of certain “hiccups”. \nThe Medicines Authority had also held talks with importers to ensure there were no shortages or price increases.\nThe 1975 agreement enabling Maltese citizens to receive treatment in the UK for free would remain in force, the minister said. \nThe Medical Council would also introduce a fast-track system to facilitate the registration of professionals who came to Malta to treat patients together with their teams.\nMr Fearne also confirmed that existing agreements with schools across the UK would not be impacted by a no-deal scenario and doctors from the two countries could still work in hospitals in both countries.", "comment_count": 15, "id": 1393}, {"keywords": "", "author": "Ivan Martin", "article_body": "A Malta-based online medical school could be used as a backdoor for underqualified doctors to work in EU hospitals, European doctors fear.\nFrank Montgomery, who chairs the Standing Committee of European Doctors, an EU-wide doctors’ lobby, told Times of Malta a Malta-based company offering medical courses via online correspondence had been the topic of discussion at a recent meeting of its members. \nThe German doctors’ lobby had expressed worries about the company and its operations.\n“This is a matter of concern for us. We do not know the level of qualifications within this organisation and have doubts on the programme being offered, which is why we have raised this with our partners,” Prof. Montgomery said.\nThe contentious programme is offered by the European Digital University, which was licensed by the Maltese education authorities last year.\nThe company offers students the possibility of enrolling in an online medical degree programme complemented with clinical training in Germany. The programme consists of a three-year Bachelor of Medicine degree accredited by Malta’s National Commission for Further and Higher Education.\nAccording to the EDU website, a two-year master’s degree in human medicine, which includes practical clinical training in EU hospitals, is also available.\nThe website says that “the innovative EDU study model provides the best possible education in clinical medicine to young people with an intrinsic passion for becoming a physician”.\nHealthcare industry sources said the company was interested in applying for a licence to offer full medical courses and be able to certify doctors.\nEducation Minister Evarist Bartolo said when contacted the authorities were being “very rigorous” in reviewing the company’s requests. While the government was all for innovation, it was also aware that medical education had to be treated sensitively, he said.\nA spokesman for EDU told Times of Malta students were recruited through a rigorous selection process based on their performance after sitting for both a cognitive test and an interview. The company’s admissions criteria, he noted, were similar to or, in some cases stricter, than those of other public or private universities.\nThe spokesman said an application to offer a course leading to a Master’s degree had been submitted and was in the final stages of the accreditation process. \nThe EDU was expecting a final decision next month and, then, EDU medical students would graduate as a doctor of medicine after completing the Bachelor of medicine and Master of medicine courses, he continued.\n“As a doctor of medicine, the student can strive for a professional recognition in Europe and also in other countries beyond Europe, which is then always individually reviewed,” the spokesman said.\nProf. Montgomery, however, declared he had no confidence in the course offered by the EDU and feared such practices could be a trend creeping into the EU’s medical sector, whereby physicians were certified by institutions that did not meet the necessary standards.\nWe do not know the level of qualifications within this organisation\n“I would advise any student and aspiring physician not to enrol into this course because we are not certain of its credentials and ability to meet European requirements,” he said.\nProf. Montgomery, a heavyweight in the medical sector who is regularly involved in talks at European Commission level, harbours concerns on whether the company adhered to the EU prerequisites all medical schools had to meet before being able to certify medical professionals.\nMedical schools, he said, should have a hands-on element and be part of an educational ecosystem that included a university and a hospital. \n“Medicine should be learned on the ground, with a hospital, a pathology department, an anatomy department and all the other things that make a medical school what it is,” he said, adding both he and colleagues were not even aware of the qualification of trainers involved in the EDU programme.\nProf. Montgomery pointed out that EDU students were given practical training in private German hospitals, which was why the matter was raised by the German doctors’ lobby.\nHe said he was informed the company had only decided to come to Malta as it had been informed it would be given the go-ahead by the authorities in a relatively short period of time. \nClearance, he remarked, was given in less than two months, again raising concerns of the level of due diligence.\nDoctors who contacted Times of Malta said they feared the EDU course could jeopardise the island’s good reputation as a medical hub.\n“Malta is known to be a serious country when it comes to medicine and medical training. Something like this, where we are not sure of the qualifications and the credentials [of those behind the venture], may appear innovative but it may also risk damaging the island’s good name,” a concerned veteran physician said.", "comment_count": 74, "id": 1394}, {"keywords": "", "author": "", "article_body": "Corny BIG Brownie is being recalled by the manufacturer, Schwartau, since the list of ingredients on the packaging is not printed in the English language due to a manufacturing error.\nThe recall only applies to Corny Big Brownie with the article number 61260 and the expiry dates 20.09.2019, 07.12.2019 and 27.02.2020. \nThe mislabeled product is a possible health risk to anyone with an allergy to peanuts, cereals containing gluten, or an intolerance to milk.\nConsumers who have bought the above product and have an allergy to milk, peanuts or gluten, should not consume it but should return it to the store from where they bought it for a full refund.\nSchwartau apologiseds for any inconvenience caused and said consumers with questions or concerns could contact the Schwartau customer services at presse@schwartau.de .", "comment_count": 9, "id": 1395}, {"keywords": "", "author": "", "article_body": "The European Parliament and the Council of Ministers have agreed on a new Work Life Balance Directive, which will provide a better future for all European citizens.\nThe new directive, led and negotiated by Maltese MEP David Casa, will introduce new rights for European parents and carers.\nIt will introduce:\n• 10-day paternity leave remunerated at not less than the national sick pay level;• four months of parental leave of which two months will be paid and non-transferable;• the right to request flexible working arrangements; and• five-day carers leave for those who needed to take care of relatives.\nMr Casa, who is also the EPP group coordinator in the Committee for Employment and Social Affairs, said that what was agreed upon would not only translate into a better quality of life for citizens but would also increase productivity and help reduce the gender employment gap, gender pay gap, and gender pension gap.\n“I believe that the right balance between employees’ rights and employers’ expectations has been achieved.”\nHe expressed satisfaction that a Maltese MEP led the directive saying that although Malta was the smallest EU state, it had proved it could deliver.\nMr Casa has been working on this directive since October 2017, when he was chosen as the lead negotiator for the European Parliament on the directive.\nThe next step is for the Parliament’s plenary to vote on the final agreement in the coming weeks. After that, the directive should start being adopted by governments in all EU states.", "comment_count": 15, "id": 1396}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Transport Malta recently updated a 2008 notice to mariners about artificial wrecks, but divers are disappointed that some types of fishing are still permitted.\nNotice to Mariners 08/2019 replaced Notice to Mariners 05/2008, adding two more artificial wrecks – Tug 2 at St Julian’s and P31 at the south entrance to Blue Lagoon – to the seven that were already listed. Both these vessels were scuttled since 2008.\nThe notice warns mariners that the sites are considering to be ‘no stopping areas’ and that anchoring by divers’ vessels is only allowed after pre-notification. It also bans spear fishing and the use of fishing gear such as set bottom lines, and various types of nets, pots and traps. However, surface fishing using trolling lines and angling for pelagic fish is allowed.\nThe notice has disappointed divers on two counts. The Federation of Underwater Activities Malta together with the Professional Diving Schools Association said the notice could have been extended to include some 10 other wrecks, as well as other historical or underwater attractions, giving them better protection. One measure they suggested to protect them was the use of permanent mooring points rather than allowing dive boats to anchor.\nThey were also dismayed that surface fishing from passing boats was still being allowed within these areas, rather than making them no-go areas except for bona fide diving vessels.The danger to divers posed by fishing lines and passing boats are potentially deadly\n“We would have liked to see a change in this regard so that measures to encourage further protection of Malta and Gozo's underwater resources are taken.\n“It is to be noted that artificial reefs serve not only as an attraction for scuba or free divers but also as an ‘incubator’ for fish which assist in replenishing fish stocks in the surrounding areas. The capture of fish within the specific area is counterproductive, especially at a stage where not only local professional and recreational fishermen are worried by the status of fish stocks near shore areas, but also local and foreign visitors who are free divers or scuba divers,” they told Times of Malta.\nThe associations said the tens of thousands of local and foreign visitors were witnessing worrying declines of fish around the Maltese islands’ coast, as supported by the latest state of the industry surveys.\nThey also lamented the danger to divers posed by fishing lines and passing boats, saying that these were potentially deadly.\n“The allowance of passage further complicates the enforcement of protection for these zones as it is harder to distinguish between the different types of fishing to confirm whether a rule was broken or not and many times offenders may be gone well before anyone can catch a registration number or by the time enforcement officers are anywhere in the area,” they said, adding that it was the equivalent of having a main road passing through a family park.\nThe associations also suggested that sites should be also clearly marked with perimeter indicator buoys for at least nine months of the year, from March to December, noting that during this period, water activities around the coast increased tenfold.", "comment_count": 11, "id": 1397}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A suspected drug trafficker identified by a customs sniffer dog last September has been granted bail, four months after a previous request had been refused.\nPedro Henrique Correia De Sousa, 36, from Setubal, Portugal, currently stands charged with having imported some five kilos of cannabis as well as cocaine, which he failed to prove was intended for personal use.\nThe man was checked upon his arrival at the Malta International Airport on a flight from Madrid, after the sniffer dog indicated the suspect during routine checks on passengers.\nA personal search of the man and a screening of his luggage had yielded four packets of cannabis weighing some 5 kilos.\nThe suspect had subsequently been arraigned, pleading not guilty and had been remanded in custody after his bail request was turned down.\nFour months down the line, a fresh request for bail was upheld under a number of conditions laid down by the court, presided over by magistrate Doreen Clarke on Thursday, against a deposit of €10,000, and a third party guarantee for €15,000.\nThe accused was also ordered to sign the bail book on a daily basis and to abide by a curfew between 6pm and 6am.\nWhen granting bail, the court took note of the previous conduct of the accused, the stage of the ongoing proceedings as well as the circumstances of the case.\nInspector Frank Anthony Tabone prosecuted. Lawyer Roberto Montalto was defence counsel.\nThe case continues.", "comment_count": 0, "id": 1398}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man who allegedly stopped his partner from testifying in criminal proceedings in his regard earlier in the week has been granted bail after facing domestic violence charges on Thursday.\nThe 47-year-old unemployed man, residing at St Paul’s Bay, was arrested and taken to court after his partner and mother of two minor children, currently living separately from the man, filed a report about the alleged abuse.\nThe whole incident kicked off on Monday when the man allegedly restrained the woman, blocking her from testifying in criminal proceedings in his regard before the district court.\nMatters appeared to have escalated on Tuesday when an argument broke out between the two, wherein the woman allegedly suffered slight injuries.\n“I want to stop this case, but I don’t want him to come near my apartment,” the alleged victim declared in open court, when making an appearance at Thursday’s arraignment. “We have kids together and he suffers from diabetes,” the woman continued.\nYet although declaring she wanted to withdraw her complaint, the court, presided over by magistrate Charmaine Galea, observed that certain charges could not be withdrawn since they were prosecutable irrespective of the victim’s complaint.\nThe man pleaded not guilty to holding the woman against her will on Monday, and suborned a witness by using threats or force.\nA request for bail was not objected to by the prosecution in the light of the circumstances and so long as adequate measures were imposed by the court.\nAfter hearing submissions by both parties, the court granted bail against a personal guarantee of €5,000 and an order to sign the bail book twice a week.\n“Today she chose not to testify but tomorrow she might change her mind. Be very careful,” warned the magistrate.\nTurning to the alleged victim, the magistrate said: “If he speaks to you about this case go and file a report with the police because that would breach bail conditions.”\nThe court ordered a ban on the names of both parties.\nInspector Godwin Scerri prosecuted. Lawyers Matthew Brincat, Arthur Azzopardi and Rene Darmanin were defence counsel.", "comment_count": 0, "id": 1399}, {"keywords": "", "author": "", "article_body": "The Electoral Commission has defended the precision of the new electronic vote counting system, which it said would guarantee a correct result reflecting the electorate’s vote.In a statement on Thursday, the commission said it was satisfied with the system’s accuracy, and would be continuing tweaks in the coming weeks, as well as further tests in the presence of political parties “to ensure a more efficient system for the benefit of all concerned”.“The Commission is convinced of the system’s precision and of achieving its objective to issue the final result of the European Parliament election much earlier than ever before,” it said.The European Parliament and local council elections scheduled for May 25 are set to be the first to use an electronic system to count votes, drastically cutting the time taken to reach a final result.But the PN expressed its concern in November that the system could give rise to electoral fraud, after a rocky initial test which saw 40% of ballot sheets rejected, as well as reports that the system had been modified by the company responsible without the electoral commission’s consent.The commission said the final result of the European Parliament vote was expected late on May 26, a day after the election, or early on May 27. The results of the 68 local council elections will emerge over the following days, up to May 31.", "comment_count": 22, "id": 1400}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority has rejected an application to build 30 apartments over a 250-year-old baroque scheduled garden in Għaxaq.The application was unanimously rejected during a hearing on Thursday after an outcry which resulted in hundreds of objections being filed with the Planning Authority.Filed by Michael Paris on behalf of the heirs of the late Mary Paris, the proposal sought to excavate basement level of garages, the construction of 30 residential units over five levels, including the penthouse level, and the restoration of garden area. The site is in Triq Il-Ħatem, Għaxaq.The area forms part of Palazzo Giannin, a 250-year-old palazzo, which is a Grade 2 scheduled property that includes a number of baroque architectural decorations. It is a protected green enclave with a number of trees that are also protected.\nThe 18th-century palace and its gardens were scheduled at Grade 2 in 2013, after an outline permit for the apartment blocks was granted at appeal. The owners insist the scheduling is void and that the project would regenerate a dilapidated garden. However, the full development application, submitted early last year, was recommended for refusal after the PA case officer concluded that it failed to respect the scheduling status and would have negatively impact the historic building.Project architect Edwin Mintoff argued during Thursday’s hearing that new plans submitted at a late stage in the application process - and not considered because they constituted a material change - would significantly improve the project.Under the new plans, he said, only 20% of the gardens would be built up, and the buildings had been shifted to the area with the least heritage value. The case officer nevertheless said these changes would not have addressed the issues with the development even had they been considered. Objectors, among them Flimkien Għal Ambjent Aħjar, had argued that the garden of Palazzo Giannin along with those of Villa Mekrech and Ġnien tal-Kmand, are historical green enclaves in Għaxaq. A representative of the Għaxaq council said the gardens constituted heritage of national importance and merited protection, while residents argued during the hearing that approving the development would make a mockery of the scheduling process. The Palazzo Giannin garden contains a number of baroque architectural decorations and serves as a landmark of the village. It also contains many protected trees including oaks, olive trees and Aleppo pines.", "comment_count": 18, "id": 1401}, {"keywords": "", "author": "", "article_body": "A 33-year-old German woman was seriously injured on Thursday morning when she fell down a shaft in a house in Xemxija, the police said.\nThe accident happened in Triq Piscopo Macedonia at about 9.30am.\nThe woman had been on the roof at the time. \nShe has been hospitalised. ", "comment_count": 0, "id": 1402}, {"keywords": "", "author": "", "article_body": "All animals are stunned before being slaughtered at the Public Abattoir, when they  were aimed for general consumption or through the halal ritual.\nIn the case of halal, the ritual was performed by a Muslim butcher in line with Muslim procedures, the government said in a statement.\nThe government was referring to a recent comment made by Imam Muhammed El Sadi, who insisted that the slaughter of animals without stunning, done according to the Jewish and Islamic traditions, was \"a matter of religious freedom and human rights which should be respected and considered\".\nHis comments had sparked a furore on social media, most of which were against the idea.\nThe government said in its statement that once carcasses passed through the slaughter-line procedure, they were checked by the veterinarian and individual samples were taken to the laboratory for testing. They were then stamped with the Public Abattoir’s health mark. All carcasses carried a label with information for traceability purposes. Halal carcasses passed through the same procedure, but the label would be also marked “halal”.", "comment_count": 0, "id": 1403}, {"keywords": "", "author": "", "article_body": "A researcher has filed a judicial protest against the Superintendence of Cultural Heritage, complaining that he was not being given access to data.\nMark Camilleri, a masters graduate in arts history, said he had requested the superintendence to give him a list of archaeological items dated from 800 to 1400AD and the source of those items, but the superintendence had refused, saying the information was part of scientific research that had not yet been concluded.\nThe same information had been given to a former deputy director of the superintendence who, Mr Camilleri said, was using it to back his mistaken claim that there was a continuation in the population in Malta in mediaeval times after the Arab occupation of AD870-71.\nMr Camilleri requested immediate access to the data.\nDr Andrew Sciberras signed the judicial protest.  \n ", "comment_count": 4, "id": 1404}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A soldier who was discharged after his critical video about army spending on a Pembroke gate went viral has filed a judicial protest against the army, seeking reinstatement.\nFormer bombardier Godwin Schembri, who was dismissed in November, claimed the army's decision was  “discriminatory” and “unreasonable.”\nThe video clip showed Bombardier Schembri driving an army vehicle as he mocked the army’s top brass over a recently-installed free-standing gate, meant to control access to the AFM’s shooting range in Pembroke, but rendered useless by the absence of a fence on either side.\nREAD:Brick wall erected after ‘army gate’ controversy\nBombardier Schembri had flagged the matter as he swerved around the closed gate in the military truck, making ‘colourful’ remarks, while other soldiers on board giggled in the background.\nThe army built a fence on either side of the gate some days after. \n\nIn his protest, the soldier insisted that the video was uploaded to social media without his knowledge and consent. \nTwo days later, on November 21, he was summoned to answer for his behaviour before his superior, Lieutenant Colonel Edric Zahra.\nBombardier Schembri said he had explained that he had never authorised the sharing of that video, which he viewed as a joke. \nHe had then been assured him that in case of an admission on his part, he would not risk being discharged.\nDisciplinary proceedings over his alleged dangerous driving and inappropriate language had resulted in a conviction, based upon the soldier’s own admission, landing him with an extra 12 duty watches, a reprimand as well as the transfer to another company within the same regiment.\nHowever, on November 23, Bombardier Schembri was summoned before Brigadier Jeffrey Curmi who told him that what he had done amounted to insulting and denigrating behaviour towards the army and he was being discharged.\nREAD: Military, ministry mum on bombardier’s ‘dismissal’ after video rant\nIn his judicial protest, the bombardier said the brigadier's decision went against army law and also breached his fundamental right not to be tried twice (double jeopardy rule.)\nMoreover, the dismissal was both “discriminatory” and “unreasonable” since the joke had been intended to be shared in a private context, never to be made public.\nThe brigadier's action had also run counter to the principle of ‘fair hearing’ since, as the alleged target of the bombardier’s joke, he had chosen to take the matter into his own hands, “disciplining the person who had criticised him during the light moment.”\nSuch a decision certainly fell within the parameters of the law granting judicial review of an administrative act.\nThe bombardier said he was holding the army commander responsible for damages while calling upon him to reverse his dismissal.\nLawyers Joseph Giglio and Mario Spiteri signed the judicial protest.", "comment_count": 0, "id": 1405}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority has given the go-ahead for a 12-storey residential development at Smart City.\nThe Shoreline project will include some 400 luxury flats, the majority one-bedroomed, almost 14,000 square metres of rentable commercial space, mostly shops, and another 1,500 square metres of bars and restaurants.\nIt was approved by the PA on Thursday by 10 votes to one, amid questions on the height and visual impact from Sliema and Valletta, as well as the process used to secure changes to the approved Smart City masterplan.\nREAD: SmartCity developers find new way of circumventing height, building space limitations\nAlthough the development’s floor-space by far exceeds the masterplan parameters, these limitations were circumvented after Smart City Malta agreed to transfer an additional 35,000 square metres of development space from other parts of the wider project to the Shoreline site.\nNGO representative Annick Bonello, the sole board member to vote against the application, said the land \"bartering\" at the developer's request was unacceptable and set a precedent for other applications.\nQuestions over building height also arose as the master plan had set a seven-storey limit for buildings on the Shoreline site, which the Superintendence for Cultural Heritage strongly insisted should be respected due to the impact on views of Valletta.\nHowever, the PA case officer said during the hearing that as a result of the development space transfer, the overall visual impact would remain unchanged.\nArtist's impression showing the Shoreline project.\nProject architect Edwin Mintoff added that as the extra floors would be removed from approved sites on higher land elsewhere in Smart City, the impact on views from Valletta would be improved.\nHe noted that no formal objections had been submitted by any individuals or consulting authorities.\nThe project is also expected to generate a massive 230,000 cubic metres of construction waste during excavation to sea level, highlighted in the Environment Impact Assessment as a major negative impact.\nThe project architect said during the hearing that this waste would be recycled.\nThe permit was approved against a planning gain of 1.2 million euros to fund local council projects. Following a request by the architect it was agreed that around 800,000 euros of this could instead be paid in works in kind.", "comment_count": 41, "id": 1406}, {"keywords": "", "author": "", "article_body": "Air Malta and Turkish Airlines are holding talks on closer collaboration, including the code-sharing of more services. \nTalks were held over the past days as Tourism Minister Konrad Mizzi and airline chairman Charles Mangion accompanied President Marie-Louise Coleiro Preca on a visit to Turkey.\nThe Tourism Ministry said both sides discussed the possibility of new code-share agreements for destinations in the Asian region including China, Japan and Australia.\nThey also discussed collaboration on new destinations, via joint-venture flights to North African and Sub-Saharan destinations. Destinations being explored in this regard include Cairo. \nThe airlines already code-share flights to Istanbul.", "comment_count": 10, "id": 1407}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Drivers ought to respect cyclists and motorcyclists on the roads and left-hand drive trucks must disappear, the mother of a traffic accident victim has implored.\nAfter the sudden death of her daughter Johanna in January three years ago, Josephine and her husband, Pippo Boni, have made it their life mission to increase awareness about the hazards of Malta’s roads.\nAccording to Ms Boni, among them are left-hand drive trucks, similar to the one that took 27-year-old Johanna from them.\nMotorcyclist Johanna Boni was crushed by a cement mixer in Labour Avenue, Naxxar, at about 8am on January 5. The 27-year-old was riding her Kawasaki ER6N to work when the accident happened on that fateful morning.\n“I think trucks must be subjected to stricter checks. Trucks must not be loaded more than a certain amount. Left-hand drive trucks must disappear... those which come from abroad must have a co-driver because the blind spot is too dangerous. This is my biggest worry. They are killers on our roads,” Ms Boni said.\nLeft-hand drive trucks must disappear... those which come from abroad must have a co-driver because the blind spot is too dangerous.\nThe bad weather yesterday forced the postponement of the third memorial ride in honour of their daughter as the slippery roads were unsafe for bikers.\nThe ride, which will raise funds for the Simon Schembri Blue Light Foundation, will instead be held this Sunday.\nJosephine and Giuseppe Boni yesterday returned with their daughter’s motorbike, which has since been repaired, to their daughter’s roadside memorial in Naxxar, metres away from where she was killed.\nThe memorial has been dismantled, due to roadworks in the area, but a new one was created a few metres down. The parents thanked the people who did this without their knowledge, especially Michael Portelli from Sign Services Ltd.\nThe parents are still seeking closure over the incident that robbed them of their only daughter on that fateful January day. They also never found Johanna’s Samsung Galaxy S4 smartphone, which went missing from the site of the accident and which contained images, videos and messages which they are longing to see.", "comment_count": 16, "id": 1408}, {"keywords": "", "author": "Edwina Brincat, Herman Grech", "article_body": "Keith Schembri, chief of staff at the Office of the Prime Minister was expected to testify in libel proceedings against Simon Busuttil, after the former Nationalist leader had accused him of receiving kickbacks.\nThe suit revolves around the speech delivered by the then PN leader on March 6, 2016 in a national protest in Valletta against corruption.\nBut the case was adjourned as lawyers argued over whether Mr Schembri should also testify over secret company 17 Black. The company had been named in leaked e-mails as one of two companies that would pay $2 million to Mr Schembri's and Konrad Mizzi's Panama companies\nThis a minute-by-minute rundown of Thursday's case:\n11.27am: Simon Busuttil leaves the court room followed some time later by Mr Schembri. \n\n\n\n11.26am: The court is putting off the case to March 7 to deliver a decree specifically on this application. This means that Keith Schembri does not need to be cross examined on Thursday.\n11.25am: Magistrate Francesco Depasquale has to decree upon today’s application whether there are to be questions on 17 Black. \nWatch: 17 Black in 90 seconds\n11.17am: If you're catching up with us now, the two lawyers from the opposing sides are arguing over whether the court should also discuss 17 Black. \nMr Schembri's lawyer says the respondent cannot expect to dictate proceedings - there’s the law of procedure and it must be followed.\n\"It’s not that my client doesn’t want to testify but the information he (Dr Busuttil) gets from here he will try to use elsewhere.\"\nKeith Schembri and Simon Busuttil.\nThe lawyer says he had been present at the cross examination of Konrad Mizzi in separate libel proceedings (although he was not involved as lawyer) and had noted that it had been a fishing expedition. He did not want a repeat in this case.\n11.14am: Dr Fenech replies that Panama Papers mentions secret companies, one of which belongs to Keith Schembri.\n\"Schembri must answer. He filed the libel, now he must allow us to put questions even if documentation emerged later... What Busuttil had alleged was proved right, the pieces of the mosaic were falling into place,\" the lawyer charges.\nDr Gatt rebuts: \"These are populist remarks.\"\n11.12am: Mr Schembri's lawyer says (the secret company) 17 Black had not been mentioned by the time of the March 2016 protest. So today the court should rule that questions on 17 Black should not be allowed.\nDr Busuttil's lawyer Peter Fenech laughs: \"Of course, it’s a laughing matter. Anyone who has nothing to worry about need not try to avoid such questions.\"\n11.05am: Dr Gatt explains there is another libel concurrently against Daphne Caruana Galizia. Says there was a \"mix-up\" way back. As for Thursday's application, Dr Gatt says that both Mr Schembri and Dr Busuttil also testified, referring to Panama papers issue.\n11.05am: Keith Schembri is present in the court room together with lawyers Edward Gatt, Mark Vassallo and Robert Abela.\nRead: Simon Busuttil, Keith Schembri, cross swords in court and on Twitter\nDr Busuttil had testified in October 2016 in libel proceedings instituted by Mr Schembri, who insisted he never received kickbacks.\n10.40am: Even before the case started on Thursday, Dr Busuttil accused Mr Schembri through a tweet of running away since Daphne Caruana Galizia was murdered.", "comment_count": 0, "id": 1409}, {"keywords": "", "author": "", "article_body": "Technicians working to restore internet services.\nWorkers are working round the clock to restore internet, phone and TV services to hundreds of people around Siġġiewi after GO cables were accidentally severed by a contractor.\nThe incident happened over the weekend and GO said it had engaged sub-contractors to help its staff repair the network as quickly as possible. Some services have already been restored. \nGO CEO Nikhil Patil expressed his apologies to consumers. \n“Regrettably, we suffer at least two incidents a week that are the result of unrelated third parties, mostly due to construction works. Thankfully, not all are as critical as that experienced this weekend, however this does cost us hundreds of thousands of euros every year, however of greater concern to us is the inconvenience to our customers,” said Mr Patil.\nGO said that in the next few days it will be reaching out to its impacted customers with a gesture of goodwill for the inconvenience caused.\n ", "comment_count": 14, "id": 1410}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated Thursday with PA decision, vote - The Planning Authority on Thursday approved the renewal of a permit for a massive residential development rising to 12 storeys on the site of the former Mistra Village.\nThe project includes a complex of 744 residential units in four blocks at the top of Xemxija Hill, along with shops, restaurants, offices, a spa, pool and clubhouse as well as more than 1,600 parking spaces.\nA permit for the development was issued in 2013 but no development was ever carried out and developers Gemxija Crown Ltd applied last July to renew the permit before the expiry of its five-year validity period.\nNo changes have been proposed to the approved plans and the PA case officer has recommended the renewal application for approval.\nNevertheless, neighbours raised concerns in objections to the PA over the height of the development, which they said would dwarf its surroundings. \nThey also complained about the overall scale, which is expected to negatively impact the transport network of the area and increase pollution.\nDevelopment would dwarf its surroundings\nThe original permit was issued prior to the introduction of the floor area ratio policy for high-rise buildings in 2014, under which the project could have been deemed inadmissible due to the site’s sensitivity at the edge of a ridge and overlapping an area of ecological and archaeological importance.\nNo mention of the new policy is made in the assessment of the renewal application, which instead highlights a 2006 local plan provision for eight storeys and “slight departures from this height provided the scheme has a noteworthy urban and architectural design of the highest calibre”.\nPN representative Marthese Portelli and Timmy Gambin voted against the renewal on Thursday, arguing that the project was not compliant with the Floor Area Ratio high-rise policy, introduced after the original permit was approved.\nArtist's impression of part of the development.\nEnvironment Authority chairman Victor Axiak also voted against, citing his authority's concerns on noise and air quality.\nThe Design Advisory Committee raised no objections to the project from a design perspective. \nThe Environment and Resources Authority reiterated concerns raised by its predecessor on the original application, particularly on air quality and noise pollution.  \nThe site is occupied by the derelict Corinthia Mistra Village Club Hotel, built in the 1980s and which closed down in 2004.\nThe 2013 permit followed an outline permit issued in 2008, compared to which the current project represents a significant downscaling. However, the Ombudsman concluded in a 2013 report that the planning authority had been wrong to issue the outline permit and compounded the error by green-lighting the full development.\nThe report concluded that the regulator had not followed proper procedures and that the development would have a significant adverse impact on the natural environment.", "comment_count": 42, "id": 1411}, {"keywords": "", "author": "", "article_body": "The establishment of an Emission Control Area in the Mediterranean would bring enormous air quality benefits, save 6,000 lives and reduce the healthcare bill of several countries, BirdLife Malta said on Thursday.\nIt was reacting to a French report on air pollution from shipping. The report was compiled by Ineris, the French national institute for industrial environment and risks.  \nThe impact assessment, which started in 2017, investigated potential air quality improvements in the region following a switch to better grade marine fuels.\nThe report found that particulate matter (PM) can be reduced by up to 20% and nitrogen dioxide (NO2) levels by up to 76%, leading to up to €14 billion in reduced health costs and potentially saving more than 6,000 lives every year in the region.\nAir pollution from shipping can represent up to 40% of all Mediterranean coastal city air pollution. It represents a significant threat for human health, the environment and climate.\n\"The main reason for this pollution is the use of heavy fuel oil, highly charged in sulphur that emits black carbon, heavy metals, fine particulates and sulphur dioxide. As pollutants are carried over long distances, it is not only the inhabitants of littoral zones but also the populations in the inland regions who are subject to respiratory issues as well as inflammations and cardiovascular diseases,\" the report states.\nThe key finding is that the region would benefit most from a combined Sulphur Emission Control Area (SECA) and Nitrogen Emission Control Area (NECA). Sulphur dioxide (SO2) would be reduced by 77% and in port areas even by 100%. NO2 would decline by up to 76% in coastal areas and the east of the Mediterranean Sea. The annual mean of particulate matter (PM2.5) will go down by 15 to 20%.\nShipping emissions cause 50,000 premature deaths per year in Europe and cost €60 billion just in health costs per year in the European Union (EU).In the Mediterranean region only, about 6,000 premature deaths could be avoided due to the reduction of the particle pollution.\nCharlotte Lepitre, Health Policy Officer at France Nature Environnement (FNE), said: “The study shows the need for a Mediterranean Emission Control Area. The French Environment Ministry must now take its role as a leader and search for support in as many Mediterranean countries as possible.”  ", "comment_count": 4, "id": 1412}, {"keywords": "", "author": "", "article_body": "Updated 11.40am Italian minister insists Italy's harbours are closed, Pozzallo mayor concerned - Malta is expecting Italy to offer shelter to a migrant rescue ship stranded close to Sicily because of bad weather, with a government official passing the buck back to deputy prime minister Matteo Salvini who earlier urged Malta to take in the 47 on board.\nThe controversial Italian deputy prime minister in a tweet on Wednesday said the Sea Watch was heading towards Malta, and with worsening weather, said Malta should offer it shelter while The Netherlands (where the ship is registered) should collaborate with Malta and Brussels to receive the migrantson board.\nHe also said that Italy's harbours are closed.\n\n\n\n\"Yet another provocation, after stopping for days in Maltese waters (sic), the Dutch ship Sea Watch3 with 47 on board is heading towards Italy. I repeat that our line does not change. Nobody will land in Italy. (We are) ready to send medicines, food and what should be served but Italian ports are and will remain closed\" Mr Salvini was quoted as saying by Italian media.\nThe ship sailed near the Sicilian harbour of Pozzallo but then headed for more sheltered waters between Porto Palo and Siracusa.\nThe Mayor of Pozzallo, Roberto Ammatuna, expressed his concerns for those on board. \n\"I'm worried about the conditions of the migrants aboard the ship, the weather here is really bad and the situation could degenerate. The port of Pozzallo, like all the ports of Italy, is open, there are no formal documents that we have closed them. Minister Salvini, however, continues to say that they are closed and continue his hostility to the NGOs \" he told TPI News. \nSea Watch International, the German NGO which operates the ship, on Wednesday night tweeted a picture of conditions on board, saying its 47 guests were wet and cold.\n\"Again, we're facing a major storm, coming in tomorrow. And again we are without a port of safety. EU Commission, we don't have time for this.\" it said.\nThe migrants on board Sea Watch.\nThe current situation is almost a replay of the situation at the beginning of this month when the vessel after rescuing migrants off Libya, was denied entry for several days by a number of countries including Italy and Malta.\nMalta eventually allowed it shelter from stormy seas. After negotiations, the migrants were transferred to a Maltese patrol boat and distributed among eight EU countries, including Italy.\nItaly's involvement had raised a political storm between Italian Prime Minister Conte and Mr Salvini, who complained he was not consulted before the decision was taken. ", "comment_count": 0, "id": 1413}, {"keywords": "", "author": "", "article_body": "Almost five decades after land was expropriated to build the Freeport, 10 part owners have yet to be compensated, leading the European Court of Human Rights to find a violation of their right to property.\nThe case involves seven plots of land in Kalafrana and Bengħajsa, limits of Birżebbuġa, part of which were used for Malta Freeport. The applicants’ father, who owned the land, had been offered €10,464 in compensation for six of the plots but he refused. Parts of the six plots were not used to site the Freeport as such and the seventh remains unused to date. \nThe government had claimed that, though not built upon, none of the six plots were left unused but served as a buffer zone for security purposes.\nIn 1997, that is, 28 years after the plots were taken over by the government, the applicants’ father instituted constitutional proceedings and the court found in his favour, declaring the government’s acquisition declaration on the land beyond the Freeport zone as void.\nHowever, the issue regarding compensation for the other land remained pending and, in 2006, the owner and his wife sought constitutional redress in connection with the land actually used for the Freeport and the seventh plot. They insisted the land had not been expropriated for a public purpose but for commercial reasons. The Freeport had been privatised in 2001 and sold to an international company three years later.\nThe court decided that the owner’s right to property was violated when the seventh plot was expropriated and remained unused. \nIt ordered the land to be released and awarded compensation amounting to €30,000. The court found that the other land had been taken over in the public interest. \nBoth the owner and the government appealed, the Constitutional Court upholding the first but not the second appeal and concluding that the first six plots had been acquired by the government in the interest of the country’s economic development. It also withdrew the compensation awarded by the first court in respect of the seventh plot, since ownership had not been proved.\nTen of the owner’s children took the case to the Strasbourg Court in late 2014. Their case was decided by a committee of three judges rather than the usual seven-member panel, as the subject at issue was within the ‘well-established case law’ principle insofar as Malta was concerned. The government argued the seventh plot could still be used in the future to pass gas pipes, even if testimony suggested this was hypothetical.\nThe European judges recalled what the Strasbourg Court had declared in a similar case involving the Freeport, that a project of this scale could require further expansion, although, when expropriating land, the government should have had some concrete plans at least for its forthcoming, if not its imminent, development.\nThey noted that no use had been made of the part of the seventh plot owned by the applicants and taken over nearly 50 years ago. It could not be said that the delay in making use of that land was itself based on any public interest concern. Moreover, the land had become more valuable.\nThe European Court commented that the fact that after five decades the part owners had still not received any compensation meant they had also to bear “a disproportionate burden”, thus violating their right to property.\nSince the applicants did not make a claim for just satisfaction, the court found there was no call to award them any sum of money in that sense, without prejudice to any compensation they could still get from Malta.\nLawyers David Camilleri, Joseph Gatt and Mario deMarco represented the residents.", "comment_count": 10, "id": 1414}, {"keywords": "", "author": "Sarah Carabott", "article_body": "A century ago, when a pandemic wiped out five per cent of the world’s population, warnings to avoid spitting on the floor and allowing sunlight into one’s house were today’s equivalent of getting vaccinated and washing one’s hands.\nHistory of medicine lecturer Jane Orr. Photo: Matthew Mirabelli\nJust like any other country, Malta was not safe from the Spanish flu but a widespread awareness campaign and rigorous quarantine ensured the island suffered the smallest number of casualties.\nJane Orr, who lectures on the history of medicine, will on Thursday recount to an audience in an event hosted by Fondazzjoni Wirt Artna what the Maltese population and the government had done to keep the flu at bay.\nThe island registered the lowest death rate across all of Europe. Only eight per cent of the Maltese population were struck by the deadly and infectious bout of H1N1 strain flu between 1918 and 1919, compared to 23 per cent of the UK’s population.\nIn just four months – between August and December – there were 11,600 flu cases in Malta, with 551 eventually succumbing to the viral infection.\nBy the end of the influenza pandemic, Malta lost 0.3 per cent of its population to the flu, compared to Samoa’s 20 per cent, Italy’s 1.3 per cent and Great Britain’s 0.6 per cent. \nAbout 100 million people perished worldwide, making the Spanish flu the biggest pandemic. \nAsked about today's relevance to a 100-year-old pandemic, Dr Orr noted that today’s H1N1 virus was the same doing the rounds then. However, a repeat with the severity of the Spanish flu was expected only every 300 years or so and, thus, learning how the world coped medically back then could help us today if such an outbreak occurred with such force, she said.\nAccording to Dr Orr’s research, the chief government medical officer, Attilio Critien, had sent a leaflet in every household, warning people about complications and ways to ensure the pandemic did not spread.\nSunlight was also a good shield against the flu because it dried and destroyed the virus\nThose going through an “attack” should use a handkerchief when coughing and sneezing, he advised, calling on people not to spit on the floor or in the street.\nSunlight was also a good shield against the flu because it dried and destroyed the virus. The leaflet asked people to stay away from work and crowded places and to allow as much air and light as possible into their living rooms.\nDr Critien had also deployed officers to places such as theatres to make sure they were not overcrowded, trams were disinfected daily, people were quarantined on Manoel Island and clothes of the deceased were burnt and barred from being pawned at shops.\nThe public talk – The Spanish flu pandemic 1916-1919 – will be held at 6.30pm at Notre Dame Gate, Vittoriosa. More information on 2180-0992, 2180-3091, info@ wirtartna.org or www.wirtartna.org.", "comment_count": 3, "id": 1415}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The growth of blockchain in Malta created “significant risks” of the financial system being used for money laundering and terrorism financing, an International Monetary Fund mission said.\nIn preliminary findings following a visit to Malta, the IMF highlighted blockchain together with the financial and remote gaming sectors and the strong demand for the citizenship-by-investment scheme as posing threats to anti-money-laundering efforts.\nThe government recently enacted three pieces of legislation covering blockchain and cryptocurrencies as part of a national strategy to attract operators to what it calls ‘the blockchain island’.\nThe IMF mission called on the Maltese authorities to ensure that virtual asset service providers ‒ companies dealing in cryptocurrency ‒ fulfilled their anti-money-laundering requirements effectively.\nIt commended efforts by the Financial Intelligence Analysis Unit to implement a 50-point action plan but highlighted the need for “immediate action” to close gaps in supervisory and enforcement systems.\nThe authorities, the IMF said, needed to improve their understanding of risks and ensure that adequate sanctions were applied in case of breaches.\nThe IMF also raised concerns about the effectiveness of financial supervision efforts, pointing to capacity constraints and deficiencies in the regulatory framework.\n“The increasing number of financial entities under supervision, the rapid development of new products, the evolving regulatory environment and the tightening of the labour market have put the Malta Financial Services Authority under considerable strain,” it said.\nTo improve the system’s effectiveness, the mission said the authorities needed to ensure the MFSA was adequately staffed and guarantee its long-term financial and operational independence. Supervisory actions, it added, should not be delayed through judicial appeals.\nThe IMF visit was part of Malta’s regular consultation requirements and included meetings with the authorities and private sector operators.\nIn its overall assessment, the mission said growth prospects re-mained favourable but warned of growing challenges from pressure on infrastructure, skyrocketing housing prices and labour shortages. Measures to make housing more affordable, the IMF said, should remain targeted at low-income families while the authorities should also consider stepping up the provision of social housing.\nIt recommended stronger efforts to encourage women and elderly workers to enter the labour market, coupled with more spending on research and development and easier access to financing for small businesses.\nThe IMF also said Malta should continue with its prudent fiscal policy, aimed at budget balance excluding funds generated from the Individual Investor Programme in the medium term.", "comment_count": 7, "id": 1416}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Thursday.\nTimes of Malta says there are fears among doctors that a Malta-based online medical school could be used as a backdoor for underqualified doctors to work in EU hospitals. It also reports that a no-deal Brexit would cost Malta €6m more. \nThe Malta Independent leads with the prime minister's press conference about Brexit. He said the economic effect on Malta would be 'what we make it'.\nl-orizzont also leads with comments by the prime minister that Malta wants to be the most UK-friendly EU country after Brexit. It also reports about an 'alleged' argument between PN deputy leader David Agius and party official and former MP Jean-Pierre Debono. They told the newspaper they have a good relationship, however. \nIn-Nazzjon highlights the opposition's view that Malta's readiness to have the best relations with the UK.  In its second story, it gives prominence to an EU report that the sale of passports leads to money laundering. ", "comment_count": 1, "id": 1417}, {"keywords": "", "author": "", "article_body": "Malta’s electricity rates were on Wednesday discussed in the European Parliament’s Committee on Petitions with resident Patricia Graham explaining the different rates applied.\nMs Graham told the committee there were three utility tariffs in Malta - residential, domestic and non-residential.\nThe residential rate was the lowest tariff and is available to those living in their primary residence in Malta. The domestic rate applied to secondary homes and was a higher tariff. The non-residential rate, she said, was not applicable to the petition presented.\nMs Graham pointed out that the residential rate was not automatic and had to be applied for. The domestic rate was the default rate applied to all properties.\nShe noted, that an average bill for a family of six would be €91.77 a month for exactly the same consumption on the residential rate but charged on the domestic tariff the cost would be €155.29.\nShe noted that when tenants who become aware of this contacted their landlord asking to be registered on the residential rate, landlords generally refused.\nTenants could use a backdoor and submit their own application for the correct tariff but this came to a total cost of over €500, a rate that was certainly not accessible to minimum wage earners. Moreover, they were charged 13% to have billing errors redressed and had to pay a €50 administration fee for the privilege.\nThe cost to tenants who were fortunate enough who have a landlord who does the right thing costs nothing, Ms Graham said.\nA European Commission representative said that the situation in Malta was legal because the island had a derogation from the Electricity Directive.\nBut MEP Roberta Metsola insisted that the fact that the petitioners were present looked, showed and proved that there was an issue. This, she said, was an issue of fairness and a lot of questions remained pending.\nThe committee noted that the Maltese government was contacted for a response on December 17 but this had not yet been received. It decided to keep the petition open until that response arrived and it would then take action on that.", "comment_count": 35, "id": 1418}]