[{"keywords": "Education", "author": "", "article_body": "The benefits of using diagnostic questions to gauge students’ understanding and learning process was the main theme of a presentation given by Craig Barton to over 150 primary and secondary school educators. Barton was the keynote speaker of the fourth edition of Tikka Matematika training seminar organised recently by the Education Ministry’s Directorate for Learning and Assessment Programmes.\nDuring the event the teachers took part in various workshops related to the theme, and the first MatemaTikka awards for the best innovative projects in mathematics teaching and learning were also announced.\nSt Margaret College’s secondary school, Verdala, Cottonera won the gold award while silver and bronze went to Maria Regina College’s primary school in St Paul’s Bay and Maria Regina College’s primary school ‘A’ in Mosta, respectively.\nThe training was partially funded by the Institute for Education and the European Schoolnet-coordinated Scientix 3 project, funded by the European H2020 research and innovation programme.", "comment_count": 0, "id": 3119}, {"keywords": "", "author": "Jacob Borg", "article_body": "Vulnerable groups like single women with children, low-income tenants and the elderly are experiencing rising risks of falling into relative poverty, a study by the International Monetary Fund (IMF) has found.\nIn a paper released this week, the IMF found that, as the share of population suffering from material deprivation had been declining, the proportion at risk of relative poverty had been “increasing continuously”.\nPeople classified as experiencing relative poverty are those earning less than 60 per cent of the median income. The IMF found that the poverty risk is rising among tenants, mainly low income households and their poverty risk is compounded by rapidly rising rents in an unregulated rental market.\nTenants\nMinimum lease periods are being considered in the government’s proposed reform of the rental market, but rent prices will remain at landlords’ discretion.\nThe IMF said tenants’ struggles pointed to the need to improve housing affordability, including through social policies targeted at low-income households.\nLabour market\nThe report said the overall earnings gap in Malta is among the highest in Europe. This largely reflects the fact that women, especially low-skilled, single mothers tended to remain outside of the labour market in Malta, the IMF said.\nAcknowledging that recent economic growth and policies to promote female participation in the labour market had helped close part of the gap, further encouragement and an extension of these policies was needed to ensure that recent gains were made permanent.\nRead: MFSA will centralise supervision, despite IMF warning not to \nPensions and benefits to elderly\nTurning to the elderly, the report said pensioners’ income had failed to keep up with other incomes, relative poverty risk had increased among the elderly.\nThis pointed to the need to recalibrate social transfers for the elderly, the report said.\nIt cautioned that the fiscal implications of raising pensions or social benefits would need to be considered carefully in light of existing concerns on pension sustainability in an ageing society.\nOngoing changes in the statutory retirement age to 65 by 2027, from 61 for men and 60 for women in 2013, would be an important step to mitigate both fiscal and poverty risks in the long term, the IMF said.\nLow-skilled workers\nLow-skilled workers, refugees and tenants were also found by the IMF to be at risk of relative poverty.\nThe poverty risk was high and rising among low-skilled immigrants from outside the EU.\nAmong these immigrants, refugees, which represented a sizeable share in total population, were particularly vulnerable, the IMF said.", "comment_count": 42, "id": 3120}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A request for the removal of Richard Matrenza as an industrial tribunal chairman has been thrown out on the basis that it does not meet the requirements of the law, according to informed sources.\nThe Malta Association of Employment Lawyers (MELA) had recently written to the Prime Minister and the Employment Relations Board asking for his removal.\nThe association told the Times of Malta that it was very concerned by the government’s reaction and that it would be taking the appropriate steps in due course.\nIn the meantime, further details emerged about the lawyers’ grievances, with sources insisting that the association would have never taken such a step unless it was warranted.\nHe clearly has no idea about proper procedure or respect for it\nMr Matrenza’s lack of legal background is at the root of the association’s request. MELA and the Malta Employers’ Association are both recommending that tribunal chairmen should be lawyers.\nOne source explained that Mr Matrenza had referred a case relating to transfer of business “to be decided by the Director of Industrial and Employment Relations” – who, they said, actually had no power to do so. \nOne of his cases was also appealed and is currently awaiting judgment by the courts.\nOther complaints are related to the time taken for his cases to be concluded, and various demands made by him, which the sources said showed “he clearly has no idea about proper procedure or respect for it”.\nMr Matrenza was one of three chairmen appointed to the tribunal in April 2016 to replace five whose terms had expired in November 2015. \nThe appointments came after a court decision ruling that the industrial tribunal law was unconstitutional as it did not guarantee independence and impartiality. The tribunal was suspended for a few months after the ruling, until a “temporary solution” was established to keep the tribunal functioning. \nMr Matrenza, Malta’s former High Commissioner to the United Kingdom, had in the past also worked for the GWU’s Union Print.", "comment_count": 8, "id": 3121}, {"keywords": "", "author": "Jessica Arena", "article_body": "As a nation that has made great strides in developing LGBTIQ rights and protections, the open-mindedness of such policies have not necessarily trickled down easily in other areas of Maltese life. \nWhile adopting an open-ended attitude of tolerance towards the LGBTIQ community, understanding and normalising the full spectrum of sexuality and gender identity is a goal many institutions have a long way to go before attaining. \n\"I'm fed up of the silence,@ says Ms Cassar Fiott.\nParticularly when it comes to gender identity, public discourse seems to stall at binary gender identities, leaving those who identify in the liminal spaces of that binary often struggling to be heard and have their needs recognised. \nIsabelle Cassar Fiott recognised that she was not cisgender around five years ago, but it was not until she found the term genderfluid that a tangible definition of what she was feeling clicked into place. \n“Genderfluidity to me means that I am not at a fixed point on the gender spectrum. I’m not a girl or a boy, I tend to flow in between the two. Sometimes I feel more male than female, sometimes I feel more female than male and sometimes I feel completely androgynous.”\nA fresh graduate from the UWC College in India, Cassar Fiott took a gap year to work with NGOs and voluntary organisations before enrolling at University. Her activism has led her to become more open about her genderfluidity and hopes to make the conversation about trans and non-binary identities more accessible. \n“I think it’s time to speak up about this because I’m a bit fed up of the silence,” she says. “I didn’t have anybody to talk to about it, I didn’t have anybody to model myself after because I didn’t know anyone else who fell under this umbrella of genderfluidity or non-binary.”\nHaving found no one to turn to when she began questioning her gender identity, Cassar Fiott turned to other allies in the queer community for support, but found that even within that wider community, non-binary gender identities are not really talked about. \n“I decided I wanted to talk about this so that in the very least if someone else was in the same position and decided that they wanted to talk about this but had nobody to talk to, maybe they could come to talk to me about it,” she says with a smile. \n“Our world is split into binary thinking that denotes you as female or male, we stick ourselves to gender norms and people can’t get their heads around the fact that gender is also fluid, as is sexuality. I think people need to be a little less fixated with fitting everything neatly into little boxes and be more open to exploration,” Cassar Fiott says. \nPeople can’t get their heads around the fact that gender is also fluid, as is sexuality\n“The idea of gender norms and the idea of what is male and what is female changes from person to person, from culture to culture, from country to country, so there are no hard and fast rules. Just because you are born female for example, doesn’t mean you have to abide by the ‘rules’ of what is female.”\nCassar Fiott has taken her activism firmly by the reigns and has been working on introducing LGBTIQ awareness education in schools, as well as flagging legal and policy issues in relation to trans and non-binary people.\n “We want little kids to grow up aware of different sexualities and gender identities because kids don’t automatically marginalise someone who is different to them,” she says. \n“There’s no hate built into them at a young age, so if we teach kids to love their friends for who they are, they’ll grow up knowing that it doesn’t really matter who you are or who you express yourself as, because you’re still a person and you still need to be treated with respect.” \n\nCassar Fiott strongly believes in and hopes to  advocate for LGBTIQ inclusive sex education in schools as well as for the curriculum of the Personal, Social and Career Development (PSCD) to cover queer and gender non-conforming teens more comprehensively. \nThe young activist also notes that loopholes and shortcomings of the Gender Identity Act are negatively affecting non-binary and genderqueer people. \n Cassar Fiott will be addressing all these topics and more during a talk about her experiences as a genderfluid person living in Malta. From safety concerns, to the particular hang ups of obtaining correct documentation as a non-binary person, she hopes her experiences will serve as a sounding board for others who are still struggling with their identities. \n“Thinking about the backlash is scary,” Cassar Fiott says, “but you surround yourself with people who love you and you keep going.”\n“I don’t want to be a hypocrite because I’m a very politically active person and I’m not one to keep my opinions to myself and I try to make my opinions heard. So if I believe in all this, that we shouldn’t be afraid to express who we are, then why should I be afraid to express who I am? I put myself forward so other people can also eventually put themselves forward.”\nExperience of Genderfluidity and the Non-binary is being held tomorrow at Monaliza Lounge, Valletta. Entrance is free, however donations to Arc will be appreciated.", "comment_count": 89, "id": 3122}, {"keywords": "", "author": "", "article_body": "A 37-year-old Gozitan is to be arraigned in court and charged with drug trafficking offences, after police in Malta’s sister island caught the Żebbuġ resident with several sachets of suspected cocaine.\nMagistrate Joanne Vella Cuschieri is leading an inquiry into the case, the police said in a statement on Saturday.", "comment_count": 0, "id": 3123}, {"keywords": "", "author": "", "article_body": "Amateur fishermen and small boat owners with vessels moored in Gżira have asked what is to become of them and their hobby once MIDI develops Manoel Island.\n“If land reclamation goes ahead and the slipway and facilities are removed as is envisaged in MIDI’s plans boat owners will be at a loss as to where they can launch and moor their vessels,” Għaqda Sajjieda Dilettanti Gżira said.\nThe amateur seafarers said that MIDI’s plans, which include a higher bridge to Manoel Island, a tract of water reserved for yacht yard customers and a third-party lido along part of the shoreline, would all significantly reduce the amount of space available to them and their boats.\nThey acknowledged that MIDI’s new plans for the site – which were revised following significant protest – were “more attractive” than the original design put forward.\nRead: NGO backs calls to revoke Manoel Island project\nThey would not, however, protect Gżira’s decades-old slipway or the boat owners who use it.\nThe port of Gzira will also lose over 100 mooring points,” the group warned, saying the “famously attractive” boats that had “fascinated locals and tourists” for generations would disappear.\n“The members of Għaqda Sajjieda Dilettanti Gżira have strong emotional and psychological ties to the sea. Their way of life is under severe threath from this development. Proposed changes are expected to cause trauma and grief for a lot of fishermen and small boat owners,” they warned.\n“Għaqda Sajjieda Dilettanti Gżira represents common people who do not deserve to be treated with such disrespect by the wealthy and powerful,” they said, arguing that MIDI had never made any plans for them.", "comment_count": 34, "id": 3124}, {"keywords": "", "author": "", "article_body": "A 55-year old man was accused on Saturday of having repeatedly raped his partner’s children while she was undergoing treatment for cancer.The man, who cannot be named to protect the identity of the victims, was remanded in custody after pleading not guilty to raping two minors, a boy younger than 12 and a girl.He also pleaded not guilty to raping another person, considered vulnerable because of his mental state, within sight of a minor.Inspector John Spiteri told the court that the man’s partner and another woman, a relative, had come forward together claiming that the accused had engaged in sexual activity with each of their children.Police suspect that the crimes were carried out over a number of years, on occasions when the children’s mother was in hospital or bedridden as a result of treatment she was receiving for cancer.The prosecuting officer objected to the defence’s request for bail due to the severity of the case, which he said was one of the ugliest he had encountered in his career, and the man’s prior police record.Defence lawyer Franco Debono argued there had been elements of cooperation with the police and that, if released on bail, the man would not be returning to his partner’s home.Magistrate Yana Micallef Stafrace denied the request and ordered that the accused be remanded in custody.", "comment_count": 0, "id": 3125}, {"keywords": "", "author": "Philip Leone Ganado, Edwina Brincat", "article_body": "Updated at 3.30pm\nA 38-year old man has been accused of defrauding the company for which he worked of more than €220,000.The man, who cannot be named by court order, was arraigned on Saturday and granted bail after pleading not guilty to the charges, with the defence arguing that the man could have been the victim of a frame-up.Prosecuting officer Inspector Joseph Xerri told the court the accused, formerly an employee at an affiliate marketing company, had accessed more than 1,000 client accounts and diverted funds to an account he controlled.The company alleges that an email account registered to the former employee was used to carry out the scheme and that he was the only one with access to the relevant accounts, which the accused denies.Defence lawyer Manuel Mallia argued that his client had fully cooperated with the police and had been able to provide explanations for all the issues raised during a four-hour questioning on Friday.Dr Mallia said documents allegedly signed by the accused had been falsified and that parts of the allegation still required further investigation, including with international organisations whose services were used.“This is not a clear-cut picture. There are still many pieces that do not fit together,” he said. Magistrate Yana Micallef Stafrace accepted the defence’s request for bail against a deposit of €10,000 and a personal guarantee of €75,000. The court also ordered the freezing of the accused’s assets.\nLawyers Stefano Filletti and Maurice Meli appeared parte civile.", "comment_count": 0, "id": 3126}, {"keywords": "", "author": "Claire Caruana", "article_body": "Finance Minister Edward Scicluna would not say how much credit ratings agencies were paid on an individual basis, insisting the information was commercially sensitive.\nIn reply to a parliamentary question by Nationalist MP Simon Busuttil, who requested a breakdown of payments to the different rating agencies, the Finance Minister said he could not table the information as this was of a “commercial nature”.\nAsked by Dr Busuttil to table copies of the contracts between the government and the credit rating agencies, Prof. Scicluna insisted that the contracts, which were between the Finance Ministry and the agencies, would be supplied once the government had “permission” to do so. He again cited commercial sensitivity as the reason for such a decision.\nRead: Fitch receives a €40,000 direct order\nFees paid to credit rating agencies, independent companies that assign ratings which reflect the ability of a debtor to pay back debt, made headlines in the past weeks after it emerged that the payments by the government soared in recent years.\nAccording to information made public last month, since 2013, the payments have reached new highs, with the government forking out a total of €237,502 last year alone. In 2013, this figure stood at €121,119.\n\nDespite this, the Finance Minister claimed last week that such payments had not “exploded”, insisting that the country had been paying for such ratings for years, even before the Labour Party returned to power in 2013.\nThe Finance Ministry has yet to provide information on the payments prior to 2013, with questions sent last week remaining unanswered by the time of going to print.\nIn recent years, the government has referred to the ratings by a number of such agencies, including those by world-renowned agencies like Fitch, DBRS, Moody’s and Standard and Poor’s, when speaking about Malta’s booming economy.", "comment_count": 56, "id": 3127}, {"keywords": "", "author": "", "article_body": "A passenger leaving for Libya was caught with undeclared cash and an expired visa as he was preparing to board a flight out of the country on Saturday.\nThe man was heading to Mitiga when anti-money laundering officials who were screening passengers at the airport’s departure lounge had their suspicions raised.\nWhen asked how much cash he was carrying, the man first said €10,000 before quickly changing his answer to US$6,000.\nThat led to a search of the passenger and his belongings, with Customs officials finding a total of €18,903. He was also found to be overstaying his period in Malta, with his visa having expired earlier in February.\n€10,000 of the cash – the legal limit – was returned to the man, who was placed under arrest and will be arraigned in the coming days. The rest of the money was seized by Customs.\nThis was the second such seizure by Customs officials in as many days. On Friday, authorities also caught a Turkey-bound passenger with €18,000 in undeclared cash. ", "comment_count": 0, "id": 3128}, {"keywords": "", "author": "", "article_body": "A 54-year-old woman was seriously hurt on Saturday morning, with police saying initial indications are that she fell in her home’s yard in Rabat. Emergency services were called to the residence on Triq Għajn Kajjet at around 9am and the woman was taken to Mater Dei Hospital by ambulance. \nMagistrate Yana Micallef Stafrace is leading an inquiry into the incident.", "comment_count": 0, "id": 3129}, {"keywords": "", "author": "", "article_body": "A motorist knocked a 70-year-old off his motorcycle and drove off before emergency services arrived in the early hours of the morning, the police revealed in a statement on Saturday. The elderly man, who lives in Birżebbuġa, was riding a Modenos motorbike when he was hit by a car on Triq iż-Żurrieq.\nPolice were called to the scene at 4.40am, where they found the injured biker but no trace of the car driver involved, who had fled the scene. The motorcyclist was taken to Mater Dei Hospital, where he is being treated for grievous injuries. Police investigations are ongoing.", "comment_count": 0, "id": 3130}, {"keywords": "", "author": "", "article_body": "Updated at 12.20pm with Labour statement\nPlans to keep fuelling Malta’s economy with boosts of cheap labour drew the ire of two political parties on Saturday, with a third expressing alarm at the government’s apparent reluctance to factor environmental considerations into urban planning.\n“Foreign workers are living in overcrowded houses while locals are worried about rising rental and real estate prices,” the PN said in a statement. “EU data proves it”.\nMPs Marthese Portelli and Ivan Bartolo were referring to Eurostat results which found that 13 per cent of non-EU foreign workers lived in overcrowded accommodation, as well as Eurobarometer survey results which revealed that rising housing prices are a key concern among locals.\n“The lack of long-term planning is leading to the rise of cheap labour, as highlighted by Yana Mintoff, and to schoolchildren being taught inside container classrooms,” they warned.\nPrime Minister Joseph Muscat has repeatedly emphasised the need for Malta to import foreign labour, saying that this was a necessary step for the country to continue growing while being able to finance social benefits like pensions. \nThe Labour Party accused the PN of \"resorting to xenophobia and far-right statements\" to try and spin a positive Eurobarometer report their way. \n\"The PN knows that the government is already addressing the challenges it highlighted,\" Labour said. \nNo sustainable policies - PD\nIn its own statement, the Democratic Party’s MEP candidates spoke with concern about the government’s reluctance to force urban planners to make long-term environmental considerations.\nWatch: Malta has failed at planning, says construction lobby chief\n“Sustainable development implies sustainable environmental policies, which are dependent on sustainable economic growth,” said Martin Cauchi Inglott.\n “Prime Minister Dr Joseph Muscat stated that he fails to see that urban planning for years to come should venture into these considerations. In my opinion this is absurd,” he said.\nThe PD’s Anthony Buttigieg accused the PA of being “politically captured”  while candidate Camilla Appelgren argued that environmental degradation was happening “piecemeal”, with no holistic policy in sight.\nCut construction sector down to size - AD\nAlternattiva Demokratika welcomed the government’s assurances that foreign workers brought in to service massive construction projects would be assured minimum employment conditions, but said this was not enough.\nEducation advances had led to fewer low-skilled labourers being available, the AD said.\n“Government should take this opportunity to cut the construction industry down to size and resuce the economic dependency of the country on it,” said AD chair Carmel Cacopardo.\nHe said it was “clear” that private investors were out to squeeze all the profits they could.\n“The db Group, for example, after being acquiring public land from Government for a pittance, is now doing its utmost to minimize the cost of construction to further increase its profits to the maximum possible,” he said.", "comment_count": 36, "id": 3131}, {"keywords": "", "author": "Claire Caruana", "article_body": "It is becoming increasingly difficult for migrants in Malta to find “dignified” accommodation, human rights NGO director Neil Falzon fears.\nThe Times of Malta sought the Aditus Foundation director’s view on the housing situation after it emerged this week that foreigners living in Malta are the most likely to end up living in overcrowded households, with 13 per cent of non-EU residents confined in crowded homes.\n“What we encounter in our work definitely confirms the main conclusion: it is becoming increasingly difficult for migrants to find accommodation that can be defined as dignified,” Dr Falzon said.\nHe said living conditions were worsening while rent prices continued on an upward trend. This, the director pointed out, was also the case with “squalid places such as garages and tiny shared places”.\nWhile Maltese people were also experiencing pressure as a result of rent prices going up, the figures, published by Eurostat on Thursday, confirmed that migrants were more vulnerable to this form of exploitation, Dr Falzon said.\nSqualid places such as garages\n“At the heart of this is the criticism of the fact that Malta’s private rental sector is almost entirely unregulated, allowing landlords to do as they please in terms of prices and rental conditions,” he said, adding that the recently-published data confirmed what NGOs have been saying for some time and noting that organisations had been lamenting the state of the housing situation “for quite some time”.\nDetailed proposals had also been put forward to the government, he said.\nOn whether he believed that the authorities were taking the issue seriously enough, Dr Falzon said he feared this was not the case.\n“The recently-announced measures go some way but fail to address core problems. We also think that the Ħal Far open centre also send a very wrong message: that it is fine to house migrants in sub-standard conditions, at times for years. If government can do it, why not a landlord, right?” he said.\nWhile NGOs have been raising the issue of housing problems for years, it recently emerged that the issue has also started becoming even more of a worry for the Maltese people. According to the most recent Eurobarometer survey, more than a quarter of respondents listed the housing issue a concern. This meant the Maltese were now more worried about housing issues than crime.\nQuestions sent to the office of the Parliamentary Secretary for Social Accommodation, Roderick Galdes, were not answered by the time of writing.\nPopulation growth is the only plan - PN\nNationalist Party MPs Marthese Portelli and Ivan Bartolo expressed dismay at the way the government's drive to increase Malta's population was leaving more and more people by the wayside. \n\"There is no long-term plan about how many foreign worker this country needs,\" they said, adding that this was leading to cases of exploitation of foreign labour. \n\"This is leading to evident problems of cheap labour, as highlighted by Yana Mintoff, and to housing schoolchildren in containers,\" they said. \nThe PN would guarantee that everyone had a roof on their head, they said. ", "comment_count": 27, "id": 3132}, {"keywords": "", "author": "", "article_body": "Living with breast cancer and a seven-year-old son who battles chronic kidney disease on a daily basis haven’t dampened the joie de vivre that blogger Lorinda Mamo exudes.\nThe young mother shares her inspiring story in this month’s edition of Sunday Circle, which is out this week with The Sunday Times of Malta, together with the fully-interactive digital edition that will be accessible on the TOM Mag app.\nLorinda’s world was turned upside down when, soon after her son was born, she was diagnosed with a chronic kidney condition and Prune Belly Syndrome. One blow followed another as, soon after, she was diagnosed with breast cancer.\nShe shares her story of hope and silver lining with Sunday Circle, recounting how she stopped being angry at the world and, instead, found solace sharing her experiences with the outside world through her popular blog.\nThis edition of Sunday Circle also features experimental photographer Ritty Tacsum ahead of her upcoming solo exhibition. Ritty, who at 28 has already exhibited her work on the American and Asian continents, gives a frank interview as she delves into how photography offers an outward reflection of her introvert nature – a video interview on the digital app gives exclusive insight into her work.\nThe digital edition offers extra content in addition to that found on the print version, including video interviews and behind-the-scenes footage.\nOnto lighter topics, March also sees a highly-entertaining interview with stand-up comedian Kevin Naudi.\nWith carnival weekend in full swing, readers with a well-developed sweet tooth will particularly enjoy Pippa Mattei’s pancakes and prinjolata special, while on the arts front we take a look at the publishing scene in Malta and meet actress Isabel Warrington, star of the upcoming production An Inspector Calls.\nThere’s also fashion, shopping, personalities and more. So don’t forget to check out the print or digital version of this month’s edition of Sunday Circle.\nSunday Circle is published by Allied Newspapers.\nDownload the TOM Mag app on Google Play or App Store.", "comment_count": 0, "id": 3133}, {"keywords": "", "author": "Claire Caruana", "article_body": "There is no need to reinvent the wheel to put in place an insurance scheme for educators, the Malta Union of Teachers has told the government, adding there was no reason why such a measure should require “substantial time”.\nThe statement was made in the wake of an official request filed by the union for all teachers to be covered by insurance, after it was announced earlier on in the week that members of the disciplined forces will be included under a new occupational insurance scheme.\nWhile questions to the Education Ministry by the Times of Malta remained unanswered, MUT president Marco Bonnici confirmed that the government had replied to the union’s request, stating that it would be “considered”.\nHowever, the union head added, the government warned that the announced scheme had taken a “substantial amount of time to develop and put in place”.\n“The MUT thanks the minister for his reply. However, the MUT is positive that, since one does not need to reinvent the wheel, if the authorities are really interested in a scheme of this nature, there is no reason it should take a substantial amount of time.\nThere is no reason it should take a substantial amount of time\nIn fact, the text of the announced scheme would be a good place to start,” Mr Bonnici told the Times of Malta.\nHe iterated that the union wanted to emphasise that its main priorities were still “proper security measures and the prevention” that would ensure educators were safe.\n“Any additional measures, including insurance and other schemes, should never be at the expense of reduced security,” the union head went on.\nOn Monday, Home Affairs Minister Michael Farrugia announced that members of the disciplined forces would be eligible for compensation of up to €180,000 in case of death or injury while on duty, under a new occupational accident insurance scheme.\nAccording to the MUT, in the past the government had claimed that it did not insure its workforce.\nTeachers not treated like AFM or Customs - UPE\nMonday’s announcement also irked the Union of Professional Educators – Voice of The Workers, who also asked why personnel at the Armed Forces and Customs were eligible for compensation for injuries at work but the same was not on offer for teachers.\n“The union must express its extreme disappointment that, once again, educators have not been afforded the same consideration,” the UPE said in a statement, noting that educators have for many years “been subjected to unexpected violence in their work environment” from third party aggressors as well as students.\nSafety at schools has been making headlines again this year after reports of aggressive behaviour in different localities.", "comment_count": 7, "id": 3134}, {"keywords": "", "author": "", "article_body": "A drunk driver came close to causing a tragedy in Gozo in the early hours of Saturday morning, losing control of his car and mounting a pavement close to where people were standing.\nPedestrians celebrating carnival were standing just a few metres away. Thankfully, nobody was hurt.\nThe incident happened on Triq ir-Rabat, Żebbuġ at around 2am, the police confirmed. \nThe driver, who police said was under the influence of alcohol, is expected to be arraigned in court in the coming days. ", "comment_count": 0, "id": 3135}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "There are over 20 new homes for the elderly on the way and the CEO of one of Malta’s largest residential care groups has warned that many are being designed with the minimum standards, rather than with excellence in mind.\nCareMalta’s head, Natalie Briffa Farrugia, said that when the standards were being drawn up some years ago, they had to be pragmatic given that existing facilities had been around for a considerable time.\n“We certainly could not have had a situation where a large number of the facilities did not meet the standards. What would have happened? Would you have closed them all down?” she asked.\n“However, minimum standards are just that: the basic level. It does not mean that facilities should not have better ones if possible.”\nOne of the standards that she gave as an example is the ratio of one bath to no more than five patients – which means this is what many of the current applications seem to have in mind, even though the clause was only meant to be transitional.\nThe law, which came into force in 2016, laid down that all new homes would provide single and double rooms with accessible ensuite showers and toilets – but left the ratio for baths at one per five residents.\nIt provided a proviso for existing homes that did not meet the requirements, giving them up to 10 years to upgrade their premises – as long as structural parameters permitted.\nMs Briffa Farrugia felt that the spirit of this transitional proviso was being ignored.\nMinimum standards are just that: the basic level\n“We have one or two patients per bathroom, and the only exceptions are where patients are not mobile or require special care for bathing and toilets,” she explained, adding that some of the existing homes were simply finding it was not feasible to upgrade since they did not have the back-up provided by economies of scale.\nAt the moment, there is considerable demand for places in nursing and residential care, but with around 20 homes in the pipeline, Ms Briffa Farrugia said it was only a matter of years until the supply actually overtook demand.\nThere are currently 2,800 beds available in Church or private homes, with 1,834 for which permits are already issued (including the St Vincent de Paul’s extension), as well as others in ODZ areas for which no permits have yet been issued.\nThere were some factors which the entrants to the market were simply not taking into account, she said, such as the optimum size – around 150 residents – and the economies of scale that come  from having multiple facilities, ranging from recruitment to management.\n“There are a number of applications for facilities taking 300 residents. How can you provide a home-life setting?” she asked, urging the Homes for Older Persons (Care Quality Standards) Authority to opt for the best possible standards for new facilities,” she said.\n“Most of our own facilities have around 200 residents, and I can assure you that this requires a considerable level of expertise. How would someone manage with 300 highly-dependent residents if they have no experience in this area? Let alone when they have five people sharing one bathroom!\n“Although the daily tariffs have improved and there is more demand, I would strongly urge those coming into the market to really do their homework as, unless you have experienced people who know how to run a facility with maximum efficiency, then it can be very challenging.\n“From a  business perspective, the situation is very attractive, but from a care perspective, it is very worrying.”\nThe CareGroup was founded 25 years ago and now has nine facilities with 1,200 employees and 1,600 patients – most of whom are handled through a private/public partnership with the government. It had a turnover of nearly €27 million in 2017.", "comment_count": 5, "id": 3136}, {"keywords": "", "author": "", "article_body": "These are the leading stories in local newspapers this Saturday. The Times of Malta delves deeper into an IMF report on Malta, which among other things found that there is a rising risk of poverty among vulnerable groups in the country. The newspaper also reports that BOV is shutting down US dollar accounts for a number of clients. The Malta Independent cites Equality Minister Helena Dalli as saying that much more must be done to increase the number of women in the workforce. L-Orizzont quotes a psychiatrist warning the media to avoid sensationalism about the Momo Challenge – a viral hoax that seeks to trick parents into thinking that an image of a puppet is being used to urge children to commit suicide. In-Nazzjon highlights the start of carnival, and also reports that 12 prefab containers being used as classrooms cost taxpayers €200,000.", "comment_count": 0, "id": 3137}, {"keywords": "", "author": "", "article_body": "Updated at 11.27am with police statement\nA man caught on video kicking in the door of a Sliema high street store in broad daylight has been identified and will face charges, the police said in a statement on Saturday. \nThe police statement came just hours after a group of gender equality NGOs had slammed the force for its apparent inaction following the incident.\nThe incident happened on Monday in Bisazza Street, when a man kicked in the door of a store and then stormed inside in broad daylight, as pedestrians looked on in horror.\nA video clip of the incident went viral in the following days.\nNothing was believed to have come of the incident, with police sources saying that neither the shop nor owner woman who was the alleged target of the intruder’s ire were willing to press charges.\nThat prompted anger among a group of gender equality NGOs, who said the man had been out to “attack his partner at her place of work”.\nIn a statement issued late on Friday, they noted that by law, police can charge people with domestic violence even if the victim is not willing to file a complaint.\n“Time and time again we hear of women complaining about how the police have refused to take their report, failed to investigate and/or never issued charges pertaining to their case,” they said. “Given the lack of action in this case, when there is clear evidence of domestic violence, confirms further their stories”.\nDomestic violence, they said, was a matter of public concern.\nRead: Why is it so hard for women to escape domestic violence?\n“Shrugging off the matter by simply claiming that no one came forward or was reluctant to speak does not suffice,” the NGOs said as they called on police to act, and for government to investigate and explain the decision if they did not do so.\nThe statement was issued by Association for Equality, Dar Merhba Bik Foundation, Fondazzjoni Sebh, Malta Confederation of Women Organisations, Malta Association of Women in Business, Men Against Violence, St. Jeanne Antide Foundation and the Women’s Rights Foundation.\n'We have pressed charges' - police\nOn Saturday morning, the police categorically denied claims that they had done nothing. \nThey acknowledged that the shop owner had declined to press charges following the \"minimal\" damage to his shop and said the domestic violence victim had not wanted to cooperate with police or identify her aggressor. \n\"After various investigations, the aggressor was identified and charges have been filed against him,\" the statement said. \nNo further details were provided. ", "comment_count": 139, "id": 3138}, {"keywords": "", "author": "", "article_body": "A motorcyclist was seriously hurt late on Friday after he skidded and fell with his Harley Davidson bike in San Ġwann. \nThe 40-year-old rider was on Triq Bella Vista when the incident happened, at around 11.30pm.\nHe was taken to Mater Dei Hospital by ambulance, where doctors certified him as having been seriously injured. \nMagistrate Caroline Farrugia Frendo is leading an inquiry into the incident. \n ", "comment_count": 0, "id": 3139}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated 10.55am with bank statement\nBank of Valletta has been closing down a number of accounts during the past weeks, mostly in US dollar denominations, citing “client relationship reviews”, the Times of Malta is informed.\nAs the island is facing increasing pressure on its reputational risk, particularly due to claims of lax monitoring against money-laundering and proceeds from organised crime, BOV informed some of its clients that it will be closing down their accounts.\n“Following an internal policy review, Bank of Valletta plc is no longer in a position to continue processing transactions through your US$ account held with the bank,” correspondence sent to clients and seen by this newspaper, states.\nClients, mostly international businesses and wealthy individuals, have been told that while the bank will continue to provide banking services in other currencies, it will close down their dollar accounts with immediate effect.\nRelationships and accounts are reviewed on a regular basis\nAsked for a reaction, a spokesman for the bank said that while BOV extends services in various currencies to a full spectrum of clients, it manages and maintains relationships and accounts within its risk appetite framework.\n“Relationships and accounts are reviewed on a regular basis, and the necessary steps to align these with the bank’s risk appetite are taken accordingly,” the bank said.\nBanking industry sources told this newspaper that the exercise made by BOV “might be related to potential problems with its US dollar correspondent banks”.\n“Malta’s banking industry has been on the radar for a long time now and this may be part of the consequence. Despite continued claims by the local authorities that Malta is a sound jurisdiction, it is evident this view is not shared by other countries. We are no longer being taken seriously,” the sources said.\nLast week, Malta’s reputational problems were also highlighted by the CEO of HSBC Andrew Beane while announcing a 23 per cent drop in profits in the financial year ended December 2018.\nHe warned about the danger to the sector as a whole: “2018 was difficult for the local financial services sector which suffered further reputational damage.\n“It is essential that all market participants ensure anti-money-laundering standards are fully implemented without delay in order to avoid more significant long-term risks. We welcome new initiatives announced by the local authorities which the industry must fully embrace and support,” he said.\nOnly last year, Germany’s banking giant – Deutsche Bank – withdrew correspondent banking services for US dollar transactions to BOV without giving a reason.\nThe local bank played down the incident, describing this as “a normal occurrence” in the banking sector.\nBanks outside the United States require a correspondent bank to clear transactions in dollars.\n'Higher-risk clients' - BOV\nIn a statement issued on Saturday morning, the bank insisted that the accounts it had shut down belonged to customers which it considered to be \"of a higher risk\". \n\"This forms part of a multi-year de-risking programme that the Bank is undertaking,\" BOV said, adding that any further interpretations were \"pure speculation.\"\n\"The bank continues to offer accounts in US dollars and in all major currencies,\" it added. ", "comment_count": 93, "id": 3140}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The courts and the Industrial Tribunal are calculating compensations based on different parameters, resulting in widely varying awards, lawyer Andrew Borg Cardona said.\nAddressing a conference organised recently by the Malta Employers’ Association on reform of the tribunal, he noted that there were various grey areas that needed to be resolved, adding that although most of the tribunal judgments were appropriate, some made “no sense”.\n“There are too many different interpretations and we need clarity, especially when it comes to the calculation of compensation for unfair dismissal,” he said, adding that some countries had successfully capped amounts.\nThe MEA believes that compensation should be capped at the equivalent of 18 months’ salary, which some unions disagree with.\nThe tribunals have handled over 2,500 decisions over the years since they were first set up in 1976, many of which ended with an amicable solution. MEA executive Charlotte Camilleri said that in 2016 and 2017 more cases were settled amicably than through the tribunals.\nHowever, the MEA feels that there is much wrong with the current system, calling for the tribunal chairs – who earn around €300 a month – to be lawyers, and for the tribunals to have their own premises, rather than relying on whichever court hall happens to be free.\nWe need clarity\nApart from having consistent judgments and clarity, those at the conference all agreed on the need for speed. General Workers’ Union secretary general Josef Bugeja pointed out that in cases of reinstatement, for example, the employee could not hang around for weeks on end awaiting the outcome of the case, adding that one case had taken two years.\nThe MEA first presented proposals for the reform of the system in 2014, prompted primarily by the fact that the system – meant to bypass the court system to make it faster – had ended up taking far too long.\nAnother way to speed up the process was proposed by Voice of the Workers UĦM secretary general Josef Vella: mediation. He also said that the tribunal chairs should work full-time. Alternative dispute resolution was also proposed by FORUM representative Chris Attard, who said that either arbitration or mediation would drastically reduce the caseload at the tribunal.\nDr Borg Cardona pointed out that there are five different bodies which could be approached when seeking justice – a situation which will be exacerbated when the Human Rights and Equality Act comes into force, adding yet another body to deal with cases  involving discrimination and sexual harassment, for example.\nNationalist MP Claudette Buttigieg – who is also deputy Speaker – said that the proposals should be made to the parliamentary Social Affairs Committee, which would ensure that they were put on the agenda for discussion.\nThe conference was closed by the Minister for European Affairs Helena Dalli, who reassured the audience that reform on the tribunal was a priority, expressing her agreement with the idea of alternatives to the tribunal procedures.\nThe main MEA proposals:\n▪ Change name to Employment and Industrial Tribunal\n▪ One tribunal whether complaint is civil/administrative or criminal\n▪ Chairperson should be a lawyer with seven years’ experience\n▪ Set up Employment Appeals Tribunal rather than referring appeals to court\n▪ Appeals only to be allowed for unfair dismissal cases\n▪ Set three-month limit for cases to be concluded\n▪ Cap compensation amount at 18 months\n▪ Security of tenure for chairs and members for set period", "comment_count": 1, "id": 3141}, {"keywords": "", "author": "Keith Micallef", "article_body": "Some illegally-placed caravans at the Armier campsite have been removed ahead of an on-site inspection by the Planning Authority, but a host of other serious infringements remain pending. \nThe issue revolves around an enforcement notice issued in October, when the planning watchdog ordered facility administrator Vince Vella to comply with the conditions of a permit issued in 2004. \nAn appeal was lodged by Mr Vella and the case remains pending before the Environment and Planning Review Tribunal. Sources said that an on-site inspection as part of the proceedings that started in December was yet to take place. \nOn Wednesday, the administrator took the initiative to remove a number of mobile homes that had been placed outside the site’s footprint. A Planning Authority spokesman confirmed that this operation, which was carried out by means of a crane, was done with its approval.\nThe clarification was sought by Times of Malta due to the fact that two weeks earlier, the contravener had been caught red-handed removing the same caravans, only to place them on the other side of the facility. \nThe attempt to regularise his position backfired when the authority forced him to reverse the action and return the mobile homes to their original location, at his own expense. \nWhile this particular infringement seems to have been addressed, it was just one of the many infringements flagged in the enforcement notice. \nRead: Armier campsites being 'used as fixed addresses'\nApart from the illegal encroachment on an adjacent road, the authority is insisting that use of static caravans as “fixed” residences was in breach of the permit. \nAnother issue flagged was the unauthorised alteration of the main building, parts of which were converted from a restaurant to a dormitory. \nThe strict guidelines on how the land should have been allocated had also been breached. According to the permit, a quarter of the site should be dedicated to camping facilities, a fifth for mobile caravans and 16% landscaped. However, over the years, the complex gradually morphed into a conglomeration of mobile homes crammed close to each other. \nMeanwhile, campsite ‘tenants’ were closely following the appeal proceedings after having “invested” large sums to acquire a mobile home. Last November, The Sunday Times of Malta reported more than 70 people were claiming to have been “conned” into buying these structures costing about €30,000 each. \nCaravan enthusiasts reported they had been sold the mobile homes by Mr Vella through a written agreement, which specified a yearly payment of about €20 per square metre of leased land. They claimed they only learned that such deal was not allowed when the enforcement notice was issued. \nMr Vella denied the claims, saying he always acted in good faith.", "comment_count": 24, "id": 3142}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "An eight-storey hotel in Mellieħa is set to get the Planning Authority’s go-ahead despite having been recommended for refusal for breaching the area’s height limitation policy.\nThe plans, by J Portelli Projects, include 120 residential units, shops, a hotel, underground parking and garages on a vacant 3,600 square metre plot close to the Valyou supermarket.\nDescribed by the Mellieħa local council, which once sought to use the land for community facilities, as overly-intensive and incompatible with its surroundings, the project had been headed for refusal after a negative recommendation by the PA case officer.\nHowever, at a hearing on Thursday, a majority of the PA board indicated their intention to overturn the recommendation and approve the project. A formal vote will be taken in the coming weeks.\nThe case officer had concluded that the eight storeys proposed fell foul of the height limitation policy, which allows three floors and, under a special adjustment policy for hotels, an extra two floors over and above that.\nNevertheless, the case officer found the project acceptable in principle from a planning point of view and concluded that it was unlikely to have significant environmental or traffic impacts.\nThe project architect had been advised to redesign the project to address the height limitation problems, but declined to do so, maintaining that the plans were already in line with policy.\nNationalist MP and former Mellieħa mayor Robert Cutajar, who objected to the project during the hearing, told Times of Malta the previously government-owned land had in the past been earmarked by the council for a project to benefit the community.\nHe also pointed to changes to the planning policy for the Tal-Masrija area in 2015, which he said had created a precedent, the effects of which were now being felt.", "comment_count": 76, "id": 3143}, {"keywords": "", "author": "", "article_body": "The government's harm reduction approach to cannabis legalisation would not solve anything, according to an academic.\n\"I would like to declare that I will not subscribe to a social policy that justifies legalising cannabis by citing ‘harm reduction’. From where I stand the negative impact of this substance compared to the ‘benefits’ some might quote in legalizing cannabis consumption are unparalleled,\" Prof. Andrew Azzopardi, the Dean of the Faculty for Social Wellbeing, said in a statement on Friday.  \nLegalising cannabis would be waving a white flag - Caritas\nThe government has in recent weeks hinted that it was moving towards dealing with the drug from a \"harm reduction approach\", and exploring the possibility of introducing a register of cannabis smokers that would legalise the use for those aged 21 and over. \nThis would be coupled with increased effort to discourage use at an early age and awareness campaigns around health impacts. \nIn Prof. Azzopardi's opinion, regulating the use of cannabis around a harm reduction rationale would not solve anything and the dangers of the underground illicit drug trafficking would remain \"active and lively\".\nIt might also lead to an increase in the use of harder substances. \n\"I foresee a situation where once the drug becomes more readily available, the whole mystique of using cannabis as a form of etching distinctive identities will die a natural death and somewhat may lead to a gravitational pull towards the harder drugs,\" he said. \nProf. Azzopardi said he would not make the argument that cannabis was a gateway drug, calling it an \"old chestnut\". \n\"The impact of cannabis is what it is and it is useless trying to get away from the evidence,\" he said. \nHis lengthy statement included information on the negative repercussions of cannabis use, including how it could induce dizziness, lower fertility rates, and effect short-term memory. \nCannabis use, he said, might lead to the lessening of concentration on one’s studies or job and in the case of athletes’ would curtail performance. \nHe also warned that it could increase anxiety and paranoia and there was evidence \"that regular cannabis use increases the risk of developing psychotic illnesses, such as schizophrenia, particularly in adolescents”.\nThis, he said, was further compounded by what psychiatrist Anton Grech had found in research in the area of schizophrenia, that cannabis use might impact young people due to the malleability of their brain and potentially instigate memory impairment. \nShifting from decriminalising to the legalisation of cannabis might lead to increased use, he said.\n\nWon't end trafficking\n\"Whilst in a way I can understand the argument that legalising cannabis will partially curtail illicit use and sale, a so-called controlled market will not get the traffickers out of the way,\" he said. \nHe added that interests of this criminal industry and the political pressures it forced should not define the country's social landscape.\nThe risks of legalising cannabis for leisure, harm reduction, and personal use, however strict and controlled, was way too risky.\n\"Legalising cannabis, in my opinion, is a declaration of failure in our social policy, social welfare agencies, NGOs and police force. Once legalised, it will be impossible to retract that position,\" he said. \nIn his statement, Prof. Azzopardi recommended: \n* the commissioning of a study to analyse the impact if such ‘harm-reduction’ legislation were to be enacted;\n* training the police in the field of addictions;\n* improving youth work training and an increase in detached youth work services;\n* increased collaboration between Caritas, Sedqa and Oasi; the three main agencies in the area of addictions in Malta; \n* a social policy is based on prevention;\n* incentives for the development of more leisure activities that would ensure young people would not get caught in a spiral of boredom;\n* emotional education to children and young people, helping them handle situations of pressure and disillusionment; and\n* increase professional services in the justice system.\nThe state should not be weakened and intimidated by the threat of this criminal industry, Prof. Azzopardi said.\n ", "comment_count": 60, "id": 3144}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A hunter facing the prospect of one year behind bars after shooting a kestrel that fell straight into a school playground had his effective jail term converted to a suspended sentence upon appeal.\nKirsten Mifsud, 28, had been jailed for one year, fined €5,000 and had his hunting licence permanently revoked after he was declared guilty following the incident which had taken place during a hunting spree in the area of tal-Fata in the limits of Żabbar, back in April 2015.\nAnother hunter, who had parted company with Mr Mifsud shortly before the incident, had testified that he had heard three shots coming from the direction of the accused while a kestrel flew overhead.\n“What have you done?” the witness had asked, upon joining his fellow hunter after spotting the protected bird falling out of sight. “I was blinded,” came the reply.\nAfter hearing a number of witnesses and upon the evidence put forward, the Magistrates’ Court had found the hunter guilty, observing that his actions had brought about the premature closure of the spring hunting season, thus “unjustly depriving” many law-abiding hunters of their pastime.\nThe injured kestrel had landed straight into the playground of St Edward’s College, shocking the school children who spotted the bloodied bird.\nThe accused had filed an appeal requesting a revocation of the judgment on grounds of a wrong appreciation of facts. He also argued that the punishment was excessive.\nThe Court of Criminal Appeal, presided over by Mr Justice Giovanni Grixti, observed that after “a detailed examination of the records” it emerged that the judgment was legally and reasonably valid.\nIt had been proven that a protected bird had been shot at, that the accused had aimed his rifle at the bird, had fired the weapon and had later told his friend that he had been “blinded,” the court observed.\nAs for the quantum of punishment, this fell within the parameters envisaged by the law, the court went on.\nHowever, an examination of the accused’s criminal record revealed that he had only one brush with the law, for which he had been conditionally discharged.\nGiven the consistent practice of granting an accused person a chance to reform, the court observed that in this case the next step would be to increase the dose by one stage, thereby revoking the effective jail term and converting it to a one-year jail term suspended for two years.\nThe €5,000 fine and permanent ban on the accused’s hunting licence were, however, confirmed. Lawyer Franco Debono was defence counsel.", "comment_count": 0, "id": 3145}, {"keywords": "", "author": "Jacob Borg, Ivan Martin", "article_body": "The Malta Financial Services Authority said on Friday said it would be steaming ahead with a reform that the International Monetary Fund warned against. \nA financial system stability assessment by the IMF, published earlier this week, warned against the planned centralisation of supervisory functions around the MFSA’s chief executive.  \nMFSA CEO Joe Cuschieri, who used to head the Malta Gaming Authority, was selected for the post directly by the Office of the Prime Minister in 2018 and no public call was issued.\nIn its report, the IMF said Malta’s financial regulator should maintain a dedicated committee tasked with supervisory and enforcement powers.\nAll supervisory powers currently vested in the MFSA’s supervisory council are planned to be transferred to the MFSA’s executive committee, chaired by the CEO and made up of five MFSA staff members reporting to Mr Cuschieri, the IMF report noted.MFSA should have full autonomy over its recruitment process\nRead: Joe Cushcieri's first interview as MFSA chief \nTo enhance checks and balances in the decision-making process, a dedicated statutory committee tasked with supervisory and enforcement powers should be maintained, ensuring that enough attention, time and resources are devoted to supervisory actions, the IMF said.\nThe IMF said the MFSA has the supervisory authority to carry out its tasks, but the necessary preconditions for operational independence are not all met.\nIn its Friday statement, the MFSA said it welcomed the IMF’s recommendations, including those made on the authority’s proposed new organisational structure. \nThe MFSA said it had conducted a broad consultation exercise with local and international stakeholders and other experts to ensure that the new MFSA organisational design would address current and future challenges, bringing it in line with those of its peers. \nAs part of this restructuring exercise, a new executive committee would be established taking on the responsibilities of the present Co-Ordination Committee, Supervisory Council and Board of Management and Resources. \nThe executive committee is earmarked to be responsible for all the corporate, operational and supervisory functions of the authority, the MFSA said.\n“The proposed organisational structure is a single component forming part of a broader transformation programme (as part of the MFSA’s Vision 2021) focusing primarily on clearer organisational objectives, enhanced corporate governance structures, capacity building, knowledge management and technological innovation amongst other key strategic initiatives,” the authority said. \nThe MFSA also said that a dedicated Enforcement Decisions Committee and a Regulatory Committee, both of which would be composed of independent experts in the respective fields, had been included in the revised operating model. \nThe MFSA’s new organisational structure, the authority said, would also include the establishment of a risk committee and a financial crime compliance (AML) committee with the objective of strengthening the areas of risk management and AML supervision. \n“The implementation of the MFSA’s organisational restructuring is work in progress and is currently undergoing the required legislative and parliamentary process,” the statement reads. \nFull details of the new MFSA organisational model, it said, would be published once the process was completed.", "comment_count": 5, "id": 3146}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A volunteer, who does missionary work in Africa, has been charged with defrauding a creditor by obtaining the waiver of a hypothec and withdrawing the funds for himself.\nIan Camilleri, a 50-year old from Sliema, who declared that his work involved “serving as a missionary in Africa,” was investigated by the economic crimes squad who suspected that he had used fraudulent means to gain an amount over €5,000.\nDuring Friday’s arraignment, prosecuting Inspector Rennie Stivala explained that the man had allegedly managed to obtain the waiver of a special hypothec on a property sold to a third party.\nHe had somehow faked the signature of the party in whose favour the hypothec had been registered, and had withdrawn and pocketed the funds.\nThe man pleaded not guilty to the fraud, having made a fraudulent gain and made a false declaration. He was also charged as a recidivist.\nA request for bail by defence counsel Gianluca Caruana Curran was not objected to by the prosecution, who pointed out that the man had been granted police bail and had kept his appointment with the police when summoned.\nThe only headache for the prosecution was the fact that the man was likely to travel abroad, hence posing a real risk of absconding.\n“The man has declared that he is a missionary and so wouldn’t be easily traceable in the African continent,” Inspector Stivala argued.\nThe request for bail was granted against a personal guarantee of €10,000, an order to sign the bail book twice a week and under strict orders to deposit his ID and passport in court.", "comment_count": 0, "id": 3147}, {"keywords": "", "author": "Denise Grech ", "article_body": "Authorities needed to ensure they were getting their money's worth for services, Parliamentary Secretary for disability Anthony Agius Decelis said.\nSpeaking during the launch of a public consultation on standard for day centres for people with disabilities, Mr Agius Decelis said the standards were needed to ensure clients were getting the best services they needed.\nWatch: Government Gazette direct order notice was 'a mistake', claims Decelis\nThe public consultation on standards for Day Centres was launched Friday, based on five principles including dignity, privacy and equality. \nThis is the third set of standards launched by the Parliamentary Secretariat. The first set of standards involved standards of care for respite services and the second involved the regulatory standards for those providing residential facilities.\nThe standards recommend service providers should implement a management strategy to ensure that services are continuously updated, and that staff is continuously trained.\nThe service provider should also draw up the personal support programme for each client with their direct input.\nMr Agius Decelis encouraged people to give their feedback, saying it was important for those in care and their relatives to provide input.\nThe Parliamentary Secretary is currently in the centre of controversy over a €274m contract to extend the St Vincent de Paul residential home for the elderly.\nThe contract, which was revealed by Times of Malta, is currently being investigated by the National Audit Office. \nRead the public consultation here. The consultation is open until March 31. ", "comment_count": 0, "id": 3148}, {"keywords": "", "author": "", "article_body": "A 64-year-old man was seriously hurt after he fell a metre or so down a garage shaft.\nThe police said that the man, from Żejtun, had to be rescued with the help of the Civil Protection Department, and that he was being treated at Mater Dei hospital.\nThe accident occurred at 9.30am in Triq id-Dulliegħ.", "comment_count": 0, "id": 3149}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Experts have welcomed changes in a new Child Protection Bill but raised concern that too much power has been left in the Family Minister’s hands.\n“It is paramount that people are not appointed based on their political affiliation but on competence. The selection process should be a transparent one based on specific competences and professional backgrounds,” director of Fondazzjoni Sebħ Andrew Azzopardi said when contacted.\nHe noted that the minister would be appointing almost every role according to the new draft launched in January.\nHe also raised concerns over mandatory reporting for professionals, with professionals facing criminal convictions if they fail to report any suspicion of risk. \n“By criminalising professionals I believe we are doing a disservice to children instead of safe-guarding them,” he said. \n“By making reporting mandatory for professionals, the law is potentially removing the support network around victims because whenever a person discloses abuse this will be automatically reported to authorities even without their consent.” \nThis was particularly concerning when the alleged victim was an adult disclosing abuse they had suffered as a child. \nOn the other hand, the fact that decisions to issue care orders will be taken by an independent judiciary and no longer by politicians was a move in the right direction. \nWatch: The reality of being a foster parent\nMr Azzopardi also commended the move to make adoption of those in care easier. \nParents should be given every opportunity to change their lives in order to meet their child’s needs, but when this was not within the child’s timescales, adoption should be the preferred option for young children.\nLaw potentially removing support network around victims\nThe Child Protection Bill was tabled in Parliament five years ago by then Family Minister Marie-Louise Coleiro Preca. The draft law was revised by her successor Michael Farrugia and a new Bill was approved in 2017.\nHowever, this law never came into force and the current ministry, headed by Michael Falzon, went back to the drawing board. \nA new draft of the Act was presented in January and this final version has been commended for finally allowing foster carers to adopt minors who have been under their custody for more than five years.\nFor foster parent and university lecturer Daniella Zerafa, the new law’s priority of achieving permanence for children in the least possible time set out the spirit of the law.\nThe law also encouraged the principle of shared responsibility by emphasising the importance of different entities coming together to protect children.\nAccording to international research, this was the only effective way through which children could be protected.\nThe health and education departments, the police authorities and the community needed to join forces with the official protection services to make sure that children who required protection found services that truly met their needs, Dr Zerafa said. \nDr Zerafa also expressed concern about the required change in mentality. Until now children have been considered as their parents’ property and this law challenged professionals to ensure children were at the centre of decisions. \nShe is also concerned that it was still the minister who appointed the board members related to child protection.\nThe concern was also flagged by the President’s Foundation for the Well-being of Society. When contacted, a spokesman noted that the involvement of the Family Minister had only been minimally reduced. The draft still failed to address autonomous and independent lines of decision making, which would preferably be taken by the courts, she said.\nThe foundation welcomed the introduction of the Children’s House – a place specifically for children’s court sittings – and the prospect of more stability for children in foster care placements.\nHowever, the foundation was concerned that the principle of child participation was not reflected in the law because children were always included at the invitation of someone, and not as of right.", "comment_count": 2, "id": 3150}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "A multi-millionaire has accused BNP Paribas with anti-semitism and criminal acts, opting to file the case in Malta, where he claims hundreds of millions of euro were compromised by the bank’s actions.\nBriton Jacob Agam - who resides in Malta, among other countries - and his  private equity investment company Vertical Group Holding are taking action not only against the bank – but also against its chairman Jean Lemierre, CEO Jean-Laurent Bonnafe’ and bank legal counsel Valerie Lafarge-Sarkozy.\nHe is claiming that their actions had affected his  and his company's reputation, resulting in \"huge material damages of as much as €1 billion in several financial and investment operations\" because of attacks on his financial standing. He also said that Vertical Group Holding had seen projects suspended, which would have generated \"several hundreds of millions of euros of profits\", which were destined for major investment opportunities in Malta and elsewhere.\nLawyer Pio Valletta, who filed the lawsuit on Friday on behalf of Mr Agam and his company Vertical Group Holding, said this was not a simple case of defamation and breach of banking fiduciary duties, but involved \"a pattern of anti-Semitic acts, actions, statements and criminal behaviours which stem from the respondent bank’s and its officers’ perennial and proven racial and anti-Semitic disposition\".\nThe clash between Mr Agam and the bank started in 2013, when he challenged the bank’s position after hearing about allegations that it was supporting terrorist organisations in Iran, which were actively trying to undermine his home state of Israel. Mr Agam, who served in the Israel military as a member of a special elite force to combat terrorist organisations, had said it would be impossible for his family to retain links with the bank in these circumstances.\nThe allegations were later proved: in 2014, BNP Paribas had pleaded guilty to criminal charges and paid $9 billion after it was found to have continued to do business with countries under American sanctions over a 10-year period.\nAs proof of its anti-Semitic stance, he also said that in 2016, it had made a $40 million settlement after a Jewish employee was fired after he complained about being forced to sit through a training film that depicted Hitler and other Nazi imagery in \"a positive manner\".\nIn June 2010, he was canvassed by the bank to become its client, with multimillion assets being placed in its Singapore branch, which he said was done in order for the bank to avoid taxes in France.\nMr Agam and two of his companies were given facilities amounting to €27.5 million, which were fully repaid, while the third company - Vertical - had €10 million in its account, without any facility.\nAfter the clash in 2013, the bank commenced what was described as a « series of illegal actions contrary to contractual and statutory regulations to terminate the banking relationship» with the Agams, which he said were intended to \"destroy his assets and his and his family’s good names\".\nIn a nutshell, the bank claimed that the facilities granted to one of his companies was in default and demanded full payment of €20 million within 10 days, without giving any justification for its decision. Mr Agam later found out that the action was taken after one of his properties was targetted by a French court, in a case which was subsequently dropped.\nMr Agam said that in February 2014, the CEO of the Singapore bank met him in Paris and Mr Agam agreed to terminate the banking relationship as long as the bank continued to honour its facilities to his sister. He repaid €20.2 million but the bank insisted on repayment of a further €6.2 million granted to another of his companies – which was not in arrears – with payment deferred till the end of 2014.\nHowever, the story did not end there and in 2015, the bank terminated the negotiations and commenced proceedings in Singapore and France to enforce the personal guarantees given by Jacob and Ruth Agam for her companies, escalating this to foreclosure proceedings against her properties in 2016.\nThe plight of the Agam family prompted four banks to come forward, offering help to settle the outstanding loans, but their approach was rebuffed by BNP Paribas.\nMr Agam claimed that Dr Lafarge-Sarkozy said in December 2015 that \"she was instructed to destroy the Agam family’s name, in particular Jacob’s, his reputation, business, companies and assets and to take everything that they possessed in France from cars, arts to the furniture, and that she will be happy to do so\".\nHe claims that at one point during legal proceedings, she referred to the siblings as “ces gens-la” (“these people”) – a phrase which the French Supreme Court had previously ruled as being anti-Semitic – and “parasites” lounging around in luxurious estates “living at the expense of the bank and part of an international financial world”.\nIn July 2017, Ruth Agam and her companies filed a claim in the Tel Aviv district court against the bank, alleging multiple violations inspired by anti-Semitic motives, while in Singapore, Jacob Agam tried a different tack, and challenged the validity of a merger between the bank and its private banking French subsidiary. In May 2016, the Supreme Court of Singapore – which he said was chaired by the former lawyer of the bank and the former legal partner of its current legal representative in Singapore – re-affirmed the legality of the merger but did not address the various commercial disputes between the Agams and the banks.\n\nThe case drew media attention, and one of the subsequent articles in the The Straits Times claimed he was “trying to wriggle out of his financial obligations” – which he claims was defamatory and did his reputation untold damage, prompting queries from other media as well as the banks and others persons and entities with whom he and his companies were conducting or were about to conduct investment transactions.\nThe chairman, CEO and legal counsel were brought into the case because of their \"failure to act\", which Mr Agam said was tacit approval of what the bank had done.\nThe company and Mr Agam reserved the right to bring forward a claim for damages.", "comment_count": 0, "id": 3151}, {"keywords": "", "author": "", "article_body": "A passenger was apprehended at the airport after he was found to be carrying €18,000 in cash which had not been declared.\nThe man, who was heading for Istanbul, was caught during routine operations at the MIA Departures lounge, by Customs officials from the Enforcement Unit.\nHis other luggage was off loaded from the aircraft and revealed more cash in different currencies.The total amounted to €18,366, of which €10,000 were returned to the passenger and the rest seized.The Police Anti-Money Laundering Section was informed and placed the passenger under arrest. The passenger will be arraigned in court later on Friday.\nThe Customs Department has stepped up enforcement and this find is one of a series over the past months.", "comment_count": 0, "id": 3152}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Taxpayers forked out €200,000 to a construction company so that the Education Ministry could buy 12 makeshift classrooms for St Paul’s Bay primary school.\nNew information released in Parliament shows that the mobile classrooms have been in place for the past three scholastic years and were bought without a tender from BAVA Holdings Ltd – a construction company which normally uses similar structures to serve as offices on construction sites.\nEducation Minister Evarist Bartolo, who justified the use of the classrooms as a temporary solution due to the sudden influx of the population at St Paul’s Bay, mostly migrants, said that in 2016 the government agency responsible for school building, the FTS, did not issue a tender but used a quotation system to procure these classrooms.\nNew school will be fully functional by September\nSince the cost was substantial, the approval of this procurement exercise needed the green-light from the Finance Ministry.\nA few weeks ago, the Times of Malta revealed new plans by the Education Ministry to install more mobile classrooms at St Paul’s Bay primary despite that a new school promised for the area should be fully functional by this September.\nAccording to a fresh call for tenders, issued by the Foundation for Tomorrow Schools, the government is now planning to install more mobile classrooms at St Paul’s Bay and to introduce them for the first time at Żejtun’s secondary school.\nDespite the invitation for tenders, the Education Ministry explained that it had no plans to put more mobile classrooms inside St Paul’s Bay primary as the new school, being built in Qawra, will be fully functional by September.\nThe new school is already two years behind schedule.\nAs for the mobile classrooms in Żejtun, the ministry said these will only be used for a short period until new facilities will be built at the secondary school.\nThe FTS had to build and complete a new storey with extra classes on top of the school’s existing building. However, even in this case, works are not moving according to plan.\nMr Bartolo described the mobile classrooms as “state-of-the-art” and “better than some current classrooms in government schools”.\nAccording to the FTS, the new tender was required to replace some of the current mobile classrooms at St Paul’s Bay primary.", "comment_count": 69, "id": 3153}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Updated 2pm with IMF excerpt\nDozens of companies involved in blockchain and cryptocurrency are opening up in Malta as a result of the government’s push to be a leader in this sector – but they are encountering resistance when they try to open bank accounts.\nSources from company service providers, legal firms and corporate finance companies contacted by the Times of Malta – who asked to remain anonymous to protect their clients’ confidentiality – confirmed that banks were politely declining their business, saying it was outside their “risk appetite”.\nThe sources said banks were not distinguishing between cryptocurrency and blockchain, even though the two were not always linked.\nParliamentary Secretary for Financial Services Silvio Schembri told the Times of Malta that he was aware that certain banks were willing to open accounts for blockchain operators but had less appetite for crypto operations.\n“One should make a clear distinction between blockchain operators and crypto operators,” he said.\nIn an effort to resolve the impasse, Mr Schembri said he was holding talks with different banks and other stakeholders “to have a better understanding of the industry”.\n“The general understanding is that when it comes to crypto operators, banks are waiting for operators to obtain an MFSA licence before opening their doors – which is understandable,” he said, adding that private initiatives proposing the foundation of innovative banks were also waiting for MFSA review and approval.\nThe MFSA has received 28 applications since the end of November for registration as VFA Agents under the Virtual Financial Assets Act – one as recently as this week – and that it was aiming to issue the first licences within the first quarter.\nTraditional European financial services legislation, such as MiFID, stipulates that an applicant for a licence is to be provided with a reply, on whether or not authorisation has been granted, within six months of the submission of a complete application.\n“As Malta’s first line of the defence, the MFSA’s assessment with regard to VFA Agent applications is thorough and includes inter alia a rigorous competence assessment as well as checks on the applicants’ proposed governance and business model,” an authority spokesman told the Times of Malta, saying the timeline depended on the outcome of the due diligence assessment process – including competence in the field of anti-money laundering and the counter funding of terrorism.\nThe authority also received a number of applications for registration of White Papers, saying that additional documentation was needed prior to initiation of the vetting process, which it was now facilitating.\nThe International Monetary Fund issued a report on Thursday - the Financial System Stability Assessment Report - which urged caution with regards to virtual-asset investments because of their high risk.\nThe report cautioned that monitoring the sector would require \"significant resources with appropriate expertise, such as cyber risk experts, technology experts and lawyers specialised in technology, creating additional challenges for financial authorities to build and retain expertise\".\nIt \"strongly encouraged\" the authorities to implement the laws and regulations gradually, imposing strict conditions, such as periodic renewal, to any licence. ", "comment_count": 30, "id": 3154}, {"keywords": "", "author": "Edwina Brincat, Herman Grech", "article_body": "Three men accused of killing Daphne Caruana Galizia were back in court on Friday morning, as the compilation of evidence against them resumed. A contested IT expert who was meant to testify was unable to make it to the sitting.\nMinute-by-minute:\n10.40am: Before the court room is vacated, prosecution and the defence discuss a different kind of problem - the boats being held under police custody are creating a storage issue.\nThey agree that the Maya is to be removed to another safe place that has approval of the court.\n10.38am: The next sitting is scheduled for March 7.\n10.35am: The court decides that at the next sitting, a Vodafone representative is to testify about the data-gathering process.\n10.30am: A Vodafone lawyer explains that the defence had requested processing of data from cell towers. This involved compiling massive storage of data, something which never been done before.\nInspector Arnaud says that that information had already been supplied by Vodafone.\n\"It’s like having footage of passing traffic, playing it and counting the number of cars driving by,\" Insp. Arnaud says.\nBoth sides are now arguing over the Vodafone data.\nThe Maya, owned by suspect George Degiorgio.\n10.22am: Defence lawyer asks Capt. Lanfranco to clarify his report which identified one of the accused as being present on the Maya, the boat from which the bomb is believed to have been detonated. \n\"In the footage we could not quite identify the person,\" witness says, adding \"it could have been him, that’s why I put that part in brackets\".\n10.18am: Inspector Keith Arnaud informs the court room that contested witness Martin Bajada cannot attend today's sitting. Capt. Reuben Lanfranco from the AFM takes to the witness stand. \n10.15am: Forty-five minutes later, the accused are brought into the court room. Their handcuffs are removed, amid tight security.\n9.50am: The sitting was scheduled to start at 9.30 am but the magistrate is hearing another case dealing with the illicit cigarette trade. \n9.33am: The family of the slain journalist, the prosecution and lawyers enter the courtroom. But the accused are nowhere to be seen. \n9.30am: Friday morning's session has already been hotly contested before it started. A judge on Thursday rejected yet another attempt to stop court-appointed IT expert Martin Bajada from testifying in the ongoing compilation of evidence against the three men. Alfred Degiorgio, one of the accused, filed a constitutional application two days ago claiming that his right to a fair hearing would be breached if the expert was allowed to testify.\nThe controversy stems from a 1993 case where Dr Bajada was convicted of theft and fraud by the UK courts.\nHowever, his position as expert was green lighted by a decision of the superior courts in 2017.\n9.15am: In the last sitting two weeks ago, the almost three-hour session featured some ill-tempered exchanges between lawyers and the bench, with defence lawyer William Cuschieri in particular getting into some heated conversations at times.\nRead: Lawyers argue as Daphne murder suspects return to court\nA suspect exits the courts in Valletta on December 6, 2017, after being charged with the murder of Daphne Caruana Galizia.\nBackground: \nDegiorgio brothers Alfred and George and Vince Muscat face charges of having planted and detonated the bomb which killed the journalist in October 2017.\nCourt experts have testified about a boat spotted entering and exiting the Grand Harbour on the day of the murder, which investigators say is Alfred Degiorgio’s Maya.\nPolice witnesses also testified about items they had confiscated from a Żebbuġ site on the day police had arrested the three suspects.\nThe three suspects have filed separate proceedings against authorities, saying their arrest and searches of their homes had breached their fundamental rights.\nThe key players:\nMagistrate Claire Stafrace Zammit is presiding.\nLawyer Martin Fenech is appearing for Vince Muscat, known as il-Koħħu, 55.\nLawyers William Cuschieri and Martha Muscat are representing Alfred Degiorgio, known as il-Fulu, 53.\nLawyer Josette Sultana is appearing for Alfred's brother George Degiorgio, known as iċ-Ċiniz, 55.\nPhilip Galea Farrugia from the Attorney General's office and inspectors Keith Arnaud and Kurt Zahra are prosecuting.\nLawyers Jason Azzopardi and Eve Borg Costanzi are appearing parte civile.", "comment_count": 0, "id": 3155}, {"keywords": "", "author": "", "article_body": "The driver of a car that overturned in Żebbuġ on Thursday night was only slightly injured, but the passenger travelling with her was badly hurt, police said.\nThe accident occurred at 10pm an Triq l-Imdina. \nPolice said that the driver, a 26-year-old woman from Siġġiewi, lost control of the car, hit the pavement and overturned.\nThe passenger was a 28-year-old man, also from Siġġiewi.", "comment_count": 0, "id": 3156}, {"keywords": "", "author": "Claire Caruana", "article_body": "Foreigners living in Malta are the most likely to end up living in overcrowded households, it has emerged, with 13 per cent of non-EU residents confined in crowded homes.\nAccording to figures issued by the EU statistics office, Eurostat, data for 2017 showed that a total of 12.8 per cent of adults from non-EU countries as well as so-called “foreign countries” living in Malta resided in households that were overcrowded.\nThe figure is significantly higher than the rates for those who are Maltese and foreigners coming from countries within the EU. According to the latest data, which analysed the situation in 2017, 2.2 per cent of Maltese residents lived in crowded homes, while the figure dropped even further to 0.6 per cent for foreigners from EU countries.\nThe data also shows that the problem is far worse for women than it is for men. While 9.1 per cent of men were found to have been living in homes that were too crowded, the figure shoots up to 15.5 per cent for female foreigners.\nFor the statistics office, a person is considered as living in an overcrowded household if this does not have at its disposal a minimum number of rooms for the number of people living there.\nThese includes at least one room per couple or one room per single person aged 18 and over, one room per pair of single people of the same gender between 12 and 17 years and one room per pair of children under 12.\nReports of housing worries have made headlines in recent months as more people report struggling with affording rising rents.\nA recent Eurobarometer survey revealed that Maltese people were becoming increasingly concerned about housing issues. More than a quarter of respondents in that study expressed such a concern, with worries increasing significantly in a matter of months. According to the survey, Malta’s house prices increased at a rate that was faster than the housing market in Hong Kong.\nHousing problems have also been highlighted by prominent figures, including Archbishop Charles Scicluna, who has called the issue a “social emergency”. NGOs have warned high rent prices were resulting in more people living in appalling conditions or, worse, ending up homeless.", "comment_count": 94, "id": 3157}, {"keywords": "", "author": "Denise Grech ", "article_body": "Reports of drug use reached 348 in one year, the highest figure ever reported in 14 years, an annual crime report revealed.\nThe report, published last week, revealed that drug reporting increased by 12 per cent in 2018 to 348 reports.\nDrug reports can include possession or trafficking of the illicit substances. They must have been received by authorities from third parties for them to be included in the data.\nDrug expert Godwin Sammut has long warned there has been an increase in different types of drugs entering the country. The chemist, who has been testing drugs seized by national authorities for over a decade, insisted market trends have shifted towards synthetic drugs.\nDrugs were now ordered online and could arrive by post\nThe number of drugs entering the country has been on a steady upward trend for the past three or four years, he warned. Drugs were now ordered online and could arrive by post, leading to “more types of drugs which can be reported and seized”, Mr Sammut said.\nAuthorities had also previously sounded warnings they were finding it difficult to prosecute people making use of new synthetic drugs, which had yet to be regulated by law.\nRead: ‘Boom’ in cocaine use in Malta\nEarlier this week, Parliament approved a law equating psycho-active substances with drugs. Because of this law, the definition of “drugs” will be widened enough to include new drugs that have so far not been regulated, a government statement said.\nThe annual crime report shed light on the changing face of crime in the country. Law infractions were moving from the public sphere to the online domain, criminologist Saviour Formosa warned.\nAn increase in population, coupled with an influx of tourists, meant crime was now more diversified, Prof. Formosa said. \nCases of fraud increased by 30 per cent over the previous year, as new forms of digital crime emerged, he added. Fraud reports shot up to 1,032 in 2018, from 787 in 2017, he added. \nThe main increase was registered as fraudulent gains, making fraud the fourth most reported crime in the country.\nThreats and public violence increased to 322 in 2018, mainly through stalking, blackmail and causing fear of violence.  Reports of harassment experienced a reduction in reporting, the figures showed.\nSexual offences increased by 18 per cent (120 cases) in 2018, reversing the decreasing trend since 2015.  Cottonera, Floriana, Għaxaq and Pembroke have two to five times the national rate of domestic violence reports, the report showed. ", "comment_count": 16, "id": 3158}, {"keywords": "", "author": "", "article_body": "These are the stories which made it to the front pages of Friday's newspapers:\nThe report by the International Monetary Fund on financial supervision, regulation and monitoring dominated the front page of the Times of Malta. The newspaper also reported on drug use, saying it had reached the highest levels in 14 years.\nL-Orizzont reported on the need for teachers to be covered by insurance in case of occupational injuries. It also reports the Commissioner for Children warning about online content which is allegedly encouraging children to commit suicide.\nIn-Nazzjon dedicated its front page to the Nationalist Party general council held over the past days with the secretary general praising the high level of interaction with youths, as well as Opposition leader Adrian Delia saying at the annual general meeting of the developers' association that a national strategy was required.\nThe Malta Independent features a report on the db Group's green light for its St George's Bay project, which now hangs on a traffic assessment by Transport Malta. It also reports on judicial appointments and that the Chamber of Advocates has been left in the dark about them.", "comment_count": 0, "id": 3159}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Malta Developers Association president Sandro Chetcuti said on Thursday that the country had “failed at planning” and warned colleagues that the public’s frustration at the construction industry was borne out of this failure.\nAddressing the lobby’s annual general meeting, Mr Chetcuti said: “We need to incentivise people to ensure better forward planning. We cannot afford to have all of Malta become Bugibba and Qawra.”\nHighlighting the industry’s strength and growth, Mr Chetcuti said that while the last few years had seen the sector move from a recession to an unprecedented boom, growth needed to be sustained or the industry would slip backwards.\nHe said Maltese developers were ready to compete with anyone but needed to be guaranteed a level playing field. They could not afford to be bogged down in bureaucracy while foreign investors received the red-carpet treatment.\nMr Chetcuti also stressed ongoing frustrations over the “total collapse” of the cultural heritage monitoring system, where developers were enduring long delays because of understaffing at the heritage watchdog.\n“You cannot have this amount of construction and still require monitoring to build a washroom on the roof,” he said.\nWe have to be flexible and realistic. Authorities need to operate efficiently if we want the economy to keep growing- Chetcuti\n“We have to be flexible and realistic. Authorities need to operate efficiently if we want the economy to keep growing.”\nPrime Minister Joseph Muscat told the meeting that while the issue of planning was a crucial one, he could not agree with an approach to planning that attempted to predict the needs of the country 25 years from now - as had been suggested just moments earlier by Opposition leader Adrian Delia – but rather one flexible enough to respond to an ever-changing scenario.\n“Our government is not afraid of masterplans to guide development, but that means we must be ready to take hard decisions on what developers can and cannot do, and that some may have to concede,” he said.\nThis, he added, extended to controversial national issues such as land reclamation, which he said was inevitable given the industry’s growth and the drive towards new infrastructure like the Gozo tunnel or an eventual underground mass transit system.\nAddressing bureaucratic delays, Dr Muscat said his preference was for minimal government involvement in the industry – with authorities relying on professionals’ judgement – but that for that to happen, everyone involved needed to shoulder responsibility.\n“If we want to have a system of trust, we cannot have operators pushing the rules or chancing it,” he said.\nLand reclamation not for speculation\nMeanwhile, Opposition leader Adrian Delia praised the MDA for its insistence that land reclamation should not be used for speculation. He said that public land needed to be administered in a way that would not create a competitive advantage for anyone.\nCalling for a long-term development plan, he stressed the need for all stakeholders to work together to ensure adequate housing provision, and to work towards a system where the environment and green initiatives could serve as a motor for development.", "comment_count": 93, "id": 3160}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A judge on Thursday rejected another attempt to stop court-appointed IT expert Martin Bajada from testifying in the ongoing compilation of evidence against three men accused of the murder of Daphne Caruana Galizia.\nAlfred Degiorgio, one of the accused, filed a constitutional application two days ago claiming that his right to a fair hearing would be breached if the expert was allowed to testify.\nBut Mr Justice Toni Abela, presiding over the First Hall, Civil Court in its constitutional jurisdiction, declared that Mr Degiorgio’s rights would not be irremediably prejudiced by Dr Bajada’s testimony. He pointed out that proceedings before the Constitutional Court were still pending and would thus still offer a remedy.\nAssistant Attorney General Dr Philip Galea Farrugia had argued that a long line of case law supported the view that Dr Bajada’s testimony should not be suspended.\nThe controversy stems from a 1993 case where Dr Bajada was convicted of theft and fraud by the UK courts.\nHowever, his position as expert was green lighted by a decision of the superior courts in 2017. The court of appeal had drawn a distinction between situations where the expert was appointed to carry out work that had subjective elements and ones where experts were simply there to confirm objective facts, like call profiles. In the latter case, there was no basis for Dr Bajada to be replaced.\nFollowing the Caruana Galizia assassination, Dr Bajada had been appointed to investigate communications and IT data linked to the crime.\nLast January Mr Justice Silvio Meli dismissed a similar application by Mr Degiorgio. He quoted extensively from case law to explain that the circumstances did not pose any danger to Mr Degiorgio’s human rights and Mr Bajada should stay on the case.\nEarlier this month a magistrate also decided to allow Mr Bajada to testify in the compilation of evidence, pointing out that the court’s function in compilation proceedings “is strictly to gather evidence and it is in no way to determine guilt or mete out punishment.”\nThe compilation of evidence against Mr Degiorgio and the two other co-accused, his brother George Degiorgio and Vince Muscat, is due to continue on Friday.\nFollow Friday's court proceedings live on timesofmalta.com", "comment_count": 2, "id": 3161}, {"keywords": "", "author": "", "article_body": "Jeanette Burke, a 41-year-old woman who was missing since February 15 has been found safe and sound, the police said.\nThey gave no details but thanked the public for its cooperation.", "comment_count": 1, "id": 3162}, {"keywords": "", "author": "", "article_body": "A grade one scheduled building which hit the headlines recently because of fears it will be ‘buried’ by modern multi-storey buildings around it, now faces a more imminent danger.\nThe weekend’s storm partly uprooted a massive five-storey tree on a public road, leaving it delicately balanced on the partly demolished boundary wall of the 500-year-old Villa Barbaro in Tarxien, posing a danger not just to the property, but to the people who live there or use the street.\n“This is an extremely serious emergency situation and whilst our lives literally hang in the balance, the three different entities concerned (the ELC consortium, the Civil Protection, and Tarxien Local Council) were until not long ago squabbling amongst themselves as to whose job it was to remove the danger,” the owner of the property, Marquis Cremona-Barbaro said.\nHe explained that the strong wind on Sunday had dislodged the tree and it was literally only being held up by one half of the garden wall, the other half having already collapsed under the weight.\nHe had immediately alerted the Civil Protection Department to the danger, but given the damage across the island, they did not have the resources to tackle it. He also spoke to the police and the local council.\nIt was only five days after the storm that the council sent a tree pruning contractor to inspect the damage. He promised to carry out the work on Friday or Saturday, Marquis Cremona-Barbaro said.\nBut he has since been told that the work cannot be carried out before Wednesday – despite warnings of more strong winds this weekend. The reason given was the need for wardens and a crane.\nMarquis Cremona-Barbaro said the road should have been closed immediately, because of the danger to life and limb, and it was a disgrace that several days on, nothing had been done yet.\n“We are terrified that in the strong winds the tree will come crashing down, flattening this historic building and very possibly killing us. We have been advised for our own safety to move to the wing at the other extreme end of the house,” he said.\nThe advice has been heeded.", "comment_count": 19, "id": 3163}, {"keywords": "", "author": "Denise Grech ", "article_body": "The “relatively good” response to last weekend’s storm was proof the systems put in place in such cases worked, Prime Minister Joseph Muscat said on Thursday.\nThe prime minister was speaking at Auberge de Castille as he thanked personnel from the police, civil protection department and the Armed Forces of Malta for their work throughout the weekend.\nThe “worst storm since 1982” lashed across the country over the weekend,  demolishing some walls, uprooting trees and damaging installations and houses along Malta's east coast.\nWind gusts reached a record 72 knots or 133km/h.\n“We wanted to give a face to the people who helped the country during the past week,” Dr Muscat said.\nThe Malta Industrial Parks, Enemalta, the Water Services Corporation, the Arts Council, Ambjent Malta, Infrastructure Malta all helped in a “team effort” this weekend, he added.\n\n“While we are still quantifying the damage, we want to help those who cannot be insured, such as farmers or fishermen,“ Dr Muscat said.\nHowever, he insisted the government could only intervene in cases where people could not be privately insured.\nHe confirmed that the government would seek assistance from the European Solidarity Fund.Malta had tapped into the fund in 2004, when it received over €960,000 to help deal with floods in September 2003.At the time, the total direct damage was estimated to be at €30.17 million, of which the Solidarity Fund contributed to compensate costs linked to emergency operations.The European Commission had assisted with the cost of emergency measures such as rescue services, providing for temporary accommodation, energy and water and repairs to the basic infrastructure.", "comment_count": 11, "id": 3164}, {"keywords": "", "author": "Claire Caruana", "article_body": "The Malta Union of Teachers has formally asked for insurance cover for teachers while at school, following a series of high-profile incidents.   \nIn a brief statement on Thursday afternoon, the MUT said that over the years it had often proposed similar schemes for its members but the government had always dismissed them, saying it did not provide insurance for its workforce.  \n\"In view of recent developments, the MUT has written to the Minister for Education and Employment and has formally requested that educators are provided with insurance during their duties,\" the teachers' union said in its statement, adding that more information will be provided. \nOn Monday, Home Affairs Minister Michael Farrugia announced in a press conference that members of the disciplined forces would be eligible for compensation of up to €180,000 in case of death or injury while on duty, under a new occupational accident insurance scheme. \nAccording to Finance Minister Edward Scicluna, the claims that will be filed under the scheme will be handled by a specialised force. \nTeachers’ concerns about their safety again made headlines in recent weeks after two men were arraigned in connection with an incident at the Pembroke secondary school after a young student had to be hospitalised following an alleged assault by another student.\nRead: Boy in hospital with head injuries after attack at Pembroke secondary school\nA day later, a student and a school official were involved in a fight at St Ignatius College secondary school in Qormi. \nAccording to the union, there were also a number of cases that were reported to the police as well as others which were dismissed by the schools before these even reached the authorities.\nEarlier this month, the Times of Malta had asked whether the union was considering requesting “danger money”, additional pay for those working in dangerous situations, MUT president Marco Bonnici said priority should be on ensuring security and safety of schools that would benefit both educators and students and prevent cases and situations “which no amount of money can justify”.\n ", "comment_count": 50, "id": 3165}, {"keywords": "", "author": "", "article_body": "An Għaxaq man has been handed a six-month suspended jail term after having falsely claimed in 2016 that he was assaulted by the police.\nThe man had claimed he was beaten by three officers in his home town.\nPolice investigations showed the claims to be false and the 38-year-old was then taken to court and accused of making accusations which he knew to be false.\nPolice inspector Justin Camilleri prosecuted.", "comment_count": 0, "id": 3166}, {"keywords": "", "author": "", "article_body": "Three activists from the NGO rescue ship Sea Watch on Thursday were ordered to pay €6,000 in damages to Transport Malta after having been caught red-handed spray-painting slogans on the Kappara bridge.\nDaniel Tamino Bohm, 27, a student, Jelka Elena Kretzschmar, 35, a German graphic designer, and Marco Muller, a 26-year-old design engineer from Switzerland were accused of damaging public property.\nThey were arrested after police had been alerted that persons were spray painting graffiti on the concrete pillars of the bridge, with slogans stating 'Open the Ports' and 'Free the Ships'.\nAll three pleaded guilty, with Mr Muller clarifying that he had been an accomplice.\nThe Sea Watch vessel was blocked in harbour for most of the summer, with the authorities arguing it did not have proper documentation. It was later allowed to leave. Another NGO rescue ship, the Lifeline, was similarly blocked. Similar actions were taken in other countries. \nMagistrate Josette Demicoli warned the accused that they could have faced a maximum four-year jail term which could be increased to five years since the property in question was public.\nDefence lawyer Malcolm Mifsud told the court that the accused were willing to fork out €6,445 in damages to Transport Malta once their bank cards were returned by the police.\nThe lawyer further pointed out that his clients had filed an early guilty plea, had cooperated fully and had also apologised for their wrongdoing, besides offering to pay damages.\n“They are Sea Watch activists,” explained the lawyer. “The court is aware of the controversy on the immigration issue. They wanted to press a point but did not do so in the correct format. They are not even contesting the amount by saying its inflated. It’s a sacrifice for them,” he said.\n“I don’t want this to be used later in an arm-twisting exercise between the authorities and Sea Watch,” Dr Mifsud said when arguing that the case did not merit a suspended sentence.\nIn the light of all this, the court, declared all three guilty upon their own admission and conditionally discharged them for three years, ordering them to settle their dues with the transport authority within 3 days.\nLawyers Malcolm Mifsud and Gianluca Cappitta were defence counsel.", "comment_count": 0, "id": 3167}, {"keywords": "", "author": "", "article_body": "The IT system at the law courts in Valletta is being revamped at a cost of €450,000. Works which started two years ago are set to be completed by June this year.\nDuring an onsite visit, Justice Minister Owen Bonnici said this project was part of government’s efforts to improve efficiency of the judicial system.\nHe remarked that 122 kilometres of cables will be installed, to link 2,500 network points.", "comment_count": 3, "id": 3168}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The Malta Gay Rights Movement has been awarded €4,000 in two separate libel cases over allegations that the organisation was being financially supported by an international promoter of abortion.\nThe dual lawsuits, filed against Alliance for Change president Ivan Grech Mintoff and the Gift of Life Foundation, stemmed from comments posted on social media alleging that the MGRM was being funded by the American Planned Parenthood, the largest single provider of reproductive health services, including abortion, in the US.\nIn October 2015, MGRM had penned a letter published on The Malta Independent on Sunday referring to comments made public earlier by Mr Grech Mintoff who, in turn, had posted further remarks on Facebook and YouTube stating that Gaby Calleja [representative of MGRM] “ADMITS to taking money from MURDERED CHILDREN to fund her own personal agenda\".\nIn the course of the proceedings, the court observed that the American Planned Parenthood was one of 141 members of the International Planned Parenthood Federation which had rendered “330,000 abortion-related services” in 2011.\nThe MGRM had signed an Advocacy Flexi Fund Funding Agreement with the International Federation in 2010, thereby obtaining $10,000 by way of a donation from the ‘David and Lucille Packard Foundation’ to be used “for the project titled A Gender Identity Law for Malta.”\nMGRM was not “to use the funds for any other purpose unless written permission has been received from the IPPF.”\nThe court, presided over by magistrate Francesco Depasquale, observed that the evidence clearly showed that the funds obtained by MGRM had not been generated through the killing of babies.\nNor had they been intended for the promotion of abortion in Malta, a topic which, though likely to generate debate and contrasting views, did not justify conclusions based on “very remote circumstances and certainly not substantially correct”, the court said.\nThe comments made by Mr Grech Mintoff were “incorrect” and “very disloyal towards his followers” by failing to inform them that the IPPF’s vision was to militate against gender-based discrimination- a right also safeguarded under the Maltese constitution and the EU Convention.\nWhile everyone had a right to a personal opinion, everyone and particularly a political figure like Mr Grech Mintoff owed “loyalty towards truth and honesty”, an obligation in which the respondents had failed “by twisting facts to cast a shadow” upon the MGRM, the court declared.\nIn view of the gravity of the allegations which bore criminal implications, namely the killing of babies, the court found the comments defamatory and ordered Mr Grech Mintoff to pay €3,000 in libel damages.\nIn a parallel case, the Gift of Life Foundation was ordered to pay €1,000 in libel damages over a Facebook post starting off with “ BREAKING NEWS! ARE THE MALTA GAY RIGHTS MOVEMENT BEING SUPPORTED BY INTERNATIONAL ABORTION PROMOTERS - PLANNED PARENTHOOD?”\nThe pro-life group had alleged that MGRM was in favour of abortion, a claim denied by Ms Calleja, as representative of the movement, who said that no stand had yet been taken on this issue.\nLawyers Cedric Mifsud and Gianluca Cappitta were counsel to the applicant.", "comment_count": 0, "id": 3169}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Updated with campaigners' statement\nAfter three months of hearings, the planning appeals tribunal on Thursday gave the go ahead for the db Group’s controversial St George’s Bay mega-development, but Transport Malta has to confirm within 30 days that the existing road network can cater for the additional traffic.\nThe developers had been relying on the construction of a tunnel, details of which remained unclear, to cope with the traffic the project would generate. \n\"Transport Malta officials testified during the appeals process that the existing road network could not cope, and therefore it remains to be seen how the developers intend to resolve this,\" lawyer Claire Bonello, representing the objectors, said after the hearing. \nThe developer was also instructed to create an additional 270 square metres of public open space, which cannot be roofed over as previously planned.\nThe tribunal ordered the height of the tower to be reduced by 10 metres, and that of the hotel by eight metres. The entire facade of the scheduled Institute of Tourism Studies (ITS) building must be retained in the new design. \nHowever, the tribunal denied outright claims by objectors that the decision had been vitiated by conflicts of interest concerning two board members. Objectors said they would be asking the courts for a judicial review in the coming days. \nThe €300 million City Centre project, which includes a 37-storey tower and 17-storey hotel, was approved by the Planning Authority in September despite an unprecedented 4,500 objections from the public, local councils and NGOs.\nAn appeal against the decision was filed in November by 17 entities, including Pembroke, Swieqi and St Julian’s local councils and several environmental groups, following a crowdfunding drive which raised more than €24,000 to cover the costs of the appeal.\nThe Environment and Planning Review Tribunal (EPRT) announced its decision on Thursday, with the developers told to submit new plans including an increase in open space and a small height reduction on tower and hotel buildings.\nThe appeal was filed by three councils and several NGOs.\nProtests over conflicts of interest\nIn their appeal, objectors alleged that two PA board members – Matthew Pace and Labour MP Clayton Bartolo – had undeclared conflicts of interest and should have recused themselves from the vote.\nMr Pace is a co-owner in the Swieqi branch of property agents Remax, one of several agencies which marketed the project, while Mr Bartolo’s father and uncle are shareholders in a company operating out of the Tunnynet complex, owned by db Group chief Silvio Debono.\nThe tribunal found that there was no conflict of interest but the objectors are not happy with this and have said that they would refer the issue for judicial review.\nThe appeal also referred to the controversial decision to fly board member Jacqueline Gili on a private jet to participate in the vote, at a cost of €8,750. Ms Gili voted in favour of the development.\nThe Ombudsman’s office concluded after an investigation that the move could have constituted “unwarranted influence” and that board members should not accept any insistence to attend or not attend a particular hearing.\nAppellants reiterated concerns over a proposed tunnel accepted as a solution to traffic issues raised by the development, despite there being as yet no concrete plans for the tunnel’s construction.\nThey also highlighted potential breaches of the Floor Area Ratio Policy which governs high-rise development.\nApart from the three local councils, the appellants includes Friends of the Earth, Din l-Art Ħelwa, Flimkien għal Ambjent Aħjar, BirdLife, Moviment Graffitti, the Ramblers Association, Nature Trust and Żminijietna – Voice of the Left.\nCampaigners to file legal suit against project\nCampaigners who actively oppose the project said the outcome contained a “significant win” and said that they would now take their fight to the law courts. “While we express our disappointment with the Tribunal’s decision to uphold the permit given by PA, we positively note that this permit will, for now, remain suspended, meaning that works cannot start,” they said. “We remain against this project in its entirety, and Local Councils, NGOs and residents will undertake further legal action aimed at annulling the PA’s decision to grant this permit. In the coming days, several residents, NGOs and three Local Councils will start an alternative action in court.”", "comment_count": 70, "id": 3170}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Maximilian Ciantar, whose bid to rob a Dingli couple three years ago had been thwarted by the arrival of the police, has had his jail term confirmed on appeal, after the judge took into account a ruling by the European Court of Human Rights on statements made by the accused.\nMr Ciantar, who had been jailed for two years for running over 10-year old twin girls at Attard in 2011, was one of two robbers who had broken into the Dingli farmhouse on Easter Sunday early morning, in an attempt to steal cash from the farmer and his wife while they were milking their cows.\nMr Ciantar, then 26, together with 19-year-old Darryl Anthony Anderson had donned a dark head scarf and a crash helmet respectively before taking the couple by surprise. Mr Ciantar had also been armed with a knife.\nAs the farmer ran off, one of the thieves had given chase while the one wearing the helmet had punched the woman, ordering her to hand over money. The woman had later told the police that her husband had been carrying some €1,000 in cash when he fled the scene.\nLuckily, the robbers’ plans were thwarted by the arrival of the police.\nThe couple had later identified their aggressors at the police station and had also confirmed their identity in court.\nThe proceedings before the Magistrates Court ultimately resulted in a conviction in November 2017 and a 9-month jail term for Mr Ciantar who filed an appeal.\nThe appellant’s lawyer contested the conviction, stating that this had relied mainly on the victims’ identification of the suspect which, in turn, had been unduly ‘contaminated’ by the officers’ influence at the police station.\nHowever, the court observed that although such identification was always to be analysed with great caution, in this case the couple’s version had been ‘a precise one.’\nThe evidence showed that the sole reason for Mr Ciantar’s presence at the farmhouse was to commit the theft. Even though he had claimed that he had accompanied his friend without knowing what was in store, once there, he had gone along with the plan, his actions amounting to preparatory acts to the perpetration of the crime.\nLater, in his statement, Mr Ciantar had described the whole episode as a ‘stupidity’ and an ‘adventure’ which he would never repeat.\nThe probatory value of that statement which had not been released in the presence of a lawyer, was questioned by the appellant.\nHowever, the court of criminal appeal, presided over by Madam Justice Edwina Grima, in a marked departure from recent case law on this subject, declared that the issue needed to be analysed with greater caution in the light of a recent pronouncement by the ECHR which had marked a shift in former judicial criteria.\nIn the case Philippe Beuze vs Belgium, the Grand Chamber of the ECHR in November 2018 declared that in criminal proceedings, a statement by the accused when not assisted by a lawyer, was not to be automatically discarded as evidence, but its admissibility was to be first subjected to a twofold test.\nThe court was to see whether there existed compelling reasons for the right to a lawyer to be withheld and also to assess the overall fairness of the proceedings.\nIn this case, Mr Ciantar had consulted his trusted lawyer, Joseph Brincat, before the interrogation and had been well-assisted all throughout the court proceedings, Madam Justice Grima observed.\nMoreover, at the time of the attempted robbery, Mr Ciantar had been a 26-year old with 11 past convictions on his record and hence certainly did not qualify as a “vulnerable person”, the court continued, further noting that both the accused and his lawyer had been informed of the charges he was facing.\nThe suspect’s statement had only served to corroborate the version of the couple who had been the main witnesses and who had identified Mr Ciantar as one of their aggressors.\nFinally, the court observed that the current right to legal assistance during interrogation did not actually translate into “much effective assistance,” since the lawyer could only intervene in exceptional circumstances, a proviso which did not figure under the relative EU Directive.\nIn the light of all this, the court declared that the accused’s statement together with the victims’ testimony served to confirm his guilt, thus rejecting the appeal and confirming punishment.", "comment_count": 0, "id": 3171}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The Planning Authority will on Thursday decide on an application for an eight-storey hotel in Mellieħa, which is recommended to be refused for breaching the height limitation policy.\nSpread over a vacant 3,600 square metre plot close to the Valyou supermarket, the proposal – submitted by Gozitan development company J Portelli Projects – includes 120 residential units, shops, a hotel, underground parking and garages.\nThe Mellieħa local council, which had once hoped to acquire the previously government-owned land to build a new community centre, has objected to the development, describing it as “intensive and incompatible” with its surroundings.\nThe council also argues that planning policy does not allow for new hotels in designated residential areas, and has called for the hotel component and its restaurant, spa, gym and indoor pool facilities to be dropped from the plans.\nDespite recommending the plans for refusal, the PA case officer did not back up the council’s arguments, concluding that the project was acceptable in principle from a planning point of view.\nIntensive and incompatible with its surroundings\nThe Design Advisory Committee and Environment and Resources Authority also raised no objections, with the latter concluding that the project was unlikely to have significant environmental or traffic impacts.\nHowever, the case officer concluded that the eight storeys proposed fell foul of the height limitation policy. Buildings in the area are allowed three floors, while hotels are allowed two floors over and above that due to a specific height limitation adjustment policy.\nThe project architect was advised to redesign the project to address these issues, including eliminating the eighth floor of the hotel section and apartments on the fifth and sixth floors, and redesigning other parts of the development to include receded floors.\nHowever, the architect maintained that the project was in line with policy, and declined to put forward the requested changes, leading the case officer to recommend refusal.\nThursday's expected decision comes after a controversial proposal to add three storeys to another Mellieħa hotel was suspended at the applicant’s request after indications that it too would breach the height limitation policy.\nThe Panorama Hotel, situated on a ridge close to the Mellieħa parish church, was seeking to raise its height to eight storeys, drawing objections from the local council, heritage watchdog and neighbours.", "comment_count": 10, "id": 3172}, {"keywords": "", "author": "Keith Micallef", "article_body": "Work carried out with no development permit by state agency Infrastructure Malta, to widen the road leading to Ramla Bay Hotel, has left farmers fuming in the wake of damage caused to their property.\nAction on the matter was only taken after the issue was raised in Parliament by Labour MP Clayton Bartolo in a parliamentary question to Transport Minister Ian Borg. \nIn his reply Dr Borg noted that the agency had spoken both to the contractors entrusted with this project and the affected farmers, and was taking all steps to resolve the matter as soon as possible.\nHowever, when contacted, Mr Bartolo pointed out that action was only taken following his parliamentary question, adding that rubble walls and gates had been destroyed.\nLast December the Times of Malta reported that Triq ir-Ramla had been widened by encroaching on virgin land but no permit had been sought, even though planning laws clearly lay down such a procedure is must in such cases.\nThis project had come to light through another parliamentary question from which it transpired that a tract of garigue land had been expropriated to widen the country road. At the time, no details were given on how much was paid to acquire the land, with the Transport Minister saying expropriation talks with the Lands Authority were still under way.\nAs for the reason behind widening the road, the minister said that it had become too narrow for safe access to the hotel, especially in emergency situations.\nAt the time, Infrastructure Malta said that dilapidated rubble walls were reconstructed in a recessed position, to improve the road’s alignment. No mention had been made to damage to third party properties.", "comment_count": 13, "id": 3173}, {"keywords": "", "author": "Jacob Borg", "article_body": "Malta-based gaming companies accused of operating illegally in Norway acted within a full legal framework, by virtue of the single market freedoms, an industry body has insisted. \nNorway’s gaming authority ordered Norwegian banks to ban transactions to and from six Malta-based gaming firms, which it accuses of operating illegally in its territory. \nEnrico Bradamante, the chairman of iGEN, an association of the leading iGaming companies in Malta, told the Times of Malta that MGA-licensed companies with operations headquartered in Malta operated in European Economic Area countries like Norway within an EU legal framework. \nMr Bradamante said the industry welcomed a fully legal and regulated online gambling market in any country, where fair competition and an equal playing field results in superior product offering, improved player experience and protection in the market. \nThe Betsson Group, Co-Gaming Ltd, L&L Europe Players Ltd and the Gaming Innovation Group were sent warning letters last November by the Norwegian gaming watchdog about their “illegal” operations in Norway.\nAnother two warnings were received by the Kindred Group and Lucky Dino Gaming Ltd this month.\nOnly two gaming companies are licensed to offer gambling services in Norway.\nThe spokesman said letters highlighting Norwegian regulations had been sent to both the companies and the Malta Gaming Authority.\nMalta established itself as a gaming hub in 2004 after becoming the first EU member state to enact legislation on remote gaming.\nThe island hosts one of the highest concentrations of online gaming licence-holders in the European Union, and the industry now rakes in €1.2 billion in annual earnings.\nThe hundreds of gaming companies were lured in by the country’s low-tax regime and by the opportunity to obtain operating licences that allow them to conduct business across the EU’s 28 member states.", "comment_count": 0, "id": 3174}, {"keywords": "", "author": "", "article_body": "The Union of Professional Educators – Voice of The Workers is asking why personnal at the Armed Forces and Customs can get compensation for injuries at work – but not teachers.\n“The union must express its extreme disappointment that, once again, educators have not been afforded the same consideration,” it said in a statement on Thursday, noting that educators have for many years “been subjected to unexpected violence in their work environment” from third party aggressors as well as students.\nRead: Nine out of 10 teachers have experienced aggression in past two years\nIt added that this proposal should be accompanied by better security measures within schools as well as the provision of professional personnel and facilities when dealing with aggressive student behaviour prevalent within the school culture.", "comment_count": 19, "id": 3175}, {"keywords": "", "author": "", "article_body": "A Turkish construction company has insisted its staff enjoy decent living and working conditions and that it is fully compliant with Malta’s laws and regulations, claiming that reports to the contrary were \"inaccurate\".\nTACA Construction, the international building services company, was replying to reports that hundreds of Turkish construction workers flown to Malta recently to work on massive construction projects.\nThe company was one of a number of international construction firms that bid for a tender on the redevelopment of the Fortina Hotel in Sliema and the DB Group’s City Centre project on the former ITS site in St Julian’s.\nThe Sunday Times of Malta had revealed plans by TACA to import some 2,500 Turkish workers over the coming months. Discussions were held with the government’s employment agency, Jobsplus, to ‘fast-track’ the required permits.\n\"We have a long-standing international reputation in the construction sector and are law-abiding citizens in each and every country where we are present. We are guests in Malta and we are following all the rules and will be paying tax as a Maltese entity,” company spokesman Deha Türkel said.\nThe company, which has eight offices around the world and specialises in the construction of super structures, has so far brought over 78 of its workers to Malta. They earn an average monthly salary of €1,450 and are provided with private healthcare insurance, flight tickets, free accommodation and three meals a day, the company said.\nThe 114-metre-tall World Botanic Expo in Antalya, Turkey, that was built in less than 11 months.\n“Our employees, who have been with us for years, will be coming and going according to the needs of the projects we have been contracted to undertake. Their visa prevents them from bringing over their families and they have no intention of staying in Malta.\n“All our workers’ paperwork is in order and above board. They are skilled individuals with international expertise,” Mr Türkel said.\nTACA Construction has also dropped its plans to set up a temporary village in Mqabba – even though its workers prefer to live together as a community as they have done in other countries – and will instead be housing its employees in apartments.\nMr Türkel said TACA Construction had sub-contracted Maltese contractors for equipment and machinery and is purchasing most of the construction supplies locally, thereby creating new economic opportunities for local industry.\n“We bring a lot of expertise to the market through our extensive experience of large projects in other countries and we honestly cannot understand why we are being singled out for such attacks when we have done nothing wrong.”\nQuestions sent by Times of Malta to TACA Construction have remained unanswered.\nMalta’s human rights NGOs were among those who said they “deeply concerned” by plans for the importation of Turkish nationals to work on a number of major construction projects.", "comment_count": 73, "id": 3176}, {"keywords": "", "author": "", "article_body": "Out of the 2.6 million tourists who visited Malta in 2018,1.98 million of them stayed in hotels or guesthouses, an increase of 8.4 per cent over the same period in 2017.\nThe National Statistics Office reported on Thursday that between them, tourists spent 10.1 million nights in collective accommodation.\nOccupancy rates improved by 2.0 percentage points, reaching 67.6 per cent, with the only drop in bed nights – albeit a minor one – being in the five-star hotels.\nThere were 191 collective establishments in 2018, up from 174 a year earlier, which meant the number of available bed spaces went up to 40,966 from 39,048.", "comment_count": 1, "id": 3177}, {"keywords": "", "author": "", "article_body": "Major amputations caused by diabetes dropped by a third in one year, after a €400,000 Diabetic Foot Ward started welcoming patients at the end of 2017.\nSpeaking during a visit to the ward, which has already hosted 750 patients, Health Minister Chris Fearne said that while diabetes was very common among the Maltese, it could be controlled.\nDiabetes could lead to limb amputations of a minor (foot or toes) and major (above the knee) nature.\n“With the help of new medicine and measures, we have managed to cut down the number of major amputations by 30 per cent.\n\"As a result, we initially saw an increase in the number of minor amputations, however, last year we managed to decrease both minor and major amputations,” Mr Fearne noted.\nThe health authorities were increasing efforts when it comes to prevention, he said, adding that 27,000 machines that record and help control sugar levels had been distributed among patients.\nGlucose sticks had also been handed out to 30,000 people, with a total expense of €16 million.", "comment_count": 2, "id": 3178}, {"keywords": "", "author": "", "article_body": "The International Monetary Fund has called for “urgent action” to address shortcomings in banking supervision by the Malta Financial Services Authority, in a report prepared at the request of the government.\n\"To strengthen bank supervision, the MFSA should take timelier supervisory actions, increase the frequency of onsite inspections, make more use of monetary fines as part of the sanctioning regime, and ensure supervisory action is not delayed through judicial appeal,” the authority and the Central Bank of Malta quoted the IMF report as saying, in a joint statement.\nThe IMF said that containing financial integrity risks is critical to financial stability, saying that a multi-prong approach was needed to address anti-money laundering and combating the financing of terrorism (AML/CFT) deficiencies.\nThe report noted that these AML/CFT threats affected not only the financial sector but the broader economy as a whole.\n\"Malta’s openness to financial flows makes it vulnerable to ML/TF risks. Increasing inflows, including from countries generally considered to pose greater ML/TF risks, may exploit vulnerabilities in the banking sector, real estate, remote gaming, virtual assets, and the IIP.\n\"A new legislative AML/CFT framework entered into force in 2018, but according to the opinion of the European Commission (July 2018), the transposition of the EU’s Fourth AML Directive is not complete and recent bank intervention cases exposed serious shortfalls in the framework. Malta is currently undergoing an assessment against the Financial Action Task Force 2012 standard,\" the report said.\nIt also highlighted the need for more strenuous verification of beneficial owner information and monitoring of risk-sensitive accounts, particularly for nonresident clients (including opaque companies), new technologies (e.g., virtual assets and e-gaming), and IIP-related funds.\n“Customer due diligence for domestic and foreign politically exposed persons, their family members, and close associates and reporting suspicious transactions also need to be fortified,” it said.\nReferring to blockchain and cryptocurrencies, the report also recommended that more resources should be immediately appointed to oversee virtual asset service providers.The banking system remains resilient under a severe scenario, with weaknesses limited to a few small banks\nThe Financial System Stability Assessment Report summarised the findings of an on-site review was carried out by a team of IMF international experts in September 2018, as requested by the government in 2017. This is the second such report, the first having been carried out in 2002.\nThe IMF had also been asked by the government to assess its budgeting and presented its findings during the budget briefing last September.\nThe IMF's FSSA report issued on Thursday looked into other key metrics of the banking system – such as capitalisation and liquidity – saying that although it was in good health, challenges existed.\n“The banking system remains resilient under a severe scenario, with weaknesses limited to a few small banks. The system is sufficiently capitalised to absorb losses in the event of a severe macroeconomic shock, but risky exposures would lead to potential losses at a few small banks.”\n“Continued enhancements are encouraged in the macroprudential framework. While the recent strengthening of systemic risk monitoring is commendable, the legal framework should be enhanced, data gaps closed, and non-bank risk assessment strengthened. The planned introduction of borrower-based measures to address build-up of vulnerabilities in the housing and household sector is welcome,” it said.\nThe report also referred to the closure of banks - without mentioning either Pilatus or Satabank by name - saying that the MFSA should strengthen its supervisory and early intervention procedures, \"including to mitigate its legal risks\". One recommendation was to reduce the time in office for the competent person appointed to manage the affairs of a bank.\nMFSA chairman John Mamo picked out the IMF’s comments on the authority’s needs for more resources:\n“The report highlights the challenges facing the MFSA from the increased demands of supervising the growing number of licensed financial institutions in an evolving and more complex regulatory environment, as well as the need to upgrade the MFSA’s operational capacity to enable it to operate more effectively.”\nWith regards to the IMF’s call for strong supervision and enforcement, he said the recommendations had been noted.\nThe report was welcomed by the Governor of the Central Bank of Malta, Mario Vella, who noted its general positive outlook on financial stability risks in Malta, and the recommendations made, adding that these mainly reflect enhancements to the work already being carried out by the Central Bank.\n\n\n\n\nWhat it said about the MFSA:\nThe review of supervisory measures reveals that the MFSA’s actions have not always been timely and effective. Significant delays exist between the end of onsite inspections and the date on which decisions were taken by the SC. The low and limited number of monetary sanctions has little deterrent effect.\nMoreover, the limited scope of onsite inspections (low frequency and keyrisks insufficiently covered) impair the detection of problems, including in the ML/TF area. Judicial appeals against monetary sanctions have suspensive effects, undermining the sanctions policy (e.g., MFSA has 27 pending appeals with some dating back to 2009).\nThe authorities should eliminate delays in supervisory actions (including by amending the law if needed) and take full advantage of the broad enforcement powers.\nImportant shortcomings in bank supervision practices need to be addressed. MFSA needs to complete the rollout of its supervision strategy, including the completion of the Supervisory Review and Evaluation Process for all HPLSIs, and address the low frequency of onsite inspections at LSIs. A more intrusive approach is needed to assess banks’ risk-management processes, including for asset recovery, related-party transactions, forbearance measures, andcollateral valuation. The focus should be on the main risks (credit, liquidity, and compliance), the adequacy of risk classification and provisioning, and on stronger follow-up on remediation progress.\nAny possible limitations on the judicial review of supervisory/resolution actions should strike a balance between the right and a legitimate need for judicial review and the effectiveness of such actions.\nDespite improvements, the related-party framework exhibits significant gaps with the BCP, requiring further action. Legal amendments are needed to increase MFSA’s powers and banks’ obligations related to: (i) the change of legal structures; (ii) major acquisitions; (iii) the review of the activities ofcompanies affiliated with banks’ parent companies; and (iv) the communication of materially adverse developments. Finally, the authorities should improve the supervision of non-EU branches.\n\n\n\n\nRead the full report here. \nPN REACTION\nIn a reaction to the IMF report, the Nationalist Party observed that the European Commission had noted that Malta's economic performance, although positive, was facing sustainability challenges. \nThe report noted that \"children in single-parent, and medium-skilled families are at greater risk of poverty.\" With regards to public finance, the report commented on the increase in public expenditure stating that government was financing permanent expenditure with temporary income.\n\"This equates with what the Opposition has repeatedly stated, that is that government is recklessly increasing public expenditure basing its spending patterns on income, including income from proceeds of the IIP scheme, which might decrease sharply in the near future.\"\nThe PN also noted the IMF concerns about serious shortcomings in Malta's anti-money laundering enforcement framework, adding that \"no significant steps have been taken to strengthen enforcement of the anti-corruption framework\".\n The report noted that the MFSA's actions had not always been timely and effective.\nA new legislative anti-money laundering framework entered into force in 2018, but according to the  European Commission, the transposition of the EU's Fourth AML Directive was not complete and recent bank intervention cases exposed serious shortfalls in the framework.\nThe PN said such reports echoed the positions adopted by the Opposition and other organisations over the past months. It pointed out that only recently the CEO of HSBC Malta said that the damage on Malta's reputation was harming banking profits.\n\"This report clearly shows that the government has failed in carrying out its duty of ensuring that our financial services sector is duly regulated. The lack of proper and efficient regulation has led to high profile cases that severely damaged Malta's standing as a financial services centre of excellence,\" the PN said.\n\"Financne Minister Scicluna has recently commented that the Panama papers debacle is history. Clearly it is not. Malta is suffering and will continue to suffer. The blame for this rests heavily on the Prime Minister and Minister Edward Scicluna.\"\nMario de Marco, shadow minister for finance and Kristy Debono, shadow minister for economic affairs, signed the statement. ", "comment_count": 58, "id": 3179}, {"keywords": "", "author": "Denise Grech and Matthew Xuereb", "article_body": "A man who lost his life in a fire in his Msida apartment died trying to escape, investigators suspect.\nThe fierce fire, believed to have been caused by a gas heater, broke out just after 7.30am in the apartment in Triq Oscar Zammit.\nWhile the mother and son managed to get out of the apartment, 70-year-old Joseph Dimech was trapped inside. Panic-stricken, he probably attempted to flee from the shaft and fell, police sources said.\nThe sources added Mr Dimech was found in the shaft of his apartment by firefighters who rushed to the scene. \nMr Dimech’s wife, Phyllis, 66, and their 25-year-old son, Carlos, were rushed to hospital to be treated for their injuries. The latter suffered burns while the woman was treated for smoke inhalation.\nBelieved to have been caused by a gas heater\nAn eyewitness told Times of Malta they heard a very loud explosion, with black smoke subsequently bellowing out of the apartment. The eyewitness woke up to hear loud screaming coming from the apartments, he said.\nAnother eyewitness said she arrived on the scene to find two people on the roof of the Msida apartment trying to communicate with firefighters below.\n“The firefighters were struggling to reach the two people on the roof, until another fire truck came and they could continue their rescue mission,” she said.\nThey seemed to be trapped by the fire, the person on the scene said.\nMagistrate Simone Grech is leading an inquiry with the help of a number of court experts she appointed to assist her.\nMEP Francis Zammit Dimech described Mr Dimech as a \"jovial\" person \"who never failed to lend a helping hand\". Mr Dimech had served as a driver for Dr Zammit Dimech when the latter was a Cabinet minister.  Dr Zammit Dimech told Times of Malta that he was shocked by the news. \n\"I remember Joe as a very hard-working and ever so jovial a person, never failing to lend a helping hand to all who needed it, to be do caring towards his family whom I know well and to others in general,\" the MEP said.\n\"He was the kind of person to leave a positive impact on you. My deepest condolences and utmost solidarity to his family.\"", "comment_count": 38, "id": 3180}, {"keywords": "", "author": "", "article_body": "MEP Roberta Metsola on Thursday visited Maltese businesses destroyed in last weekend’s storm and promised to continue to do her utmost to help those affected get back on their feet.\n“It is so moving to be here and to see thriving businesses, farms and waterpolo clubs reduced to rubble overnight. But the thing that struck me the most was the determination of those who lost everything to pick up and start again. There was no sense of hopelessness, just resolve to come back and to come back stronger. We will rebuild,” she said in St Paul’s Bay, one of the worst hit localities.\nWatch: Before and after - how the storm swept businesses away\nDr Metsola said she had been in constant contact with the government and the highest levels of the European Commission to push for tangible European funds to help the rebuilding effort.\nEurope had a role to play, and when disaster struck in one state it often brought out the best of the spirit of solidarity within the community of nations.\n“We will help the government with efforts to secure tangible European solidarity and to ensure not only funding but that we use all the tools we have as an EU state to make sure we are better prepared next time.”\nDr Metsola underlined that while EU funds are being sought, the government could and should step in to help in the immediate aftermath of the storm.", "comment_count": 21, "id": 3181}, {"keywords": "", "author": "", "article_body": "A seven-year-old boy was seriously injured when he fell off a fence on Wednesday evening.\nThe police were called to Triq ix-Xatt in Għajnsielem at around 6.30pm.\nThe boy was rushed to the Gozo Hospital where he was certified to be suffering from serious injuries. He was then flown to Mater Dei hospital.\nA magisterial inquiry and police investigations are ongoing.", "comment_count": 0, "id": 3182}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The soldier at the heart of the ‘army gate’ controversy in November has filed a civil action against AFM Commander Jeffrey Curmi requesting the judicial review of his dismissal from the Amed Forces which amounted to a “discriminatory” and “unreasonable” measure.Former bombardier Godwin Schembri had found himself at the centre of a raging controversy when, footage of a light moment shared with fellow colleagues, was uploaded on social media, soon going viral.Read: Brick wall erected after ‘army gate’ controversy\nIn the video clip, filmed by a colleague seated as passenger in an army vehicle which was being driven by Bombardier Schembri, the latter mocked the army’s top brass over a recently-installed free-standing gate, meant to control access to the AFM’s shooting range in Pembroke, but rendered useless by the absence of a fence on either side.Bombardier Schembri had flagged the matter by swerving around the closed gate while driving the military truck, making ‘colourful’ remarks, while other soldiers on board giggled in the background.\nThe leaked footage clearly showed that the soldier had merely intended to bring a smile to his friends’ face, certainly never meaning to show disrespect towards the Armed Forces of Malta, the applicant claimed.\nRead: Military, ministry mum on bombardier’s ‘dismissal’ after video rant\nMoreover, the man’s superior had also witnessed the light moment and had never intervened to reproach the soldier or point out that such behaviour was in any way disrespectful towards the AFM.\nHowever, trouble brewed for the bombardier when, totally unknown to him, that video was uploaded on social media, soon making the rounds and causing quite a stir.Two days later, on November 21, the man at the centre of the incident was summoned to answer for his behaviour before his superior Lieutenant Colonel Edric Zahra.Bombardier Schembri had explained that he had never authorised the sharing of that joke, which indeed had never been intended to be uploaded on public platforms but had simply been meant as a joke to be shared on a closed chat among army mates.The man’s superiors had assured him that in case of an admission on his part, he would not face dismissal but would only incur ‘a minor penalty by way of a warning’.Read: Shooting range gate featured in soldier's video ‘did not cost much’\nYet, disciplinary proceedings over his alleged dangerous driving and inappropriate language had resulted in a conviction, based upon the soldier’s own admission, landing him with an extra 12 duty watches, a reprimand as well as the transfer to another company within the same regiment, besides an official warning.Even then, the matter did not stop there. On November 23, Bombardier Schembri was summoned before Commander Jeffrey Curmi who informed him that what he had done had amounted to insulting and denigrating behaviour towards the Army and the Commander himself, thereby meriting a dismissal.In the application filed before the First Hall, Civil Court, the former soldier’s legal team claimed that such decision breached the applicant’s fundamental right not to be tried twice and was “discriminatory” and “unreasonable”.\nIndeed, although the video was shared by someone else, it was only Mr Schembri who had faced dismissal, the lawyers argued.The Commander’s action had also run counter to the principle of ‘fair hearing’ since he had chosen to take the matter into his own hands, “disciplining the person who had criticised him during the light moment”.The soldier’s dismissal amounted to an administrative act which had failed to abide by procedural rules and which clearly breached the principles of natural justice, thereby qualifying for judicial review in terms of article 469A of the Code of Organisation and Civil Procedure.\nThe applicant thereby requested the court to declare the Commander’s decision as ‘ultra vires,’ therefore null and void and to liquidate damages payable by the AFM Commander in his regard.\nLawyers Joseph Giglio, Franco Debono, Marion Camilleri and Mario Spiteri signed the sworn application.", "comment_count": 22, "id": 3183}, {"keywords": "", "author": "", "article_body": "Five hundred days after the assassination of Daphne Caruana Galizia, the masterminds of her murder were still enjoying impunity and power, Reżistenza Malta said on Thursday.\nThe pressure group placed a placard in Bidnija on the 500th day anniversary of her death saying \nIn a statement, it said no journalist was ever murdered for a lie, but in revenge to the truth they uncovered or to stop them from discovering and exposing uncomfortable truths.\nIf one felt slandered, he had a legal remedy to expose the deceit of the accuser. It was only in respect of truthful allegations that one did not have a legal remedy.\nRead: How has Daphne's murder changed Malta?\nThe organisation said it was evident that whoever ordered Ms Caruana Galizia’s murder was no common criminal. On the contrary, the masterminds were powerful enough to buy the silence of others.\nAt the same time, it was with regret that one observed that the majority of local journalists behaved as though the search for truth with regard to this crime was the exclusivity of the police force.\n\"Media too has the moral duty to investigate such a horrendous crime and to verify whether the police are doing everything in their power to identify and prosecute every person who was involved in the murder and whether the crime could have been prevented.\"\nReżistenza said it had been a long time since somebody cited the million euro reward that had been promised to anyone who would help to identify those involved in the assassination.\nIt was not only the case that not enough was being done to find the masterminds of the assassination, but Malta’s institutions no longer cared to convince the public that this was being done.\nRead: 3 to 5 other potential suspects in Caruana Galizia murder probe but...", "comment_count": 43, "id": 3184}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "A magistrate has been appointed to investigate abuse of power and claims of brutality by members of the police’s Rapid Intervention Unit last Saturday, caught on cameras and published by Times of Malta on Wednesday.\nThe injured Fabrizio Sciré.\nA spokeswoman for Home Affairs Minister Michael Farrugia on Wednesday said that a magistrate is looking into the alleged beating of two Sicilian men by the police.\nHowever, the spokesman did not explain why, in contrast to previous practice, the police officers involved were not suspended from their duties until the conclusions of the investigation.\nPolice sources told the newspaper that Magistrate Neville Camilleri, leading the inquiry, has already confiscated the footage and other evidence to shed more light on what had actually happened.\nThe footage aired Wednesday on timesofmalta.com shows some eight RIU police officers surrounding two men, with two particular officers clearly seen punching and striking blows at the two men without the latter appearing to offer any resistance.\nIn a similar case in 2007, when another police officer was caught on video kneeing a German resident in her chest, he was immediately suspended pending an inquiry.\nHowever, this time round, Minister Michael Farrugia has so far failed to act in a similar manner.\n“Depending on the outcome [of the magisterial inquiry], the necessary steps will be taken as needed,” was the only reply from his spokeswoman.\nAccording to one of the victims, Fabrizio Sciré, a Sicilian businessman who has made Malta his home for the past three years, police officers from the mobile squad called him names and laughed at him when he asked them for help as one of his trucks parked in Żebbuġ was on fire.\nHe claimed that, for no apparent reason and without any provocation, he was beaten up by the police together with his son.\nOn Tuesday, a police spokesman confirmed that an internal investigation was under way following a report filed by the Italian businessman and his lawyers.\nHowever, he emphasised that the police officers denied all the claims made, despite the footage showing the beatings.\nMeanwhile, reports of the incident published by the Sicilian media sparked a hostile online backlash between Maltese and Sicilian users, with some accusing the Maltese of being “racists” and “ugly” while Maltese commentators called Sicilians “mafiosi” accompanied by ‘customary’ calls for all foreigners living in Malta to “go back home”.\nSome Sicilian commentators went as far as to call all their followers for a “commercial war” on Malta by not allowing truckloads of Sicilian food items and other goods to be transported to Valletta every day.\n“We should block the Pozzallo port,” one of the Sicilian commentator said, in direct reference to the Sicilian port hosting a daily Malta-Sicily catamaran service.\n ", "comment_count": 66, "id": 3185}, {"keywords": "", "author": "", "article_body": "These are the main stories in Thursday’s newspapers.\nTimes of Malta leads with the story on the man who lost his life on Wednesday when he tried to escape a fire caused by a gas heater in his Msida apartment. In another story, it says Brussels warned that the current economic growth registered by Malta needed to be accompanied by substantial reforms if it was to remain sustainable over the long-term.\nL-Orizzont says that work has started on the provision of a helicopter service between Malta and Gozo.\nThe Malta Independent and In-Nazzjon lead with PN leader Adrian Delia’s address to close the PN general council during which he said the PN would guarantee people's right to a roof over their head.", "comment_count": 0, "id": 3186}, {"keywords": "", "author": "Denise Grech ", "article_body": "Elderly victims of fraud more than trebled in 10 years, with over 16 per cent reporting the crime last year compared to 4.8 per cent in 2008.\nThe stark figures from the Crime Annual Report come in the wake of warnings by criminologist Saviour Formosa that crime is moving online, with the police having to be prepared for crimes that “have yet to be conceived” in the digital world.\nTrends of online crime will continue to rise as the use of technology increases – and data showed the elderly were the most susceptible, Prof. Formosa warned.\nEveryone could be lured to fake accounts, but the elderly were less likely to be technologically savvy, making them the most vulnerable, he added.\nAwareness was key to reducing the likelihood of the elderly being susceptible to online organised crime, Prof. Formosa said.\nLaunch awareness campaigns targeting the elderly\nHe recommended that local councils launch awareness campaigns targeting the elderly, teaching them how to avoid suspicious links. Banks could also better guide clients on what could be done to avoid getting scammed out of their money online, Prof. Formosa recommended.\nSeniors are globally often disproportionately targeted as victims of fraud, according to the American Association of Retired People.\nCases of fraud rose by more than 30 per cent over the past year as crime moved to the digital world, the crime report, published earlier this week, showed.\nReports of money-laundering also rose by over 94 per cent, from 17 cases in 2017 to 33 cases last year.\nThe country’s crime rate reached 15,925 offences last year – a seven-point decrease, figures from the report show.\nHow to avoid getting scammed\n1. Review your credit card and bank statements.2. Keep track of your financial activity.3. Never give out information or money in reply to an email or a phone call.4. Do not click any suspicious links.", "comment_count": 0, "id": 3187}, {"keywords": "", "author": "Ivan Martin", "article_body": "The Labour government is giving Malta a reputation of sleaze, Opposition leader Adrian Delia said on Wednesday.\nSpeaking at the close of the Nationalist Party’s 2019 General Council, Dr Delia said a new European Commission report on Malta highlighted shortcomings in the island’s governance framework which could weigh in on the investment climate.\nCorruption in particular, he said, was highlighted as a problematic factor.\n“People all over the world read these documents. And this is what they are reading about our country,” he said.\nDr Delia went on to quote a recent article in The Economist which said Malta had joined Cyprus as a jurisdiction rife with dodgy dealings.\n“Under Nationalist governments we were a centre of financial excellence, and under a Labour government we have a reputation of financial sleaze. This is [Prime Minister] Joseph Muscat’s legacy,” he said.\nThe government wanted to convince the country that all was peachy. The harsh reality facing countless families, however, was far from picture perfect.\nThe problem, Dr Delia said, was that the government did not truly care about the people.\nHousing prices, the rental market, and the importation of cheap labour were all impacting people’s lives.\nThe government seemed to have no plan for youths, and even less of a vision for the elderly.  \nTo make matters worse, democracy was under threat.\nDr Delia said this was not just his political point for speeches– but the opinion of independent authorities that had in recent months sounded warnings over the state of affairs in Malta.\nHe quoted a recent Ombudsman report into Army promotions, pointing out how it found that the entire promotions system was flawed.\nDr Delia said similar problems existed in the police, and other important bodies like the Office of the Attorney General, which had been usurped by the governing Labour Party.\n“Today we say, with a heavy heart, that democracy is not working in this country,” he said.\nDr Delia said the Venice Commission, an advisory body of the Council of Europe, had also found serious shortcomings in the way the country’s democratic structures were functioning.\nThe PN, he said, would not allow the government to drag its feet on the necessary reforms to strengthen the island’s democracy. \nTransparency International had also downgraded the island, and so had an influential expats' magazine, which said Malta was not as good a place for foreign nationals as it used to be.\nDr Delia said it was clear that the Labour government had already lost the support of young voters.\n“We believe in the young and we are once again becoming a truly young party,” he said.\nAt the close of his speech, Dr Delia said the PN would lead the fight against Malta's rising poverty. The PN would not pull the wool over people's eyes as the PL had done, he said.  ", "comment_count": 19, "id": 3188}, {"keywords": "", "author": "", "article_body": "Automated vote-counting machines which the Electoral Commission plans to use for MEP and local council elections in May still have an error rate of 20%,  Opposition MP Beppe Fenech Adami said in parliament on Wednesday.\nHe said this had emerged from the most recent test-run carried out on the machines.\nThe error rate represented a halving of a previous rate of 40%, he said, but the fact that the system could be manipulated in such a way as to reduce error meant that it could also be manipulated to increase error.\nRead: Election results in six hours instead of three days\nDr Fenech Adami said that particularly in local council elections, where winners and losers were sometimes decided by a handful of votes, it was essential to have absolute certainty in any system used in the election.\nDr Fenech Adami also pointed out that Electoral Commission's proposals to give each political party a copy of each and every used ballot paper could lead to vote-buying as ballot boxes were assigned to particular streets, making it possible to search for a particular voting pattern agreed upon in advance with a voter from a specific address.\nRead: E-counting system flaws could lead to voter fraud, warns PN", "comment_count": 23, "id": 3189}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "As the winds picked up speed on Saturday night, Mario Mifsud, a full-time Dingli farmer, secured his greenhouses as best he could and returned home after a day of work. \nHis house is close enough to his fields that, in the middle of the night, he could hear plastic flapping off the structures as the worst storm in a generation swept across the islands. \nAs soon as he woke, he went down to inspect the scene: “It was before dawn and the wind was strong enough to blow you over. When I saw everything that had been destroyed, I didn’t know what hit me,” he told the Times of Malta. \nMr Mifsud, 60, who has worked the fields in Dingli his whole life and said he had never experienced such damage, was one of countless farmers across the island who saw months of work destroyed in the severe gale-force winds. \nThe windows and roof of a large greenhouse, which he had replaced just two months ago at large expense, were ripped off, exposing rows of marrows to the elements. \nNearby grow-tunnels housing peppers fared even worse: two were completely destroyed and the crops inside, which had been growing since last August, all lost. \nOther crops, including strawberries and newly-planted watermelon, were also struck. \n“Some of these crops take three months of work and constant expenses to grow,” Mr Mifsud said. “Then as soon as you begin harvesting, the weather comes along and you have nothing to show for it.” \nI know of one farmer who has had to uproot about €17,000 worth of potatoes\nThe full extent of the structural damage, and the time it will take to repair, has not yet been quantified but Mr Mifsud said the loss of income from his crops was a particular blow after a season of favourable weather – following a number of poor years – and good market prices. \nHe said he was encouraged by the government’s announcement that it would seek to tap EU solidarity funds to help compensate farmers but expressed fears over the damage to the sector as a whole, already in steep decline due to rising expenses and foreign competition. “There’s not much of a future for small farmers,” Mr Mifsud said. “Farmers are losing heart. I am not going anywhere but younger people are not going to bother.”\nMr Mifsud surveys the destruction. Photo: Matthew Mirabelli\nMalcolm Borg, from the Għaqda Bdiewa Attivi, said the scale of the damage was still becoming apparent days after the storm.  \n“The number of farmers that have contacted us is stunning,” he said. “There has been huge damage to greenhouses but I know of one farmer who has had to uproot about €17,000 worth of potatoes.” \nPossible compensatory support, he said, would help the sector, but it was not yet clear whether the amount of damage would make it eligible for the EU solidarity fund. \n“Everyone is taking stock of the situation but the reality is that all they can do is clear the damage and start from scratch.”", "comment_count": 0, "id": 3190}, {"keywords": "", "author": "Ivan Martin", "article_body": "Spanish investigators stumbled upon evidence that a Maltese tuna rancher could also have been involved in an EU-wide fisheries racket during investigations into a rogue Spanish operator last year.\nAccording to documents submitted in a Spanish court, Malta Fish Farming Ltd (MFF) was also identified in wire-tapped phone calls as a supplier of illegal tuna to the Spanish market alongside Spanish-owned company Mare Blu.\nMFF Ltd, owned by former Elbros owner Saviour Ellul, was mentioned in the conversations, summaries of which have been seen by this newspaper, as having supplied illegal tuna catches to a Spanish distributor.  \nSources in the Spanish investigation told the Times of Malta that MFF and Mare Blu were the only two companies that were mentioned in this case. However, they were informed that most operators in the sector were involved in some form of black market dealings. \n“There are several hundred pages that have been submitted in court in Spain but these are the only two Malta-based operators involved in this case,” the sources said. \nAccording to the court documents, MFF would allegedly supply irregular tuna to Spain via Italy and France, using trailer trucks, ferries and planes and a network of suppliers.  \nContacted on Tuesday, Mr Ellul directed Times of Malta to send any questions on the matter via e-mail. In a brief reply, he later denied any involvement in the smuggling of fish from Malta to Spain.   \nThe Spanish court documents identify Mr Ellul’s son Giovanni Ellul as the supplier of irregular tuna. \nThe Spanish probe has also pointed a finger at former Fisheries Director General Andreina Fenech Farrugia, saying she had allegedly solicited bribes from Mare Blu tuna farm in return for higher fish quotas. \nWhile she was suspended as soon as the allegations were leaked to the Spanish press, she has denied any wrongdoing insisting any mention of payment in the intercepted phone calls was in relation to the standard fee an operator would have to pay for increased quotas.  \nIndustry sources, meanwhile, have described the sector as rife with abuse, filled with operators who did not take kindly to enforcement.  \n'I’m surprised they didn’t kill Andreina' - industry veteran\n“I’m surprised they didn’t kill Andreina [Fenech Farrugia] after she clamped down on some operators in recent years. This whole sector needs to be sorted out but there has never been any will to do so,” a veteran in the industry said.\nSpanish investigation sources said the irregular tuna catches, which originated from Italy and Malta, would often start to decay en route but still get sold to consumers. The main problem with supplying such tuna to the market is the dramatic increase in harmful histamines in the meat. \nHistamine can be toxic from 50 milligrams per kilo of product, although EU sanitary regulations allow an absolute maximum of 200 milligrams. \nThe Spanish sources, however, said consumers who ended up hospitalised in Seville ate tuna containing 2,584 milligrams per kilo. Histamines in these proportions can cause heart failure and lung disease, according to an expert report incorporated in the Spanish court case.", "comment_count": 64, "id": 3191}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A motorist who admitted to having acquired VRT 'pass' certificates for his two cars without actually taking them for the tests was spared an effective jail term by an appeals court on Wednesday.\nGodfrey Formosa, 40, had landed a 3-year effective jail term and a €150 fine after pleading guilty to having unlawfully obtained VRT certificates for a Ford Transit and a Mustang without either of the vehicles undergoing the relative testing.\nHe had been charged with trading in influence, making use of the false certificates, falsifying the documents and making use of a vehicle without a valid road licence.\nHe had refused legal assistance, pleading guilty to the charges whilst under the impression that the offences to which he was admitting were the same as those mentioned by the police during his interrogation and in respect of which he had released two statements.\nAfter his conviction, he engaged a lawyer to file an appeal seeking to revoke the effective jail term which was deemed to be ‘disproportionate.’\nIn the course of appeal proceedings it emerged that when the police interrogated Mr Formosa, their questions clearly pointed in the direction of a different crime, possibly bribery, but certainly not trading in influence which carried a heftier punishment.\nIn his second statement, Mr Formosa had admitted that he had paid €80 and €50 respectively to have a Ford Transit and a Mustang certified with a ‘pass’ without subjecting them to the testing process.\nThis scenario did not amount to the crime of trading in influence which involves three players, where one person hands over money to a second so that the latter can unlawfully influence a third individual to do something contrary to law.\n“How could the accused ever have guessed that there would be a change in the charges from the time when he released his statement to the moment of his arraignment?” defence lawyer Stefano Filletti argued.\nThe argument was upheld by the court of criminal appeal, presided by Madam Justice Edwina Grima, who observed that at no stage in his statement hadMr Formosa's declarations indicated that he had committed the crime of trading in influence.\nThe man had paid directly the two employees at the VRT stations who had issued the false certificates, the court observed, adding that the third player had been missing.\nIn the light of such circumstances, the court upheld the appeal, declared Mr Formosa not guilty of trading in influence and falsifying the documents, whilst confirming his guilt in having made use of the false certificates and allowed the use of a vehicle that lacked a valid licence.\nThe court thereby varied the punishment to a 1-year jail term suspended for two years and a €100 fine.\nLawyer Stefano Filletti was counsel to the appellant", "comment_count": 0, "id": 3192}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The driver of the getaway vehicle allegedly involved in a violent robbery in Qormi, where a thief disguised as a postman had tricked his way into the home of an elderly woman, was granted bail upon his arraignment on Wednesday.\nMichael Mifsud, a 53-year old Żebbuġ jockey, was arrested and charged as an accomplice in the robbery committed early one January afternoon when the elderly victim answered a knock at her door, only to be overcome by the man and his two accomplices.\nThe woman was tied up while the three strangers made off with cash and jewellery from her home.\nA few weeks later, Mark Anthony Cardona, 41, Ryan Briffa, 28, and Patrick Mangion, 46, had been remanded in custody after pleading not guilty to their involvement in the aggravated theft.\nFurther investigations had led the police to zoom in on the fourth suspect: the driver of the getaway van that had been captured on CCTV footage recovered from the scene of the crime.\nThe man was arrested and marched to court, pleading not guilty to complicity in the January robbery, having driven a van with false number plates as well as relapsing.\nA request for bail was upheld by the court, presided over by magistrate Francesco Depasquale, against a deposit of €5,000, a personal guarantee of €10,000 and an order to sign the bail book twice a day, every day of the week.\nThe court further imposed a curfew between 9pm and 5am, warning the man to abide by those conditions, irrespective of any horse-riding events he may have planned for the future.\nInspectors Fabian Fleri, Roderick Agius and Lydon Zammit prosecuted.Lawyer Joseph Giglio was defence counsel.", "comment_count": 0, "id": 3193}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "A man of Maltese descent was stabbed to death in the UK on Tuesday afternoon, his father has confirmed to the Times of Malta. Alfie Lewis, 72, said his son, St John, who turned 45 last Sunday, was attacked by a couple on his way home in his hometown in Bramley.\nA 48-year-old man and a 45-year-old woman have been arrested in connection with incident, Yorkshire media outlets reported. St John had just turned 45 a few days earlier.\n“He was such a nice guy. He wouldn’t hurt a fly. He had three dogs, Charlie, Delta and Luna, who he loved dearly and treated them as though they were his children,” Mr Lewis, a Ta' Xbiex resident, told the Times of Malta. Asked how he discovered that his son had been killed, an emotional Mr Lewis said: “I got a call from his partner of 13 years, Fay, yesterday evening telling me the devastating news. It felt as if someone was choking me. I still cannot believe that he had to die this way. We all have to die but dying this way is terrible.” According to local media reports, an ambulance with paramedics was called out to the stabbing incident just after 3pm. An Yorkshire Air Ambulance was also called to the scene and land on the street. Despite being given CPR and being shuttled to the hospital, St John Lewis succumbed to his injuries. Mr Lewis said he did not want to bring his son to Malta to be buried here.\n“There’s no way I’m going to bury him. St John will be cremated and his ashes will be spread at the Garden of Rest in Leeds cemetery, with the ashes of his mother, Patricia, who died three years ago to cancer.”He said that since his son worked in catering, being a part-owner of a restaurant, he did not have much time to visit Malta regularly. “We spoke almost every day via Skype. The last time I spoke to him was on Sunday morning to wish him a happy birthday. Who would have ever know that that would be the last time I would have spoken to him? It’s just terrible.”", "comment_count": 0, "id": 3194}, {"keywords": "", "author": "Denise Grech ", "article_body": "Even before the big storm hit, Albert Bonnici had spent the entire week anxiously anticipating the gale force winds that had been forecast for Sunday.\nHowever, nothing could have prepared him for the record high-force winds that battered the country and left his boat in pieces, after waves snapped the ropes that had been securing it and pushed it into a nearby bridge.\n“It was devastating for me,” he said, explaining how he had arrived at Manoel Island to find his “pride and joy”, a Skipperline, that has always been kept in top notch condition, being battered into a wreck.\nHe desperately tried phoning friends for help but it was already too late, he told the Times of Malta. \n“We brought ropes and tied them to the boat to try keep it from banging from the quay,” he said. “We lost the mast but in the initial stages of the storm we still believed that we would manage to save the situation. Then, another yacht was cut lose and that spelled the end for us,” he added, his voice betraying emotion as he relived that moment he realised that the battle was lost.\n“I wanted to get in the boat to see whether there was something that I could do, anything. But my son held me back,” he said, adding he would have risked his life had it not been for his son persuading him to see reason. \nAlthough the gale-force winds had been forecast throughout the week, Mr Bonnici said there was nothing boaters could do except tie down their boats and hope for the best.\n“We always knew there would be a problem, but I have been boating for 25 years and I never saw anything like this in my life,” he said.\nThe cost of berthing at a marina was prohibitive for many leisure boaters, he added, and besides, there was no other safe option.\nThen, another yacht was cut lose and that spelled the end for us\n“The prices of berths keep going up because there’s more demand than supply,” he said, adding that marina prices had skyrocketed to such an extent that they were even more expensive than in the United Kingdom.\nThe lack of feasible options has created an ever-present worry among boaters that lack a safe place where to keep their boats during storms, Mr Bonnici added.\nSunday’s storm tore across the country, leaving uprooted trees and destroying eateries in its wake. The weekend storm saw wind gusts reach a record 72 knots or 133km/h. \nTens of people had to be evacuated from their homes following the stormy weather.\nThe damage consisted mostly in felled trees, demolished walls, water tanks, PV panels, collapsed roofs and balconies, as well as downed masts and wires, Prime Minister Joseph Muscat said earlier this week.", "comment_count": 9, "id": 3195}, {"keywords": "", "author": "", "article_body": "A 65-year-old man was seriously injured early on Tuesday afternoon when he was hit by a car in Triq il-Ħalel, Saint Paul’s Bay.\nThe vehicle, a Nissan Navara, was driven by a 34-year-old man from Naxxar. \nThe injured man is being treated in hospital.\nA magisterial inquiry is being held.", "comment_count": 1, "id": 3196}, {"keywords": "", "author": "", "article_body": "The government has launched a feasibility study about the reintroduction of a helicopter service between Malta and Gozo, Tourism Minister Konrad Mizzi and Gozo minister Justyne Caruana said on Tuesday.\nThey told a press conference that various models of operation were being considered.\nChopper chopped: The helicopter operated on the Gozo route by a Spanish company in 2006.\nThe ministers did not say who would operate the service, but Dr Mizzi said state-owned Malta Medair has been in contact with a number of aviation companies including Airbus to discuss the best type of helicopter for the route.\nMalta Medair was set up a few years ago and holds Malta's slots to operate to Heathrow and other airports, which rights it has leased to Air Malta. The airline also has one aircraft, operated by Air Malta.\nAn Air Malta subsidiary, Malta Air Charter, operated a helicopter service between Malta and Gozo for 10 years, but was forced to discontinue it in 2005 as losses mounted.\nA Spanish company, Helicopteros del Sureste, took over the route but similarly had to give up within 18 months. \nHarbour Air (Malta) Ltd operated a seaplane service between Grand Harbour and Mgarr harbour in Gozo between 2007 and 2012.\nIn 2013 Prime Minister Joseph Muscat told the Gozo Regional Committee that a helicopter operator had expressed interest in running a service. The plans, however, never reached fruition. \nThe Gozo helicopter pad in Xewkija is maintained by the Ministry of Gozo but has been unused for years. ", "comment_count": 4, "id": 3197}, {"keywords": "", "author": "Edwina Brincat        ", "article_body": "A Russian traveller caught leaving Malta with slightly more than the allowed €10,000 was spared an administrative penalty by a court on Wednesday,\nAndrey Prokopenko, a 56-year old St Petersburg resident, was stopped on Tuesday at Malta International Airport on his way to board a flight to Istanbul, after customs officials found him to be carrying an amount of dollars which slightly exceeded the statutory €10,000 maximum limit.\nHe was arrested and arraigned on Wednesday, refusing the assistance of a lawyer.\nStanding before duty magistrate Francesco Depasquale, the man explained how the breach had not been intentional and that he had meant to declare the cash equivalent to €10,000 and use the rest at the duty-free mall.\nHowever, his plan was thwarted when he was called to board his flight, never making it to the shops and thus proceeding to the customs control with the US$613 (€540) in extra cash.\nThe passenger subsequently missed his flight, ending up being arrested and marched to court where he was charged with falling foul of cash control regulations.\nUpon the man’s admission, the court ordered the confiscation of the excess cash, with the €10,000 having been returned to the accused.\nHowever, rather than impose the standard statutory 25 per cent fine on the total sum, the court made reference to article 21 of the Criminal Code which contemplated the possibility of the court imposing a punishment below the minimum prescribed by law.\nDeclaring that this case merited an application of this provision of law, the court freed the accused on condition of not committing another offence within the next year.", "comment_count": 0, "id": 3198}, {"keywords": "", "author": "", "article_body": "A crowdfunding drive to raise money to contest plans to build 12-storey apartment blocks overlooking Mistra Bay has reached its €7,350 target, organisers said on Wednesday.\nThey announced the crowdfunding success just 24 hours after Times of Malta reported that they needed €2,000 more to hit their target. \nResidents from Xemxija and St Paul’s Bay thanked citizens who had dug into their pockets to contribute, noting that they had managed to raise the sum in just one week and without the involvement of St Paul’s Bay local council.\n“We are very proud of this purely grassroots achievement. Unlike a suggestion by an MEP candidate yesterday, civil society is not begging for money but putting its money where its mouth is,\" said writer and activist Wayne Flask, who helped organise the effort.\nMr Flask was referring to PN candidate Michael Briguglio, who on Tuesday had called on the government to set up a fund to be used by civil society groups and local councils trying to appeal large-scale developments.\nCitizen-funded appeals, Mr Flask argued, were a better idea than “begging for government money to oppose developments approved and promoted by government itself.”\nHe urged residents in other localities threatened by massive developments to follow suit and set up their own grassroots campaigns.\nThe Xemxija and St Paul’s Bay residents will now use the crowdfunded money to file an appeal against the planning permit given to developer Charles Camilleri on behalf of Gemxija Crown Ltd. The permit, which was renewed last Janaury, allows the applicant to build more than 700 apartments in the area once occupied by the Mistra Village holiday complex.", "comment_count": 7, "id": 3199}, {"keywords": "", "author": "Denise Grech ", "article_body": "As last weekend’s storm battered the country, homeless people who usually sleep rough on beaches and in boats struggled to find shelter, with many seeking refuge in cars or shell-form properties, two leading shelters told the Times of Malta.\nAuthorities on Sunday advised people to stay indoors, as record high-speed gales that were reported to pose a “high threat to life and property” uprooted trees, demolished walls and structures and wreaked havoc across both islands.\nYMCA head Anthony Camilleri said that the NGO was approached by 10 people seeking shelter since Saturday, but the shelter was “full”. The cases were reverted to Aġenzija Appoġġ, which refers cases to YMCA.\n“We were very worried about them due to the weather,” the YMCA CEO said. “From experience, we know some homeless people do sleep in boats.” \nHe added that it was “very common” for homeless people to find shell properties to spend the night in. However, he warned, the practice was very dangerous, “not to mention illegal”. Unfortunately, he continued, it was hard to quantify the amount of people who were stranded with no shelter during the storm last weekend.\nWe know some homeless people do sleep in boats\nA spokeswoman for Caritas said there was no clear pattern for people turning up at the temporary shelter but noted they were aware many were ‘squatting’ in uninhabited places to survive.\nPeople who find a comfort zone were less likely to reach out, she said, adding some also resorted to sleeping in cars.\nWatch: 'We lost everything'\nThe temporary shelter run by Caritas and supported by the Alfred Mizzi Foundation and the government, sees 50 people a day turning up for food and a bed. \nIt was clear people could not keep up with rising rent prices, she said, adding that although the country was experiencing economic growth, many were struggling to purchase basic needs.\nLast weekend’s storm brought winds which reached gusts of up to 133 km/hour, causing damage to electricity networks and forcing road closures across the whole island. The Civil Protection Department was inundated with people asking for help and received 486 calls. Fourteen people were evacuated from Sliema and 12 from two localities in Vittoriosa, Prime Minister Joseph Muscat said.", "comment_count": 7, "id": 3200}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A husband who had appealed a minimal punishment of a reprimand and admonition over a violent episode with his wife was cleared of all guilt since the alleged victim recounted a different incident when testifying some two years later before the court of appeal.\nThe man had been found guilty of threatening his wife in a violent incident that occurred one day, shortly before midday, in September 2016 at the Parade Ground in Pembroke, with the Magistrates’ Court handing down a reprimand and admonition at the end of summary proceedings two months after the incident.\nYet, in spite of the minimal punishment, the accused had filed an appeal, requesting an acquittal on the basis of a wrong assessment of evidence by the first court.\nThis request necessitated a fresh examination of the evidence brought before the Magistrates’ Court so as to determine whether the first judgment was “legally and reasonably correct,” the Appeals Court observed.\nThat was when the accused’s wife was once again asked to take the witness stand, recounting how one July day back in 2013, her husband had vented his anger in the course of the couple’s umpteenth row, banging his fist against the wall and threatening to punch her to the extent of disfiguring her beyond recognition.\nThe following day the warring couple had met at the police station where they had both gone to file separate reports, the encounter sparking off another argument between the two.\nYet, this account given by the wife, varied from that referred to in the police report upon which the charges had been instituted, the latter based upon a complaint filed by the woman in September 2016.\nThe appellant chose not to testify at the appeal stage.\nTo make matters worse, there was no transcript of the evidence heard before the first court since summary proceedings were not recorded, a point which was seized upon by Mr Justice Grixti who observed that this situation had negative repercussions.\nIn the interim period until the case reached appeal stage, a witness could possibly forget facts, change versions or muddle up one incident with another, a situation which could easily be resolved if every deposition before the Magistrates’ Court were to be recorded, ordering the relative transcript should the case proceed to appeal.\nTurning to the facts of the case at hand, the court concluded that since the alleged victim had testified about a totally different incident to the one underpinning the charges, the accused could not be found guilty of something he did not do, revoking the conviction.", "comment_count": 0, "id": 3201}, {"keywords": "", "author": "", "article_body": "A sachet of cocaine was sent to Nationalist MP Jason Azzopardi at the PN headquarters.\nDr Azzopardi said in a statement on Wednesday that on Friday evening, he collected his mail from the headquarter’s reception. This included a white envelope which seemed to have been sent from Germany.\nOnce home, one of the envelopes was found to contain a sachet of white powder “with a particular smell, the like of which I had never smelt or seen before”.\nDr Azzopardi said he immediately informed the party leadership that he wanted to file a police report and request a magisterial inquiry.\nHe passed the envelope and its contents to the police on Friday at 11pm, and a magisterial inquiry was immediately initiated.\nDr Azzopardi said he had now been informed that the court’s chemical expert had concluded that the powder was cocaine.\nPolice investigations are continuing.\nThe MP said that he believed this was a vile attempt to frame and intimidate him. He vowed to continue doing his utmost to fight the deceit and organised crime which had weakened Malta.", "comment_count": 221, "id": 3202}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A man convicted for trafficking drugs and causing the death of a drug addict 20 years ago had his conviction quashed on appeal, with the case destined for re-hearing before a Magistrates’ Court.\nGozitan-born Lawrence Attard has been at the centre of criminal proceedings ever since 1999 when he was charged with the aggravated possession and trafficking of heroin, as well as with being responsible for the death of a Paola woman. The man was further charged with being a relapser.\nProceedings before the Magistrates’ Courts ultimately resulted in a conviction in 2013, whereby the accused was declared guilty of all offences and handed a six-year jail term as well as a €10,000 fine.\nIn his appeal application, the accused’s lawyer argued that there had been a wrong assessment of facts by the first court, as well as conflicting versions by two key witnesses.\nBesides, neither the post-mortem examination nor forensic tests had established any link between the victim’s death and the drug supplied by the accused, the accused argued, further noting that the first court had wrongly seemed to attribute delays in the proceedings to the defence, when in actual fact the prosecution had ended its evidence stage in 2006.\nThe court of appeal, presided over by Mr Justice Giovanni Grixti, without delving into the arguments raised, brought to light another ground which spelt the nullity of the first judgment.\nIndeed, the first court had indicated the wrong article of law when finding the accused guilty of involuntary homicide, “wrongly citing article 328 of the Criminal Code instead of… article 225”.\nMoreover, the first court had also cited the wrong disposition of law with respect to the drug-related charges, citing the Criminal Code rather than the Dangerous Drugs Ordinance, the court of appeal observed.\nThese two errors effectively amounted to a substantial defect which vitiated the judgment, the court declared, thereby quashing the conviction and ordering that the case be re-heard afresh on the merits.\nLawyer Edward Gatt was counsel to the appellant.", "comment_count": 0, "id": 3203}, {"keywords": "", "author": "Keith Micallef", "article_body": "Despite Brexit, some 6,000 UK nationals who live in Malta will still be able to take part in the forthcoming council elections, thanks to a special agreement which predates Malta’s accession to the EU in 2004.\nPreviously Times of Malta had quoted an Electoral Commission spokesman saying that only those on the EU electoral register would have this right. Consequently, this would have meant that come March 29 when the UK will leave the EU, Britons would lose this right as they wold be struck off this register. \nHowever, this will not be the case. The matter was flagged by Opposition Whip Robert Cutajar, who contacted Times of Malta to point out that Prime Minister Joseph Muscat had given this guarantee himself in parliament last month.\nMr Cutajar noted that on January 23, he had asked for a clarification on the matter during a debate on Brexit. According to the transcripts of this exchange, Dr Muscat had pointed out that Britons would still be able to contest and vote in council elections. This is due to the fact that a pre-EU accession agreement between Malta and the UK will be revived, Dr Muscat said.\nUnder this agreement, Britons were given this right, while the Maltese living in the UK had the right to contest council elections. This privilege was also granted to Cyprus, in view of the fact that both countries were members of the Commonwealth, the Prime Minister had said.\nFurthermore, Dr Muscat had noted that Maltese and Cypriot citizens were the only EU nationals who also had the right to vote in UK general elections, and had even voted in the Brexit referendum.\nAsked for a clarification on the matter, the Electoral Commission spokesman said that they had taken note of the issue.", "comment_count": 13, "id": 3204}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Sunday's storm may have been good news for those scooping washed-up fish from the Xemxija seafront, but less so for traditional fishermen struggling to sell their own fish to buyers spooked by health warnings. \nHundreds of sea bream (awrat) from a nearby fish farm were picked off the ground or fished out of shallow waters on Sunday, prompting health authorities and marine experts to warn that the fish were not necessarily safe to eat. \nThose warnings appear to have had the unintended effect of convincing people to opt against any sea bream for a while, with fishers struggling to sell their own, legitimately caught, fish. \n\"Fishers are catching sea bream in the traditional manner, which normally sells at a good price and helps to ease their problems in winter, but right now nobody is buying,\" representatives of the two fishers' collectives said.\nIn a joint statement, Marco Carabott from the Koperattiva Nazzjonali tas-Sajd and Joe Demicoli of the Għaqda Kooperativa tas-Sajd urged the media to exercise caution before publishing any statements that could hurt the industry. \nFollowing the bizarre scenes in Xemxija on Sunday, sea bream was seen on sale at the promenade for as low as €2 a fish at an impromptu and seemingly unsanitary market. \nEnvironmental health authorities warned that there was no way of knowing whether the fish was alive or dead when caught or whether it had been kept in unsanitary conditions.\nFish could also have been exposed high levels of medical treatments at the fish farm, authorities said, and could only considered safe once a withdrawal period had been exceeded.", "comment_count": 17, "id": 3205}, {"keywords": "", "author": "", "article_body": "A Maltese 'lifestyle magazine' has called on Pope Francis to try being vegan for lent to \"help fight climate change with diet change\".\nVeggy Malta is joining a slew of celebrities and NGOs who have called on the Pope to refrain from eating meat for Lent. In return, the Pope will see $1 million donated to a charity of his choice. \nA 12-year-old animal rights and climate campaigner made the offer earlier this month. The offer was published in national newspapers across 15 countries and backed by the likes of Paul McCartney and film legend Brigitte Bardot.\nIn her letter, Genesis Butler said: \"Farming and slaughtering animals causes a lot of suffering and is also a leading cause of climate change, deforestation, and species loss. When we feed animals crops that humans can eat, it is wasteful. And with a growing world population, we cannot afford to be wasteful.\"\nEach person that goes vegan for Lent will save emissions equivalent to a flight from London to Berlin, and if every Catholic on the planet takes part, it will be equivalent to the whole of the Philippines not emitting CO2 for a year, Veggy Malta said.\nVeggy Malta coordinator Darryl Grima stated: “We would like to suggest to all Catholics that will be fasting this lent to try vegan this year. By going vegan this lent you will be doing your part to help protect the planet, feed the global population, reduce animal suffering, show benevolence to all God’s creatures and potentially improve your health. After all what could be more Christian than fasting for our plant, those suffering from famine and reducing the suffering of God’s creatures?”", "comment_count": 10, "id": 3206}, {"keywords": "", "author": "", "article_body": "Alternattiva Demokratika MEP candidates Mina Tolu and Carmel Cacopardo have signed the ILGA-Europe Come Out pledge to stand for the human rights and equality for all lesbian, gay, bisexual, trans, and intersex (LGBTI) people in the EU and beyond.\nMs Tolu, an LGBTQI activist, said she remembered reaching out to MEP candidates in Malta, including Mr Cacopardo, five years ago to sign ILGA-Europe's 2014 Pledge.\n“This time, it is an honour to pledge my own support as a Green candidate. If elected I look forward to working together with LGBTQI activists to ensure the highest possible level of legal protection of the human rights of LGBTQI people in the EU and beyond.\"\nMr Cacopardo promised to be an ally and to amplify the voices of LGBTQI people, not only if elected, but also in his role as AD chairman. The EU should champion human rights and offer protection and respect for all LGBTQI people, he said.\nRead more about the Come Out pledge.", "comment_count": 4, "id": 3207}, {"keywords": "", "author": "", "article_body": "The European Parliament’s financial crimes committee on Wednesday voted to back calls for the United Arab Emirates (UAE) to cooperate with Maltese authorities over the 17 Black probe.\nPolice sources had previously told Times of Malta that they would only extend their investigation into the activities of Dubai-based company 17 Black if the UAE confirmed that the company is owned by power station investor Yorgen Fenech. \nMEP David Casa said the EP committee demanded that the UAE ensured that funds frozen in 17 Black’s bank accounts remained frozen, and highlighted the lack of independence of both the Maltese FIAU and police commissioner.\nWatch: 17 Black in 90 seconds\nIt noted that journalist Daphne Caruana Galizia was working on the biggest data leak she had ever received at the time she was assassinated - documents from Electrogas - and that Mr Fenech was both a director and shareholder of ElectrogaS.\nIt also called for a joint investigation team to address serious doubts about the independence of any ongoing investigations on 17 Black, with the support of Europol and Eurojust.\nMr Casa said it was of great concern that there had been reports of lack of progress on requests for information from the authorities in the UAE.\nSerious questions have been raised as to how actively Maltese authorities are pursuing the transfer of evidence that would implicate people at the highest levels of government in corruption and money laundering.”\nThe committee, he said, also called on national governments to introduce anti-SLAPP legislation to protect journalists and for concrete action to also be taken at the EU level.\nThe vote in the European Parliament’s Tax3 committee comes on the back of a parliamentary question by Nationalist MP Karol Aquilina revealing this week that two judicial letters seeking assistance had been sent to the UAE by Maltese authorities. \nBoth letters, sent in 2018 and 2019, did not result in any cooperation from the UAE. \nAccording to the 50 pages published from the Egrant inquiry in 2018, attempts by Magistrate Aaron Bugeja to discover if the mystery Panama company held bank accounts in the UAE were rebuffed by the authorities there.\nSimilar requests for information about the Panama companies owned by the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi were also not answered by the UAE.\nIntelligence linking Mr Fenech to 17 Black was sent by the FIAU to the police last spring but the intelligence cannot be used for prosecution purposes. \nSerious doubts about the quality of ongoing investigations\nA leaked e-mail sent by Mr Schembri’s and Dr Mizzi’s financial advisers Nexia BT said the two men’s Panama companies were expected to receive up to $2 million from 17 Black. \nMr Fenech has not denied owning 17 Black, though he vehemently negates any plans to transfer money to Panama companies owned by Dr Mizzi and Mr Schembri. \nRead: Casa wants Dubai bank to disclose information on 17 Black\n17 Black’s Noor bank account in Dubai was frozen in September after the company’s activities attracted the authorities’ attention. \nThe committee's also dealt with issues of taxation that a number of member states, including Malta, strongly oppose.\n“I submitted amendments to any such provisions in the drafting phase of this report and strongly opposed any clauses that could have had a negative impact on Malta’s taxation system in the vote today. I have always vociferously defended Malta’s taxation system and will always continue to do so,” Mr Casa said.\nCalls for golden visas to be abolished\nThe report also called for golden visa schemes to be abolished, and for the fight against money laundering to be stepped up, increased collaboration to fight tax avoidance and tax fraud and an update of tax regimes to the age of digitalisation.\nCo-rapporteur Luděk Niedermayer said the golden visa and special tax schemes to attract foreign investors posed a security threat to the EU while delivering only marginal or zero economic benefits and devaluating European citizenship.\nWatch: Justice Minister Bonnici hits back at critics in EP committee appearance\n ", "comment_count": 6, "id": 3208}, {"keywords": "", "author": "", "article_body": "The brand new catamaran MV Saint John Paul II has completed its delivery trip from Tasmania to Malta to join Virtu's fleet for crossings between Malta and Sicily.\nIt is second largest vessel of the sort in the world and the biggest in the Mediterranean.\nPeople can visit the vessel, which has been selected for the prestigious notation Significant Ship 2018 by the Royal Institute of Naval Architects, on March 10 at the Virtu Ferries Terminal.\nThe vessel has capacity for 900 passengers in five lounges, and a garage that takes 167 cars or 23 trailers.\nThe St John Paul II making its entrance in Grand Harbour. Photo: Daniel Cilia\nThe arrival of the new catamaran comes 89 years, almost to the day, since the first ever purpose-built vessel for the Malta-Sicily route, the MV Knight of Malta, entered service.  \nThe Knight of Malta was launched by Lady Strickland at the Swan Hunter Yard in the UK and it entered service on February 21, 1930.\nThe ship, owned by the Cassar Torregiani family, used to berth at Lascaris Wharf. It could carry some 100 passengers in three classes. It was sunk by aerial bombing in March 1941.\nPrior to the arrival of the Knight of Malta, services between Malta and Sicily were operated by adapted vessels, such as the Ljubljana, owned by the Gasan family before they obtained the Ford car dealership in 1928.\nThe MV Saint John Paul II was delivered to ship-owners Virtu Ferries on February 6.\nThe vessel’s maiden voyage saw her crossing the Indian Ocean, calling at the ports of Fremantle in Western Australia and Colombo in Sri Lanka for refuelling, before passing Somalia, at the Eastern tip of Africa, to transit the length of the Red Sea.\nThe last refuelling port she called at was that of Jeddah before entering the Mediterranean via the Suez Canal. The last leg of the journey - from Port Said to Valletta – was covered in around 30 hours.\nSaint John Paul II, is the fifth newly-built, and 11th high-speed vessel delivered to Virtu since the commencement of the high-speed ferry service between Malta and Sicily in 1988.", "comment_count": 53, "id": 3209}, {"keywords": "", "author": "", "article_body": "The parents of a former policeman who made headlines after he uploaded a Facebook live video in which he was being taken away by officers have insisted the entire operation was undertaken under medical supervision. \nFormer PC99 Mario Portelli had claimed that the government was trying to stop him from confronting Joseph Muscat about his (secret company) Egrant \"lies\".\nIn the video, Mr Portelli filmed police officers who turned up at his home to take him to Mount Carmel hospital. The last shot of the clip showed a policeman trying to snatch his mobile phone from him.\nMr Portelli had made serious claims against both the Prime Minister and Economy Minister Chris Cardona in previous videos. \nIn a statement, Mr Portelli's parents deplored the media insensitivity with which their son's case had been handled, \"including by some politicians\". \n\"This all happened under medical guidance and police did everything by the book to the best of their abilities given the circumstances,\" they said.\nThey thanked the police and the medical services involved in the case for all their help. \n\"We hope that in the future, cases such as this are treated with the utmost sensitivity, especially by those who have greater social responsibilities than others,\" they added. \nMr Portelli's arrest had been questioned by the Alliance for Mental Health, which asked the Commissioner for Mental Health and the Police Governing Board to investigate whether it was in line with Mental Health Act provisions. \nIt was also questioned by Democratic Party leader Godfrey Farrugia who said that the way Mr Portelli was being handled and ill-treated took on an unprecedented significance.\nMr Portelli was the chief witness in the trial against former police inspector-turned-lawyer David Gatt, who had been accused of being involved in the failed heist of HSBC’s operations centre in Qormi in 2007.", "comment_count": 0, "id": 3210}, {"keywords": "", "author": "", "article_body": "Drones will be used to take a nationwide survey of road conditions across the island, Infrastructure Malta said. \nThe study, which will be completed by the summer, will be providing an analysis of the roads for a planned €700-million upgrade, the agency added. \nAerial photos of over 2,500 kilometres of roads in Malta and Gozo will be captured by specialised drones during the next few weeks, starting from the northern parts of Malta.\nThe images will then be processed to develop a Geographic Information System containing photo maps of road networks. The damage data can then be used to establish reconstruction prioritisation levels, the agency added.\nThe photos captured by the drone will be restricted to road areas and their immediate surroundings, and no personal identifiable data will be collected, in line with the EU’s General Data Protection Regulation.\nDrone operators are planning flights seven days in advance to take into consideration weather patterns and road use, among other factors.\nInfrastructure Malta CEO Frederick Azzopardi said the map of the roads will serve as a baseline when assessing the durability and effectiveness of different road construction and maintenance methods along the years.", "comment_count": 14, "id": 3211}, {"keywords": "", "author": "", "article_body": "Prime Minister Joseph Muscat believes his chances of getting a senior EU post are a “long shot”, but has not ruled it out.\nSpeaking to Politico, Dr Muscat confirmed that he would not be contesting another general election after his current term.\nWhen asked whether he would raise his hand “in the race for one of Brussels’ top jobs”, he did not rule it out completely, saying coyly that it was “a very long shot” for someone from “a town of 500 people from the smallest member state”.\nHowever, he followed this out by pointing out that it was possible to shoot for the stars, giving as an example Maltese-American Pete Buttigieg, who is running for president of the United States.\n“You might not know it, but Pete Buttigieg, from the Democrats … a very interesting guy, also a small town guy, and the first openly gay candidate to run for president. When we talk, we speak Maltese.”\nNew Commission president soon\nEvery five years, the European Council - made up of EU heads of state and government - proposes a Commission presidential candidate to the European Parliament.\n\n\nIn a tweet, the European Centre for Press and Media Freedom said it was shocking for Dr Muscat to even consider an EU post as he was politically responsible for Malta's weak rule of law, smear campaigns against Daphne Caruana Galizia, not preventing her murder, a lack of adequate investigations and blocking a public inquiry.\n ", "comment_count": 115, "id": 3212}, {"keywords": "", "author": "", "article_body": "Updated 11.10am with Zammit Dimech statement \nAn elderly man was found dead in an Msida apartment block which caught fire on Wednesday morning, the police have confirmed. \nJoseph Dimech, 70, was found dead in the apartment's shaft by firefighters who rushed in to put out a fire which broke out in a fourth floor apartment just opposite the Junior College. Mr Dimech was 70 years old. Photo: Facebook\nThe fire in the Triq Oscar Zammit block was reported at 7.10am and was controlled by Civil Protection Officers.\nTwo other people, a 25-year-old man and 66-year-old woman, were rushed to hospital by emergency services. The young man was seriously hurt, while no information about the woman's medical condition was available at the time of writing. \nInitial indications are that the fire was caused by a gas cyclinder fault. An eyewitness told Times of Malta that they heard a huge explosion, with black smoke subsequently pouring out of the apartment.\nMEP Zammit Dimech 'shocked' \nMr Dimech had previously served as a chauffeur for Francis Zammit Dimech when the latter was a cabinet minister.\n\nIn a statement to Times of Malta, Dr Zammit Dimech said he was shocked by the news. \n\"I remember Joe as a very hard-working and ever so jovial a person, never failing to lend a helping hand to all who needed it, to be do caring towards his family whom I know well and to others in general,\" the MEP said.\n\"He was the kind of person to leave a positive impact on you. My deepest condolences and utmost solidarity to his family.\"\nDo you have information about this incident? Get in touch on mynews@timesofmalta.com\nVideo: Chris Sant Fournier\nPhoto: Naomi Scicluna\nPhoto: Matthew Naudi\nPhoto: Matthew Naudi", "comment_count": 0, "id": 3213}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Wednesday’s newspapers.\nTimes of Malta says an internal police investigation is being conducted following serious claims of police brutality last Saturday in Żebbuġ. In another story, the newspaper says Spanish investigators stumbled upon evidence that a Maltese tuna rancher could also have been involved in an EU-wide fisheries racket during investigations into a rogue Spanish operator last year.\nL-Orizzont says dentists are concerned about damage to children’s teeth.\nThe Malta Independent speaks to carnival enthusiasts who say the scene after last weekend’s storm was their worst nightmare.\nMalta Today reports the claim in court by the Paqpaqli circuit designers that they did not know where spectators would stand.\nIn-Nazzjon leads with the Nationalist Party’s proposals for the environment.", "comment_count": 0, "id": 3214}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "An internal police investigation is being conducted following serious claims of police brutality in Żebbuġ on Saturday, Times of Malta is informed.\nThe claims are accompanied by the above video footage, in which some eight officers from the Rapid Intervention Unit – the mobile police – are seen manhandling and violently pushing two men, an Italian businessman named Fabrizio Sciré and his son, with two particular officers clearly seen punching and striking blows at the two men without the latter offering any resistance.\nMr Sciré’s injuries\nSo far, the police officers involved have not yet been suspended from their duties, as usually happens, despite the fact that video footage has been passed on to the police and other authorities.\nThe Italian embassy was also informed about the incident and is investigating.\nA police spokesman on Tuesday confirmed that “the police have received these reports and are investigating what had actually happened to establish the facts”.\nHowever, the spokesman emphasised that “the police officers involved are denying that they beat up the Italian men”, despite the footage suggesting otherwise.\nTruck on fire\nThe Sicilian businessman, Fabrizio Sciré, set up shop in Malta’s construction industry together with his family three years ago. He recounted to Times of Malta that last Saturday night, while at home, a neighbour of his stores in Żebbuġ informed him that one of his construction trucks, parked outside his stores, was on fire.\n“Despite the fact that I had just returned home from undergoing a medical procedure in hospital, I rushed off to the site in my pyjamas, together with my two sons, to find one of my trucks engulfed in flames.”\n“I was desperate and in tears. I asked the police officers, already on site to help me move my other vehicles, which were also in danger of catching fire,” he said.\nAccording to Mr Sciré, for some unknown reason, some of the police officers surrounded him and instead of helping him started pushing him and calling him names.\nOne of the officers started pushing me and punching me violently on the head while other officers joined in\n'They punched me on the head'\n“At that point, one of the officers starting pushing me to the wall and punching me violently on the head while other officers joined in and kicked me in other parts of my body. Another police officer hit me on the head with his radio,” Mr Sciré said.\nHe added that, his eldest son, who was present while the police were beating him, intervened to try to diffuse the situation. \nOne of Fabrizio Sciré’s trucks on fire outside his stores last Saturday before the alleged beating took place.\n“However, one of the officers also started pushing him, held him savagely from his neck and started punching him as well.”\nMr Sciré claimed that even his eight-year-old son was manhandled by the police. However, unlike that aggression on the two men, the video footage does not show any such actions.\nThe Italian businessmen said that the mobile police officers left the scene as soon as police officers from the local police station arrived on site.\nTimes of Malta is informed that an official report alluding to the police brutality was immediately filed, accompanied by medical certificates detailing the blows Mr Sciré and his son allegedly received by police officers.\nAlthough claims of police beatings in Malta are rare, they are not normally accompanied by video footage.\nA similar case hit the headlines in 2007, when a police sergeant was caught on camera kneeing a 56-year-old woman in the chest but the officer was immediately relieved from his official duties by then Police Commissioner John Rizzo.\nThe officer involved was then arraigned in court and charged.", "comment_count": 0, "id": 3215}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Flimkien għal Ambjent Aħjar, which has not officially objected to the Manoel Island development, is backing a group of residents petitioning the government to revoke the mega-project.  \nHowever, the eNGO does not believe that its support of the residents’ cause contradicts its lack of objection.\nThousands have signed a petition to Parliament calling on the government to turn Manoel Island into a wooded park with heritage buildings.\nThe petition was launched by Nħobbu l-Gżira after the Planning Authority board put off a decision on the Midi development on December 20, citing lack of information on building heights and other aspects of the project.\nIn its latest submission to the PA, FAA had not objected to the development but insisted that the terms of the guardianship deed – drawn up by the Manoel Island Foundation – should be respected. \nThis included the principle of low-rise development across the island.\nThe Manoel Island Foundation, which is chaired by Claire Bonello, had been set up by Midi, the Gżira local council and NGOs to find the best compromise going forward. \nFAA is now asking the public to support Nħobbu l-Gżira, which is objecting to the Midi development.\n Asked whether this contradicted the FAA’s submission and its position about the guardianship deed, the eNGO said it had been fighting for the site to be protected and included as a national park since 2016. \nFAA asking the public to support Nħobbu l-Gżira\nThat year, the FAA had proposed the site’s designation as Public Domain.\nFeeling aggrieved by the proposed Master Plan, Gżira residents are again calling for the designation of Manoel Island as a public domain, and of course FAA will support such aims, it said.\n“FAA maintains that its stand on the guardianship does not contradict this recent position, given that our support is aimed to ensure the protection of the public open space as a critical green lung for Gżira, and to ensure that our national cultural heritage is protected and can still be enjoyed by the public,” a spokeswoman told the Times of Malta. \nDr Bonello chaired the Manoel Island Guardianship strictly in her personal capacity and was not representing FAA, she added.\nFAA is asking its supporters to make donations to the cause.\n“If your health and Malta’s heritage is precious to you, we ask you to make a contribution to the Manoel Island Campaign,” they said in a statement.\n“The studies, professional consultants’ fees and media costs are needed to present a strong case at the PA. The costs could not be borne by the small group of campaigners trying to save Manoel Island for you and the rest of Malta.”", "comment_count": 11, "id": 3216}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The parents of a young woman who was killed in a traffic accident three years ago have filed a judicial protest against the undertaker and the authorities after discovering that she was buried in a body bag.\nSalvatore and Josephine Boni, parents of Johanna Boni, called upon the undertaker, Anna Falzon, the CEO of Mater Dei Hospital, the Health Minister and the Permanent Secretary within the Health Ministry to rectify the situation by addressing the “immoral and indecent” manner whereby their only daughter had been laid to rest.\nJohanna Boni died in an accident involving a cement mixer in Labour Avenue, Naxxar on January 5, 2016. The 27-year-old was riding her Kawasaki ER6N to work at the time.\nThe parents explained that when they saw their daughter’s corpse for identification purposes after the accident, they had noted that the body was intact, although it was grazed and bruised and had tyre marks on the back.\nThey had engaged Anna Falzon as undertaker, to ensure that their daughter would be attired in a €500 outfit purposely selected by them for the interment.\nBut three years after the funeral, when the family grave was reopened for the burial of Johanna’s grandfather, they were horrified to find that the outfit had been dumped inside the coffin where their daughter had been placed inside a plastic body bag.\nThe parents insisted that the right to a dignified burial was enshrined in Maltese law which states that “every dead body is to be buried with such covering as decorum and decency require,” a right which had been trampled upon.\nMoreover, the undertaker had gone back on her promise of ensuring that their daughter would be suitably attired for burial, the parents continued.\nIn the light of all this, they called upon the undertaker and relative authorities to redress the situation whilst reserving the right to take further action to safeguard not only their rights and those of their daughter, but also the rights of third parties who may suffer a similar experience.\nLawyers Matthew Paris and Michele Cardinali filed the judicial protest.", "comment_count": 0, "id": 3217}, {"keywords": "", "author": "Keith Micallef", "article_body": "[Editorial note: The information in this article is obsolete. Please click here for the most updated information]\nClose to 6,000 Britons resident in Malta will be losing their right to vote in the forthcoming European Parliament and local council elections as a result of Brexit, the Electoral Commission has confirmed. \nThe UK is set to leave the EU in a month’s time on March 29.\nEarlier this month, the government published a legal notice that will effectively ban  Britons resident in Malta from voting in the forthcoming European and council elections on May 25. \nEU nationals residing on the island are also eligible to vote\nWhile Brexit is not mentioned, the legal notice states that in the event that a state leaves the European Union, the Electoral Commission shall proceed to cancel from the EU electoral register any such persons “who are solely registered in that register by virtue of their being citizens of that state which has ceased to be a member of the EU and this without any further notice or proceedings”.\nA spokesman for the Electoral Commission noted that by law, besides Maltese citizens, EU nationals residing on the island who are listed in the EU electoral register are also eligible to vote in these elections, including local councils.\nMoreover, with the introduction of the rolling register and the amendment of the electoral laws which lowered the voting age from 18 to 16 years, even those who attain or shall attain the age of 16 years up to and including the day preceding the date of the elections, May 24, are entitled to vote.", "comment_count": 50, "id": 3218}]