[{"keywords": "", "author": "Jacob Borg", "article_body": "Opposition leader Adrian Delia on Monday demanded the setting up of an ad-hoc parliamentary committee to analyse and implement the recommendations in the Greco and Venice Commission reports.\nSpeaking during the Greco report debate in Parliament, Dr Delia said the Opposition would be presenting a motion for the setting up of this committee.\nThe committee would be tasked with drawing up a plan within three months about how to implement these recommendations, which would then need to be implemented within six months. Its job was to protect Malta and the Maltese, not the government\nDr Delia said if the government were not willing to show it meant business, then the Opposition would step in to safeguard the country’s reputation and save democracy.\nHe said when it came to the fight against corruption, the PN had always spoken with one voice.\nDr Delia said the Opposition had always defended Malta abroad, but its job was to protect Malta and the Maltese, not the government.\nHe questioned how free Malta was when a journalist was killed for speaking out, and the Attorney General was doing his utmost to prevent the Opposition gaining access to the Egrant report.\nDr Delia said the Prime Minister had promised to eliminate corruption, when in actual fact what he had done was hijack all the institutions.\nHe said the government could never be credible on corruption while it retained Tourism Minister Konrad Mizzi.", "comment_count": 13, "id": 1519}, {"keywords": "", "author": "", "article_body": "More than six tonnes of rubbish were collected in a 24-hour marathon during which two runners covered 126 kilometres to raise awareness on plastic pollution.\nThe initiative, launched by running partners Trudy Kerr and Deborah Gatt, sought to encourage people to collect waste which would otherwise have ended up in the environment and the sea – through a series of long-distance runs around the Maltese islands.\nThe run started Saturday, with the runners stopping along clean-ups organised as part of the event. Over 150 volunteers and 65 runners joined them with some taking part in clean-ups.\nThe two runners undertook the challenge after being inspired by Neil Agius, who swam around all of Malta last summer and urged people to support him by picking up waste.\n“Just pick up rubbish – this is the whole reason we have taken this campaign forward and will continue to do so,” Ms Kerr said.\nThe campaign is not a fundraising venture but targeted to raise awareness\n“Every piece of rubbish makes a difference – whether you are picking it up or disposing of it properly.”\nThere was no participation fee, but participants were asked to collect three pieces of rubbish before submitting their application. Those taking part in the event were also asked to collect another three pieces of rubbish at the end of the run or join one of the eight clean-ups taking place along the route.\n“The campaign is not a fundraising venture but targeted to raise awareness on the irresponsible attitude towards rubbish and, specifically, plastic,” Ms Kerr said.\nMalta is still lagging in dealing with its growing waste problem, statistics show. \nThe country was dubbed “the dirtiest in Europe” by international media after a European Commission report warned Malta is at risk of missing its 2020 municipal waste recycling targets.\nAround eight million metric tons of plastic a year are thrown into the ocean.\nSince the most common pollutants, such as plastic bags, fishing gear and food and beverage containers, never fully degrade in the water, the amount of rubbish in international waters now poses serious risks for the planet.\nConsequently, studies predict fish will become extinct by the year 2050 – only 31 years’ time.\nStatistics reveal just a sliver of Malta’s municipal waste was recycled until 2017 and the amount of rubbish generated by the average citizen shot up after that year.", "comment_count": 13, "id": 1520}, {"keywords": "", "author": "", "article_body": "An Air Malta plane landed safely after it was hit by a bird strike as it approached Lyon’s airport on Monday afternoon.\nThe aircraft, which was transporting passengers on flight KM454 is being serviced by technical personnel in Lyon in liaison with Air Malta’s engineers.\nAs a consequence of the incident, flight KM455 from Lyon to Malta will be delayed.\nOther Air Malta flights may also be impacted, the airline said, adding that it was working hard to minimise any delays as much as possible.\nPassengers are being asked to log on to www.airmalta.com or check www.facebook.com/AirMalta/ for the latest flight information updates.\nBird strikes can damage vehicle components, and potentially injure passengers, especially when flocks of birds hit the aircraft.", "comment_count": 3, "id": 1521}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Magistrates’ Court has declared that there were sufficient grounds to place three teenage migrants, currently accused of hijacking the merchant vessel El Hiblu 1 which had rescued them at sea, under a bill of indictment.\nThe youths, aged 15, 16 and 19, two from Guinea and the other from the Ivory Coast, are currently facing charges amounting to terrorist activity, their alleged acts punishable with a possible jail term of between seven and 30 years.\nThe three are the suspected ringleaders who had hijacked the vessel, forcing it to change route to Malta rather than proceed on its journey to Libya upon realising, at daybreak, that the vessel was approaching the Libyan coast, contrary to what they had been promised.\nDuring last week’s hearings, the court, presided over by magistrate Aaron Bugeja, had heard the Turkish captain of the El Hiblu testify as to how the suspects had behaved aggressively at the helm of a larger group of migrants who had circled the bridge, instructing the captain to “Go Malta!” at full throttle.\nThe El Hiblu 1 was stormed by AFM troops in the early hours of March 28 as it entered Maltese waters.\nAs the case continues, the court ruled, on Monday afternoon, that there was enough evidence for the men to be placed under a bill of indictment.\nInspector Omar Zammit and lawyer Nadia Attard from the Office of the Attorney General are prosecuting. Lawyers Malcolm Mifsud, Cedric Mifsud, Neil Falzon and Gianluca Cappitta are defence counsel.", "comment_count": 0, "id": 1522}, {"keywords": "", "author": "Jacob Borg", "article_body": "Updated 7.20pm with Simon Busuttil speech\nPrime Minister Joseph Muscat on Monday said criticism levelled at the country by the Council of Europe’s Group of States against Corruption (Greco) was partly a direct result of the “irresponsible way” the Opposition had portrayed Malta in international fora over the past years.\nGreco warned in its April report that Malta’s criminal justice system is at risk of paralysis unless a redistribution of responsibilities between the police, the Attorney General’s office and inquiring magistrates took place.\nRead: Criminal justice system ‘at risk of paralysis’, watchdog report warns\nAddressing a parliamentary debate about the Greco report, Dr Muscat said the government would be looking at the report objectively.\nHe said the report would be accepted constructively and the government would not attack or undermine those who compiled such reports.\nDr Muscat said years ago, one of the most quoted Greco reports was when they said Malta’s judiciary resembled a family jamboree.\nThe Prime Minister said much of the Greco report was based on open sources like media reports, which were “rightly or wrongly” taken as facts.\nHe said that objectively speaking, it needed to be recognised that transnational institutions gave more weight to what was said by civil society than the government.\nDr Muscat appeared to take a veiled pot-shot at Dutch MP Pieter Omtzigt. Mr Omtzigt has been tasked by the Council of Europe with drawing up a report about the assassination of journalist Daphne Caruana Galizia as well as the various corruption allegations being faced by the government.\nHe said it was clear that certain Council of Europe rapporteurs had clear agendas. The Prime Minister said one could easily see from what they said on Twitter where they were heading with their conclusions.\nDr Muscat mocked a recent statement by the PN distancing itself from an appeal by Greens MEP Sven Giegold for Article 7 proceedings against Malta. Article 7 empowers the EU to suspend certain rights from member states that did not respect the EU’s common values.\nHe said that if the arguments being fed to this MEP by certain members of the Opposition were true, then it was obvious that Article 7 action would need to be taken against Malta given the skewed portrayal.\nDr Muscat said the PN’s statement dissociating itself with Mr Giegold’s statement was an acknowledgment that the propaganda being pushed by some of its member was untrue.\n“The Opposition is rejecting arguments pushed by some of its exponents”, Dr Muscat said.\nHe said the media was very powerful and was free to say what it wanted, which was a good thing.\nThe Prime Minister said Malta had been portrayed as a dysfunctional democracy where no one was free to speak, with a despotic and dysfunctional judiciary.\nHe said Malta was made out to be a country where a court decision declaring the Opposition deserved two extra seats in Parliament would be ignored by the government.\nDr Muscat said this in reference to a 2016 Constitutional Court decision granting the PN two extra seats during the last legislature due to a mistake made in the vote counting process.\nThe Prime Minister said he had held back from criticising the Court’s decision. He warned that the judgment would one day lead to political responsibility. Dr Muscat said it had opened up a Pandora’s box which would one day create pandemonium.\nMuscat has been chipping away at Malta’s democracy since 2013\nFormer Opposition leader Simon Busuttil accused the Prime Minister of having worked at chipping away at Malta’s democracy from the very day he was sworn in.\nDr Busuttil questioned how institutions left by the British many years ago had only become paralysed under Joseph Muscat. He said the Greco report was one of many that had concluded the law in Malta was not being applied to everyone.\nDr Busuttil said the point that had been made by the PN for many years was also being made in these reports.\nThe PN MP said the government blamed everyone but itself for the failures being identified in the Greco report.\nHe said the country’s institutions, left by the British, had worked under successive government, be they Nationalist or Labour. It was Joseph Muscat who had paralysed them, he accused.\nDr Busuttil said the Greco report concluded the country’s institutions had failed the crucial test of acting against those implicated in high-level corruption.\nHe said these same institutions depended on the government for appointments and promotions.\nHe added that even the best Constitution was worthless when faced with a corrupt government that did not allow it to work.", "comment_count": 175, "id": 1523}, {"keywords": "", "author": "", "article_body": "A story published in the Nationalist Party's Sunday paper is \"untrue and dishonest\", the managing director of Allied Newspapers Ltd charged on Monday.  \nAllied Newspapers Limited firmly rebutted a series of allegations made on Sunday by the PN's media arm Media.Link Communications through a story entitled 'Times of Malta deeply indebted with Keith Schembri'.\n“What is being alleged in the story is full of fabrication and speculation. It is untrue and dishonest. It is indeed a shame that Media.Link Communications do not get their facts right and carry out acts of retaliation on the independent and investigative journalism of the Times of Malta,” said Allied Newspapers Managing Director, Michel Rizzo.Acts of retaliation on the independent and investigative journalism of the Times of Malta- Michel Rizzo\nA report in Il-Mument claimed that Allied Newspapers Ltd was indebted to Keith Schembri, the chief of staff at the Office of the Prime Minister, because he was owed massive sums of money.\nMr Schembri is the owner of the Kasco Group, Malta’s leading distributor of paper and printing equipment.\nIl-Mument also sent questions to a Times of Malta journalist asking him to divulge details of his work, including the sources he meets.\nThe claims made in the report came just days after The Sunday Times of Malta divulged details of a meeting between two PN MPs and Yorgen Fenech, the businessman behind the secret company 17 Black. \nAn editorial in Monday's Times of Malta said the PN fails to understand the difference between a private company and a political party and makes no distinction between the independent media and propaganda arms.\nRead: Editorial - The PN vs the free press", "comment_count": 21, "id": 1524}, {"keywords": "", "author": "Jacob Borg", "article_body": "Infrastructure Minister Ian Borg on Monday urged local councils not to abdicate their responsibilities when it came to carrying out general road maintenance.\nHe said the €700 million budgeted to repave Malta’s roads did not mean local councils were exonerated from carrying out such maintenance.\nInfrastructure Malta announced on Monday that it had started extensive works on several streets in the Buġibba/Qawra area.\nSpeaking in Parliament, Minister Borg said the St Paul’s Bay council was not functioning. He said councillors there had apparently decided not to carry out any capital expenditure in the locality.\nDr Borg said the total abandon in the area was what led Infrastructure Malta to intervene by carrying out urgent works.\nHe said the government would be repaving all roads, but until that was done, local councils were still responsible for maintaining them.\nDr Borg said that while the paving of roads had been centralised, works were still carried out in coordination with local councils, as councillors were often best placed to identify which roads required urgent attention.", "comment_count": 11, "id": 1525}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A married man who moved out of the matrimonial home after his marriage ended on the rocks, is calling for the revocation of a temporary protection order, claiming it breached his fundamental rights.\nAbdusalem Moamer Mohammed filed a constitutional application before the First Hall, Civil Court, challenging the constitutionality of the temporary order issued by a Magistrates’ Court barring him from approaching his estranged wife, a fellow national he had married in Tripoli six years ago.\nThe couple had settled down in Malta and had a daughter, born in 2015, before their relationship took a downward turn owing to marked differences of character between the two, with the wife’s family branding the applicant as “not a good Muslim” on account of his lifestyle.\nAs the character divergences became increasingly pronounced, the husband moved out of his family home without, however, wanting to sever all contact with his wife and four-year old daughter.\nShortly after the move, the woman changed her mobile numbers and also relocated to a different address without informing her husband of her whereabouts, leaving him with no point of contact save for her father who repeatedly told his in-law to “change course” and live as a “good Muslim” if he ever hoped to see his daughter again.\nA visit to his wife’s new address proved futile, with the woman refusing to answer the intercom. During a second visit, the man managed to reach the apartment door since the common entrance was open. However, a knock at his wife’s door had soon brought along two policemen who, after speaking to his wife, told him to leave.\nA visit to the school attended by his daughter likewise proved useless.\nIn spite of presenting documents proving his paternity and telling school authorities that the girl had been registered at the school without his signature, the father’s queries went unanswered and he ended up leaving the institution even more greatly puzzled than before.\nMan was prohibited from approaching his wife\nLater that same evening, he received a call summoning him to the nearest police station where, upon his arrival, the man was informed of a temporary protection order issued by a Magistrates’ Court prohibiting him from approaching, harassing or in any way contacting his estranged wife.\nThe order was to remain effective until it was decided whether criminal proceedings were to be instituted in his regard, exposing him to a possible maximum fine of €7,000 if he were to violate that court order.\nUp to this present day, the man had no clue as to the contents of the report which sparked off police action against him, nor was he aware of the alleged wrongdoing meriting such a temporary protection order in favour of his wife.\nThe order made reference to an application filed by a police inspector, the man explained. Yet neither the inspector, nor any other police officer had spoken to him about the report allegedly filed by his wife.\nIn the light of all this, the man claimed that such a procedure breached his right to a fair hearing as envisaged under article 39 of the Constitution since his version of events had not been sought.\nNeither the police, nor the “trained professional” making the risk assessment which led to the issue of the temporary protection order and not even the duty Magistrate shouldering responsibility for such order, had heard his version of events.\nFor this reason the man called upon the First Hall, Civil Court in its Constitutional Jurisdiction to declare as unconstitutional article 540A of the Criminal Court under which such temporary protection order had been issued.\nFurthermore, he asked the court to declare that his right to family life and to an effective remedy had been breached by such order which the applicant requested the court to revoke and to provide for necessary measures accordingly.\nLawyers Jason Azzopardi, Kris Busietta and Julian Farrugia signed the application.", "comment_count": 0, "id": 1526}, {"keywords": "", "author": "Keith Micallef", "article_body": "Close to 3,000 drug offenders have appeared before a justice tribunal rather than a court and were given the chance to reform themselves as a result of the drug laws reform enacted four years ago.\nUnder this system, those charged with simple possession - the term used in those cases whereby the amounts of drugs found is for personal use and not for traffic - are not charged in court but before a commissioner of justice. In case of guilt, the offender may be fined up to €125, but the conviction is not listed on his or her criminal record.\nJustice Minister Owen Bonnici on Monday addressed a news conference during which he gave a statistical analysis of this reform rolled out in 2015. He said that the ultimate objective was to give “genuine drug offenders” the chance to make a new start and get rid of their addiction. He noted that prior to this reform even a conviction for simple possession would tarnish one’s criminal record.\nIt transpires that till the end of last year, 2,710 drug offenders appeared before this tribunal presided by Vicky Scicluna, who is not a lawyer but a social worker. Of this total, 878 were foreigners.\nDr Bonnici noted that, in line with the law, those convicted twice by this tribunal in the space of two years would be referred to experts in a bid to overcome their addiction.\nFrom 2015 till the end of last year, there have been 134 referrals of whom 88 were from the tribunal and the rest from the law courts. In the latter case, the offenders were charged over aggravated possession (quantities above the personal use threshold) and those accused of trafficking but only to finance their addiction.\nThe Justice Minister noted that 50 of these 134 offenders beat their addiction. Furthermore, there were three cases in which the rehabilitation was so successful that the offenders were handed a suspended sentence or a fine instead of a jail term.", "comment_count": 1, "id": 1527}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two of the alleged murderers of Daphne Caruana Galizia have been granted bail in money laundering proceedings but they will still remain behind bars, having been repeatedly denied bail in the murder case.  \nMr Justice Giovanni Grixti observed that the bail application filed by the co-accused brothers George and Alfred Degiorgio on March 29 merited being upheld since all the prosecution witnesses had testified in the compilation proceedings still ongoing before the Magistrates’ Court.\nMr Justice Grixti said the Attorney General’s preoccupation as to the untrustworthiness of the accused needed to be supported by a degree of evidence, even to a minimum degree.\nGeorge Degiorgio’s partner, Anca Adelina Pop, had been granted bail in the same proceedings in July.\nThe two Degiorgio brothers and Ms Pop had all allegedly lived a lavish lifestyle, owning cars and pleasure boats, while claiming to be unemployed, the court has heard.\nThe investigation into Ms Caruana Galizia’s murder, involving scrutiny of the accused's banking transactions and the money they had, had sparked off the suspicions of their involvement in money laundering activities.\nThe Degiorgio brothers were granted bail by the magistrates' court in October but that was revoked by the Criminal Court, presided over by Madam Justice Edwina Grima, in November. \nFollowing a fresh request for bail, the criminal court said the aim of preventive arrest had been exhausted, pointing out that the granting of bail was to rest upon the balancing of the rights of society in general against those of the persons being held under preventive arrest.\nIn the light of such considerations, the court concluded that the accused no longer needed to be held in custody, thereby granting them bail against a deposit of €35,000 each, a personal guarantee of €35,000 each, as well as a duty to sign the bail book twice daily.\nThe court further imposed upon each of the brothers a curfew between 10pm and 7am and an order not to step aboard any sea or aircraft.", "comment_count": 0, "id": 1528}, {"keywords": "", "author": "", "article_body": "Infrastructure Malta has started extensive works on several streets in the Buġibba/Qawra area after blaming the council for their extensive deterioration.\nThe agency said works are being carried out at  Triq Isourd, Triq Toni Bajada, Triq Ċensu Tanti, Triq iċ-Ċagħaq, Triq l-Ibħra, Triq il-Ġifen, Triq Sant’ Antnin, Triq il-Ħalel, Triq iċ-Ċern, Triq is-Sajjieda, Triq J. Quintinus, Triq Annetto Caruana, Triq il-Port Ruman, Triq il-Maskli, Triq l-Imħar, Dawret il-Gżejjer and Triq ir-Ramel.\nWorks are also underway at Triq il-Luzzu, Triq it-Turisti and Triq Għawdex, which will be followed by Triq San Pawl.  \nThe programme of works will eventually also include Triq Ibħra, Triq il-Mistrieħ, Triq Annetto Caruana, Triq Paderborn and Triq Sir Luigi Preziosi. \nInfrastructure Malta said that such was the state of these roads that any further delays in getting them up to standard could not be tolerated. ", "comment_count": 19, "id": 1529}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Infrastructure Malta has scrapped plans by the St Julian’s council to embellish Spinola Square and has begun its own project which it aims to complete by summer.\nThe roads agency said the council’s plans would have created more traffic and congestion so it decided to go ahead with its own project, which it hopes will improve traffic flow.\nThe plan supersedes the project discussed and approved by the council which aimed to create more open space and to pedestrianise a substantial part of the square where double parking is the order of the day. But the Infrastructure Malta plan did away with the pedestrianisation and instead created an upgrade to the junction which it says would improve safety and efficiency.\nA spokesman for the agency said that the Spinola junction was a crucial node of the Maltese road network, connecting the main north to south arterial route. The current layout of this junction is not only causing unnecessary travel time delays, but is also a major accident risk due to several unsafe road crossings, he added.\n“Through the ongoing upgrade, which will be completed before summer 2019, the traffic capacity and efficiency at this intersection is being increased to reduce travel times to and from different nearby residential and entertainment areas, including St Julian’s, Paceville and Sliema.\nAn artist's impression of the council's proposed Spinola project.\n“This project also forms part of the preparations for a more extensive long-term plan that Infrastructure Malta is preparing for the Madliena, Pembroke, Swieqi, St Julian’s, Paceville and the Sliema conurbation’s road network, and which also includes the upgrading of Triq Sant’ Andrija along the TEN-T route. Details of these plans will be announced soon,” the spokesman said.    \nThe project will also see several underground network upgrades requested by the utilities, improvements to the area’s storm water systems as well as safer bus lay-bys for easier access to the public transport service and the re-organisation of parking bays.\nThe spokesman said that the project was discussed with the local council but at no point was the council’s pedestrianisation proposal ever mentioned.\n“While the local council had long been aware of Infrastructure Malta’s plans, it failed to inform the agency about its proposals before its plans were presented to the Planning Authority,” the spokesman said when asked to explain why the council’s proposal had been trashed.\nAccording to the agency’s road planners, the council’s proposal would have had a devastating effect on the road network, with the overspill onto adjoining neighbourhoods and an adverse traffic impact.\nRead: Spinola's 'eyesore' to get a makeover\nEfforts to contact St Julian’s mayor Guido Dalli proved futile. \nAccording to Infrastructure Malta’s plans obtained by the Times of Malta, drivers would need to go around the Sacred Heart roundabout, one side of which will become a parking area for nine cars.\nDrivers coming from Balluta will have to turn down and go around the Sacred Heart monument if they want to keep driving up towards Paceville.\nThe road near Tex Mex will become one-way going down while the parking areas in front of the St Julian’s police station and adjacent restaurants will be removed.", "comment_count": 14, "id": 1530}, {"keywords": "", "author": "", "article_body": "The number of passengers using the Gozo ferries rose by 2.3 per cent to 1,146,490 during the first quarter of the year compared to the same three months last year.\nThe highest number of passengers was recorded in March - 477,945 or 41.7 per cent of the total for the quarter.\nThe number of vehicles on the ferries increased by 7.1 per cent to 363,460.\nThere were 5,449 ferry crossings, an increase of 3.6 per cent over the same period in 2018.\nThe majority of trips took place in March - 2,034 or 37.3 per cent of total trips for the quarter.\nPassenger traffic from Ċirkewwa was busiest on Fridays and Saturdays whereas the highest numbers from Mġarr were recorded on Sundays and Saturdays.", "comment_count": 19, "id": 1531}, {"keywords": "", "author": "Edwina Brincat, Philip Leone-Ganado", "article_body": "Joseph Bonnici, who is accused of murdering his mother and sister in Għaxaq last month, faced the court again on Monday as the compilation of evidence against him continued.\nWhat emerged on Monday:\n\nFollowing the murder, the accused visited his mother’s house with an aunt after his father, currently serving a prison sentence for murder, grew concerned that nobody was picking up the phone.\nThree aunts described the accused as a good, hardworking man, who had never given any of them cause for suspicion.\nOne aunt says she was aware that the accused's sister had claimed sexual abuse by her brother, mentioned in a previous hearing, but did not believe them. She said the sister's \"personal life\" indicated otherwise, before the hearing briefly continued behind closed doors. \nThe aunt painted a dark picture of the accused's mother, describing herself as the mother's \"first victim\". She said the mother had expressed concern over her husband's release from prison, saying she had become used to living alone.\n\nAs it happened:\n12.05pm: Back inside, the same aunt is being cross-examined by defence lawyer Franco Debono. The woman says that she doesn’t meet the accused, her nephew, frequently but the two regularly communicate on Facebook. He had even offered to help her in separate court proceedings where she was the victim. She says she had recently spoken to the accused's mother, who said she did not know what she was going to do when her husband, the accused's father, left prison \"because she had got used to living alone\". \nThe case has been adjourned until Tuesday at 11am.\n12pm: The accused's aunt says Angele Bonnici - the accused's sister and one of his victims - had spoken to her about her sexual life some five years ago, and that she had never claimed any sexual affairs with her brother. This is in reference to reports by a police inspector in the last hearing, that Angele had spoken of having been sexually abused by her brother in the past.\nThe aunt says some two years ago, Angele had spoken of trouble with Joseph because he had denied her a favour. The witness says Angele had mentioned sexual abuse as though to strengthen her argument, but the witness says she didn't believe her. \"Her personal life indicated otherwise.\" \nShe is reluctant to continue further in open court. The magistrate orders everyone to leave the courtroom so that the testimony can continue behind closed doors.\n11.55am: A third aunt is now testifying. She says she knew the accused's mother in the early days of her marriage: \"I was her first victim\" she says. The accused's mother, she continues, \"caused trouble\" between her, her boyfriend, and her own mother. \n11.50am: Another aunt, also an Għaxaq resident, now takes the stand. She chooses to testify too. \"He is a quiet boy, loved by all of us,\" she says. \"None of us ever had a reason to suspect him.\" When his mother and sister disappeared they did not think anything was wrong. Neither this witness nor the first could say nothing about the accused’s relationship with his mother and sister.\n11.45am: The aunt describes her nephew as a \"very good boy\". She says he was silent and hardworking and would always greet her on his way past her home. \"Would I have gone into the house with him alone if I suspected anything? I would have thought he might have done the same to me.\" The accused seems moved as his aunt says she never had any reason whatsoever to doubt him.\nJoseph Bonnici admitted to killing his mother, Maria Lourdes (left), and his sister Angele Bonnici.\n11.40am: The accused's aunt says she had received a call from her brother in prison, asking her to go ring the door of the Għaxaq family home, because he had been calling and received no reply. She knocked on the door but nobody answered. Later in the day, she received a call from a police officer at the prison, again asking her to check the home. She said that perhaps the family had gone to the hospital or out elsewhere.\nHer nephew, the accused, turned up later and asked her to accompany him to enter his mother’s house. He needed to remove a stone slab to enter, and said he didn't want his mother to think he was burgling her. He said he loved his mother, but broke off mid-sentence. \n11.35am: The accused's aunt - the sister of his father Paul Bonnici, currently serving his own prison sentence for double murder - is next to the stand. She has chosen to testify even though she was given the option not to, and identifies her nephew in the courtroom. \n11.30am: Three more police officers have taken the stand in quick succession. One was tasked with searching for the sledgehammer that the accused used in his sister's murder, which he found after sifting through waste at the Ħal Far Wasteserv plant. \n11.25am: The police sergeant says he also accompanied the accused to another field he owned - the one in which the bodies were buried was not his own - and to his Għaxaq home. He is asked about the field where the bodies were found: it is state property currently held under ground rent by a farmer who granted the local band club the right to use it to launch fireworks. \n11.20am: An autopsy was performed later that same day: the accused's sister, Angele Bonnici, had two bullets inside her head and facial injuries, while his mother, Maria Lourdes, had entry and exit wounds on her head and facial injuries. This tallies with details of the murders - carried out with a firearm and large sledgehammer - given in last week's hearing. \n11.15am: First to testify is a police sergeant from the Criminal Investigation Department. He says he was called to the Floriana police depot at 1am on March 30, after Bonnici admitted to the murder. He went to the field where the bodies were buried, and found the forensic team already at work, and the corpses close to a small room and by a rubble wall. The bodies were taken to a mortuary in a police hearse.\n11.10am: The accused, Joseph Bonnici, has just been accompanied into the courtroom. He is smartly dressed, in contrast to the tracksuit he wore for his last appearance. Lawyers Franco Debono and Marion Camilleri are appearing for the accused. We are expecting to hear from a number of police officers involved in the case. \nWhat we know so far:\nThe 38-year-old has admitted to murdering the two women on March 26 and burying their bodies in a field.\nAt the last hearing on April 8, prosecutors said Mr Bonnici had planned the crime down to the very last detail, building his own makeshift gun and buying a pressure washer to clean up the mess.\nThe court heard details of the gruesome murders and the accused's efforts to cover his tracks, before he admitted to his crimes under police interrogation. \nInvestigators say Mr Bonnici had long harboured resentment against his two relatives, blaming his mother for having needled their father into killing two of their neighbours more than a decade ago and suspecting that his sister was plotting to have him sent to jail.", "comment_count": 0, "id": 1532}, {"keywords": "", "author": "Ivan Martin", "article_body": "None of the weekend’s traffic collisions had anything to do with ongoing roadworks, Transport Minister Ian Borg said on Monday.\nAddressing a business breakfast on roads overhaul, Dr Borg weighed in on the roadside fatalities over the weekend, urging motorists to be responsible.\n“I want to stress that none of the incidents reported this weekend were linked to ongoing roadworks. My appeal is that everyone on the roads must be responsible. We risk not just our own lives, but those of other drivers on the road,” he said, adding that magisterial inquiries were establishing the facts of the cases.\nThe minister was speaking hours after a horrific accident between Mosta and Mġarr claimed the lives of two women and left seven others injured. One of the cars ended up in a ditch recently dug up as part of the road-widening project in the area.\nSpeaking to Times of Malta, Dr Borg said he wanted to be “prudent” and respect the families of those who had been injured or lost their lives.\nThere were some, he said, who on social media had tried to link the incidents to the roadworks currently ongoing across the island. \n“I am informed that there was no link to the roadworks as this was a head on collision,” he said, adding that the incidents should serve as an “eye opener” for motorists about the dangers they faced on the road. \nHe later declined to delve into further detail, citing ongoing magisterial inquiries, but added that his position was based on information passed on to him by those on site.\n\nOne of the cars involved in Sunday evening's accident was carrying six people and appeared to be on the wrong side of the road, although it was not clear whether that was a result of the impact. \nA Ferrari sports car also ended up in the same ditch a few metres away on Saturday morning.\nA young woman died in Paola on Saturday night when she was hit by a truck after falling off a motorcycle late.\nSunday night's fatal accident took place at the site of current roadworks. Photo: Mark Zammit Cordina\n ", "comment_count": 264, "id": 1533}, {"keywords": "", "author": "Ivan Martin", "article_body": "Seven major roadworks projects currently underway will save Maltese drivers 5 million hours on the road every year once completed, a government-commissioned study has found.\nThe economic impact study found this translated to 12 more minutes of leisure time for every driver every week.\nConducted by economist Gordon Cordina, the study looked at the collective impacts of the Tal-Balal, St Andrew's, Central Link, Marsa- Ħamrun bypass, Triq Buqana, Marsa junction, and Sta Lucija tunnel projects.\nDr Cordina said the projects would lead to 18 million more working hours for the Maltese workforce.\nThis translated to an average of around €75 worth of more working time for every single worker in Malta.\n\nMajor cuts in carbon emissions\nGoing over the findings of the study at a business business breakfast, Dr Cordina said the projects, which amount to some 20 per cent of the government’s total planned spend on roads, would lead to around 62,000 tones less carbon emissions annually.\nThis was around a tenth of the annual emissions for electricity generation, and would offset the consumption of some 55,000 households.\nPutting the emissions cut into perspective, Dr Cordina said the savings of 62,000 tones was also roughly the same as that garnered from the country’s entire stock of solar panels.\nFor every €1 invested in these seven road projects, the “economic well-being” of the country increased by €6.95 through the use of new infrastructure.\nTherefore, from the total €141 million being invested in the roadworks, the country would get back €1.2 billion in a wide range of tangible benefits.\nThese included saving in travel times, emissions, public health spending and maintenance to damage to cars, as well as fuel costs savings.\nMotorists will save around €75 every year in fuel costs, the study said.\nA 2012 report by the European Commission had found that by next year traffic congestion would cost Malta a staggering €275 million annually.\nConcluding, Dr Cordina recommended that government put the savings generated from these projects into a national fund, that could once again be invested in further improvements.\nThe conference is ongoing. More to follow.\n ", "comment_count": 65, "id": 1534}, {"keywords": "", "author": "", "article_body": "Two persons were hospitalised after a four-car collision on the Birkirkara bypass early on Monday.\nA 26-year-old from Balzan and a 48-year-old from Marsascala were injured in the crash, just before 8am.\nThe drivers of the other two vehicles were unhurt ", "comment_count": 4, "id": 1535}, {"keywords": "", "author": "", "article_body": "Crew members of an NGO ship which rescued 64 migrants off Libya have been refused permission to disembark in Malta.\nThe migrants on board the German-registered MV Alan Kurdi were transferred to Malta by patrol boats from the edge of territorial waters on Saturday, almost two weeks after their rescue. They will be distributed among four countries.\nRead: Stranded for 11 days, migrants finally reach land\nThe Sea-Eye organisation, which operates the ship said members of the crew had been denied permission to also come to Malta, in what it described as 'chicanery'.\n\"The joy about the completed rescue of the people with whom the crew of the Alan Kurdi spent so many days was quickly overshadowed by the decision of Malta to deny the crew entry,\" Sea Eye said.\nIt recalled that in January, Malta refused the Alan Kurdi an exchange of the crew. However, the volunteer crew was allowed to leave the ship. Now it was acting 'even harder'.\n\"Formally one can do nothing against Sea-Eye and our ship. If Malta applies such measures, then one must speak clearly of chicanery,\" said Gorden Isler, chairman of Sea-Eye.\n\"Most crew members are voluntarily on board. At home, family and professional obligations await parts of the Sea-Eye crew. The concerned mother of a crew member speaks of a violation of her daughter's rights and will turn to the Situation Centre of the Federal Foreign Office. The crew members are angry and severely disappointed.\n\"We cannot force Malta to let our crew members ashore. We condemn the abuse of state power and the illegal restriction of the freedom of our crew members, who at last risked their own health to save lives,\" Isler continued.\nThe Alan Kurdi is now heading for Spain where it will undergo a refit and the organisation intends to return to the sea as soon as possible.\n\"There is an imminent war in Libya. Soon even Libyans could get on rubber dinghies to get to safety in Europe. A humanitarian disaster and further devastating losses of human lives are to be expected.\"", "comment_count": 0, "id": 1536}, {"keywords": "", "author": "", "article_body": "Customs inspectors on Sunday seized 76 packets of cocaine weighing 91.2kg with a street value of €10.3 million.\nThe drugs were hidden in three containers at Malta Freeport.\nThe discovery raised the amount of drugs seized by inspectors so far this year to 606.45kg of cocaine, worth €68.2 million.\nSunday's discovery followed that on the previous Tuesday when 24kg were found. \nThe Customs Department explained how, early on Sunday, the Customs Container Monitoring Unit selected several containers for scanning. Following preliminary scans, irregularities in three of the reefer containers were noticed, which, pointed to narcotics hidden in the refrigerant compressor unit. A physical search confirmed the preliminary suspicions. \nThe operation continued until early on Monday.\nTwo of the containers had been shipped to Malta from South America, en-route to Durres, in Albania, while the other container, which also originated from South America, was on its way to Thessaloniki, in Greece.\nThe police are conducting investigations, A magisterial inquiry is under way.  ", "comment_count": 0, "id": 1537}, {"keywords": "", "author": "", "article_body": "Authorities have studied the set-up of economic crime fighting institutions in the United Kingdom and Italy to see whether the models can be replicated in Malta.\n“At the moment we have stand-alone institutions [such as the Financial Intelligence Analysis Unit],” Finance Minister Edward Scicluna said.\n“We have looked at the UK and discussed with the officials there since they have a different set-up. Italy have got the Guardia di Finanze, for instance,” Prof. Scicluna said.\n“We are looking at the whole institutional set-up for fighting economic crime.\n“If there are changes which are required or new institutions which need to be set up, we will consider them,” he added.\nThe fact we took action will put us in their good books\nThe Finance Minister was speaking following reports by The Sunday Times of Malta that the country’s anti-money laundering regime received a poor grade in a draft Moneyval evaluation.\nThe Committee of Experts on the Evaluation of Anti-Money Laundering Measures and the Financing of Terrorism, known as Moneyval for short, failed Malta in its interim draft evaluation of the country’s action in complying with rigid legislation.\nThe Finance Minister said authorities such as Moneyval and the European Banking Authority were pleased with the way Maltese authorities handled “scandals”.\n“In the case of Satabank, for Moneyval and the EBA it was good that we caught them and took action. They are not going to be scandalised because it happened,” he said.\nBillions of euros in suspicious transactions through Satabank created concerns that led to 12,000 accounts being frozen by the Malta Financial Services Authority.\n“The fact we took action will put us in their good books,” he said.\nForeign institutions, he insisted, wanted to see that local institutions were working. “They are asking: where is the beef,” Prof. Scicluna said.\nHe played down concerns about the Moneyval score, insisting that “rather than looking at the score”, one had to look at the progress made in strengthening institutions.\nHowever, he admitted, there were “areas where we have to show more effectiveness”. Some institutions, such as the Customs Department, were “giving a good show”, he said, but others not.\nAsked whether he was concerned that Malta would be able to push up its score before the summer deadline, Prof. Scicluna said he could not answer the question.\n“I can’t reply to that question because it depends on Moneyval, but one has to look at things as a whole,” he said.", "comment_count": 31, "id": 1538}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Monday.\nTimes of Malta leads with a rally held by anti-abortion activists who insisted abortion must be taken off the political table. It also reports how some 50 migrants were found living in cramped conditions in an apartment block in Qormi.\nThe Malta Independent highlights claims that boats carrying weapons to Libya are passing through Malta. \nIn-Nazzjon leads with remarks by PN leader Adrian Delia who said Malta has a socialist government which hides the interests of the few against the interests of the many. \nl-orizzont quotes Prime Minister Joseph Muscat saying foreigners were helping to create jobs for the Maltese. ", "comment_count": 0, "id": 1539}, {"keywords": "", "author": "Denise Grech ", "article_body": "Birżebbuġa primary school has reported a case of scabies. The Education Ministry confirmed it was following up the case, along with the Health Ministry. \n“When a child or educator is confirmed to have scabies, the Infectious Disease Prevention and Control Unit will provide treatment to the confirmed case as well as prophylaxis to the immediate family members,” a spokeswoman for the Education Ministry said.\nThe child or educator would only return to school or work once given clearance by the health authorities, the spokeswoman said.\nParents were warned of the case last week following the case, the Education Ministry said.\nScabies disease can be spread indirectly\nA case of scabies had been reported last year at the San Ġorg Preca primary school in Ħamrun, with authorities saying they had taken the necessary precautions and interventions according to procedures.\nScabies is an itchy skin condition caused by a tiny burrowing mite. Intense itching occurs in the area where the mite burrows. \nThe condition is contagious and can spread quickly through close physical contact in a family, child care group, school class, nursing home or prison. Scabies can also be spread indirectly by sharing articles such as clothing, towels, or bedding used by an infected person. \nBecause scabies is so contagious, doctors often recommend treatment for entire families or contact groups. Infants and very young children are usually affected in the head, face, neck, palms and soles but adults and older children could have different patterns.", "comment_count": 0, "id": 1540}, {"keywords": "", "author": "Ramona Depares", "article_body": "As Valletta mayor Christian Micallef enters his fourth month at the helm of the local council, he shares his vision for tackling problem areas that create tensions between residents and business-owners. Interview by Ramona Depares.\nOn Monday, it will be three months to the day since you were appointed mayor of Valletta following Alexiei Dingli’s resignation. What were your priorities then, and how has being in the hot seat helped them evolve?\nWhen you’re a councillor, deputy mayor, or even just a candidate, you have full faith that you’ll manage to turn the entire system on its head. Enthusiasm is in overdrive and you believe you can solve all problems. Then you get appointed and you’re faced with practical realities; you realise that you need to be very creative in order to reach maximum efficiency.\nHaving served as deputy mayor prior to taking on this responsibility, I was lucky as I already had a good pulse on the most urgent issues. I hit the ground running.\nI’ve learnt quite a few things in these past few months, one of the most important lessons possibly being that when the budget from central government is not enough for all the projects that I planned, it does not mean I give up. It simply means that I have to think out of the box.\nWhat does ‘thinking out of the box’ entail?\nI create initiatives to generate money for the locality. I am a firm believer in working with the private sector without, of course, compromising one’s political position.\nNowadays, most serious companies have a functional Corporate Social Responsibility programme and are happy to take on board worthwhile initiatives that benefit a community.\nI’ll give you one example – not too long ago the council managed to introduce a system whereby elderly Valletta residents are offered free transport around the city itself and to certain landmark destinations such as the Floriana polyclinic and Mater Dei. (See sidebar)\nThe initiative came from the council, it is not something that government had allocated any funding for. Had we waited until official funding came along, the whole thing would never have gotten off the ground. Instead, we held talks with a private company, who have offered us two vehicles as part of their CSR programme.\nThis is the way to get finances, by creating initiatives for the good of the locality itself and the residents and roping in the private sector.\nI don’t believe in being a passive mayor. If there isn’t any money for something that will be of benefit to the residents, then I try to find it. This is what I mean by thinking outside the box.\nWhat has been your plan of action since your appointment?\nI was appointed at a strange time, about four months before local council elections take place. Because of this, it would be presumptions of me to initiate a list of new projects immediately. Being an efficient mayor also involves keeping your feet on the ground. At this stage, I took stock of what my predecessor was doing and developed on that, at least until the elections are over.\nMy first priority remains the residents’ well-being, and that is where I am devoting my efforts at the moment, particularly with respect to some areas where a number of residents may have been feeling that the council was out of touch. I don’t want to bring the residents closer to the council, but vice-versa. It is the council that needs to reach out to the residents.\nOne topic that has become a bone of contention with residents is the re-opening of the old market on Merchant’s Street. Many feel that the landmark building – which was considered quite a focal point within the community before it closed down – has been transformed into a purely commercial entity that does not cater for the homegrown community. What are your thoughts about this?\nThis question brings me back to the topic of CSR. Yes, I am aware that a portion of residents were not happy with the way the building is being repurposed. However, the council recently held a very productive meeting, and a series of events that have the community at heart are being organised.\nThe council needs to regain control of the warden system\nWe’ve already held a very popular event where primary schoolchildren spent a morning preparing figolli with the staff from the market, and the response was very encouraging. It was very hands-on, and there was much laughter involved, as you can imagine.\nThere are plans for other events, including some that will focus on the elderly residents. It is important to include  the community even in the commercial aspect, and CSR helps a lot with this.\nAnother bone of contention is the wardens system, which now no longer falls within the remit of the councils but is operated and controlled by LESA. Residents complain that the new system is more focused on generating revenue through fines than on ensuring residents’ wellbeing. What is your position as mayor?\nNo-one knows the problems of a locality better than the council of that locality. Before the system was privatised, we’d be aware of specific hotspots and we would set stronger surveillance and, if necessary take action.\nToday, fines are issued but this does not benefit residents at all. For starters, the revenue from these fines now goes to LESA, not to the council. When you impose a hefty fine on a resident, you cannot even put it in a fund that will be used to benefit the locality, including that same resident.\nThe council needs to regain control of the system. I’ll give you an example to explain why the current one doesn’t work: let’s say that the warden shows up and finds a resident’s car parked on yellow lines, but not blocking anyone. The resident is fined. However, the car in the green box that is reserved for residents remains parked with impunity and no fine is imposed.\nIt is easy to see where the injustice lies. Both are in the wrong, of course. But the warden fails to consider that the resident may have returned from a long day at work, late in the evening, to find all the residents’ parking spots taken up by non-residents. The local council is in touch with the situation that residents face on a daily basis and is more in a position to enforce justice. As things stand, sometimes I fear that there is a lack of common sense.\nTo add insult to injury, not only does the driver that took a resident’s parking spot escape being fined, but the income gathered from the fine that was imposed on the resident will not even be used to the benefit of the city.\nI am not happy with the current wardens system. In Valletta, it is inefficient. They are not all inefficient, but they are certainly not offering anything to the residents.\nA related topic is that of waste management. It is no secret that on a typical morning, a number of street corners in Valletta could be easily mistaken for dumping sites, with small mountains of garbage bags that would have been taken out by business outlets late at night. What are your thoughts?\nIt is unacceptable. Again, responsibility for this was taken away from the council. This is not to say that when complaints are made I turn my face the other way simply because I am not the responsible entity. This is not the way I do things. I divert the complaint through the correct channels to the department responsible, and I do try to follow up and keep an eye on the situation.\nAccording to the last census held by the National Statistic Offices, in 2011 the population in Valletta stood at just over 5,000. It has been on a steady decline over the past three decades. Yet, property prices keep increasing. What is happening?\nThe demographics in Valletta have changed. The original families are slowly getting depleted, with more foreigners and people who are not originally from the city moving in. This does not mean that the community itself is dying – what makes you part of the community is your attachment to it, not your birthplace. A foreigner who is involved within community life can be as much of a Belti as someone who was born here.\nHaving said that, I much fear that the new influx of residents includes a lot of people who only live in the city for a short while. For example, wealthy foreigners buy palazzi, restore them, and only use them while on their annual vacation in Valletta.\nThe same issue applies to a lot of those who rent, or even buy – their residence in the capital tends to be transient, and they can’t be really considered part of the Valletta community. This does not apply to everyone, of course, but there is a definite trend.\nProperty prices in Valletta have gone through the roof, which is quoted as one of the reasons why the community is being depleted. Are such high prices sustainable in the long term or is there a chance the market will implode?\nI am not a property speculator, so I am not the right person to answer this question. But I will say this. I do hope that we don’t find ourselves in a situation where we have to regress, rather than progress.\nValletta’s tenure as European Capital of Culture came to an end in December. What is its legacy?\nYou can’t really say, not so soon after the tenure ended. You tend to see the effects of a legacy years down the line. The more immediate effects were tied to a boom in investment, especially in boutique hotels and restaurants. There have also been a number of infrastructural improvements, from the Renzo Piano Parliament building, to St George’s Square, Pjazza de Valette, St Elmo... these are all improvements that came about as a result of Valletta 2018.\nThe Valletta Cultural Agency was recently launched as what has been termed a ‘legacy’ to the Valletta 2018 Foundation. How strong is the council’s presence within this Agency?\nThe only facts the council knows about the Valletta Cultural Agency is what we read in the media. No meetings have been set. As a council, we have not been acquainted with its functions or workings, so I cannot speak about it.\nAnd are you happy with this?\nRight now our priorities are to lead the council to elections, but once those are done, the Valletta Cultural Agency is one of the issues the council will be addressing.\nCan the commercial side of Valletta co-exist with its residents?\nI believe in balance. Valletta lay forgotten for years until, back in 2011, former Prime Minister Lawrence Gonzi initiated a drive towards its regeneration. His vision worked and, nowadays, the capital is alive, even in the evenings.\nBut have we gone to the other extreme, from no commercial life to the exact opposite?\nI believe in balance, in every area of life. This includes a balance between the residential and the commercial aspects of the capital. I also believe that when all stakeholders get together around a table and communicate, a lot of issues are resolved.\nWhat about claims that the commercial and entertainment aspect of a European capital take priority over residents?\nI disagree with these claims, categorically. As I said earlier, a balance between the two must be found. When I did not form part of the council, I was one of those who believed that we did not need a commercial presence in Valletta. Today, I see that I was being short-sighted.\nHowever, this does not mean that businesses will be allowed to ride roughshod over residents.  Also, let us remember that many businesses do provide employment for Valletta residents.\nParking remains a major problem for residents, with the green boxes either not being respected or simply not being enough. Are there plans to address this?\nThe council has come up with several initiatives to mitigate the issue. One such initiative involved transforming the area around what we call the Yellow Garage into a fully-functional carpark. The project was accepted by central government and there were several expressions of interest.\nThe council picked the offer made by Valletta FC, as it included a strong social element that offered benefits even to the residents. Parking would be offered to residents and the immediate family of residents at subsidised rates, and a shuttle service offered. This would be of great help for those who visit their elderly parents. There was even a plan to offer these people free parking over the weekend, which is when many events are held in the capital. This way, at worst a resident can use the carpark and take the shuttle home.\nI don’t believe in being a passive mayor\nWhen will this project be launched?\nWe don’t know as progress has stalled on the side of central government. After the best offer had already been picked, numerous enquiries made by the council were met with the reply that the government is evaluating some other proposals.\nWhat do you hope will be your legacy as mayor?\nI hope to be remembered as a mayor who fostered unity. I am not the mayor for the Nationalist voters or the mayor for the Labourites. I’m the mayor for all Valletta residents and my commitment is to all of them.\nTo this end, the council has launched a number of initiatives aimed at bringing Valletta residents together. We just had a comprehensive list of events to celebrate Valletta Day in March – to give you one example, all elderly residents were taken out for dinner to celebrate. We are opening a day centre for elderly people shortly; the idea is to not only bring together the people of Valletta, but also to offer a hang-out space for those who may be lonely.\nI follow this philosophy of inclusion and unity with every aspect, even the offices of the council themselves, which are open to everyone. We plan to open a hub where those who belong to a Valletta association, whether related to sport, feasts or whatever, can hang out and showcase memorabilia. Another project is the opening of a centre from where Valletta residents can tend to certain health or civic related matters.\nFree transport scheme for elderly to be extended\nA pilot scheme that offers elderly Valletta residents free transport within and around the city, as well as to the Floriana Health Centre and Mater Dei, is now being extended to operate on Saturdays and Sundays.\nThe scheme offers a doorstep pick-up service via a phone booking system.\n“The percentage of elderly residents in Valletta is high and, unfortunately, so is the percentage of steep hills. One of the recurring laments that the local council faces is that it can be quite difficult for an elderly person to get around the city to carry out the simplest of chores,” mayor Christian Micallef said.\nThe vehicles, which are provided by Continental Cars, not only stop at the main landmarks in Valletta but will take the elderly resident to any part of the city they wish. So far, it is mostly being requested for hospital and health centre appointments.\nThe population in Valletta tends to be concentrated around the peripheries of the city, which makes reaching the bus terminus a problem for many due to the steep hills involved.\nAn elderly person living near the Mediterranean Conference Centre, for example, needs at least 20 minutes to walk to the terminus. Besides the uphill they face exposure to the elements.\nThe initiative has been so well-received that Mr Micallef plans to encourage its use not only for what are viewed as ‘essential’ outings but also for leisure purposes.\n“It is a reality that many elderly Valletta residents end up trapped in their homes due to lack of mobility. Our aim is to put a stop to this situation where many people end up feeling ‘cut off’ from life, sometimes spending days on end alone. If we have a situation where an elderly person books transport and is dropped off in the centre for a coffee and a stroll, and then is picked up again at a pre-arranged time, then I consider this a good thing.”", "comment_count": 0, "id": 1541}, {"keywords": "", "author": "", "article_body": "Updated Monday 9am with victim details\nTwo Żabbar women died and seven were injured in a horrific traffic accident close to the roundabout which leads to Mġarr on Sunday night.The two victims.\nTwo cars collided in the area known as Il-Buqana at about 9pm, with one of the vehicles ending up in a ditch and another on a centre strip.\nThe crash involved a Red Audi A1 and a blue Maruti 800. The victims, Graziella Mallia, aged 53, and her daughter Fallon, 31, were in the Maruti.\nThe Audi ended up in the ditch where the road is being widened. It was being driven by a 31-year-old from Mosta, accompanied by a one-year-old baby and an 11-year-old child, who were seriously injured. Another child, 10, was slightly injured. \nAlso seriously injured were two persons, aged 77 and 12 who were in the Maruti while a 44-year-old was slightly injured. A 29-year old from Sliema was unhurt.  \nA Ferrari sports car ended up in the same ditch a few metres away on Saturday morning. \nAn infant was among the seven hospitalised persons. \nSix ambulances were on the scene as well as several rescue vehicles of the Civil Protection Department and police cars. \n\n\n\nThe accident was a grim end to the weekend which also saw a 23-year-old German woman killed in a crash in Sta Lucija Avenue, Paola, when she fell off a motorcycle and was hit by a truck.\nPhoto - Mark Zammit Cordina.\nOne of the cars seen in the ditch where the road is being widened.\n\n \n\n ", "comment_count": 0, "id": 1542}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "Palumbo took over the shipyard and superyacht yard almost a decade ago. It is not an easy time for boss Antonio Palumbo, who is appealing a six-year jail term, but he told Vanessa Macdonald that he long ago learnt to look at the future with hope.\nAntonio Palumbo admits that he is somewhat bewildered by the media reaction to the news that he and his son were among seven businessmen found guilty in a Messina court last January of illegal waste dumping in Sicily.\n“I was unfairly crucified by the media here,” he said bitterly, saying that some of the reports were incorrect.\n“I should not be judged by what is going on in Messina but by what is going on here,” he said, sweeping his arm around the yard, visible from his office at Għajn Dwieli.\n“I have done – and am still doing – a lot for the environment and for the workers’ jobs and for the economy. I deserve credit for all of this.”\nHis words may come across as defensive and slightly belligerent but his tone was far from it. He appears genuinely perplexed that he has had to face so much criticism in the nine years since he took over the shipyard, from complaints about noise and dirt to salacious gossip about the court case.\nHe was anxious to tackle this ‘elephant in the room’ first, stressing that he remained convinced that he would be vindicated by the outcome of the two appeals, which should be heard within the coming months.\nWhat happened in Messina is very simple: it was a vendetta against me for exposing wrongful practices\n“Look around at what I do here. Look at the values and philosophy of the company with regards to the environment and occupational health and safety of the workers.\n“What happened in Messina is very simple: it was a vendetta against me for exposing wrongful practices. And I and my family have paid dearly for my stand,” he insisted.\n‘Best yard in the Med’\nThe court proceedings have not dimmed the momentum at the yards, where various investments were made with “the next phase” in mind. He spent much of the early years bringing the yard up to date, literally clearing out years of neglect. Once that was done, he invested in a solar farm, aiming to expand it to get as much as 40 per cent of his energy from it within two or three years.\nHowever, the key to the yard’s success will be how well it positions itself to offer something to differentiate itself from the rest. Mr Palumbo already describes it as the best yard in the Mediterranean – and in the world within two or three years – but he acknowledges that the most important factor is to offer something extra.\nPerhaps the best way to explain this innovative approach is the superyacht ‘village’. The former stores have been turned into a complete refuge for superyacht crews – who are often there for months at a time during the boat refits. There are now dozens of rooms available for rent, a spa and gym, meeting rooms for project teams, and a small restaurant, all built around original architectural features like beams and fireplace alcoves.\nThe superyacht facility at the shipyard also turned a profit.\n“If I want to attract more superyachts, then it is not enough to offer only technical facilities. All this expense will not make me more profits, but it will attract more business,” he said.\nAt the time of the interview, the new €2.5 million 420-tonne travel lift was bringing a superyacht out of the water, with two more in the covered facility, two others alongside the quay, and a 90m superyacht under a temporary tent built to control the environment for a re-paint.\nThe shipyard has also identified various niches where there is not such fierce competition, such as the installation of scrubbers for ships’ exhaust, refits of cruise ships and conversion of fuel systems from diesel to natural gas.\nOne disappointment is the oil and gas sector, which is still going through a difficult time thanks to geo-political upheavals.\n“We did not move away from the oil and gas sector; it moved away from us,” he shrugged wistfully. “We do believe that it will eventually rebound – but it will look very different. We are planning to be ready when that happens.”\n€1 million profit\nSo much for the infrastructure. What everyone wants to know is whether this black pit which soaked up so many millions of taxpayers’ money for so many years is now economically viable.\nThe yard had a turnover of €41 million in 2017, up from €30 million a year earlier – but the cost of sales remains high at €38 million (2016: €26m), resulting in a profit before tax of just over €1 million, which he described as “very healthy”.\n“But we are not satisfied. We will increase that,” he added.\nThe superyacht side was also profitable, making €38,928 before tax on a turnover of €5.2 million (with a tax contribution which brought it up to €1.5 million).\nMr Palumbo argued that the return was fairly normal for the industry, given the cyclical nature of the work, and explaining that he also had to factor in the millions in annual concession fees paid to the government – and the high levels of investment that were still being made, €4 million last year alone.\nI would happily take on dozens of locals if they had the specialised skills that we need\nIt is company policy that no dividends are paid out, however the directors’ remuneration in 2017 was €396,401 from the yard.\nWas that high, given the level of profits?\n“It is the ‘prize’ for nine years of hard work,” he explained, saying that this amount varied across the years.\nApart from the investment in the operational side of the yards, his labour model is radically different – and sometimes very misunderstood by those who remember the yard when it employed thousands. The shipyard employed 61 people in 2017 – only 36 of whom were involved in operations. He relies on subcontractors for the rest and leaves them to get on with their own recruitment.\n“This is the market’s standard model. You have to be very flexible in this globalised world and to abide by its rules. Criticism comes from those who do not understand – or want to face up to – the reality.\n“If we were to take on the employees ourselves, we would reach the point in this cyclical industry where there would not be enough work for them to do.”\nHuman resources problem\nHowever, one aspect that is perhaps overlooked is that he would be happy to take on more full-time staff.\n“I have placed adverts at least 20 times for staff and I have never received a single CV,” he complained, adding that he had also hosted several visits from Mcast students without success.\n“I would happily take on dozens of locals if they had the specialised skills that we need,” he said wistfully. “And if they were willing to get their hands dirty. It costs me considerably more to recruit a foreigner who needs accommodation and so on. Malta has a real problem with human resources.”\nRooms are available for rent for crews and they include spa and gym facilities.\nA yardstick to judge by\n▪ The superyacht facility handled 52 yachts last year, bringing the total since he took over in 2011 to some 300.\n▪ The shipyard hosted 201 projects, including six cruise liners.\n▪ Apart from the boat lift, Palumbo also invested €250,000 in a trailer capable of transporting yachts up to 210 tonnes.\n▪ The shipyard ended up with €8.3 million in retained earnings in 2017, with the profits also transferred to reserves.", "comment_count": 10, "id": 1543}, {"keywords": "", "author": "", "article_body": "Two men came to blows and one of them ended up in hospital in a road-rage incident near the Skate Park in Tal-Qroqq on Sunday afternoon.\nThe police said the incident involved a Serbian man, 41 and another man from Lija, 31. The former ended up in hospital but his condition is not known.\nThere was no actual collision.\nFootage of the incident was uploaded to social media. Audio has been switched off.\n \n ", "comment_count": 0, "id": 1544}, {"keywords": "", "author": "Ivan Martin", "article_body": "Anti-abortion activists on Sunday demanded that political party leaders sign a written declaration against any legislation that could lead to the introduction of abortion.\nA gathering around the Christ the King monument in Floriana heard demands by the vocal pro-life lobby ‘Abortion in Malta? Not in my name!'.\nRebecca Dalli Gonzi said the recently set up Facebook group ‘Abortion in Malta? Not in my name!' had garnered some 20,000 members in just a short few weeks.\nThe group wants party leaders to pledge that they would instruct their party whips to ensure no MPs on their ticket vote in favour of an abortion Bill should it ever be brought forward in the House.\n“The absolute majority of the Maltese people are against the legalisation of abortion in Malta. There is, however, a growing uncertainty in the public domain if the will of this majority, will carry on being respected,” Ivan Grech Mintoff of the Alleanza Bidla party said.\nMs Dalli Gonzi added that the social media group had been set up to ensure that all political parties, truly listened to “the unborn”.\nWe demand guarantees that abortion will not be introduced in Malta and that we will not accept any EU directive or regulation that forces us to do so\n“We demand guarantees that abortion will not be introduced in Malta and that we will not accept any EU directive or regulation that forces us to do so,” she said.\nThe group are also calling for amendments to the Constitution that would ensure embryos enjoy the same rights as Maltese citizens.\nMr Grech Mintoff told Times of Malta that they wanted article 33 of the Constitution, which covers protection of the right of life, to be amended to read “no person, from conception, shall intentionally be deprived of their life”.\nThe group also wants assurances that article six of the Constitution – which outlines how the Constitution overrides inconsistent laws, would be protected from the planned reform.\n“We don’t want this touched in the Constitutional convention as we have concerns that this protection will be erased,” he said.\nThe rally heard appeals for “all who sincerely above all else wish to protect human life before birth, regardless of political affiliation or allegiances”, to call on their political leaders to make their positions known by signing the declaration.\nThe rally, which attracted a modest crowd, heard a number of speakers and even singers perform a rap about life from conception.\nTensions over the potential introduction of abortion have been simmering in Malta and just last month the Women’s Rights Foundation insisted on the need for safe and legal access to terminate a pregnancy.\nMalta along with just five other states in the world — El Salvador, the Vatican, Chile, the Dominican Republic, and Nicaragua — still refuse abortions to women under any circumstances, even if in the case of maternal life or death.\nThe foundation says it is high time Malta reforms the existing laws, despite the vociferous opposition to abortion.\nThrough a position paper, it advocated for all women in Malta to have access to comprehensive sexual and reproductive health.", "comment_count": 35, "id": 1545}, {"keywords": "", "author": "Victor Paul Borg", "article_body": "A lawyer who is reportedly set to be appointed magistrate, Nadine Lia, has undergone proceedings for misconduct.\nThe proceedings by the Committee for Advocates and Legal Procurators, within the Commission for the Administration of Justice, were over altercations in court in 2010 between Dr Lia and opposing lawyers. The incident was reportedly described by presiding Judge Michael Mallia as “shameful” and “appalling”.  \nDr Lia has been under the media’s glare since The Malta Independent on Sunday reported last November that she would be appointed magistrate.\nLast Wednesday the Times of Malta named her as one of three lawyers heading for judicial office, along with three sitting magistrates set to become judges. These appointments seem set to take place before the government implements promised changes to the judicial appointments system that has been roundly faulted by justice experts (see below).\nAsked to deny or confirm that she would be appointed magistrate, Dr Lia declined to comment. Questions sent to Justice Minister Owen Bonnici via e-mail seeking verification of her nomination also remained unanswered.\nThe media reports on Dr Lia have generated particular controversy because she is daughter-in-law of Pawlu Lia, personal lawyer of the Prime Minister and other Labour Party figures, as well as the Prime Minister’s appointee on the Commission for the Administration of Justice.\nThe grumblings in the legal profession have been that these multiple roles constitute conflict of interest that would become more problematic if his daughter-in-law had to become magistrate. \nNadine Lia declined to comment\nLast month The Malta Independent on Sunday reported of a “number of lawyers” who “could boycott” causes assigned to Dr Lia if she became magistrate. They also claimed that they would take the matter to the constitutional court, a possibility that is not far-fetched in the aftermath of last December’s Venice Commission’s opinion on Malta.\nAt the time, justice expert and co-author of the Malta report, Martin Kuijer, had told Times of Malta  that the European Court of Human Rights often cites Venice Commission opinion in its judgements. That could work against Malta in potential cases after the Venice Commission wrote that Malta’s system of judicial appointments “falls short of ensuring judicial independence”.\nConfirmation of the proceedings at the justice commission is likely to generate more controversy. Two retired judges, speaking on condition of anonymity, expressed different sentiments: one said judicial roles are so sensitive that appointees have to be “as perfect as possible”; the other said that the courtroom squabbles that triggered the proceedings had been “hyped up”.\nBoth added that consideration has to be given to the sanction, something that remains unknown – the law imposes secrecy on “findings” or “disciplinary penalties”. \nLouis de Gabriele, president of the Chamber of Advocates and member of the JAC (which evaluates candidates for the judiciary), said that the JAC “check if there are ongoing proceedings or concluded proceedings about any candidate”. \nAlthough Dr de Gabriele would not be drawn into talking about specific examples, he said that in any “breach of the code of ethics” the JAC would “look into the merits of the proceedings, the gravity of misconduct, and the time elapsed since it occurred. The sanction in itself is indicative of how serious the breach was, and whether it should be an impediment to a positive assessment of a candidate for the judiciary”.\nDr Nadine Lia declined to comment on any question put to her, including questions about the proceedings and whether the case should impede her from judicial appointment. Contacted on the phone, she maintained that she is “a private person” who “does not comment to the media, on this subject or any other”.\nUntil last week she was still engaged at the Family Business Office, where she is designated as the Regulator. She had been tasked with setting up the office after she had authored the Family Business Act, piloted through Parliament by Economy Minister Chris Cardona.\nShe also appears in MaltaCEOs 2019, a publication profiling 50 “leading” CEOs in Malta that is a collaborative effort of the Chamber of Commerce, Enterprise and Industry. In the article Dr Lia speaks enthusiastically about her immersive role in the Family Business Office.\nInsipid assessment process for judicial appointments denounced by experts\nThe Judicial Appointments Committee (JAC), set up less than three years ago to evaluate interested candidates for the judiciary, has been roundly dismissed for being comprehensively flawed.\nThe JAC’s criteria for evaluating candidates are based on 10 broad principles – including criterions such as good communication skills in English and Maltese, knowledge of law and court processes, professional legal experience and familiarity with the code of ethics for the judiciary.\nThe criteria is described as “good but rudimentary” by Kevin Aquilina, dean of Faculty of Law at the University of Malta.\n“It’s criteria that allow mediocrity instead of fostering excellence,” he added. \nThe JAC has apparently been modelled on the UK’s Judicial Appointments Commission, set up 13 years ago to “select candidates for judicial office” on “merit, through fair and open competition, from the widest range of eligible candidates”. Rigorous evaluations are held after issuing calls for vacant posts. \nBy contrast, Malta’s JAC evaluates candidates who come forward and registers those positively assessed. The Prime Minister retains absolute discretion on judicial appointments and promotions (from magistrate to judge).\n“The JAC’s selection procedure is bad because there is no healthy competition between candidates after expressions of interest are issued,” Prof. Aquilina explained.\n“If a thousand lawyers apply for one vacant post and all satisfy the criteria, as they will probably do, the JAC will recommend to the Prime Minister all one thousand lawyers for judicial office. It will not distinguish between the candidates on merit, and the real choice will have to be made by the Prime Minister.”\nAnother point of criticism is the JAC’s composition.\nProf. Aquilina points out that, in contrast to other European countries, only one of the JAC’s members hails from the judiciary. “Moreover,” he added, “in case law of the European Court of Human Rights the Public Prosecutor – in our case the Attorney General – should not sit on judicial appointing or promoting boards.”\nJudge Emeritus Giovanni Bonello concurred: “It would be preferable for the large majority of JAC members to be experts in the legal profession.”\nThe Council of Europe’s Venice Commission, Europe’s highest constitutional body, said in its opinion on Malta that “the Prime Minister should not have the power to influence the appointment of [the judiciary]”.\n“The principle of independence of the judiciary,” the Venice Commission wrote, “requires that the selection of judges and magistrates be made upon merit and any undue political influence should be excluded.”\nThe PN and Chamber of Advocates are broadly in agreement with the Commission’s findings and recommendations. \nThe Chief Justice also said at the opening of the forensic year last October that he would like to see broader criteria in the JAC’s assessment. Asked to elaborate on his ideas, as well as what threshold of misconduct ought to preclude a candidate from judicial office, he wrote in an e-mail that “you will be receiving a relative reply from the Office of the Minister of Justice”. The spokesperson for the Justice Minister did not provide any replies.\nJustice Minister Owen Bonnici has publicly promised to implement the Venice Commission’s recommendations at an unspecified point in the future, but has not ruled out additional judicial appointments until the selection mechanism is overhauled.\nThe report in The Times of Malta of six impending new judiciary appointments has now intensified the mutterings in the legal profession that the government seems set to continue using the flawed JAC as a pretence of legitimacy for additional appointees of its choice.\n“When no competition takes place, it would be difficult to make choices on merit and the final decision would have to be left in the discretion of the Prime Minister,” said Prof. Aquilina. “It’s a system that’s unfair to the Prime Minister as it places too much responsibility on his shoulders, as well as the selected candidate, as the perception is that the choice was made on the basis of political patronage and not merit.\n“To add insult to injury, members of the judiciary are also chosen from political party lines or sympathisers, giving the impression that the government is more interested in putting its red- or blue-eyed boys and girls within the judiciary than advocates who are competent for the post.”", "comment_count": 39, "id": 1546}, {"keywords": "", "author": "", "article_body": "Updated 7.31pm   - \n\nAn unconscious man who was pulled from the sea off Sliema Exiles beach on Sunday afternoon has been identified as a 33-year-old Belgian.\nPassers-by administered CPR after the man was spotted on the surface of the sea and was pulled ashore.\nThey were then assisted by an ambulance crew who later rushed the man to hospital.\nThe man could not be identified initially and the police issued a photo and requested information. They later thanked the public for its cooperation.  ", "comment_count": 6, "id": 1547}, {"keywords": "", "author": "Jacob Borg", "article_body": "Sterling work carried out by the occupational safety watchdog is “grossly unappreciated” and its “greatest weakness” was in its public relations, its chairman, Labour MP Manuel Mallia, has lamented.\nWriting in the Occupational Health and Safety Authority’s annual report, Dr Mallia complained that positive indicators of improving safety remained unacknowledged and unreported by the media, which often gave the impression it was only interested in reporting in a sensational manner certain accidents.\nHe said a PR campaign would be launched to inform the public about the watchdog’s functions, create “good perceptions regarding the OHSA” and dispel erroneous perceptions not based on facts.\nThe campaign should emphasise the OHSA’s achievements\n“The campaign should emphasise the OHSA’s achievements in the field of occupational health and safety while helping to foster a solid relationship between the OHSA and the media, which is based on mutual respect and understanding of the respective roles”, the former Cabinet minister said.\nThe OHSA report says that about €62 million is being lost annually due to inadequate levels of occupational health and safety.\nFour fatal accidents at work were recorded last year, all involving male victims falling from a height while working on construction sites. Two of the deceased were self-employed and the other two employed with a small contracting company\nInjury and fatality accidents rates have been showing persistent downward trends since 2002, the OHSA’s first full year of operations, according to the report. In the case of fatal occupational accidents, the rate for 2018 was 1.7 per 100,000 employees and 1,400 per 100,000 employees in terms of injuries.\nThe construction sector remains a focus of attention, the OHSA report notes, adding that almost all inspections at building sites were routinely followed up by further visits to ensure compliance. Many still expect the health and safety watchdog to remedy situations that were beyond its legal remit, such as damage to third-party property, working hours, traffic management and road closures, the report points out. In such cases, the OHSA still inspects the site giving rise to the complaint to ascertain compliance with the law while officially referring the original complaint to the responsible entity.", "comment_count": 18, "id": 1548}, {"keywords": "", "author": "Jacob Borg", "article_body": "A united PN that spoke with conviction could send a strong message to the “arrogant and corrupt government”, Opposition leader Adrian Delia said on Sunday.\nSpeaking during a political meeting in Siggiewi, Dr Delia said the next six weeks leading up to the European Parliament elections would be crucial.\nHe said the PN had to once again rise to the occasion by showing it was the party that truly cared for the country.\nDr Delia’s leadership has been blighted by a reported split within the party.\nThe Opposition leader on Sunday urged supporters to get out and vote, insisting it was useless just pointing fingers from home.\n“Those staying home are certifying corruption. It would be a thank you to Labour, and a thank you to Konrad Mizzi”, Dr Delia said of those considering not voting during the elections.\nA poll by the Sunday Times of Malta last week showed Labour is enjoying a 22-point lead over the PN. Asked which party they intended to vote for in next month’s European Parliament elections, 59 per cent of respondents said they would vote for the Labour Party compared to 37 per cent for the Nationalist Party.\nDuring his speech, Dr Delia accused the government of pretending to be pro-business.\nHe said in reality, Labour only favoured certain big businesses.\nThe Opposition leader said that during the past weeks he had met a large number of small business owners, who were facing daily struggles just to make a living.\n“The government does not care about these people”, he said.\nLatching on to a report by the Times of Malta about how the Contracts Department changed a key tax arrears clause in a €12 million cleaning tender,https://www.timesofmalta.com/articles/view/20190412/local/crucial-tax-clause-removed-from-st-vincent-de-paul-12-million-cleaning.707100 Dr Delia said all companies should be able to compete on a level playing field.\nHe also hit out at Tourism Minister Konrad Mizzi for “deceiving” people into thinking that Air Malta had suddenly registered a profit.\nDr Delia said the airline had in fact juggled around its debt and employees and a few days after declaring a profit, it was discovered that Air Malta had €15 million in unpaid fuel bills.\nThe Opposition leader said people were now seeing through Dr Mizzi, who was the same person who tried to say the Vitals and Electrogas deals were good ones.", "comment_count": 53, "id": 1549}, {"keywords": "", "author": "Ivan Martin", "article_body": "Prime Minister Joseph Muscat on Sunday called out the \"hypocrisy\" of those who lamented abortion as the killing of human lives, yet had had no concern for migrants stuck out at sea.\n“To me human life isn’t a relative issue. If there are some who go and bang on their chest at Our Lady of Sorrows and cry over abortion as the killing of human lives, as some did this weekend, well migrants at sea are human lives too.”\n“What’s good for the goose is good for the gander,” Dr Muscat said, adding that he could not stomach certain people’s hypocrisy any longer.\nThe Labour leader was weighing in on tensions between Malta and Italy over the migration issue which once again came to the fore in recent days.\nHe was speaking at the Labour Party's Mellieha club, the day after Malta reached a deal with four EU countries over the fate of 64 migrants who were picked up by an NGO vessel close to the Libyan coast. \nThe deal will see the migrants redistributed to Germany, France, Portugal and Luxembourg.\nIn today’s political climate, Dr Muscat said, there were few black and white issues, but situations where all options really needed to be weighed before a final decision is taken.\nOne such situation presented itself last week.\nA boat registered to a German NGO, had picked up the 64 migrants in distress close to the Libyan coast.\nRather than returning to Libya or heading to Tunisia, they opted for the Italian territory of Lampedusa.\nHowever, when they were refused entry there, the vessel came to Malta and brought with it international pressure to open the island’s ports.\n“We have to accept that in today’s society, we face pressure. But we won’t tolerate a situation where Malta gets portrayed as being to blame for this situation,” he said.\nAnother 64 people on the island would not have made a difference, he said, adding however that there was a principle at stake.\nWith summer on its way, so too was a high tide of migration and this was the context the government was operating it.\nMalta could have gone down the Italian government’s route and said the island’s ports were closed.\nThis, Dr Muscat said, would have be popular on social media, and would certainly have won the government votes. But it would also have risked human lives. \nInstead the government went down the third route, of finding a European solution.\nThis, he said, had seen other governments agree to take on the 64 migrants the moment they landed in Malta.\n“This is the sensible way of doing things. The common sense approach,” he said, sparking applause from party supporters at the news that none of the migrants remained in Malta.\nLater in his speech, Dr Muscat told those gathered about an Indian pharmaceutical company, Aurobindo, which he visited last week. This, he said, was living proof that multiculturalism can help create jobs.\nThe company provided quality jobs for Maltese which would not be possible without foreign workers that met it’s labour force demands.\nThis, Dr Muscat said was how metropolitanism worked, “not extremist propaganda that foreigners are taking jobs”.", "comment_count": 110, "id": 1550}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "Rule of law NGO Repubblika has filed a judicial protest seeking to stop the government from naming any new judges or magistrates under a system of appointments it says threatens the judiciary’s independence.\nIn its protest, Repubblika says the current appointments system hinges on the “absolute discretion” of the Prime Minister and breaches Malta’s obligations under EU treaties, as well as the European Convention on Human Rights and Charter of Fundamental Rights of the EU.\nThe protest, lodged against Prime Minister Joseph Muscat and Justice Minister Owen Bonnici, comes as the government is expected to name three new magistrates and three new judges in the coming weeks.\nRepubblika cited the recent Venice Commission report, which said the Prime Minister should have no power to influence judicial appointments, as “this would open the door to potential political influence, which is not compatible with modern notions of independence of the judiciary”.\nIn one of its chief recommendations, the Commission had said vetted and ranked applicants for magistrates or judges should be recommended by the Judicial Appointments Committee “directly to the President”.\nRepubblika said in its judicial protest that despite reforms implemented in 2016, effective authority remained in the Prime Minister’s hands, undermining the independence of the judiciary.\nThis, it said, threatened the fundamental right to a fair hearing as well as the legal order of the EU, as Maltese courts had a central role in the application of the Union’s laws.\nMore than half of the judiciary would have been replaced in the past six years\nIt said the government had made clear that it was not ready to reform the system before the upcoming judicial appointments.\n“The government should immediately desist from appointing or nominating new members of the judiciary until the words and spirit of the Venice Commission report are effectively implemented with the requisite constitutional amendments,” it said.\nRepubblika also referenced infringement proceedings currently underway against Poland over its own system of judicial appointments – arguing that the same legal principles applied – and the interim measures put in place to prevent the Polish government from making further appointments until the case is concluded.\nThe judicial protest is signed by lawyers Simon Busuttil, the former Opposition leader, and Jason Azzopardi, a Nationalist Party MP, on behalf of Repubblika members Marion Pace Asciak, Robert Aquilina, Vicki Ann Cremona, Simon Sansone, Pia Zammit and Manuel Delia.\nThe Times of Malta reported earlier this week that three judges and three magistrates would be named in the coming weeks despite repeated promises by the government to change the “outdated system” of appointments.\nSources said magistrates Aaron Bugeja, Joanne Vella Cuschieri and Francesco Depasquale were expected to become superior court judges while Nadine Lia, Bridgette Sultana and Victor Asciak would be named magistrates.\nThese appointments mean more than half of the judiciary would have been replaced in the past six years. The Prime Minister and the Justice Minister have repeatedly said they would implement changes to the current system “soon”, however, these have yet to happen.", "comment_count": 25, "id": 1551}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "The police are investigating a spike in robberies in the Sliema and St Julian’s area, most of which have seen the same methods being used. \nRather than using bump keys, as they used to in the past, the thieves are now drilling through the locks, even those generally considered to be among the more secure. \nSources close to the police said there have been dozens of thefts in recent weeks, with the majority of them targeting apartments rather than larger houses. In one case a whole apartment block was burgled. \nThe sources said the growing incidence seems to be creating a pattern, indicating that the robbers either belong to the same gang or are simply using the same methods to gain entry.\nIn all cases, thieves stole jewellery, cash and watches. Larger items, such as televisions, gaming consoles, hi-fi systems, laptops and computers were not touched. \nIn one case a whole apartment block was robbed\nAccording to investigators, this is an indication that the robbers are after things that can easily be concealed. And they are also after cash. \nThe police sources said that in a good number of cases, the thieves were dressed to fool neighbours into thinking they were workers repairing doors and locks. \nInvestigators said lock drilling was not a new phenomenon but such a way of gaining access to residences had not been used for some time. \nAccording to the police, the thefts follow another strange pattern: most are taking place between 3 and 6pm, something which investigators believe is a “peculiar time” to strike. \n“They’re probably striking at that time because they are pretending to be workers so anyone who sees them wouldn’t think they were up to something,” one police source said. \n“The time chosen also indicates that the robbers are choosing their targets carefully, making sure residents are out or at work at the time.”\nTargets are being chosen weeks in advance: the thieves have been ringing intercoms and telling unsuspecting residents they are from the intercom company and are simply checking items. What they would be doing in reality is checking how easy or difficult it would be to force the door open. \nPolice sources confirmed that an entire block of four apartments in Sliema was targeted last week. The majority of front doors had their locks drilled and removed.\nBesides Sliema, there have been a number of similar cases is St Julian’s, San Ġwann, Swieqi and Pembroke.\nInvestigators are sifting through long hours of CCTV footage from residences and businesses near the targeted flats in an attempt to identify the suspects.\nWitnesses have told the police the men have foreign accents but there have been other reports of Maltese-speaking men acting suspiciously. \nThe police urged people to team up with neighbours to be on the lookout for anything which looks abnormal. The installation of alarms, CCTV systems and security locks could also help, they said. ", "comment_count": 74, "id": 1552}, {"keywords": "", "author": "Jacob Borg", "article_body": "Electrogas e-mails originally leaked to assassinated journalist Daphne Caruana Galizia show MaltaToday editor Saviour Balzan agreed to run a “controlled” interview about the power station project, at a time when the government and consortium were facing pressure over missed deadlines.\nThe idea for a “cosmetic image building” interview was pitched to Tumas Group CEO Yorgen Fenech in January 2016 by Electrogas’ PR company.\n“This will be controlled if we choose the right interviewer/newspaper and will do us a lot of good in terms of approachability and building some equity in case we eventually need it,” the e-mail to Mr Fenech said.\nA follow-up e-mail to Electrogas commercial director Catherine Halpin and Mr Fenech said Mr Balzan had agreed to the interview “as discussed”.\nReplying to questions by The Sunday Times of Malta, Mr Balzan said the interview was featured in his paper’s commercial section, where press releases and other supplement features are published.\n“These pages are not strictly news, and are used to feature advertisers’ announcements,” Mr Balzan said.\nThe leaked e-mails show Electrogas were sent the interview questions in advance and “controversial” material that emerged from the actual interview was deleted after a back-and-forth with MaltaToday.\nOne of the quotes deleted, according to the e-mail exchange, was about the cost of the gas being supplied by the Electrogas consortium to Enemalta.\nDuring the interview, Ms Halpin was quoted as saying that the most important factor was a stable supply of gas, even if at a higher price, than a cheaper supply that may turn out to be unreliable.\nFurther e-mail exchanges between the PR company and Mr Fenech show the Tumas Group CEO disputed this quote, arguing that the fact that Electrogas had won a competitive bid meant it definitely had the best price.\nThe PR company later confirmed that “the price part is completely deleted” from the interview.\nNo recollection of paid advertorials\nYet, investigative reporters from the Daphne Project later showed that taxpayers would be losing tens of millions of euros from the gas-fired station contract, given the price at which it was agreed to purchase its multi-year supply of gas.\nAsked if the interview was a paid advertorial, Mr Balzan said he did not have any recollection of paid advertorials in 2016 and he could not recall any specific meeting with Mr Fenech about the subject.\nHe said the interview was carried out by a non-core staff member who was employed for little over a month.\nMr Balzan argued that a fair comparison for readers would be the work Malta Today’s journalists carried out on Electrogas and the LNG power plant, the 17 Black scandals and the numerous editorials calling for the resignation of Tourism Minister Konrad Mizzi and the Prime Minister’s chief of staff Keith Schembri.\nA separate e-mail exchange from May 2017 saw Mr Fenech declaring that the only media outlets that could reproduce a story about financial difficulties being faced by Electrogas featured on Daphne Caruana Galizia's blog were the Times of Malta and Net TV.\n“I’ve spoken to Independent and Malta Today. Only outlets that can reproduce are Times and Net,” the internal e-mail read.\nDuring a TVM interview with Tourism Minister Konrad Mizzi a month after revelations linking Mr Fenech to the mystery company 17 Black, Mr Balzan avoided naming Mr Fenech or the Tumas Group, instead referring to the 17 Black owner as an “Electrogas director”.\nMr Balzan refused to say if his TVM programme has received advertising from Tumas Group.\n“XTRA is not a Media Today production and all adverts are booked with another company and PBS. The wide-ranging interview with Konrad Mizzi was not only about 17 Black but also about Mizzi’s political work,” Mr Balzan said.\nThe other company in question is Business to Business Limited, which is wholly owned by Mr Balzan.\n“As a newspaper owner for the past 20 years and a journalist for over 35 years, I have spoken with Malta’s leading industrialists, prime ministers and politicians from every side.\n“I respect all those who choose to speak to me, for whatever reason. If sections of the Maltese press think certain newspaper owners or journalists should shun those who no longer enjoy the favour of a political party, the Times should publish its blacklist for everybody’s benefit,” Mr Balzan said.", "comment_count": 41, "id": 1553}, {"keywords": "", "author": "Denise Grech", "article_body": "Some 50 migrants were evicted by the police on Sunday from a small apartment block in Qormi where they were living in poor conditions.\nA witness said the migrants were taken away in police vans escorted by several police cars after the raid in Triq il-Wied.\n\nThe conditions the migrants were living in were decrepit, with no furniture other than a number of beds, and mattresses laid next to each other.\n“There is no furniture, just mattresses and their belongings stuffed in suitcases,” one police source said.\nTwo of the migrants were arrested and handcuffed after they tried to escape by jumping into adjoining roofs.\nThe owner has not been identified yet and one of the migrants said he paid €150 a month to stay there.\nPolice sources said they will register the migrants and send them back to Italy because most did not meet the legal requirements to stay.\nThis was the second time that police evicted migrants living in poor conditions on premises in Qormi.\nIn August, Planning Authority enforcement officers and police evicted some 120 migrants were found to be living in inhumane conditions on a farm. \nOfficers had described how the migrants were living in stinking cow stalls, which had been sub-divided into partitions with numerous beds. Open-air 'shower cubicles' were full of green mould, with water seeping into the 'courtyard'.\n\n\n \n ", "comment_count": 0, "id": 1554}, {"keywords": "", "author": "", "article_body": "A 43-year-old man from Marsascala was seriously injured late on Friday in a car crash in Zabbar.\nThe police in Triq Santa Tereża involved a Renault Clio driven by a 54-year-old from Zabbar and a Skoda Citigo driven by the 43-year-old. ", "comment_count": 0, "id": 1555}, {"keywords": "", "author": "", "article_body": "The following are the top stories in Malta's newspapers on Sunday.\nThe Sunday Times of Malta reports that thieves are drilling through locks to burgle apartments in broad daylight, with a spike in burglaries reported in Sliema. \nIt also reports that Nadine Lia, a lawyer who is reportedly set to be appointed magistrate, has undergone proceedings for misconduct.\nThe Malta Independent on Sunday says Air Malta paid a €15 million fuel bill after its annual general meeting so that it could show a profit. The story is also taken up by Il-Mument, which says Air Malta has a €15m financial hole.\nIt-Torċa says a 10-year plan is being drawn up for the use of EU funds. \nIllum says efforts have started within the PN to push Roberta Metsola and Claudio Grech for the leadership.\nKullĦadd says Adrian Delia was weakened further when he was forced to suspend one of his supporters, Hermann Schiavone.\n ", "comment_count": 0, "id": 1556}, {"keywords": "", "author": "", "article_body": "A young woman died when she was hit by a truck after falling off a motorcycle late on Saturday.\nThe incident happened at about 11.30pm in Sta Lucija Avenue, Paola, when the woman, a 23-year-old German, was riding pillion on a motorcycle heading south.\nSources said the driver appeared to have lost control of the motorcycle after taking avoiding action.\nBoth he and the woman fell off and the woman was hit by a truck which was immediately behind them.\nShe died on the scene.\nThe motorcyclist was unhurt.\nA magisterial inquiry is being held.", "comment_count": 0, "id": 1557}, {"keywords": "Gozo", "author": "", "article_body": "The new President last Saturday week visited Gozo. Accompanied by his wife Miriam, Dr Vella was escorted to Independence Square by the Traffic Police where he was greeted by Gozo Minister Justyne Caruana and Victoria mayor Samuel Azzopardi.\nDr Vella placed flowers at the foot of the monument commemorating WWII victims, followed by a visit to the Banca Guratale where he signed the visitors’ book. Afterwords, Dr Vella went to the Gozo Ministry. On the way, he talked to various people who congratulated him on his new appointment.\nAt the Ministry the President met Opposition members Chris Said, Frederick Azzopardi and David Stellini.\nDr Vella, then, met Gozo Bishop Mario Grech and the Parish Priests College at the Curia. The President was presented with a copy of the Holy Bible by Mgr Grech.\nLater on, the President visited Ta’ Pinu Sanctuary where he was met by the rector Fr Gerald Buhagiar, who presented a Ta’ Pinu icon to Dr Vella.\nBack at the ministry, Dr Vella met Government department heads, Police and AFM members, the Arka Foundation, Scout groups, the Gozo Tourism Association, the Gozo Business Chamber and court and hospital officials.\nFinally, the President visited the Visitors’ Centre at the Ċittadella.", "comment_count": 0, "id": 1558}, {"keywords": "Gozo", "author": "", "article_body": "Members of the Commission for Natural Resources of the European Committee of the Regions recently met in Gozo. The highlight of the conference was the blue economy. With a turnover of €566 billion, EU’s blue economy generates 1.3 per cent of the total GDP and employs 3.5 million people.\nOther topics discussed during the meeting were cross-border cooperation in disaster risk reduction and a new European agenda for the development of maritime industries.\nAttended by over 100 delegates, the conference was organised by Victoria mayor Samuel Azzopardi, who is also the president of the Gozo region.\nThe conference was opened by Ossi Martikainen, chair of the NAT Commission, who spoke on the ‘Sustainable Development of the Blue Economy in Gozo’.\nDr Azzopardi said: “The blue economy is the way forward to reconcile the use of mari-time resources with economic growth and jobs for our communities. We support the CoR’s vision to place the blue economy as an integral part, rather than peripheral, of the EU’s economic policy. Sustainable growth is at the heart of Gozo’s political priorities. The island is already a clean energy net contributor to the Maltese grid and we are well on track to become an eco-island by 2020.”\nMalta is among the top five EU member states in which the blue economy most contributes to its GDP (4.7 per cent). The Maltese blue economy employs around 10,400 people and generates €406 million in gross value added. During the conference members adopted various draft opinions, including ‘Cross-border dimension in Disaster Risk Reduction (DRR)’, ‘A new European agenda to speed up the development of maritime industries’ and ‘Towards a comprehensive European Union framework on endocrine disruptors’. \nThe participants also ex­changed views on the progress in the implementation of the EU forest strategy, active and healthy ageing and agropastoralism.", "comment_count": 1, "id": 1559}, {"keywords": "Environment", "author": "", "article_body": "A selection of articles and photos submitted by students from various schools taking part in the Young Reporters for the Environment (YRE) programme.\n\nWas your product fairly made?\nOn a daily basis, we buy and use various products. But have you ever thought where, by whom, and under what conditions they were produced? Have you ever wondered if your choice is fair with those who produced that product? And how your choice affected the environment?\nFair Trade is an alternative option for more just and sustainable commerce where people and planet come before profit as explained in the 10 Principles of the World Fair Trade Organisation. These principles go hand in hand with the Sustainable Development Goals of the United Nations.\nMarie Therese Pavia and Aidan Gauci, students at G.F. Abela Junior College, produced a video to raise awareness and knowledge about Fair Trade as part of their participation in the YRE campaign.\nTo view the video, visit https://www.youtube.com/ watch?v=ifC0_3LZmnE&t=5s.\nTo read other students’ entries, visit www.yremalta.org.\n\nWhen the sun goes down, the dump waste comes up\nThe high ground area at the shoreward end of Delimara Point above il-Ħofra ż-Żgħira in Marsaxlokk has turned into a waste dumping zone. The area is also the site of a belvedere of Delimara Port and is famous for the polygonal British Fort of Tas-Silġ, built between 1879 and 1883.\nBeing quite remote, the site is ending up being used to dump heavy waste, including plastic paint containers, paper, broken glass, metal and even remains of construction material.\nOn contacting Marsaxlokk local council we were told that the heavy waste dumped in this area is frequently reported, and clean-up actions are continuously taken.\nMeanwhile, people keep on dumping heavy waste, especially at sunset when there is no one around to report this illegality. Then when the wind blows heavily most of this dumped waste ends up in the sea port, contaminating both water and underwater fish and vegetation. Security cameras are needed to monitor the area.\nLeon Buttigieg, St Margaret College Senior Secondary School, Verdala, Cospicua.\n\nPlastic heart\nThe photo shows a heart-shaped littered plastic bottle embedded in the clay slopes on a hillside in Għajn Tuffieħa.  It is a symbol of one of the major threats to our planet. The main concern is the accumulation of plastic in the environment and the time it takes to degrade. Once it is broken down, the smaller pieces, called microplastics, enter the diet of living organisms such as birds and fish, and eventually, our own food. As a solution, we must reduce the amount of plastic we use. An example of this is the banning of single-use plastic. Plastic waste generated must be disposed of responsibly ideally for recycling rather than landfilling.\nMichael Stilon is a student at G.F Abela Junior College.\n\nAssorted plastic nurdles\nNurdles are small plastic pellets that are used to make nearly all our plastic products. Various bits and pieces of plastic eventually find their way in the sea and many end up washing up on our shores. Marine life is severely threatened by these small pieces of plastic. The creatures that make up the base of the marine food chain, such as krill, are prematurely dying by choking on nurdles. Plastics also contain toxic chemicals which end up in our bodies through the food chain, causing various health problems such as cancer.\nAmy Carole and Nicole Spiteri Staines, are Form 1 and 3 students respectively at St Monica School, Gżira.", "comment_count": 0, "id": 1560}, {"keywords": "Gozo", "author": "", "article_body": "Gozo Church Primary School students took part in a Lenten pilgrimage to Ta’ Pinu Sanctuary. Upon their arrival at the sanctuary Gozo Bishop Mario Grech celebrated Mass and blessed an image of Our Lady of Ta’ Pinu surrounded by schoolchildren. A copy of this image was presented to all heads of the schools at the end of the celebration.", "comment_count": 0, "id": 1561}, {"keywords": "Education", "author": "Carm Cachia", "article_body": "Parliamentary Secretary for Financial Services, Digital Economy and Innovation Silvio Schembri launched the 2019-21 National eSkills Strategy on March 13, making Malta the first EU member State to have a national strategy for digital skills.\nMr Schembri explained that the strategy seeks to pave the way for the enhancing of the nation’s digital skills and ultimately prepare for the challenges ahead in an ever-evolving digital scenario.\nHe said: “The past few years have seen the unprecedented rise of digital and communication technologies, which together with the digital economy, have dramatically changed every aspect of life. For our country to thrive we need to furnish tomorrow’s generations with the right skills and training.”\nDigital technology is now prevalent across all sectors, and this has created a need for digital skills for most roles and positions of employment. Digital skills are not just relevant for ICT practitioners, but also for the workforce, education providers and society in general.\nThe national eSkills agenda seeks to develop a larger digital talent pool and to ensure that individuals and the labour force are equipped with adequate digital skills.\nThe strategy will tackle communication in a digital environment, future technology and growth, IT teaching and guidance, funding sustainable initiatives, support on curriculum design and professional development, upskilling industry, assessing digital competence, participative use of tech by youth, digital divide in society, and importantly, open up to national recognition of the IT profession. Throughout the implementation of the rolling, non-static strategy, the eSkills Foundation will gather feedback from a Strategic Consultative Committee.\nEU member States have since 2017 been invited to develop comprehensive national digital skills strategies, and Malta was one of the first few countries to specifically step up to this challenge.\nThe eSkills Malta Foundation embarked on this project in April 2018, and with PwC’s involvement, managed to engage with the relevant stakeholders through various surveys, workshops and face-to-face meetings.\nThe project involved a proper study of the current state in digital and ICT skills, upcoming local and international emerging technologies, and upcoming education and training methods. Following this, the project charted the state that Malta should preferably have reached by 2021, and the steps to get there, and come up with important recommendations that could possibly championed by the eSkills Malta Foundation.\nThe launch event was also addressed by Gerard de Graaf, director for the Digital Single Market in Directorate-General Communications Networks, Content & Technology (DG Connect) at the European Commission, Robert Debono, ICT Director of Study, PwC, Vince Maione, CEO of the National Skills Council at the Education Ministry, and the author.\nDe Graaf said: “Malta, and in particular the eSkills Malta Foundation, has done excellent work in digital skills policy, training and upskilling your citizens and the labour force. The facts speak for themselves.” He added that “the record in Malta is good, also when we look at the Digital Economy and Society Index, to become a leading digital country in Europe and the world”. These words motivate and encourage us to go further and higher in the realm of digital and ICT skills. As in the past, the eSkills Malta Foundation will continue working incessantly towards its goals and looks forward to collaborate with stakeholders to further achieve our aims.\nCarm Cachia is chief administrator of the eSkills Malta Foundation.", "comment_count": 0, "id": 1562}, {"keywords": "Gozo", "author": "", "article_body": "• A blood donation session will be held at Xewkija District Health Centre today from 8am to 1pm.\n• A Dog’s Way Home (PG) will be screened at Don Bosco Oratory, Victoria, today at 5.30pm.\n• The Għaqda Drammatika Għajnsielem is organising various activities throughout the Holy Week in collaboration with the Għajnsielem local council.  Today, Ta’ Passi fields will be transformed into a village reflecting the time of Jesus’ passion consisting of various biblical characters from 2.30pm. There will also be a performance entitled The Passion: Then and Now at 6pm which will commence with a live re-enactment of the Lord’s Supper at 4pm. A repeat performance of the Passion of Christ will be held on Good Friday at 10.30am. Entrance for these activities is free. There will also be a live cooking station where traditional Passover food will be prepared. This activity will take place on Maundy Thursday from 8.30pm until 11.30pm and the following morning, Good Friday, from 9am to 10.30am.\n• Fr Guardian Joe Caruana, OFM will lead the commemoration of the Last Supper at St Anthony church, Għajnsielem, on Maundy Thursday at 7pm. On Good Friday, Fr John Azzopardi, OFM will lead the celebration of the Lord’s Passion at 3.30pm. On Holy Saturday, Fr Marcello Ghirlando, OFM will lead the celebration of the Easter Vigil at 8pm and on Easter Sunday Fr Caruana will celebrate Mass at 11am with the participation of children. After Mass there will be the blessing of figolli.\n• Good Friday processions will be held at Qala, today, Sunday, at 6.30pm, St George’s parish, Victoria, on Thursday at 7pm and at the Cathedral in Victoria, Xagħra, Nadur and Żebbuġ on Good Friday at 6pm.\ncharles.spiteri@timesofmalta.com", "comment_count": 0, "id": 1563}, {"keywords": "", "author": "Denise Grech ", "article_body": "Two of three teenagers facing charges amounting to terrorist activity were moved from the high-security unit at Corradino Correctional Facility to the juvenile section following vocal opposition, the Times of Malta has learned.\nAditus director and lawyer Neil Falzon, had said keeping two of the minors in the high-security division would be in breach of a magistrate’s orders for the state to look after them.\nHome Affairs Minister Michael Farrugia said he had no say in where the migrants were being kept, arguing it was the responsibility of the Corradino Correctional Facility’s director to make such a decision.\nRead: Anger as teen migrants are kept in high-security division\nThe three teenagers are pleading not guilty to charges of hijacking the vessel El Hiblu 1 last month. The teenagers were among a group of migrants the captain and his crew had rescued while stranded at sea.\nIt was alleged that the incident involving the three accused occurred after the captain decided to take them back to Tripoli but those on board insisted they wanted to go to Malta.\nRead: Teen 'ringleaders' ordered hijacked ship to 'go Malta', captain testifies\nThe tanker was stormed by Maltese soldiers in the early hours of March 28 as it entered Maltese waters. The ship was then escorted to Senglea where the 100 rescued migrants on board disembarked. The government said those on board consisted of 38 males, 15 females and 47 minors. A pregnant woman and a child were taken to Mater Dei Hospital for medical observation.\nThe accused, aged 15, 16 and 19, face between seven and 30 years behind bars if found guilty. Those moved to the juvenile section were the younger ones.\nCaptain Nader El Hiblu, 42, said in court this week the three teenagers were the ringleaders who led an uprising aboard his vessel. They acted aggressively and circled the bridge, making sure the ship was heading to Malta at full throttle. “No Libya, go Malta,” the captain recalled them ordering, saying the three had worked together to make sure the El Hiblu 1 did not return to Libya, as was his intention.\nThe captain told the court there was no violence on board and he was the only person steering the ship throughout.", "comment_count": 0, "id": 1564}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated with AG's reply\nThe Attorney General decided not to appeal a judgment acquitting a contractor from bribing former Rabat mayor Frank Fabri, who is now permanent secretary at the Education Ministry, Times of Malta was told.\nPolice sources said the case file was forwarded to the Attorney General, Peter Grech, for his consideration. However, he decided not to appeal the case despite strong legal arguments to the contrary, they added.\nQuestions sent to the Attorney General’s office to explain his decision remained unanswered despite reminders.\nThe court acquitted cleaning contractor John Borg who claimed he used to pay kickbacks to Dr Fabri in 2006.\nMagistrate Donatella Frendo Dimech ruled the police had failed to prove the veracity of telephone conversation recordings made by Mr Borg shedding light on his dealings with the former Rabat Labour mayor.\nThe judgment confirms the unfoundedness of the allegations\nThe court also threw out statements Mr Borg gave the police, in which he claimed giving Dr Fabri money in relation to a public contract, on grounds that he had not been assisted by a lawyer as required by law.\nAccording to records of the court case, Mr Borg told the police he used to pay Mr Fabri €345 a month and that his cleaning contract was stopped when he refused to increase the amount of monthly ‘kickbacks’ to €575 a month.\nThe court decided not to consider these recordings because the prosecution did not prove that it was Mr Borg’s voice that was heard.\nDr Fabri had exercised his legal right not to reply to questions in order not to incriminate himself.\nHe failed to reply when asked by this newspaper whether he had received kickbacks from Mr Borg. He said: “The final court judgment confirms the unfoundedness of the allegations and my innocence”.\nThe police said Dr Fabri was investigated about the claimed corruption before Mr Borg’s arraignment but no charges were ever issued against him.\nThe dual role of the Attorney General as counsel to the government and also public prosecutor at the same time has been criticised by international institutions for years. The government has now decided to separate the two roles although it will still appoint both the Attorney General and the proposed Public Prosecutor.\n'We exercise discretion' - AG's office\nIn a statement after the publication of the article, the Office of the Attorney General said it unreservedly disassociated itself from, and denied claims of wrongdoing made in the article.\nThe office recalled \"its policy and duty\" to exercise discretion when choosing or declining to comment on court decisions and on pending cases. Such exercise of discretion is necessary to respect the privacy of persons involved in criminal proceedings, to allow the courts to decide cases, including appeals, before them without undue public pressure and to give court decisions the respect they deserve.\nDecisions of the Court of Magistrates are appealed or otherwise, whether in full or in part, on the basis of a legal evaluation of the merits and nothing else, the AG's office said.", "comment_count": 0, "id": 1565}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Malta is still mulling over the European Commission’s recommendation to carry out a national risk assessment of 5G network infrastructures by the end of June.\nIt is unclear whether the country has, or will be, carrying out cybersecurity and health hazard tests before the 5G roll out.\nFifth generation networks require radio frequencies to transmit data, just as AM and FM radio bands work. Malta is scheduled to start auctioning its 5G frequency band next year.\nEU countries are preparing for 5G, however, its introduction has raised concern about cybersecurity and health hazards.\nOver the past couple of years, some scientists have appealed to the EU for 5G technology to be blocked due to growing concerns about the increase in radiofrequency radiation and related health risks.\nThe technology promises lightning-fast data transfer, which is likely to become increasingly important in the coming years as more devices, from smart meters to household appliances, are connected to the internet.\nNo licence had been issued by MCA\nThe European Commission has recommended that each member state should complete a national risk assessment. Among others it noted that any vulnerability in 5G networks could be exploited to compromise such systems and digital infrastructure, potentially causing serious damage or to conduct large-scale data theft or espionage.\nAsked whether Malta had or was planning to carry out cybersecurity and health hazard research or tests, the Parliamentary Secretary for Innovation said the Commission and member states, including Malta, were in discussions about the implementation of its recommendation about cybersecurity.\nA spokeswoman said the EU had agreed on a broad set of measures to ensure a common approach across all member states.\n“5G is recognised as a major enabler for future digital services and the government is actively pursuing this common approach to ensure its timely availability,” she said.\nMalta, she continued, was engaged with “the relevant EU institutions and is taking the necessary steps” to ensure the availability of radio spectrum and the limits for exposure to electromagnetic fields as set by the International Commission on Non-Ionising Radiation Protection.\nThe Parliamentary Secretariat for Innovation said it was willing to discuss 5G technology before the Parliamentary Health Committee, welcoming a request by the Democratic Party. \nParliamentary Secretary Silvio Schembri said in a statement no licence had been issued by the Malta Communications Authority related to the transmission of mobile services of experimental or commercial matters related to 5G.\nHe noted that the European Commission had repeatedly stated it had not found any scientific justification to revise the limits set on exposure to electro-magnetic fields.\n“The health and digital security of our citizens is of utmost priority and they will not be bartered for profits. The government is in continuous discussions with the relevant international institutions and closely following developments on these matters,” the parliamentary secretariat said.", "comment_count": 26, "id": 1566}, {"keywords": "", "author": "Denise Grech ", "article_body": "Reports on foreign suspects show “worrying trends”, making ex-plicit reference to the ethnicity of alleged perpetrators when they are foreigners, researchers said.\nA National Media Report on media representation of suspects found media outlets consistently made explicit reference to the ethnicity and nationality of alleged perpetrators, particularly when they were not Maltese.\nThe report was carried out by the Hungarian Helsinki Committee, organisation Fair Trials Europe, Human Rights House Zagreb Rights International Spain, the Vienna University and Aditus.\nHeadlines would frequently use nationality as the descriptor, for example “A Serb”, “Two Syrians” or “Russian with Maltese citizenship”, while no further descriptors are used for Maltese suspects. (Times of Malta has refrained from using nationalities of suspects in headlines in recent years).\nThe researchers also criticised the fact that suspects were filmed and photographed entering the building. The reports may influence the perception of suspects or accused as guilty, the study said.\nMay influence the perception of suspects\nDespite the media being unauthorised to take pictures, several incidences in the year-long study were recorded in which suspects were led by the police and into the court building through the front doors, as opposed to the back entrance, the report noted.\nThe researchers pointed to the photos of Bojan Cmelik, who was charged with the murder of entrepreneur Hugo Chetcuti in July. The man has pleaded not guilty to the charges.\n“In one extreme example, a suspect was charged in court the day after he was arrested, wearing a white forensic suit with his hands handcuffed behind his back,” the report said.\n“The suspect was made to walk in a busy pedestrian area, escorted by three police officers and enter the court through the front doors as opposed to through the back entrance – like in normal procedures,” the report noted.\nBecause the case was so prominent, the photos and footage have been repeatedly shown in print, online and television broadcasts.\nCourt regulations also prohibit people from taking any photograph or film during the hearing of any case in any hall, unless authorised, the report noted.\nThe researchers collected news reports on arrests of suspects or criminal court proceedings in printed newspapers, online portals and TV broadcasts in both Maltese and English. Stories were selected and coded by all project partners in their respective countries in accordance with the guidelines and procedures developed by the Vienna University team.", "comment_count": 57, "id": 1567}, {"keywords": "", "author": "Keith Micallef", "article_body": "They come at night shouting and by sunrise they leave a trail of destruction with dead bodies of women, children and men whose only guilt is their Christian belief.\nThis is the harrowing experience of Fr Polycarp Lamma, a Catholic parish priest in the diocese of Jalingo, northeast of Nigeria, who has witnessed the ongoing persecution of Christians at the hands of Muslim herdsmen.\nFr Lamma was in Malta to raise awareness on these brutal killings, on the initiative of Aid to the Church in Need – a worldwide Pontifical Foundation focusing on assisting the Church in areas around the globe where Christians are oppressed and persecuted.\nHe recounts that the troubles started in 2014, when Fulani herdsmen, a semi-nomadic, pastoralist ethnic group living in the central regions of Nigeria, intensified their raids on farms belonging to Christians.\nFr Polycarp Lamma (right), who in June last year narrowly escaped death from Fulani Herdsmen by hiding under a pile of rubbish. Mr Solomon Yuhwam (left), a farmer, saved himself after pretending to be dead. Photo: Mark Zammit Cordina\nThough such clashes over grazing land in the region known as the Middle Belt go back centuries, it was only in recent years that tensions escalated.\nBorn in 1971, Fr Lamma was ordained priest in 2007 and eventually became a parish priest.\n“We lived in peace till 2014, when Fulani herdsmen committed a serious attack in the village. They burned everything down, including 43 religious centres, including the parish hall,” he recounted.\nThey burned everything down, including 43 religious centres, including the parish hall\nHe insisted that the attack was religiously motivated.\n“When they attack they shout Allah u Akbar, and start shooting, but not before alerting Muslim farmers about their intention,” he added.\nIn June last year, on June 5, which happened to be his birthday, Fr Lamma had a close shave with death. “They surround you and the only way to avoid death is to try and escape or hide. Fortunately, when they use guns, we hear them coming and have a greater chance to flee.”\n“I hid under a heap of rubbish and spent four hours concealed, until about 4.30am when the attack was over,” he told Times of Malta.\nThese attacks were not isolated incidents. It is estimated that thousands have already perished.\n“Most of them are shot dead, but when the bullets run out they turn to machetes and even axes,” he recounted.\nSolomon Yuhwam, a Catholic farmer of trees, who accompanied Fr Lamma during his short visit to Malta to share their experiences, bears the scar of such an attack on his right hand. He recounts that he only survived by a miracle, after throwing himself among the corpses of his fellow villagers who were not so lucky.\nFr Lamma accused the Nigerian authorities of turning a blind eye, including Nigerian President Muhammadu Buhari whom, he says, has never condemned these attacks.\n“People are sometimes arrested but they are released within days,” he says.\nFr Lamma said his visit to Malta was part of his mission to raise global awareness about the ongoing persecution regardless of the consequences that he may face when he returns home.\n“I am a priest, have no children, no wife. This is my mission and I trust God will protect me,” he added.", "comment_count": 22, "id": 1568}, {"keywords": "", "author": "", "article_body": "It was time for a comprehensive register of contractors, architects told the government earlier this week. \nThe chamber of architects say the current building regulations are ‘outdated and insufficient’.\nThe chamber of architects, known as Kamra tal-Periti, met with Planning Parliamentary Secretary Chris Agius on Thursday to discuss their vision for an overhaul of the current building regulations, which they warned are both “outdated and insufficient”.\nRepresentatives of the Building Regulation Office (BRO) and the Building Industry Consultative Council (BICC), as well as consultants appointed by the government to oversee the establishment of a new authority which is intended to regulate the industry, were also present for the meeting.\nIn his presentation on the proposals, chamber vice-president André Pizzuto called for the “dire need” for a comprehensive register of contractors. \nMr Pizzuto told Times of Malta when contacted contractors should also be insured.\nThey would have to have a certain level of competence, and they would also need to be able to certify their own work.\n“To be able to do that they will need to have a certain level of qualifications, training and standards. Ultimately this will promote safety and quality,” Mr Pizzuto said, adding that the chamber was also proposing that contractors would have adequate insurance. \nThe chamber was also proposing the consolidation of various regulators within this new authority, the importance of contemporary regulations which were not prescriptive but performance-based, and the promotion of a self-regulatory approach by the various professionals involved in the construction process.\nThe chamber’s proposals, he said, were received positively, and discussions will continue in the coming months. The chamber is expected to publish its proposals in full in the coming days. \nUltimately this will promote safety and quality\nMeanwhile, Simone Vella Lenicker, president of the Kamra tal-Periti, said the proposals had approved by an extraordinary general meeting of the chamber held last November.\nThe chamber, she said, was available to participate in discussions regarding the formulation of new building regulations, as well as the technical expertise of its members to ensure the highest standards within the sector.\nLast year the government announced that a new authority was to be set up to enforce construction rules, overhaul existing legislation and take over responsibilities currently under the remit of various entities and boards.\nThe Malta Construction and Building Authority, as it will be called, aims to be the “port of call” for stakeholders and the public and will take over the Building Industry Consultative Council, the Building Regulations Office, Building Regulations Board and the Masons’ Board.\nFormer Lands Authority CEO Carlo Mifsud has been tasked with coordinating the setting up of the new regulator.", "comment_count": 2, "id": 1569}, {"keywords": "", "author": "Claire Caruana", "article_body": "A course aimed at equipping Mcast students with enough credits to make them eligible for an engineering warrant is shrouded in mystery.\nEngineers have expressed concern with Times of Malta that while the course is expected to start in the coming weeks, with the deadline for applications being next Monday, there is no information on what the course will entail. When they attempted to seek further information, the engineers said they were told only those on the college’s list could ask for details.\nThe course is being offered to those students who graduated recently and whose Mcast qualification was until last year deemed to be “vocational” by the Engineering Profession Board and not eligible for professional recognition.\nThe issue has repeatedly made headlines in recent months after engineers questioned the courses being offered by Mcast after the college refused to supply the programme’s syllabus.\nThe deadline for the submission of applications is Monday\nIn January, a group of some 150 engineers, calling themselves the Warranted Engineers Action Group (WEAG), said they were mulling legal action against the government board for refusing to publish a report auditing the Mcast programme.\nIt has now emerged that information on the pre-warrant course is also not being supplied, with the only information available being a notice in The Sunday Times of Malta asking interested students to send an e-mail to the college.\nAccording to the notice, the deadline for the submission of applications is Monday. Questions to Mcast on how many students had applied for the course, how long it would run for and whether a limit on the number of applicants would be imposed remained unanswered by the time of writing. This newspaper also asked for a copy of the course’s syllabus, but this too was not supplied.\nIn a statement on its website, the Chamber of Engineers said that the Engineering Profession Board has reviewed the pre-warrant course, confirming that it is due to start this month.\nAccording to the Chamber, the board has found the content of the pre-warrant course “satisfactory”, pointing out that an independent external audit will be carried out while the course is running.\n“It is only once this bridging course has been scrutinised further by the external reviewers that the bridging study will be considered satisfactory,” the Chamber insisted. It also pointed out that the attainment of the credits will be tested through formal examinations.", "comment_count": 16, "id": 1570}, {"keywords": "", "author": "", "article_body": "A 40-year-old man from Żejtun was on Saturday remanded in custody after pleading not guilty to a series of charges including hold-ups, thefts from elderly people, causing grievous injuries and holding people against their will.\nThe hold-ups were carried out over the past two months. They were carried out on shops in Żabbar, Għaxaq, Birkirkara and Sliema. The thefts, of handbags from elderly persons, took place in Sliema and Żurrieq. Other thefts were from vehicles in various localities around Malta.\nCharles Farrugia was also charged with being a relapser and repeatedly breaching bail.\nWhen prosecuting inspector Fabian Fleri declared that there were some 18 eyewitnesses and victims, lawyer Franco Debono said bail would not be requested at this stage.\nInspector Fleri explained that victims had identified a particular Mitsubishi usually driven by the accused and the mobile localisations of the accused coincided with the places thefts took place. He also said the police found some of the stolen items in the accused’s possession.\nLawyer Damien Cassar also appeared for the accused. Inspectors Lydon Zammit and Christina Delia also prosecuted. The case was heard by Magistrate Aaron Bugeja.", "comment_count": 0, "id": 1571}, {"keywords": "", "author": "Jacob Borg", "article_body": "The exclusion of revenues from passport sales was partly responsible for a €70 million deficit registered in the government consolidated fund for 2018, Times of Malta has learnt.\nA few million light? Finance Minister Edward Scicluna brandishing the famous budget bag. Photo: Chris Sant Fournier\nThis comes despite multiple assurances by Finance Minister Edward Scicluna that the government would still register a surplus without the controversial cash-for-passports scheme, which sees EU passports sold to rich foreigners.\nJustice Minister Owen Bonnici provided similar assurances to the European Parliament’s financial crimes committee in February.\nThe International Monetary Fund this year warned that Malta’s high reliance on the IIP scheme and corporate tax meant government finances were vulnerable to external shocks.\nA total of €163.5 million in revenue was generated for the government from the IIP scheme in 2016.\nThe Opposition was last month quick to pounce on news of the deficit, saying taxpayers were being forced to foot the bill for government corruption.\nIn reply to questions by Times of Malta, the Fiscal Advisory Council played down concerns about the consolidated fund deficit.\nThe council noted that projections of a surplus were conditional on information available at the time of their preparation, and hence deviations were possible.\nA deficit is not of major concern to the council\nIt said the consolidated fund was only a starting point for the compilation of the general government fiscal balance, in relation to which fiscal rules in Malta and the European Union applied.\nThe council highlighted two main differences, which were relevant to help differen-tiate between these statistics better.\nConsolidated fund transactions were recorded on a cash basis, and thus did not capture revenue which was due but had not yet been collected, and it also did not capture the bulk of revenues from the IIP scheme, which were to be considered as normal government revenues, in line with EU regulations, the council said.\n“In view of these caveats, the fact that the consolidated fund recorded a deficit is not of major concern to the council, as this does not exclude the possibility of the general government fiscal balance recording a surplus,” the council said.\nThe council will be issuing an assessment on the actual and planned general government fiscal balance for 2018 later on this year.\nFinance Minister Edward Scicluna said in a statement last month that the deficit was a result of “record” expenditure on capital projects in 2018.\nProf. Scicluna said that for every €2 invested in capital projects in the last year of the PN administration in 2012, the government had in 2018 invested €5 in capital projects.\n“This strong investment in capital projects is testament to government’s vision to build the Malta of tomorrow by strengthening the country’s infrastructure,” the Finance Minister said.\nPublic debt has been on a downward trend in Malta since the Labour government returned to power in 2013.", "comment_count": 159, "id": 1572}, {"keywords": "", "author": "", "article_body": "Major repair works will be carried out in 17 roads in Buġibba and Qawra to ensure they are safe to residents, visitors and workers until they are rebuilt as part of the ongoing €700 million nationwide road upgrade programme.\nSeveral of the agency’s contractors will start repairing the surface of these roads Monday, Infrastructure Malta said.\nWorks will continue until early the following week, except for Good Friday and the Easter weekend.\nThe roads include Triq Isourd, Triq Toni Bajada, Triq Ċensu Tanti, Triq iċ-Ċagħaq, Triq l-Ibħra, Triq il-Ġifen, Triq Sant’Antnin, Triq il-Ħalel, Triq iċ-Ċern, Triq is-Sajjieda, Triq J. Quintinus, Triq Annetto Caruana, Triq il-Port Ruman, Triq il-Maskli, Triq l-Imħar, Dawret il-Gżejjer and Triq ir-Ramel.\nPedestrian access to these roads and their residences and businesses will be open at all times.\nHowever, parts of the roads will be closed to vehicles while works are in progress. Infrastructure Malta coordinated these works with the St Paul’s Bay council, which is putting up 'no parking' signs in all areas to be repaired.\nCars parked on these roads will be towed from Monday morning, in line with applicable regulations, so that the works can be carried out without delay, the authority said.\nRoads in Buġibba, Qawra developed extensive road surface damage through the years.\nThe works are part of the agency’s ongoing €700 million seven-year nationwide roads upgrade. Ten of the first residential roads that are starting being upgraded in 2019 as part of this investment are in St Paul’s Bay.\nThree of them, Triq it-Turisti, Triq il-Luzzu and Triq Għawdex, are already being rebuilt. The reconstruction of Triq San Pawl, one of the main roads of this locality, connecting Xemxija, St Paul’s Bay and Burmarrad, will start soon.", "comment_count": 24, "id": 1573}, {"keywords": "", "author": "", "article_body": "A 60-year-old woman was grievously injured on Saturday when she fell as she was going upstairs, the police said.\nThey said in a statement the accident happened in a house in Triq il-Kantilena, Naxxar. The woman is from Iklin.\nShe was taken to hospital by ambulance.\nThe police are investigating.", "comment_count": 0, "id": 1574}, {"keywords": "", "author": "", "article_body": "Malta can start overcoming corruption only when it acknowledged that it was being suffocating by it, Reżistenza said in a statement on Saturday.\nEarlier, it placed the \"see no evil, hear no evil, speak no evil\" monkeys political maxim with a banner saying 'Omertà' in front of the police headquarters in a protest stunt.\nIt said in a statement many failed to recognise corruption as a problem and perceived it to be an essential component of Maltese culture and a contributor to economic prosperity.\nThe Maltese institutions, it said, were on their knees, exhausted from a cocktail of incompetence and collusion.\nIt noted that in 2016, as soon as the director of the Financial Intelligence Analysis Unit Manfred Galdes presented to the Commissioner of Police Michael Cassar an FIAU report pointing the institution's finger at individuals in the highest echelons of Maltese political power, he went out on sick leave, and soon after, resigned. Within three months the director himself resigned.\nA serious democracy did not let such episodes pass unnoticed.\nThe police did not serve its duty, and refused to take criminal action against politicians and people in high public roles who criminally abused the faith entrusted to them by the public.\n\nReżistenza also said that no interrogations took place with any politician or any person in a public role with a connection with the murder of Daphne Caruana Galizia.\n“This is not acceptable. It is useless to be told the investigation is a complicated one. Other countries’ police identified the masterminds behind similar homicides. Why not in Malta? Why does nobody bear responsibility for this? The truth is that there is no will for such a discomforting truth to be established publicly...”\n“We are determined to find the whole truth, to see that who is corrupt receives the sentence they deserve, and that whoever was bound by the law to stop such abuses and failed to do so answers for their omissions,” it said.", "comment_count": 114, "id": 1575}, {"keywords": "", "author": "", "article_body": "Updated 8.45pm with UNHCR comment\nMigrants stranded for days on board a humanitarian ship are to be redistributed among Germany, France, Portugal and Luxembourg, the government said on Saturday.\nThey will be taking in the more than 60 stranded on the German rescue ship Alan Kurdi off Malta.\nThe migrants arrived in Haywharf around 6.30pm.\nIt said in a statement that none of the migrants will remain in Malta and the ship will not be allowed to enter port.\nA young migrant is inspected upon arrival in Malta. Photo: Mark Zammit Cordina\nA total of 64 migrants, including 12 women and a baby, were picked up off the Libyan coast on April 3.\nThe rescue ship, operated by the German charity Sea-Eye, is the latest to be left adrift off the coast of Europe where governments are increasingly trying to push migrants back towards Africa.\nSea-Eye initially tried to land on the Italian island of Lampedusa but Italy's far-right Interior Minister Matteo Salvini - who has turned away several rescue ships in the past year - rejected the migrants, saying that Berlin should take them instead.\nThe migrants arrived after an 11-day ordeal. Photo: Mark Zammit Cordina\nHe eventually agreed to let two minors and their mothers disembark, but they refused to do so without the children's fathers, who were not allowed off the ship. The ship then headed towards Malta.\nMalta refused to let rescued migrants land but made an exception for two women who were evacuated to Malta because they were in urgent need of medical attention. \nMaltese authorities also authorised food and water to be delivered to the vessel, which had been forced to ration supplies.\nThe rescued migrants and 17 crew were all sleeping in a room designed for 20 people. Around a third of those rescued are suffering from sea sickness, Sea-Eye said.\nMediterranean should be renamed 'death zone'\nThe Sea-Eye NGO said the lives of 64 people are now in the hands of people who needed 10 days to negotiate “simple, fundamental and humanitarian” issues.\nIn a harshly-worded statement, the NGO said it could not understand why it was necessary for migrants to remain stranded on board while governments engaged in negotiations.\nSea-Eye said the Maltese authorities appeared to expect the Alan Kurdi to navigate to a Tunisian port.\n\"We are not aware that the Italian Coast Guard or the Maltese amy ever brought people rescued from distress at sea to Tunisia. We don't understand why they again and again want to force us to break the law,\" said Jan Ribbeck, Sea-Eye’s head of operations.\nThe NGO said eight people drowned in the past days, because the Libyan coastguard first had to be alerted by other rescue centres of a sea emergency in their area of responsibility.\n\"If you give Libya responsibility for a search and rescue zone, you have to be able to ensure that Libya can live up to that responsibility. At the moment this is not the case. So who is responsible?,” spokesman Gorden Isler said.\n“If Libya cannot exercise this competence, then Europe has created a search and rescue zone for which nobody is responsible anymore.”\nAmid the recent political developments, Mr Isler said the International Maritime Organization should declare the central Mediterranean sea area a “death zone” and not a search and rescue zone.\nThe situation on the Alan Kurdi had been going from bad to worse. Photo: Sea-Eye\n'Unnecessary pressure'\nThe Alan Kurdi is named after the three-year-old Syrian boy whose body washed up on a Turkish beach at the height of the European migrant crisis in 2015. Pictures of his lifeless body caused a global outcry over the migrants' plight.\nThe government thanked the European Commission for coordinating the matter and the four states for their intervention.\nIt said that once again, the smallest member of the European Union was put under unnecessary pressure by being asked to resolve a case which was neither its responsibility nor its remit.\nA solution was found not to let the situation deteriorate further while making it clear Malta could not keep shouldering this burden.\nMalta called on the NGOs to abide by all applicable conventions and regulations.\nFrance, Spain, Germany and other EU countries have stepped in on several occasions in the past year to take in migrants rejected by either Italy or Malta.\nIn a short statement on Saturday night, the UNHCR said the migrants were relieved that the ordeal is over.\nIt thanked the Maltese government of Malta for allowing the disembarkation and France, Germany, Portugal and Luxembourg for showing solidarity in relocating.\nHowever, UNHCR stressed the need for predictable mechanisms to ensure timely disembarkation in a safe port.", "comment_count": 0, "id": 1576}, {"keywords": "", "author": "Sarah Carabott", "article_body": "Jingjing Xu has only spent five months in Malta and can already hold a fluent conversation in Maltese.\nThe 30-year-old first heard of the Maltese language at the Beijing Foreign Studies University, where she teaches.\nIn the past, the language used to be taught at the university by Maltese lecturers. However, when Dr Xu saw that the teaching post had remained vacant over the past few years, she travelled to Malta herself.\nDr Xu plans on spending a year here as a visiting scholar at the University of Malta’s Department of Maltese, before heading back to her university to teach Maltese there.\nHolding a whole conversation with Times of Malta in Maltese, she explained that she will be the first Chinese lecturer teaching the language at the Beijing Foreign Studies University.\nLearn the language of a place that has such a rich history\nBut why would Chinese students want to learn Maltese?\n“I believe that there are Chinese people who would like to come to Malta to study and work, while there are others who are interested in learning the language of a place that has such a rich history,” she said.\nOne of the things that gives Malta an edge over other languages is its unique way of bringing together the lexical structure and grammar of other languages, such as Arabic, English and Italian.\nAsked whether she thought Maltese or Chinese was more difficult to grasp, Dr Xu said that she initially believed Maltese was really challenging. However, the Department of Maltese soon came to the rescue.\nStill, Dr Xu admitted that Maltese was not easy compared to other languages she has studied – such as Japanese, Italian and English. Once back in Beijing, she plans on continuing streaming and listening to Maltese radio and TV programmes, while also translate literary works.\nDr Xu finds local expressions unique to the island to be quite interesting, and believes mela is “very cute”.\nHowever, her favourite Maltese word remains dehen (roughly translated to reason, sound judgement, discernment or genius) which features in the national anthem, and sounds similar to deheb (gold).\nDr Xu, who loves the word’s unique meaning, has even come up with a phrase: id-dehen jiswa mitqlu deheb, which translates to ‘sound judgement is worth its own weight in gold’.\nWatch Dr Xu speaking in Maltese on www.timesofmalta.com.", "comment_count": 56, "id": 1577}, {"keywords": "", "author": "", "article_body": "Two men were injured in an argument in St Paul’s Bay early on Saturday.\nThe police said a knife is believed to have been used in the argument, between a 30-year-old Nigerian who lives in St Paul’s Bay and 37-year-old Nigerien, who lives in Gżira.\nThe argument took place in Triq it-Tamar at 1.30am.\nThe older man suffered grievous injuries, the younger one slight.\nAn inquiry is being held.\nThe police are investigating.", "comment_count": 0, "id": 1578}, {"keywords": "", "author": "", "article_body": "Two men were injured, one of them grievously, in a traffic accident in Żejtun on Friday evening.\nThe police said the accident happened in Triq Alfredo Cachia Zammit at 11.30pm.\nA Volkswagen Golf that was being driven by a 19-year-old from Żejtun was involved in a collision with a Kia Picanto that was being driven by a 30-year-old, also from Żejtun.\nBoth were taken to hospital by ambulance. The 19-year-old suffered grievous injuries, the 30-year-old slight.\nThe police are investigating.", "comment_count": 0, "id": 1579}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Saturday’s newspapers.\nTimes of Malta says just over 700 motorists were found guilty of driving under the influence of alcohol after more than 1,000 tested positive in breathalyser tests between 2009 and 2016. In another story, it says Maltese researchers are currently working on a new €195,000 project set to create an artificial intelligence “pilot”.\nThe Malta Independent quotes the French newspaper Le Monde saying that Prime Minister Joseph Muscat was one of five European leaders against a long Brexit extension.\nIn-Nazzjon says that not even the Prime Minister was willing to publish the Corinthia deal before the May elections.\nL-Orizzont says Kendrick Bondin has been appointed secretary of the General Workers’ Union Government and Public Entities section.", "comment_count": 0, "id": 1580}, {"keywords": "", "author": "Claire Caruana", "article_body": "Just over 700 motorists were found guilty of driving under the influence of alcohol after more than 1,000 tested positive in breathalyser tests between 2009 and 2016, official data shows.\nAccording to figures supplied by the police, 702 people were found guilty after being arraigned for driving under the influence of alcohol in the period under review.\nDuring the same period, 1,149 drivers had tested positive when taking a breathalyser test and were subsequently charged in court. Another 349 drivers were found not guilty of the charges brought against them and 99 cases are still pending.\nThe figures were supplied to the newspaper during a conference on drink-driving organised by the Malta Insurance Association.\nMadam Justice Consuelo Scerri Herrera told the conference there seemed to be a misconception on the interpretation of the term “reasonable suspicion” that allowed police officers to carry out tests on those they believed to be driving under the influence of alcohol.\nPolice officers can only ask a driver to take a test if they have what is described by the law as a ‘reasonable suspicion’ that the motorist is driving after having consumed more alcohol than is allowed.\nThe judge said traffic policemen tasked with conducting breathalyser tests on those suspected of driving under the influence of drink, required more training to know when they could test drivers.\n“The term [reasonable suspicion] has to be given a wider interpretation and the officers on the road need more training. The amount of traffic accidents taking place every day runs into the thousands. Does it not warrant more tests? Yes, I think it does,” Madam Justice Scerri Herrera said.\nReferring to the high number of drivers who were being acquitted, the judge noted that a good number of the tests carried, “unfortunately”, were often not “thorough” enough. She pointed out that some breathalyser tests were also taken too late.\nInsurers unveiled a series of amendments to the law which they plan to push in the coming months. These include introducing provisions on mandatory testing at road blocks, drug tests and increasing fines to at least €3,000 in the case of a first conviction.\nThey have recently expressed concern that the lowering of drink-driving alcohol limits had little to no impact on traffic accidents, with intoxicated motorists still getting behind the wheel.\nAlcohol limits for motorists were cut to almost half last year but the impact was so “minimal” that insurance companies re-ported no improvements in accidents involving drivers who had consumed too much drink.\nInsurance companies have since called for stepped up enforcement and harsher fines, insisting that the lowering of limits alone would not result in much improvements and motorists would continue to drink alcohol even when they know they would be driving.\nAccording to the revised rules, motorists are considered to be under the influence of alcohol if they are found to have 22 microgrammes of alcohol in 100 millilitres of breath.\nThis means that a man of average build is limited to just under a pint of beer or a large glass of wine while women can consume no more than half a pint of beer or a small glass of wine.\n ", "comment_count": 11, "id": 1581}, {"keywords": "", "author": "", "article_body": "Hauliers have denounced the “lax controls” at Maltese ports saying they are incurring losses due to the fact that unlicensed operators are being allowed to pick up cargo in breach of clear provisions in the law.\nIn a statement, the hauliers section within the GRTU – Malta Chamber of SMEs pointed out that, according to the Cargo Clearance and Transport Act, nobody could serve as cargo clearance and forwarding agent without a permit from the Comptroller of Customs.\nThe GRTU said its complaints seemed to have fallen on deaf ears, saying it had been raising the issue for a long time but to no avail. In this respect, it expressed its utter disappointment at the comptroller’s “irresponsible” behaviour.\nThe hauliers warned they would be holding the Commissioner for Inland Revenue responsible for the losses and damages they were incurring, reiterating their appeal for the laws to be enforced.\nFurthermore, the section urged its members to ensure that the sticker permit issued by Customs would be clearly visible on their registered vehicle to facilitate enforcement.\nThe GRTU noted that this situation was denting the competitiveness of law-abiding hauliers while conveying the message that anyone flouting the laws could do so with impunity.\nContacted by this newspaper, hauliers section president Karmenu Zammit lamented that anyone turning up with a truck was being allowed to act as a cargo and forwarding agent.\nHe said a few months ago, the Customs Department had issued stickers to licensed operators but the measure was only enforced for a few weeks.\n“If the government wants to liberalise the sector, the way to go about it is to sit down with us and discuss what level of compensation is due,” he said.", "comment_count": 8, "id": 1582}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A turnkey contractor, who had been paid some €19,000 for a project at a Sliema residence which he failed to complete, was cleared of misappropriation since the criminal action was time-barred.\nAmad Aluwyad Nabil Mahmoud, 44, had signed a contract for €30,000 for turnkey services at the residence of a woman against a €7,500 deposit paid in cash upon conclusion of the agreement.\nTen days later, when the works had already kicked off, the contractor had requested a further payment of €9,000, claiming that he needed the funds to purchase materials.\nHowever, his workmen had allegedly told her that they had not been paid their wages.\nA couple of days after the second payment, the man had turned up at the woman’s house, towards midnight, kicking up a fuss, shouting and demanding a further €2,500, threatening to quit the job unless she handed over the money, which, in fact, she did, the woman explained later in court\nHowever, some time later, the man had simply vanished into thin air, with the woman turning towards his lawyer and alleging that he was aware of the fraud committed by his client.\nAfter a lapse of one year or so, the contractor eventually turned up once again, claiming to have left the island after running into financial problems, even being targeted by proceedings for sale by auction.\nCriminal proceedings for misappropriation were instituted against him, during which his lawyer, Dr Roberto Montalto, had taken the witness stand after being duly released from professional secrecy, explaining how he had personally suggested to the alleged victim to take her grievance to the police.\nThe lawyer also pointed out that the woman had never reported the alleged threats by his client, had never put forward any valuations of the works done and those left unfinished, and had not sought a remedy by means of any civil action.\nAfter being declared guilty and conditionally discharged for three years in 2016, the accused’s case was sent back to the Magistrates’ Court upon appeal on account of the fact that the prosecution had never concluded its evidence stage.\nWhen the case was assigned anew, the court, presided over by magistrate Caroline Farrugia Frendo, observed that there was no evidence whatsoever of the value of the works carried out before the accused abandoned the project.\nMoreover, although the case dated back to 2009, the man had first appeared in court in 2015, the court observed, concluding that the action was time-barred given that the prescriptive period was that of five years.\nLawyer Roberto Montalto was defence counsel.", "comment_count": 0, "id": 1583}, {"keywords": "", "author": "", "article_body": "The government was willing to discuss 5G technology before the Parliamentary Health Committee, the Parliamentary Secretariat for Innovation said, welcoming the Democratic Party's request. \nParliamentary Secretary Silvio Schembri said in a statement that no licence has been issued by the Malta Communications Authority related to the transmission of mobile services of experimental or commercial matters related to 5G.\nThe secretariat also noted that the MCA checked the levels of electromagnetic radiation from radio communications sources regularly to ensure that they were in conformity with the standards established by the International Commission for Non-Ionising Radiation.\nThese criteria were recognised by international institutions such as the World Health Organisation and the EU’s Scientific Committee.\nMeanwhile, the European Commission has repeatedly stated that to date it has not found any scientific justification to revise the limits set by Council on the exposure of the general public to electromagnetic fields.\n“The health and digital security of our citizens is of utmost priority and they will not be bartered for profits. The government is in continuous discussions with the relevant international institutions and closely following developments on these matters.\"", "comment_count": 3, "id": 1584}, {"keywords": "", "author": "", "article_body": "Updated at 5.15pm with GRTU\nInconsistencies in public procurement are not acceptable and run counter to the very principle of a fair and open tendering process, the Malta Chamber of Commerce, Enterprise and Industry said on Friday.\nThe chamber said it was “dismayed” about recent reports which only come to the fore in the media.\nThe chamber did not specify which report it was referring to but the Times of Malta recently reported that a controversial call for tenders issued in December for a multimillion-euro cleaning contract at St Vincent De Paul Complex had to be suspended amid objections to the conditions imposed.\nRead: Crucial tax clause removed from St Vincent de Paul €12 million-cleaning tender\n“The chamber is aware and happy to note a ruling by the Public Contracts Review Board which clearly admonished the contracting authority in question and ordered it to correct its inconsistencies,” it said, however it lamented that had there been no appeal to this process, the inconsistencies may have gone unnoticed.\n“This would have created a serious and dangerous precedent for law-abiding companies and taxpayers,” it warned, adding that under no circumstance should tenders be adjudicated to any businesses or company directors that are found to be in breach of any law or obligation, fiscal or otherwise.\nThe chamber said that transparency and good governance in public procurement processes was fundamental to ensure a level playing field within a business environment.\nGRTU calls for transparent investigation\nAccording to the GRTU - Chamber of Small and Medium Enterprises, the case shed a bad light and instilled doubt on the good governance and transparency of the public procurement system.\nAlthough GRTU positively noted the decision to reverse the illegal intervention, it said it was disappointed that bidders had to resort to the avenues of appeal in order to protect and safeguard their interest.\n“A small business would simply have given up and end up losing on what is his due to irregularities and inconsistencies.\n“Fighting such unfairness is more taxing on the smaller businesses, which have limited resources to pour into legal remedies,” CEO Abigail Mamo said.\nGRTU called for a fool-proof mechanism to monitor these irregularities and pro-actively avoid such situations.\nIt insisted that such cases must be thoroughly investigated and the root of the issue uncovered in a transparent manner, and resolved through.", "comment_count": 8, "id": 1585}, {"keywords": "", "author": "Denise Grech ", "article_body": "Tourism Minister Konrad Mizzi said the European Commission would no doubt be scrutinising the Corinthia land deal, which the government decided to review amid opposition by various quarters.\nThe original deal with Corinthia, which Dr Mizzi had already presented to Parliament’s National Audit Office Accounts Committee, had to go back to the drawing board after a number of businessmen warned it could be scrutinised by Brussels as it amounted to state aid, thus breaching EU rules.\nThe original deed would have seen the Corinthia Group pay a €17 million premium for a commercial concession in St George’s Bay estimated to have a market price of €700 million.\nColliers International was appointed to valuate the new deal so that the report could be presented to the European Commission “if needs be”, Dr Mizzi said, adding the government wanted a company of international repute that was independent from Malta.\nSame basis of the deal negotiated with db Group\nColliers International is a global real estate services company which has Corinthia among its clients. The original Deloitte valuation had been made “on the same basis of the deal negotiated with db Group”, Dr Mizzi had told the parliamentary committee last December. The db Group was allocated the area where the former Institute of Tourism Studies used to stand. The deal had also sparked off a controversy because of the low premium the developers would be paying.\nThe Deloitte valuation was not scrapped, Dr Mizzi said, adding that the parameters of the deal had simply changed. The new negotiations would ensure there would be no land reclamation and the foreshore would remain accessible, he said.\nOnce the new valuation was done it would be submitted to Cabinet, Dr Mizzi added, insisting that he was simply implementing a decision by the government.\nPro-environment NGOs had objected to the project and demanded that a preliminary memorandum of understanding between the government and Corinthia would be published. Dr Mizzi rejected the request but said the final contract would be made public.", "comment_count": 31, "id": 1586}, {"keywords": "", "author": "Sarah Carabott", "article_body": "An architects' firm is proposing a motorsport racetrack in the Ħal Far Industrial Estate which does not overspill onto ODZ land.\nPeriti Studio has unveiled a polished version, in consultation with the Malta Motorsport Federation, of the proposal that they first published in November.\nThe track, which is in line with international motorsport framework and requirements, is being proposed for the Ħal Far site as it is the only location that could potentially incorporate the track without causing an overspill onto ODZ land.\nAccording to architect Nicholas Mallia, the proposal is a fully-fledged Fédération Internationale de l'Automobile approved race track of two kilometres or 3.1 kilometres, which is suitable for motorcars and motorbikes.\nThe facility includes an independent go-carting race track and a road safety facility for motorists’ skills training.\nHe said that good planning required a detailed study of the residual capacity of the industrial estate and discussions with the Malta Industrial Parks.\n“We hope to be given the opportunity to discuss the proposal with stakeholders and authorities because we are confident that this is the only viable site for a racetrack in Malta.”\nMr Mallia called on motorsport enthusiasts to stand together and “help drive the message that a race track in Malta deserves serious consideration”.\nThe Malta Motorsport Federation has meanwhile taken to social media to share the firm’s proposal.\nIn February, the federation expressed its concern over the lack of progress in the government plans of constructing a motor-racing track.\nFor months, the government had reiterated its plans to build a track, but so far the plans remained shelved, much to the frustration of the MMF and motorsport enthusiasts.\nThe federation had said that despite presenting a feasible proposal for the development of a Road Safety and Motorsport Facility, it did not receive feedback from the authorities.\nIn 2016, the government had said it received five expressions of interest for the design, construction and operation of a Motor Recreation and Education Park.\nThe government's racetrack proposal had sparked controversy, especially since it had not been excluded that such a circuit would be built in an ODZ.", "comment_count": 70, "id": 1587}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Two men arrested on Thursday in two separate cannabis hauls were remanded in custody on Friday after pleading not guilty to drug-related charges during successive arraignments.\nJames Micallef, a 25-year-old Birkirkara resident, was stopped by police at the wheel of his car and was found to be carrying some five kilos of cannabis resin, which had allegedly just been collected from another man, leading the police to the second and larger haul.\nA visit to a farmhouse in the limits of Mosta led to the arrest of Leo Galea, 40, in whose possession the police discovered some 10 kilos of cannabis resin and two unlicensed revolvers.\nBoth men were charged with conspiracy to traffic drugs, trafficking cannabis resin as well as possession of the drug in circumstances denoting that it was not intended for personal use.\nMr Galea was also charged with the unlicensed possession of the weapons.\nMr Micallef was further charged with having breached two earlier bail decrees, the first granted in 2017 in relation to proceedings for the possession of 100 grams of cocaine and the second, delivered in June 2018 in proceedings related to the alleged possession of over 100 kilos of cannabis.\nBoth men on Friday pleaded not guilty and requested bail, which was denied by the court, presided over by magistrate Natasha Galea Sciberras.\nThe court issued freezing orders upon all assets of both accused.\nInspector Frank Anthony Tabone prosecuted. Lawyer Gianluca Caruana Curran was counsel to Mr Micallef. Lawyers Edward Gatt and Ishmael Psaila were counsel to Mr Galea.", "comment_count": 0, "id": 1588}, {"keywords": "", "author": "", "article_body": "Updated 1.50pm\nFrance said Friday that it and other EU nations would take in more than 60 migrants stranded on a German rescue ship off Malta which has refused to let them disembark unless other countries help.\n\nInterior Minister Christophe Castaner said on Twitter he had spoken with his Maltese counterpart about the 64 migrants, including 12 women and a baby, picked up off the Libyan coast on April 3.\n\"I confirmed that France, like Germany and several other European partners, will show solidarity and welcome the refugees aboard the Alan Kurdi, allowing them to disembark at Valletta,\" Castaner wrote.\nThe rescue ship, operated by the German charity Sea-Eye, is the latest to be left adrift off the coast of Europe where governments are increasingly trying to push migrants back towards Africa.\nSea-Eye initially tried to land on the Italian island of Lampedusa but Italy's far-right Interior Minister Matteo Salvini - who has turned away several rescue ships in the past year - rejected the migrants, saying that Berlin should take them instead.\nHe eventually agreed to let two minors and their mothers disembark, but they refused to do so without the children's fathers, who were not allowed off the ship. The ship then headed for Malta.\nCastaner said that officials from the interior ministry and the French refugee agency would be sent to Malta \"in the coming hours to facilitate the transfer to France of 20 people needing protection\".\nIn Berlin, an interior ministry spokesman confirmed to AFP that Germany was also \"ready to do its part\".\nFrance, Spain, Germany and other EU countries have stepped in on several occasions in the past year to take in migrants rejected by either Italy or Malta.\nMalta has refused to let rescued migrants land unless it has a commitment from other EU nations that they will immediately take them.\nIt made an exception for two women who were evacuated to Malta because they were in urgent need of medical attention. \nMaltese authorities have also authorised food and water to be delivered to the vessel, which had been forced to ration supplies.\nThe rescued migrants and 17 crew are all sleeping in a room designed for 20 people. Around a third of those rescued are suffering from sea sickness, Sea-Eye said.\nThe Alan Kurdi is named after the three-year-old Syrian boy whose body washed up on a Turkish beach at the height of the European migrant crisis in 2015. Pictures of his lifeless body caused a global outcry over the migrants' plight.\nNGOs appeal\nIn a statement on Friday, 28 NGO appealed to the Prime Minister to resolve the standoff and urged Malta to allow the disembarkation of the migrants.\nThey reiterated that Libya could not be considered a safe port of disembarkation and forcibly returning migrants and Libyan nationals there would expose them to torture, sexual violence, arbitrary detention, discrimination and – in some cases – death.\n\"Whilst we appreciate the difficulties Malta faces due to Italy’s extreme stance on migration issues, we nonetheless appeal to the Prime Minister to prove that the nation may and will rise above this terrible race to the bottom. We can and must do better,\" they said.", "comment_count": 0, "id": 1589}, {"keywords": "", "author": "", "article_body": "Buccal swabs, taken from the suspects for DNA comparison tests, provided some animated discussion in another sitting as the compilation of evidence into the murder of Daphne Caruana Galizia resumed on Friday.\nBrothers George and Alfred Degiorgio together with Vincent Muscat, the three suspects behind the car bomb that killed the journalist metres away from her Bidnija home on October 16, 2017, sat at the dock surrounded by five armed guards, while a series of witnesses took the stand, tying up some peripheral and procedural issues.\nThe sitting became animated when Assistant Police Commissioner Dennis Theuma stepped forward to testify about the procedure adopted when buccal swabs were taken from the Degiorgio brothers while under police custody.\nThe high-ranking officer explained how the whole process had been conducted at the CID headquarters in the presence of the inquiring magistrate, AC Theuma himself and another police officer.\nOne of the suspects, Mr Muscat, had not consented to the test.\nDefence lawyer William Cuschieri asked the witness to state under oath whether the swabbing procedure and its purpose had been explained to the suspects beforehand and whether they had been granted the right to seek legal assistance at that stage.\nAlthough replying in the affirmative, upon being pressed further, AC Theuma said he “did not quite remember,” pointing out that he had not been present throughout the whole procedure but reaffirmed that he stood by the declarations which he had signed.\nThe witness insisted that the suspects had been told about the process involved in taking the mouth swabs, as well as their purpose, namely for DNA comparison tests.\n“After all, they knew the reason behind their arrest,” said AC Theuma, “namely in relation to the murder of Daphne Caruana Galizia.”\nDuring Friday’s sitting, a Europol expert who had assisted the Maltese police in the murder investigations, took the witness stand to correct a couple of minor details in the report exhibited earlier on in the compilation.\nAs the sitting drew to an end, the prosecution informed the court, presided over by magistrate Claire Stafrace Zammit, that all experts testifying in the compilation had already done so, save for one who was to report further on his findings.\nThe case was adjourned to May.\nInspector Keith Arnaud prosecuted. Lawyers William Cuschieri, Josette Sultana and Martin Fenech were defence counsel. Lawyers Jason Azzopardi and Eve Borg Costanzi appeared parte civile.", "comment_count": 0, "id": 1590}, {"keywords": "", "author": "Claire Caruana", "article_body": "Traffic police tasked with conducting breathalyser tests on those suspected of driving under the influence of drink need more training to know when they can test drivers, a judge said on Friday.\nSpeaking at a conference on drink-driving on Friday, organised by the Malta Insurance Association, Madam Justice Consuelo Scerri Herrera said there seemed to be a misconception on the interpretation of the term “reasonable suspicion”.\nAccording to the law, police officers can only ask a driver to take a test if they have what is called 'reasonable suspicion' that the motorist was driving after having consumed more alcohol than is allowed.\n“The term has to be given a wider interpretation and the officers on the road need more training. The amount of traffic accidents taking place every day go into the thousands. Doesn’t it warrant more tests? Yes, I think it does,” the judge said during her presentation.\nOn the high number of drivers who were being acquitted, the judge insisted that a good number of the tests that were carried out were often, “unfortunately”, not “thorough” enough.\nShe also pointed out that some breathalyser tests were also taken too late.", "comment_count": 24, "id": 1591}, {"keywords": "", "author": "", "article_body": "Kristy Debono is \"trying to take the nation for a ride\", a former ambassador has charged in a scathing attack after the Nationalist Party's general council president sought a sponsorship from the owner of once-secret company 17 Black.\nMs Debono described as an \"error of judgement\" her meeting with Yorgen Fenech, which was revealed by The Sunday Times of Malta last weekend. She was accompanied by PN MP Hermann Schiavone.\nRead: PN MPs meet owner of 17 Black to seek conference sponsorship\nUniversity lecturer Prof. Vicki Ann Cremona, a former ambassador to France and Tunisia during the Gonzi administration, said in a Talking Point in Times of Malta on Friday that if Ms Debono was naive in her judgement, then there is no place for her at the top rungs of the party.\n\"If she isn't, then the party needs to see why she initially lied, and take the necessary action.\"\nLast year, in a joint investigation by the Times of Malta and Reuters, Yorgen Fenech was identified as the owner of 17 Black, which had been named in leaked e-mails as one of two companies that would pay $2 million to Panama companies belonging to the Prime Minister’s chief of staff Keith Schembri and Tourism Minister Konrad Mizzi.\nProf. Cremona said that Ms Debono, more than anyone else in the party, should understand the gravity of asking for an encounter with anyone connected with Mr Fenech, \"his money-making resources and his lying cronies, such as Konrad Mizzi, Keith Schembri and the rest of their sorry lot\".\n\"Ms Debono’s inability to evaluate the consequences of asking for money, sponsorship or favours from a company he runs reveals – at the very least – total indifference to those ethical values that some members of her party, as well as those of civil society, are still trying hard to defend against all odds,\" she said.\nHer meeting has not simply dented the party’s anti-corruption credentials - it has gone at them with a sledgehammer.\nShe asks why with the exception of one MP, nobody in the Nationalist Party had uttered a word about such unacceptable behaviour.\n\"How sad that we are all holding our breath to see whether there remains, in fact, a real Opposition that goes beyond empty words, meaningless phrases and unimpressive action.\n\"It seems to have become a national pastime for some prominent politicians to lie publicly. What is worse, they are not held to public account for lying and made to answer for their offence towards the nation.\"\n \n ", "comment_count": 158, "id": 1592}, {"keywords": "", "author": "", "article_body": "Maltese researchers are working on a new artificial intelligence and machine learning-based system that will learn to fly like human pilots.\nThe system is intended to carry out high-level tasks, such as interpretation of weather information and the calculation of weather-avoidance manoeuvres, which are currently not automated on planes.\n“The proposed system will act as an 'artificial pilot' – supporting human pilots in challenging situations and, consequently, improving flight safety,” the University of Malta said in a statement.\nIt would  also help pilots recover from loss-of-control situations which go beyond the capabilities of current automation, such as aerodynamic stalls and spins.\nOn-board automation systems already existed, but pilots were left to handle the aircraft on their own should a critical sensor fail or should the aircraft enter an abnormal state. Most recently, a Boeing 737 Max crashed minutes into a flight, killing 157 people on board.\nThe system would seek to improve aircraft automation, the statement said, adding that pilots had to combine information from multiple sources and needed to reroute the aircraft should severely bad weather, such as a thunderstorm, be detected.\n“This requires the pilots to interpret the weather situation and to figure out the best way to avoid bad weather along their route,” the statement said. \nThe €195,000 project is funded by the Malta Council for Science and Technology.", "comment_count": 9, "id": 1593}, {"keywords": "", "author": "Sarah Carabott", "article_body": "The national dance company has increased its audience by 30% over a year as it continues to convince people that culture is for all, according to its artistic director.\nPaolo Mangiola is still aiming to triple the audience during his three-year tenure, something he aspired to do when he took the helm of ŻfinMalta National Dance Company in 2017.\nHe hopes that people would, one day, be as familiar with dance language as they are with film, insisting that culture is a necessary part of everyone’s lives.\n“The Maltese spend a lot of money to go abroad and experience culture, while they can access quite high-quality culture in Rabat, Valletta and across the island,” Mr Mangiola told Times of Malta ahead of the launch of its national tour tomorrow.\nPhoto: Matteo Carratoni\nThe one-hour performance in Victoria and later in Valletta  will be taking the audience on a journey of dance and is aptly called Voyager.\nVoyager, which premiered at the Manoel Theatre in Valletta last November, is inspired by the spacecraft’s golden records, which are two phonographs launched into space in 1977.\nThe records contain sounds and images that portray the diversity of culture on earth, intended for any intelligent non-human lifeform or for future human beings who might come across them.\nŻfinMalta hopes to continue drawing more and more people to its performances and has kicked off an outreach programme with Esplora.\nA moment in time that will happen only once\nCalled Movimento, the programme consists of monthly sessions with people just curious about dance, no matter who they are. There, they meet experts from the art world, such as visual artists, or a dramaturge, who provide their perspective of dance. This is aimed at helping people understand dance choreography better when they next turn up at the theatre. Photo: Matteo Carratoni\nBut ŻfinMalta will also be going the extra mile and will be reaching out to people.\nIts upcoming season, which marks its fifth anniversary and starts in September, has been dubbed a ‘digital season’. Apart from presenting its work at traditional spaces such as the theatre, the dance company will also produce digital work that can be accessed on mobile phones.\nWhy would people still go to the theatre if they can access dance on their phone?\n“To experience a live performance is to experience a moment in time that will happen only once,” Mr Mangiola replies passionately.\nApart from reaching out to the public, ŻfinMalta is also trying to bolster the local group of dancers.\nFor the first time last year it participated in the Żigużajg festival when 17 students, aged between 13 and 17, performed for seven days in a row to an 85 per cent filled theatre.\nFor the young teenage students, this was an opportunity to mingle with professionals and see whether they wanted to take up dance professionally. The dance company has also started holding monthly workshops where local dancers have access to internationally-renowned dancers without having to leave the island.\nThe upcoming national tour show dates are tomorrow, April 13, at St Agatha Auditorium, Rabat; April 27 at the Aurora Theatre, Victoria and May 3 at Pjazza Teatru Rjal, Valletta.\nMore information is available at www.zfinmalta.org", "comment_count": 1, "id": 1594}, {"keywords": "", "author": "", "article_body": "A man escaped with cash on Thursday evening following an armed robbery from a shop in Msida.\nThe hold-up took place in Dock Street at around 9.40pm.\nThe thief, who was hooded and armed with a knife, entered the shop and demanded money from the person who was manning the shop, a 33-year-old woman from Bosnia.\nThe police are investigating.", "comment_count": 0, "id": 1595}, {"keywords": "", "author": "", "article_body": "Alcohol, plastic bags and unused excise stamps have been seized by customs officials from a warehouse in Qormi.\nThe department said in a statement its officials were led to the warehouse following an inspection at a Gżira outlet.\nAt the Gżira outlet, they found alcoholic beverages bearing no excise stamps. The officials decided to check the warehouse from where the beverages derived and, following an extensive search, they ended up seizing 1,473 plastic bags, 162 bottles of alcoholic beverages, including rum, brandy and several liqueurs, 110 bottles of wine which did not have their excise tax paid, and 510 unused excise stamps.\nThe department encourages operators and establishments importing or selling excise goods to make sure that their business was in order, as there would be zero tolerance to unpaid excise dues or mismanagement of excise stamps.", "comment_count": 4, "id": 1596}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Three judges and three magistrates will be named in the coming weeks despite repeated promises by the government to change the “outdated system” of appointments, the Times of Malta is informed.\nIn what legal practitioners describe as “a big rush to fill vacancies with more appointments before a new system is put in place”, three sitting magistrates will be promoted to judges and three lawyers will be appointed to sit in the Magistrates’ Court.\nMagistrates Aaron Bugeja, Joanne Vella Cuschieri and Francesco Depasquale are expected to become superior court judges. \nNadine Lia, Bridgette Sultana and Victor Asciak are being named as the new magistrates.\nThis will be the second time that three magistrates will be promoted concurrently, a move interpreted by legal practitioners as “a subtle message” to sitting magistrates their promotion still depended on the government, at least for the time being.\nThe last time a lawyer was directly made judge was in 2016, with the appointment of former Labour Party deputy leader Toni Abela.\nDr Bugeja, a former lawyer at the Attorney General’s office who shot to the limelight a few months ago when tasked to conduct an inquiry into whether the Prime Minister and his wife owned Egrant, a Panama company, had been appointed magistrate in 2013.\nLegal sources said he had also applied for the post at the European Public Prosecutors’ Office. The nominee is expected to be chosen by a government-appointed selection committee soon. \nDr Vella Cuschieri is expected to be the first full-time judge to serve in the Gozo Courts. She was made a magistrate in 2014 after unsuccessfully contesting the elections on the Labour Party ticket a year earlier.\nLegal practitioners wondered why the job was not offered to Magistrate Paul Coppini, who had been serving in Gozo for decades.\nDr Depasquale, appointed magistrate in 2011, will follow in his father’s footsteps. Judge Franco Depasquale had retired in 2003 and he was replaced by Joe Azzopardi, who was appointed Chief Justice last year.\nThe three new judges would be leapfrogging other magistrates who have been serving for longer periods, the legal sources noted.\nAmong the new magistrates, the most controversial appointment was likely to be that of Nadine Lia due to her connections with the Labour Party, they added.\nAppointments mean more than half of the judiciary replaced in the past six years\nShe is the daughter-in-law of Pawlu Lia, Labour’s veteran lawyer who sits on the Commission for the Administration of Justice and also acts as the Prime Minister’s personal legal counsel. Dr Lia was put on the government’s payroll during the past few years with various advisory appointments, including to Economy Minister Chris Cardona.\nDr Asciak, the son of Environment and Resources Authority chairman Victor Asciak, and Dr Sultana, legal affairs director at the Health Ministry, are also expected to be named magistrates.\nThese appointments meant more than half of the judiciary would have been replaced in the past six years, most of the appointees being close to the party in government in various ways, the sources noted.\nApart from Dr Abela, the government appointed the former editor of the Labour Party’s newspaper KullĦadd, Lawrence Mintoff, the president of the Labour Party’s Gozo branch, Grezzju Mercieca, and Consuelo Scerri Herrera, sister of the Environment Minister, among others.\nAmong the 11 magistrates appointed so far by the current administration, three are former Labour candidates – Dr Vella Cuschieri, Joe Mifsud and Monica Vella – two are the daughters of former Labour MPs – Yana Micallef Stafrace and Caroline Farrugia Frendo – and others were employed in the private offices of Labour MPs who are lawyers by profession.\nThe government has come under increasing pressure to change the system of appointing members of the judiciary, which has been in place since the 19th century, to ensure it was no longer directly involved.\nBoth the EU and the Council of Europe have recommended a reform and a judicial reform committee had suggested a new system in 2013.\nThe Prime Minister and the Justice Minister have repeatedly said they would implement changes “soon”, however, these have yet to happen. As things stand, judges and magistrates are effectively chosen by the Prime Minister.", "comment_count": 80, "id": 1597}, {"keywords": "", "author": "", "article_body": "The following are the main stories in Friday’s newspapers.\nTimes of Malta says the Contracts Department is being accused of “illegally” removing a crucial clause in a multimillion euro cleaning tender offer that would have excluded companies with tax arrears. In another story, the newspaper says the price of housing in Malta grew by almost four per cent in the last three months of last year, the third-highest rate in Europe.\nThe Malta Independent says that while the European Commission is saying that all is well and good with the issuing of Maltese Schengen visas for Algerians in 2016/7, it has ignored the fact that thousands of visas were issued by Malta’s consulate in Algiers without the right checks and balances in 2014/5.\nL-Orizzont speaks to activists who express concern that racial hate in Malta is on the increase.\nIn-Nazzjon says Health Minister Chris Fearne has been caught lying regarding plans to bring to Malta injured Libyans for treatment.", "comment_count": 0, "id": 1598}, {"keywords": "", "author": "Jacob Borg", "article_body": "The Gozo Business Chamber has welcomed the presentation of a government motion seeking bipartisan support for the tunnel project.\nThe motion, presented by Transport Minister Ian Borg and Gozo Minister Justyne Caruana, notes that the introduction of a permanent link between Malta and Gozo was a commitment made by both political parties in their electoral manifestos.\nIt acknowledges the challenges the project is likely to cause in terms of the waste generated and the need to preserve Gozo’s natural beauty and cultural identity. It calls on MPs to back the project.\nRead: Third would not pay more for Gozo tunnel if more expensive than ferry\nThe Gozo Business Chamber urged the government and the Opposition to keep their promises and continue with the commitment for the necessary preparations for the project to be implemented.\nThe current proposal is for a 13 kilometre-long tunnel with a seven metre radius and one traffic lane heading in either direction, with an additional safety lane. Traffic analysts predict that about 6,500 vehicles will use it every day.\nHighlighting the bipartisan efforts for such a link, the Gozo Business Chamber said work on the link had been ongoing for several years enjoying the full support of every party that was in government. Studies had shown that the subsea tunnel was the best option for a permanent link between the two islands in a project that would benefit Gozitans and Maltese alike, it continued, noting with satisfaction that all the necessary studies had been undertaken.\nWatch: Gozo tunnel will be built and run by the private sector\nIt said it agreed that the project be carried out in the most sustainable manner possible as part of an overall strategy to enhance Gozo’s socio-economic development and improve the quality of life of Gozitan residents.\nThe proposed link met with stiff opposition from environmental groups, who have demanded that all environmental studies linked to the project be published.\nThe Democratic Party is the only party represented in Parliament to express opposition to the project. It said the tunnel would have a severe environmental impact and would turn Gozo into a mecca for property speculators.", "comment_count": 26, "id": 1599}, {"keywords": "", "author": "Ivan Camilleri", "article_body": "Updated at 11.30am, adds MEA statement\nUpdated at 7.45pm with government statement\nThe Contracts Department is being accused of “illegally” removing a crucial clause in a multi-million euro cleaning tender offer that would have excluded companies with tax arrears.\nThe move raised concerns within the industry, fearing it was done to favour a particular company that owes the Exchequer millions in unpaid taxes.\nServizi Malta Ltd, an established cleaning company, has formally asked the Public Contracts Review Board to stop the tendering process and order the Department of Contracts to reverse its “illegal” intervention in violation of public procurement rules.\nRead: Controversial St Vincent de Paul Residence cleaning tender suspended\nThrough its lawyers, Ganado Advocates, the firm said that, according to established EU criteria applicable to public tenders, companies or individuals interested in submitting an offer had also to present compliance certificates issued by the inland revenue, VAT and social security departments as proof they settled all their taxes and had no arrears.\nIn what is being deemed as an unprecedented intervention, the Contracts Department issued a ‘clarification’ stating that the clearance certificates from the government departments were not compulsory any longer upon submission of bids, as used to be the norm, but were only required before the successful bidder signed the contract.\nAn inconsistency in the document\nThe clarification was issued as the process for a new €12 million-cleaning contract for St Vincent De Paul Residence, in Luqa continues.\nIn a strongly worded protest to the review board, Servizi Malta said: “It is extremely worrying that the Department of Contracts appears to be willing to make concessions on the submission of one certificate that confirms that the relevant economic operator has paid all VAT and social security contributions, respectively. In view of the financial commitments indicated [in the tender], the requirement for the production of these certificates upon submission of bids is not only proportionate but a must.\n“Bidders should have, as a bare minimum, paid all VAT and social security contributions due and if any one prospective bidder is falling behind on such payments, it should not even bother to submit an offer for the tender.”\nThe Department of Contracts denies it acted illegally, justifying its intervention. “The clarification has been rightfully issued in that it corrected both an error and an inconsistency in the [tender] document,” director general Anthony Cachia argued.\nTimes of Malta reported last month that the sole director of X-Clean Ltd, Denis Xuereb, owed the Inland Revenue Department more than €4 million in arrears. The company currently provides cleaning services at the Luqa home for the elderly.\nX-Clean had been awarded the contract by direct order and the Department of Contracts approved its renewal every few months since 2015, against public procurement rules. Over the whole period, the contractor received more than €9 million in payments from the government.\nA new invitation for tenders was issued last December, the Department of Contracts saying it took so long to make a fresh call because the document was very complicated to draft.\nMEA 'shocked'\nThe Malta Employers’ Association expressed shock and disapproval at the shifting of  goalposts. \nThis move, it said, discriminated against the concept of fair competition and raised strong suspicion that it was intended to favour particular bidders who would have failed to be compliant with the terms of the tender.\n\"Compliance certificates should be a must to ensure that tax payers’ money is being paid out to operators who have no tax arrears.\n\"This intervention by the contracts department does not inspire confidence in the business community that tenders are being adjudicated fairly,\" it said.\nThe association called for an immediate retraction of the Contracts Department’s revision and for the reinstatement of the clause that excludes companies with tax arrears from bidding for public contracts.\nIt added that such actions were eroding business confidence to the detriment of law abiding companies and their employees.\nGovernment insists procedure has not been changed\nThe government said in a statement on Friday evening that at no point in time was any “crucial tax clause” removed. It said that requesting compliance certificates \"was and still is\" an integral part of the procurement process, and that the Department of Contracts intervention was there to ensure the least bureaucratic practices for bidders. \"The practice adopted by the Department of Contracts ensures that no government contract is signed with bidders who do not comply, among others, with their tax and social security contributions.\n\"Hence, contrary to what the title implies, the policy of requesting compliance certificates upon the submission of bids has not been removed since the practice has always been to require them only from the winning bidder.\"", "comment_count": 40, "id": 1600}, {"keywords": "", "author": "", "article_body": "A video compiled by a British company has captured life in Malta in the 1930s, when people trotted through Valletta in a karozzin, as goats were milked at people’s doorstep.\nKinolibrary is an archive agency, licensing remarkable and rare archive footage from around the world.\nApart from the glimpses of a lifestyle that has since disappeared, some of the shots capture the dramatic changes in the urban spread.\nOne shot taken from the bastions where the Hotel Phoenicia now stands show the tip of Sa Maison, Ta’ Xbiex and Manoel Island, unrecognisable because of the depth of field which makes has erased the different perspectives.\nCars can be see driving through the old City Gate, and the Union Jack flies over San Anton Palace, where couples stroll wearing hats and formal suits.\nAt one point in the four-minute feature, St Luke’s Hospital – whose foundations were laid in April 1930 – can be seen on the hill, still new and gleaming. Navy ships and military trucks can be seen in many shots, with uniformed servicemen strolling in various locations.\nTo see more clips from Kinolibrary's collection visit thekinolibrary.", "comment_count": 77, "id": 1601}, {"keywords": "", "author": "", "article_body": "A man was found dead in a Xlendi apartment on Thursday evening.\nA police forensics team was deployed soon after the grim discovery was made as investigators sought to establish the cause of death.\nPolice said the victim was an elderly foreigner who had not been heard of for two days.\nThe police went to investigate after his family raised their concerns.\nNo signs of violence were seen. ", "comment_count": 3, "id": 1602}, {"keywords": "", "author": "", "article_body": "Nationalist MP Ivan Bartolo insisted in parliament on Thursday that those who make mistakes should move aside, especially when their actions impact on their colleagues and undermined their collective credibility.\nSpeaking in general terms and without mentioning anyone, Mr Bartolo said in parliament that all people, but especially those in public life needed to respect ethical and moral standards in what they said and did.\nPoliticians, in particular, needed to be loyal and ethical, fully in line with the commitments given to the people who elected them and the principles which their party espoused.\nTheir behaviour needed to instil confidence and credibility.\nUnfortunately, Mr Bartolo said, a stage had been reached where all politicians, of both sides of the House, were not tarred with the same brush.Well-meaning politicians who spent most of their time seeking to help other people were rightly offended when they were increasingly labelled with other politicians who put personal interests first.\n\nOne should not see all politicians in the same way – just as one should not label all priests in the same way because of the abuses of the few.\nOne could not criticise the government while doing worse. One could not be credible in hitting out against corruption – which existed in every corner of this country – if his own behaviour was called into question.\nThose whose behaviour did not meet the ethical, moral and legal standards expected of them and who did not even realise the harm they were causing to their colleagues and their party not only had no credibility, but their ignorance was incredible.\nIt was good that the House had appointed a Commissioner for Standards in Public Life, but ultimately it all boiled down to how honest and ethical one was.\nHe had no doubt, Mr Bartolo said, that most people wanted what was good for their country and society but it was a shame that many were getting disheartened, even giving up, because of what they saw.\nThe Nationalist Party, he said, had a glorious history of serving the common good. Those who represented the party, by their behaviour, were worthy representatives of the people.\nOne only needed to remember how (former party president) Victor Scerri resigned (following controversy about a permit application for his countryside house in Baħrija) even though he had done nothing illegal, as subsequently shown in court.\nIt was when people in public life were seen as being part of a gang of thieves, when their behaviour was not correct or ethical, that people became disillusioned – to the extent that eventually what was unacceptable became tolerated and values were turned upside down.\nHe would not be part of what was happening and in good conscience, would continue to speak his mind, Mr Bartolo said. Truth ultimately triumphed and karma existed.\nBut those people who saw their own organisation – whether it was a party or a church - crumbling and still acted in an unacceptable manner only compounded the damage. It was useless of them to preach morality, because morality had to be practised.\nHis hope was that such people would be seen for what they were and be blown away by voters. Those who raised a storm should expect to get wet.\nIf one really loved the organisation one represented, and if one’s behaviour was such that credibility was undermined and colleagues are harmed, then they should move aside and not cause more harm, Mr Bartolo said.", "comment_count": 26, "id": 1603}, {"keywords": "", "author": "", "article_body": "Two men have been arrested after a sizeable drugs find by the police.\nA 25-year-old man from Birkirkara was stopped by police who found 5kg of suspected cannabis packed in blocks in his car.\nThe drugs appeared ready for trafficking.\nIn a further search by the police in a farm in Mosta, administered by a 42-year-old from Mosta, the police found another 10kg of suspected cannabis.\nA magisterial inquiry is under way.", "comment_count": 1, "id": 1604}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A lawyer, who allegedly made a series of threats against former colleagues at a local law firm, sent some 87 pages of threatening mail, a court was told on Thursday.\nBartosz Marcin Adruszaniec, a 42-year old Polish national who ended up a squatter in abandoned premises lacking water and electricity, was back in court after being remanded in custody following his arraignment earlier this month.\nHe is pleading not guilty to charges of harassment, blackmail and threats, instilling fear in the partners and other employees at the firm where he was formerly engaged on a consultancy contract.\nOther charges relate to a simple theft from a shop and an attempted robbery from a private residence at St Paul’s Bay.\n“You have now unleashed me,” Mr Adruszaniec had stated in one of his threatening messages to the firm, after his employment had been terminated following reports of “certain behavioural issues.” Colleagues and clients had claimed the man would turn up at work under the influence of alcohol.\nReference was made to some 87 pages of emails and messages sent by the accused who allegedly vouched that he was prepared to go to jail “on[his] life” and threatening with “the revenge of a strong northern lad.”\nRead: Lawyer tried to burgle a house in St Paul's Bay, court told\nAs one of the partners at the firm as well as the HR manager took the witness stand, the court, presided over by magistrate Gabriella Vella, was given an account of the chain of events which escalated to such a degree as to instil fear in the staff. The firm resorted to beefing up security while filing a police report. \nThe accused allegedly bombarded his former colleagues via WhatsApp and email, making indirect threats by referring to the assassination of Daphne Caruana Galizia and also posting an image of a burnt house with the name of the locality where one of the partners resided.\nMatters became even worse when he extended his messages towards one of the partners’ wife, who was told about an alleged adulterous relationship by her husband.\nHe even allegedly wrote to clients, bad-mouthing his former employers in an attempt to damage their reputation. \nMeanwhile, the court was informed that a relative of the accused, also a lawyer in Malta, had declared that he was not authorised to act on his relative’s behalf and was not inclined to do so.\nThe case was adjourned to April 25.\nLawyer Graziella Tanti is defence counsel.\nLawyer Stefano Filletti is appearing as parte civile for the law firm.\nInspector Clayton Camilleri is prosecuting.", "comment_count": 0, "id": 1605}, {"keywords": "", "author": "Philip Leone Ganado", "article_body": "The architect behind the valuation for the controversial Café Premier buy-out  has been appointed to the Planning Authority board in a reshuffle that also sees marine archaeology expert Timmy Gambin leaving the post.\nTwo new appointments to the Planning Board – which decides on major development applications – were announced in The Government Gazette this week after the expiration of its members’ three-year terms.\nArchitects Duncan Mifsud and Deborah Busuttil, a member of the Transport Malta board, replace Prof. Gambin and lawyer Desiree Cassar, while the remaining members of the board have all been reappointed.\nMr Mifsud, a former Labour Party election candidate in 2008, had been tasked in 2013 – as director of the Joint Office – with drawing up the valuation for an eventual €4.2 million government buy-back of the Café Premier lease.\nGambin to focus more directly on his main area of expertise\nA National Audit Office investigation harshly criticised poor governance in the way the Office of the Prime Minister controlled negotiations. It did not criticise the valuation, which it said was a fair market price, but expressed reservations over whether it represented value for money. Mr Mifsud has also served as chairman of a government committee tasked with evaluating major land reclamation proposals submitted in 2013 after a  call for expressions of interest, as well as on other government boards and bodies.\nMeanwhile, Prof. Gambin, who was considered one of the more environmentally-minded voices on the board and who is stepping down after his three-year term, told the Times of Malta yesterday the move was related to his taking up a new post in underwater heritage at Heritage Malta.\nThis, he said, would allow him to focus more directly on his main area of expertise.\nApart from the two new appointees, the rest of the board is made up of chairman Vince Cassar, deputy chair Elizabeth Ellul, and government appointees Jacqueline Gili, Simone Mousu, Ivan Tabone, Matthew Pace and Joseph Brincat.\nIt also includes Labour MP Clayton Bartolo, Nationalist MP Marthese Portelli, Environment and Resources Authority chairman Victor Axia, and NGO representative Annick Bonello.  ", "comment_count": 45, "id": 1606}, {"keywords": "", "author": "Edwina Brincat", "article_body": "Statements given to the police by three men accused of conspiracy in drug trafficking may not be read out to jurors because they were given when the accused were not assisted by a lawyer, an appeals court has ruled. \nThe appeal was filed by the attorney general.\nThree alleged drug-trafficking conspirators - Rio Micallef, 26, from Marsa, David Tabone, 25, from Naxxar and Darren James Vella, 19, from Birkirkara - are awaiting trial over their alleged involvement in a drug-trafficking conspiracy in 2008. \nThe attorney general had requested authorisation to read out the statements made by the co-accused when spoken to by the police as suspects even prior to their interrogation.\nThat request was turned down by the Criminal Court, the decision being confirmed by the Criminal Court of Appeal, which reaffirmed that allowing the reading out of such statements by the suspects when not assisted by their trusted lawyer, would amount to a breach of their right to a fair hearing.\nLawyer Franco Debono is counsel to Mr Micallef.\nLawyer Arthur Azzopardi is counsel to Mr Tabone.\nLawyer Michael Sciriha is counsel to Mr Vella.", "comment_count": 2, "id": 1607}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Georgian man who was carrying €35,058 in cash while on his way to catch a flight at Malta International Airport has had €25,058 confiscated by a court after he was convicted of not having declared that he was carrying more cash than allowed by the law.\nMerab Beridze, 47, was also fined the statutory 25% fine on the full amount which worked out at €8764.50. \nMr Beridze was arrested last Tuesday. In terms of the law, travellers cannot carry more than €10,000 in cash.\nInspector Keith Vella prosecuted.\nLawyer Josette Sultana was legal aid counsel.", "comment_count": 0, "id": 1608}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A Neapolitan man, who went on a half-hour shopping spree using a credit card he claimed to have found on the ground, was handed a suspended sentence after eventually admitting to the theft.\nCiro Napolitano, a 24-year old residing at Sta Venera, was arraigned over the aggravated theft which allegedly took place earlier this month when the accused spent half an hour, shopping around Valletta and clocking up a bill of some €4,500 to the detriment of the holder of the credit card.\nProsecuting Inspector Jeffrey Scicluna pointed out that the accused had returned the stolen money and had cooperated fully with the police, adding that a suspended sentence would be adequate, a suggestion also backed by the defence counsel.\nIn the light of these submissions the court, presided over by magistrate Neville Camilleri, declared the accused guilty upon his own admission and condemned him to a 2-year jail term suspended for three years.\nLawyer Roberto Montalto and legal procurator Joeline Pace Ciscaldi were defence counsel.", "comment_count": 0, "id": 1609}, {"keywords": "", "author": "Edwina Brincat", "article_body": "The young woman was remanded in custody after denying that she had robbed and slightly injured a man with a physical impairment.\nKimberlyn Xuereb, a 25-year old Cospicua resident, was arraigned in court on Thursday over charges of aggravated theft, slight injuries, carrying a weapon during the commission of the offence, attacking and threatening her alleged victim as well as breaching the terms of four suspended sentences.\nThe court, presided over by magistrate Ian Farrugia, heard how the accused had allegedly committed the violent mugging in Valletta in February, making off with her victim’s wallet which contained credit cards and cash.\nProsecuting Inspector Priscilla Caruana Lee explained how the police had initially been unable to trace the culprit, since the suspect had  changed address. However, she was recognised on Wednesday and taken into police custody.\nThe woman pleaded not guilty and requested bail, her legal aid lawyer - Graziella Tanti - pointing out that the accused had been regularly attending meetings with a probation officer and was registering progress.\nAfter hearing submissions on bail, the court turned down this request in view of the fact that the  victim was still to testify and also in view of the woman’s untrustworthy character.", "comment_count": 0, "id": 1610}, {"keywords": "", "author": "", "article_body": "The wreckage of the pleasure craft that caught fire and sank off Bighi last week was recovered from the sea bed on Wednesday afternoon.\nThe operation involved divers and specialised equipment, and was monitored by Transport Malta officers from the Vessel Traffic Services, Port Inspectors Unit and Maritime enforcement officers. \nThe wreckage has been towed ashore and placed on land for further investigations.As soon as the police gave their authorisation, Transport Malta instructed the owner to remove the wreckage, as soon as possible, to minimise any associated risks or dangers.\nThe blaze had been contained by the rapid reactions of marina staff, who towed the boat out of the marina, where it eventually sank, after which an army of people from Transport Malta, the Civil Protection Department and other entities, who collected debris and monitored pollution, got involved.A thin sheen formed off Kalkara following the accident, however, nothing could be done to recover it. The sheen has since evaporated and dispersed naturally.\nPhotos: Transport Malta", "comment_count": 4, "id": 1611}, {"keywords": "", "author": "", "article_body": "A particularly cool February closed off the meteorological winter season, which saw temperatures peak early at 19.4°C in the beginning of December, and drop gradually to reach a seasonal low of 3.7°C towards the end of February.\nHowever, according to the Meteorological Office at Malta International Airport, the air may have felt crisper than usual, but the season’s mean air temperature was only fractionally lower than the norm of 13°C, averaging 12.7°C.\nIn its round-up of the winter weather highlights, the Met Office said that while the past season may have also seemed wetter than the norm, the three-month period in fact registered slightly below-average rainfall, receiving 223 millimetres of rain, as opposed to the seasonal average of 247.8mm.\nAn exceptionally dry December turned out to be the calm before the storm, with more than triple the amount of rain in December pouring down in the first month of 2019 to amount to 99.8mm of rainfall.\nPunctuated by episodes of strong wind and stormy weather, the winter months saw wind gusts reach 54 knots on February 24, but otherwise maintained a slightly-above-average mean wind speed of 10 knots.\nDespite the odd wet or stormy spell, the winter months were far from sun-deprived, with an average of 6.4 hours of sunshine gracing Malta’s skies every day. Racking up a total of 578.1 hours of sunshine, the past winter season surpassed the seasonal sunshine norm by 75 hours.\nThe Meteorological Office also reported seven hailstorms, this being slightly higher than the norm of five occurrences of hail.\nMarch Highlights\nThe start of spring has brought with it drier and warmer weather to the Maltese islands. The month of March received 34.6mm of rainfall, 10.8mm of which fell on March 21st, while registering a mean air temperature 0.6°C higher than the climate norm, this year reaching 14.5°C.\nA light cloud cover, averaging 3.4 oktas, settled over the islands during March, allowing both locals and tourists to soak up an average of 7.5 hours of sunshine per day, amounting to an above-average total of 232.7 hours of sunshine being recorded by the end of the month.\nWhile no sunshine was recorded on the 21st, 22nd or 27th of the month, the 11.1 hours of bright sunshine recorded on March 26 seemingly made up for a rather dull week, making this particular day the brightest of the month.\nThe month both started and ended on a chilly note, seeing the air temperature drop to 9°C on March 6 and 28. March 9, on the other hand, became the month’s warmest day when the mercury hit 21.8°C.\nAt 15.8°C, the mean sea temperature during March was also warmer than the climate norm for this time of year.\nWith an average wind-speed of 9.9 knots, March was also slightly windier than expected, with the highest wind gust for the month, blowing from a north-west by north and north-north-west direction, reaching 49 knots on March 12.", "comment_count": 0, "id": 1612}, {"keywords": "", "author": "Matthew Xuereb", "article_body": "Popular Italian entertainer Gianni Morandi said he was “very excited” about his first live concert in Malta on Friday.\nMr Morandi told Times of Malta he was also thrilled about being in Malta, an island close to Italy with which it has “amazingly close ties”.\n“I am very excited to be here to perform alone for the first time after a previous show many years ago when I sang with others. I love Malta. I would love to come here on holiday one day and bring my wife who, unfortunately, is indisposed and could not join me on this trip,” he said.\nThe famous Italian singer, songwriter and actor will be performing live at the Malta Fairs and Conventions Centre in Ta’ Qali.\nThe two-hour show, which will surely be music to the ears of the so many fans he has in Malta, will feature more than 40 tracks from Mr Morandi’s repertoire forming a playlist that would retrace the fundamental stages of his 60-year career.\nThey include Occhi di ragazza, Scende la pioggia, La fisarmonica, Non son degno di te, Uno su mille, Dobbiamo fare luce, and Una vita che ti sogno. These last two tracks are part of Mr Morandi’s 40th album D’Amore e D’Autore, in which he interprets songs of love.\nAsked how he remembers the lyrics of his more than 600 songs, Mr Morandi admitted he did not.\n“Well, I don’t remember all of them. There are the 100 or so which I sing all the time so those come automatically, but there are others which I need to study before a performance. And I’m not getting any younger you know,” he said.\nAsked what his plans were for the near future, Mr Morandi said it all depended on his health.\n“I will now spend the next three or four months on an island in Sardinia shooting L’Isola di Pietro [The fiction in which he plays the paediatrician which last season had great success on Canale 5]. After that, I hope to continue with concerts because music is my life,” he said.\nMr Morandi made his debut in 1958 when, at the age of 13, he sang with the orchestra Scaglioni di Bologna. Four years later, he won the Bellaria festival and released his first song Andavo a 100 all’ora, and that was when his music career exploded.\nMr Morandi last came to Malta in the late 1960s.\nHe took part in the most prestigious festivals in his country and has given unforgettable shows in major theatres and arenas, not only in Italy but worldwide, including Japan, Australia, Canada, China, Argentina and Russia.\nFatti Mandare dalla Mamma, Scende la Pioggia, Uno su Mille and La Fisarmonica are known by all, especially those who grew up listening to his songs in the 1970s and 1980s.\nHe sold 53 million records, has a total of 608 songs with 230 collaborations and held more than 4,200 concerts in Italy alone.\nThe concert in Malta is being organised by the Giuseppe Rapisarda Management.  ", "comment_count": 5, "id": 1613}, {"keywords": "", "author": "Edwina Brincat", "article_body": "A 23-year-old man was remanded in custody after pleading not guilty to engaging in sexual acts with a 14-year-old boy and involvement in child pornography.\nAlexio Camilleri, unemployed, was taken to court on Thursday to face charges including of participating in sexual activities with the underage boy, producing pornographic material featuring minors, and misuse of electronic communication equipment.\nProsecuting inspectors Joseph Busuttil and Stacy Attard told the court that the man had a “friends with benefits type” relationship with the boy, whom he would contact to meet for sex and then pay him some €220.\nAlthough few other details emerged during the arraignment, the accused allegedly exchanged indecent images with four other underage persons.\nDefence lawyer Luciano Busuttil requested bail, saying the accused could be kept under house arrest if necessary. He asked for a ban on publication of the name as the victims were well acquainted with the accused and could be identified through him.\nHowever, bail was objected to by the prosecution in view of the fact that five minors were still to testify and possibly others emerging in the course of ongoing investigations.\nAs for the request for banning the man’s name from publication, Inspector Busuttil said that while it was true that the accused knew the minors, their relationship was not such as to expose the alleged victims to identification.\n“Those outside their circles wouldn’t know. Those within already know.”\n“They’re friends with benefits. He’d call them up and pay for sex. The other four he’d exchange photos with on social media. This wouldn’t be helped by house arrest,” added the inspector.\nThe court denied the request for a ban on publication, saying the necessary elements required at law were not present. The court also turned the request for bail in view of the fact that civilian witnesses were still to testify and also on account of ongoing investigations by the police.", "comment_count": 0, "id": 1614}, {"keywords": "", "author": "Keith Micallef", "article_body": "Last updated 4.40pm, adds PN statement - \nA Health Department ‘policy’ that an unborn baby is not recognised as a person at law has raised questions on the government’s intentions on abortion, despite the Prime Minister’s repeated denials it had no plan to legalise such a practice.\nOn Thursday, the department categorically stated that it did not have any policy which favoured abortion.\nLast year, the Department of Health refused to cover the travel expenses of a pregnant woman who required urgent treatment abroad.\nAggrieved by this reply, the woman sought redress with the Commissioner for Health within the Office of the Ombudsman. Nonetheless, the department did not budge on the matter, until it was warned that its policy ran counter to a civil court judgment given by Mr Justice Lawrence Mintoff in 2015.\nDetails on this case were published in a report on Thursday by the Ombudsman which outlines some of the complaints filed in 2018. A copy of this report was presented by Ombudsman Anthony Mifsud to the Speaker of the House of Representatives Anġlu Farrugia.\nIt transpired that during her pregnancy the woman was told that she needed to go to the United Kingdom for treatment, after being diagnosed with a condition which would necessitate an urgent operation immediately after giving birth.\nHowever, prior to departure, the parents were told by the Health Department they were not going to be reimbursed for the airfares, in line with an existing policy regulating cases of babies or children under 18 years. The reason was that at the moment of departure the baby had not yet been born.\nA right to a clarification\nAfter lodging a complaint with the Health Commissioner, the department agreed to pay the costs for the baby’s return flight from the UK to Malta, but not of the parents.\nThe commissioner disagreed with the decision on the grounds that the patient was the unborn baby, and consequently the parents’ airfares should have been covered as well. Eventually, the department accepted to reimburse the parents’ inbound flights.\nNonetheless, the department kept insisting it would not reimburse the outbound flights on the grounds that “a baby in utero is not recognised as a person at law”.\nThe response prompted the commissioner to remark that such interpretation made no sense at all.\nIf an unborn baby is not considered a person, on what does the surgeon operate when the ministry sends pregnant women for treatment abroad, before delivering their baby in Malta, the Commissioner questioned.\nFurthermore, the Commissioner referred to a 2015 judgment in which Mr Justice Mintoff had ruled that an unborn baby had its rights and that once conceived he/she was not an object but a person.\nIt was only at this stage, the department accepted to cover the outbound flights as well.\nIn his remarks, Commissioner for Health Charles Messina described the Health Department’s categorical statement on the unborn child as “unacceptable”.\nApart from opening the entire contested issue of whether the human foetus had a right to the protection of law, it compromised the ongoing debate on whether abortion should or should not be entertained at any stage, he said.\nThis statement goes well beyond what various strata of the political spectrum to date publicly have stated to be their stand on this matter, the commissioner remarked.\nHe added that citizens had the right to a clarification on the matter and to be informed whether such a statement was the government’s official position.\nThe Commissioner also made some points on the 2015 judgment, saying it merited further study and debate as it correctly enunciated the existing legal position.\nMr Messina expressed his opinion that this judgment ran counter to the Health Department statement that the human foetus did not enjoy any rights.\nNo policy which favours abortion - health department\nHowever, in a statement on Thursday, the Health Department said it had intervened to save the life of a yet unborn child by facilitating, organising and, paying for treatment abroad.\n\"How saving a newborn’s life can by any stretch of the imagination lead the Commissioner for Health to relate this episode to a discussion on abortion, which is the exact opposite of saving a life, escapes comprehensibility,\" it said.\nThe department insisted it did not have any policy which favoured abortion.\nCommissioner for Health welcomes statement\nThe Commissioner for Health in a reaction told Times of Malta that he welcomed  the categorical statement by the Department for Health that it did not have any policy which favoured abortion. \nPN: Time to strengthen the rights of babies in the womb \nThe Nationalist Party said the report was a wake-up call that the rights of babies in the womb need to be strengthened. \nShadow minister Claudio Grech said the country needed to launch a process to ensure that the rights of the unborn were recognised, protected and improved so that there would be no legal grey areas.  \nThe very fact, as shown in this report, that the authorities were uncertain about whether an unborn baby was a person was a clear indication that the laws needed to be clarified. Once it was accepted by everyone that the start of life was conception, the baby's rights needed to be safeguarded from that point. \nThe PN said it welcomed remarks by President George Vella on the value of life. Once there were no grounds for abortion, political parties and social partners should work together against abortion and towards making Malta a model EU state where the baby in the womb was given the dignity and protection it deserved. ", "comment_count": 9, "id": 1615}, {"keywords": "", "author": "Denise Grech ", "article_body": "Significant improvements are needed to put waste management in line with the waste hierarchy, a report by the European Commission has warned.\n“Malta has not capitalised yet on turning waste into resource and low recycling rates into business opportunities,” the report warned.\nThe country report on the Environment Implementation Review (EIR), published earlier in April, provided an update to the 2017 recommendations that had been made by the Commission.\nSince the 2017 EIR, Malta has yet to organise a national dialogue that could address the challenges listed that year.\nThe report noted progress on meeting the recommendations, but warned significant improvements needed to be made to put waste management in line with the waste hierarchy.\n“The recycling rate is too low, far below the EU average and the landfill rate remains too high – over three times the EU average,” the report warned. Urgent reforms and enforcement actions are needed in important areas such as waste collection, the report said.\n“Malta has not capitalised yet on turning waste into resource and low recycling rates into business opportunities,” it said.\nIt noted some progress in addressing air quality and traffic congestion but said reducing emissions was still a pressing issue.\nThe report also warned further action was needed to reach habitats and species’ conservation objectives. \nThe report insisted that hunting and trapping practices must be aligned with the Birds Directive. In June, the EU Court of Justice ruled that by allowing the capture of seven species of finches, Malta has failed to fulfil its obligations under EU law.", "comment_count": 9, "id": 1616}, {"keywords": "", "author": "Vanessa Macdonald", "article_body": "The time it takes Maltese businesses to get paid has been steadily going down but, at 78.58 days in 2018, it remains considerably longer than the European business-to-business (B2B) average of 34 days.\nThe Malta Association of Credit Management reported that a year before, Maltese businesses had been waiting 82.30 days. However, it compared this to the European average as reported in Intrum Justitia’s European Payment Index for 2018, which said the countries in its survey had gone down from 37 days in 2017 to 34.\n\nThe Late Payment Directive recommends that payment periods for companies to be at most 60 days and for public authorities 30 days.\nThe Intrum report also said that transactions with the public sector still take longer than B2B ones: 40 days on average, despite the fact that the Late Payment Directive makes 30-day payment terms mandatory.\nThe European Payment Report is based on a survey conducted across almost 10,000 companies in 29 European countries (excluding Malta) between January and March 2018.\nAn average of 13% of European outstanding bills are said to be paid late, according to the report. It makes sobering reading as 1.69% of annual revenue had to be written off in the past 12 months (down from 2.14% in 2017 and 2.44% in 2016).\nHowever, in most countries, payment times are shrinking – slowly moving towards the desired 30 days.\nNevertheless, 28% of the Intrum respondents surveyed experience late or missing payments as hindering growth and 21% say that they are unable to hire new staff because their clients fail to pay them on time.\nSource: European Payments Report\nCompanies are reluctant to insist on payments being made on time and also hold back on collecting overdue amounts. Nearly six out of 10 of the companies surveyed say that they were asked to accept longer payment terms than they were able to manage in their daily operations, and more than half (56%) admitted to having accepted these demands.\nOnly 30% of the European companies surveyed in 2018 say that they hand over their outstanding invoices to a collection agency.", "comment_count": 8, "id": 1617}, {"keywords": "", "author": "", "article_body": "Police were not ruling out the possibility of arson after three cars and a motorcycle went up in flames early Thursday.\nA Peugeot, Ford, Nissan and a motorcycle caught fire last night in Triq il-Vittmi tal-Gwerra, Birkirkara.\nPolice were informed about the incident at 5.30am.\nThere were no injuries.\nA spokeswoman for the police said the possibility of arson was not being ruled out.\nA magisterial inquiry would determine the reason behind the incident.", "comment_count": 0, "id": 1618}]